[
    {
        "title": "The fight for the Arctic - where climate change is giving Russia room to manoeuvre",
        "description": "The twin threats of climate change and Russian malign activity in the Arctic must be taken \"deadly seriously,\" David Lammy has warned.",
        "url": "https://news.sky.com/story/the-fight-for-the-arctic-where-climate-change-is-giving-russia-room-to-manoeuvre-13376706",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-svalbard-norway_6930846.jpg?20250529235214",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-05-29 22:17:00",
        "Headline": "Sky News joined David Lammy on the furthest reaching tour of the Arctic by a British foreign secretary. We travelled to Svalbard - where melting ice is giving Russia more freedom to manoeuvre. ",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  The twin threats of climate change and Russian malign activity in the Arctic must be taken \"deadly seriously,\" David Lammy has warned. Sky News joined him on the furthest reaching tour of the Arctic by a British foreign secretary. We travelled to Svalbard - a Norwegian archipelago that is the most northern settled land on Earth, 400 miles from the North Pole. It is at the heart of an Arctic region facing growing geopolitical tension and feeling the brunt of climate change. Mr Lammy told us the geopolitics of the region must be taken \"deadly seriously\" due to climate change and \"the threats we're seeing from Russia\". We witnessed the direct impact of climate change along Svalbard's coastline and inland waterways. There is less ice, we were told, compared to the past. The melting ice is opening up the Arctic and allowing Russia more freedom to manoeuvre. \n                  'What did they do to be burned and bombed?': Charity calls on UK to offer Gaza children life-saving treatment\n                 \n                  UK charity calls on government to rescue two children in Gaza\n                 \n                  Israel accepts US Gaza ceasefire plan - while Hamas says it's 'under discussion'\n                 \"We do see Russia's shadow fleet using these waters,\" Mr Lammy said. \"We do see increased activity from submarines with nuclear capability under our waters and we do see hybrid sabotage of undersea cables at this time.\" In Tromso, further south, the foreign secretary was briefed by Norwegian military commanders. Vice Admiral Rune Andersen, the Chief of Norwegian Joint Headquarters, told Sky News the Russian threat was explicit. \"Russia has stated that they are in confrontation with the West and are utilising a lot of hybrid methods to undermine Western security,\" he said. But it's not just Vladimir Putin they're worried about. Norwegian observers are concerned by US president Donald Trump's strange relationship with the Russian leader too. Karsten Friis, a Norwegian defence and security analyst, told Sky News: \"If he's too soft on Putin, if he is kind of normalising relations with Russia, I wouldn't be surprised. \"I would expect Russia to push us, to test us, to push borders, to see what we can do as Europeans.\" Changes in the Arctic mean new challenges for the NATO military alliance - including stepping up activity to deter threats, most of all from Russia. More from Sky News:Trump doubles down on Putin criticismWhy Russian troops are gathering near 'fortress city' In Iceland, we toured a NATO airbase with the foreign secretary. There, he said maintaining robust presence in the Arctic was essential for western security. \"Let's be clear, in this challenging geopolitical moment the high north and the Arctic is a heavily contested arena and we should be under no doubt that NATO and the UK need to protect it for our own national security.\" This is also about distracting Russia, drawing away resources that could have been used in the war in Ukraine and deterring it in the future. Because the more Arctic opens up, the more this once pristine wilderness is becoming the arena of national rivalry and potentially conflict."
    },
    {
        "title": "Man, 53, charged over Liverpool parade incident",
        "description": "A 53-year-old man has been charged after a car was driven into a crowd at Liverpool FC's trophy parade.",
        "url": "https://news.sky.com/story/man-charged-over-liverpool-parade-incident-13375642",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-paul-doyle-liverpool_6930591.jpg?20250529173146",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-29 16:15:00",
        "Headline": "Paul Doyle is accused of two counts of wounding with intent, two counts of causing grievous bodily harm with intent, two counts of attempted grievous bodily harm with intent and one count of dangerous driving.",
        "Content": " A 53-year-old man has been charged after a car was driven into a crowd at Liverpool FC's trophy parade. Paul Doyle, from the West Derby area of Liverpool, has been charged with seven offences, Merseyside Police said. The businessman, who is a father-of-three, is accused of two counts of unlawful and malicious wounding with intent to cause grievous bodily harm, and two counts of causing unlawful and malicious grievous bodily harm with intent to cause grievous bodily harm. Doyle is also accused of two counts of attempted unlawful and malicious grievous bodily harm with intent to cause grievous bodily harm, and one count of dangerous driving. He is due to appear before Liverpool Magistrates' Court on Friday. The charges relate to six people, including two children. A wounding charge and an attempted grievous bodily harm charge relate to a child. A police car was outside Doyle's four-bedroom detached family home in the West Derby area on Thursday morning. According to his social media, he has travelled extensively, including to Japan, Fiji, India and Australia. Doyle has posted pictures of himself competing in triathlons, and climbing Mount Kilimanjaro.  Thousands of fans were gathered in Liverpool city centre on Monday to celebrate the Premier League champions' title win when a car struck a crowd on Water Street. Police said a total of 79 people were injured in the incident, with the youngest aged nine, and the oldest being a 78-year-old. Seven people remain in hospital in a stable condition. 'Huge volume of evidence' Chief crown prosecutor for the CPS Mersey-Cheshire, Sarah Hammond, told a news conference on Thursday that the investigation was at an early stage and a \"huge volume of evidence\" was being reviewed. \"This includes multiple pieces of video footage and numerous witness statements. It is important to ensure that every victim gets the justice they deserve. \"The charges will be kept under review as the investigation progresses.\" Police 'working tirelessly' Also at the briefing where the charges were announced was Assistant Chief Constable of Merseyside Police, Jenny Sims, who said: \"I fully understand how this incident has left us all shocked and saddened, and I know many will continue to have concerns and questions. \"Our detectives are working tirelessly, with diligence and professionalism, to seek the answer to all of those questions. When we are able to, we will provide further information.\""
    },
    {
        "title": "Israel accepts US Gaza ceasefire plan - while Hamas says it's 'under discussion'",
        "description": "Israel has accepted a US-proposed plan for a ceasefire in Gaza, according to the White House, while Hamas says the deal is still \"under discussion\".",
        "url": "https://news.sky.com/story/israel-accepts-us-gaza-ceasefire-plan-while-hamas-says-its-under-discussion-13376680",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-israeli-tanks-army_6930405.jpg?20250529150007",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-29 20:55:00",
        "Headline": "The US proposal reportedly calls for a 60-day pause in fighting and the release of nine living hostages. Israel would retain the right to resume military action in Gaza.",
        "Content": "Israel has accepted a US-proposed plan for a ceasefire in Gaza, according to the White House, while Hamas says the deal is still \"under discussion\". Israeli news outlets reported earlier on Thursday that Benjamin Netanyahu had accepted the plan put forward by Donald Trump's Middle East envoy, Steve Witkoff, and told the families of hostages still in Gaza. It reportedly calls for a 60-day pause in fighting, and the release of nine living hostages and half of the known hostages who have died, over the course of a week. Israel and Hamas would then continue talks to bring the remaining hostages home, but Israel would retain the right to resume military action in Gaza if talks were to break down.  White House press secretary Karoline Leavitt later confirmed Israel \"backed and supported\" Mr Witkoff's proposal, but said talks were ongoing. Sami Abu Zuhri, a senior official for Hamas, told Reuters that the proposal failed to meet their demands - to end the war, for Israeli troops to withdraw from Gaza, and to allow aid into the territory. Another senior official, Basim Naim, said to the news agency, however, that the proposal was \"under discussion\". Read more:Hamas's Gaza chief 'eliminated', claims NetanyahuInside 'terrorised' West Bank village Gaza hospital told evacuate - doctor It comes as a doctor said the Israeli army wanted to evacuate al Awda Hospital - one of the last functioning medical centres in northern Gaza. Dr Rami al Ashrafi told the Associated Press that the hospital had been encircled by Israeli troops and had come under fire in recent days. He said there were 82 staff members, including doctors, and seven patients left at the hospital, after dozens were already evacuated on Tuesday. Israeli authorities issued evacuation orders last week for large parts of northern Gaza ahead of offensives against Hamas, although the army did not order the hospital itself to evacuate.  Third aid site opened It also comes as the Gaza Humanitarian Foundation expanded its aid distribution to a third site, as multiple Palestinians reported chaos at the hubs. Witnesses told the Associated Press they saw a free-for-all of people grabbing aid, and claimed Israeli troops opened fire to control crowds, at all three hubs. Read more:How the rollout of new Gaza aid system collapsed into chaos  Meanwhile, the names of thousands of children killed in Gaza were read out at a vigil held in Westminster - with actors including Steve Coogan and Juliet Stevenson taking part. Coogan told Sky News' lead world news presenter Yalda Hakim he was in London \"to protest about the, basically, enforced starvation of thousands of women and children in Gaza by the weaponisation of the blockade on aid to those people\".  More than 54,000 Palestinians have died during Israel's war in Gaza, which was launched after more than 1,200 Israelis were killed and a further 250 were taken hostage in a Hamas attack in October 2023. The figure comes from the Hamas-run Gaza Health Ministry, which does not distinguish between civilians and members of Palestinian armed groups. However, the ministry says the figure includes more than 12,000 dead children."
    },
    {
        "title": "'We carry our coffins with us': For Gaza's paramedics, every shift could be their last",
        "description": "In Gaza, the frontline is not just where the bombs fall - it's where the ambulances arrive.",
        "url": "https://news.sky.com/story/we-carry-our-coffins-with-us-for-gazas-paramedics-every-shift-could-be-their-last-13376580",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-paramedic_6930617.jpg?20250529181527",
        "type": "Home",
        "Author": "Alistair Bunkall, Middle East correspondent and Celine Alkhaldi, Middle East producer",
        "Date Published": "2025-05-29 16:43:00",
        "Headline": "Sky News has spent several days filming with emergency crews based at Shifa Hospital in Gaza. They say in a war where medics are no longer spared, every shift could be their last.",
        "Content": "By Alistair Bunkall, Middle East correspondent and Celine Alkhaldi, Middle East producer   In Gaza, the frontline is not just where the bombs fall - it's where the ambulances arrive. When an Israeli airstrike hit a busy market in Gaza City today, people were queuing for flour. Minutes later, medics were picking up body parts. The bodies were heaved onto stretchers, mutilated limbs twisted unnaturally. Blood soaked the concrete. Israel-Gaza latest: Netanyahu reportedly accepts US ceasefire plan Sky News has spent several days filming with emergency crews based at Shifa Hospital, Gaza's largest medical complex and one that has itself come under repeated attack. There are few paramedics left, and fewer ambulances. Fuel is low. Equipment is basic. They operate in one of the most dangerous places in the world, where the medics themselves are no longer spared. \"There is no safety\", says Hamdallah Ali Daher, a paramedic from Jabalia Camp in northern Gaza. \"When we respond to a strike, drones are still overhead. They targeted my colleague in one of our vehicles. You could be walking any day and get hit.\" The danger is constant. Daher describes how they operate under the hum of drones, often arriving at scenes where smoke still rises from the wreckage. \"We go out risking life and limb\", he says. \"We carry our coffins with us.\" 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 One of his colleagues, Alaa al-Hadidi, was killed in a drone strike in December last year. His fellow medics buried him. Israel has accused Hamas of using ambulances to move around Gaza disguised. Wael Eleywa, another paramedic, has worked throughout the more than 600 days of war. \"What affects us the most is the children\", he says. \"After a mission, you begin to imagine the injured children as your own relatives. These images stay with you and get mixed in your mind.\" \"Some of us have had to pull family members from the rubble.\" Read more:Charity calls government to rescue two children in GazaGaza doctor's nine children killedHow the new Gaza aid rollout collapsed He describes responding to scenes where tents have caught fire after a strike - children burned inside. \"There's no mental peace in this job\", he adds. \"But the work still needs to be done.\" The war, now nearing its twentieth month, has severely degraded Gaza's emergency response network. Many hospitals are no longer functioning. The roads are dangerous or impassable. The strikes come during the day and in the dark of night. Combat zones shift daily. \"There is no protocol anymore\", Eleywa says. \"We are medics in name, but the occupation doesn't distinguish between civilians, or paramedics or anyone else. Even with permits, they detain or target us.\" Daher echoes the plea: \"To all people, to all organisations - we need protection. We are trying to provide safety in a place where safety can't exist.\" Despite the horror, there is also resolve. \"We lean on and support each other as colleagues\", says Daher. \"Before the strikes, we're often together laughing, trying to lift each other up. Then the call comes, and we go.\" The medics speak with the matter-of-fact calm of those who have seen too much. As they race between ruins and hospitals, they know that each shift could be their last. \"In this field of work\", Eleywa says, \"we prepare for the worst, and go. Safety is out of reach.\""
    },
    {
        "title": "New blood test to 'revolutionise' NHS cancer treatment",
        "description": "A new ultra-sensitive blood test which can detect tiny fragments of tumour DNA could be \"revolutionary\" for NHS patients.",
        "url": "https://news.sky.com/story/new-blood-test-to-revolutionise-nhs-cancer-treatment-13376382",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-liquid-biopsy-rebeca_6930219.jpg?20250529115451",
        "type": "Home",
        "Author": "Megan Harwood-Baynes",
        "Date Published": "2025-05-29 10:52:00",
        "Headline": "Tens of thousands of patients could benefit from liquid biopsies, which give results up to two weeks faster than tissue biopsies. ",
        "Content": "\n          Social affairs and health reporter\n              @megbaynes\n A new ultra-sensitive blood test which can detect tiny fragments of tumour DNA could be \"revolutionary\" for NHS patients. Thousands of patients will be offered liquid biopsies, which can help fast-track lung cancer patients to receive targeted treatments. Tissue biopsies are used to confirm a diagnosis of lung cancer and samples can be sent for genomic testing. But liquid biopsies allow for results much faster, and can show patients if they have mutations. Rebeca Proctor, 41, was treated a suspected chest infection last December. After she began coughing up blood, she was diagnosed with stage four cancer - which she called a \"punch to the gut\". \"I was scared - I just thought about my children, and if I would get to see my little girl start nursery, and how I would explain my diagnosis to my children - it was just heartbreaking to think about,\" the mother of four from Carlisle said. A liquid biopsy showed she had an ALK genetic mutation of her non-small-cell lung cancer. A tissue biopsy took ten days longer to confirm the same result, but in the meantime she could begin a targeted treatment. New medication has \"given me my life back\", she says. \n                  Dementia: Sleep problems could 'double risk' of disease in later life\n                 \n                  The ins and outs of UK cannabis law - and calls to decriminalise it\n                 \n                  Extra cancer screenings for women with dense breasts could save hundreds of lives, study finds\n                 \"I'm taking it day-by-day and for now the treatment is doing what it's meant to be doing and shrinking the tumour, and I've got my energy back,\" she said. \"I know I'm not going to be cured but I've come to terms with my diagnosis and the pills are stopping my cancer cells from spreading - we'll keep fighting this and dealing with what's been thrown at us.\" Breast and lung cancers are two of the most common in England - around 90,000 people are diagnosed with one of them each year. Potential to 'scan' the body in a single blood test NHS England will become the first health service in the world to roll-out a \"blood-test first\" approach to diagnosing lung cancer, and it follows a successful pilot of the testing last year. Up to 15,000 patients could benefit. The NHS has also said it is expanding testing in advanced breast cancer, with several genetic variations now being screened for. It could save the health service up to £11m per year in lung cancer care. Read more:Could the UK decriminalise cannabis?Father loses wife and son to same heart conditionThe extra cancer screenings that could save hundreds Professor Peter Johnson, NHS national clinical director for cancer, said it would enable patients to receive \"more targeted and kinder care\", as it would enable some to avoid more intensive treatments - such as chemotherapy - in place of a more targeted approach. \"Liquid biopsies are leading us into a new era of personalised cancer care and it's fantastic that we are now able to expand the use of this revolutionary test on the NHS to help tailor treatment for thousands of patients across the country,\" he said. Liquid biopsies, he added, have the potential to \"scan\" the body in a single blood test. Professor Dame Sue Hill, Chief Scientific Officer for England, said: \"This testing is transforming care and helping clinicians match patients earlier especially when cancer tissue may not be available with potentially life-extending targeted therapies rapidly and with greater precision.\" The health secretary called it an \"incredibly exciting new test\" that could save countless lives. \"It is just the latest example of this government combining the compassionate care of our National Health Service with the ingenuity of Britain's leading scientific minds to revolutionise cancer care,\" Wes Streeting said."
    },
    {
        "title": "Former Sean 'Diddy' Combs assistant breaks down as she tells trial of alleged sexual assaults: 'I thought I was going to die with this'",
        "description": "A former employee of Sean \"Diddy\" Combs broke down in tears as she described being sexually assaulted by the hip-hop star on several occasions - telling the court the alleged abuse was \"the most traumatising, worst thing that's ever happened to me\".",
        "url": "https://news.sky.com/story/former-sean-diddy-combs-assistant-breaks-down-as-she-tells-trial-of-alleged-sexual-assaults-i-thought-i-was-going-to-die-with-this-13376585",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sean-combs-diddy-trial_6930676.jpg?20250529195629",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-29 17:02:00",
        "Headline": "Mia* - not her real name - is the second alleged victim to testify against Sean \"Diddy\" Combs, following his former partner Cassie's evidence in the first week. She told the trial she had never spoken about alleged sexual assaults until the investigation into the hip-hop star.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n A former employee of Sean \"Diddy\" Combs broke down in tears as she described being sexually assaulted by the hip-hop star on several occasions - telling the court the alleged abuse was \"the most traumatising, worst thing that's ever happened to me\". Three weeks into the trial, Mia* is the second alleged victim to testify against Combs, following his former partner Cassie's evidence alleging years of physical, sexual and emotional abuse. While Cassie waived her right to anonymity, Mia did not want to be identified and is appearing in court in Manhattan, New York, under a pseudonym. She started by telling the court about witnessing Combs, 55, being violent towards Cassie, before moving on to talk about her own experiences. Diddy trial day twelve - as it happened Mia told the court she once woke to find Combs on top of her and that he forced her to have sex against her will. Another time, he forced her to perform oral sex, she alleged. He also once threw a bucket of ice on her head and slammed her arm into a door on another occasion, she said. The court heard Mia had never told anyone about the alleged sexual assaults by Combs until she spoke to government investigators for this case. \"I was going to die with this,\" she said, becoming tearful on the stand. \"I didn't want anyone to know ever.\" Telling the court she could not say \"no\" to her former boss, she said: \"I knew his power. And his control. I didn't want to lose everything that I worked so hard for.\" She also said she feared being attacked and was \"always\" worried about being physically hurt by Combs. \"I didn't want to die or get hurt.\" Mia said she felt \"desperate\", \"terrified and trapped\" and described the alleged sexual assaults as \"the most shameful thing of my life\", and \"the most traumatising, worst thing that's ever happened to me\". Asked why she is speaking out now, she told the court: \"Because I have to tell the truth.\" 'Chaotic and toxic' Mia, faltering at times, said working for Combs came with extreme highs and lows. Sometimes he would offer advice and act like her \"protector\", she said. Other times, he would \"humiliate\" her and berate her for small mistakes, and work her so hard she had little sleep, she said. \"It was chaotic. It was toxic,\" she told the court. Combs's employees were always on edge because his mood could \"change in a split second\", causing everything to go from \"happy to chaotic\", she said. Mia told how she was barely at home once she started working for Combs. Like other employees, she often slept at his properties in LA, Miami and New York. She told the court she was not allowed to leave without his permission and was not allowed lock her door, even though it seemed as if other members of the predominantly male security staff were able to do so. \"This is my house. No one locks the doors,\" Combs allegedly said to her. On one occasion, Mia said she worked without sleeping for five days, with prescription drugs getting her through it. It was only when she had a physical breakdown that Combs allowed her to sleep, jurors were told. Mia's testimony echoed that of prior prosecution witnesses, including several of Combs's other former employees, as well as Cassie. Cassie, an R'n'B singer and model whose legal name is Casandra Ventura, spoke for four days during the first week of the trial. She told jurors her ex-partner subjected her to hundreds of \"freak offs\" - drug-fuelled marathons in which she said she engaged in sex acts with male sex workers while he watched and filmed them. Heavily pregnant at the time, it was confirmed in court yesterday that she gave birth to her third child earlier this week. Mia is the second of three women testifying about alleged sexual abuse by Combs. The third woman, using the pseudonym \"Jane\", is also expected to testify about participating in freak offs. Combs has pleaded not guilty to charges of sex trafficking, racketeering conspiracy and transportation to engage in prostitution. During their opening statement, his lawyers conceded he could be violent at times, but said that did not make him a sex trafficker or racketeering leader. Combs denies using threats or his music industry clout to commit or cover up abuse. What did Mia say about Cassie? In the first part of her testimony, Mia told the court she saw Combs beating Cassie on several occasions and that she sustained injuries, including black eyes, other bruises, and fat lips. The two became friends, she said, and are still friends today. Mia described a party at Prince's house that she and Cassie \"snuck out\" to, saying Prince's security had to intervene when Combs turned up and started to attack her. Read more:Everything you need to know about the Sean Combs trialThe rise and fall of Sean 'Diddy' CombsWhat we learned from Cassie's testimony She also described a trip to a private island in Turks and Caicos, in the Caribbean, saying she remembers Cassie being \"terrified\" as Combs banged on her door \"screaming\". On another occasion during that trip, they used paddle boards to go out to sea to get away from him, she said - but the weather changed and the sky turned dark. \"I was trying to weigh if it was scarier to face Mother Nature or go back to Puff,\" Mia said, using the name she knew him by. \"We eventually went back to Puff.\" Combs was also abusive to Cassie at the Cannes Film Festival in 2012, the court was told. Mia alleged she saw him digging his nails into her as they watched a film. Mia's testimony will continue when the trial resumes on Friday."
    },
    {
        "title": "Tom Daley says 'it's scary how LGBT rights are being dangerously threatened'",
        "description": "Even as someone who has grown up in the public eye, Tom Daley has vulnerabilities and concerns to finally reveal.",
        "url": "https://news.sky.com/story/tom-daley-says-its-scary-how-lgbt-rights-are-being-dangerously-threatened-13376666",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-tom-daley-diving-star_6930765.jpg?20250529213731",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-05-29 20:20:00",
        "Headline": "In an interview with Sky News, the diver says \"it's important that everybody, especially minorities, come together because it won't just be one group that gets targeted\".",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Even as someone who has grown up in the public eye, Tom Daley has vulnerabilities and concerns to finally reveal. The five-time Olympic medallist has an even greater perspective as the British diver who first competed at the Games aged 14 in 2008, who is now retired and a father of two. Having grown up in the public eye when social media was still in its infancy, Daley is deeply troubled by the toxicity online, especially for someone with an opinion. And the 31-year-old has spoken out from a young age - from LGBTQ+ rights to bullying and mental health - but he is ready to go further now. \"There's lots of things I think we'll look back on this last five, 10 years of human history as being quite shocking in a way,\" Daley said in an interview with Sky News. \"When social media came to prevalence - and cancel culture and people not being allowed to make any mistakes or be able to share too many opinions - it can be very scary and intimidating for certain groups of people. \"I think it definitely pits lots of people against each other and I think we always have to remember that we're all in this together at the end of the day. \n                  Glasgow Pride bans political parties from taking part amid Supreme Court row\n                 \n                  Sealed with a kiss: Same sex couples in Thailand celebrate equal marriage rights \n                 \n                  Meta's new guidelines allow users to say LGBT+ people are mentally ill\n                 \"And there's so many more important things - being able to come together as one human race and I know that sounds very like hippie-dippie. \"But it really is as simple as that, about just being kind to each other. \"Where has that kindness and compassion gone because everybody feels like they have something to say about very small groups of people.\" A front row seat to LA 2028 The Tokyo 2020 Olympic champion revealed he was gay in 2013 and went on to marry Oscar-winning screenwriter Dustin Lance Black. They now live as a family in Los Angeles - the city hosting the 2028 Olympics. Having retired from diving after a final silver medal at Paris 2024, Daley will have a front row seat to the Games taking place in an America where Donald Trump has seemed to roll back LGBTQ+ protections early in his second presidential term. \"It is scary in some parts of the world how the rights of LGBT people are kind of being reversed or they're being dangerously threatened,\" Daley said when asked about Trump. \"It's something again where minorities have to come together for the greater good because it is scary. \"And you may see someone else's rights going away and I think it's important that everybody, especially minorities, come together because it won't just be one group that gets targeted. \"Once one group has been targeted, it will move on to the next, and the next, and the next. \"I think the most important thing is staying visible. I think lots of people ask, 'What can you do to be an activist? What can you do to an advocate?' \"I think it's being truly and authentically yourself. As long as you're happy, your friends and family are happy, and you're not hurting anyone else, then I think just being visible is a great form of activism.\" Trump election victory was a 'shock' \"For lots of people living in the West Coast bubble, it was like a bit of a shock when Trump won the election in November,\" Daley said. \"But I think it's also given everybody a wake-up call. I just always believe in leading with kindness, care and compassion and trying to make life worth living for every single person.\" Daley knows what it is like to feel targeted for abuse. In a new documentary featuring family video growing up, Tom Daley 1.6 Seconds, there is a sense of disbelief that he gave interviews as a child talking about being bullied in school after his Olympic debut at Beijing 2008. \"I never really saw it back then as something that was strange because it's something that I had lived and grown up and just was part of how my life existed,\" he said. \"But, looking back on it, I kind of was like, 'Oh my gosh, imagine if it could have all been so different'.\" London 2012 poster boy During the build-up to London 2012, Daley was the poster boy of the home Olympics. But he was dealing with bulimia and body dysmorphia in private. It's still difficult to talk about, knowing people would comment on how he seemed in great shape. \"But that's not what an eating disorder is,\" he said. \"An eating disorder is not being able to think about your body, what you eat, what you put into your body rationally. \"And I think that's something that people don't necessarily understand with eating disorders, which is why going through that, I went through it alone. \"Because I was embarrassed to be thinking about those things. I didn't think anybody would believe me.\" To this day, Daley feels people online are dismissive of his concerns. In interviews, he grates when it is pointed out that in retirement he is not fat. \"I'm constantly reminded of that,\" he said. \"So it's definitely something that triggered the way that I think about my relationship with food.\" This is not to take away from how fondly Daley looks back on a career that saw him reach the pinnacle with Olympic gold in 2021 at the pandemic-delayed Olympics. Read more from Sky News:Trump furious over Wall Street's 'TACO' digScottish government scraps plan for new national park There is no sign of coming out of retirement again as he did in Paris last year. \"I feel incredibly proud of what I've been able to achieve in terms of my perseverance and resilience through lots of different things,\" he said. \"I do miss being on that diving board. \"It is like there is no other feeling than being on top of a diving board in a competition where you're putting all of the work that you put in into that 1.6 seconds and I think I will forever miss that.\""
    },
    {
        "title": "Federal judges rule Trump tariffs can stay in place for now - as president rages at trade court's 'country threatening decision'",
        "description": "A federal appeals court has ruled that Donald Trump's sweeping international tariffs can remain in place for now, a day after three judges ruled the president exceeded his authority.",
        "url": "https://news.sky.com/story/federal-judges-rule-trump-tariffs-can-stay-in-place-for-now-as-president-rages-at-trade-courts-country-threatening-decision-13376709",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump_6930518.jpg?20250529164150",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-29 22:44:00",
        "Headline": "Donald Trump said the trade court's ruling that the tariffs exceeded his authority was a \"horrible, country threatening decision\".",
        "Content": "A federal appeals court has ruled that Donald Trump's sweeping international tariffs can remain in place for now, a day after three judges ruled the president exceeded his authority. The Court of Appeals for the Federal Circuit (CAFC) has allowed the president to temporarily continue collecting tariffs under emergency legislation while it considers the government's appeal. It comes after the Court of International Trade blocked the additional taxes on foreign-made goods after its three-judge panel ruled that the Constitution gives Congress the power to levy taxes and tariffs - not the president. The judges also ruled Mr Trump exceeded his authority by invoking the 1977 International Emergency Economic Powers Act. The CAFC said the lower trade court and the Trump administration must respond by 5 June and 9 June, respectively. Trump calls trade court 'backroom hustlers' Posting on Truth Social, Mr Trump said the trade court's ruling was a \"horrible, Country threatening decision,\" and said he hopes the Supreme Court would reverse it \"QUICKLY and DECISIVELY\". After calling into question the appointment of the three judges, and suggesting the ruling was based on \"purely a hatred of 'TRUMP',\" he added: \"Backroom 'hustlers' must not be allowed to destroy our Nation!  \"The horrific decision stated that I would have to get the approval of Congress for these Tariffs. In other words, hundreds of politicians would sit around D.C. for weeks, and even months, trying to come to a conclusion as to what to charge other Countries that are treating us unfairly. \"If allowed to stand, this would completely destroy Presidential Power -- The Presidency would never be the same!\" The US president unveiled the controversial measures on \"Liberation Day\" in April, which included a 10% tariff on UK imports and caused aggressive sell-offs in the stock market. Mr Trump argued he invoked the decades-old law to collect international tariffs because it was a \"national emergency\".  Tariffs 'direct threat' to business - Schwab The trade court ruling marked the latest legal challenge to the tariffs, and related to a case brought on behalf of five small businesses that import goods from other countries. Jeffrey Schwab, senior counsel for the Liberty Justice Center - a nonprofit representing the five firms - said the appeal court would ultimately agree that the tariffs posed \"a direct threat to the very survival of these businesses\". Read more:Trump reduces Chicago gang founder's sentence after Ye lobbying'I was going to die with this': Ex-Diddy assistant breaks downTrump furious over 'TACO' dig - what inspired the phrase? US treasury secretary Scott Bessent also told Fox News on Thursday that the initial ruling had not interfered with trade deal negotiations with partners. He said that countries \"are coming to us in good faith\" and \"we've seen no change in their attitude in the past 48 hours,\" before saying he would meet with a Japanese delegation in Washington on Friday."
    },
    {
        "title": "Andrew Tate and his brother Tristan 'will return to UK' to face rape charges, lawyer says",
        "description": "Andrew Tate and his brother Tristan Tate will return to the UK to defend themselves against charges of rape and other offences, a lawyer representing the siblings has said. ",
        "url": "https://news.sky.com/story/andrew-tate-and-his-brother-tristan-will-return-to-uk-to-face-rape-charges-lawyer-says-13376583",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-andrew-tate-tristan-tate_6846999.jpg?20250305125653",
        "type": "Home",
        "Author": "Miriam Kuepper, news reporter",
        "Date Published": "2025-05-29 16:50:00",
        "Headline": "The Tate brothers are facing a total of 21 charges in the UK,  including rape, actual bodily harm and human trafficking.",
        "Content": "By Miriam Kuepper, news reporter  Andrew Tate and his brother Tristan Tate will return to the UK to defend themselves against charges of rape and other offences, a lawyer representing the siblings has said.  Andrew Ford, representing Andrew and Tristan Tate, has confirmed in a statement by firm Holborn Adams that once proceedings for separate charges the brothers are facing in Romania are concluded, \"The Tates will return to face UK allegations\". Andrew Tate, 38, faces 10 charges, including rape, actual bodily harm, human trafficking and controlling prostitution for gain, relating to three women. His brother Tristan Tate, 36, faces 11 charges relating to one woman - including rape, actual bodily harm and human trafficking. The charges were authorised in January 2024, but full details have only been released now. Bedfordshire Police issued an international arrest warrant for the brothers over allegations, which they \"unequivocally deny\", said to have occurred between 2012 and 2015. Andrew and Tristian Tate's legal team alleges that there is \"a vast amount of misinformation\" about the allegations faced by their clients, which they say could impact their clients' right to a fair trial. The lawyers have also accused the Crown Prosecution Service (CPS) and police of refusing to \"engage with us in any meaningful way\". \"UK prosecutors refuse to give even the most basic information to allow our clients to understand the allegations which they face,\" Holborn Adams said in a statement. \"These are historic allegations, and our clients are not even being told who the supposed victims are, this is not a typical approach and demonstrates a different approach on the basis of the profile of our clients.\" They added: \"As and when the time presents itself, we will rigorously defend our clients.\" The Tate brothers are facing separate allegations of trafficking minors, sexual intercourse with a minor and money laundering in Romania. They are also accused of human trafficking and forming a criminal gang to sexually exploit women in a different case, which has been sent back to prosecutors. Read more from Sky News:Man, 53, charged over Liverpool parade incidentBody found in search for missing teenage girl Prosecutors in the UK have submitted a request to authorities in Romania for the brothers to be extradited following the conclusion of proceedings in Romania. However, the CPS has said that the \"domestic criminal matters in Romania must be settled first\". They have denied all the allegations in Romania. High Court case Lawyer Matt Jury, of McCue Jury & Partners, representing several alleged British victims of Andrew Tate, said: \"We welcome the clarity from the Crown Prosecution Service that our authorities are working to ensure the Tates face justice here in the UK - they cannot be allowed to escape extradition. \"At the same time, we ask once more that CPS admit its mistake in failing to prosecute Tate when he lived in the UK and finally charge him for the rape and assault of the other three women, our clients, who originally filed criminal complaints against him as long ago as 2014 but were failed by the system. \"They deserve justice, too.\" Those allegations were subject to a police investigation, which was closed in 2019. The women are now bringing a civil case against Andrew Tate. Addressing those allegations, Tate's lawyers said that the proceedings were not criminal and had been brought for compensation. The lawyers said the High Court case was \"set down for trial in 2027\" and that Andrew Tate would \"rigorously defend himself with our full support\"."
    },
    {
        "title": "Man, 53, charged over Liverpool parade incident",
        "description": "A 53-year-old man has been charged after a car was driven into a crowd at Liverpool FC's trophy parade.",
        "url": "https://news.sky.com/story/man-charged-over-liverpool-parade-incident-13375642",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-paul-doyle-liverpool_6930591.jpg?20250529173146",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-29 16:15:00",
        "Headline": "Paul Doyle is accused of two counts of wounding with intent, two counts of causing grievous bodily harm with intent, two counts of attempted grievous bodily harm with intent and one count of dangerous driving.",
        "Content": " A 53-year-old man has been charged after a car was driven into a crowd at Liverpool FC's trophy parade. Paul Doyle, from the West Derby area of Liverpool, has been charged with seven offences, Merseyside Police said. The businessman, who is a father-of-three, is accused of two counts of unlawful and malicious wounding with intent to cause grievous bodily harm, and two counts of causing unlawful and malicious grievous bodily harm with intent to cause grievous bodily harm. Doyle is also accused of two counts of attempted unlawful and malicious grievous bodily harm with intent to cause grievous bodily harm, and one count of dangerous driving. He is due to appear before Liverpool Magistrates' Court on Friday. The charges relate to six people, including two children. A wounding charge and an attempted grievous bodily harm charge relate to a child. A police car was outside Doyle's four-bedroom detached family home in the West Derby area on Thursday morning. According to his social media, he has travelled extensively, including to Japan, Fiji, India and Australia. Doyle has posted pictures of himself competing in triathlons, and climbing Mount Kilimanjaro.  Thousands of fans were gathered in Liverpool city centre on Monday to celebrate the Premier League champions' title win when a car struck a crowd on Water Street. Police said a total of 79 people were injured in the incident, with the youngest aged nine, and the oldest being a 78-year-old. Seven people remain in hospital in a stable condition. 'Huge volume of evidence' Chief crown prosecutor for the CPS Mersey-Cheshire, Sarah Hammond, told a news conference on Thursday that the investigation was at an early stage and a \"huge volume of evidence\" was being reviewed. \"This includes multiple pieces of video footage and numerous witness statements. It is important to ensure that every victim gets the justice they deserve. \"The charges will be kept under review as the investigation progresses.\" Police 'working tirelessly' Also at the briefing where the charges were announced was Assistant Chief Constable of Merseyside Police, Jenny Sims, who said: \"I fully understand how this incident has left us all shocked and saddened, and I know many will continue to have concerns and questions. \"Our detectives are working tirelessly, with diligence and professionalism, to seek the answer to all of those questions. When we are able to, we will provide further information.\""
    },
    {
        "title": "Heartbroken parents fear mouldy house contributed to death of 15-week-old son",
        "description": "Aiat Mohammed still clutches one of the last babygrows her son wore.",
        "url": "https://news.sky.com/story/heartbroken-parents-fear-mouldy-house-contributed-to-death-of-15-week-old-son-13376463",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-akram-mohammed-mould_6930419.jpg?20250529150806",
        "type": "UK",
        "Author": "Rachael Venables, news correspondent, and Emily Jennings, specialist producer",
        "Date Published": "2025-05-29 13:24:00",
        "Headline": "Black mould pushed wallpaper from the walls, stains and damp kept coming back no matter how much they scrubbed and cleaned with harsh chemicals, and no matter how much they begged the housing association for help.",
        "Content": "By Rachael Venables, news correspondent, and Emily Jennings, specialist producer   Aiat Mohammed still clutches one of the last babygrows her son wore. Exhausted by grief, she holds the tiny blue and green outfit tight. Occasionally, when everything becomes too much, she lifts it to her face and breathes in deeply. \"I didn't wash it,\" she tells me, \"because it's got his scent\". Her son, Akram, was just 15 weeks old when he died in hospital in London on 21 February. His parents took him to hospital a day after raising concerns about his breathing. Doctors attempted CPR in front of them - but the little boy couldn't be saved. Aiat remembers the moment she saw the monitor flatline, and the medical team stepped away from his tiny body: \"They said to me, 'You can come and touch his head now'. I was saying, 'Please, can you try again? Please, do the CPR again?' And they said, 'Sorry, we can't. We can't do anything anymore. We need to stop'.\" An inquest to determine the circumstances of how and why Akram died will be held in the summer. The family lawyer, Mark McGhee, says a pathology report suggested he died of acute pneumonia due to a late-onset Group B Strep infection. But he fears the state of their crowded and mouldy housing association flat played a part. Home riddled with damp Photos make it clear their one-bedroom Camden home was riddled with damp, long before Akram - the couple's third child - was born at the end of last year. Black mould pushed the wallpaper from the walls, stains and damp kept coming back no matter how much they scrubbed and cleaned with harsh chemicals, and no matter how much they begged the housing association - Notting Hill Genesis - for help. An independent inspection before the baby's birth in December found the landlord \"in breach of its duty to ensure the property is and will remain fit for human habitation\". Mould was found on either the walls or ceiling in the single bedroom, living room, bathroom and kitchen. To make things even worse, the family say that after complaining about broken windows, a contractor arrived to seal them shut - making ventilation almost impossible. Akram's father Abdushafi Mohammed, a car mechanic from Sudan, told Sky News: \"You felt it in the air, in your chest as soon as you walked into the flat.\" Aiat remembers the \"very, very rotten smell, very strange smell. You don't want to be in there for more than a minute\". Their baby began to rasp at night, and then they could hear a rattle in his chest during the day. But his worried parents were told he would \"grow out of it\". 'Drowning in fluids' Savvas Panas, the chief executive of the Pillion Trust Charity, who has supported the family for years, told Sky News: \"The child was strong, he was big and very healthy, but he was drowning, you could hear it, he was drowning in fluids.\" He claims to have spent months escalating concerns through the housing association, and Camden Council. Abdushafi puts it simply: \"No one helped us.\" The cause of death is unknown, an inquest has been set up, and a coroner is expected to rule on how and why he died later in the year. Read more from Sky News:Ages of youngest and oldest Liverpool crash victims releasedReservoir searched after girl believed to have fallen in Patrick Franco, chief executive of Notting Hill Genesis, said: \"We are deeply saddened by the tragic loss of Akram Mohammed and extend our sincere condolences to his family, their friends and neighbours. We will continue to support the family in any way we can during this difficult time. \"We know that this is a complex situation and will continue working with the relevant authorities as they conduct their investigations. \"No determination has been made by HM Coroner as to the cause of Akram's death, and it would therefore be inappropriate to comment further or to speculate at this time.\" A Camden Council spokesperson said: \"Akram's death is a tragedy, and our thoughts are with his family at what is a very sad time. \"We have been in regular contact with Notting Hill Genesis - most recently this week - and they have assured us that they are working to identify a suitable home for the family. We will remain in touch, doing what we can, until this situation is resolved. \"As with any unexpected death, there will be an inquest to determine any contributory factors and learnings for local agencies.\" Richard Blakeway, housing ombudsman, said: \"This is a tragic case and our thoughts are with the family at this difficult time. \"Whilst the complaint was still within the landlord's complaints process when Akram passed away, and therefore we were unable to take it on as a formal investigation, we have offered support and advice to the family, including progressing their complaint with the landlord. We will continue to liaise with the family as this case progresses\"Landlords should take a zero tolerant approach to damp and mould. The introduction of Awaab's Law is a positive step. However, landlords should not wait for its introduction to take further action, including proactively identifying damp and mould in homes rather than waiting for residents to report it.\" Complaints about conditions have risen sharply Akram's death comes as the housing ombudsman’s office reveals complaints about substandard living conditions in social housing are more than five times higher than they were five years ago. The ombudsman deals with disputes between residents and social housing landlords in England, and found there were 6,380 complaints investigated in the year to March 2025, up from 1,111 in the year to March 2020. Reasons for complaints included asbestos, electrical and fire safety issues, pest control, leaks, damp and mould. 'I would have ripped that family out of there' Mr Panas said that despite their long-standing battles with the mould, he advised the family to stay in the sub-standard flat, knowing that if they left, they would lose social housing support by making themselves \"intentionally homeless\". But, if he could go back in time, he said: \"I would have ripped that family out of there. I would say, just grab your children and get in the car and let's go.\""
    },
    {
        "title": "'I lost my father to suicide': Schoolgirl's assembly on the hardest of subjects",
        "description": "Evie likes scary movies, musicals and Taylor Swift - but there is something that sets her apart.",
        "url": "https://news.sky.com/story/i-lost-my-father-to-suicide-schoolgirls-assembly-on-the-hardest-of-subjects-13374948",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-evie-suicide_6927798.jpg?20250526132709",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-05-29 03:40:00",
        "Headline": "Evie hates the way other children at school casually joke about suicide. She and her younger sister lost their father in 2018, and she decided to give a school assembly on the subject.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  Evie likes scary movies, musicals and Taylor Swift - but there is something that sets her apart. The 16-year-old hates the way other children at school casually joke about suicide. \"People saying things like 'I'm going to kill myself if I have to sit another maths test', you'd be surprised how often people say things like that,\" Evie Roodhouse tells me. \"People don't understand the seriousness, saying they are 'depressed' as if it's a positive thing. I think it's become even a trend that some people think is cool or funny.\" Evie and younger sister Ada lost their father in 2018, and what they rarely tell anyone is that was suicide. However, Evie's approach to this deeply personal subject is about to change. She has decided to give a school assembly on the subject. Eight-year-old sister Ada supports Evie's decision and has experienced her own frustrations: \"She [Evie] gets people joking about it,\" says Ada, \"In my school I just get people, like, complaining about their parents being gone for a week, say on holiday, especially their dad. 'My dad's going to this place for a week, and I won't get to see him.' 'Oh he's not here on Father's Day.' Or, 'he'll be away for a whole month, that's almost as much as you.' - It's not. It's really not.\" It's entirely understandable that, up until now, Evie has been extremely private around the cause of her father's death. Her presentation on the subject for a room of her peers at Brighton Hill Community School in Basingstoke, would surely be one of the most courageous school assemblies ever given. The night before, I met up with Evie along with Mother Caroline and sister Ada. \"This is the first time I've openly shared my own personal experience, my story so that's where the nerves are coming in,\" Evie says as we get on to the subject of her presentation. Her previous experience of confiding in friends is that their response varies between asking invasive questions, wanting details that Evie doesn't want to share, or they feel awkward and change the subject. What Evie wants is for people to be able to talk about the subject and understand how to talk about it, especially if they themselves are struggling. \"With mental health we know that opening up and talking about it is the best thing you can do,\" she says. \"I think we understand ourselves better if we talk about our mental health. Communication is the best way around the stigma.\" However, this conversation around Evie's home dining table is going to take us to some dark places, and it occurs to me how difficult it must have been for Caroline to explain what happened, to her young children. Did she have a choice? Could she have invented some other form of death to protect them from the truth? Caroline explains her decision to tell them. \"I had no idea Steve was going to take his own life. On the day I found out, luckily a friend of mine contacted an amazing charity called Winston's Wish and they gave me some important advice, and that was honesty. \"However, uncomfortable that was, however brutal that was at the time. I'm grateful for that advice - because it's meant that we've always had trust between us.\" Suicide rates in the UK have remained roughly the same for the last two decades, although the 7,055 deaths recorded in 2023 was the highest rate since 1999. Men are three times more likely to take their own lives, and with Evie and Ada's father there was no warning and no note to explain why. Caroline says loss by suicide is \"grief with a microphone\". One of the hardest things for her to manage has been her feeling of abandonment. \"I wanted to talk to Steve, and he's the person responsible for not being here. Trying to get your head round the fact that, yes, they took their own life, but they weren't in a rational state at that point in time, but then you're feeling angry at the same time. It's tiring. It's exhausting.\" Eight-year-old Ada picks up: \"You don't blame them for being sad - but you're also angry that they are not here.\" \"…And that they didn't tell you that they were struggling,\" adds Caroline. \"They act all happy and fine. It's quite unusual,\" says Ada. \"It doesn't make sense, does it?\" offers Caroline. It is just a glimpse into the impossible conversations, the heartbreak and tears this family has endured. Photographs of Steve with his children tell of a loving husband and father, hugging his children close, taking pride in his girls and valuing his precious time with them. Evie tries to explain her own feelings on this, \"Rather than someone being taken away from you - that person's chosen to take themselves away from you.\" \"They don't want to be with you,\" says Ada. Evie picks up: \"There's sadness that they must have been struggling - but you made that decision. You must have thought whatever you had going on, was a bigger deal than me needing a father in my life, and that's been a big thing for me.\" But Caroline has a consoling thought - a moment she says that changed everything. \"It wasn't that long ago maybe last year I was asked a question that completely knocked me off my feet - and took away most of my anger. I was asked by somebody - 'What do you think Steve would say if he could come back and speak to you, right now.'\" \"And my response to that, knowing what an amazing person he was, is that he would say 'sorry' and he didn't want to cause us any pain. And in that moment imagining him saying 'sorry' - took away all my anger.\" Then she adds, \"The problem is that replaces the anger with sadness.\" There is a deep chasm in the room. They will never know why. There are no answers. No clues and no way to change that. The profound complexity of emotions is something anyone would struggle with, yet both children Evie have found ways of coping. \"You have the first couple of years of feeling - 'this is going to be my life now this is how I'm going to feel...' says Evie. Her emotions break through, she pauses to compose herself then determinedly finishes her point. \"…and I think being able to move past that and understand that you are not defined by that loss - and you are more than the person who took themselves away from you - and you are stronger.\" The next day as the assembly loomed Evie emitted quiet confidence. Mum Caroline came to watch and said she felt protective but at the same time \"unbelievably proud\". What then happened was an extraordinary 20 minutes. Around 80 children watched the presentation, which included a thought-provoking animated film that Evie helped to create. She told the room how she lost her father to suicide in 2018 when she was nine years old and warned, \"When you hear someone joking about something that has completely turned your world around it can be so hurtful.\" She also had sage advice on where teenagers can get help themselves, listing school provision and organisations outside of school such as Childline and the Samaritans. Research recently published by the Mental Health Foundation found a third of young people accessed self-harm content online and the theme this year's Mental Health Awareness week was community. Evie's presentation couldn't have been more appropriate. She told her peers: \"Unfortunately, in my experience the people who don't talk about it, the people who keep their emotions down and don't want to speak about those feelings are the people who we lose thorough suicide.\" Caroline was right to be proud and so too was headmaster of Brighton Hill Community School, Chris Edwards. He said afterwards: \"I bang on about this quite a lot - the younger generation - and the press that they get does not match the depiction that I see day in day out. \"They are phenomenal - and the assembly we've seen today which Evie ran was one of the most impressive things I've seen in my career. Not just because she was able to tackle a subject that's very difficult to her, but to do it to her peers is doubly difficult. And I was also proud of the way the children responded.\" It is rare this subject is talked about, and it must be done sensitively. Evie gave a masterclass in how to do it. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "UK will 'seek to do more if it can' for Gaza's injured children, foreign secretary David Lammy says",
        "description": "The foreign secretary has said the UK will do more to help injured children in Gaza if it can, following Sky News' reporting on their plight. ",
        "url": "https://news.sky.com/story/uk-will-seek-to-do-more-if-it-can-for-gazas-injured-children-foreign-secretary-david-lammy-says-13376645",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-lammy-david_6930719.jpg?20250529204901",
        "type": "UK",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-05-29 19:34:00",
        "Headline": "The foreign secretary was responding to Sky News' report on the plight of the region's children. David Lammy was also sharply critical of the worsening situation in Gaza.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  The foreign secretary has said the UK will do more to help injured children in Gaza if it can, following Sky News' reporting on their plight.  David Lammy was on a whistlestop tour of the Arctic when we asked him about our story on a charity calling for the UK to offer children in Gaza life-saving treatment. Israel-Gaza latest: Netanyahu reportedly accepts US ceasefire plan He said: \"The scale of the medical catastrophe for children and the population of Gaza is horrendous, and that's why we increased our aid. \"What will end this suffering is a ceasefire but if there is more that we can do to end the suffering, of course, we will seek to do that.\" We read the foreign secretary the words of Doctor Victoria Rose, a British plastic surgeon working in Gaza. Dr Rose had said: \"Every time I come in, I say it's bad, but this is on a completely different scale. It's carnage… we really are on our knees now.\"  Mr Lammy was speaking as reports broke that Israel's Prime Minister Benjamin Netanyahu had accepted a ceasefire brokered by the Trump administration. Hamas said on Thursday night that it was still discussing the deal, while an official warned that the Israeli response to the proposal failed to meet the group's demands. The foreign secretary said he hopes \"we're about to see a breakthrough that is not just a ceasefire for a few days, but is a sustained ceasefire that brings an end to some of the horrors that we are seeing out of Gaza and sees the return of the hostages\". He was also sharply critical of the worsening situation in Gaza. \"The scenes of children dying, the horrors of people not being able to get aid are unacceptable, it's horrendous,\" he said. Read more:Charity calls on UK to help Gaza childrenHow the new Gaza aid rollout collapsed But Mr Lammy stopped short of saying Israel was guilty of a genocide - saying that was a decision for judges in international tribunals. \"We have always been clear that this is a decision for the international courts,\" he said. \"I have to stand by our law, and I determined that there was a clear risk of a breach of international humanitarian law.\" The British government this month suspended trade talks with Mr Netanyahu's government, in response to Israel ramping up its latest military offensive in Gaza and limiting aid to the enclave."
    },
    {
        "title": "Body found in search for missing teenage girl who fell into reservoir",
        "description": "A body has been found in the search for a missing teenage girl who fell into a reservoir, police have said.",
        "url": "https://news.sky.com/story/body-found-in-search-for-missing-teenage-girl-who-fell-into-reservoir-13376554",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-baitings-reservoir_6930312.jpg?20250529171440",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-29 16:04:00",
        "Headline": "Emergency services were called to the reservoir at 1.17pm on Wednesday following reports that a teenage girl had fallen from a dam into the water.",
        "Content": "A body has been found in the search for a missing teenage girl who fell into a reservoir, police have said. West Yorkshire Police confirmed they recovered a body from the Baitings Reservoir, near Ripponden, on Thursday afternoon. A formal identification is yet to take place, but police believe the body to be that of the missing teenage girl. The girl's family have been informed. Emergency services were called to the reservoir at 1.17pm on Wednesday following reports that a teenage girl had fallen into the water from Baitings Dam. Police, fire and ambulance crews, as well as an underwater search team, were deployed to the scene for the search, which continued on Thursday until a body was found. Read more from Sky News:Age range of Liverpool crash victims releasedDrought declared in North West England Detective Inspector Laura Hall of Calderdale's Safeguarding Team said: \"While formal identification is yet to take place, the girl's family have been informed and are being supported by specially-trained officers. \"My thoughts go out to her family and friends at this very sad time. \"Our enquiries are continuing into the death in order to establish exactly what happened yesterday, but we do not believe it to be suspicious.\""
    },
    {
        "title": "Tube fare dodgers and Robert Jenrick clash at Stratford station - as he chases them at barriers for social media video",
        "description": "Robert Jenrick has taken the law into his own hands by challenging Tube fare dodgers in a social media video criticising London mayor Sadiq Khan.",
        "url": "https://news.sky.com/story/tube-fare-dodgers-and-robert-jenrick-clash-at-stratford-station-as-he-chases-them-at-barriers-for-social-media-video-13376390",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-jenrick-tube_6930393.jpg?20250529145227",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-29 11:05:00",
        "Headline": "The shadow justice secretary confronted people in east London going through barriers without paying.",
        "Content": " Robert Jenrick has taken the law into his own hands by challenging Tube fare dodgers in a social media video criticising London mayor Sadiq Khan. The Conservative shadow justice secretary posted a video of himself challenging people walking through the barriers without paying at Stratford station in Newham, east London. Newham is the third most deprived local authority area in the capital, according to the latest census data. Politics latest: PM launches huge attack against Farage  However, Mr Jenrick said one in 25 people using London's public transport are not paying for it, and accused Mr Khan of \"driving a proud city into the ground\". \"Lawbreaking is out of control. He's not acting. So, I did,\" Mr Jenrick said in the caption. Mr Jenrick could be seen approaching people slipping through the barriers and asking them if they think \"it is alright not to pay\". He was met with indignation, with one man telling him to \"f*** off\" and another saying: \"I'm warning you now, move!\" Mr Jenrick asked one man if he said he was carrying a knife. The Conservative MP said there were eight enforcement officers nearby but people were going through an open barrier without paying. At one point, he could be seen bringing one of the fare dodgers to a group of British Transport Police officers who took the man aside for questioning. Mr Jenrick said it is \"the same with bike theft, phone theft, tool theft, shoplifting, drugs in town centres, weird Turkish barber shops\". \"It's all chipping away at society,\" he said. \"The state needs to reassert itself and go after lawbreakers.\" Political correspondent This is the latest video from Robert Jenrick that's trying to tap into the well-documented frustrations many have in the country that low-level crime is eroding away at civil society. Being tough on crime is not an unusual stance for any politician to adopt, but what's a bit different about this approach is the shadow justice secretary is packaging up the message in a slick and provocative format that's explicitly designed for social media. It has the effect of appealing to supporters whilst also enraging critics, giving the end result of boosting its prominence online and boosting the profile of this ambitious frontbencher too. Read more: Cummings predicts Kemi Badenoch will be gone by end of year A British Transport Police spokesman said: \"Ticket fraud is not a victimless crime - the cost is passed down to the honest fare-paying members of the travelling public. \"We are committed to working closely alongside the railway industry to tackle fare evasion and regularly support them with high visibility patrols at known hotspot locations.\" Fare evasion costs Transport for London (TfL) £130m a year, with YouGov finding 79% of passengers saying they have personally seen fare dodging. In April, the mayor announced a new fare evasion strategy involving expanding TfL's team of more than 500 uniformed officers already deployed across the network to deal with fare evasion and other anti-social behaviour."
    },
    {
        "title": "Could an OnlyFans account capsize this canoeist's Olympic dream?",
        "description": "A British canoeist could see his hopes of competing at the Olympics crushed after he said he was banned from competing due to posting content on OnlyFans.",
        "url": "https://news.sky.com/story/why-an-onlyfans-account-could-capsize-canoeists-olympic-dream-13376641",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kurts-adams-canoe_6930744.jpg?20250529210720",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-29 19:26:00",
        "Headline": "Kurts Adams Rozentals competes in canoe slalom and is part of Paddle UK's world class programme for Olympic hopefuls, but was suspended by the sport's national governing body in April.",
        "Content": "A British canoeist could see his hopes of competing at the Olympics crushed after he said he was banned from competing due to posting content on OnlyFans. In an interview with Sky News presenter Matt Barbet on the UK Tonight, Kurts Adams Rozentals said he started posting revealing content of himself on OnlyFans - a subscription-based service that is known for hosting adult content - to raise money for his canoeing career. He competes in canoe slalom and is part of Paddle UK's world-class programme for Olympic hopefuls, but was suspended by the governing body in April. In a statement, Paddle UK said Mr Rozentals was under interim action pending the outcome of an investigation, highlighting that this was \"a neutral act (...) designed to protect all parties and is not a disciplinary action\". Paddle UK did not disclose the nature of the allegation, but its disciplinary policy lists offensive use of social media and indecent, offensive or immoral behaviour as examples of gross misconduct. Mr Rozentals said he received £16,000 in funding from Paddle UK for his training, but this \"is not anywhere near enough to be able to pursue elite sport\". After trying freelance jobs and working at a warehouse to make up the shortfall, the canoeist started uploading content on OnlyFans in January as a means of earning money \"that wouldn't affect the training, because the ambition is to get to the Olympics and you need to fund that in some way\". Mr Rozentals, who has been in the sport for more than 10 years and has already won medals on a world stage, said he was \"raised with a whatever-it-takes mentality, and I think that's how we've got to where we are now\". He said: \"At the end of the day, I started this to help with the sport, and it certainly is helping when I'm on the start line, and I'm not having to worry about rent and food on the table. It's a good feeling.\" But the athlete and content creator said his mother was \"crying for a week\" after finding out he started an OnlyFans account. \"She worked so hard, sacrificed her life to get us into sport and to prove that people from underprivileged backgrounds can reach something and achieve something good in life,\" Mr Rozentals said. \"And then when I did that... She did eventually come around and understand why I did what I did.\" Mr Rozentals said he made more than six figures on OnlyFans, but warned that \"there is a price to pay\" when sharing adult content, as it would stay on the internet forever. \"I don't want to just be an influencer. My dream was always to do something bigger,\" he added, saying his focus was still on his canoeing ambitions rather than on being a social media star. Read more from Sky News:Andrew Tate 'will return to UK' to face chargesBody found in reservoir in search for missing girl Paddle UK said the interim action against the athlete \"was taken to ensure the integrity of the investigation and to safeguard other athletes, staff, and volunteers due to the nature of the allegations.\" Their statement added: \"Paddle UK is committed to ensuring a safe and open environment for all, and interim action under the Athlete Disciplinary Policy is only taken where necessary and proportionate.\""
    },
    {
        "title": "Andrew Tate and his brother Tristan 'will return to UK' to face rape charges, lawyer says",
        "description": "Andrew Tate and his brother Tristan Tate will return to the UK to defend themselves against charges of rape and other offences, a lawyer representing the siblings has said. ",
        "url": "https://news.sky.com/story/andrew-tate-and-his-brother-tristan-will-return-to-uk-to-face-rape-charges-lawyer-says-13376583",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-andrew-tate-tristan-tate_6846999.jpg?20250305125653",
        "type": "UK",
        "Author": "Miriam Kuepper, news reporter",
        "Date Published": "2025-05-29 16:50:00",
        "Headline": "The Tate brothers are facing a total of 21 charges in the UK,  including rape, actual bodily harm and human trafficking.",
        "Content": "By Miriam Kuepper, news reporter  Andrew Tate and his brother Tristan Tate will return to the UK to defend themselves against charges of rape and other offences, a lawyer representing the siblings has said.  Andrew Ford, representing Andrew and Tristan Tate, has confirmed in a statement by firm Holborn Adams that once proceedings for separate charges the brothers are facing in Romania are concluded, \"The Tates will return to face UK allegations\". Andrew Tate, 38, faces 10 charges, including rape, actual bodily harm, human trafficking and controlling prostitution for gain, relating to three women. His brother Tristan Tate, 36, faces 11 charges relating to one woman - including rape, actual bodily harm and human trafficking. The charges were authorised in January 2024, but full details have only been released now. Bedfordshire Police issued an international arrest warrant for the brothers over allegations, which they \"unequivocally deny\", said to have occurred between 2012 and 2015. Andrew and Tristian Tate's legal team alleges that there is \"a vast amount of misinformation\" about the allegations faced by their clients, which they say could impact their clients' right to a fair trial. The lawyers have also accused the Crown Prosecution Service (CPS) and police of refusing to \"engage with us in any meaningful way\". \"UK prosecutors refuse to give even the most basic information to allow our clients to understand the allegations which they face,\" Holborn Adams said in a statement. \"These are historic allegations, and our clients are not even being told who the supposed victims are, this is not a typical approach and demonstrates a different approach on the basis of the profile of our clients.\" They added: \"As and when the time presents itself, we will rigorously defend our clients.\" The Tate brothers are facing separate allegations of trafficking minors, sexual intercourse with a minor and money laundering in Romania. They are also accused of human trafficking and forming a criminal gang to sexually exploit women in a different case, which has been sent back to prosecutors. Read more from Sky News:Man, 53, charged over Liverpool parade incidentBody found in search for missing teenage girl Prosecutors in the UK have submitted a request to authorities in Romania for the brothers to be extradited following the conclusion of proceedings in Romania. However, the CPS has said that the \"domestic criminal matters in Romania must be settled first\". They have denied all the allegations in Romania. High Court case Lawyer Matt Jury, of McCue Jury & Partners, representing several alleged British victims of Andrew Tate, said: \"We welcome the clarity from the Crown Prosecution Service that our authorities are working to ensure the Tates face justice here in the UK - they cannot be allowed to escape extradition. \"At the same time, we ask once more that CPS admit its mistake in failing to prosecute Tate when he lived in the UK and finally charge him for the rape and assault of the other three women, our clients, who originally filed criminal complaints against him as long ago as 2014 but were failed by the system. \"They deserve justice, too.\" Those allegations were subject to a police investigation, which was closed in 2019. The women are now bringing a civil case against Andrew Tate. Addressing those allegations, Tate's lawyers said that the proceedings were not criminal and had been brought for compensation. The lawyers said the High Court case was \"set down for trial in 2027\" and that Andrew Tate would \"rigorously defend himself with our full support\"."
    },
    {
        "title": "New blood test to 'revolutionise' NHS cancer treatment",
        "description": "A new ultra-sensitive blood test which can detect tiny fragments of tumour DNA could be \"revolutionary\" for NHS patients.",
        "url": "https://news.sky.com/story/new-blood-test-to-revolutionise-nhs-cancer-treatment-13376382",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-liquid-biopsy-rebeca_6930219.jpg?20250529115451",
        "type": "UK",
        "Author": "Megan Harwood-Baynes",
        "Date Published": "2025-05-29 10:52:00",
        "Headline": "Tens of thousands of patients could benefit from liquid biopsies, which give results up to two weeks faster than tissue biopsies. ",
        "Content": "\n          Social affairs and health reporter\n              @megbaynes\n A new ultra-sensitive blood test which can detect tiny fragments of tumour DNA could be \"revolutionary\" for NHS patients. Thousands of patients will be offered liquid biopsies, which can help fast-track lung cancer patients to receive targeted treatments. Tissue biopsies are used to confirm a diagnosis of lung cancer and samples can be sent for genomic testing. But liquid biopsies allow for results much faster, and can show patients if they have mutations. Rebeca Proctor, 41, was treated a suspected chest infection last December. After she began coughing up blood, she was diagnosed with stage four cancer - which she called a \"punch to the gut\". \"I was scared - I just thought about my children, and if I would get to see my little girl start nursery, and how I would explain my diagnosis to my children - it was just heartbreaking to think about,\" the mother of four from Carlisle said. A liquid biopsy showed she had an ALK genetic mutation of her non-small-cell lung cancer. A tissue biopsy took ten days longer to confirm the same result, but in the meantime she could begin a targeted treatment. New medication has \"given me my life back\", she says. \n                  Dementia: Sleep problems could 'double risk' of disease in later life\n                 \n                  The ins and outs of UK cannabis law - and calls to decriminalise it\n                 \n                  Extra cancer screenings for women with dense breasts could save hundreds of lives, study finds\n                 \"I'm taking it day-by-day and for now the treatment is doing what it's meant to be doing and shrinking the tumour, and I've got my energy back,\" she said. \"I know I'm not going to be cured but I've come to terms with my diagnosis and the pills are stopping my cancer cells from spreading - we'll keep fighting this and dealing with what's been thrown at us.\" Breast and lung cancers are two of the most common in England - around 90,000 people are diagnosed with one of them each year. Potential to 'scan' the body in a single blood test NHS England will become the first health service in the world to roll-out a \"blood-test first\" approach to diagnosing lung cancer, and it follows a successful pilot of the testing last year. Up to 15,000 patients could benefit. The NHS has also said it is expanding testing in advanced breast cancer, with several genetic variations now being screened for. It could save the health service up to £11m per year in lung cancer care. Read more:Could the UK decriminalise cannabis?Father loses wife and son to same heart conditionThe extra cancer screenings that could save hundreds Professor Peter Johnson, NHS national clinical director for cancer, said it would enable patients to receive \"more targeted and kinder care\", as it would enable some to avoid more intensive treatments - such as chemotherapy - in place of a more targeted approach. \"Liquid biopsies are leading us into a new era of personalised cancer care and it's fantastic that we are now able to expand the use of this revolutionary test on the NHS to help tailor treatment for thousands of patients across the country,\" he said. Liquid biopsies, he added, have the potential to \"scan\" the body in a single blood test. Professor Dame Sue Hill, Chief Scientific Officer for England, said: \"This testing is transforming care and helping clinicians match patients earlier especially when cancer tissue may not be available with potentially life-extending targeted therapies rapidly and with greater precision.\" The health secretary called it an \"incredibly exciting new test\" that could save countless lives. \"It is just the latest example of this government combining the compassionate care of our National Health Service with the ingenuity of Britain's leading scientific minds to revolutionise cancer care,\" Wes Streeting said."
    },
    {
        "title": "Tom Daley says 'it's scary how LGBT rights are being dangerously threatened'",
        "description": "Even as someone who has grown up in the public eye, Tom Daley has vulnerabilities and concerns to finally reveal.",
        "url": "https://news.sky.com/story/tom-daley-says-its-scary-how-lgbt-rights-are-being-dangerously-threatened-13376666",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-tom-daley-diving-star_6930765.jpg?20250529213731",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-05-29 20:20:00",
        "Headline": "In an interview with Sky News, the diver says \"it's important that everybody, especially minorities, come together because it won't just be one group that gets targeted\".",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Even as someone who has grown up in the public eye, Tom Daley has vulnerabilities and concerns to finally reveal. The five-time Olympic medallist has an even greater perspective as the British diver who first competed at the Games aged 14 in 2008, who is now retired and a father of two. Having grown up in the public eye when social media was still in its infancy, Daley is deeply troubled by the toxicity online, especially for someone with an opinion. And the 31-year-old has spoken out from a young age - from LGBTQ+ rights to bullying and mental health - but he is ready to go further now. \"There's lots of things I think we'll look back on this last five, 10 years of human history as being quite shocking in a way,\" Daley said in an interview with Sky News. \"When social media came to prevalence - and cancel culture and people not being allowed to make any mistakes or be able to share too many opinions - it can be very scary and intimidating for certain groups of people. \"I think it definitely pits lots of people against each other and I think we always have to remember that we're all in this together at the end of the day. \n                  Glasgow Pride bans political parties from taking part amid Supreme Court row\n                 \n                  Sealed with a kiss: Same sex couples in Thailand celebrate equal marriage rights \n                 \n                  Meta's new guidelines allow users to say LGBT+ people are mentally ill\n                 \"And there's so many more important things - being able to come together as one human race and I know that sounds very like hippie-dippie. \"But it really is as simple as that, about just being kind to each other. \"Where has that kindness and compassion gone because everybody feels like they have something to say about very small groups of people.\" A front row seat to LA 2028 The Tokyo 2020 Olympic champion revealed he was gay in 2013 and went on to marry Oscar-winning screenwriter Dustin Lance Black. They now live as a family in Los Angeles - the city hosting the 2028 Olympics. Having retired from diving after a final silver medal at Paris 2024, Daley will have a front row seat to the Games taking place in an America where Donald Trump has seemed to roll back LGBTQ+ protections early in his second presidential term. \"It is scary in some parts of the world how the rights of LGBT people are kind of being reversed or they're being dangerously threatened,\" Daley said when asked about Trump. \"It's something again where minorities have to come together for the greater good because it is scary. \"And you may see someone else's rights going away and I think it's important that everybody, especially minorities, come together because it won't just be one group that gets targeted. \"Once one group has been targeted, it will move on to the next, and the next, and the next. \"I think the most important thing is staying visible. I think lots of people ask, 'What can you do to be an activist? What can you do to an advocate?' \"I think it's being truly and authentically yourself. As long as you're happy, your friends and family are happy, and you're not hurting anyone else, then I think just being visible is a great form of activism.\" Trump election victory was a 'shock' \"For lots of people living in the West Coast bubble, it was like a bit of a shock when Trump won the election in November,\" Daley said. \"But I think it's also given everybody a wake-up call. I just always believe in leading with kindness, care and compassion and trying to make life worth living for every single person.\" Daley knows what it is like to feel targeted for abuse. In a new documentary featuring family video growing up, Tom Daley 1.6 Seconds, there is a sense of disbelief that he gave interviews as a child talking about being bullied in school after his Olympic debut at Beijing 2008. \"I never really saw it back then as something that was strange because it's something that I had lived and grown up and just was part of how my life existed,\" he said. \"But, looking back on it, I kind of was like, 'Oh my gosh, imagine if it could have all been so different'.\" London 2012 poster boy During the build-up to London 2012, Daley was the poster boy of the home Olympics. But he was dealing with bulimia and body dysmorphia in private. It's still difficult to talk about, knowing people would comment on how he seemed in great shape. \"But that's not what an eating disorder is,\" he said. \"An eating disorder is not being able to think about your body, what you eat, what you put into your body rationally. \"And I think that's something that people don't necessarily understand with eating disorders, which is why going through that, I went through it alone. \"Because I was embarrassed to be thinking about those things. I didn't think anybody would believe me.\" To this day, Daley feels people online are dismissive of his concerns. In interviews, he grates when it is pointed out that in retirement he is not fat. \"I'm constantly reminded of that,\" he said. \"So it's definitely something that triggered the way that I think about my relationship with food.\" This is not to take away from how fondly Daley looks back on a career that saw him reach the pinnacle with Olympic gold in 2021 at the pandemic-delayed Olympics. Read more from Sky News:Trump furious over Wall Street's 'TACO' digScottish government scraps plan for new national park There is no sign of coming out of retirement again as he did in Paris last year. \"I feel incredibly proud of what I've been able to achieve in terms of my perseverance and resilience through lots of different things,\" he said. \"I do miss being on that diving board. \"It is like there is no other feeling than being on top of a diving board in a competition where you're putting all of the work that you put in into that 1.6 seconds and I think I will forever miss that.\""
    },
    {
        "title": "The fight for the Arctic - where climate change is giving Russia room to manoeuvre",
        "description": "The twin threats of climate change and Russian malign activity in the Arctic must be taken \"deadly seriously,\" David Lammy has warned.",
        "url": "https://news.sky.com/story/the-fight-for-the-arctic-where-climate-change-is-giving-russia-room-to-manoeuvre-13376706",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-svalbard-norway_6930846.jpg?20250529235214",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-05-29 22:17:00",
        "Headline": "Sky News joined David Lammy on the furthest reaching tour of the Arctic by a British foreign secretary. We travelled to Svalbard - where melting ice is giving Russia more freedom to manoeuvre. ",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  The twin threats of climate change and Russian malign activity in the Arctic must be taken \"deadly seriously,\" David Lammy has warned. Sky News joined him on the furthest reaching tour of the Arctic by a British foreign secretary. We travelled to Svalbard - a Norwegian archipelago that is the most northern settled land on Earth, 400 miles from the North Pole. It is at the heart of an Arctic region facing growing geopolitical tension and feeling the brunt of climate change. Mr Lammy told us the geopolitics of the region must be taken \"deadly seriously\" due to climate change and \"the threats we're seeing from Russia\". We witnessed the direct impact of climate change along Svalbard's coastline and inland waterways. There is less ice, we were told, compared to the past. The melting ice is opening up the Arctic and allowing Russia more freedom to manoeuvre. \n                  'What did they do to be burned and bombed?': Charity calls on UK to offer Gaza children life-saving treatment\n                 \n                  UK charity calls on government to rescue two children in Gaza\n                 \n                  Israel accepts US Gaza ceasefire plan - while Hamas says it's 'under discussion'\n                 \"We do see Russia's shadow fleet using these waters,\" Mr Lammy said. \"We do see increased activity from submarines with nuclear capability under our waters and we do see hybrid sabotage of undersea cables at this time.\" In Tromso, further south, the foreign secretary was briefed by Norwegian military commanders. Vice Admiral Rune Andersen, the Chief of Norwegian Joint Headquarters, told Sky News the Russian threat was explicit. \"Russia has stated that they are in confrontation with the West and are utilising a lot of hybrid methods to undermine Western security,\" he said. But it's not just Vladimir Putin they're worried about. Norwegian observers are concerned by US president Donald Trump's strange relationship with the Russian leader too. Karsten Friis, a Norwegian defence and security analyst, told Sky News: \"If he's too soft on Putin, if he is kind of normalising relations with Russia, I wouldn't be surprised. \"I would expect Russia to push us, to test us, to push borders, to see what we can do as Europeans.\" Changes in the Arctic mean new challenges for the NATO military alliance - including stepping up activity to deter threats, most of all from Russia. More from Sky News:Trump doubles down on Putin criticismWhy Russian troops are gathering near 'fortress city' In Iceland, we toured a NATO airbase with the foreign secretary. There, he said maintaining robust presence in the Arctic was essential for western security. \"Let's be clear, in this challenging geopolitical moment the high north and the Arctic is a heavily contested arena and we should be under no doubt that NATO and the UK need to protect it for our own national security.\" This is also about distracting Russia, drawing away resources that could have been used in the war in Ukraine and deterring it in the future. Because the more Arctic opens up, the more this once pristine wilderness is becoming the arena of national rivalry and potentially conflict."
    },
    {
        "title": "'What did they do to be burned and bombed?': Charity calls on UK to offer Gaza children life-saving treatment",
        "description": "A British charity has written to the prime minister and foreign secretary, urging them to allow seriously ill children from Gaza into the UK to receive life-saving medical treatment.",
        "url": "https://news.sky.com/story/what-did-they-do-to-be-burned-and-bombed-charity-calls-on-uk-to-offer-gaza-children-life-saving-treatment-13376552",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-children_6930585.jpg?20250529172428",
        "type": "World",
        "Author": "Alex Crawford",
        "Date Published": "2025-05-29 16:01:00",
        "Headline": "Project Pure Hope has identified two children in Gaza who urgently need help, including a three-year-old who was badly burnt when an Israeli airstrike hit the family home. His pregnant mother and father were both killed. ",
        "Content": "\n          Special correspondent\n              @AlexCrawfordSky\n  A British charity has written to the prime minister and foreign secretary, urging them to allow seriously ill children from Gaza into the UK to receive life-saving medical treatment. Warning: This article contains images readers may find distressing The co-founder of Project Pure Hope told Sky News it was way past the time for words. \"Now, we need action,\" Omar Dinn said. He's identified two children inside Gaza who urgently need help and is appealing to the UK government to issue visas as a matter of urgency. Israel-Gaza latest: Netanyahu reportedly accepts US ceasefire plan Britain has taken only two patients from Gaza for medical treatment in 20 months of Israeli bombardment. \"Most of the people affected by this catastrophe that's unfolding in Gaza are children,\" he continued. \"And children are the most vulnerable. \"They have nothing to do with the politics, and we really just need to see them for what they are. \"They are children, just like my children, just like everybody's children in this country - and we have the ability to help them.\" Sky News has been sent video blogs from British surgeons working in Gaza right now which show the conditions and difficulties they're working under. They prepare for potential immediate evacuation whilst facing long lists, mainly of children, needing life-saving emergency treatment day after day. Dr Victoria Rose told us: \"Every time I come, I say it's really bad, but this is on a completely different scale now. It's mass casualties. It's utter carnage. \"We are incapable of getting through this volume. We don't have the personnel. We don't have the medical supplies. And we really don't have the facilities. \"We are the last standing hospital in the south of Gaza. We really are on our knees now.\" One of her patients is three-year-old Hatem, who was badly burned when an Israeli airstrike hit the family apartment. His pregnant mother and father were both killed, leaving him an orphan. He has 35 percent burns on his small body. \"It's a massive burn for a little guy like this,\" Dr Rose says. \"He's so adorable. His eyelids are burnt. His hands are burnt. His feet are burnt.\" Hatem's grandfather barely leaves his hospital bedside. Hatem Senior told us: \"What did these children do wrong to suffer such injuries? To be burned and bombed? We ask God to grant them healing.\" The second child identified by the charity is Karam, who, aged one, is trying to survive in a tent in deeply unhygienic surroundings with a protruding intestine. He's suffering from a birth defect called Hirschsprung disease, which could be easily operated on with the right skills and equipment - unavailable to him in Gaza right now. Read more:Gaza doctor's nine children killedHow the new Gaza aid rollout collapsed Karam's mother Manal told our Gaza camera crew: \"No matter how much I describe how much my son is suffering, I wouldn't be able to describe it enough. I swear I am constantly crying.\" Children are among the bulk of casualties - some 16,000 have been killed, according to the latest figures from local health officials - and make up the majority of those being operated on, according to the British surgical team on the ground."
    },
    {
        "title": "Israel accepts US Gaza ceasefire plan - while Hamas says it's 'under discussion'",
        "description": "Israel has accepted a US-proposed plan for a ceasefire in Gaza, according to the White House, while Hamas says the deal is still \"under discussion\".",
        "url": "https://news.sky.com/story/israel-accepts-us-gaza-ceasefire-plan-while-hamas-says-its-under-discussion-13376680",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-israeli-tanks-army_6930405.jpg?20250529150007",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-29 20:55:00",
        "Headline": "The US proposal reportedly calls for a 60-day pause in fighting and the release of nine living hostages. Israel would retain the right to resume military action in Gaza.",
        "Content": "Israel has accepted a US-proposed plan for a ceasefire in Gaza, according to the White House, while Hamas says the deal is still \"under discussion\". Israeli news outlets reported earlier on Thursday that Benjamin Netanyahu had accepted the plan put forward by Donald Trump's Middle East envoy, Steve Witkoff, and told the families of hostages still in Gaza. It reportedly calls for a 60-day pause in fighting, and the release of nine living hostages and half of the known hostages who have died, over the course of a week. Israel and Hamas would then continue talks to bring the remaining hostages home, but Israel would retain the right to resume military action in Gaza if talks were to break down.  White House press secretary Karoline Leavitt later confirmed Israel \"backed and supported\" Mr Witkoff's proposal, but said talks were ongoing. Sami Abu Zuhri, a senior official for Hamas, told Reuters that the proposal failed to meet their demands - to end the war, for Israeli troops to withdraw from Gaza, and to allow aid into the territory. Another senior official, Basim Naim, said to the news agency, however, that the proposal was \"under discussion\". Read more:Hamas's Gaza chief 'eliminated', claims NetanyahuInside 'terrorised' West Bank village Gaza hospital told evacuate - doctor It comes as a doctor said the Israeli army wanted to evacuate al Awda Hospital - one of the last functioning medical centres in northern Gaza. Dr Rami al Ashrafi told the Associated Press that the hospital had been encircled by Israeli troops and had come under fire in recent days. He said there were 82 staff members, including doctors, and seven patients left at the hospital, after dozens were already evacuated on Tuesday. Israeli authorities issued evacuation orders last week for large parts of northern Gaza ahead of offensives against Hamas, although the army did not order the hospital itself to evacuate.  Third aid site opened It also comes as the Gaza Humanitarian Foundation expanded its aid distribution to a third site, as multiple Palestinians reported chaos at the hubs. Witnesses told the Associated Press they saw a free-for-all of people grabbing aid, and claimed Israeli troops opened fire to control crowds, at all three hubs. Read more:How the rollout of new Gaza aid system collapsed into chaos  Meanwhile, the names of thousands of children killed in Gaza were read out at a vigil held in Westminster - with actors including Steve Coogan and Juliet Stevenson taking part. Coogan told Sky News' lead world news presenter Yalda Hakim he was in London \"to protest about the, basically, enforced starvation of thousands of women and children in Gaza by the weaponisation of the blockade on aid to those people\".  More than 54,000 Palestinians have died during Israel's war in Gaza, which was launched after more than 1,200 Israelis were killed and a further 250 were taken hostage in a Hamas attack in October 2023. The figure comes from the Hamas-run Gaza Health Ministry, which does not distinguish between civilians and members of Palestinian armed groups. However, the ministry says the figure includes more than 12,000 dead children."
    },
    {
        "title": "'We carry our coffins with us': For Gaza's paramedics, every shift could be their last",
        "description": "In Gaza, the frontline is not just where the bombs fall - it's where the ambulances arrive.",
        "url": "https://news.sky.com/story/we-carry-our-coffins-with-us-for-gazas-paramedics-every-shift-could-be-their-last-13376580",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-paramedic_6930617.jpg?20250529181527",
        "type": "World",
        "Author": "Alistair Bunkall, Middle East correspondent and Celine Alkhaldi, Middle East producer",
        "Date Published": "2025-05-29 16:43:00",
        "Headline": "Sky News has spent several days filming with emergency crews based at Shifa Hospital in Gaza. They say in a war where medics are no longer spared, every shift could be their last.",
        "Content": "By Alistair Bunkall, Middle East correspondent and Celine Alkhaldi, Middle East producer   In Gaza, the frontline is not just where the bombs fall - it's where the ambulances arrive. When an Israeli airstrike hit a busy market in Gaza City today, people were queuing for flour. Minutes later, medics were picking up body parts. The bodies were heaved onto stretchers, mutilated limbs twisted unnaturally. Blood soaked the concrete. Israel-Gaza latest: Netanyahu reportedly accepts US ceasefire plan Sky News has spent several days filming with emergency crews based at Shifa Hospital, Gaza's largest medical complex and one that has itself come under repeated attack. There are few paramedics left, and fewer ambulances. Fuel is low. Equipment is basic. They operate in one of the most dangerous places in the world, where the medics themselves are no longer spared. \"There is no safety\", says Hamdallah Ali Daher, a paramedic from Jabalia Camp in northern Gaza. \"When we respond to a strike, drones are still overhead. They targeted my colleague in one of our vehicles. You could be walking any day and get hit.\" The danger is constant. Daher describes how they operate under the hum of drones, often arriving at scenes where smoke still rises from the wreckage. \"We go out risking life and limb\", he says. \"We carry our coffins with us.\" 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 One of his colleagues, Alaa al-Hadidi, was killed in a drone strike in December last year. His fellow medics buried him. Israel has accused Hamas of using ambulances to move around Gaza disguised. Wael Eleywa, another paramedic, has worked throughout the more than 600 days of war. \"What affects us the most is the children\", he says. \"After a mission, you begin to imagine the injured children as your own relatives. These images stay with you and get mixed in your mind.\" \"Some of us have had to pull family members from the rubble.\" Read more:Charity calls government to rescue two children in GazaGaza doctor's nine children killedHow the new Gaza aid rollout collapsed He describes responding to scenes where tents have caught fire after a strike - children burned inside. \"There's no mental peace in this job\", he adds. \"But the work still needs to be done.\" The war, now nearing its twentieth month, has severely degraded Gaza's emergency response network. Many hospitals are no longer functioning. The roads are dangerous or impassable. The strikes come during the day and in the dark of night. Combat zones shift daily. \"There is no protocol anymore\", Eleywa says. \"We are medics in name, but the occupation doesn't distinguish between civilians, or paramedics or anyone else. Even with permits, they detain or target us.\" Daher echoes the plea: \"To all people, to all organisations - we need protection. We are trying to provide safety in a place where safety can't exist.\" Despite the horror, there is also resolve. \"We lean on and support each other as colleagues\", says Daher. \"Before the strikes, we're often together laughing, trying to lift each other up. Then the call comes, and we go.\" The medics speak with the matter-of-fact calm of those who have seen too much. As they race between ruins and hospitals, they know that each shift could be their last. \"In this field of work\", Eleywa says, \"we prepare for the worst, and go. Safety is out of reach.\""
    },
    {
        "title": "How the rollout of new Gaza aid system collapsed into chaos",
        "description": null,
        "url": "https://news.sky.com/story/how-the-rollout-of-new-gaza-aid-system-collapsed-into-chaos-13376284",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-aid-data-forensics_6929924.jpg?20250528220641",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-29 06:46:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "Trump's key economic policy has just been undermined - and the president will be seething",
        "description": "This is a huge decision by an obscure Manhattan court. President Trump's core economic policy has just been comprehensively undermined, he has been undermined, and he will be seething.",
        "url": "https://news.sky.com/story/trumps-key-economic-policy-has-just-been-undermined-and-the-president-will-be-seething-13376252",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-white-house_6914669.jpg?20250513020804",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-05-29 04:37:00",
        "Headline": "The obvious strategy now for him would be to get tariffs through Congress - but would they pass even with his narrow majorities? Maybe not.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n This is a huge decision by an obscure Manhattan court. President Trump's core economic policy has just been comprehensively undermined, he has been undermined, and he will be seething. Beyond the upending of his policy agenda, the ruling will electrify the deepening schism between the administration and the judiciary, furthering the sense of constitutional crisis in this country. Donald Trump's tariffs encapsulate his identity. They are the centrepiece of his economic platform. They are the tool with which he has tried to exert a sense of global authority. They are the levers in his \"art of the deal\". 👉 Follow Trump100 on your podcast app 👈   We all remember Trump's Liberation Day - 2 April. With great fanfare, in the White House Rose Garden, the president revealed a percentage for each country around the world. He had governments, in capitals globally, hooked and wincing. It was the dramatic opening salvo in his efforts to reciprocate against countries who he perceived to be ripping off America, to balance deficits, and to give himself negotiating leverage. \n                  'Harvard isn't Harvard anymore': The crucible of free speech lacking the freedom it once had\n                 \n                  Federal judges rule Trump tariffs can stay in place for now - as president rages at trade court's 'country threatening decision'\n                 \n                  Donald Trump furious over Wall Street's 'TACO' dig – how did his tariffs spark the phrase? \n                 It was a day which upended global trade and sent economies, markets and companies into tailspins. And after all that, late on Wednesday, a panel of three judges on the US Court of International Trade found all the tariffs to be unlawful and permanently \"vacated\" them. Since Liberation Day, there have been about half a dozen lawsuits challenging the president's ability to impose tariffs without the approval of Congress. But this was the first federal court legal ruling against him. The US constitution stipulates that only Congress, not the president, has the authority to levy taxes. However, Congress does permit the president to impose tariffs unilaterally for national security reasons. And that was the provision President Trump had exploited on his Liberation Day. He imposed his tariffs by declaring a \"national economic emergency\". He invoked the 1977 International Emergency Economies Powers Act (IEEPA). Essentially he seized presidential authority arguing it was a matter of America's national security to fix the economy and he concluded that tariffs were the answer. But in this obscure Manhattan courthouse, the three judges, appointed over the years by Ronald Reagan, Barack Obama and Mr Trump himself (during his first term), have ruled that his executive orders are \"invalid, as contrary to law\". Their ruling states: \"We do not read the IEEPA to delegate an unbounded tariff authority to the president,\" adding Mr Trump's \"worldwide and retaliatory tariffs lack any identifiable limits\". The judges say the IEEPA has limited authorities which may be exercised only to \"deal with an unusual and extraordinary threat with respect to which a national emergency has been declared… and may not be exercised for any other purpose.\"  The ruling also applies to his tariffs against China, Mexico and Canada, designed to combat fentanyl coming into the United States. The ruling will significantly deepen the wedge between Trump's administration and the judiciary which has disrupted many aspects of his presidency by finding him to be acting contrary to the law and the constitution Within minutes of the ruling being issued, senior White House staff were reacting to rather than dismissing the ruling. Deputy chief of staff Stephen Miller, writing on X, said \"the judicial coup\", as he puts it, is out of control. Within an hour of the ruling being made public, White House spokesman Kush Desai said: \"It is not for unelected judges to decide how to properly address a national emergency. President Trump pledged to put America First, and the administration is committed to using every lever of executive power to address this crisis and restore American greatness.\"  Stock futures jumped at the news. Governments and businesses across Europe and beyond will be waking up wondering what it means for them. Do the tariffs just dissolve? It's not clear. Tariffs are being imposed as goods pass over borders right now - what are the mechanisms to lift them? We don't yet know. It's a new layer of uncertainty and confusion. The president's lawyers are appealing. But assuming the ruling stands, there is a broader point to all this. It profoundly undermines Mr Trump's strategy - because he uses tariffs as a negotiating tactic and as a revenue generator. It undermines a broader strategy too - because to get round numerous constitutional barriers, his administration has simply declared \"emergencies\" - a border emergency, an economic emergency - and the courts are now calling him out.  This court hasn't said the tariffs are wrong, economically. That is not its remit. The judges have simply been asked to interpret the law and the constitution. They have concluded that the president does not have the authority to impose tariffs. That's the law, Mr President. The obvious strategy now for him would be to engage Congress - to try to get his legislation through the proper way. But would Congress pass such sweeping tariffs even with his narrow majorities? Maybe not. That's democracy, Mr President. A central tenet of Mr Trump's agenda has just been upended. It's just another twist in this remarkable presidency."
    },
    {
        "title": "Israel's illegal settlements - and those fighting back",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>     ",
        "url": "https://news.sky.com/story/israels-illegal-settlements-and-those-fighting-back-13376524",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-daily-podcast-israel_6930510.png?20250529163324",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-29 15:21:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈  Israel has authorised 22 new Jewish settlements in the occupied West Bank, including legalising unauthorised outposts. Such settlements are considered illegal under international law - a designation Israel disputes. There's nothing new about settlements, they've been popping up in the area since 1967. But since the Hamas attack on 7 October, tensions have intensified. On the Sky News Daily, Niall Paterson is joined by our international correspondent Alex Rossi and producer Orly Halpern, who have visited the Palestinian village of Ras al-Ayn, where activists on the ground have reported a surge in violence and intimidation by Israeli settlers aimed at driving Palestinian families from their homes. Editor: Philly Beaumont Producer: Jada Kai Meosa John "
    },
    {
        "title": "Mother who sold daughter for £800 jailed in South Africa",
        "description": "A mother has been sentenced to life in prison after she kidnapped and trafficked her own six-year-old daughter.",
        "url": "https://news.sky.com/story/mother-who-sold-daughter-for-163800-jailed-in-south-africa-13376351",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-joshlin-smith-south-africa_6481678.jpg?20240307131938",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-29 09:42:00",
        "Headline": "One witness told a court Kelly Smith said she sold her daughter to a sangoma, a traditional healer, for 20,000 rand and that the girl was wanted for her \"eyes and skin\".",
        "Content": "A mother has been sentenced to life in prison after she kidnapped and trafficked her own six-year-old daughter. Kelly Smith, whose full name is Racquel Chantel Smith, her boyfriend Jacquen Appollis and their friend Steveno Van Rhyn were convicted of the crimes in South Africa after Joshlin Smith disappeared from Saldanha, in Western Cape, last year. The youngster has not been seen since and remains missing following a nationwide police hunt.   During the trial, one witness said Smith had told her she sold her daughter to a sangoma, a traditional healer, for 20,000 rand (£830). She added the girl was wanted for her \"eyes and skin\". The three defendants had previously pleaded not guilty. Smith won sympathy across South Africa in the early days of Joshlin's disappearance and neighbours even helped the police in their search efforts. The mother claimed she had left Joshlin with Appollis on the day she disappeared, before Smith too was arrested. In court documents, the prosecution said Smith had been planning to sell not just Joshlin, but her other two children as well. They also said Smith and Joshlin were seen getting into a white vehicle with a bag of clothes the day the girl was reported missing. Read more from Sky News:US court blocks Trump's global tariffsMudslide buries Swiss mountain villageAndrew Tate and brother charged with rape Announcing their sentences on Thursday, high court judge Nathan Erasmus said the fact Smith, Appollis and Van Rhyn were drug users was no excuse. \"There is nothing that I can find that is redeeming and deserving of a lesser sentence than the harshest I can impose,\" the judge said."
    },
    {
        "title": "This gravely ill girl has been ordered to leave the US by the White House - but doctors say she could die within days",
        "description": "In a lawyer's office in downtown Los Angeles, a little girl sits at a desk made for adults - tiny trainers dangling off the edge of a swivel chair.",
        "url": "https://news.sky.com/story/this-gravely-ill-girl-has-been-ordered-to-leave-the-us-by-the-white-house-but-doctors-say-she-could-die-within-days-13376246",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-deysi-sofia_6930004.jpg?20250529063407",
        "type": "World",
        "Author": "Martha Kelner",
        "Date Published": "2025-05-29 03:35:00",
        "Headline": "The four-year-old is receiving a cutting-edge treatment that is keeping her alive - but her mother has received a letter saying she must return to Mexico.",
        "Content": "\n          US correspondent\n              @marthakelner\n  In a lawyer's office in downtown Los Angeles, a little girl sits at a desk made for adults - tiny trainers dangling off the edge of a swivel chair. She's surrounded by dozens of TV cameras but has no understanding of why she's suddenly the centre of attention. Sofia, whose real name we are not using, is a gravely ill four-year-old caught in the crosshairs of Donald Trump's sweeping and often indiscriminate immigration policy. The White House has ordered she leaves the US immediately, but Sofia's doctors at the Children's Hospital Los Angeles say that - if she is sent back to her home country of Mexico and her treatment stops - she could die within days. As Sofia places rainbow stickers carefully in a book and plays snap, the lawyers fighting for her to remain in the US speak at a podium on her behalf. \"We're sending them to die,\" Gina Amato Lough, a lawyer for the pro bono firm Public Counsel, says. \"That's not justice and it doesn't make us any safer. We cannot let our country turn its back on this child.\" Sofia wears a backpack for 14 hours at night and four hours during the day which keeps her alive - containing nutrients she can't absorb naturally. It is cutting-edge healthcare only available in the US. She was born with short bowel syndrome, a debilitating and life-threatening condition that meant she spent most of the first two years of her life in hospital. Under the Biden administration, Sofia and her mother Deysi entered the US legally in July 2023 - granted humanitarian parole to access medical care for two years. But in April - three months into Donald Trump's presidency - the 28-year-old received a letter from the Department of Homeland Security, informing her that the family's right to stay in the country was being revoked. \"It is time to leave the United States,\" the first line of the letter reads. \"Even before getting the letters, I would hear in the news how many people are being deported, even with humanitarian paroles, and I worried a lot,\" Deysi says. \"I was always walking down the street looking over my shoulder, there is so much fear and so much anxiety, it's very hard. \"It's always in my mind that my daughter can die. It may not sound real, but it is really what will happen if my daughter is not connected to her treatment.\" Sofia's lawyers warn that if there is an interruption to her treatment, her doctors say it could be \"fatal within days\". The lawyers have written to officials within the Trump administration, but say they haven't heard back yet. \"It seems as if nobody noticed that this child is four years old and that she will die without her treatment,\" Ms Lough says. \"And not only have they not responded, but they have continued sending notices to the family verifying that their status has been cancelled and that they are required to leave the United States immediately. \"Sofia's doctors have been clear that she will die within days. Deporting this family under these conditions is not only unlawful, it constitutes a moral failure that violates the basic tenets of humanity and decency.\" Read more US news:US court blocks Trump's sweeping tariffsElon Musk leaves role in administration In a statement, the Department of Homeland Security said: \"Any reporting that [the family] are actively being deported are FALSE. This family applied for humanitarian parole on May 14, 2025, and the application is still being considered.\" When approached by Sky News, Trump's border czar Tom Homan denied specific knowledge of Sofia's case, but said he would instruct the White House press office to \"look into\" the circumstances. For now, Sofia is a tiny symbol of the human casualties of often unbending and ruthless immigration policy."
    },
    {
        "title": "Federal judges rule Trump tariffs can stay in place for now - as president rages at trade court's 'country threatening decision'",
        "description": "A federal appeals court has ruled that Donald Trump's sweeping international tariffs can remain in place for now, a day after three judges ruled the president exceeded his authority.",
        "url": "https://news.sky.com/story/federal-judges-rule-trump-tariffs-can-stay-in-place-for-now-as-president-rages-at-trade-courts-country-threatening-decision-13376709",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump_6930518.jpg?20250529164150",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-29 22:44:00",
        "Headline": "Donald Trump said the trade court's ruling that the tariffs exceeded his authority was a \"horrible, country threatening decision\".",
        "Content": "A federal appeals court has ruled that Donald Trump's sweeping international tariffs can remain in place for now, a day after three judges ruled the president exceeded his authority. The Court of Appeals for the Federal Circuit (CAFC) has allowed the president to temporarily continue collecting tariffs under emergency legislation while it considers the government's appeal. It comes after the Court of International Trade blocked the additional taxes on foreign-made goods after its three-judge panel ruled that the Constitution gives Congress the power to levy taxes and tariffs - not the president. The judges also ruled Mr Trump exceeded his authority by invoking the 1977 International Emergency Economic Powers Act. The CAFC said the lower trade court and the Trump administration must respond by 5 June and 9 June, respectively. Trump calls trade court 'backroom hustlers' Posting on Truth Social, Mr Trump said the trade court's ruling was a \"horrible, Country threatening decision,\" and said he hopes the Supreme Court would reverse it \"QUICKLY and DECISIVELY\". After calling into question the appointment of the three judges, and suggesting the ruling was based on \"purely a hatred of 'TRUMP',\" he added: \"Backroom 'hustlers' must not be allowed to destroy our Nation!  \"The horrific decision stated that I would have to get the approval of Congress for these Tariffs. In other words, hundreds of politicians would sit around D.C. for weeks, and even months, trying to come to a conclusion as to what to charge other Countries that are treating us unfairly. \"If allowed to stand, this would completely destroy Presidential Power -- The Presidency would never be the same!\" The US president unveiled the controversial measures on \"Liberation Day\" in April, which included a 10% tariff on UK imports and caused aggressive sell-offs in the stock market. Mr Trump argued he invoked the decades-old law to collect international tariffs because it was a \"national emergency\".  Tariffs 'direct threat' to business - Schwab The trade court ruling marked the latest legal challenge to the tariffs, and related to a case brought on behalf of five small businesses that import goods from other countries. Jeffrey Schwab, senior counsel for the Liberty Justice Center - a nonprofit representing the five firms - said the appeal court would ultimately agree that the tariffs posed \"a direct threat to the very survival of these businesses\". Read more:Trump reduces Chicago gang founder's sentence after Ye lobbying'I was going to die with this': Ex-Diddy assistant breaks downTrump furious over 'TACO' dig - what inspired the phrase? US treasury secretary Scott Bessent also told Fox News on Thursday that the initial ruling had not interfered with trade deal negotiations with partners. He said that countries \"are coming to us in good faith\" and \"we've seen no change in their attitude in the past 48 hours,\" before saying he would meet with a Japanese delegation in Washington on Friday."
    },
    {
        "title": "Former Sean 'Diddy' Combs assistant breaks down as she tells trial of alleged sexual assaults: 'I thought I was going to die with this'",
        "description": "A former employee of Sean \"Diddy\" Combs broke down in tears as she described being sexually assaulted by the hip-hop star on several occasions - telling the court the alleged abuse was \"the most traumatising, worst thing that's ever happened to me\".",
        "url": "https://news.sky.com/story/former-sean-diddy-combs-assistant-breaks-down-as-she-tells-trial-of-alleged-sexual-assaults-i-thought-i-was-going-to-die-with-this-13376585",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sean-combs-diddy-trial_6930676.jpg?20250529195629",
        "type": "US",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-29 17:02:00",
        "Headline": "Mia* - not her real name - is the second alleged victim to testify against Sean \"Diddy\" Combs, following his former partner Cassie's evidence in the first week. She told the trial she had never spoken about alleged sexual assaults until the investigation into the hip-hop star.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n A former employee of Sean \"Diddy\" Combs broke down in tears as she described being sexually assaulted by the hip-hop star on several occasions - telling the court the alleged abuse was \"the most traumatising, worst thing that's ever happened to me\". Three weeks into the trial, Mia* is the second alleged victim to testify against Combs, following his former partner Cassie's evidence alleging years of physical, sexual and emotional abuse. While Cassie waived her right to anonymity, Mia did not want to be identified and is appearing in court in Manhattan, New York, under a pseudonym. She started by telling the court about witnessing Combs, 55, being violent towards Cassie, before moving on to talk about her own experiences. Diddy trial day twelve - as it happened Mia told the court she once woke to find Combs on top of her and that he forced her to have sex against her will. Another time, he forced her to perform oral sex, she alleged. He also once threw a bucket of ice on her head and slammed her arm into a door on another occasion, she said. The court heard Mia had never told anyone about the alleged sexual assaults by Combs until she spoke to government investigators for this case. \"I was going to die with this,\" she said, becoming tearful on the stand. \"I didn't want anyone to know ever.\" Telling the court she could not say \"no\" to her former boss, she said: \"I knew his power. And his control. I didn't want to lose everything that I worked so hard for.\" She also said she feared being attacked and was \"always\" worried about being physically hurt by Combs. \"I didn't want to die or get hurt.\" Mia said she felt \"desperate\", \"terrified and trapped\" and described the alleged sexual assaults as \"the most shameful thing of my life\", and \"the most traumatising, worst thing that's ever happened to me\". Asked why she is speaking out now, she told the court: \"Because I have to tell the truth.\" 'Chaotic and toxic' Mia, faltering at times, said working for Combs came with extreme highs and lows. Sometimes he would offer advice and act like her \"protector\", she said. Other times, he would \"humiliate\" her and berate her for small mistakes, and work her so hard she had little sleep, she said. \"It was chaotic. It was toxic,\" she told the court. Combs's employees were always on edge because his mood could \"change in a split second\", causing everything to go from \"happy to chaotic\", she said. Mia told how she was barely at home once she started working for Combs. Like other employees, she often slept at his properties in LA, Miami and New York. She told the court she was not allowed to leave without his permission and was not allowed lock her door, even though it seemed as if other members of the predominantly male security staff were able to do so. \"This is my house. No one locks the doors,\" Combs allegedly said to her. On one occasion, Mia said she worked without sleeping for five days, with prescription drugs getting her through it. It was only when she had a physical breakdown that Combs allowed her to sleep, jurors were told. Mia's testimony echoed that of prior prosecution witnesses, including several of Combs's other former employees, as well as Cassie. Cassie, an R'n'B singer and model whose legal name is Casandra Ventura, spoke for four days during the first week of the trial. She told jurors her ex-partner subjected her to hundreds of \"freak offs\" - drug-fuelled marathons in which she said she engaged in sex acts with male sex workers while he watched and filmed them. Heavily pregnant at the time, it was confirmed in court yesterday that she gave birth to her third child earlier this week. Mia is the second of three women testifying about alleged sexual abuse by Combs. The third woman, using the pseudonym \"Jane\", is also expected to testify about participating in freak offs. Combs has pleaded not guilty to charges of sex trafficking, racketeering conspiracy and transportation to engage in prostitution. During their opening statement, his lawyers conceded he could be violent at times, but said that did not make him a sex trafficker or racketeering leader. Combs denies using threats or his music industry clout to commit or cover up abuse. What did Mia say about Cassie? In the first part of her testimony, Mia told the court she saw Combs beating Cassie on several occasions and that she sustained injuries, including black eyes, other bruises, and fat lips. The two became friends, she said, and are still friends today. Mia described a party at Prince's house that she and Cassie \"snuck out\" to, saying Prince's security had to intervene when Combs turned up and started to attack her. Read more:Everything you need to know about the Sean Combs trialThe rise and fall of Sean 'Diddy' CombsWhat we learned from Cassie's testimony She also described a trip to a private island in Turks and Caicos, in the Caribbean, saying she remembers Cassie being \"terrified\" as Combs banged on her door \"screaming\". On another occasion during that trip, they used paddle boards to go out to sea to get away from him, she said - but the weather changed and the sky turned dark. \"I was trying to weigh if it was scarier to face Mother Nature or go back to Puff,\" Mia said, using the name she knew him by. \"We eventually went back to Puff.\" Combs was also abusive to Cassie at the Cannes Film Festival in 2012, the court was told. Mia alleged she saw him digging his nails into her as they watched a film. Mia's testimony will continue when the trial resumes on Friday."
    },
    {
        "title": "This gravely ill girl has been ordered to leave the US by the White House - but doctors say she could die within days",
        "description": "In a lawyer's office in downtown Los Angeles, a little girl sits at a desk made for adults - tiny trainers dangling off the edge of a swivel chair.",
        "url": "https://news.sky.com/story/this-gravely-ill-girl-has-been-ordered-to-leave-the-us-by-the-white-house-but-doctors-say-she-could-die-within-days-13376246",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-deysi-sofia_6930004.jpg?20250529063407",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2025-05-29 03:35:00",
        "Headline": "The four-year-old is receiving a cutting-edge treatment that is keeping her alive - but her mother has received a letter saying she must return to Mexico.",
        "Content": "\n          US correspondent\n              @marthakelner\n  In a lawyer's office in downtown Los Angeles, a little girl sits at a desk made for adults - tiny trainers dangling off the edge of a swivel chair. She's surrounded by dozens of TV cameras but has no understanding of why she's suddenly the centre of attention. Sofia, whose real name we are not using, is a gravely ill four-year-old caught in the crosshairs of Donald Trump's sweeping and often indiscriminate immigration policy. The White House has ordered she leaves the US immediately, but Sofia's doctors at the Children's Hospital Los Angeles say that - if she is sent back to her home country of Mexico and her treatment stops - she could die within days. As Sofia places rainbow stickers carefully in a book and plays snap, the lawyers fighting for her to remain in the US speak at a podium on her behalf. \"We're sending them to die,\" Gina Amato Lough, a lawyer for the pro bono firm Public Counsel, says. \"That's not justice and it doesn't make us any safer. We cannot let our country turn its back on this child.\" Sofia wears a backpack for 14 hours at night and four hours during the day which keeps her alive - containing nutrients she can't absorb naturally. It is cutting-edge healthcare only available in the US. She was born with short bowel syndrome, a debilitating and life-threatening condition that meant she spent most of the first two years of her life in hospital. Under the Biden administration, Sofia and her mother Deysi entered the US legally in July 2023 - granted humanitarian parole to access medical care for two years. But in April - three months into Donald Trump's presidency - the 28-year-old received a letter from the Department of Homeland Security, informing her that the family's right to stay in the country was being revoked. \"It is time to leave the United States,\" the first line of the letter reads. \"Even before getting the letters, I would hear in the news how many people are being deported, even with humanitarian paroles, and I worried a lot,\" Deysi says. \"I was always walking down the street looking over my shoulder, there is so much fear and so much anxiety, it's very hard. \"It's always in my mind that my daughter can die. It may not sound real, but it is really what will happen if my daughter is not connected to her treatment.\" Sofia's lawyers warn that if there is an interruption to her treatment, her doctors say it could be \"fatal within days\". The lawyers have written to officials within the Trump administration, but say they haven't heard back yet. \"It seems as if nobody noticed that this child is four years old and that she will die without her treatment,\" Ms Lough says. \"And not only have they not responded, but they have continued sending notices to the family verifying that their status has been cancelled and that they are required to leave the United States immediately. \"Sofia's doctors have been clear that she will die within days. Deporting this family under these conditions is not only unlawful, it constitutes a moral failure that violates the basic tenets of humanity and decency.\" Read more US news:US court blocks Trump's sweeping tariffsElon Musk leaves role in administration In a statement, the Department of Homeland Security said: \"Any reporting that [the family] are actively being deported are FALSE. This family applied for humanitarian parole on May 14, 2025, and the application is still being considered.\" When approached by Sky News, Trump's border czar Tom Homan denied specific knowledge of Sofia's case, but said he would instruct the White House press office to \"look into\" the circumstances. For now, Sofia is a tiny symbol of the human casualties of often unbending and ruthless immigration policy."
    },
    {
        "title": "Trump's key economic policy has just been undermined - and the president will be seething",
        "description": "This is a huge decision by an obscure Manhattan court. President Trump's core economic policy has just been comprehensively undermined, he has been undermined, and he will be seething.",
        "url": "https://news.sky.com/story/trumps-key-economic-policy-has-just-been-undermined-and-the-president-will-be-seething-13376252",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-white-house_6914669.jpg?20250513020804",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-05-29 04:37:00",
        "Headline": "The obvious strategy now for him would be to get tariffs through Congress - but would they pass even with his narrow majorities? Maybe not.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n This is a huge decision by an obscure Manhattan court. President Trump's core economic policy has just been comprehensively undermined, he has been undermined, and he will be seething. Beyond the upending of his policy agenda, the ruling will electrify the deepening schism between the administration and the judiciary, furthering the sense of constitutional crisis in this country. Donald Trump's tariffs encapsulate his identity. They are the centrepiece of his economic platform. They are the tool with which he has tried to exert a sense of global authority. They are the levers in his \"art of the deal\". 👉 Follow Trump100 on your podcast app 👈   We all remember Trump's Liberation Day - 2 April. With great fanfare, in the White House Rose Garden, the president revealed a percentage for each country around the world. He had governments, in capitals globally, hooked and wincing. It was the dramatic opening salvo in his efforts to reciprocate against countries who he perceived to be ripping off America, to balance deficits, and to give himself negotiating leverage. \n                  'Harvard isn't Harvard anymore': The crucible of free speech lacking the freedom it once had\n                 \n                  Federal judges rule Trump tariffs can stay in place for now - as president rages at trade court's 'country threatening decision'\n                 \n                  Donald Trump furious over Wall Street's 'TACO' dig – how did his tariffs spark the phrase? \n                 It was a day which upended global trade and sent economies, markets and companies into tailspins. And after all that, late on Wednesday, a panel of three judges on the US Court of International Trade found all the tariffs to be unlawful and permanently \"vacated\" them. Since Liberation Day, there have been about half a dozen lawsuits challenging the president's ability to impose tariffs without the approval of Congress. But this was the first federal court legal ruling against him. The US constitution stipulates that only Congress, not the president, has the authority to levy taxes. However, Congress does permit the president to impose tariffs unilaterally for national security reasons. And that was the provision President Trump had exploited on his Liberation Day. He imposed his tariffs by declaring a \"national economic emergency\". He invoked the 1977 International Emergency Economies Powers Act (IEEPA). Essentially he seized presidential authority arguing it was a matter of America's national security to fix the economy and he concluded that tariffs were the answer. But in this obscure Manhattan courthouse, the three judges, appointed over the years by Ronald Reagan, Barack Obama and Mr Trump himself (during his first term), have ruled that his executive orders are \"invalid, as contrary to law\". Their ruling states: \"We do not read the IEEPA to delegate an unbounded tariff authority to the president,\" adding Mr Trump's \"worldwide and retaliatory tariffs lack any identifiable limits\". The judges say the IEEPA has limited authorities which may be exercised only to \"deal with an unusual and extraordinary threat with respect to which a national emergency has been declared… and may not be exercised for any other purpose.\"  The ruling also applies to his tariffs against China, Mexico and Canada, designed to combat fentanyl coming into the United States. The ruling will significantly deepen the wedge between Trump's administration and the judiciary which has disrupted many aspects of his presidency by finding him to be acting contrary to the law and the constitution Within minutes of the ruling being issued, senior White House staff were reacting to rather than dismissing the ruling. Deputy chief of staff Stephen Miller, writing on X, said \"the judicial coup\", as he puts it, is out of control. Within an hour of the ruling being made public, White House spokesman Kush Desai said: \"It is not for unelected judges to decide how to properly address a national emergency. President Trump pledged to put America First, and the administration is committed to using every lever of executive power to address this crisis and restore American greatness.\"  Stock futures jumped at the news. Governments and businesses across Europe and beyond will be waking up wondering what it means for them. Do the tariffs just dissolve? It's not clear. Tariffs are being imposed as goods pass over borders right now - what are the mechanisms to lift them? We don't yet know. It's a new layer of uncertainty and confusion. The president's lawyers are appealing. But assuming the ruling stands, there is a broader point to all this. It profoundly undermines Mr Trump's strategy - because he uses tariffs as a negotiating tactic and as a revenue generator. It undermines a broader strategy too - because to get round numerous constitutional barriers, his administration has simply declared \"emergencies\" - a border emergency, an economic emergency - and the courts are now calling him out.  This court hasn't said the tariffs are wrong, economically. That is not its remit. The judges have simply been asked to interpret the law and the constitution. They have concluded that the president does not have the authority to impose tariffs. That's the law, Mr President. The obvious strategy now for him would be to engage Congress - to try to get his legislation through the proper way. But would Congress pass such sweeping tariffs even with his narrow majorities? Maybe not. That's democracy, Mr President. A central tenet of Mr Trump's agenda has just been upended. It's just another twist in this remarkable presidency."
    },
    {
        "title": "Trump's sweeping tariffs blocked: What happens now?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈  </a>                       ",
        "url": "https://news.sky.com/story/trumps-sweeping-tariffs-blocked-what-happens-now-13376249",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/sky-news-trump-100-saudi-arabia_6913749.jpg?20250519065442",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-29 04:14:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈    A trade court in New York has blocked Trump's 'Liberation Day' tariffs, saying he exceeded his authority in implementing them. The markets have already reacted well, but what now for Trump, who has had one of his most powerful negotiating tactics dismantled? US correspondents Mark Stone and Martha Kelner discuss the ruling and what it means for team Trump. Plus, Martha meets a four-year-old girl with a rare health condition, whose life is in danger following Trump's crackdown on immigration. If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk. Don't forget, you can also watch all episodes on our YouTube channel."
    },
    {
        "title": "Elon Musk leaving role in the Trump administration",
        "description": "Elon Musk is leaving his role in the Trump administration.",
        "url": "https://news.sky.com/story/elon-musk-says-he-is-stepping-down-from-the-trump-administration-13376239",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-elon-musk-donald-trump_6880047.jpg?20250408180721",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-29 00:07:00",
        "Headline": "It came hours after Elon Musk's father Errol told Sky News that his son is \"not a very good politician\" - but was still on top of his businesses.",
        "Content": " Elon Musk is leaving his role in the Trump administration. The billionaire revealed on X that his scheduled time as a \"special government employee\" was coming to an end. Musk had led the newly formed Department of Government Efficiency, with the ambition of sacking federal workers and cutting red tape. \"I would like to thank President Donald Trump for the opportunity to reduce wasteful spending,\" he wrote. A White House official said reports were accurate, and his \"offboarding\" would begin immediately. According to the Reuters news agency, Musk's exit was decided \"at a senior staff level\" - and he did not have a formal conversation with the president before making his announcement on X. It came on the same evening a US court blocked Trump from imposing sweeping global tariffs, with three judges ruling that he had exceeded his authority. \n                  'Harvard isn't Harvard anymore': The crucible of free speech lacking the freedom it once had\n                 \n                  Federal judges rule Trump tariffs can stay in place for now - as president rages at trade court's 'country threatening decision'\n                 \n                  Donald Trump furious over Wall Street's 'TACO' dig – how did his tariffs spark the phrase? \n                  Before the news broke, Elon Musk's father told Sky News that his son was \"not a very good politician\". But speaking to Gillian Joseph on The World, Errol Musk insisted there was \"no rift between Elon and Donald Trump\". Musk's time at DOGE was controversial, with drastic cuts to America's humanitarian efforts sparking particular criticism. Questions have also been raised about whether the department has actually saved taxpayers as much money as suggested. Read more from Sky News:Russian-linked hackers targeted MoD, govt saysAndrew Tate and brother charged with rape in UKTrump doubles down on his criticism of Putin  Musk initially had ambitions to slash government spending by $2trn (£1.5trn) - but this was dramatically reduced to $1trn (£750bn) and then to just $150bn (£111bn). The 53-year-old - who famously brought his son X Æ A-12 to the Oval Office - also expressed frustration about resistance to his ideas, and clashed with other senior members of the Trump administration. He recently told The Washington Post: \"The federal bureaucracy situation is much worse than I realised. I thought there were problems, but it sure is an uphill battle trying to improve things in DC to say the least.\" By law, status as a \"special government employee\" means he could only serve for a maximum of 130 days, which would have ended around 30 May. Nonetheless, Musk has insisted that DOGE will continue to seek savings in his absence - and its mission \"will only strengthen over time as it becomes a way of life throughout the government\". The world's richest man had been facing increasing pressure to divert attention back to his businesses, which include the electric vehicle maker Tesla, the social network X, and SpaceX. Hours earlier, Sky News' US partner CNBC reported that a group of Tesla investors had written an open letter demanding the entrepreneur spend at least 40 hours a week working at the company.  Errol Musk denied that his son had taken his eye off the ball when it came to his companies - noting that Tesla's share price has surged by 100% over the past 12 months. \"There's absolutely no problem. Every third car in the US is a Tesla,\" he said. 👉 Follow Trump100 on your podcast app 👈 It comes one day after Musk criticised the centrepiece of Trump's legislative agenda. While the president has described the mix of tax cuts and enhanced immigration enforcement as his \"big beautiful bill\", Musk argued it was a \"massive spending bill\" that would increase the deficit and undermine DOGE's work."
    },
    {
        "title": "Trump reduces Chicago gang founder's sentence after lobbying by Kanye West",
        "description": "Donald Trump has reduced the sentence of Larry Hoover Sr, a Chicago gang founder, after lobbying from controversial hip-hop artist Kanye West.",
        "url": "https://news.sky.com/story/trump-reduces-chicago-gang-founders-sentence-after-lobbying-by-kanye-west-13376297",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kanye-west-donald-trump_6930117.png?20250529085220",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-29 07:22:00",
        "Headline": "Larry Hoover Sr founded the Gangster Disciples (GD), one of Chicago's most notorious gangs. He was serving multiple life sentences following a 1998 conviction. His supporters say he is now reformed.",
        "Content": "Donald Trump has reduced the sentence of Larry Hoover Sr, a Chicago gang founder, after lobbying from controversial hip-hop artist Kanye West. On Wednesday, the sitting US president commuted the six life sentences that Hoover, founder of the Gangster Disciples (GDs), was serving following a 1998 conviction, Sky News' US partner NBC News reported. It followed a campaign by West, now known as Ye, who has lobbied Mr Trump in the Oval Office over the release, it was reported.   It happened amid a series of pardons which included a former New York congressman, a Connecticut governor, rapper NBA YoungBoy, a labour union leader and a one-time army officer. Hoover, however, NBC said, will not be freed, instead being transferred to a state prison to serve the rest of his 200-year sentence for crimes he was separately convicted of in a state court. The GDs were one of Chicago's most prolific gangs, along with rivals the Black Disciples (BDs). Welcoming the news, West reposted photos of a 2021 \"Free Larry Hoover\" benefit concert with popular artist Drake. He posted on social media, saying: \"WORDS CAN'T EXPRESS MY GRATITUDE FOR OUR DEVOTED ENDURING PRESIDENT DONALD TRUMP FOR FREEING LARRY HOOVER.\" West rose to fame as a rapper and producer, but later began sharing antisemitic content on social media, and selling Swastika T-shirts. Hoover 'one of the most notorious criminals in Illinois history' Hoover was known as the \"chairman of the board\" and the \"king\". He was also declared \"one of the most notorious criminals in Illinois history\", NBC reported. Prosecutors reportedly said he directed violence and drug trafficking in Chicago from at least 1970 until 1995. Larry Hoover Jr, Hoover's son, has called for his father's release for years and was featured in the 2021 Kanye West song Jesus Lord. NBC News reported that, from prison, Hoover has changed the name of the GDs to Growth and Development. He claims to now discourage violence, something federal prosecutors dispute. 'Infinite amounts of universe' During a 2018 Oval Office meeting with Mr Trump, NBC News reported that West urged Mr Trump to commute Hoover's sentence. Read more:Elon Musk leaving role in the Trump administrationTrump halts international student visa applications He reportedly said: \"The reason why they imprisoned him is because he started doing positive for the community. \"He started showing that he actually had power, that he wasn't just one of a monolithic voice, but he could wrap people around. \"So there's theories that there's infinite amounts of universe and there's alternate universe. \"So it's very important for me to get Hoover out, because in an alternate universe, I am him.\""
    },
    {
        "title": "Kool & the Gang's Michael Sumler dies in car crash",
        "description": "Michael Sumler, a long-time member of Kool & the Gang, has died in a car crash.",
        "url": "https://news.sky.com/story/kool-the-gangs-michael-sumler-dies-in-car-crash-13376352",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-mike-sumler-kool-and-the-gand_6930324.jpg?20250529135744",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-29 09:36:00",
        "Headline": "The 71-year-old musician died near Mableton, north of Atlanta, on Sunday night when the car he was driving was involved in a collision with another vehicle.",
        "Content": "Michael Sumler, a long-time member of Kool & the Gang, has died in a car crash. Michael Owens, the mayor of Mableton, north of Atlanta, said in a Facebook post: \"This Memorial Day weekend the world lost a music legend. Michael Sumler, known as \"Chicago Mike\" of Kool and the Gang died in a crash Sunday night on Veterans Memorial Highway near Buckner Road. He was 71.\" He added: \"The city of Mableton, City Council and I join his friends, family and fans in mourning his loss.\" According to local news outlet the Cobb County Courier, the musician's car was involved in a collision with another vehicle. Sumler died at the scene. In a post on Facebook, the band said: \"We're deeply saddened to hear about the passing of our longtime wardrobe valet, Mike Sumler. \"Mike worked alongside Kool & the Gang from 2000-2015, making sure the guys looked their best on stage every night. \"He also hyped the crowd with his energy and dance moves at the top of the show.\" They added: \"Everyone here at Kool & the Gang has fond memories of Mike and will miss him. May he rest in peace.\" Sumler was widely described as a backing vocalist for the pop veterans, who formed in New Jersey in the 1960s and rose to worldwide fame in the following two decades. Adrian Meeks, Sumler's friend, told Fox 5 Atlanta his death came as \"a devastating blow\" to all those who knew him. He said Sumler \"always wanted to see other people succeed in the business that he'd been around most all of his life\". Read more on Sky News:Celebrities urge end to Gaza 'complicity'Gang founder freed after Kanye lobbies Trump Kool & the Gang have undergone numerous changes in personnel and have explored many musical styles throughout their history, including jazz, rhythm and blues, soul, funk, disco, rock, and pop music since releasing their first album in 1969. They have won numerous accolades, including two Grammy Awards, and have sold more than 70 million albums worldwide."
    },
    {
        "title": "Treasury to dispose of final shares in bailed-out NatWest Group",
        "description": "The government is preparing to sell the final publicly owned shares in NatWest Group on Friday, drawing a line under one of the world's biggest bank bailouts after nearly 17 years.",
        "url": "https://news.sky.com/story/treasury-to-dispose-of-final-shares-in-bailed-out-natwest-group-13376575",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-natwest-banking_6455634.jpg?20240214173136",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-29 16:34:00",
        "Headline": "The government’s last-remaining NatWest stock is likely to be sold on Friday, although public confirmation may not arrive until next Monday, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The government is preparing to sell the final publicly owned shares in NatWest Group on Friday, drawing a line under one of the world's biggest bank bailouts after nearly 17 years. Sky News understands that the Treasury is preparing to offload its remaining stake - which is down to roughly 0.1% - in the coming hours, with a public statement likely either later on Friday or on Monday morning. Sources cautioned that the timings were still subject to change. The final disposal of a stake which at one point represented more than 80% of NatWest's share capital has been anticipated for weeks. Last week, Sky News reported that British taxpayers were heading for a loss of just over £10bn on the 2008 rescue of NatWest, then known as Royal Bank of Scotland (RBS), having pumped £45.5bn into the lender to prevent it - and the wider UK financial system - collapsing. Confirmation of the sale of the Treasury's final interest in NatWest will come almost 17 years after the then chancellor, Lord Darling, conducted what RBS's boss at the time, Fred Goodwin, labelled \"a drive-by shooting\". Total proceeds from a government trading plan launched in 2021 to drip-feed NatWest stock into the market have so far reached about £13bn, with the final tally likely to be about £13.2bn. \n                  US trade court blocks Donald Trump from imposing sweeping global tariffs - saying he exceeded his authority\n                 \n                  Trump's key economic policy has just been undermined - and the president will be seething\n                 \n                  Money blog: Pizza Express and British Airways among firms named and shamed for minimum wage failings\n                 In addition, institutional share sales and direct buybacks by NatWest of government-held stock have yielded a further £11.5bn. Dividend payments to the Treasury during its ownership have totalled £4.9bn, while fees and other payments have generated another £5.6bn. In aggregate, that means total proceeds from NatWest since 2008 are expected to hit £35.3bn. Under Rick Haythornthwaite and Paul Thwaite, now the bank's chairman and chief executive respectively, NatWest is now focused on driving growth across its business. It recently tabled an £11bn bid to buy Santander UK, according to the Financial Times, although no talks are ongoing. Mr Thwaite replaced Dame Alison Rose, who left amid the crisis sparked by the debanking scandal involving Nigel Farage, the Reform UK leader. Sky News recently revealed that the bank and Mr Farage had reached an undisclosed settlement. During the first five years of NatWest's period in majority state ownership, the bank was run by Sir Stephen Hester, now the chairman of easyJet. Sir Stephen stepped down amid tensions with the then chancellor, George Osborne, about how RBS - as it them was - should be run. Lloyds Banking Group was also in partial state ownership for years, although taxpayers reaped a net gain of about £900m from that period. Other lenders nationalised during the crisis included Bradford & Bingley, the bulk of which was sold to Santander UK, and Northern Rock, part of which was sold to Virgin Money - which in turn has been acquired by Nationwide. The Treasury and NatWest declined to comment."
    },
    {
        "title": "Trump's key economic policy has just been undermined - and the president will be seething",
        "description": "This is a huge decision by an obscure Manhattan court. President Trump's core economic policy has just been comprehensively undermined, he has been undermined, and he will be seething.",
        "url": "https://news.sky.com/story/trumps-key-economic-policy-has-just-been-undermined-and-the-president-will-be-seething-13376252",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-white-house_6914669.jpg?20250513020804",
        "type": "Business",
        "Author": "Mark Stone",
        "Date Published": "2025-05-29 04:37:00",
        "Headline": "The obvious strategy now for him would be to get tariffs through Congress - but would they pass even with his narrow majorities? Maybe not.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n This is a huge decision by an obscure Manhattan court. President Trump's core economic policy has just been comprehensively undermined, he has been undermined, and he will be seething. Beyond the upending of his policy agenda, the ruling will electrify the deepening schism between the administration and the judiciary, furthering the sense of constitutional crisis in this country. Donald Trump's tariffs encapsulate his identity. They are the centrepiece of his economic platform. They are the tool with which he has tried to exert a sense of global authority. They are the levers in his \"art of the deal\". 👉 Follow Trump100 on your podcast app 👈   We all remember Trump's Liberation Day - 2 April. With great fanfare, in the White House Rose Garden, the president revealed a percentage for each country around the world. He had governments, in capitals globally, hooked and wincing. It was the dramatic opening salvo in his efforts to reciprocate against countries who he perceived to be ripping off America, to balance deficits, and to give himself negotiating leverage. \n                  'Harvard isn't Harvard anymore': The crucible of free speech lacking the freedom it once had\n                 \n                  Federal judges rule Trump tariffs can stay in place for now - as president rages at trade court's 'country threatening decision'\n                 \n                  Donald Trump furious over Wall Street's 'TACO' dig – how did his tariffs spark the phrase? \n                 It was a day which upended global trade and sent economies, markets and companies into tailspins. And after all that, late on Wednesday, a panel of three judges on the US Court of International Trade found all the tariffs to be unlawful and permanently \"vacated\" them. Since Liberation Day, there have been about half a dozen lawsuits challenging the president's ability to impose tariffs without the approval of Congress. But this was the first federal court legal ruling against him. The US constitution stipulates that only Congress, not the president, has the authority to levy taxes. However, Congress does permit the president to impose tariffs unilaterally for national security reasons. And that was the provision President Trump had exploited on his Liberation Day. He imposed his tariffs by declaring a \"national economic emergency\". He invoked the 1977 International Emergency Economies Powers Act (IEEPA). Essentially he seized presidential authority arguing it was a matter of America's national security to fix the economy and he concluded that tariffs were the answer. But in this obscure Manhattan courthouse, the three judges, appointed over the years by Ronald Reagan, Barack Obama and Mr Trump himself (during his first term), have ruled that his executive orders are \"invalid, as contrary to law\". Their ruling states: \"We do not read the IEEPA to delegate an unbounded tariff authority to the president,\" adding Mr Trump's \"worldwide and retaliatory tariffs lack any identifiable limits\". The judges say the IEEPA has limited authorities which may be exercised only to \"deal with an unusual and extraordinary threat with respect to which a national emergency has been declared… and may not be exercised for any other purpose.\"  The ruling also applies to his tariffs against China, Mexico and Canada, designed to combat fentanyl coming into the United States. The ruling will significantly deepen the wedge between Trump's administration and the judiciary which has disrupted many aspects of his presidency by finding him to be acting contrary to the law and the constitution Within minutes of the ruling being issued, senior White House staff were reacting to rather than dismissing the ruling. Deputy chief of staff Stephen Miller, writing on X, said \"the judicial coup\", as he puts it, is out of control. Within an hour of the ruling being made public, White House spokesman Kush Desai said: \"It is not for unelected judges to decide how to properly address a national emergency. President Trump pledged to put America First, and the administration is committed to using every lever of executive power to address this crisis and restore American greatness.\"  Stock futures jumped at the news. Governments and businesses across Europe and beyond will be waking up wondering what it means for them. Do the tariffs just dissolve? It's not clear. Tariffs are being imposed as goods pass over borders right now - what are the mechanisms to lift them? We don't yet know. It's a new layer of uncertainty and confusion. The president's lawyers are appealing. But assuming the ruling stands, there is a broader point to all this. It profoundly undermines Mr Trump's strategy - because he uses tariffs as a negotiating tactic and as a revenue generator. It undermines a broader strategy too - because to get round numerous constitutional barriers, his administration has simply declared \"emergencies\" - a border emergency, an economic emergency - and the courts are now calling him out.  This court hasn't said the tariffs are wrong, economically. That is not its remit. The judges have simply been asked to interpret the law and the constitution. They have concluded that the president does not have the authority to impose tariffs. That's the law, Mr President. The obvious strategy now for him would be to engage Congress - to try to get his legislation through the proper way. But would Congress pass such sweeping tariffs even with his narrow majorities? Maybe not. That's democracy, Mr President. A central tenet of Mr Trump's agenda has just been upended. It's just another twist in this remarkable presidency."
    },
    {
        "title": "Pensions insurer Rothesay joins suitors for O2 ground rent deal",
        "description": "Britain's biggest pensions insurance specialist has joined the race to buy the 999-year lease of the O2, London's best-known entertainment venue.",
        "url": "https://news.sky.com/story/pensions-insurer-rothesay-joins-suitors-for-o2-ground-rent-deal-13376366",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-anticyclonic-gloom_6742508.jpg?20250529115830",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-29 10:12:00",
        "Headline": "The specialist pensions group, which has £70bn in assets under management, wants to buy the entertainment venue's long lease from Trinity College Cambridge, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Britain's biggest pensions insurance specialist has joined the race to buy the 999-year lease of the O2, London's best-known entertainment venue. Sky News has learnt that Rothesay, which has more than £70bn of assets under management, is among the bidders for the long-term income stream generated by the arena in North Greenwich. Rothesay and the Universities Superannuation Scheme - along with a small number of undisclosed bidders - are participating in an auction being run by Eastdil, the real estate-focused investment bank. None of the parties has secured exclusivity, although insiders suggested such a development was unlikely to be far away. Money blog: Millions of Nationwide customers to receive £100 Rothesay has become one of Britain's most successful specialist insurers, having been established in 2007. It now protects the pensions of more than 1m people in Briton and makes more than £300m in pension payouts every month. \n                  Treasury to dispose of final shares in bailed-out NatWest Group\n                 \n                  US trade court blocks Donald Trump from imposing sweeping global tariffs - saying he exceeded his authority\n                 \n                  Trump's key economic policy has just been undermined - and the president will be seething\n                 The auction of the O2's ground rent has been under way for several months, with Sky News having revealed it was being put up for sale by Cambridge University's wealthiest college. Trinity College, which ranks among Britain's biggest landowners, acquired the site in 2009 for a reported £24m. The O2, which shrugged off its \"white elephant\" status in the aftermath of its disastrous debut as the Millennium Dome in 2000, has since become one of the world's leading entertainment venues. Operated by Anschutz Entertainment Group (AEG), it has played host to a wide array of music, theatrical and sporting events over nearly a quarter of a century. Trinity College, which was founded by Henry VIII in 1546, bought the O2 lease from Lend Lease and Quintain, the property companies which had taken control of the Millennium Dome site in 2002 for nothing. A spokesman for Rothesay declined to comment."
    },
    {
        "title": "OneDome snaps up former Goldman-backed mortgage broker Trussle",
        "description": "A British property and fintech business which aims to improve the homebuying process has swooped to buy Trussle, a digital mortgage broker once backed by Goldman Sachs, the Wall Street giant.",
        "url": "https://news.sky.com/story/onedome-snaps-up-former-goldman-backed-mortgage-broker-trussle-13376370",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-building-construction_6851336.jpg?20250309162142",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-29 10:21:00",
        "Headline": "Founded in 2015, Trussle - now trading as Better.co.uk - raised close to £30m from investors before being sold and is now changing hands again, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A British property and fintech business which aims to improve the homebuying process has swooped to buy Trussle, a digital mortgage broker once backed by Goldman Sachs, the Wall Street giant. Sky News understands that OneDome, which integrates mortgage, legal, and insurance services into a single online process, has agreed a deal to buy Trussle from US-listed Better Home & Finance Trading Company. The terms of the deal were unclear on Thursday, with the transaction subject to approval from the City regulator. Money blog: Millions of Nationwide customers to receive £100 Trussle, which trades as Better.co.uk, was founded in 2015 and raised close to £30m in a series of funding rounds. Its sale in 2021 reportedly valued the business at a significant discount to that sum. In a statement issued to Sky News, Babek Ismayil, founder and chief executive of OneDome, said: \"Trussle has built an excellent team and a reputation for innovation and customer focus. \n                  Seven high street names accused of 'blatant profiteering' for raising mortgage rates while cutting savings rates\n                 \n                  Greatest number of mortgages approved per month since Liz Truss mini-budget\n                 \n                  Joint mortgages being used as 'weapons' for domestic abuse in 'hidden crime', charity warns\n                 \"We share a clear vision: that buying a home should be simpler, faster, and less stressful. \"Trussle's Smartbuyer proposition closely mirrors our own award-winning HomeBuyer Service, and combining our strengths is a natural next step to transforming this historically outdated sector.\" Sources said the transaction would edge OneDome - chaired by the veteran former City lawyer Sir Nigel Knowles - closer to a five-year goal of being involved in 10% of all UK homebuying transactions. The combined group, they added, would facilitate over £3.5bn in annual mortgage lending and process roughly 1,100 property transactions each month. It will have a workforce of about 230 people."
    },
    {
        "title": "Sirloin? No. Top chef says you should be buying this cheaper cut instead",
        "description": "Every Thursday, our Money blog team interviews chefs from around the UK, hearing about their cheap food hacks and more. This week, we chat to Brian Hennessy, head chef at the acclaimed Winter Garden Restaurant in London.",
        "url": "https://news.sky.com/story/sirloin-no-top-chef-says-you-should-be-buying-this-cheaper-cut-instead-13376332",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-money-blog-cheap-eats_6930016.png?20250529062859",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-29 08:57:00",
        "Headline": "Acclaimed chef Brian Hennessy tells the Money blog about how he cuts costs by using an \"often overlooked\" cut of steak - and gives a not-so-secret recipe for crispy chilli oil.",
        "Content": "Every Thursday, our Money blog team interviews chefs from around the UK, hearing about their cheap food hacks and more. This week, we chat to Brian Hennessy, head chef at the acclaimed Winter Garden Restaurant in London. My favourite cheap substitute is... using bavette, also known as flank, as the cut of meat for steak and chips. It is often overlooked but the flavour is beautiful. You are also getting a range of different textures in one single cut. I'll take it over a sirloin any day of the week. Read all the latest Money news here My secret crispy chilli oil, no longer to be a secret, makes any meal better... I batch-make it and store it. Added to almost anything, it can make a meal. From a little bit in scrambled egg in the morning (my personal favourite) to popping it in a stir-fry or pasta. There's no need for any expensive products - just add a few tablespoons and it will add the perfect amount of umami to any dish at home. Blitz the chillies (or chop) until flakes. Thinly slice your garlic and gently fry in the grapeseed oil. Mix the salt, spices and porcini powder. Combine with the dried chilli. Once garlic is golden brown and crispy, pour over chilli mix. Mix in crispy shallots. Young chefs shouldn't worry about money... your position or the hours when choosing where to work early on in your career. Work for the best possible chef you can learn from. Having worked under chefs like John Williams, Spencer Metzger and Gareth Byrne, their investment in young chefs and ability to pass on their knowledge has been invaluable to me. Money and everything else will follow suit down the line. One restaurant that's worth spending big on... Cocina Hermanos Torres in Barcelona. Worth it, including the plane journey. Went on a whim last year and it was simply mind-blowing. You go into almost a lab-type restaurant, but the friendly service makes you instantly at ease. They proceed to serve you food and ingredients you recognise but in the most innovative way. We had a pea and ham dish, sounds simple - easily the best dish I have ever eaten. \n                  'I don't understand why people go there': Renowned chef on the restaurant chain he dislikes\n                 \n                  'I really love it': Top chef picks favourite chain restaurant - and shares 'ultimate' late night cheap eat\n                 \n                  'It's overrated': Top chef on expensive food item that isn't worth it\n                 The worst type of customer is… those who are late without calling and then demanding upon arrival. It's both a lack of respect for the staff and their fellow diners. It has the potential to ruin multiple dining experiences, not just their own. It's not exactly a secret ingredient, but the sheer amount of salted butter used certainly is... a secret kept from the guy writing the cookbooks. It's not just great for taste but also texture! French cuisine is often associated with pricey, fancy ingredients... but classical French cooking is deep-rooted in maximising the use of every part of the animal and veg. We have become too used to over-prepared products in the supermarket, but with some basic knowledge and skills, you can really stretch the ingredients in your weekly shop. My chef hero is… Daniel Calvert, the only British chef to hold three Michelin stars outside the UK, in Tokyo. The level of precision in his work is awe-inspiring. He went from sous chef at 23 at Per Se in New York, then back to being a commis chef at Epicure in Paris to learn traditional techniques, which shows his passion and desire to improve and learn. I believe his journey should be an inspiration for any young chef. Read more from this series:Why you shouldn't throw away citrus peelThe one thing customers should know about their billThe 'ultimate' late night cheap eat A tip non-chefs might not know is... add acid. Don't be afraid to add that touch of acid, whether it be vinegar or lemon juice, to a sauce, soups, broths or a piece of fish. It can make the world of a difference to any product and make a dish go from good to great. My favourite cookbook is... The French Laundry by Thomas Keller. It is just a timeless classic. It's a book you can always go back to for inspiration and proves that trends will come and go, but true class is permanent. My go-to cheap eat out... is Oki in Wimbledon, south London. £8 buffet-style Japanese, I often go for the katsu curry. Why I love it is not just the convenience, but it being so, so good. Perfect to pick up on the way home after a long day at work. They are far from shy on portions also!"
    },
    {
        "title": "Tube fare dodgers and Robert Jenrick clash at Stratford station - as he chases them at barriers for social media video",
        "description": "Robert Jenrick has taken the law into his own hands by challenging Tube fare dodgers in a social media video criticising London mayor Sadiq Khan.",
        "url": "https://news.sky.com/story/tube-fare-dodgers-and-robert-jenrick-clash-at-stratford-station-as-he-chases-them-at-barriers-for-social-media-video-13376390",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-jenrick-tube_6930393.jpg?20250529145227",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-29 11:05:00",
        "Headline": "The shadow justice secretary confronted people in east London going through barriers without paying.",
        "Content": " Robert Jenrick has taken the law into his own hands by challenging Tube fare dodgers in a social media video criticising London mayor Sadiq Khan. The Conservative shadow justice secretary posted a video of himself challenging people walking through the barriers without paying at Stratford station in Newham, east London. Newham is the third most deprived local authority area in the capital, according to the latest census data. Politics latest: PM launches huge attack against Farage  However, Mr Jenrick said one in 25 people using London's public transport are not paying for it, and accused Mr Khan of \"driving a proud city into the ground\". \"Lawbreaking is out of control. He's not acting. So, I did,\" Mr Jenrick said in the caption. Mr Jenrick could be seen approaching people slipping through the barriers and asking them if they think \"it is alright not to pay\". He was met with indignation, with one man telling him to \"f*** off\" and another saying: \"I'm warning you now, move!\" Mr Jenrick asked one man if he said he was carrying a knife. The Conservative MP said there were eight enforcement officers nearby but people were going through an open barrier without paying. At one point, he could be seen bringing one of the fare dodgers to a group of British Transport Police officers who took the man aside for questioning. Mr Jenrick said it is \"the same with bike theft, phone theft, tool theft, shoplifting, drugs in town centres, weird Turkish barber shops\". \"It's all chipping away at society,\" he said. \"The state needs to reassert itself and go after lawbreakers.\" Political correspondent This is the latest video from Robert Jenrick that's trying to tap into the well-documented frustrations many have in the country that low-level crime is eroding away at civil society. Being tough on crime is not an unusual stance for any politician to adopt, but what's a bit different about this approach is the shadow justice secretary is packaging up the message in a slick and provocative format that's explicitly designed for social media. It has the effect of appealing to supporters whilst also enraging critics, giving the end result of boosting its prominence online and boosting the profile of this ambitious frontbencher too. Read more: Cummings predicts Kemi Badenoch will be gone by end of year A British Transport Police spokesman said: \"Ticket fraud is not a victimless crime - the cost is passed down to the honest fare-paying members of the travelling public. \"We are committed to working closely alongside the railway industry to tackle fare evasion and regularly support them with high visibility patrols at known hotspot locations.\" Fare evasion costs Transport for London (TfL) £130m a year, with YouGov finding 79% of passengers saying they have personally seen fare dodging. In April, the mayor announced a new fare evasion strategy involving expanding TfL's team of more than 500 uniformed officers already deployed across the network to deal with fare evasion and other anti-social behaviour."
    },
    {
        "title": "Starmer says government 'will look at' scrapping two-child benefits limit",
        "description": "Sir Keir Starmer has said his government \"will look at\" scrapping the two-child benefits limit.",
        "url": "https://news.sky.com/story/starmer-says-government-will-look-at-scrapping-two-child-benefits-limit-13376362",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-glass-futures-keir-starme_6930319.jpg?20250529135103",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-29 10:02:00",
        "Headline": "Ministers have recently softened their stance on the cap after steadfastly saying it would remain.",
        "Content": " Sir Keir Starmer has said his government \"will look at\" scrapping the two-child benefits limit. In his strongest hint yet that he will perform a U-turn - when asked if he would scrap the two-child benefit cap, Sir Keir said: \"We'll look at all options of driving down child poverty.\" The cap means families can only claim child tax credit and universal credit for their first two children, if they were born after April 2017. It was introduced in 2017 by the Conservative government, and in 2023, Sir Keir ruled out scrapping it.  However, as Labour came to power last year, he said the party wanted to remove the cap but only when fiscal conditions allowed. But he then doubled down on refusing to lift it, suspending seven Labour MPs shortly after the election victory for voting with the SNP to remove the cap.  Ministers had toed the party line for months, but the narrative started to shift in May, with Education Secretary Bridget Phillipson telling Sky News on Tuesday lifting the cap is \"not off the table\" - and \"it's certainly something that we're considering\". Sir Keir was also reported to have asked the Treasury to see how scrapping it could be funded. His words on Thursday are his strongest indication yet, that he could lift the cap soon. Read more:What is the two-child benefit cap and will Labour scrap it?Starmer confirms U-turn of unpopular winter fuel policy  It would mean a second benefits U-turn after he made a shock announcement last week that he was going to relax the winter fuel payment cut. The policy, announced soon after Labour won the election, has caused anger among Sir Keir's own MPs as it restricted the previously universal payment to those who receive pension credit. It will now be available to \"more pensioners\", but details of who and when have not been revealed."
    },
    {
        "title": "UK will 'seek to do more if it can' for Gaza's injured children, foreign secretary David Lammy says",
        "description": "The foreign secretary has said the UK will do more to help injured children in Gaza if it can, following Sky News' reporting on their plight. ",
        "url": "https://news.sky.com/story/uk-will-seek-to-do-more-if-it-can-for-gazas-injured-children-foreign-secretary-david-lammy-says-13376645",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-lammy-david_6930719.jpg?20250529204901",
        "type": "Politics",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-05-29 19:34:00",
        "Headline": "The foreign secretary was responding to Sky News' report on the plight of the region's children. David Lammy was also sharply critical of the worsening situation in Gaza.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  The foreign secretary has said the UK will do more to help injured children in Gaza if it can, following Sky News' reporting on their plight.  David Lammy was on a whistlestop tour of the Arctic when we asked him about our story on a charity calling for the UK to offer children in Gaza life-saving treatment. Israel-Gaza latest: Netanyahu reportedly accepts US ceasefire plan He said: \"The scale of the medical catastrophe for children and the population of Gaza is horrendous, and that's why we increased our aid. \"What will end this suffering is a ceasefire but if there is more that we can do to end the suffering, of course, we will seek to do that.\" We read the foreign secretary the words of Doctor Victoria Rose, a British plastic surgeon working in Gaza. Dr Rose had said: \"Every time I come in, I say it's bad, but this is on a completely different scale. It's carnage… we really are on our knees now.\"  Mr Lammy was speaking as reports broke that Israel's Prime Minister Benjamin Netanyahu had accepted a ceasefire brokered by the Trump administration. Hamas said on Thursday night that it was still discussing the deal, while an official warned that the Israeli response to the proposal failed to meet the group's demands. The foreign secretary said he hopes \"we're about to see a breakthrough that is not just a ceasefire for a few days, but is a sustained ceasefire that brings an end to some of the horrors that we are seeing out of Gaza and sees the return of the hostages\". He was also sharply critical of the worsening situation in Gaza. \"The scenes of children dying, the horrors of people not being able to get aid are unacceptable, it's horrendous,\" he said. Read more:Charity calls on UK to help Gaza childrenHow the new Gaza aid rollout collapsed But Mr Lammy stopped short of saying Israel was guilty of a genocide - saying that was a decision for judges in international tribunals. \"We have always been clear that this is a decision for the international courts,\" he said. \"I have to stand by our law, and I determined that there was a clear risk of a breach of international humanitarian law.\" The British government this month suspended trade talks with Mr Netanyahu's government, in response to Israel ramping up its latest military offensive in Gaza and limiting aid to the enclave."
    },
    {
        "title": "Russian-linked hackers posing as journalists targeted Ministry of Defence, government says",
        "description": "Russia-linked hackers posing as journalists targeted staff at Britain's Ministry of Defence in a cyber spying operation that was spotted and thwarted, the government has revealed.",
        "url": "https://news.sky.com/story/russian-linked-hackers-posing-as-journalists-targeted-ministry-of-defence-government-says-13376229",
        "image_url": "https://e3.365dm.com/20/09/1920x1080/skynews-hacker-us-hacking_5104463.jpg?20200922051705",
        "type": "Politics",
        "Author": "Deborah Haynes",
        "Date Published": "2025-05-29 01:15:00",
        "Headline": "The British military is boosting its own offensive capabilities to conduct cyber attacks against hostile states like Russia.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n Russia-linked hackers posing as journalists targeted staff at Britain's Ministry of Defence in a cyber spying operation that was spotted and thwarted, the government has revealed. Details of the foiled hack emerged as Defence Secretary John Healey said the UK military is bolstering its own offensive capabilities to conduct cyber attacks against hostile states like Russia as part of a long-awaited review of UK defence. The Strategic Defence Review is expected to be published on Monday. It was launched by Sir Keir Starmer last July and comes ahead of a major summit of NATO allies in June. A major new podcast series by Sky News and Tortoise which begins on 10 June will explore the state of UK defences by running a wargame that simulates a Russian attack on the UK. \"The nature of warfare is changing,\" Mr Healey told a group of journalists on a visit to a secure facility in Wiltshire where the defence team that defeated the Russian cyber attack is located. \"The keyboard is now a weapon of war and we are responding to that.\" Part of this response, announced on Thursday, includes the creation of a new cyber command to oversee offensive and defensive cyber operations. \n                  Sir Keir Starmer hails new British 'StormShroud' drones coming into operation\n                 \n                  Growing calls for UK to withdraw from treaty banning landmines\n                 \n                  'Sensitive military documents' found in Newcastle street\n                 The government also plans to invest more than £1bn on improving its ability to hunt, locate and strike targets on the battlefield, drawing on digital technology. \"In future conflict, those that prevail will be those who are not just better equipped and better trained, but better connected and also capable of innovating ahead of adversaries,\" the defence secretary said. The thwarted Russia-linked hack was one of more than 90,000 cyber attacks associated with hostile states that were directed against the UK military and other parts of defence over the past two years - a doubling from the previous two years, the Ministry of Defence said. Part of the increase is because the military is getting better at spotting the attempts against its networks. However, it is understood the attacks are becoming more sophisticated - making them harder to combat. Late last year, the National Cyber Security Centre (NCSC), which is part of GCHQ, alerted the Ministry of Defence to a suspected spear phishing campaign. The Global Operations Security Control Centre at MoD Corsham, in Wiltshire, which defends the Ministry of Defence's networks in the UK and overseas, was tasked with identifying the threat. The team worked on computers inside a large, windowless hall - filled with rows of desks and a bank of large screens along one wall. \"MoD detected a spear phishing campaign targeting staff with the aim of delivering malware,\" the analysis by the NCSC said. \"The initial campaign consisted of two emails with a journalistic theme attempting to represent a news organisation. The second campaign followed a financial theme, directing targets to a commercial file share.\" The officials who were involved revealed details of the effort during the defence secretary's visit to MoD Corsham this week. One of the individuals said it took about an hour to spot the attack. Asked what it felt like to discover the intrusion, the individual said \"cool\".  The malware was linked to a Russian hacking group called RomCom, a second official said. The particular code that was used had not been seen before, so the British side gave it the name \"Damascened Peacock\". \"Corsham is famous for peacocks,\" they said. The two officials are part of a team of cyber experts - a mix of military personnel, civil servants and civilian contractors - who work at the secure centre. A key focus at the moment is protecting a major deployment by the Royal Navy's aircraft carrier, HMS Prince of Wales, loaded with state-of-the-art F-35 fast jets and protected by a task force of warships, as it travels through the Red Sea off the coast of Yemen. The carrier strike group is expected to pass through the Bab el-Mandeb Strait in the coming days - well within range of an Iranian-backed militia that has targeted British and American warships and well as commercial shipping with missiles.  The cyber experts, though, are trying to defend the deployment from cyber attacks. Earlier in the month, US President Donald Trump struck a deal with Houthi militants to stop them from attacking ships, but the British side is still very alert to the potential threat. \"The strike group is going through what could be a high risk dangerous passage,\" Mr Healey said."
    },
    {
        "title": "Scottish government scraps plan for new national park in Galloway",
        "description": "Plans to create Scotland's third national park in Galloway and Ayrshire have been scrapped, the Scottish government has announced.",
        "url": "https://news.sky.com/story/scottish-government-scraps-plan-for-new-national-park-in-galloway-13376378",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-galloway-scotland_6474803.jpg?20250529114858",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-05-29 10:45:00",
        "Headline": "Plans for the scheme - mostly in Dumfries and Galloway but also extending into parts of South and East Ayrshire - proved contentious, with rural affairs secretary Mairi Gougeon admitting \"at times the debate has become quite heated\".",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Plans to create Scotland's third national park in Galloway and Ayrshire have been scrapped, the Scottish government has announced. Galloway was last year chosen as the preferred location for the nation's newest national park. A public consultation was carried out by NatureScot, with local residents, communities, businesses and interested parties invited to share their views on the proposal. Plans for the scheme - mostly in Dumfries and Galloway but also extending into parts of South and East Ayrshire - proved contentious. Supporters argued it would put the region on the map, boost the local economy, and prevent it from becoming a \"dumping ground for inappropriate windfarms\". However, opponents claimed making it more difficult for developers to secure planning permission for projects would negatively affect economic activity in the area. Other concerns raised included house prices potentially being pushed up, as well as the region's ability to cope with any additional tourism. \n                  Teenage girl raped by masked man in Edinburgh, police say\n                 \n                  Man jailed for at least 24 years over murder of Elgin woman\n                 \n                  Fife school support worker who boasted of 'selling vapes to 11-year-olds' struck off\n                 In an update at the Scottish parliament on Thursday, rural affairs secretary Mairi Gougeon told MSPs that 54% of those who engaged with the consultation opposed the plans, while 42% supported it. Taking into account local responses alone, 57% were found to be in opposition compared to 40% in favour. Proposal hasn't 'garnered sufficient local support' Ms Gougeon said: \"Based on the evidence gathered during the investigation and consultation, the reporter has advised that, whilst it considers that the proposed area meets the conditions for a national park set out in the legislation, the proposal does not have sufficient clarity, nor has it garnered sufficient local support to proceed to the next stage of designation.\" The MSP added: \"We have weighed up the arguments for and against the creation of a new national park in the area, taking full account of the potential economic, social and environmental factors, and we have come to the conclusion not to proceed with the designation of a national park in Galloway and Ayrshire. \"I realise that this decision will be very disappointing for those who have been campaigning for a new national park in Galloway over many years.\" Read more from Sky News:Drought declared in North West EnglandArctic melt expected to push up sea levels around Britain There are currently 15 national parks in the UK - two in Scotland, 10 in England and three in Wales. Cairngorms National Park and Loch Lomond and The Trossachs National Park are the two north of the border. The power-sharing Bute House Agreement between the SNP and the Scottish Greens in 2021 led to the Scottish government pledging that \"at least one\" new park would be designated by spring 2026. Galloway saw off competition from areas in the Scottish Borders, Lochaber, Loch Awe and Tay Forest. The joint Galloway National Park Association (GNPA) and Galloway and Southern Ayrshire UNESCO Biosphere (GSABP) bid touted the area as \"Scotland in miniature\" with its \"diverse landscapes and stunning coastline, its outstanding biodiversity and rich cultural heritage\". What was the public consultation? Ms Gougeon said NatureScot's public consultation ran for 14 weeks from November 2024 until February 2025. More than 5,000 surveys were completed and more than 1,000 people attended events that were held in relation to the plans. Meetings were also held with local authorities and community councils, and with representatives from the farming, forestry, tourism, renewables and conservation sectors. 'Heated debate' Ms Gougeon said public interest in the proposal had \"proven to be huge\" and generated \"both strong support and strong opposition\". She added: \"At times, the debate has become quite heated.\" Ms Gougeon said while the designation of a new national park will not go ahead in Galloway and Ayrshire, the Scottish government \"remains committed\" and will \"remain open\" to proposals for new national parks in the future. 'Devastating news' Scottish Greens MSP Mark Ruskell said it was \"devastating news for the local community and nature\". He added: \"By scrapping plans for the third national park in Galloway, the Scottish government has slammed the door on the economic investment and new powers this designation could bring.\" David Hope-Jones, chief executive of the South of Scotland Destination Alliance (SSDA), said the decision was a \"missed opportunity to attract sustained investment in visitor management, visitor experience and visitor infrastructure\". He added: \"In deciding not to back the Galloway National Park, we call on the Scottish government to outline how, through new investment, the same sustainable economic results can be achieved.\" Campaigners 'relieved' Scottish Land & Estates (SLE) said it was the \"right\" decision. Director of policy Stephen Young said: \"The Scottish government still has an important role to play in shaping a successful future for Galloway by supporting the infrastructure and conditions that rural businesses need to thrive. \"We welcome the government's commitment to backing the region's long-term prosperity.\" Liz Hitschmann, co-founder of No Galloway National Park, said the campaign group was \"relieved\" with the decision. She added: \"There is no question Dumfries and Galloway needs investment in our infrastructure, but it did not need millions frittered away on another layer of bureaucracy which could override local wishes, and the many government-funded organisations in the area need to deliver that investment.\""
    },
    {
        "title": "The fight for the Arctic - where climate change is giving Russia room to manoeuvre",
        "description": "The twin threats of climate change and Russian malign activity in the Arctic must be taken \"deadly seriously,\" David Lammy has warned.",
        "url": "https://news.sky.com/story/the-fight-for-the-arctic-where-climate-change-is-giving-russia-room-to-manoeuvre-13376706",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-svalbard-norway_6930846.jpg?20250529235214",
        "type": "Technology",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-05-29 22:17:00",
        "Headline": "Sky News joined David Lammy on the furthest reaching tour of the Arctic by a British foreign secretary. We travelled to Svalbard - where melting ice is giving Russia more freedom to manoeuvre. ",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  The twin threats of climate change and Russian malign activity in the Arctic must be taken \"deadly seriously,\" David Lammy has warned. Sky News joined him on the furthest reaching tour of the Arctic by a British foreign secretary. We travelled to Svalbard - a Norwegian archipelago that is the most northern settled land on Earth, 400 miles from the North Pole. It is at the heart of an Arctic region facing growing geopolitical tension and feeling the brunt of climate change. Mr Lammy told us the geopolitics of the region must be taken \"deadly seriously\" due to climate change and \"the threats we're seeing from Russia\". We witnessed the direct impact of climate change along Svalbard's coastline and inland waterways. There is less ice, we were told, compared to the past. The melting ice is opening up the Arctic and allowing Russia more freedom to manoeuvre. \n                  'What did they do to be burned and bombed?': Charity calls on UK to offer Gaza children life-saving treatment\n                 \n                  UK charity calls on government to rescue two children in Gaza\n                 \n                  Israel accepts US Gaza ceasefire plan - while Hamas says it's 'under discussion'\n                 \"We do see Russia's shadow fleet using these waters,\" Mr Lammy said. \"We do see increased activity from submarines with nuclear capability under our waters and we do see hybrid sabotage of undersea cables at this time.\" In Tromso, further south, the foreign secretary was briefed by Norwegian military commanders. Vice Admiral Rune Andersen, the Chief of Norwegian Joint Headquarters, told Sky News the Russian threat was explicit. \"Russia has stated that they are in confrontation with the West and are utilising a lot of hybrid methods to undermine Western security,\" he said. But it's not just Vladimir Putin they're worried about. Norwegian observers are concerned by US president Donald Trump's strange relationship with the Russian leader too. Karsten Friis, a Norwegian defence and security analyst, told Sky News: \"If he's too soft on Putin, if he is kind of normalising relations with Russia, I wouldn't be surprised. \"I would expect Russia to push us, to test us, to push borders, to see what we can do as Europeans.\" Changes in the Arctic mean new challenges for the NATO military alliance - including stepping up activity to deter threats, most of all from Russia. More from Sky News:Trump doubles down on Putin criticismWhy Russian troops are gathering near 'fortress city' In Iceland, we toured a NATO airbase with the foreign secretary. There, he said maintaining robust presence in the Arctic was essential for western security. \"Let's be clear, in this challenging geopolitical moment the high north and the Arctic is a heavily contested arena and we should be under no doubt that NATO and the UK need to protect it for our own national security.\" This is also about distracting Russia, drawing away resources that could have been used in the war in Ukraine and deterring it in the future. Because the more Arctic opens up, the more this once pristine wilderness is becoming the arena of national rivalry and potentially conflict."
    },
    {
        "title": "New blood test to 'revolutionise' NHS cancer treatment",
        "description": "A new ultra-sensitive blood test which can detect tiny fragments of tumour DNA could be \"revolutionary\" for NHS patients.",
        "url": "https://news.sky.com/story/new-blood-test-to-revolutionise-nhs-cancer-treatment-13376382",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-liquid-biopsy-rebeca_6930219.jpg?20250529115451",
        "type": "Technology",
        "Author": "Megan Harwood-Baynes",
        "Date Published": "2025-05-29 10:52:00",
        "Headline": "Tens of thousands of patients could benefit from liquid biopsies, which give results up to two weeks faster than tissue biopsies. ",
        "Content": "\n          Social affairs and health reporter\n              @megbaynes\n A new ultra-sensitive blood test which can detect tiny fragments of tumour DNA could be \"revolutionary\" for NHS patients. Thousands of patients will be offered liquid biopsies, which can help fast-track lung cancer patients to receive targeted treatments. Tissue biopsies are used to confirm a diagnosis of lung cancer and samples can be sent for genomic testing. But liquid biopsies allow for results much faster, and can show patients if they have mutations. Rebeca Proctor, 41, was treated a suspected chest infection last December. After she began coughing up blood, she was diagnosed with stage four cancer - which she called a \"punch to the gut\". \"I was scared - I just thought about my children, and if I would get to see my little girl start nursery, and how I would explain my diagnosis to my children - it was just heartbreaking to think about,\" the mother of four from Carlisle said. A liquid biopsy showed she had an ALK genetic mutation of her non-small-cell lung cancer. A tissue biopsy took ten days longer to confirm the same result, but in the meantime she could begin a targeted treatment. New medication has \"given me my life back\", she says. \n                  Dementia: Sleep problems could 'double risk' of disease in later life\n                 \n                  The ins and outs of UK cannabis law - and calls to decriminalise it\n                 \n                  Extra cancer screenings for women with dense breasts could save hundreds of lives, study finds\n                 \"I'm taking it day-by-day and for now the treatment is doing what it's meant to be doing and shrinking the tumour, and I've got my energy back,\" she said. \"I know I'm not going to be cured but I've come to terms with my diagnosis and the pills are stopping my cancer cells from spreading - we'll keep fighting this and dealing with what's been thrown at us.\" Breast and lung cancers are two of the most common in England - around 90,000 people are diagnosed with one of them each year. Potential to 'scan' the body in a single blood test NHS England will become the first health service in the world to roll-out a \"blood-test first\" approach to diagnosing lung cancer, and it follows a successful pilot of the testing last year. Up to 15,000 patients could benefit. The NHS has also said it is expanding testing in advanced breast cancer, with several genetic variations now being screened for. It could save the health service up to £11m per year in lung cancer care. Read more:Could the UK decriminalise cannabis?Father loses wife and son to same heart conditionThe extra cancer screenings that could save hundreds Professor Peter Johnson, NHS national clinical director for cancer, said it would enable patients to receive \"more targeted and kinder care\", as it would enable some to avoid more intensive treatments - such as chemotherapy - in place of a more targeted approach. \"Liquid biopsies are leading us into a new era of personalised cancer care and it's fantastic that we are now able to expand the use of this revolutionary test on the NHS to help tailor treatment for thousands of patients across the country,\" he said. Liquid biopsies, he added, have the potential to \"scan\" the body in a single blood test. Professor Dame Sue Hill, Chief Scientific Officer for England, said: \"This testing is transforming care and helping clinicians match patients earlier especially when cancer tissue may not be available with potentially life-extending targeted therapies rapidly and with greater precision.\" The health secretary called it an \"incredibly exciting new test\" that could save countless lives. \"It is just the latest example of this government combining the compassionate care of our National Health Service with the ingenuity of Britain's leading scientific minds to revolutionise cancer care,\" Wes Streeting said."
    },
    {
        "title": "Drought declared in North West England",
        "description": "North West England has officially entered a drought, the Environment Agency has said.",
        "url": "https://news.sky.com/story/drought-declared-in-north-west-england-13376277",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-haweswater-reservoir_6925010.jpg?20250523132330",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-29 06:33:00",
        "Headline": "Area has seen the third-lowest rainfall between February and April on record since 1871, and England as a whole has seen its driest period over those three months since 1929.",
        "Content": "North West England has officially entered a drought, the Environment Agency has said. The region entered drought status on 21 May due to low water levels in reservoirs and rivers, the agency said. The area has seen the third-lowest rainfall between February and April on record since 1871, while England as a whole has seen its driest period over those three months since 1929. It comes despite recent rainfall. A spokesperson for the Environment Agency said: \"Across the North West we officially entered drought status on 21 May due to low water levels in reservoirs and rivers. \"Despite the rain over the weekend levels remain low and we are encouraging people to be aware of the impacts of drought as we enter the summer period.\" The spokesperson added: \"With further unsettled periods and rainfall over the coming weeks we will continue to closely monitor the situation and implement our North West Drought Plan.\" Read more: Will there be a hosepipe ban in the UK? England's overall reservoir storage was at 84% at the end of April - lower than at the same time of the year in the drought of summer 2022. The Environment Agency has warned of a \"medium\" risk of drought in England this summer if there isn't sustained rainfall. The regulator has said there are currently no hosepipe bans planned, but warned water companies might have to implement measures including restrictions in the months ahead. It comes as the government has stepped in to take control of the planning process for two major new reservoirs, warning UK water supplies are under threat. Environment Secretary Steve Reed designated two new reservoir projects in East Anglia and Lincolnshire \"nationally significant\", which escalates them from local planning to central government. The new reservoirs, the first for more than 30 years, are being proposed by Anglian Water, which wants to build the Lincolnshire reservoir south of Sleaford and is partnering with Camridge Water for the Fens Reservoir between Chatteris and March in Cambridgeshire. On Monday, provisional figures from the Met Office showed the UK has had its sunniest spring since records began in 1910. The UK recorded 630 hours of sunshine between 1 March and 27 May - beating its previous sunniest spring in 2020 by four hours, the forecaster said."
    },
    {
        "title": "Scottish government scraps plan for new national park in Galloway",
        "description": "Plans to create Scotland's third national park in Galloway and Ayrshire have been scrapped, the Scottish government has announced.",
        "url": "https://news.sky.com/story/scottish-government-scraps-plan-for-new-national-park-in-galloway-13376378",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-galloway-scotland_6474803.jpg?20250529114858",
        "type": "Technology",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-05-29 10:45:00",
        "Headline": "Plans for the scheme - mostly in Dumfries and Galloway but also extending into parts of South and East Ayrshire - proved contentious, with rural affairs secretary Mairi Gougeon admitting \"at times the debate has become quite heated\".",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Plans to create Scotland's third national park in Galloway and Ayrshire have been scrapped, the Scottish government has announced. Galloway was last year chosen as the preferred location for the nation's newest national park. A public consultation was carried out by NatureScot, with local residents, communities, businesses and interested parties invited to share their views on the proposal. Plans for the scheme - mostly in Dumfries and Galloway but also extending into parts of South and East Ayrshire - proved contentious. Supporters argued it would put the region on the map, boost the local economy, and prevent it from becoming a \"dumping ground for inappropriate windfarms\". However, opponents claimed making it more difficult for developers to secure planning permission for projects would negatively affect economic activity in the area. Other concerns raised included house prices potentially being pushed up, as well as the region's ability to cope with any additional tourism. \n                  Teenage girl raped by masked man in Edinburgh, police say\n                 \n                  Man jailed for at least 24 years over murder of Elgin woman\n                 \n                  Fife school support worker who boasted of 'selling vapes to 11-year-olds' struck off\n                 In an update at the Scottish parliament on Thursday, rural affairs secretary Mairi Gougeon told MSPs that 54% of those who engaged with the consultation opposed the plans, while 42% supported it. Taking into account local responses alone, 57% were found to be in opposition compared to 40% in favour. Proposal hasn't 'garnered sufficient local support' Ms Gougeon said: \"Based on the evidence gathered during the investigation and consultation, the reporter has advised that, whilst it considers that the proposed area meets the conditions for a national park set out in the legislation, the proposal does not have sufficient clarity, nor has it garnered sufficient local support to proceed to the next stage of designation.\" The MSP added: \"We have weighed up the arguments for and against the creation of a new national park in the area, taking full account of the potential economic, social and environmental factors, and we have come to the conclusion not to proceed with the designation of a national park in Galloway and Ayrshire. \"I realise that this decision will be very disappointing for those who have been campaigning for a new national park in Galloway over many years.\" Read more from Sky News:Drought declared in North West EnglandArctic melt expected to push up sea levels around Britain There are currently 15 national parks in the UK - two in Scotland, 10 in England and three in Wales. Cairngorms National Park and Loch Lomond and The Trossachs National Park are the two north of the border. The power-sharing Bute House Agreement between the SNP and the Scottish Greens in 2021 led to the Scottish government pledging that \"at least one\" new park would be designated by spring 2026. Galloway saw off competition from areas in the Scottish Borders, Lochaber, Loch Awe and Tay Forest. The joint Galloway National Park Association (GNPA) and Galloway and Southern Ayrshire UNESCO Biosphere (GSABP) bid touted the area as \"Scotland in miniature\" with its \"diverse landscapes and stunning coastline, its outstanding biodiversity and rich cultural heritage\". What was the public consultation? Ms Gougeon said NatureScot's public consultation ran for 14 weeks from November 2024 until February 2025. More than 5,000 surveys were completed and more than 1,000 people attended events that were held in relation to the plans. Meetings were also held with local authorities and community councils, and with representatives from the farming, forestry, tourism, renewables and conservation sectors. 'Heated debate' Ms Gougeon said public interest in the proposal had \"proven to be huge\" and generated \"both strong support and strong opposition\". She added: \"At times, the debate has become quite heated.\" Ms Gougeon said while the designation of a new national park will not go ahead in Galloway and Ayrshire, the Scottish government \"remains committed\" and will \"remain open\" to proposals for new national parks in the future. 'Devastating news' Scottish Greens MSP Mark Ruskell said it was \"devastating news for the local community and nature\". He added: \"By scrapping plans for the third national park in Galloway, the Scottish government has slammed the door on the economic investment and new powers this designation could bring.\" David Hope-Jones, chief executive of the South of Scotland Destination Alliance (SSDA), said the decision was a \"missed opportunity to attract sustained investment in visitor management, visitor experience and visitor infrastructure\". He added: \"In deciding not to back the Galloway National Park, we call on the Scottish government to outline how, through new investment, the same sustainable economic results can be achieved.\" Campaigners 'relieved' Scottish Land & Estates (SLE) said it was the \"right\" decision. Director of policy Stephen Young said: \"The Scottish government still has an important role to play in shaping a successful future for Galloway by supporting the infrastructure and conditions that rural businesses need to thrive. \"We welcome the government's commitment to backing the region's long-term prosperity.\" Liz Hitschmann, co-founder of No Galloway National Park, said the campaign group was \"relieved\" with the decision. She added: \"There is no question Dumfries and Galloway needs investment in our infrastructure, but it did not need millions frittered away on another layer of bureaucracy which could override local wishes, and the many government-funded organisations in the area need to deliver that investment.\""
    },
    {
        "title": "Former Sean 'Diddy' Combs assistant breaks down as she tells trial of alleged sexual assaults: 'I thought I was going to die with this'",
        "description": "A former employee of Sean \"Diddy\" Combs broke down in tears as she described being sexually assaulted by the hip-hop star on several occasions - telling the court the alleged abuse was \"the most traumatising, worst thing that's ever happened to me\".",
        "url": "https://news.sky.com/story/former-sean-diddy-combs-assistant-breaks-down-as-she-tells-trial-of-alleged-sexual-assaults-i-thought-i-was-going-to-die-with-this-13376585",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sean-combs-diddy-trial_6930676.jpg?20250529195629",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-29 17:02:00",
        "Headline": "Mia* - not her real name - is the second alleged victim to testify against Sean \"Diddy\" Combs, following his former partner Cassie's evidence in the first week. She told the trial she had never spoken about alleged sexual assaults until the investigation into the hip-hop star.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n A former employee of Sean \"Diddy\" Combs broke down in tears as she described being sexually assaulted by the hip-hop star on several occasions - telling the court the alleged abuse was \"the most traumatising, worst thing that's ever happened to me\". Three weeks into the trial, Mia* is the second alleged victim to testify against Combs, following his former partner Cassie's evidence alleging years of physical, sexual and emotional abuse. While Cassie waived her right to anonymity, Mia did not want to be identified and is appearing in court in Manhattan, New York, under a pseudonym. She started by telling the court about witnessing Combs, 55, being violent towards Cassie, before moving on to talk about her own experiences. Diddy trial day twelve - as it happened Mia told the court she once woke to find Combs on top of her and that he forced her to have sex against her will. Another time, he forced her to perform oral sex, she alleged. He also once threw a bucket of ice on her head and slammed her arm into a door on another occasion, she said. The court heard Mia had never told anyone about the alleged sexual assaults by Combs until she spoke to government investigators for this case. \"I was going to die with this,\" she said, becoming tearful on the stand. \"I didn't want anyone to know ever.\" Telling the court she could not say \"no\" to her former boss, she said: \"I knew his power. And his control. I didn't want to lose everything that I worked so hard for.\" She also said she feared being attacked and was \"always\" worried about being physically hurt by Combs. \"I didn't want to die or get hurt.\" Mia said she felt \"desperate\", \"terrified and trapped\" and described the alleged sexual assaults as \"the most shameful thing of my life\", and \"the most traumatising, worst thing that's ever happened to me\". Asked why she is speaking out now, she told the court: \"Because I have to tell the truth.\" 'Chaotic and toxic' Mia, faltering at times, said working for Combs came with extreme highs and lows. Sometimes he would offer advice and act like her \"protector\", she said. Other times, he would \"humiliate\" her and berate her for small mistakes, and work her so hard she had little sleep, she said. \"It was chaotic. It was toxic,\" she told the court. Combs's employees were always on edge because his mood could \"change in a split second\", causing everything to go from \"happy to chaotic\", she said. Mia told how she was barely at home once she started working for Combs. Like other employees, she often slept at his properties in LA, Miami and New York. She told the court she was not allowed to leave without his permission and was not allowed lock her door, even though it seemed as if other members of the predominantly male security staff were able to do so. \"This is my house. No one locks the doors,\" Combs allegedly said to her. On one occasion, Mia said she worked without sleeping for five days, with prescription drugs getting her through it. It was only when she had a physical breakdown that Combs allowed her to sleep, jurors were told. Mia's testimony echoed that of prior prosecution witnesses, including several of Combs's other former employees, as well as Cassie. Cassie, an R'n'B singer and model whose legal name is Casandra Ventura, spoke for four days during the first week of the trial. She told jurors her ex-partner subjected her to hundreds of \"freak offs\" - drug-fuelled marathons in which she said she engaged in sex acts with male sex workers while he watched and filmed them. Heavily pregnant at the time, it was confirmed in court yesterday that she gave birth to her third child earlier this week. Mia is the second of three women testifying about alleged sexual abuse by Combs. The third woman, using the pseudonym \"Jane\", is also expected to testify about participating in freak offs. Combs has pleaded not guilty to charges of sex trafficking, racketeering conspiracy and transportation to engage in prostitution. During their opening statement, his lawyers conceded he could be violent at times, but said that did not make him a sex trafficker or racketeering leader. Combs denies using threats or his music industry clout to commit or cover up abuse. What did Mia say about Cassie? In the first part of her testimony, Mia told the court she saw Combs beating Cassie on several occasions and that she sustained injuries, including black eyes, other bruises, and fat lips. The two became friends, she said, and are still friends today. Mia described a party at Prince's house that she and Cassie \"snuck out\" to, saying Prince's security had to intervene when Combs turned up and started to attack her. Read more:Everything you need to know about the Sean Combs trialThe rise and fall of Sean 'Diddy' CombsWhat we learned from Cassie's testimony She also described a trip to a private island in Turks and Caicos, in the Caribbean, saying she remembers Cassie being \"terrified\" as Combs banged on her door \"screaming\". On another occasion during that trip, they used paddle boards to go out to sea to get away from him, she said - but the weather changed and the sky turned dark. \"I was trying to weigh if it was scarier to face Mother Nature or go back to Puff,\" Mia said, using the name she knew him by. \"We eventually went back to Puff.\" Combs was also abusive to Cassie at the Cannes Film Festival in 2012, the court was told. Mia alleged she saw him digging his nails into her as they watched a film. Mia's testimony will continue when the trial resumes on Friday."
    },
    {
        "title": "Andrew Tate and his brother Tristan 'will return to UK' to face rape charges, lawyer says",
        "description": "Andrew Tate and his brother Tristan Tate will return to the UK to defend themselves against charges of rape and other offences, a lawyer representing the siblings has said. ",
        "url": "https://news.sky.com/story/andrew-tate-and-his-brother-tristan-will-return-to-uk-to-face-rape-charges-lawyer-says-13376583",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-andrew-tate-tristan-tate_6846999.jpg?20250305125653",
        "type": "Entertainment",
        "Author": "Miriam Kuepper, news reporter",
        "Date Published": "2025-05-29 16:50:00",
        "Headline": "The Tate brothers are facing a total of 21 charges in the UK,  including rape, actual bodily harm and human trafficking.",
        "Content": "By Miriam Kuepper, news reporter  Andrew Tate and his brother Tristan Tate will return to the UK to defend themselves against charges of rape and other offences, a lawyer representing the siblings has said.  Andrew Ford, representing Andrew and Tristan Tate, has confirmed in a statement by firm Holborn Adams that once proceedings for separate charges the brothers are facing in Romania are concluded, \"The Tates will return to face UK allegations\". Andrew Tate, 38, faces 10 charges, including rape, actual bodily harm, human trafficking and controlling prostitution for gain, relating to three women. His brother Tristan Tate, 36, faces 11 charges relating to one woman - including rape, actual bodily harm and human trafficking. The charges were authorised in January 2024, but full details have only been released now. Bedfordshire Police issued an international arrest warrant for the brothers over allegations, which they \"unequivocally deny\", said to have occurred between 2012 and 2015. Andrew and Tristian Tate's legal team alleges that there is \"a vast amount of misinformation\" about the allegations faced by their clients, which they say could impact their clients' right to a fair trial. The lawyers have also accused the Crown Prosecution Service (CPS) and police of refusing to \"engage with us in any meaningful way\". \"UK prosecutors refuse to give even the most basic information to allow our clients to understand the allegations which they face,\" Holborn Adams said in a statement. \"These are historic allegations, and our clients are not even being told who the supposed victims are, this is not a typical approach and demonstrates a different approach on the basis of the profile of our clients.\" They added: \"As and when the time presents itself, we will rigorously defend our clients.\" The Tate brothers are facing separate allegations of trafficking minors, sexual intercourse with a minor and money laundering in Romania. They are also accused of human trafficking and forming a criminal gang to sexually exploit women in a different case, which has been sent back to prosecutors. Read more from Sky News:Man, 53, charged over Liverpool parade incidentBody found in search for missing teenage girl Prosecutors in the UK have submitted a request to authorities in Romania for the brothers to be extradited following the conclusion of proceedings in Romania. However, the CPS has said that the \"domestic criminal matters in Romania must be settled first\". They have denied all the allegations in Romania. High Court case Lawyer Matt Jury, of McCue Jury & Partners, representing several alleged British victims of Andrew Tate, said: \"We welcome the clarity from the Crown Prosecution Service that our authorities are working to ensure the Tates face justice here in the UK - they cannot be allowed to escape extradition. \"At the same time, we ask once more that CPS admit its mistake in failing to prosecute Tate when he lived in the UK and finally charge him for the rape and assault of the other three women, our clients, who originally filed criminal complaints against him as long ago as 2014 but were failed by the system. \"They deserve justice, too.\" Those allegations were subject to a police investigation, which was closed in 2019. The women are now bringing a civil case against Andrew Tate. Addressing those allegations, Tate's lawyers said that the proceedings were not criminal and had been brought for compensation. The lawyers said the High Court case was \"set down for trial in 2027\" and that Andrew Tate would \"rigorously defend himself with our full support\"."
    },
    {
        "title": "Trump reduces Chicago gang founder's sentence after lobbying by Kanye West",
        "description": "Donald Trump has reduced the sentence of Larry Hoover Sr, a Chicago gang founder, after lobbying from controversial hip-hop artist Kanye West.",
        "url": "https://news.sky.com/story/trump-reduces-chicago-gang-founders-sentence-after-lobbying-by-kanye-west-13376297",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kanye-west-donald-trump_6930117.png?20250529085220",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-29 07:22:00",
        "Headline": "Larry Hoover Sr founded the Gangster Disciples (GD), one of Chicago's most notorious gangs. He was serving multiple life sentences following a 1998 conviction. His supporters say he is now reformed.",
        "Content": "Donald Trump has reduced the sentence of Larry Hoover Sr, a Chicago gang founder, after lobbying from controversial hip-hop artist Kanye West. On Wednesday, the sitting US president commuted the six life sentences that Hoover, founder of the Gangster Disciples (GDs), was serving following a 1998 conviction, Sky News' US partner NBC News reported. It followed a campaign by West, now known as Ye, who has lobbied Mr Trump in the Oval Office over the release, it was reported.   It happened amid a series of pardons which included a former New York congressman, a Connecticut governor, rapper NBA YoungBoy, a labour union leader and a one-time army officer. Hoover, however, NBC said, will not be freed, instead being transferred to a state prison to serve the rest of his 200-year sentence for crimes he was separately convicted of in a state court. The GDs were one of Chicago's most prolific gangs, along with rivals the Black Disciples (BDs). Welcoming the news, West reposted photos of a 2021 \"Free Larry Hoover\" benefit concert with popular artist Drake. He posted on social media, saying: \"WORDS CAN'T EXPRESS MY GRATITUDE FOR OUR DEVOTED ENDURING PRESIDENT DONALD TRUMP FOR FREEING LARRY HOOVER.\" West rose to fame as a rapper and producer, but later began sharing antisemitic content on social media, and selling Swastika T-shirts. Hoover 'one of the most notorious criminals in Illinois history' Hoover was known as the \"chairman of the board\" and the \"king\". He was also declared \"one of the most notorious criminals in Illinois history\", NBC reported. Prosecutors reportedly said he directed violence and drug trafficking in Chicago from at least 1970 until 1995. Larry Hoover Jr, Hoover's son, has called for his father's release for years and was featured in the 2021 Kanye West song Jesus Lord. NBC News reported that, from prison, Hoover has changed the name of the GDs to Growth and Development. He claims to now discourage violence, something federal prosecutors dispute. 'Infinite amounts of universe' During a 2018 Oval Office meeting with Mr Trump, NBC News reported that West urged Mr Trump to commute Hoover's sentence. Read more:Elon Musk leaving role in the Trump administrationTrump halts international student visa applications He reportedly said: \"The reason why they imprisoned him is because he started doing positive for the community. \"He started showing that he actually had power, that he wasn't just one of a monolithic voice, but he could wrap people around. \"So there's theories that there's infinite amounts of universe and there's alternate universe. \"So it's very important for me to get Hoover out, because in an alternate universe, I am him.\""
    },
    {
        "title": "Kool & the Gang's Michael Sumler dies in car crash",
        "description": "Michael Sumler, a long-time member of Kool & the Gang, has died in a car crash.",
        "url": "https://news.sky.com/story/kool-the-gangs-michael-sumler-dies-in-car-crash-13376352",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-mike-sumler-kool-and-the-gand_6930324.jpg?20250529135744",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-29 09:36:00",
        "Headline": "The 71-year-old musician died near Mableton, north of Atlanta, on Sunday night when the car he was driving was involved in a collision with another vehicle.",
        "Content": "Michael Sumler, a long-time member of Kool & the Gang, has died in a car crash. Michael Owens, the mayor of Mableton, north of Atlanta, said in a Facebook post: \"This Memorial Day weekend the world lost a music legend. Michael Sumler, known as \"Chicago Mike\" of Kool and the Gang died in a crash Sunday night on Veterans Memorial Highway near Buckner Road. He was 71.\" He added: \"The city of Mableton, City Council and I join his friends, family and fans in mourning his loss.\" According to local news outlet the Cobb County Courier, the musician's car was involved in a collision with another vehicle. Sumler died at the scene. In a post on Facebook, the band said: \"We're deeply saddened to hear about the passing of our longtime wardrobe valet, Mike Sumler. \"Mike worked alongside Kool & the Gang from 2000-2015, making sure the guys looked their best on stage every night. \"He also hyped the crowd with his energy and dance moves at the top of the show.\" They added: \"Everyone here at Kool & the Gang has fond memories of Mike and will miss him. May he rest in peace.\" Sumler was widely described as a backing vocalist for the pop veterans, who formed in New Jersey in the 1960s and rose to worldwide fame in the following two decades. Adrian Meeks, Sumler's friend, told Fox 5 Atlanta his death came as \"a devastating blow\" to all those who knew him. He said Sumler \"always wanted to see other people succeed in the business that he'd been around most all of his life\". Read more on Sky News:Celebrities urge end to Gaza 'complicity'Gang founder freed after Kanye lobbies Trump Kool & the Gang have undergone numerous changes in personnel and have explored many musical styles throughout their history, including jazz, rhythm and blues, soul, funk, disco, rock, and pop music since releasing their first album in 1969. They have won numerous accolades, including two Grammy Awards, and have sold more than 70 million albums worldwide."
    }
]