[
    {
        "title": "Donald Trump sending 'top of the line' weapons to support NATO in Ukraine war",
        "description": "Donald Trump has agreed to send \"top of the line weapons\" to NATO to support Ukraine - and threatened Russia with \"severe\" tariffs if it doesn't agree to end the war. ",
        "url": "https://news.sky.com/story/trump-announces-weapons-deal-with-nato-to-help-ukraine-as-he-gives-putin-50-day-ultimatum-13396641",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-patriot-missiles_6965041.jpg?20250715024220",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-14 15:30:00",
        "Headline": "If an agreement to end the war with Ukraine is not reached in 50 days, Donald Trump said the US would bring in \"severe tariffs\" of \"about 100%\" on Russia.",
        "Content": " Donald Trump has agreed to send \"top of the line weapons\" to NATO to support Ukraine - and threatened Russia with \"severe\" tariffs if it doesn't agree to end the war.  Speaking with NATO secretary-general Mark Rutte during a meeting at the White House, the US president said: \"We've made a deal today where we are going to be sending them weapons, and they're going to be paying for them. \"This is billions of dollars worth of military equipment which is going to be purchased from the United States, going to NATO, and that's going to be quickly distributed to the battlefield.\" Follow the latest here Weapons being sent include surface-to-air Patriot missile systems and batteries, which Ukraine has asked for to defend itself from Russian air strikes. Mr Trump also said he was \"very unhappy\" with Russia, and threatened \"severe tariffs\" of \"about 100%\" if there isn't a deal to end the war in Ukraine within 50 days. The White House added that the US would put \"secondary sanctions\" on countries that buy oil from Russia if an agreement was not reached. Later on Monday, Ukrainian leader Volodymyr Zelenskyy thanked Mr Trump and said he was \"grateful\" for the US president's \"readiness to help protect our people's lives\". US correspondent As ever, there is confusion and key questions are left unanswered, but Donald Trump's announcement on Ukraine and Russia today remains hugely significant. His shift in tone and policy on Ukraine is stark. And his shift in tone (and perhaps policy) on Russia is huge. Read Mark's analysis here. After criticising Vladimir Putin's \"desire to drag it out\", he said he appreciated \"preparing a new decision on Patriots for Ukraine\" - and added Kyiv is \"working on major defence agreements with America\". It comes after weeks of frustration from Mr Trump over Mr Putin's refusal to agree to an end to the conflict, with the Russian leader telling the US president he would \"not back down\" from Moscow's goals in Ukraine at the start of the month.  During the briefing on Monday, Mr Trump said he had held calls with Mr Putin where he would think \"that was a nice phone call\", but then \"missiles are launched into Kyiv or some other city, and that happens three or four times\". \"I don't want to say he's an assassin, but he's a tough guy,\" he added. Earlier this year, Mr Trump told Mr Zelenskyy \"you're gambling with World War Three\" in a fiery White House meeting, and suggested Ukraine started the war against Russia as he sought to negotiate an end to the conflict. After Mr Trump's briefing, Russian senator Konstantin Kosachev said on Telegram: \"If this is all that Trump had in mind to say about Ukraine today, then all the steam has gone out.\" Read more:Trump announces 30% tariff on EU imports Trump threatens to revoke US comedian's citizenshipTwo women killed after shooting at US church Meanwhile, Mr Zelenskyy met with US special envoy Keith Kellogg in Kyiv, where they \"discussed the path to peace\" by \"strengthening Ukraine's air defence, joint production, and procurement of defence weapons in collaboration with Europe\". He thanked both the envoy for the visit and Mr Trump \"for the important signals of support and the positive decisions for both our countries\"."
    },
    {
        "title": "Reform UK is on the march - and the most popular party on TikTok. There's just one problem",
        "description": "Reform UK is on the march.",
        "url": "https://news.sky.com/story/how-farage-and-reform-are-winning-over-women-13390940",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-reform-uk-nigel-farage_6954426.png?20250701123958",
        "type": "Home",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-07-14 23:01:00",
        "Headline": "Reform have suffered from an image problem that's scuppered plans for getting women to join up. But big changes were made in the run-up to May's local elections, and then the party secured their first female MP in a by-election.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  Reform UK is on the march. Following a barnstorming performance in this year's local elections, they are now the most successful political party on TikTok, engaging younger audiences. But most of their 400,000 followers are men. Politics Hub: Follow live updates from Westminster I was at the local elections launch for Reform in March, looking around for any young women to interview who had come to support the party at its most ambitious rally yet, and I was struggling. A woman wearing a \"let's save Britain\" hat walked by, and I asked her to help me. \"Now you say it, there are more men here,\" she said. But she wasn't worried, adding: \"We'll get the women in.\" And that probably best sums up Reform's strategy. When Nigel Farage threw his hat into the ring to become an MP for Reform, midway through the general election campaign, they weren't really thinking about the diversity of their base. As a result, they attracted a very specific politician. Fewer than 20% of general election candidates for Reform were women, and the five men elected were all white with a median age of 60. Polling shows that best, too. According to YouGov's survey from June 2025, a year on from the election, young women are one of Reform UK's weakest groups, with just 7% supporting Farage's party - half the rate of men in the same age group. The highest support comes from older men, with a considerable amount of over-65s backing Reform - almost 40%. But the party hoped to change all that at the local elections. Time to go pro It was the closing act of Reform's September conference and Farage had his most serious rallying cry: it was time for the party to \"professionalise\". In an interview with me last year, Farage admitted \"no vetting\" had occurred for one of his new MPs, James McMurdock. Only a couple of months after he arrived in parliament, it was revealed he had been jailed after being convicted of assaulting his then girlfriend in 2006 while drunk outside a nightclub. McMurdock told me earlier this year: \"I would like to do my best to do as little harm to everyone else and at the same time accept that I was a bad person for a moment back then. I'm doing my best to manage the fact that something really regrettable did happen.\" He has since suspended himself from the party over allegations about his business affairs. He has denied any wrongdoing.  Later, two women who worked for another of Reform's original MPs, Rupert Lowe, gave \"credible\" evidence of bullying or harassment by him and his team, according to a report from a KC hired by the party. Lowe denies all wrongdoing and says the claims were retaliation after he criticised Farage in an interview with the Daily Mail, describing his then leader's style as \"messianic\". The Crown Prosecution Service later said it would not charge Lowe after an investigation. He now sits as an independent MP.  A breakthrough night But these issues created an image problem and scuppered plans for getting women to join the party. So, in the run-up to the local elections, big changes were made. The first big opportunity presented itself when a by-election was called in Runcorn and Helsby. The party put up Sarah Pochin as a candidate, and she won a nail-biting race by just six votes. Reform effectively doubled their vote share there compared to the general election - jumping to 38% - and brought its first female MP into parliament. And in the Lincolnshire mayoral race - where Andrea Jenkyns was up for the role - they won with 42% of the vote. The council results that night were positive, too, with Reform taking control of 10 local authorities. They brought new recruits into the party - some of whom had never been involved in active politics.  'The same vibes as Trump' Catherine Becker is one of them and says motherhood, family, and community is at the heart of Reform's offering. It's attracted her to what she calls Reform's \"common sense\" policies. As Reform's parliamentary candidate for Hampstead and Highgate in last year's general election, and now a councillor, she also taps into Reform's strategy of hyper-localism - trying to get candidates to talk about local issues of crime, family, and law and order in the community above everything else. Jess Gill was your quintessential Labour voter: \"I'm northern, I'm working class, I'm a woman, based on the current stereotype that would have been the party for me.\" But when Sir Keir Starmer knelt for Black Lives Matter, she said that was the end of her love affair with the party, and she switched. \"Women are fed up of men not being real men,\" she says. \"Starmer is a bit of a wimp, where Nigel Farage is a funny guy - he gives the same vibes as Trump in a way.\" 'Shy Reformers' But most of Reform's recruits seem to have defected from the Conservative Party, according to the data, and this is where the party sees real opportunity. Anna McGovern was one of those defectors after the astonishing defeat of the Tories in the general election. She thinks there may be \"shy Reformers\" - women who support the party but are unwilling to speak about it publicly. \"You don't see many young women like myself who are publicly saying they support Reform,\" she says. \"I think many people fear that if they publicly say they support Reform, what their friends might think about them. I've faced that before, where people have made assumptions of my beliefs because I've said I support Reform or more right-wing policies.\" But representation isn't their entire strategy. Reform have pivoted to speaking about controversial topics - the sort they think the female voters they're keen to attract may be particularly attuned to. \"Reform are speaking up for women on issues such as transgenderism, defining what a woman is,\" McGovern says. And since Reform's original five MPs joined parliament, grooming gangs have been mentioned 159 times in the Commons - compared to the previous 13 years when it was mentioned 88 times, despite the scandal first coming to prominence back in 2011. But the pitfall of that strategy is where it could risk alienating other communities. Pochin, Reform's first and only female MP, used her first question in parliament to the prime minister to ask if he would ban the burka - something that isn't Reform policy, but which she says was \"punchy\" to \"get the attention to start the debate\".  'What politics is all about' Alex Philips was the right-hand woman to Farage during the Brexit years. She's still very close to senior officials in Reform and a party member, and tells me these issues present an opportunity. \"An issue in politics is a political opportunity and what democracy is for is actually putting a voice to a representation, to concerns of the public. That's what politics is all about.\" Read more:Are Reform winning the 'bro vote'?Reform would win most seats at election Luke Tryl is the executive director of the More In Common public opinion and polling firm, and says the shift since the local elections is targeted and effective. Reform's newer converts are much more likely to be female, as the party started to realise you can't win a general election without getting the support of effectively half the electorate. \"When we speak to women, particularly older women in focus groups, there is a sense that women's issues have been neglected by the traditional mainstream parties,\" he says. \"Particularly issues around women's safety, and women's concerns aren't taken as seriously as they should be. \"If Reform could show it takes their concerns seriously, they may well consolidate their support.\" According to his focus groups, the party's vote share among women aged 18 to 26 shot up in May - jumping from 12% to 21% after the local elections. But the gender divide in right-wing parties is still stark, Tryl says, and representation will remain an uphill battle for a party historically dogged by controversy and clashes. A Reform UK spokesman told Sky News: \"Reform is attracting support across all demographics. \"Our support with women has surged since the general election a year ago, in that time we have seen Sarah Pochin and Andrea Jenkyns elected in senior roles for the party.\""
    },
    {
        "title": "MasterChef presenter John Torode says allegation he used racist language upheld in report",
        "description": "MasterChef presenter John Torode says an allegation he used \"racial language\" was upheld in a report as part of a review into the behaviour of his former co-presenter Gregg Wallace.",
        "url": "https://news.sky.com/story/masterchef-presenter-john-torode-says-allegation-he-used-racial-language-upheld-in-report-13396761",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-john-torode-london_6964986.jpg?20250714215029",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-14 20:28:00",
        "Headline": "Torode says he has \"absolutely no recollection of any of this\" and \"racial language is wholly unacceptable in any environment\".",
        "Content": "MasterChef presenter John Torode says an allegation he used \"racial language\" was upheld in a report as part of a review into the behaviour of his former co-presenter Gregg Wallace. The report, led by law firm Lewis Silkin, found 45 of 83 allegations against Wallace were substantiated. There were also two standalone allegations made against other people, including one for using racist language. In a statement posted on his Instagram page, Torode said he was one of those people, but added that he had \"no recollection of the incident\" and said he \"did not believe that it happened\". He commented: \"Following publication of the executive summary of the investigation into Gregg Wallace while working on MasterChef, I am aware of speculation that I am one of the two other individuals against whom an allegation has been upheld. \"For the sake of transparency, I confirm that I am the individual who is alleged to have used racial language on one occasion. \"The allegation is that I did so sometime in 2018 or 2019, in a social situation, and that the person I was speaking with did not believe that it was intended in a malicious way and that I apologised immediately afterwards. \"I have absolutely no recollection of any of this, and I do not believe that it happened. \"However, I want to be clear that I've always had the view that any racial language is wholly unacceptable in any environment. I'm shocked and saddened by the allegation as I would never wish to cause anyone any offence.\" Read more:Driver jailed after cocaine haul discovered following car chaseFour people killed in Essex plane crash Wallace, 60, said he was \"deeply sorry\" for causing any distress, and never set out to \"harm or humiliate\". While the majority of the substantiated claims related to inappropriate sexual language and humour, one related to \"unwanted physical contact\", and three were about being \"in a state of undress\". The report said the number of sustained allegations made Wallace's return to MasterChef \"untenable\".  In a statement on Monday, Wallace said \"some of [his] humour and language missed the mark\", but he said, after nearly 20 years on MasterChef, \"I now see that certain patterns, shaped by traits I've only recently begun to understand, may have been misread\". Wallace, who said a \"late autism diagnosis\" had helped him understand how he is \"perceived\", criticised the BBC, saying the corporation had left him \"exposed to trial by media\". \"This has been brutal,\" he said."
    },
    {
        "title": "World's biggest human imaging project reaches new milestone after scanning 100,000th UK volunteer",
        "description": "Steve's morning starts lying still in the clanging magnet of an MRI machine as his body is slowly scanned from neck to knee in intimate detail.",
        "url": "https://news.sky.com/story/worlds-biggest-human-imaging-project-reaches-new-milestone-after-scanning-100000th-uk-volunteer-13396786",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-uk-biobank-samples_6965031.png?20250715010458",
        "type": "Home",
        "Author": "Tom Clarke",
        "Date Published": "2025-07-14 22:35:00",
        "Headline": "The UK Biobank has now scanned 100,000 people, taking recordings of hearts, brains, blood vessels and bones. As the world's most comprehensive human imaging project, it's providing insights into everything from Alzheimer's, heart disease and cancer.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Steve's morning starts lying still in the clanging magnet of an MRI machine as his body is slowly scanned from neck to knee in intimate detail. Then it's on to another MRI scanner, followed by X-rays of his bones, ultrasound on his neck, blood and other samples, medical tests and questionnaires - in all five hours of his time. A test of patience you'd admire in any patient - only Steve is perfectly healthy. He's a volunteer in the UK Biobank project, giving up his time to help complete the world's largest medical imaging dataset. His motivation: that his data may help where he can't. \"My mum in particular at the moment now, is suffering from early stages of dementia, close friends have had cancer.\" \"Giving up my time now... is going to help medical research in the future.\" \n                  Measles: Liverpool health official urges public to be aware of symptoms after child dies\n                 \n                  Child dies as measles cases surge at Liverpool hospital\n                 \n                  'My voice box was removed after NHS missed my throat cancer'\n                 Even more remarkable is that Steve is the 100,000th volunteer to have willingly gone through the process. Each one allows their carefully anonymised images (it's why we're only using Steve's first name) as well as their biological samples, medical and lifestyle histories, available to the world's medical researchers in perpetuity. \"The unprecedented scale of this imaging project - more than 10 times bigger than anything that existed before - makes it possible for scientists to see patterns of disease that just couldn't otherwise be seen,\" said Professor Sir Rory Collins, chief executive of UK Biobank. \"Combining these images from different parts of the body with all the genetic and lifestyle information from our volunteers, scientists are getting a far better understanding of how our bodies work,\" he said. Given the time and complexity of whole-body imaging, it's a project many scientists believed would never work. \"When we started, some people thought that we got our numbers wrong,\" said Prof Naomi Allen, chief scientist at UK Biobank. \"Surely we wanted to scan at 10,000 participants... not 100,000. And yet, here we are.\" The UK Biobank was already a powerful resource for medical research. Since 2003, it has recruited half a million people in Britain between the ages of 40 and 69 with the aim of following each of them as they age. It's long been the world's most comprehensive biomedical data resource used in more than 60 countries by at least 20,000 researchers, providing new insights into everything from Alzheimer's and heart disease to long COVID and cancer. Adding imaging data from a fifth of those participants should make it even more useful. \"Many of the common diseases of middle of late life, heart disease, dementia, cancer, Parkinson's disease, they can take many years to develop before you have symptoms,\" said Prof Allen. \"What these scans will be able to do is to identify those warning flags, the early starts of the disease process, very early on.\" Seeing those changes early in scans and being able to relate them to the underlying biology and lifestyle histories of such a large number of people, could point to new treatments, or new targets for existing treatments, that could prolong healthy lives. In the decade since the imaging part of the study began, researchers have already published 1,300 studies based on the new data. NHS memory clinics are using techniques developed in the study to better diagnose dementia from MRI images. An AI tool, developed using Biobank images of the heart, is being used in over 90 countries to analyse heart scans in less than a second that previously took 15 minutes to process. And it is advances in AI that are expected to make even more of the overwhelming 30 petabytes of data contained within the Biobank database and imaging programme. Read more from Sky News:Sleep problems linked to dementiaAI can detect over 1,000 diseasesWhite wine could cut heart risk \"When we were doing manual analysis of this data, it would take me about a day just to measure how much fat somebody had,\" said Louise Thomas, a professor of metabolic imaging at the University of Westminster. \"We predicted [Biobank data] would take us thousands of years of manual analysis. Now, we use a small amount of manual analysis to train the AI models in how to do it and we can analyse everything in seconds. It's quite extraordinary.\" AI analysis isn't perfect, but it has already helped guided Thomas's team to identify the types of patient at increased risk of heart aneurysm, the relationship between fat stored in muscle, age-related muscle loss and risk of falls, and revealing that up to a quarter of the UK population have unhealthy levels of fat in their liver - a key driver of liver disease that is a costly burden on the NHS. As the scale and value of datasets like UK Biobank grow, so too will questions about how the not-for-profit, open-access project protects its volunteers' data, and the kind of individuals and companies that may profit from it. Prof Allen says the security of the anonymised data is under constant review and approved researchers are carefully vetted to ensure they are who they say they are and doing health research in the public interest. The next phase of the imaging project is already underway, to scan 60,000 of the 100,000 participants already imaged at a later date to provide new insights into the hidden changes our bodies go through as we age."
    },
    {
        "title": "Measles: Liverpool health official urges public to be aware of symptoms after child dies",
        "description": "A Liverpool City Council official has urged the public to be aware of the symptoms of measles after a child died from the disease.",
        "url": "https://news.sky.com/story/measles-liverpool-health-official-urges-public-to-be-aware-of-symptoms-after-child-dies-13396771",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sherry-andrews-mmr_6908224.jpg?20250506161629",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-14 21:06:00",
        "Headline": "Liverpool City Council's director of public health said \"people assume (measles is) an old disease or it's one that's gone away... it couldn't be further from the case\".",
        "Content": " A Liverpool City Council official has urged the public to be aware of the symptoms of measles after a child died from the disease. Speaking on The UK Tonight with Sarah-Jane Mee, director of public health for Liverpool City Council, Professor Matthew Ashton, said he wanted to raise awareness of the virus. It comes after a child died at the city's Alder Hey Children's Hospital after becoming ill with measles and other health problems. Mr Ashton said that measles was \"circulating\" in the community, with 17 cases recorded at Alder Hey since the start of June - which he said \"is a worry for us\". \"It's a really nasty virus,\" he added. \"No matter who you are, if you're not protected, it can do you harm.\" Earlier on Monday, chairman of the Local Government Association's community wellbeing board, councillor David Fothergill, said there was \"an urgent need to address falling immunisation rates\". \"These gaps have contributed to 529 confirmed measles cases in England so far in 2025,\" he said, \"with 68% occurring in children under the age of 10.\"  Speaking to Sky News, Mr Ashton said: \"Vaccination rates have been declining nationally for the last decade... In Liverpool, we're down below 74%. \"Nationally, it's a bit higher than that, but it's still far too low. And the trouble is then, when you have unexposed populations or unprotected populations, the potential for measles going rogue is very high.\" Mr Ashton said vaccination rates have been declining nationally for the last decade and that the World Health Organisation (WHO) recommends 95% vaccination levels to reach herd immunity.  Read more:Cases double to highest level in nearly three decadesWhat's behind the decline in measles vaccine rates? Mr Ashton noted \"there's lots of reasons why vaccination rates have dropped,\" citing \"fatigue\" from the COVID pandemic and \"disinformation,\" but added: \"I do think it's more complicated than that. \"I think we have to recognise that life for our communities has got significantly harder over the last ten years, and people are working really hard to make sure they can still pay the bills, put food on the table, look after loved ones. \"Sometimes routine health care appointments are just not top of the list of things to do.\" The first symptoms of measles include:\n • A high temperature • A runny or blocked nose • Sneezing\n • A cough • Red, sore or watery eyes Cold-like symptoms are followed a few days later by a rash, which starts on the face and behind the ears, before it spreads. The spots are usually raised and can join together to form blotchy patches which are not usually itchy. Some people may get small spots in their mouth too. What should you do if you think your child has measles?\n Ask for an urgent GP appointment or call 111 if you think your child has measles. If your child has been vaccinated, it is very unlikely they have measles.\n You should not go to the doctor without calling ahead, as measles is very infectious. If your child is diagnosed with measles by a doctor, make sure they avoid close contact with babies and anyone who is pregnant or has a weakened immune system. The public health director said that while \"people assume it's an old disease or it's one that's gone away... it couldn't be further from the case\". He noted that one case of measles can infect up to 15 people, and urged people that if they think they have symptoms, call their GP or 111 - and do not go to A&E."
    },
    {
        "title": "Driver jailed for 12 years after £1m cocaine haul discovered following 120mph car chase on M5 in West Midlands",
        "description": "A man who led police on a 120mph car chase has been given a substantial jail sentence after cocaine worth more than a million pounds was found in the boot of his car.",
        "url": "https://news.sky.com/story/driver-jailed-for-12-years-after-1631m-cocaine-haul-discovered-following-120mph-car-chase-on-m5-in-west-midlands-13396677",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-david-sherratt-cocaine_6964785.jpg?20250714152908",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-14 16:46:00",
        "Headline": "\"Good day at the office, lads,\" David Sherratt told officers when they finally brought him to a stop on the M42 in Worcestershire.",
        "Content": " A man who led police on a 120mph car chase has been given a substantial jail sentence after cocaine worth more than a million pounds was found in the boot of his car. \"Good day at the office, lads,\" David Sherratt told officers when they finally brought him to a stop on the M42 near Alvechurch in Worcestershire. A stinger was used, which punctured two of his tyres, one of which separated from the wheel rim and rolled off. Sherratt, 48, was then pulled from the Peugeot 3008 and pushed to the tarmac, police video showed. Once officers were free to search the car, they found two Sports Direct bags in the boot, each containing 18kg of cocaine, the wholesale value of which was up to £1.3m. Sherratt was seen smashing his phone against the dashboard, police said, but messages were recovered showing he had been involved in the collection of a further 135kg of drugs, worth up to £5m in total. \"He would deliver them to customers around the country, earning up to £200 per kilo delivered - and was expecting to earn £20,000 in just six weeks for his work,\" West Midlands Police (WMP) said. The chase began when officers from the force's Road Crime Team tried to stop the car because it was believed to be linked to narcotics. But Sherratt sped off, reaching 120mph on the M5 before heading on to the M42, pursued by both a police car and helicopter. Sherratt, of no fixed address, was jailed at Birmingham Crown Court for 12 years and nine months after admitting being \"concerned in the supply of cocaine\", possessing the drug with intent to supply, and dangerous driving. He has 12 convictions for 19 offences dating back to 1995, WMP said. He was jailed for six years in 2016 for conspiracy to supply class A drugs, and more than four years in 2020 for further drugs offences, the force added. Detective Chief Inspector Peter Cooke said the cocaine would have \"ultimately been sold on the streets of the UK and caused untold misery\". He added: \"Sherratt's attempt to get away from our officers was dangerous and put other road users at risk, but great work by the Road Crime Team meant the pursuit was brought to a safe conclusion. \"He played a significant role in the distribution of drugs around the country, but will now be spending years behind bars.\""
    },
    {
        "title": "Premier League club Brentford to sell stake at £400m valuation",
        "description": "The owner of Brentford Football Club has clinched a deal to sell a minority stake in the Premier League side to new investors at a valuation of roughly &#163;400m.",
        "url": "https://news.sky.com/story/premier-league-club-brentford-to-sell-stake-at-163400m-valuation-13396772",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-brentford-fulham_6964996.jpg?20250714221958",
        "type": "Home",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-14 21:17:00",
        "Headline": "A deal that will see long-standing Bees-owner Matthew Benham offloading a sizeable minority interest could be announced as soon as Tuesday, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of Brentford Football Club has clinched a deal to sell a minority stake in the Premier League side to new investors at a valuation of roughly £400m. Sky News has learnt that an agreement that will involve current owner Matthew Benham offloading a chunk of his holding to Gary Lubner - the wealthy businessman who ran Autoglass-owner Belron - is expected to be announced as early as Tuesday. Matthew Vaughn, the Hollywood film-maker whose credits include Layer Cake and Lock, Stock and Two Smoking Barrels, is also expected to invest in Brentford as part of the deal, The Athletic reported last month. Further details of the transaction were unclear on Monday night, although one insider speculated that it could ultimately see as much as 25% of the club changing hands. If confirmed, it would underline the continuing interest from wealthy investors in top-flight English clubs. FA Cup winners Crystal Palace have seen a minority stake being bought by Woody Johnson, the New York Jets-owner, in the last few weeks, with that deal hastened by the implications of former shareholder John Textor's simultaneous ownership of a stake in French club Lyon. Sky News revealed in February 2024 that Mr Benham had hired bankers at Rothschild to market a stake in Brentford. \n                  City financier Kolade joins ranks of Channel 4 chair contenders\n                 \n                  Money: How to claim back VAT on your holiday buys\n                 \n                  Economists say the cost of living crisis is over - here's why many households disagree\n                 Under Mr Benham's stewardship, it has enjoyed one of the most successful transformations in English football, rising from the lower divisions to the top division in 2021. It has also moved from its long-standing Griffin Park home to a new stadium near Kew Bridge. This summer is proving to be one of transition, with manager Thomas Frank joining Tottenham Hotspur and striker Bryan Mbeumo the subject of persistent interest from Manchester United. Brentford did not respond to a request for comment on Monday night, while a spokesman for Mr Lubner declined to comment."
    },
    {
        "title": "Constance Marten and Mark Gordon guilty of killing their newborn baby",
        "description": "Constance Marten and her partner Mark Gordon have been found guilty of killing their newborn baby.",
        "url": "https://news.sky.com/story/constance-marten-and-mark-gordon-found-guilty-of-manslaughter-of-their-newborn-baby-13385873",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-constance-marten-mark-gordon_6964734.jpg?20250714144201",
        "type": "Home",
        "Author": "Henry Vaughan, home affairs reporter, Ashna Hurynag, news correspondent, and Victoria Bird",
        "Date Published": "2025-07-14 13:00:00",
        "Headline": "Police launched a nationwide hunt for the couple after they went on the run with their daughter Victoria to stop social services from taking her away.",
        "Content": "By Henry Vaughan, home affairs reporter, Ashna Hurynag, news correspondent, and Victoria Bird   Constance Marten and her partner Mark Gordon have been found guilty of killing their newborn baby. Marten, 38, who is from a wealthy family, and Gordon, 51, went on the run with their daughter Victoria to get away from social services after their four other children were taken into care. The baby's body was found with rubbish inside a Lidl shopping bag, in the corner of a disused shed, in an allotment in Brighton on 1 March 2023 - two days after the couple were arrested following a 54-day nationwide police hunt. The couple were convicted of manslaughter by gross negligence on Monday at the Old Bailey. They gave no response and refused to stand up as the verdict was read out. Gordon leaned his head back with his eyes closed while Marten looked resigned. Prosecutors had said Victoria's death was \"inevitable\" when Marten and Gordon began camping on the South Downs in January 2023 in a \"flimsy\" tent. The couple said it was a tragic accident and denied wrongdoing, but last year were found guilty of perverting the course of justice, concealing the birth of a child, and child cruelty after an Old Bailey trial lasting almost five months. The jury - initially told the case would last six weeks - was discharged after failing to reach a verdict on other outstanding counts, having sent a total of almost 200 notes or questions to the judge. Twists and turns in court  Marten and Gordon have now been found guilty of manslaughter following a retrial in front of a second jury at the same court. Both trials were hampered by disruption and delays, taking up more than 33 weeks of court time, which at an estimated £30,000 per defendant a day could have cost in the region of £10m. Judge Mark Lucraft KC suggested Marten may have made a \"deliberate attempt\" to \"scupper\" the retrial when she dramatically revealed Gordon's \"violent rape conviction\" in the US after he attacked a woman when he was a teenager. Gordon's barrister said the evidence was so prejudicial that the jury should be discharged only for his client to change his mind when he realised he would have to stand trial without his partner next year. Marten then said she wanted to \"sack\" her KC, the 15th lawyer she had parted company with, but was still represented by a junior barrister, while Gordon's lawyers withdrew and he represented himself. He asked for a copy of the 3,500-page legal textbook Archbold, which covers the entirety of the criminal law in England and Wales, and at one point, the judge said: \"Do you want me to adjourn for three years while you do a law degree?\" In an extraordinary courtroom cross-examination, Gordon was allowed to question his partner, who took the opportunity to attack her family, who have links to the Royal Family and who she said saw her as \"an embarrassment\".  'Such obvious risks' After the verdict, the Crown Prosecution Service's London Senior Crown Prosecutor Samantha Yelland said it was \"shocking\" that Marten and Gordon \"could subject their newborn baby to such obvious risks\". \"Their reckless actions were driven by a selfish desire to keep their baby no matter the cost - resulting in her tragic death,\" she added. \"These defendants did everything they could to evade the authorities - from avoiding the use of their bank cards to the point that they were starving, ditching their phones to avoid being traced and travelling hundreds of miles daily from place to place to dodge the police.\" Metropolitan Police Detective Chief Inspector Joanna Yorke, who led the homicide investigation into Victoria's death, also said that Marten and Gordon's \"selfish actions\" resulted in \"the death of an innocent newborn baby who would have recently had her second birthday and should have had the rest of her life ahead of her\". She added: \"We know today's verdict won't bring Victoria back, but I am pleased our investigation has resulted in the couple who caused her death finally being brought to justice.\" Read more:Why did Constance Marten and Mark Gordon go on the run?  'Stolen by the state'  Marten met Gordon around a decade ago and the pair married in an unofficial ceremony in Peru, where she later became pregnant with their first child. She said her family didn't approve of the relationship and her parents hired private investigators to track them. \"Some people who are privileged think they are above the rules,\" she said. \"It is harrowing, you are up against these people who will stop at nothing, who have endless resources and connections.\" A search for Marten and Gordon was launched after a placenta was found in the couple's burnt-out car on a motorway in Bolton in January 2023. Marten said they went on the run so their fifth child would not be removed from them after her other children were \"stolen by the state\". The couple spent vast sums of cash from her family trust fund on taxi journeys as they travelled from Bolton, to Liverpool, to Harwich in Essex, to London and then to Newhaven on the south coast.  Prosecutors said the baby was inadequately clothed in a babygrow and that Marten had got wet as she carried the infant underneath her coat, alleging Victoria died from hypothermia or was smothered while co-sleeping. The court heard how Marten had been warned against living in a tent with a baby and falling asleep with a child on her chest after she first gave birth in 2017. Marten said that she was living in fear and that her \"number one priority\" was to protect Victoria. But her evidence came to an abrupt end when she refused to answer any more questions after prosecutor Joel Smith KC asked her if leaving her daughter's body in a bag of rubbish was a \"despicable thing\" to do. 'Treated like monsters' Gordon, who did not give evidence in the first trial and adopted the same tactic in the second before changing his mind, blamed the police manhunt for setting off a series of \"calamitous\" events which ended in Victoria's death. He wept in the witness box as he claimed the couple had been treated like \"monsters\" and dragged through mud like \"scum\" over what happened. But he also pulled the plug before prosecutors could question his story, declaring: \"All right, that's it.\" In his closing speech, Gordon, wearing a pale orange head covering, told the jury that the prosecution's case was \"like a script from a movie\" and the conditions posed no threat to Victoria because they were \"experienced campers\". He said the tent was sheltered, they wore layered clothing and even mentioned his \"wife's excessive body fat\".  'Complete madness'  During the retrial, Marten, who trained as a journalist, appeared on the front cover of a magazine written \"by and for women in the justice system\", having written a three-page article under her own picture byline. In the piece, accompanied by a podcast in which her words were read by an actor, she complained about the \"disgusting and inadequate\" court food, the \"stone cold cells in the basement\" and 17 to 19-hour days \"when I decide to attend\". \"My life depends on the outcome of this trial,\" she wrote. \"How can I attend a highly emotionally charged case with my liberty on the line and remain alert and attentive for three months? With very little rest and no access to my legal team while my trial is ongoing, it's just complete madness.\""
    },
    {
        "title": "All four people killed in Southend plane crash thought to be foreign nationals, police say",
        "description": "All four people who died in Sunday's plane crash at Southend Airport are thought to have been foreign nationals, police have said.",
        "url": "https://news.sky.com/story/fireball-at-southend-airport-after-small-plane-crashes-13396214",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-southend-airport_6964101.jpg?20250713171252",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-14 12:00:00",
        "Headline": "Essex Police says the aircraft \"got into difficulty\" shortly after take-off and \"crashed within the airport boundary\".",
        "Content": " All four people who died in Sunday's plane crash at Southend Airport are thought to have been foreign nationals, police have said. The medical transport aircraft had dropped off a patient and was beginning its journey back to the Netherlands when it crashed at about 3.48pm on Sunday. Two Dutch pilots were among those on board, according to a document which lists passengers, the PA news agency understands. On board too was a Chilean nurse, 31-year-old Maria Fernanda Rojas Ortiz, also known as Fena, Sky News understands. No details have been released about the fourth person's nationality, though Essex Police said the deceased were all foreign nationals.  John Johnson, who was at the airport with his wife and children, said he saw a \"big fireball\" exploding across the sky as the plane plunged \"head first into the ground\". \"We all waved at the pilots, and they all waved back at us,\" he said. \"The aircraft then turned 180 degrees to face its take-off, powered up [and] rolled down the runway. \"It took off and about three or four seconds [later] it started to bank heavily to its left, and then within a few seconds of that happening, it more or less inverted and crashed just head first into the ground.\" Mr Johnson added: \"There was a big fireball. Obviously, everybody was in shock [after] witnessing it.\" Chief Superintendent Morgan Cronin said the plane \"got into difficulty\" shortly after taking off and \"crashed within the airport boundary\". He added: \"Sadly, we can now confirm that all four people on board died. \"We are working to officially confirm their identities. At this stage, we believe all four are foreign nationals.\" Ambulances and fire crews were also called in. Southend Airport said it would be \"closed until further notice\" and urged people to contact their airlines. Its staff are \"working closely with the emergency services and air accident investigators\". Zeusch Aviation, based at Lelystad Airport in the Netherlands, confirmed its flight SUZ1 had been \"involved in an accident\" at the airport and its thoughts were with \"everyone who has been affected\". The plane involved is reportedly a Beech B200 Super King Air with twin-propellers. The Air Accidents Investigation Branch said a \"multi-disciplinary team\" arrived at the site on Sunday afternoon. Lisa Fitzsimons, a senior investigator, said it is \"too early to speculate\" on what may have caused the crash.  'Airport in lockdown' Wren Stranix, 16, from Woodbridge in Suffolk, was in another aircraft waiting to take off for Newquay in Cornwall with her family and boyfriend when the plane came down. They watched as the emergency services arrived and were unable to leave their seats. \"The flight attendant didn't know what was going on,\" she told Sky News. \"They said the plane had exploded and they didn't know if it was safe or not. The airport was in lockdown.\" Read more from Sky News:Gregg Wallace 'deeply sorry' after allegations upheldPostman murdered and beheaded girlfriend EasyJet, one of only a few airlines to use the airport, said all its remaining flights to and from Southend had been \"diverted\" or were \"no longer able to operate\". David Burton-Sampson, the MP for Southend West and Leigh, asked people to keep away from the area and \"allow the emergency services to do their work\" in a post on social media. Transport Secretary Heidi Alexander said she was \"monitoring the situation closely and receiving regular updates\". Sir Keir Starmer, the prime minister, said it was \"terrible news that four people [had] tragically lost their lives\" and he thanked the emergency services. Essex Police is asking anyone with information or footage to get in touch. Mr Cronin said: \"In these very early stages it is vital we gather the information we need.\""
    },
    {
        "title": "Reform UK is on the march - and the most popular party on TikTok. There's just one problem",
        "description": "Reform UK is on the march.",
        "url": "https://news.sky.com/story/how-farage-and-reform-are-winning-over-women-13390940",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-reform-uk-nigel-farage_6954426.png?20250701123958",
        "type": "UK",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-07-14 23:01:00",
        "Headline": "Reform have suffered from an image problem that's scuppered plans for getting women to join up. But big changes were made in the run-up to May's local elections, and then the party secured their first female MP in a by-election.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  Reform UK is on the march. Following a barnstorming performance in this year's local elections, they are now the most successful political party on TikTok, engaging younger audiences. But most of their 400,000 followers are men. Politics Hub: Follow live updates from Westminster I was at the local elections launch for Reform in March, looking around for any young women to interview who had come to support the party at its most ambitious rally yet, and I was struggling. A woman wearing a \"let's save Britain\" hat walked by, and I asked her to help me. \"Now you say it, there are more men here,\" she said. But she wasn't worried, adding: \"We'll get the women in.\" And that probably best sums up Reform's strategy. When Nigel Farage threw his hat into the ring to become an MP for Reform, midway through the general election campaign, they weren't really thinking about the diversity of their base. As a result, they attracted a very specific politician. Fewer than 20% of general election candidates for Reform were women, and the five men elected were all white with a median age of 60. Polling shows that best, too. According to YouGov's survey from June 2025, a year on from the election, young women are one of Reform UK's weakest groups, with just 7% supporting Farage's party - half the rate of men in the same age group. The highest support comes from older men, with a considerable amount of over-65s backing Reform - almost 40%. But the party hoped to change all that at the local elections. Time to go pro It was the closing act of Reform's September conference and Farage had his most serious rallying cry: it was time for the party to \"professionalise\". In an interview with me last year, Farage admitted \"no vetting\" had occurred for one of his new MPs, James McMurdock. Only a couple of months after he arrived in parliament, it was revealed he had been jailed after being convicted of assaulting his then girlfriend in 2006 while drunk outside a nightclub. McMurdock told me earlier this year: \"I would like to do my best to do as little harm to everyone else and at the same time accept that I was a bad person for a moment back then. I'm doing my best to manage the fact that something really regrettable did happen.\" He has since suspended himself from the party over allegations about his business affairs. He has denied any wrongdoing.  Later, two women who worked for another of Reform's original MPs, Rupert Lowe, gave \"credible\" evidence of bullying or harassment by him and his team, according to a report from a KC hired by the party. Lowe denies all wrongdoing and says the claims were retaliation after he criticised Farage in an interview with the Daily Mail, describing his then leader's style as \"messianic\". The Crown Prosecution Service later said it would not charge Lowe after an investigation. He now sits as an independent MP.  A breakthrough night But these issues created an image problem and scuppered plans for getting women to join the party. So, in the run-up to the local elections, big changes were made. The first big opportunity presented itself when a by-election was called in Runcorn and Helsby. The party put up Sarah Pochin as a candidate, and she won a nail-biting race by just six votes. Reform effectively doubled their vote share there compared to the general election - jumping to 38% - and brought its first female MP into parliament. And in the Lincolnshire mayoral race - where Andrea Jenkyns was up for the role - they won with 42% of the vote. The council results that night were positive, too, with Reform taking control of 10 local authorities. They brought new recruits into the party - some of whom had never been involved in active politics.  'The same vibes as Trump' Catherine Becker is one of them and says motherhood, family, and community is at the heart of Reform's offering. It's attracted her to what she calls Reform's \"common sense\" policies. As Reform's parliamentary candidate for Hampstead and Highgate in last year's general election, and now a councillor, she also taps into Reform's strategy of hyper-localism - trying to get candidates to talk about local issues of crime, family, and law and order in the community above everything else. Jess Gill was your quintessential Labour voter: \"I'm northern, I'm working class, I'm a woman, based on the current stereotype that would have been the party for me.\" But when Sir Keir Starmer knelt for Black Lives Matter, she said that was the end of her love affair with the party, and she switched. \"Women are fed up of men not being real men,\" she says. \"Starmer is a bit of a wimp, where Nigel Farage is a funny guy - he gives the same vibes as Trump in a way.\" 'Shy Reformers' But most of Reform's recruits seem to have defected from the Conservative Party, according to the data, and this is where the party sees real opportunity. Anna McGovern was one of those defectors after the astonishing defeat of the Tories in the general election. She thinks there may be \"shy Reformers\" - women who support the party but are unwilling to speak about it publicly. \"You don't see many young women like myself who are publicly saying they support Reform,\" she says. \"I think many people fear that if they publicly say they support Reform, what their friends might think about them. I've faced that before, where people have made assumptions of my beliefs because I've said I support Reform or more right-wing policies.\" But representation isn't their entire strategy. Reform have pivoted to speaking about controversial topics - the sort they think the female voters they're keen to attract may be particularly attuned to. \"Reform are speaking up for women on issues such as transgenderism, defining what a woman is,\" McGovern says. And since Reform's original five MPs joined parliament, grooming gangs have been mentioned 159 times in the Commons - compared to the previous 13 years when it was mentioned 88 times, despite the scandal first coming to prominence back in 2011. But the pitfall of that strategy is where it could risk alienating other communities. Pochin, Reform's first and only female MP, used her first question in parliament to the prime minister to ask if he would ban the burka - something that isn't Reform policy, but which she says was \"punchy\" to \"get the attention to start the debate\".  'What politics is all about' Alex Philips was the right-hand woman to Farage during the Brexit years. She's still very close to senior officials in Reform and a party member, and tells me these issues present an opportunity. \"An issue in politics is a political opportunity and what democracy is for is actually putting a voice to a representation, to concerns of the public. That's what politics is all about.\" Read more:Are Reform winning the 'bro vote'?Reform would win most seats at election Luke Tryl is the executive director of the More In Common public opinion and polling firm, and says the shift since the local elections is targeted and effective. Reform's newer converts are much more likely to be female, as the party started to realise you can't win a general election without getting the support of effectively half the electorate. \"When we speak to women, particularly older women in focus groups, there is a sense that women's issues have been neglected by the traditional mainstream parties,\" he says. \"Particularly issues around women's safety, and women's concerns aren't taken as seriously as they should be. \"If Reform could show it takes their concerns seriously, they may well consolidate their support.\" According to his focus groups, the party's vote share among women aged 18 to 26 shot up in May - jumping from 12% to 21% after the local elections. But the gender divide in right-wing parties is still stark, Tryl says, and representation will remain an uphill battle for a party historically dogged by controversy and clashes. A Reform UK spokesman told Sky News: \"Reform is attracting support across all demographics. \"Our support with women has surged since the general election a year ago, in that time we have seen Sarah Pochin and Andrea Jenkyns elected in senior roles for the party.\""
    },
    {
        "title": "World's biggest human imaging project reaches new milestone after scanning 100,000th UK volunteer",
        "description": "Steve's morning starts lying still in the clanging magnet of an MRI machine as his body is slowly scanned from neck to knee in intimate detail.",
        "url": "https://news.sky.com/story/worlds-biggest-human-imaging-project-reaches-new-milestone-after-scanning-100000th-uk-volunteer-13396786",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-uk-biobank-samples_6965031.png?20250715010458",
        "type": "UK",
        "Author": "Tom Clarke",
        "Date Published": "2025-07-14 22:35:00",
        "Headline": "The UK Biobank has now scanned 100,000 people, taking recordings of hearts, brains, blood vessels and bones. As the world's most comprehensive human imaging project, it's providing insights into everything from Alzheimer's, heart disease and cancer.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Steve's morning starts lying still in the clanging magnet of an MRI machine as his body is slowly scanned from neck to knee in intimate detail. Then it's on to another MRI scanner, followed by X-rays of his bones, ultrasound on his neck, blood and other samples, medical tests and questionnaires - in all five hours of his time. A test of patience you'd admire in any patient - only Steve is perfectly healthy. He's a volunteer in the UK Biobank project, giving up his time to help complete the world's largest medical imaging dataset. His motivation: that his data may help where he can't. \"My mum in particular at the moment now, is suffering from early stages of dementia, close friends have had cancer.\" \"Giving up my time now... is going to help medical research in the future.\" \n                  Measles: Liverpool health official urges public to be aware of symptoms after child dies\n                 \n                  Child dies as measles cases surge at Liverpool hospital\n                 \n                  'My voice box was removed after NHS missed my throat cancer'\n                 Even more remarkable is that Steve is the 100,000th volunteer to have willingly gone through the process. Each one allows their carefully anonymised images (it's why we're only using Steve's first name) as well as their biological samples, medical and lifestyle histories, available to the world's medical researchers in perpetuity. \"The unprecedented scale of this imaging project - more than 10 times bigger than anything that existed before - makes it possible for scientists to see patterns of disease that just couldn't otherwise be seen,\" said Professor Sir Rory Collins, chief executive of UK Biobank. \"Combining these images from different parts of the body with all the genetic and lifestyle information from our volunteers, scientists are getting a far better understanding of how our bodies work,\" he said. Given the time and complexity of whole-body imaging, it's a project many scientists believed would never work. \"When we started, some people thought that we got our numbers wrong,\" said Prof Naomi Allen, chief scientist at UK Biobank. \"Surely we wanted to scan at 10,000 participants... not 100,000. And yet, here we are.\" The UK Biobank was already a powerful resource for medical research. Since 2003, it has recruited half a million people in Britain between the ages of 40 and 69 with the aim of following each of them as they age. It's long been the world's most comprehensive biomedical data resource used in more than 60 countries by at least 20,000 researchers, providing new insights into everything from Alzheimer's and heart disease to long COVID and cancer. Adding imaging data from a fifth of those participants should make it even more useful. \"Many of the common diseases of middle of late life, heart disease, dementia, cancer, Parkinson's disease, they can take many years to develop before you have symptoms,\" said Prof Allen. \"What these scans will be able to do is to identify those warning flags, the early starts of the disease process, very early on.\" Seeing those changes early in scans and being able to relate them to the underlying biology and lifestyle histories of such a large number of people, could point to new treatments, or new targets for existing treatments, that could prolong healthy lives. In the decade since the imaging part of the study began, researchers have already published 1,300 studies based on the new data. NHS memory clinics are using techniques developed in the study to better diagnose dementia from MRI images. An AI tool, developed using Biobank images of the heart, is being used in over 90 countries to analyse heart scans in less than a second that previously took 15 minutes to process. And it is advances in AI that are expected to make even more of the overwhelming 30 petabytes of data contained within the Biobank database and imaging programme. Read more from Sky News:Sleep problems linked to dementiaAI can detect over 1,000 diseasesWhite wine could cut heart risk \"When we were doing manual analysis of this data, it would take me about a day just to measure how much fat somebody had,\" said Louise Thomas, a professor of metabolic imaging at the University of Westminster. \"We predicted [Biobank data] would take us thousands of years of manual analysis. Now, we use a small amount of manual analysis to train the AI models in how to do it and we can analyse everything in seconds. It's quite extraordinary.\" AI analysis isn't perfect, but it has already helped guided Thomas's team to identify the types of patient at increased risk of heart aneurysm, the relationship between fat stored in muscle, age-related muscle loss and risk of falls, and revealing that up to a quarter of the UK population have unhealthy levels of fat in their liver - a key driver of liver disease that is a costly burden on the NHS. As the scale and value of datasets like UK Biobank grow, so too will questions about how the not-for-profit, open-access project protects its volunteers' data, and the kind of individuals and companies that may profit from it. Prof Allen says the security of the anonymised data is under constant review and approved researchers are carefully vetted to ensure they are who they say they are and doing health research in the public interest. The next phase of the imaging project is already underway, to scan 60,000 of the 100,000 participants already imaged at a later date to provide new insights into the hidden changes our bodies go through as we age."
    },
    {
        "title": "Constance Marten and Mark Gordon guilty of killing their newborn baby",
        "description": "Constance Marten and her partner Mark Gordon have been found guilty of killing their newborn baby.",
        "url": "https://news.sky.com/story/constance-marten-and-mark-gordon-found-guilty-of-manslaughter-of-their-newborn-baby-13385873",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-constance-marten-mark-gordon_6964734.jpg?20250714144201",
        "type": "UK",
        "Author": "Henry Vaughan, home affairs reporter, Ashna Hurynag, news correspondent, and Victoria Bird",
        "Date Published": "2025-07-14 13:00:00",
        "Headline": "Police launched a nationwide hunt for the couple after they went on the run with their daughter Victoria to stop social services from taking her away.",
        "Content": "By Henry Vaughan, home affairs reporter, Ashna Hurynag, news correspondent, and Victoria Bird   Constance Marten and her partner Mark Gordon have been found guilty of killing their newborn baby. Marten, 38, who is from a wealthy family, and Gordon, 51, went on the run with their daughter Victoria to get away from social services after their four other children were taken into care. The baby's body was found with rubbish inside a Lidl shopping bag, in the corner of a disused shed, in an allotment in Brighton on 1 March 2023 - two days after the couple were arrested following a 54-day nationwide police hunt. The couple were convicted of manslaughter by gross negligence on Monday at the Old Bailey. They gave no response and refused to stand up as the verdict was read out. Gordon leaned his head back with his eyes closed while Marten looked resigned. Prosecutors had said Victoria's death was \"inevitable\" when Marten and Gordon began camping on the South Downs in January 2023 in a \"flimsy\" tent. The couple said it was a tragic accident and denied wrongdoing, but last year were found guilty of perverting the course of justice, concealing the birth of a child, and child cruelty after an Old Bailey trial lasting almost five months. The jury - initially told the case would last six weeks - was discharged after failing to reach a verdict on other outstanding counts, having sent a total of almost 200 notes or questions to the judge. Twists and turns in court  Marten and Gordon have now been found guilty of manslaughter following a retrial in front of a second jury at the same court. Both trials were hampered by disruption and delays, taking up more than 33 weeks of court time, which at an estimated £30,000 per defendant a day could have cost in the region of £10m. Judge Mark Lucraft KC suggested Marten may have made a \"deliberate attempt\" to \"scupper\" the retrial when she dramatically revealed Gordon's \"violent rape conviction\" in the US after he attacked a woman when he was a teenager. Gordon's barrister said the evidence was so prejudicial that the jury should be discharged only for his client to change his mind when he realised he would have to stand trial without his partner next year. Marten then said she wanted to \"sack\" her KC, the 15th lawyer she had parted company with, but was still represented by a junior barrister, while Gordon's lawyers withdrew and he represented himself. He asked for a copy of the 3,500-page legal textbook Archbold, which covers the entirety of the criminal law in England and Wales, and at one point, the judge said: \"Do you want me to adjourn for three years while you do a law degree?\" In an extraordinary courtroom cross-examination, Gordon was allowed to question his partner, who took the opportunity to attack her family, who have links to the Royal Family and who she said saw her as \"an embarrassment\".  'Such obvious risks' After the verdict, the Crown Prosecution Service's London Senior Crown Prosecutor Samantha Yelland said it was \"shocking\" that Marten and Gordon \"could subject their newborn baby to such obvious risks\". \"Their reckless actions were driven by a selfish desire to keep their baby no matter the cost - resulting in her tragic death,\" she added. \"These defendants did everything they could to evade the authorities - from avoiding the use of their bank cards to the point that they were starving, ditching their phones to avoid being traced and travelling hundreds of miles daily from place to place to dodge the police.\" Metropolitan Police Detective Chief Inspector Joanna Yorke, who led the homicide investigation into Victoria's death, also said that Marten and Gordon's \"selfish actions\" resulted in \"the death of an innocent newborn baby who would have recently had her second birthday and should have had the rest of her life ahead of her\". She added: \"We know today's verdict won't bring Victoria back, but I am pleased our investigation has resulted in the couple who caused her death finally being brought to justice.\" Read more:Why did Constance Marten and Mark Gordon go on the run?  'Stolen by the state'  Marten met Gordon around a decade ago and the pair married in an unofficial ceremony in Peru, where she later became pregnant with their first child. She said her family didn't approve of the relationship and her parents hired private investigators to track them. \"Some people who are privileged think they are above the rules,\" she said. \"It is harrowing, you are up against these people who will stop at nothing, who have endless resources and connections.\" A search for Marten and Gordon was launched after a placenta was found in the couple's burnt-out car on a motorway in Bolton in January 2023. Marten said they went on the run so their fifth child would not be removed from them after her other children were \"stolen by the state\". The couple spent vast sums of cash from her family trust fund on taxi journeys as they travelled from Bolton, to Liverpool, to Harwich in Essex, to London and then to Newhaven on the south coast.  Prosecutors said the baby was inadequately clothed in a babygrow and that Marten had got wet as she carried the infant underneath her coat, alleging Victoria died from hypothermia or was smothered while co-sleeping. The court heard how Marten had been warned against living in a tent with a baby and falling asleep with a child on her chest after she first gave birth in 2017. Marten said that she was living in fear and that her \"number one priority\" was to protect Victoria. But her evidence came to an abrupt end when she refused to answer any more questions after prosecutor Joel Smith KC asked her if leaving her daughter's body in a bag of rubbish was a \"despicable thing\" to do. 'Treated like monsters' Gordon, who did not give evidence in the first trial and adopted the same tactic in the second before changing his mind, blamed the police manhunt for setting off a series of \"calamitous\" events which ended in Victoria's death. He wept in the witness box as he claimed the couple had been treated like \"monsters\" and dragged through mud like \"scum\" over what happened. But he also pulled the plug before prosecutors could question his story, declaring: \"All right, that's it.\" In his closing speech, Gordon, wearing a pale orange head covering, told the jury that the prosecution's case was \"like a script from a movie\" and the conditions posed no threat to Victoria because they were \"experienced campers\". He said the tent was sheltered, they wore layered clothing and even mentioned his \"wife's excessive body fat\".  'Complete madness'  During the retrial, Marten, who trained as a journalist, appeared on the front cover of a magazine written \"by and for women in the justice system\", having written a three-page article under her own picture byline. In the piece, accompanied by a podcast in which her words were read by an actor, she complained about the \"disgusting and inadequate\" court food, the \"stone cold cells in the basement\" and 17 to 19-hour days \"when I decide to attend\". \"My life depends on the outcome of this trial,\" she wrote. \"How can I attend a highly emotionally charged case with my liberty on the line and remain alert and attentive for three months? With very little rest and no access to my legal team while my trial is ongoing, it's just complete madness.\""
    },
    {
        "title": "MasterChef presenter John Torode says allegation he used racist language upheld in report",
        "description": "MasterChef presenter John Torode says an allegation he used \"racial language\" was upheld in a report as part of a review into the behaviour of his former co-presenter Gregg Wallace.",
        "url": "https://news.sky.com/story/masterchef-presenter-john-torode-says-allegation-he-used-racial-language-upheld-in-report-13396761",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-john-torode-london_6964986.jpg?20250714215029",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-14 20:28:00",
        "Headline": "Torode says he has \"absolutely no recollection of any of this\" and \"racial language is wholly unacceptable in any environment\".",
        "Content": "MasterChef presenter John Torode says an allegation he used \"racial language\" was upheld in a report as part of a review into the behaviour of his former co-presenter Gregg Wallace. The report, led by law firm Lewis Silkin, found 45 of 83 allegations against Wallace were substantiated. There were also two standalone allegations made against other people, including one for using racist language. In a statement posted on his Instagram page, Torode said he was one of those people, but added that he had \"no recollection of the incident\" and said he \"did not believe that it happened\". He commented: \"Following publication of the executive summary of the investigation into Gregg Wallace while working on MasterChef, I am aware of speculation that I am one of the two other individuals against whom an allegation has been upheld. \"For the sake of transparency, I confirm that I am the individual who is alleged to have used racial language on one occasion. \"The allegation is that I did so sometime in 2018 or 2019, in a social situation, and that the person I was speaking with did not believe that it was intended in a malicious way and that I apologised immediately afterwards. \"I have absolutely no recollection of any of this, and I do not believe that it happened. \"However, I want to be clear that I've always had the view that any racial language is wholly unacceptable in any environment. I'm shocked and saddened by the allegation as I would never wish to cause anyone any offence.\" Read more:Driver jailed after cocaine haul discovered following car chaseFour people killed in Essex plane crash Wallace, 60, said he was \"deeply sorry\" for causing any distress, and never set out to \"harm or humiliate\". While the majority of the substantiated claims related to inappropriate sexual language and humour, one related to \"unwanted physical contact\", and three were about being \"in a state of undress\". The report said the number of sustained allegations made Wallace's return to MasterChef \"untenable\".  In a statement on Monday, Wallace said \"some of [his] humour and language missed the mark\", but he said, after nearly 20 years on MasterChef, \"I now see that certain patterns, shaped by traits I've only recently begun to understand, may have been misread\". Wallace, who said a \"late autism diagnosis\" had helped him understand how he is \"perceived\", criticised the BBC, saying the corporation had left him \"exposed to trial by media\". \"This has been brutal,\" he said."
    },
    {
        "title": "BBC breached editorial guidelines over Gaza documentary narrated by son of Hamas official",
        "description": "The BBC has said it breached its editorial guidelines by failing to disclose that the child narrator of a Gaza documentary was the son of a Hamas official.",
        "url": "https://news.sky.com/story/bbc-breached-editorial-guidelines-over-gaza-documentary-narrated-by-son-of-hamas-official-13396486",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bbc-broadcasting-house_6842109.jpg?20250228111317",
        "type": "UK",
        "Author": "Bethany Minelle",
        "Date Published": "2025-07-14 11:00:00",
        "Headline": "Gaza: How To Survive A Warzone featured narration from a boy whose father has worked as Hamas's deputy minister of agriculture.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n The BBC has said it breached its editorial guidelines by failing to disclose that the child narrator of a Gaza documentary was the son of a Hamas official. A report into the controversial programme said three members of the independent production company knew about the role of the boy's father - but no one within the BBC was aware. The review called the failure to bring the information to the BBC's attention a \"significant oversight by the production company\". The independent report - commissioned by the corporation - criticised the BBC team involved in the documentary for not being \"sufficiently proactive\" with initial editorial checks, and for a \"lack of critical oversight of unanswered or partially answered questions\" ahead of broadcast. It described the background on the narrator's father as \"critical information\", which was not shared with the BBC before broadcast. While the report said there was no evidence \"to support the suggestion that the narrator's father or family influenced the content of the programme in any way\", it concluded the use of a child narrator for the programme was \"not appropriate\". Following the release of the report, media watchdog Ofcom said it would be launching its own investigation, under its rule which states that factual programmes must not materially mislead the audience. Gaza: How To Survive A Warzone aired on the BBC in February, but was pulled from iPlayer after it emerged that the child narrator was the son of Ayman Alyazouri, who has worked as Hamas's deputy minister of agriculture. How To Survive A Warzone was made by independent production company Hoyo Films, and features 13-year-old Abdullah al Yazouri, who speaks about life in Gaza during the war between Israel and Hamas. The review was led by Peter Johnston, the BBC's director of editorial complaints and reviews, who reports directly to director general Tim Davie. It found that a fee of £795 was paid for the narrator, paid to his sister. The report found that was not \"outside the range of what might be reasonable in the context\". The report did not name any individuals facing disciplinary action, but a new leadership role has been created in BBC News documentaries and current affairs, which the corporation says will be advertised in the next seven days. 👉 Listen to Sky News Daily on your podcast app 👈 While the BBC said the report found Hoyo Films did not \"intentionally\" mislead the BBC, the corporation said the independent production company \"bears most responsibility for this failure\". The broadcaster added that it also \"bears some responsibility\". It's been a tough day for the corporation, which earlier in the day saw an independent review into \"inappropriate behaviour\" by MasterChef presenter Gregg Wallace uphold more than half of the allegations against him. Arts and entertainment correspondent On the face of it, the behaviour of MasterChef presenter Gregg Wallace and a documentary about Gaza criticised for featuring the son of a Hamas minister seem like two totally separate issues. But it's not just the timing of the reports - with both arriving today - that links them. Both point to failings of management and a lack of due diligence at the BBC. The Silkin report, commissioned by production company Banijay, found more than half of the 83 allegations against Wallace have been substantiated, including one of \"unwanted physical contact\". It found that in terms of the BBC, there was \"no consolidated or central record of issues or concerns which had arisen in relation to Mr Wallace\". While the report on Gaza: How to Survive a War Zone found the BBC had breached one of its own editorial guidelines by not disclosing that the documentary's child narrator was related to a Hamas minister – with director general Tim Davie apologising for \"a significant failing in relation to accuracy\". While Wallace has been sacked from the BBC, no one has lost their job following the Gaza documentary controversy – instead the organisation is hiring a new role to help with the long-form work going forward. But is it enough? Today's reports are the latest updates in a series of scandals for the broadcaster, and with the government looking at overhauling the corporation's current funding model, the future of the BBC has never looked more uncertain. Culture secretary 'pleased' that 'catastrophic' failures acknowledged Flagging \"a significant failing\" in the documentary, Mr Davie said: \"I am sorry for this failing.\" He said action would now be taken to ensure \"proper accountability\" and also \"prevent such errors being repeated\". The BBC Board said: \"Nothing is more important than trust and transparency in our journalism. We welcome the actions the Executive are taking to avoid this failing being repeated in the future.\" Culture Secretary Lisa Nandy said she was \"pleased\" that the BBC has acknowledged \"catastrophic\" failures. She said she had had \"several meetings\" with the corporation, adding: \"I believe that they are acting now at pace to put in place measures to make sure that this cannot happen again.\" 'Really bad timing' for BBC - Culture committee chair Speaking to the Culture, Media and Sport Committee earlier this year, Mr Davie described the fallout over the documentary as \"damaging\", and said the corporation was \"not told\" about questions asked around Abdullah's father. Committee chair Caroline Dinenage told Sky presenter Mark Austin that Mr Davie and BBC chair Samir Shah would be invited back later this year. Ms Dinenage said there were \"faults on both sides\" when it came to the production of the documentary, before being asked whether the BBC's director general should consider his position. \"I think he's got an unbelievably difficult job,\" the Conservative MP said. \"We very rightly hold the BBC up to an incredible standard of expectation because they're our national broadcaster and they've got such a strong reputation around the world. \"The one thing we want to see from them is we need them to be trustworthy, we need them to be transparent, and we need them to be impartial.\" Ms Dinenage also noted the row comes at a time when the BBC is preparing for its royal charter renewal, calling it \"really bad timing\".  Children 'deserve to have their voices heard,' Hoyo Films says Hoyo Films said it takes the report findings \"extremely seriously,\" and also apologised. The company said it was \"working closely with the BBC\" to see if it could find a way to bring back parts of the documentary to iPlayer, adding: \"Our team in Gaza risked their lives to document the devastating impact of war on children. \"Gaza: How To Survive A Warzone remains a vital account, and our contributors - who have no say in the conflict - deserve to have their voices heard.\" The BBC says it has no current or future planned commissions with Hoyo Films. Following the release of the report, Israel's UK embassy questioned the finding that there had been \"no breach of impartiality\" in the documentary, and asked whether money paid to the boy could have ended up in the hands of Hamas. Ofcom previously warned that recent controversies could \"start to erode public trust and confidence\". Israel does not allow international news organisations into Gaza to report independently."
    },
    {
        "title": "All four people killed in Southend plane crash thought to be foreign nationals, police say",
        "description": "All four people who died in Sunday's plane crash at Southend Airport are thought to have been foreign nationals, police have said.",
        "url": "https://news.sky.com/story/fireball-at-southend-airport-after-small-plane-crashes-13396214",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-southend-airport_6964101.jpg?20250713171252",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-14 12:00:00",
        "Headline": "Essex Police says the aircraft \"got into difficulty\" shortly after take-off and \"crashed within the airport boundary\".",
        "Content": " All four people who died in Sunday's plane crash at Southend Airport are thought to have been foreign nationals, police have said. The medical transport aircraft had dropped off a patient and was beginning its journey back to the Netherlands when it crashed at about 3.48pm on Sunday. Two Dutch pilots were among those on board, according to a document which lists passengers, the PA news agency understands. On board too was a Chilean nurse, 31-year-old Maria Fernanda Rojas Ortiz, also known as Fena, Sky News understands. No details have been released about the fourth person's nationality, though Essex Police said the deceased were all foreign nationals.  John Johnson, who was at the airport with his wife and children, said he saw a \"big fireball\" exploding across the sky as the plane plunged \"head first into the ground\". \"We all waved at the pilots, and they all waved back at us,\" he said. \"The aircraft then turned 180 degrees to face its take-off, powered up [and] rolled down the runway. \"It took off and about three or four seconds [later] it started to bank heavily to its left, and then within a few seconds of that happening, it more or less inverted and crashed just head first into the ground.\" Mr Johnson added: \"There was a big fireball. Obviously, everybody was in shock [after] witnessing it.\" Chief Superintendent Morgan Cronin said the plane \"got into difficulty\" shortly after taking off and \"crashed within the airport boundary\". He added: \"Sadly, we can now confirm that all four people on board died. \"We are working to officially confirm their identities. At this stage, we believe all four are foreign nationals.\" Ambulances and fire crews were also called in. Southend Airport said it would be \"closed until further notice\" and urged people to contact their airlines. Its staff are \"working closely with the emergency services and air accident investigators\". Zeusch Aviation, based at Lelystad Airport in the Netherlands, confirmed its flight SUZ1 had been \"involved in an accident\" at the airport and its thoughts were with \"everyone who has been affected\". The plane involved is reportedly a Beech B200 Super King Air with twin-propellers. The Air Accidents Investigation Branch said a \"multi-disciplinary team\" arrived at the site on Sunday afternoon. Lisa Fitzsimons, a senior investigator, said it is \"too early to speculate\" on what may have caused the crash.  'Airport in lockdown' Wren Stranix, 16, from Woodbridge in Suffolk, was in another aircraft waiting to take off for Newquay in Cornwall with her family and boyfriend when the plane came down. They watched as the emergency services arrived and were unable to leave their seats. \"The flight attendant didn't know what was going on,\" she told Sky News. \"They said the plane had exploded and they didn't know if it was safe or not. The airport was in lockdown.\" Read more from Sky News:Gregg Wallace 'deeply sorry' after allegations upheldPostman murdered and beheaded girlfriend EasyJet, one of only a few airlines to use the airport, said all its remaining flights to and from Southend had been \"diverted\" or were \"no longer able to operate\". David Burton-Sampson, the MP for Southend West and Leigh, asked people to keep away from the area and \"allow the emergency services to do their work\" in a post on social media. Transport Secretary Heidi Alexander said she was \"monitoring the situation closely and receiving regular updates\". Sir Keir Starmer, the prime minister, said it was \"terrible news that four people [had] tragically lost their lives\" and he thanked the emergency services. Essex Police is asking anyone with information or footage to get in touch. Mr Cronin said: \"In these very early stages it is vital we gather the information we need.\""
    },
    {
        "title": "Measles: Liverpool health official urges public to be aware of symptoms after child dies",
        "description": "A Liverpool City Council official has urged the public to be aware of the symptoms of measles after a child died from the disease.",
        "url": "https://news.sky.com/story/measles-liverpool-health-official-urges-public-to-be-aware-of-symptoms-after-child-dies-13396771",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sherry-andrews-mmr_6908224.jpg?20250506161629",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-14 21:06:00",
        "Headline": "Liverpool City Council's director of public health said \"people assume (measles is) an old disease or it's one that's gone away... it couldn't be further from the case\".",
        "Content": " A Liverpool City Council official has urged the public to be aware of the symptoms of measles after a child died from the disease. Speaking on The UK Tonight with Sarah-Jane Mee, director of public health for Liverpool City Council, Professor Matthew Ashton, said he wanted to raise awareness of the virus. It comes after a child died at the city's Alder Hey Children's Hospital after becoming ill with measles and other health problems. Mr Ashton said that measles was \"circulating\" in the community, with 17 cases recorded at Alder Hey since the start of June - which he said \"is a worry for us\". \"It's a really nasty virus,\" he added. \"No matter who you are, if you're not protected, it can do you harm.\" Earlier on Monday, chairman of the Local Government Association's community wellbeing board, councillor David Fothergill, said there was \"an urgent need to address falling immunisation rates\". \"These gaps have contributed to 529 confirmed measles cases in England so far in 2025,\" he said, \"with 68% occurring in children under the age of 10.\"  Speaking to Sky News, Mr Ashton said: \"Vaccination rates have been declining nationally for the last decade... In Liverpool, we're down below 74%. \"Nationally, it's a bit higher than that, but it's still far too low. And the trouble is then, when you have unexposed populations or unprotected populations, the potential for measles going rogue is very high.\" Mr Ashton said vaccination rates have been declining nationally for the last decade and that the World Health Organisation (WHO) recommends 95% vaccination levels to reach herd immunity.  Read more:Cases double to highest level in nearly three decadesWhat's behind the decline in measles vaccine rates? Mr Ashton noted \"there's lots of reasons why vaccination rates have dropped,\" citing \"fatigue\" from the COVID pandemic and \"disinformation,\" but added: \"I do think it's more complicated than that. \"I think we have to recognise that life for our communities has got significantly harder over the last ten years, and people are working really hard to make sure they can still pay the bills, put food on the table, look after loved ones. \"Sometimes routine health care appointments are just not top of the list of things to do.\" The first symptoms of measles include:\n • A high temperature • A runny or blocked nose • Sneezing\n • A cough • Red, sore or watery eyes Cold-like symptoms are followed a few days later by a rash, which starts on the face and behind the ears, before it spreads. The spots are usually raised and can join together to form blotchy patches which are not usually itchy. Some people may get small spots in their mouth too. What should you do if you think your child has measles?\n Ask for an urgent GP appointment or call 111 if you think your child has measles. If your child has been vaccinated, it is very unlikely they have measles.\n You should not go to the doctor without calling ahead, as measles is very infectious. If your child is diagnosed with measles by a doctor, make sure they avoid close contact with babies and anyone who is pregnant or has a weakened immune system. The public health director said that while \"people assume it's an old disease or it's one that's gone away... it couldn't be further from the case\". He noted that one case of measles can infect up to 15 people, and urged people that if they think they have symptoms, call their GP or 111 - and do not go to A&E."
    },
    {
        "title": "Driver jailed for 12 years after £1m cocaine haul discovered following 120mph car chase on M5 in West Midlands",
        "description": "A man who led police on a 120mph car chase has been given a substantial jail sentence after cocaine worth more than a million pounds was found in the boot of his car.",
        "url": "https://news.sky.com/story/driver-jailed-for-12-years-after-1631m-cocaine-haul-discovered-following-120mph-car-chase-on-m5-in-west-midlands-13396677",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-david-sherratt-cocaine_6964785.jpg?20250714152908",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-14 16:46:00",
        "Headline": "\"Good day at the office, lads,\" David Sherratt told officers when they finally brought him to a stop on the M42 in Worcestershire.",
        "Content": " A man who led police on a 120mph car chase has been given a substantial jail sentence after cocaine worth more than a million pounds was found in the boot of his car. \"Good day at the office, lads,\" David Sherratt told officers when they finally brought him to a stop on the M42 near Alvechurch in Worcestershire. A stinger was used, which punctured two of his tyres, one of which separated from the wheel rim and rolled off. Sherratt, 48, was then pulled from the Peugeot 3008 and pushed to the tarmac, police video showed. Once officers were free to search the car, they found two Sports Direct bags in the boot, each containing 18kg of cocaine, the wholesale value of which was up to £1.3m. Sherratt was seen smashing his phone against the dashboard, police said, but messages were recovered showing he had been involved in the collection of a further 135kg of drugs, worth up to £5m in total. \"He would deliver them to customers around the country, earning up to £200 per kilo delivered - and was expecting to earn £20,000 in just six weeks for his work,\" West Midlands Police (WMP) said. The chase began when officers from the force's Road Crime Team tried to stop the car because it was believed to be linked to narcotics. But Sherratt sped off, reaching 120mph on the M5 before heading on to the M42, pursued by both a police car and helicopter. Sherratt, of no fixed address, was jailed at Birmingham Crown Court for 12 years and nine months after admitting being \"concerned in the supply of cocaine\", possessing the drug with intent to supply, and dangerous driving. He has 12 convictions for 19 offences dating back to 1995, WMP said. He was jailed for six years in 2016 for conspiracy to supply class A drugs, and more than four years in 2020 for further drugs offences, the force added. Detective Chief Inspector Peter Cooke said the cocaine would have \"ultimately been sold on the streets of the UK and caused untold misery\". He added: \"Sherratt's attempt to get away from our officers was dangerous and put other road users at risk, but great work by the Road Crime Team meant the pursuit was brought to a safe conclusion. \"He played a significant role in the distribution of drugs around the country, but will now be spending years behind bars.\""
    },
    {
        "title": "Wes Streeting says doctors' strikes 'a gift to Nigel Farage'",
        "description": "Wes Streeting has stepped up his war of words with junior doctors by telling Labour MPs that strikes would be \"a gift to Nigel Farage\".",
        "url": "https://news.sky.com/story/wes-streeting-says-doctor-strikes-a-gift-to-nigel-farage-13396763",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-wes-streeting-health-secretary_6964994.jpg?20250714221737",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-07-14 20:34:00",
        "Headline": "The health secretary's tough warning to Labour MPs came ahead of a showdown with the British Medical Association (BMA) this week in which he will call on the doctors to call off the strikes.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Wes Streeting has stepped up his war of words with junior doctors by telling Labour MPs that strikes would be \"a gift to Nigel Farage\". In a hard-hitting speech to the Parliamentary Labour Party, the health secretary claimed ministers were \"in the fight for the survival of the NHS\". And he said that if Labour failed in its fight, the Reform UK leader would campaign for the health service to be replaced by an insurance-style system. Mr Streeting's tough warning to Labour MPs came ahead of a showdown with the British Medical Association (BMA) this week in which he will call on the doctors to call off the strikes. The BMA has announced plans for five days of strikes by resident doctors - formerly known as junior doctors - in England, which are due to begin on 25 July. At a meeting in parliament at which he received a warm reception from Labour MPs, Mr Streeting said: \"The BMA's threats are unnecessary, unreasonable, and unfair. \"More than that, these strikes would be a gift to Nigel Farage, just as we are beginning to cut waiting lists and get the NHS moving in the right direction. \n                  Child dies as measles cases surge at Liverpool hospital\n                 \n                  New data shows cancer treatment waiting times have increased in nearly half of NHS areas this year: see how your trust is performing\n                 \n                  'I don't want anyone else to die': Mother's mission after son unable to access emergency medication\n                 \"What better recruitment agent could there be for his right-wing populist attacks on the very existence of a publicly funded, free at the point of need, universal health service? He is praying that we fail on the NHS. \"If Labour fail, he will point to that as proof that the NHS has failed and must now be replaced by an insurance-style system. So we are in the fight for the survival of the NHS, and it is a fight I have no intention of losing.\"  The threatened strikes are in pursuit of a 29% pay rise that the BMA is demanding to replace what it claims is lost pay in recent years. The government has awarded a 5.4% pay increase this year after a 22% rise for the previous two years. Earlier, appearing before the all-party health and social care committee of MPs, Mr Streeting said the strikes would be a \"catastrophic mistake\" and not telling employers about their intention to strike would be \"shockingly irresponsible\". He said BMA leaders seemed to be telling their members \"not to inform their trusts or their employers if they're going out on strike\" and that he could not fathom \"how any doctor in good conscience would make it harder for managers to make sure we have safe staffing levels\". He said: \"Going on strike having received a 28.9% pay increase is not only unreasonable and unnecessary, given the progress that we've been making on pay and other issues, it's also self-defeating.\" Read more:Unite votes to suspend Rayner over Birmingham bin strikeMinister hints at tax rises in next budget  He said he accepted doctors' right to strike, but added: \"The idea that doctors would go on strike without informing their employer, not allowing planning for safe staffing, I think, is unconscionable, and I would urge resident doctors who are taking part in strike actions to do the right thing.\" Mr Streeting warned the strikes would lead to cancellations and delays in patient treatment and spoke of a family member who was waiting for the \"inevitable\" phone call informing them that their procedure would be postponed. \"We can mitigate against the impact of strikes, and we will, but what we cannot do is promise that there will be no consequence and no delay, no further suffering, because there are lots of people whose procedures are scheduled over that weekend period and in the period subsequently, where the NHS has to recover from the industrial action, who will see their operations and appointments delayed,\" he said. \"I have a relative in that position. My family are currently dreading what I fear is an inevitable phone call saying that there is going to be a delay to this procedure. And I just think this is an unconscionable thing to do to the public, not least given the 28.9% pay rise.\""
    },
    {
        "title": "Donald Trump sending 'top of the line' weapons to support NATO in Ukraine war",
        "description": "Donald Trump has agreed to send \"top of the line weapons\" to NATO to support Ukraine - and threatened Russia with \"severe\" tariffs if it doesn't agree to end the war. ",
        "url": "https://news.sky.com/story/trump-announces-weapons-deal-with-nato-to-help-ukraine-as-he-gives-putin-50-day-ultimatum-13396641",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-patriot-missiles_6965041.jpg?20250715024220",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-14 15:30:00",
        "Headline": "If an agreement to end the war with Ukraine is not reached in 50 days, Donald Trump said the US would bring in \"severe tariffs\" of \"about 100%\" on Russia.",
        "Content": " Donald Trump has agreed to send \"top of the line weapons\" to NATO to support Ukraine - and threatened Russia with \"severe\" tariffs if it doesn't agree to end the war.  Speaking with NATO secretary-general Mark Rutte during a meeting at the White House, the US president said: \"We've made a deal today where we are going to be sending them weapons, and they're going to be paying for them. \"This is billions of dollars worth of military equipment which is going to be purchased from the United States, going to NATO, and that's going to be quickly distributed to the battlefield.\" Follow the latest here Weapons being sent include surface-to-air Patriot missile systems and batteries, which Ukraine has asked for to defend itself from Russian air strikes. Mr Trump also said he was \"very unhappy\" with Russia, and threatened \"severe tariffs\" of \"about 100%\" if there isn't a deal to end the war in Ukraine within 50 days. The White House added that the US would put \"secondary sanctions\" on countries that buy oil from Russia if an agreement was not reached. Later on Monday, Ukrainian leader Volodymyr Zelenskyy thanked Mr Trump and said he was \"grateful\" for the US president's \"readiness to help protect our people's lives\". US correspondent As ever, there is confusion and key questions are left unanswered, but Donald Trump's announcement on Ukraine and Russia today remains hugely significant. His shift in tone and policy on Ukraine is stark. And his shift in tone (and perhaps policy) on Russia is huge. Read Mark's analysis here. After criticising Vladimir Putin's \"desire to drag it out\", he said he appreciated \"preparing a new decision on Patriots for Ukraine\" - and added Kyiv is \"working on major defence agreements with America\". It comes after weeks of frustration from Mr Trump over Mr Putin's refusal to agree to an end to the conflict, with the Russian leader telling the US president he would \"not back down\" from Moscow's goals in Ukraine at the start of the month.  During the briefing on Monday, Mr Trump said he had held calls with Mr Putin where he would think \"that was a nice phone call\", but then \"missiles are launched into Kyiv or some other city, and that happens three or four times\". \"I don't want to say he's an assassin, but he's a tough guy,\" he added. Earlier this year, Mr Trump told Mr Zelenskyy \"you're gambling with World War Three\" in a fiery White House meeting, and suggested Ukraine started the war against Russia as he sought to negotiate an end to the conflict. After Mr Trump's briefing, Russian senator Konstantin Kosachev said on Telegram: \"If this is all that Trump had in mind to say about Ukraine today, then all the steam has gone out.\" Read more:Trump announces 30% tariff on EU imports Trump threatens to revoke US comedian's citizenshipTwo women killed after shooting at US church Meanwhile, Mr Zelenskyy met with US special envoy Keith Kellogg in Kyiv, where they \"discussed the path to peace\" by \"strengthening Ukraine's air defence, joint production, and procurement of defence weapons in collaboration with Europe\". He thanked both the envoy for the visit and Mr Trump \"for the important signals of support and the positive decisions for both our countries\"."
    },
    {
        "title": "At least 30 dead and 100 injured as armed groups clash in Syria, officials say",
        "description": "At least 30 people have been killed in the Syrian city of Sweida in clashes between local military groups and tribes, according to Syria's interior ministry.",
        "url": "https://news.sky.com/story/at-least-30-dead-100-injured-in-clashes-between-armed-groups-in-southern-city-of-sweida-say-syrian-officials-13396334",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-druze-syria_6964306.jpg?20250714051819",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-14 03:27:00",
        "Headline": "Fighting in the city of Sweida between local military groups and tribes represents the latest escalation of sectarian violence in the region.",
        "Content": "At least 30 people have been killed in the Syrian city of Sweida in clashes between local military groups and tribes, according to Syria's interior ministry. Officials say initial figures suggest around 100 people have also been injured in the city, where the Druze faith is one of the major religious groups. The interior ministry said its forces will directly intervene to resolve the conflict, which the Reuters news agency said involved fighting between Druze gunmen and Bedouin Sunni tribes. It marks the latest episode of sectarian violence in Syria, where fears among minority groups have increased since Islamist-led rebels toppled President Bashar al Assad in December, installing their own government and security forces.  The violence reportedly erupted after a wave of kidnappings, including the abduction of a Druze merchant on Friday on the highway linking Damascus to Sweida. Last April, Sunni militia clashed with armed Druze residents of Jaramana, southeast of Damascus, and fighting later spread to another district near the capital. But this is the first time the fighting has been reported inside the city of Sweida itself, the provincial capital of the mostly Druze province. The Syrian Observatory for Human Rights (SOHR) reports the fighting was centred in the Maqwas neighbourhood east of Sweida and villages on the western and northern outskirts of the city. It adds that Syria's Ministry of Defence has deployed military convoys to the area. Western nations, including the US and UK, have been increasingly moving towards normalising relations with Syria.  Read more from Sky News:UK restores diplomatic ties with SyriaChurch in Syria targeted by suicide bomber Concerns among minority groups have intensified following the killing of hundreds of Alawites in March, in apparent retaliation for an earlier attack carried out by Assad loyalists. That was the deadliest sectarian flare-up in years in Syria, where a 14-year civil war ended with Assad fleeing to Russia after his government was overthrown by rebel forces. The city of Sweida is in southern Syria, about 24 miles (38km) north of the border with Jordan."
    },
    {
        "title": "Trump is clearly fed up with Putin - but will his shift in tone force Russia to the negotiating table?",
        "description": "As ever, there is confusion and key questions are left unanswered, but Donald Trump's announcement on Ukraine and Russia today remains hugely significant.",
        "url": "https://news.sky.com/story/trump-is-clearly-fed-up-with-putin-but-will-his-shift-in-tone-force-russia-to-the-negotiating-table-13396744",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-putin-trump_6921632.jpg?20250519175843",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-07-14 19:09:00",
        "Headline": "While the US president's shift in tone on both Ukraine and Russia is huge, we need to remember that he can let deadlines slip and flip-flop repeatedly, writes Sky's Mark Stone.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  As ever, there is confusion and key questions are left unanswered, but Donald Trump's announcement on Ukraine and Russia today remains hugely significant. His shift in tone and policy on Ukraine is stark. And his shift in tone (and perhaps policy) on Russia is huge. Ever since Mr Trump returned to the White House he has flatly refused to side with Ukraine over the Russian invasion. He has variously blamed Ukraine for the invasion and blamed Joe Biden for the invasion, but has never been willing to accept that Russia is the aggressor and that Ukraine has a legitimate right to defend itself. Today, all that changed. In a clear signal that he is fed up with Vladimir Putin and now fully recognises the need to help Ukraine defend itself, he announced the US will dramatically increase weapons supplies to Kyiv. But, in keeping with his transactional nature and in a reflection of the need to keep his isolationist \"America-First\" base on side, he has framed this policy shift as a multi-billion dollar \"deal\" in which America gains financially. American weapons are to be \"sold\" to NATO partners in Europe who will then either transfer them to Ukraine or use them to bolster their own stockpiles as they transfer their own existing stocks to Kyiv. \"We've made a deal today,\" the president said in the Oval Office. \"We are going to be sending them weapons, and they are paying for them. We are manufacturing, they are going to be paying for it. Our meeting last month was very successful... these are wealthy nations.\"  This appears to be a clever framing of the \"deal\". Firstly, America has always benefited financially by supplying weapons to Ukraine because much of the investment has been in American factories, American jobs and American supply chains. While the details are not entirely clear, the difference now appears to be that the weapons would be bought by the Europeans or by NATO as an alliance. The Americans are the biggest contributor to NATO, and so if the alliance is buying the weapons, America too will be paying, in part, for the weapons it is selling. However, if the weapons are being bought by individual NATO members to replenish their own stocks, then it may be the case that the US is not paying. NATO officials referred all questions on this issue to the White House, which has not yet provided clarity to Sky News. It is also not yet clear what type of weapons will be made available and whether it will include offensive, as well defensive, munitions.  A key element of the package will likely be Patriot missile batteries, 10 to 15 of which are believed to be currently in Europe. Under this deal, it is understood that some of them will be added to the six or so batteries believed to be presently in Ukraine. New ones would then be purchased from US manufacturers to backfill European stocks. A similar arrangement may be used for other weapons. The president also issued the Russian leader with an ultimatum, saying that Putin had 50 days to make a peace deal or else face 100% \"secondary tariffs\". It's thought this refers to a plan to tariff, or sanction, third countries that supply Russia with weapons and buy Russian oil. This, the Americans hope, will force those countries to apply pressure on Russia. But the 50-day kicking of the can down the road also gives Russia space to prevaricate. So, a few words of caution: first, the Russians are masters of prevarication. Second, Trump tends to let deadlines slip. And third, we all know Trump can flip-flop on his position repeatedly. Read more:BBC breached editorial guidelines over Gaza documentaryAir India plane suffered 'no mechanical fault' before crash  Maybe the most revealing aspect of all this came when a reporter asked Mr Trump: \"How far are you willing to go if Putin sends more bombs in the coming days?\" \"Don't ask me questions like that...\" Mr Trump doesn't really know what to do if Mr Putin continues to take him for a ride. Mr Biden, before him, supplied Ukraine with the weapons to continue fighting. If Mr Trump wants to end this, he may need to provide Ukraine with enough weapons to win. But that would prolong, or even escalate, a war he wants to end now. There's the predicament."
    },
    {
        "title": "Air India plane suffered 'no mechanical fault' before crash, chief executive says in memo",
        "description": "A preliminary report into last month's fatal Air India crash found there was no mechanical or maintenance faults on board the plane, the airline's chief executive has said in a memo to staff.",
        "url": "https://news.sky.com/story/air-india-crash-suffered-no-mechanical-fault-chief-executive-says-in-memo-13396538",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-india-plane-crash-ahmedabad_6943507.jpg?20250714140443",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-14 12:10:00",
        "Headline": "Airline CEO Campbell Wilson said in an internal memo that the investigation into the crash, which saw 241 passengers and 19 others on the ground killed when the Boeing aircraft plummeted shortly after take off on 12 June, was far from over.",
        "Content": " A preliminary report into last month's fatal Air India crash found there was no mechanical or maintenance faults on board the plane, the airline's chief executive has said in a memo to staff. Chief executive Campbell Wilson said in the note, seen by the news agency Reuters, that the report had also found that all required maintenance on the aircraft had been carried out. He said the investigation into the crash, which saw all but one of the 242 passengers on board and 19 others on the ground killed when the Boeing aircraft plummeted shortly after take-off on 12 June, was far from over. The plane was on its way to London when it crashed during take-off from India's Ahmedabad Airport. Mr Wilson said it was unwise to jump to any premature conclusions, after the preliminary report found fuel to the engines of the plane appeared to have cut off shortly after take-off. According to the report by India's Aircraft Accident Investigation Bureau (AAIB), switches in the Boeing 787 Dreamliner's cockpit that controlled fuel moved to a \"CUTOFF\" position. There was then confusion in the cockpit. In the voice recording, one of the pilots is heard asking the other why he \"cut off\". The other pilot responds that he did not do so.  Mr Wilson's memo said: \"The release of the preliminary report marked the point at which we, along with the world, began receiving additional details about what took place. \"Unsurprisingly, it provided both greater clarity and opened additional questions.\" Read more:Everything you need to know about Air India Flight 171 It added: \"The preliminary report identified no cause nor made any recommendations, so I urge everyone to avoid drawing premature conclusions as the investigation is far from over.\" ALPA India, which represents Indian pilots at the Montreal-based International Federation of Air Line Pilots' Associations, rejected the presumption of pilot error in the Ahmedabad crash and called for a \"fair, fact-based inquiry\". \"The pilots' body must now be made part of the probe, at least as observers,\" ALPA India president Sam Thomas told Reuters on Sunday. Both pilots were experienced, with around 19,000 flying hours between them, including more than 9,000 on the 787. The preliminary report, released on Saturday, suggested no immediate action for Boeing or GE, whose engines were fitted to the aircraft. It comes as the US Federal Aviation Administration and Boeing have privately issued notifications that the fuel switch locks on Boeing planes are safe, a document seen by Reuters showed, and four sources with knowledge of the matter said. On Monday, India ordered its airlines to examine fuel switches on several Boeing models, while South Korea said it would order a similar measure."
    },
    {
        "title": "Donald Trump sending 'top of the line' weapons to support NATO in Ukraine war",
        "description": "Donald Trump has agreed to send \"top of the line weapons\" to NATO to support Ukraine - and threatened Russia with \"severe\" tariffs if it doesn't agree to end the war. ",
        "url": "https://news.sky.com/story/trump-announces-weapons-deal-with-nato-to-help-ukraine-as-he-gives-putin-50-day-ultimatum-13396641",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-patriot-missiles_6965041.jpg?20250715024220",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-14 15:30:00",
        "Headline": "If an agreement to end the war with Ukraine is not reached in 50 days, Donald Trump said the US would bring in \"severe tariffs\" of \"about 100%\" on Russia.",
        "Content": " Donald Trump has agreed to send \"top of the line weapons\" to NATO to support Ukraine - and threatened Russia with \"severe\" tariffs if it doesn't agree to end the war.  Speaking with NATO secretary-general Mark Rutte during a meeting at the White House, the US president said: \"We've made a deal today where we are going to be sending them weapons, and they're going to be paying for them. \"This is billions of dollars worth of military equipment which is going to be purchased from the United States, going to NATO, and that's going to be quickly distributed to the battlefield.\" Follow the latest here Weapons being sent include surface-to-air Patriot missile systems and batteries, which Ukraine has asked for to defend itself from Russian air strikes. Mr Trump also said he was \"very unhappy\" with Russia, and threatened \"severe tariffs\" of \"about 100%\" if there isn't a deal to end the war in Ukraine within 50 days. The White House added that the US would put \"secondary sanctions\" on countries that buy oil from Russia if an agreement was not reached. Later on Monday, Ukrainian leader Volodymyr Zelenskyy thanked Mr Trump and said he was \"grateful\" for the US president's \"readiness to help protect our people's lives\". US correspondent As ever, there is confusion and key questions are left unanswered, but Donald Trump's announcement on Ukraine and Russia today remains hugely significant. His shift in tone and policy on Ukraine is stark. And his shift in tone (and perhaps policy) on Russia is huge. Read Mark's analysis here. After criticising Vladimir Putin's \"desire to drag it out\", he said he appreciated \"preparing a new decision on Patriots for Ukraine\" - and added Kyiv is \"working on major defence agreements with America\". It comes after weeks of frustration from Mr Trump over Mr Putin's refusal to agree to an end to the conflict, with the Russian leader telling the US president he would \"not back down\" from Moscow's goals in Ukraine at the start of the month.  During the briefing on Monday, Mr Trump said he had held calls with Mr Putin where he would think \"that was a nice phone call\", but then \"missiles are launched into Kyiv or some other city, and that happens three or four times\". \"I don't want to say he's an assassin, but he's a tough guy,\" he added. Earlier this year, Mr Trump told Mr Zelenskyy \"you're gambling with World War Three\" in a fiery White House meeting, and suggested Ukraine started the war against Russia as he sought to negotiate an end to the conflict. After Mr Trump's briefing, Russian senator Konstantin Kosachev said on Telegram: \"If this is all that Trump had in mind to say about Ukraine today, then all the steam has gone out.\" Read more:Trump announces 30% tariff on EU imports Trump threatens to revoke US comedian's citizenshipTwo women killed after shooting at US church Meanwhile, Mr Zelenskyy met with US special envoy Keith Kellogg in Kyiv, where they \"discussed the path to peace\" by \"strengthening Ukraine's air defence, joint production, and procurement of defence weapons in collaboration with Europe\". He thanked both the envoy for the visit and Mr Trump \"for the important signals of support and the positive decisions for both our countries\"."
    },
    {
        "title": "Trump is clearly fed up with Putin - but will his shift in tone force Russia to the negotiating table?",
        "description": "As ever, there is confusion and key questions are left unanswered, but Donald Trump's announcement on Ukraine and Russia today remains hugely significant.",
        "url": "https://news.sky.com/story/trump-is-clearly-fed-up-with-putin-but-will-his-shift-in-tone-force-russia-to-the-negotiating-table-13396744",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-putin-trump_6921632.jpg?20250519175843",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-07-14 19:09:00",
        "Headline": "While the US president's shift in tone on both Ukraine and Russia is huge, we need to remember that he can let deadlines slip and flip-flop repeatedly, writes Sky's Mark Stone.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  As ever, there is confusion and key questions are left unanswered, but Donald Trump's announcement on Ukraine and Russia today remains hugely significant. His shift in tone and policy on Ukraine is stark. And his shift in tone (and perhaps policy) on Russia is huge. Ever since Mr Trump returned to the White House he has flatly refused to side with Ukraine over the Russian invasion. He has variously blamed Ukraine for the invasion and blamed Joe Biden for the invasion, but has never been willing to accept that Russia is the aggressor and that Ukraine has a legitimate right to defend itself. Today, all that changed. In a clear signal that he is fed up with Vladimir Putin and now fully recognises the need to help Ukraine defend itself, he announced the US will dramatically increase weapons supplies to Kyiv. But, in keeping with his transactional nature and in a reflection of the need to keep his isolationist \"America-First\" base on side, he has framed this policy shift as a multi-billion dollar \"deal\" in which America gains financially. American weapons are to be \"sold\" to NATO partners in Europe who will then either transfer them to Ukraine or use them to bolster their own stockpiles as they transfer their own existing stocks to Kyiv. \"We've made a deal today,\" the president said in the Oval Office. \"We are going to be sending them weapons, and they are paying for them. We are manufacturing, they are going to be paying for it. Our meeting last month was very successful... these are wealthy nations.\"  This appears to be a clever framing of the \"deal\". Firstly, America has always benefited financially by supplying weapons to Ukraine because much of the investment has been in American factories, American jobs and American supply chains. While the details are not entirely clear, the difference now appears to be that the weapons would be bought by the Europeans or by NATO as an alliance. The Americans are the biggest contributor to NATO, and so if the alliance is buying the weapons, America too will be paying, in part, for the weapons it is selling. However, if the weapons are being bought by individual NATO members to replenish their own stocks, then it may be the case that the US is not paying. NATO officials referred all questions on this issue to the White House, which has not yet provided clarity to Sky News. It is also not yet clear what type of weapons will be made available and whether it will include offensive, as well defensive, munitions.  A key element of the package will likely be Patriot missile batteries, 10 to 15 of which are believed to be currently in Europe. Under this deal, it is understood that some of them will be added to the six or so batteries believed to be presently in Ukraine. New ones would then be purchased from US manufacturers to backfill European stocks. A similar arrangement may be used for other weapons. The president also issued the Russian leader with an ultimatum, saying that Putin had 50 days to make a peace deal or else face 100% \"secondary tariffs\". It's thought this refers to a plan to tariff, or sanction, third countries that supply Russia with weapons and buy Russian oil. This, the Americans hope, will force those countries to apply pressure on Russia. But the 50-day kicking of the can down the road also gives Russia space to prevaricate. So, a few words of caution: first, the Russians are masters of prevarication. Second, Trump tends to let deadlines slip. And third, we all know Trump can flip-flop on his position repeatedly. Read more:BBC breached editorial guidelines over Gaza documentaryAir India plane suffered 'no mechanical fault' before crash  Maybe the most revealing aspect of all this came when a reporter asked Mr Trump: \"How far are you willing to go if Putin sends more bombs in the coming days?\" \"Don't ask me questions like that...\" Mr Trump doesn't really know what to do if Mr Putin continues to take him for a ride. Mr Biden, before him, supplied Ukraine with the weapons to continue fighting. If Mr Trump wants to end this, he may need to provide Ukraine with enough weapons to win. But that would prolong, or even escalate, a war he wants to end now. There's the predicament."
    },
    {
        "title": "'It's a war': Meet the volunteers leading the fight against Trump's immigration raids",
        "description": "It's 5.30am, but the car park outside a laundrette in south central Los Angeles is already bustling.",
        "url": "https://news.sky.com/story/this-is-like-vietnam-but-were-going-to-win-meet-the-volunteers-leading-the-fight-against-trumps-ice-raids-13396325",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-camarillo-california_6964302.jpg?20250714034241",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2025-07-14 01:06:00",
        "Headline": "It's dawn on the streets of LA, and teacher Ron issues a rallying cry: \"This is like Vietnam... in the end we're going to win.\" The volunteers are fighting ICE raids that have seen 2,800 immigrants arrested since the start of June.",
        "Content": "\n          US correspondent\n              @marthakelner\n  It's 5.30am, but the car park outside a laundrette in south central Los Angeles is already bustling. A woman is setting up a stand selling tacos on the pavement and the sun is beginning to rise behind the palm trees. A group of seven women and two men are gathered in a circle, most wearing khaki green T-shirts. The leader, a man named Francisco \"Chavo\" Romero, begins by asking how everyone is feeling. \"Angry,\" a few of them respond. \"Proud of the community for pushing back,\" says another. Ron, a high school history teacher, issues a rallying cry. \"This is like Vietnam,\" he says. \"We're taking losses, but in the end we're going to win. It's a war.\" This is what the resistance against Donald Trump's immigration policy looks like here. In the past month, immigration and customs enforcement agents - known as ICE - have intensified their raids on homes and workplaces across Los Angeles. Since the beginning of June, nearly 2,800 undocumented immigrants have been arrested in the city, according to the Department of Homeland Security. The previous monthly high was just over 850 arrests in May this year. Videos have circulated online of people being tackled to the ground in the car park of DIY shops, in car washes and outside homes. The videos have prompted outrage, protests and a fightback. \"Chavo\" and Ron belong to a group of organised volunteers called Union del Barrio. Every morning, a group of them meet, mostly in areas which have high immigrant populations. The day I meet them, they're in an area of LA which is heavily Latino. Armed with walkie talkies to communicate with each other, megaphones to warn the community and leaflets to raise awareness they set out in cars in different directions. They're looking for cars used by ICE agents to monitor \"targets\". \"That vehicle looks a little suspicious,\" says Ron, pointing out a white SUV with blacked-out windows, \"but there's nobody in it\". An elderly Latino man is standing on a street corner, cutting fruit to sell at his stall. \"He's the exact target that they're looking for,\" Ron says. \"That's what they're doing now. The low-hanging fruit, the easy victim. And so that is proving to be more successful for their quotas.\" In the end, it turns out to be a quiet morning in this part of LA, no brewing immigration operations. But elsewhere in the city, dawn raids are happening. ICE agents are under pressure from the White House to boost their deportation numbers in line with Donald Trump's campaign promise to crack down on illegal immigration.  Maria's husband Javier was one of those arrested in LA. He came to the United States from Mexico when he was 19 and is now 58. The couple have three grown-up children and two grandchildren. But Javier's work permit expired two years ago, according to Maria and so he was living here illegally. She shows me a video taken last month when Javier was at work at a car wash in Pomona, an area of LA. He is being handcuffed and arrested by armed and masked ICE agents, forced into a car. He is now being held at a detention centre two hours away. \"I know they're doing their job,\" she says, \"but it's like, 'you don't have to do it like that.' Getting them and, you know, forcing people and pushing them down on the ground. They're not animals.\"  Maria wipes away tears as she explains the impact of his absence for the past four weeks. \"It's been so hard without him,\" she says. \"You feel alone when you get used to somebody and he's not there any more. We've never been apart for as long as this.\" The family have a lawyer who is appealing for him to remain in the US, but Maria fears Javier will be sent back to Mexico or even a third country. \"I don't know what to say to my grandkids because the oldest one, who is five was very attached to his papas, as he calls him. And he's asking me, 'When is papa coming home?' and I don't know what to say. He's not a criminal.\" The fear in immigrant communities can be measured by the empty restaurant booths and streets that are far quieter than usual. I meet Soledad at the Mexican restaurant she owns in Hollywood. When I arrive, she's watching the local news on the TV as yet another raid unfolds at a nearby farm. She's shaking her head as ICE agents face off with protesters and military helicopters hover overhead. \"I am scared. I am very scared,\" she says. All of her eight employees are undocumented, and four of them are too scared to come into work, she says, in case they get arrested. The process to get papers, she says, is too long and too expensive. Read more from Sky News:Farmer first to die during ICE raidsTrump warns comic over citizenship \"They call me and tell me they are too afraid to come in because immigration is around,\" she says. \"I have to work double shifts to be able to make up for their hours, and yes, I am very desperate, and sometimes I cry... We have no sales, and no money to pay their wages.\" There is just one woman eating fajitas at a booth, where there would usually be a lunchtime rush. People are chilled by the raids. Soledad says she plans to hide her illegal workers if immigration officials arrive. \"I've told them, get inside the fridge, hide behind the stove, climb up where we have a space to store boxes, do not run because they will hunt you down.\" The White House says they're protecting the country from criminals. ICE agents have been shot at while carrying out operations, their work becoming more dangerous by the day. The tension here is ratcheting up. Deportation numbers are rising too. But the order from Donald Trump is to arrest even more people living here illegally."
    },
    {
        "title": "FIFA president Gianni Infantino celebrates Club World Cup - but how much of the globe was watching?",
        "description": "The noise of critics drowned out by brashness and bombast, the Club World Cup final was everything Gianni Infantino could have hoped for.",
        "url": "https://news.sky.com/story/fifa-president-gianni-infantino-celebrates-club-world-cup-but-how-much-of-the-globe-was-watching-13396515",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gianni-infantino-donald-trump_6964643.jpg?20250714130908",
        "type": "US",
        "Author": "Rob Harris",
        "Date Published": "2025-07-14 11:51:00",
        "Headline": "Critics were quick to write off the super-sized revamp of a little-loved tournament - but FIFA is now all about blazing into the club game dominated by domestic leagues and regional competitions.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n The noise of critics drowned out by brashness and bombast, the Club World Cup final was everything Gianni Infantino could have hoped for. Pop star glamour, a glitzy ceremony and so much gold. All in a packed stadium in New Jersey. And a chance for the FIFA president to take centre stage with the most powerful person in the world. Although even Mr Infantino attempted to usher Donald Trump away from the Chelsea trophy lift celebrations - without success.  The confusion from captain Reece James was clear for the world to see. But how much of the world was watching? That comes to the heart of whether the month of football across the US could be considered a success. Critics were quick to write off the super-sized revamp of a little-loved, much smaller tournament - jumping from seven teams annually into a 32-club extravaganza. It's intended to be every four years, but FIFA is now all about being bigger, bolder and blazing into the club game dominated by domestic leagues and regional competitions - particularly Europe's Champions League. But there were tens of thousands of empty seats at some games. In part, that was due to a determination to use vast NFL stadiums. Also, this is a World Cup without national teams - the way the world has largely engaged with World Cups since 1930. And because it's a new concept in a country where soccer ranks low down the sporting pecking order. So, an average of just under 40,000 per match could be considered a success. Consider how Auckland City, who qualified as champions of Oceania, are a tiny club with home attendances of a couple of thousand usually. The broadcast viewer numbers are harder to gauge. Mr Infantino said it was 20 billion, which could only be a cumulative audience. Channel 5 did have more than 1.5 million Brits watching a Chelsea game after sub-licensing rights from DAZN. The streaming service will have recouped some of the $1bn it paid FIFA from domestic channels, but it aired games for free. Funding flowed to Saudi Arabia's sovereign wealth fund. So, while President Trump provided the gravitas and logistical assistance, Crown Prince Mohammed bin Salman ultimately helped to pay for it. And in many ways, money provided the jeopardy with a $1bn prize fund. Chelsea's passage through the tournament was framed around a growing windfall. Upsetting European champions Paris Saint-Germain in the final means they bank £90m - more than usual from matchday revenue in an entire season. But when Manchester City were knocked out in the last 16 by Saudi side Al Hilal, the club's own post-match show reflected on how at least the players would get more of a summer break now. And player welfare has been a concern, exacerbated by some poor quality pitches, high heat and storm delays in games, with Chelsea just completing a 64-match season and with a first pre-season match scheduled in three weeks. On the eve of the Club World Cup final, FIFA claimed to have struck an agreement with the players' union on mandatory 21-day annual holidays. But the official global union was cut out of the talks. That could be because FIFPRO is pursuing a complaint against FIFA with the European Commission over the congested calendar. But for Mr Infantino this is a time to celebrate the end of the first expanded men's Club World Cup. \"We didn't have one single incident,\" he said. But there was one notable incident of racism reported during a match. A complaint by Real Madrid defender Antonio Rudiger led to FIFA opening a disciplinary case against Pachuca captain Gustavo Cabral. And having made combating discrimination a FIFA priority in 2024, the governing body was accused of downplaying - even scrapping - stadium warnings. Read more from Sky News:Thames Water to introduce hosepipe banExtreme weather 'becoming the norm' in UK The NFL had already faced scrutiny over whether anti-racism messaging was removed from the Super Bowl to avoid annoying President Trump. And having had a taste of a FIFA spectacle, expect him to be even more prominent next time. There's 11 months until North America does it all again but even bigger with the main 48-team men's World Cup."
    },
    {
        "title": "Q&A: Should there be an age limit on the presidency?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/qa-should-there-be-an-age-limit-on-the-presidency-13396152",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump100-podcasts_6901216.png?20250430053042",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-14 04:05:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈   Mark Stone and Martha Kelner answer your listener questions. If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk. You can also watch all episodes on our YouTube channel."
    },
    {
        "title": "Bitcoin achieves $120k milestone on Trump policy support",
        "description": "Bitcoin has surged past the $120,000 (&#163;89,000) level for the first time, with its new record value being attributed to progress in cryptocurrency regulation under Donald Trump.",
        "url": "https://news.sky.com/story/bitcoin-achieves-120k-milestone-on-trump-policy-support-13396339",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-bitcoin-cryptocurrency_6844740.jpg?20250303055934",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-14 04:58:00",
        "Headline": "Expectations for a US regulatory framework are helping drive crypto values higher, tracking stock market records as investors hope Donald Trump's latest trade war threats peter out again.",
        "Content": "Bitcoin has surged past the $120,000 (£89,000) level for the first time, with its new record value being attributed to progress in cryptocurrency regulation under Donald Trump. It was trading at $121,207 early on Monday morning - having doubled in value over the past year on the back of support for digital assets from the president during his second term. Bitcoin's token rivals have also seen a boost on the back of Mr Trump's support for the sector. While new products on Wall Street have made it easier to invest, a lack of global regulation has held back ownership and continued to leave the industry at the mercy of high volatility. The US House of Representatives is to debate a series of bills this week to provide an American regulatory framework for a market worth almost $3.8trn, according to figures from CoinMarketCap. Members are set to vote on the Genius Act, which would create federal rules for stablecoins, and two other pieces of legislation. Mr Trump, who has called himself the \"crypto president\", has urged Congress to back the shake-up as part of his efforts for the US to take a lead on digital currencies. \n                  Reform UK to accept crypto donations, Farage says\n                 \n                  Crypto prices rally after Trump names Bitcoin and others for US strategic reserve\n                 \n                  Will Donald Trump be crypto's most powerful supporter?\n                 He himself is involved in several crypto ventures, including World Liberty Financial, a platform that his sons Eric and Don Jr run. Bitcoin's surge of recent weeks has tracked a broader financial market recovery since mid-April that has seen US stock markets hit record levels. The rally, market analysts have said, can be attributed to the so-called TACO (Trump always chickens out) trade that followed his decision to delay the implementation of the \"liberation day\" trade tariffs against trading partners back in early April. He has since warned dozens of countries, including Canada, Japan, South Korea and the European Union, that higher rates will kick in from 1 August unless a deal can be agreed. Stock market and crypto values would be likely to face fresh pressure should he follow through on that threat."
    },
    {
        "title": "Premier League club Brentford to sell stake at £400m valuation",
        "description": "The owner of Brentford Football Club has clinched a deal to sell a minority stake in the Premier League side to new investors at a valuation of roughly &#163;400m.",
        "url": "https://news.sky.com/story/premier-league-club-brentford-to-sell-stake-at-163400m-valuation-13396772",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-brentford-fulham_6964996.jpg?20250714221958",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-14 21:17:00",
        "Headline": "A deal that will see long-standing Bees-owner Matthew Benham offloading a sizeable minority interest could be announced as soon as Tuesday, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of Brentford Football Club has clinched a deal to sell a minority stake in the Premier League side to new investors at a valuation of roughly £400m. Sky News has learnt that an agreement that will involve current owner Matthew Benham offloading a chunk of his holding to Gary Lubner - the wealthy businessman who ran Autoglass-owner Belron - is expected to be announced as early as Tuesday. Matthew Vaughn, the Hollywood film-maker whose credits include Layer Cake and Lock, Stock and Two Smoking Barrels, is also expected to invest in Brentford as part of the deal, The Athletic reported last month. Further details of the transaction were unclear on Monday night, although one insider speculated that it could ultimately see as much as 25% of the club changing hands. If confirmed, it would underline the continuing interest from wealthy investors in top-flight English clubs. FA Cup winners Crystal Palace have seen a minority stake being bought by Woody Johnson, the New York Jets-owner, in the last few weeks, with that deal hastened by the implications of former shareholder John Textor's simultaneous ownership of a stake in French club Lyon. Sky News revealed in February 2024 that Mr Benham had hired bankers at Rothschild to market a stake in Brentford. \n                  City financier Kolade joins ranks of Channel 4 chair contenders\n                 \n                  Money: How to claim back VAT on your holiday buys\n                 \n                  Economists say the cost of living crisis is over - here's why many households disagree\n                 Under Mr Benham's stewardship, it has enjoyed one of the most successful transformations in English football, rising from the lower divisions to the top division in 2021. It has also moved from its long-standing Griffin Park home to a new stadium near Kew Bridge. This summer is proving to be one of transition, with manager Thomas Frank joining Tottenham Hotspur and striker Bryan Mbeumo the subject of persistent interest from Manchester United. Brentford did not respond to a request for comment on Monday night, while a spokesman for Mr Lubner declined to comment."
    },
    {
        "title": "City financier Kolade joins ranks of Channel 4 chair contenders",
        "description": "A leading financier and Conservative Party donor is among the contenders vying to chair Channel 4, the state-owned broadcaster.",
        "url": "https://news.sky.com/story/city-financier-kolade-joins-ranks-of-channel-4-chair-contenders-13396738",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-channel-4-channel-four_6846256.jpg?20250304185310",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-14 18:45:00",
        "Headline": "Wol Kolade, an executive at the private equity firm Livingbridge and substantial donor to Conservative Party coffers, is among those shortlisted to chair the state-owned broadcaster, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A leading financier and Conservative Party donor is among the contenders vying to chair Channel 4, the state-owned broadcaster. Sky News has learnt from Whitehall sources that Wol Kolade has been shortlisted to replace Sir Ian Cheshire at the helm of the company. Mr Kolade, who has donated hundreds of thousands of pounds to Tory coffers, is said by Whitehall insiders to be one of a handful of remaining candidates for the role. A recommendation from Ofcom, the media regulator, to Culture Secretary Lisa Nandy about its recommendation for the Channel 4 chairmanship is understood to be imminent. Mr Kolade, who heads the private equity firm Livingbridge, has held non-executive roles including a seat on the board of NHS Improvement. He declined to comment when contacted by Sky News on Monday. His candidacy pits him against rivals including Justin King, the former J Sainsbury chief executive, who last week stepped down as chairman of Ovo Energy. Debbie Wosskow, an existing Channel 4 non-executive director who has applied for the chair role, is also said by government sources to have made it to the shortlist. Sir Ian stepped down earlier this year after just one term, having presided over a successful attempt to thwart privatisation by the last Tory government. The Channel 4 chairmanship is currently held on an interim basis by Dawn Airey, the media industry executive who has occupied top jobs at companies including ITV, Channel 5, and Yahoo!. The race to lead the state-owned broadcaster's board has acquired additional importance since the resignation of Alex Mahon, its long-serving chief executive. It has since been reported that Alex Burford, another Channel 4 non-executive director and the boss of Warner Records UK, was interested in replacing Ms Mahon. Ms Mahon, who was a vocal opponent of Channel 4's privatisation, is leaving to join Superstruct, a private equity-owned live entertainment company. The appointment of a new chair is expected to take place by the autumn, with the chosen candidate expected to lead the recruitment of Ms Mahon's successor. The Department for Culture, Media and Sport declined to comment on the recruitment process."
    },
    {
        "title": "Post Office transformation effort gets £118m funding boost",
        "description": "Efforts to turn around the crisis-hit Post Office have been given a &#163;118m funding boost as the government continues to consider a new ownership structure.",
        "url": "https://news.sky.com/story/post-office-transformation-effort-gets-163118m-funding-boost-13396429",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-post-office-scandal_6960071.jpg?20250708124943",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-07-14 08:58:00",
        "Headline": "The government says the cash will be used to help maintain vital services and fund investment but a union says the transformation plans amount to a managed decline.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  Efforts to turn around the crisis-hit Post Office have been given a £118m funding boost as the government continues to consider a new ownership structure. Sky News revealed in October last year, as the Horizon IT scandal inquiry neared its conclusion, that a government-commissioned review was to explore the idea of a mutual model. It would effectively see ownership transferred from the government to sub-postmasters, creating a John Lewis Partnership-style structure, if such an option was to be followed through. It's being considered as a way to return public and postmaster trust to the Post Office. The options are to be the subject of a 12-week consultation on the organisation's future. The prospect of a sale of the Post Office has been ruled out and the plans also make clear that any ownership shift can only take place after the business is judged to be \"financially and operationally stable\". The new £118m subsidy package was being made available, the Department for Business and Trade said, to fund the transformation plan and further investment. It added: \"This funding will protect key services, including access to cash deposits and withdrawals as well as key government services, such as passport applications and the DVLA, alongside helping the Post Office deliver cost-saving measures in its Transformation Plan, part of the New Deal for Postmasters.\"  Post Office minister Gareth Thomas said: \"Post Offices continue to be a central part of our high streets and communities across the country. \"However, after 15 years without a proper review, and in the aftermath of the Horizon scandal, it's clear we need a fresh vision for its future. \"This Green Paper marks the start of an honest conversation about what people want and need from their Post Office in the years ahead.\"  But the general secretary of the Communication Workers Union, Dave Ward, accused the department of lacking sincerity. He said: \"Successive governments have failed the Post Office, its workers and customers - and choosing to use government subsidies for planned redundancies, closures and so-called transformation plans that are nothing more than managed decline. \"This Labour government are unashamedly doing exactly the same as the Tories did - managing the politics of the Post Office, prioritising further cost-cutting and offering no vision for its future.\" 👉 Listen to Sky News Daily on your podcast app 👈 The update was provided as sub-postmasters await further conclusions from the Horizon IT inquiry. Read more:Post Office scandal inquiry lays bare a second injustice - analysisWidow of Post Office victim gets compensation letter after death The first volume, published last week, highlighted the impact of false theft and false accounting accusations made against at least 1,000 postmasters. It concluded that 13 people may have taken their own lives after being falsely accused of wrongdoing, based on evidence from the IT system that the Post Office and developers Fujitsu knew could be faulty. At the same time, inquiry chair Sir Wyn Williams recommended further action to improve compensation outcomes amid years of frustration over delays and wrangling over the sums due."
    },
    {
        "title": "Lenders to ailing oil refinery's petrol forecourts arm plot sale",
        "description": "Lenders to the petrol forecourts arm of the ailing group behind the Prax Lindsey oil refinery have drafted in City advisers ahead of the business being put up for sale.",
        "url": "https://news.sky.com/story/lenders-to-ailing-oil-refinery8217s-petrol-forecourts-arm-plot-sale-13396490",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-petrol-fuel-pump_6829309.jpg?20250215121030",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-14 11:17:00",
        "Headline": "A group of lenders owed more than £200m by Prax's fuel retailing operations have drafted in advisers from AlixPartners ahead of an auction of the division, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Lenders to the petrol forecourts arm of the ailing group behind the Prax Lindsey oil refinery have drafted in City advisers ahead of the business being put up for sale. Sky News has learnt that AlixPartners, the professional services firm, has been engaged by a syndicate of funds which are owed more than £200m by Prax Group's retail operations. The unit trades from more than 200 sites across the UK, according to the company's website, with reports at the weekend suggesting that some sites are facing fuel shortages because of supply agreements that they have with the group's refinery in Lincolnshire. The refinery collapsed into compulsory liquidation last month and is now being run by restructuring experts at FTI Consulting on behalf of the Official Receiver. The plant - one of only a handful of oil refineries still operating in the UK - supplies roughly 10% of the UK's fuel. Last week, Sky News revealed that the Official Receiver had set prospective buyers of Prax Lindsey a two-week deadline to buy the site, although many in the industry expect it to be wound down rather than sold. The petrol forecourts arm - which is not itself in administration - is likely to draw interest from industry peers. \n                  Premier League club Brentford to sell stake at £400m valuation\n                 \n                  City financier Kolade joins ranks of Channel 4 chair contenders\n                 \n                  Money: How to claim back VAT on your holiday buys\n                 Ministers have ordered an Insolvency Service probe into the conduct of the husband-and-wife team behind State Oil, parent company of the Prax Group, alleging they were misled about the company's finances in the build-up to its insolvency. The group is reported to owe the UK tax authorities in the region of £250m, with insiders saying that Sanjeev Kumar Soosaipillai and his wife Arani had been in talks about a Time to Pay arrangement with HM Revenue & Customs prior to State Oil's collapse. AlixPartners did not respond to a request for comment."
    },
    {
        "title": "Cost of living, tariffs and household appliance insurance",
        "description": "EU foreign ministers are meeting in Brussels after Donald Trump threatened the bloc with 30% tariffs. ",
        "url": "https://news.sky.com/story/cost-of-living-tariffs-and-household-appliance-insurance-13396532",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-biz-podcast-podcast_6937464.jpg?20250609141833",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-14 12:01:00",
        "Headline": "No subtitle found",
        "Content": "EU foreign ministers are meeting in Brussels after Donald Trump threatened the bloc with 30% tariffs.  Richard Baldwin, a professor of international economics, joins the show to discuss. Presenter Darren McCaffrey speaks to Matthew Crummack, chief executive of Domestic & General, about the company's partnership with manufacturers and retailers to offer repairs on household appliances. And Darren is joined by two experts to discuss Jaguar Land Rover which is exploring ways to update its range of vehicles. :: Listen and subscribe to the Sky News Business Podcast here."
    },
    {
        "title": "'I can lend someone £100k in an hour': The life of a pawnbroker ",
        "description": "If you've ever spent your morning commute daydreaming about starting afresh with your career, this feature is for you. Each week, our Money team speaks to someone from a different profession to discover what it's really like.",
        "url": "https://news.sky.com/story/i-can-lend-someone-163100k-in-an-hour-the-life-of-a-pawnbroker-13396562",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-money-james-constantinou_6964590.jpg?20250714123324",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-14 13:16:00",
        "Headline": "Dreaming of a career change? Here James Constantinou speaks to our Money team about life as a pawnbroker. ",
        "Content": "If you've ever spent your morning commute daydreaming about starting afresh with your career, this feature is for you. Each week, our Money team speaks to someone from a different profession to discover what it's really like. Today, we chat to James Constantinou, owner of pawnbroker chain Prestige Pawn. Read all the latest Money news here  You can't train for it… I was born into wheeling and dealing, buying and selling, so I picked it up from experience. It's something that I love doing, and there's not a course for it. If we're talking about my employees, they are all highly skilled individuals who have trained and become experts in their fields. We have around 60 experts who all excel in a range of specialisms - such as gemologists or art. My skills lie in pulling them together and keeping the work going. Those in their specialised fields will have degrees, diplomas and have studied for years. They can look at the fake Rolexes from today and compare them to the real ones from 10 to 15 years ago - there's almost no comparison. It's really difficult to tell the difference between fake and the real deal in some circumstances. People think my job is lots of TV, helicopters, boats and aeroplanes… But the day-to-day running of the business isn't always like that. There are the normal headaches of staffing rates, leaky air con units and floods - and all other things that go alongside. It's not quite as glamorous as how it's portrayed. It's a misconception to say we charge high and unfair interest rates… The monthly rate starts at 2%, and I don't advise people to take a pawnbroking loan out for a year or two - we only offer up to seven months, and most of our customers redeem in around three. You can't go into the high street and borrow £100,000 within an hour... but in one of my stores, you can, so it's quite rewarding to help people when they need it. When you are approached by someone who needs cash for something urgent and has been to the banks to borrow and denied, and then you're able to step in a way that other lenders aren't able to. \n                  'I'm a criminal lawyer - here's my biggest frustration with the justice system'\n                 \n                  I'm a priest - I don't get paid a salary but I do get a house\n                 \n                  'I get paid to cuddle babies and help hundreds of women give birth - this is my best advice for expectant parents'\n                 There is no typical day… Today I'm at home because we have someone here doing some work, but I'm still on the phone. I've got an E-type Jag appraisal and a cherished number plate, so I'm helping the team. There are guys at Gracechurch Street dealing with some bullion at the moment, so I'm helping with that. Between the team, I'm helping us get deals across the line and closing them. I am interested in items worth £50 to £1m… It's not all about the money. I believe you need more of a passion rather than a skill to do the job well. A normal starting salary in this industry… is around £30,000. The best perk is… getting to see all the amazing assets that come in and drive the fancy cars. I've loved meeting all the fantastic people along the way, too. From where I came from and especially since I left school, I never in a million years thought I would be in this position. Opening the doors to our business in May 2009 was a big moment, and then… Our first customer walked through the door and we jumped out of our seats like \"Oh God, someone's actually noticed us!\" Two of us ran to the counter to serve him, and he said, \"Oh sorry, I thought this was a hairdresser's.\" We had to point him next door. I make mistakes weekly… If you don't make mistakes, then you don't learn. In the past, we've bought watches and pieces of art that have turned out not to be genuine. That was early doors, so those items wouldn't get us today. As a fledgling business, you're going to make mistakes. It was a hard lesson to learn, but a journey we had to go through. We don't touch stolen goods… This is another misconception that maybe occurred in the 1940s or 50s when the industry wasn't as regulated. I'd say a pawnbroker is one of the last places you'd take stolen goods to. I'm not saying it's never happened in 15 years of trading, but when it has, very early on, those items have ended up in the hands of the police. When people come in, they are recorded, we take copies of their passport and driving licences and ask to see proof of purchase. We're also members of associations where, if a luxury item gets stolen, it gets reported. For example, if a Rolex gets stolen, it gets put on the stolen watch register. The first thing we do before purchasing is check all of these databases to make sure the assets aren't stolen. We are only custodians of goods, we rarely own them… Only about 20% of the items stay with us the full seven months and end up going to market. For those sold, we only look to recoup the money owed to us. Any overage we may receive is returned to the client. This surprises a lot of people, even those with contracts worded as such. We don't often turn people down… and leave them walking away with nothing. Most things have a value of sorts. We usually present figures to people, and I'd say that half or maybe 60% of them are accepted. Sometimes it's not the number they want to hear. Most of the time it's about managing some customers' expectations of their item's worth, especially with the reality of being in a time of economic downturn. Luxury goods are not as buoyant as they were four or five years ago. A man came in recently with a one-off hand-built trike that he bought for £100,000, but it was too specialist for us, and the market was very limited. We let him know that it wasn't one for us. People often think they can make money from royal memorabilia... Limited-edition royal memorabilia from 150 years ago can be worth a lot. But a mass-produced King Charles mug hidden in a cupboard for ten years is worthless. But gold is the opposite… It is a brilliant investment and considered bricks and mortar. But in recent years, we've been seeing massive hikes in its prices and worth - a 66% increase in the past three years. Gold makes a great investment for people with spare money who are looking for higher returns. A diamond bulldog keyring is one of my favourite items... One of the first things that came into the store in 2009 caught my eye. It was a bulldog keyring made of 18-carat gold and a diamond-studded collar. The bulldog was stood on his back legs and is now sitting on my keys. I loved the workmanship and thought it was an unusual item, which is why I've still got it on my keyring now. I get many people commenting about it. It's not worth a great deal, but it is sentimental to me. I don't plan on retiring… I don't want to only have the options to sit at home or play golf. I like to get up in the morning and have a purpose. Even if I'm not going into the office, I'm up at 6/6:30am every day. I tend to work 24 hours and sometimes even sleep dreaming about work and deals. I'm constantly connected and always getting messages on WhatsApp throughout the day. Some of the team go home and message me in the evenings and we'll have a conversation at whatever time because they're just as dedicated and passionate as I am. There's not a time I switch off - unless on holiday."
    },
    {
        "title": "Bitcoin achieves $120k milestone on Trump policy support",
        "description": "Bitcoin has surged past the $120,000 (&#163;89,000) level for the first time, with its new record value being attributed to progress in cryptocurrency regulation under Donald Trump.",
        "url": "https://news.sky.com/story/bitcoin-achieves-120k-milestone-on-trump-policy-support-13396339",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-bitcoin-cryptocurrency_6844740.jpg?20250303055934",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-14 04:58:00",
        "Headline": "Expectations for a US regulatory framework are helping drive crypto values higher, tracking stock market records as investors hope Donald Trump's latest trade war threats peter out again.",
        "Content": "Bitcoin has surged past the $120,000 (£89,000) level for the first time, with its new record value being attributed to progress in cryptocurrency regulation under Donald Trump. It was trading at $121,207 early on Monday morning - having doubled in value over the past year on the back of support for digital assets from the president during his second term. Bitcoin's token rivals have also seen a boost on the back of Mr Trump's support for the sector. While new products on Wall Street have made it easier to invest, a lack of global regulation has held back ownership and continued to leave the industry at the mercy of high volatility. The US House of Representatives is to debate a series of bills this week to provide an American regulatory framework for a market worth almost $3.8trn, according to figures from CoinMarketCap. Members are set to vote on the Genius Act, which would create federal rules for stablecoins, and two other pieces of legislation. Mr Trump, who has called himself the \"crypto president\", has urged Congress to back the shake-up as part of his efforts for the US to take a lead on digital currencies. \n                  Reform UK to accept crypto donations, Farage says\n                 \n                  Crypto prices rally after Trump names Bitcoin and others for US strategic reserve\n                 \n                  Will Donald Trump be crypto's most powerful supporter?\n                 He himself is involved in several crypto ventures, including World Liberty Financial, a platform that his sons Eric and Don Jr run. Bitcoin's surge of recent weeks has tracked a broader financial market recovery since mid-April that has seen US stock markets hit record levels. The rally, market analysts have said, can be attributed to the so-called TACO (Trump always chickens out) trade that followed his decision to delay the implementation of the \"liberation day\" trade tariffs against trading partners back in early April. He has since warned dozens of countries, including Canada, Japan, South Korea and the European Union, that higher rates will kick in from 1 August unless a deal can be agreed. Stock market and crypto values would be likely to face fresh pressure should he follow through on that threat."
    },
    {
        "title": "Reform UK is on the march - and the most popular party on TikTok. There's just one problem",
        "description": "Reform UK is on the march.",
        "url": "https://news.sky.com/story/how-farage-and-reform-are-winning-over-women-13390940",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-reform-uk-nigel-farage_6954426.png?20250701123958",
        "type": "Politics",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-07-14 23:01:00",
        "Headline": "Reform have suffered from an image problem that's scuppered plans for getting women to join up. But big changes were made in the run-up to May's local elections, and then the party secured their first female MP in a by-election.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  Reform UK is on the march. Following a barnstorming performance in this year's local elections, they are now the most successful political party on TikTok, engaging younger audiences. But most of their 400,000 followers are men. Politics Hub: Follow live updates from Westminster I was at the local elections launch for Reform in March, looking around for any young women to interview who had come to support the party at its most ambitious rally yet, and I was struggling. A woman wearing a \"let's save Britain\" hat walked by, and I asked her to help me. \"Now you say it, there are more men here,\" she said. But she wasn't worried, adding: \"We'll get the women in.\" And that probably best sums up Reform's strategy. When Nigel Farage threw his hat into the ring to become an MP for Reform, midway through the general election campaign, they weren't really thinking about the diversity of their base. As a result, they attracted a very specific politician. Fewer than 20% of general election candidates for Reform were women, and the five men elected were all white with a median age of 60. Polling shows that best, too. According to YouGov's survey from June 2025, a year on from the election, young women are one of Reform UK's weakest groups, with just 7% supporting Farage's party - half the rate of men in the same age group. The highest support comes from older men, with a considerable amount of over-65s backing Reform - almost 40%. But the party hoped to change all that at the local elections. Time to go pro It was the closing act of Reform's September conference and Farage had his most serious rallying cry: it was time for the party to \"professionalise\". In an interview with me last year, Farage admitted \"no vetting\" had occurred for one of his new MPs, James McMurdock. Only a couple of months after he arrived in parliament, it was revealed he had been jailed after being convicted of assaulting his then girlfriend in 2006 while drunk outside a nightclub. McMurdock told me earlier this year: \"I would like to do my best to do as little harm to everyone else and at the same time accept that I was a bad person for a moment back then. I'm doing my best to manage the fact that something really regrettable did happen.\" He has since suspended himself from the party over allegations about his business affairs. He has denied any wrongdoing.  Later, two women who worked for another of Reform's original MPs, Rupert Lowe, gave \"credible\" evidence of bullying or harassment by him and his team, according to a report from a KC hired by the party. Lowe denies all wrongdoing and says the claims were retaliation after he criticised Farage in an interview with the Daily Mail, describing his then leader's style as \"messianic\". The Crown Prosecution Service later said it would not charge Lowe after an investigation. He now sits as an independent MP.  A breakthrough night But these issues created an image problem and scuppered plans for getting women to join the party. So, in the run-up to the local elections, big changes were made. The first big opportunity presented itself when a by-election was called in Runcorn and Helsby. The party put up Sarah Pochin as a candidate, and she won a nail-biting race by just six votes. Reform effectively doubled their vote share there compared to the general election - jumping to 38% - and brought its first female MP into parliament. And in the Lincolnshire mayoral race - where Andrea Jenkyns was up for the role - they won with 42% of the vote. The council results that night were positive, too, with Reform taking control of 10 local authorities. They brought new recruits into the party - some of whom had never been involved in active politics.  'The same vibes as Trump' Catherine Becker is one of them and says motherhood, family, and community is at the heart of Reform's offering. It's attracted her to what she calls Reform's \"common sense\" policies. As Reform's parliamentary candidate for Hampstead and Highgate in last year's general election, and now a councillor, she also taps into Reform's strategy of hyper-localism - trying to get candidates to talk about local issues of crime, family, and law and order in the community above everything else. Jess Gill was your quintessential Labour voter: \"I'm northern, I'm working class, I'm a woman, based on the current stereotype that would have been the party for me.\" But when Sir Keir Starmer knelt for Black Lives Matter, she said that was the end of her love affair with the party, and she switched. \"Women are fed up of men not being real men,\" she says. \"Starmer is a bit of a wimp, where Nigel Farage is a funny guy - he gives the same vibes as Trump in a way.\" 'Shy Reformers' But most of Reform's recruits seem to have defected from the Conservative Party, according to the data, and this is where the party sees real opportunity. Anna McGovern was one of those defectors after the astonishing defeat of the Tories in the general election. She thinks there may be \"shy Reformers\" - women who support the party but are unwilling to speak about it publicly. \"You don't see many young women like myself who are publicly saying they support Reform,\" she says. \"I think many people fear that if they publicly say they support Reform, what their friends might think about them. I've faced that before, where people have made assumptions of my beliefs because I've said I support Reform or more right-wing policies.\" But representation isn't their entire strategy. Reform have pivoted to speaking about controversial topics - the sort they think the female voters they're keen to attract may be particularly attuned to. \"Reform are speaking up for women on issues such as transgenderism, defining what a woman is,\" McGovern says. And since Reform's original five MPs joined parliament, grooming gangs have been mentioned 159 times in the Commons - compared to the previous 13 years when it was mentioned 88 times, despite the scandal first coming to prominence back in 2011. But the pitfall of that strategy is where it could risk alienating other communities. Pochin, Reform's first and only female MP, used her first question in parliament to the prime minister to ask if he would ban the burka - something that isn't Reform policy, but which she says was \"punchy\" to \"get the attention to start the debate\".  'What politics is all about' Alex Philips was the right-hand woman to Farage during the Brexit years. She's still very close to senior officials in Reform and a party member, and tells me these issues present an opportunity. \"An issue in politics is a political opportunity and what democracy is for is actually putting a voice to a representation, to concerns of the public. That's what politics is all about.\" Read more:Are Reform winning the 'bro vote'?Reform would win most seats at election Luke Tryl is the executive director of the More In Common public opinion and polling firm, and says the shift since the local elections is targeted and effective. Reform's newer converts are much more likely to be female, as the party started to realise you can't win a general election without getting the support of effectively half the electorate. \"When we speak to women, particularly older women in focus groups, there is a sense that women's issues have been neglected by the traditional mainstream parties,\" he says. \"Particularly issues around women's safety, and women's concerns aren't taken as seriously as they should be. \"If Reform could show it takes their concerns seriously, they may well consolidate their support.\" According to his focus groups, the party's vote share among women aged 18 to 26 shot up in May - jumping from 12% to 21% after the local elections. But the gender divide in right-wing parties is still stark, Tryl says, and representation will remain an uphill battle for a party historically dogged by controversy and clashes. A Reform UK spokesman told Sky News: \"Reform is attracting support across all demographics. \"Our support with women has surged since the general election a year ago, in that time we have seen Sarah Pochin and Andrea Jenkyns elected in senior roles for the party.\""
    },
    {
        "title": "Wes Streeting says doctors' strikes 'a gift to Nigel Farage'",
        "description": "Wes Streeting has stepped up his war of words with junior doctors by telling Labour MPs that strikes would be \"a gift to Nigel Farage\".",
        "url": "https://news.sky.com/story/wes-streeting-says-doctor-strikes-a-gift-to-nigel-farage-13396763",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-wes-streeting-health-secretary_6964994.jpg?20250714221737",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-07-14 20:34:00",
        "Headline": "The health secretary's tough warning to Labour MPs came ahead of a showdown with the British Medical Association (BMA) this week in which he will call on the doctors to call off the strikes.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Wes Streeting has stepped up his war of words with junior doctors by telling Labour MPs that strikes would be \"a gift to Nigel Farage\". In a hard-hitting speech to the Parliamentary Labour Party, the health secretary claimed ministers were \"in the fight for the survival of the NHS\". And he said that if Labour failed in its fight, the Reform UK leader would campaign for the health service to be replaced by an insurance-style system. Mr Streeting's tough warning to Labour MPs came ahead of a showdown with the British Medical Association (BMA) this week in which he will call on the doctors to call off the strikes. The BMA has announced plans for five days of strikes by resident doctors - formerly known as junior doctors - in England, which are due to begin on 25 July. At a meeting in parliament at which he received a warm reception from Labour MPs, Mr Streeting said: \"The BMA's threats are unnecessary, unreasonable, and unfair. \"More than that, these strikes would be a gift to Nigel Farage, just as we are beginning to cut waiting lists and get the NHS moving in the right direction. \n                  Child dies as measles cases surge at Liverpool hospital\n                 \n                  New data shows cancer treatment waiting times have increased in nearly half of NHS areas this year: see how your trust is performing\n                 \n                  'I don't want anyone else to die': Mother's mission after son unable to access emergency medication\n                 \"What better recruitment agent could there be for his right-wing populist attacks on the very existence of a publicly funded, free at the point of need, universal health service? He is praying that we fail on the NHS. \"If Labour fail, he will point to that as proof that the NHS has failed and must now be replaced by an insurance-style system. So we are in the fight for the survival of the NHS, and it is a fight I have no intention of losing.\"  The threatened strikes are in pursuit of a 29% pay rise that the BMA is demanding to replace what it claims is lost pay in recent years. The government has awarded a 5.4% pay increase this year after a 22% rise for the previous two years. Earlier, appearing before the all-party health and social care committee of MPs, Mr Streeting said the strikes would be a \"catastrophic mistake\" and not telling employers about their intention to strike would be \"shockingly irresponsible\". He said BMA leaders seemed to be telling their members \"not to inform their trusts or their employers if they're going out on strike\" and that he could not fathom \"how any doctor in good conscience would make it harder for managers to make sure we have safe staffing levels\". He said: \"Going on strike having received a 28.9% pay increase is not only unreasonable and unnecessary, given the progress that we've been making on pay and other issues, it's also self-defeating.\" Read more:Unite votes to suspend Rayner over Birmingham bin strikeMinister hints at tax rises in next budget  He said he accepted doctors' right to strike, but added: \"The idea that doctors would go on strike without informing their employer, not allowing planning for safe staffing, I think, is unconscionable, and I would urge resident doctors who are taking part in strike actions to do the right thing.\" Mr Streeting warned the strikes would lead to cancellations and delays in patient treatment and spoke of a family member who was waiting for the \"inevitable\" phone call informing them that their procedure would be postponed. \"We can mitigate against the impact of strikes, and we will, but what we cannot do is promise that there will be no consequence and no delay, no further suffering, because there are lots of people whose procedures are scheduled over that weekend period and in the period subsequently, where the NHS has to recover from the industrial action, who will see their operations and appointments delayed,\" he said. \"I have a relative in that position. My family are currently dreading what I fear is an inevitable phone call saying that there is going to be a delay to this procedure. And I just think this is an unconscionable thing to do to the public, not least given the 28.9% pay rise.\""
    },
    {
        "title": "Former Tory MP handed community order for harassing ex-wife",
        "description": "A former Tory MP has been handed a community order after admitting harassing her ex-wife.",
        "url": "https://news.sky.com/story/former-tory-mp-handed-community-order-for-harassing-ex-wife-13396550",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-katie-wallis-cardiff_6944387.jpg?20250617145507",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-14 12:46:00",
        "Headline": "Katie Wallis, 41, who was known as Jamie while she was in politics before becoming the UK's first openly transgender MP, sent four messages and one voice note to Rebecca Wallis, now known as Rebeca Lovell, who said that, because of what happened, \"the woman I used to be is destroyed\".",
        "Content": "A former Tory MP has been handed a community order after admitting harassing her ex-wife. Katie Wallis, 41, was known as Jamie before she became the UK's first openly transgender MP in 2022. She represented the seat of Bridgend in South Wales from 2019 to 2022. Wallis was sentenced today for harassing ex-wife Rebecca Wallis, now known as Rebeca Lovell. Cardiff Magistrates' Court heard the ex-MP sent messages to her former partner accusing Ms Lovell of being \"mean\", demanding to know about a new partner, alleging her former wife was \"cock-hunting\" and calling Ms Lovell a c***\" and a \"f****** bitch\". The court also heard that Wallis had demanded £350,000 from Ms Lovell using an unknown phone number In a different message, Wallis referred to her ex-wife and Ms Lovell's father as \"prejudiced f******\" and hoped they \"never have a happy moment again\". In total, the former MP sent four messages and left one voice note. The couple split in 2020 and finalised their divorce in 2024. A victim impact statement from Ms Lovell said: \"This is the hardest thing I have written, for so long I have had to fight against the tide of Jamie's behaviour, publicly and privately.\" She added: \"The woman I used to be is destroyed. I will never understand what I have done to deserve the hurt I have endured.\" Ms Lovell went on to say the past six months had been \"utterly devastating\", adding that she feared Wallis arriving at her home and had consequently installed CCTV. Wallis, wearing a black dress, looked down as the statement was read to the court. Narita Bahra KC, appearing for the defence, said Wallis uses female pronouns, referring to Jamie as her \"deadname\". As of last month, the former MP said her name was still legally Jamie, but she used the name Katie. Read more:Tory MP banned from drivingEx-Tory MP admits harassment Wallis's lawyer criticised the police and prosecutors for not dealing with the matter outside of court - adding that it was \"unequivocal\" her client had been suffering from mental health difficulties during the offending, partly brought on by her transitioning. Ms Bahra said Wallis was suffering from PTSD, a depressive disorder and an adjustment disorder. District Judge Rhys Williams handed Wallis a 12-month community order and a fine worth £1,264. 👉Listen to Politics At Sam And Anne's on your podcast app👈 Wallis admitted leaving the messages at a hearing in June, having previously denied the charges. The former MP asked Ms Lovell for help in the final message, and claimed she was experiencing head pain. Wallis was sectioned under the Mental Health Act after being found by police, and was later arrested and then charged. Her plea changed when allegations of having driven by Ms Lovell's home were removed from the charge. Wallis was previously convicted of driving offences in 2022 after crashing a car into a telegraph pole before fleeing the scene."
    },
    {
        "title": "World's biggest human imaging project reaches new milestone after scanning 100,000th UK volunteer",
        "description": "Steve's morning starts lying still in the clanging magnet of an MRI machine as his body is slowly scanned from neck to knee in intimate detail.",
        "url": "https://news.sky.com/story/worlds-biggest-human-imaging-project-reaches-new-milestone-after-scanning-100000th-uk-volunteer-13396786",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-uk-biobank-samples_6965031.png?20250715010458",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-07-14 22:35:00",
        "Headline": "The UK Biobank has now scanned 100,000 people, taking recordings of hearts, brains, blood vessels and bones. As the world's most comprehensive human imaging project, it's providing insights into everything from Alzheimer's, heart disease and cancer.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Steve's morning starts lying still in the clanging magnet of an MRI machine as his body is slowly scanned from neck to knee in intimate detail. Then it's on to another MRI scanner, followed by X-rays of his bones, ultrasound on his neck, blood and other samples, medical tests and questionnaires - in all five hours of his time. A test of patience you'd admire in any patient - only Steve is perfectly healthy. He's a volunteer in the UK Biobank project, giving up his time to help complete the world's largest medical imaging dataset. His motivation: that his data may help where he can't. \"My mum in particular at the moment now, is suffering from early stages of dementia, close friends have had cancer.\" \"Giving up my time now... is going to help medical research in the future.\" \n                  Measles: Liverpool health official urges public to be aware of symptoms after child dies\n                 \n                  Child dies as measles cases surge at Liverpool hospital\n                 \n                  'My voice box was removed after NHS missed my throat cancer'\n                 Even more remarkable is that Steve is the 100,000th volunteer to have willingly gone through the process. Each one allows their carefully anonymised images (it's why we're only using Steve's first name) as well as their biological samples, medical and lifestyle histories, available to the world's medical researchers in perpetuity. \"The unprecedented scale of this imaging project - more than 10 times bigger than anything that existed before - makes it possible for scientists to see patterns of disease that just couldn't otherwise be seen,\" said Professor Sir Rory Collins, chief executive of UK Biobank. \"Combining these images from different parts of the body with all the genetic and lifestyle information from our volunteers, scientists are getting a far better understanding of how our bodies work,\" he said. Given the time and complexity of whole-body imaging, it's a project many scientists believed would never work. \"When we started, some people thought that we got our numbers wrong,\" said Prof Naomi Allen, chief scientist at UK Biobank. \"Surely we wanted to scan at 10,000 participants... not 100,000. And yet, here we are.\" The UK Biobank was already a powerful resource for medical research. Since 2003, it has recruited half a million people in Britain between the ages of 40 and 69 with the aim of following each of them as they age. It's long been the world's most comprehensive biomedical data resource used in more than 60 countries by at least 20,000 researchers, providing new insights into everything from Alzheimer's and heart disease to long COVID and cancer. Adding imaging data from a fifth of those participants should make it even more useful. \"Many of the common diseases of middle of late life, heart disease, dementia, cancer, Parkinson's disease, they can take many years to develop before you have symptoms,\" said Prof Allen. \"What these scans will be able to do is to identify those warning flags, the early starts of the disease process, very early on.\" Seeing those changes early in scans and being able to relate them to the underlying biology and lifestyle histories of such a large number of people, could point to new treatments, or new targets for existing treatments, that could prolong healthy lives. In the decade since the imaging part of the study began, researchers have already published 1,300 studies based on the new data. NHS memory clinics are using techniques developed in the study to better diagnose dementia from MRI images. An AI tool, developed using Biobank images of the heart, is being used in over 90 countries to analyse heart scans in less than a second that previously took 15 minutes to process. And it is advances in AI that are expected to make even more of the overwhelming 30 petabytes of data contained within the Biobank database and imaging programme. Read more from Sky News:Sleep problems linked to dementiaAI can detect over 1,000 diseasesWhite wine could cut heart risk \"When we were doing manual analysis of this data, it would take me about a day just to measure how much fat somebody had,\" said Louise Thomas, a professor of metabolic imaging at the University of Westminster. \"We predicted [Biobank data] would take us thousands of years of manual analysis. Now, we use a small amount of manual analysis to train the AI models in how to do it and we can analyse everything in seconds. It's quite extraordinary.\" AI analysis isn't perfect, but it has already helped guided Thomas's team to identify the types of patient at increased risk of heart aneurysm, the relationship between fat stored in muscle, age-related muscle loss and risk of falls, and revealing that up to a quarter of the UK population have unhealthy levels of fat in their liver - a key driver of liver disease that is a costly burden on the NHS. As the scale and value of datasets like UK Biobank grow, so too will questions about how the not-for-profit, open-access project protects its volunteers' data, and the kind of individuals and companies that may profit from it. Prof Allen says the security of the anonymised data is under constant review and approved researchers are carefully vetted to ensure they are who they say they are and doing health research in the public interest. The next phase of the imaging project is already underway, to scan 60,000 of the 100,000 participants already imaged at a later date to provide new insights into the hidden changes our bodies go through as we age."
    },
    {
        "title": "Many cancers no longer 'a death sentence' as treatment on 'cusp of golden era', NHS England medical director says",
        "description": "Many people with a cancer diagnosis \"should be confident that it's not a death sentence and that more treatments will become available\", according to the outgoing medical director of NHS England.",
        "url": "https://news.sky.com/story/many-cancers-no-longer-a-death-sentence-as-treatment-on-cusp-of-golden-era-nhs-england-medical-director-says-13396365",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-patient-hospital_6964805.jpg?20250714154602",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-07-14 06:47:00",
        "Headline": "Sir Stephen Powis said the number of those living longer with the disease and surviving will continue to increase, as he compared the progress made in cancer treatment to the success in developing treatment for HIV since he qualified as a doctor 40 years ago.",
        "Content": "Many people with a cancer diagnosis \"should be confident that it's not a death sentence and that more treatments will become available\", according to the outgoing medical director of NHS England. In his final interview before retiring, Professor Sir Stephen Powis said our understanding of the genetics of cancer and how it can be targeted is being \"revolutionised\". Sir Stephen, 64 and a kidney specialist who has been the national medical director since 2018 and throughout the COVID pandemic, told The Times: \"We are at the cusp of a golden era in terms of the way we treat a range of cancers. \"For many cancers now, people should be confident that it's not a death sentence and that more treatments will become available.\" Read more:'My voice box was removed after NHS missed my throat cancer''Milestone' technique could help cancer patients keep hair during chemo Sir Stephen said the number of those living longer with the disease and surviving it will continue to increase, while he compared the progress made in cancer treatment to the success in developing treatment for HIV since he qualified as a doctor 40 years ago. Science and technology editor A friend of mine was recently diagnosed with a melanoma, an aggressive form of skin cancer that had spread throughout their body, including their brain.\n Even a decade ago, their cancer would have been essentially incurable and rapidly fatal. My friend's tumours however are shrinking as their immune system attacks the cancer cells wherever they happen to be in their body.\n A treatment called immunotherapy is directing their own immune system to find and attack cancer cells in all the parts of the body to which they have spread.\n\n It's a familiar story across multiple cancer types with new classes of treatment, often based on rapid advances in understanding of the genetics of cancer - or cancer patients themselves.\n\n So the outgoing medical director of the NHS, Sir Stephen Powis, is not wrong: we are entering a \"golden era\" of cancer treatment, if we're not living in it already.\n\n Cancer treatment is becoming increasingly personalised to the specific mutations in the cancer itself. Oncologists know their enemy in more intimate detail than ever before.\n\n But we're entering a parallel and less gilded era too. Read Tom's full analysis here\n He also spoke of how preventing cancers could also help eliminate certain types of them. \n                  We are entering 'golden age' of cancer treatment - and also facing a less gilded era too\n                 \n                  'Milestone' technique could help cancer patients keep hair during chemotherapy\n                 \n                  Princess of Wales reveals pressure to put on 'brave face' after cancer diagnosis\n                 \"We can't prevent all cancers, but there are cancers that we can certainly prevent,\" he said, adding that he hopes lung cancers will become \"a lot rarer\". Cancer treatment, he said, would be \"driven by genetics\" to become more individualised with the increased ability to pinpoint mutations in cells. Recent Sky News analysis shows that in nearly half of 147 NHS trusts with available data fewer people are now being treated for cancer within the target than at the start of the year. That target is for 85% of cancer patients to begin treatment within two months of their diagnosis. Only a small number of trusts have achieved this. While 20 trusts met the standard in January, it is down to 15 trusts in May. Performance against the target fell in 62 areas overall between Jan and May, and none of those were meeting the target to begin with. In response to the analysis, an NHS spokesperson said: \"Despite the NHS seeing and treating record numbers of people for cancer... we know there is more to do to improve early diagnosis, access to tests and life-saving treatments. \"Our 10 Year Health Plan launched last week sets out some of the ways we will transform cancer care to be fit for the future, including innovation to speed up referral and diagnosis, with more to follow in the National Cancer Plan coming later this year.\""
    },
    {
        "title": "We are entering 'golden age' of cancer treatment - and also facing a less gilded era too",
        "description": "A friend of mine was recently diagnosed with a melanoma, an aggressive form of skin cancer that had spread throughout their body, including their brain.",
        "url": "https://news.sky.com/story/we-are-entering-golden-age-of-cancer-treatment-but-not-everybody-is-benefitting-13396480",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-mri-scanner-cancer_6964415.jpg?20250714233224",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-07-14 10:41:00",
        "Headline": "Cancer treatment is becoming increasingly personalised and oncologists know their enemy in more intimate detail than ever before. But we're entering a parallel and less gilded era too.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n A friend of mine was recently diagnosed with a melanoma, an aggressive form of skin cancer that had spread throughout their body, including their brain. Even a decade ago, their cancer would have been essentially incurable and rapidly fatal. My friend's tumours however are shrinking as their immune system attacks the cancer cells wherever they happen to be in their body. A treatment called immunotherapy is directing their own immune system to find and attack cancer cells in all the parts of the body to which they have spread. It's a familiar story across multiple cancer types with new classes of treatment, often based on rapid advances in understanding of the genetics of cancer - or cancer patients themselves. So the outgoing medical director of the NHS, Sir Stephen Powis, is not wrong: we are entering a \"golden era\" of cancer treatment, if we're not living in it already. Cancer treatment is becoming increasingly personalised to the specific mutations in the cancer itself. Oncologists know their enemy in more intimate detail than ever before. Tools like AI can sift through that detail to identify new vulnerabilities in cancer cells and techniques like gene editing allow scientists to design previously impossible new ways of exploiting them to slow, or reverse the spread of cancers. But we're entering a parallel and less gilded era too. Cancer is primarily a disease of ageing and our population is doing that rapidly.  It is also more common in those who eat and drink too much and exercise little - which is most of us - and explains why cancer rates are now, perhaps for the first time in human history, increasing in younger people too. As Sir Stephen points out, prevention must play an important role in reducing that increasing burden. It already has for some: smoking-related lung cancer is declining, so too is cervical cancer thanks to HPV vaccination in schools. But the bulk of cancers linked to poor diet, poor air quality, or poverty in general are not. Read more from Sky News:'My voice box was removed after NHS missed my throat cancer'IVF pioneer quits union over doctors' strike We're also failing to make sure everybody benefits from the incredible new treatments available and those yet to come. While people are now getting cancer diagnosed faster in the NHS, many start treatment too late. More than 30% of patients wait more than two months to see a cancer specialist following an \"urgent\" referral from their GP (well below the NHS target that has not been met since it was introduced in 2015).  Cancer survival is increasing, but so too is the disparity between those benefitting from the latest treatments and those who aren't. Specialist treatment in some parts of the UK is far better than in others - often those in poorer places where cancer rates are higher. And the latest, and best, cancer treatments - which are largely bespoke-tailored to the patient's needs - are increasingly expensive. Affording these has always been a challenge for the NHS and will only get harder. While the golden era unfolds, much must be done to avoid another in which cancer treatment becomes a two, or even three, tier service that offers the best only to a few."
    },
    {
        "title": "MasterChef presenter John Torode says allegation he used racist language upheld in report",
        "description": "MasterChef presenter John Torode says an allegation he used \"racial language\" was upheld in a report as part of a review into the behaviour of his former co-presenter Gregg Wallace.",
        "url": "https://news.sky.com/story/masterchef-presenter-john-torode-says-allegation-he-used-racial-language-upheld-in-report-13396761",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-john-torode-london_6964986.jpg?20250714215029",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-14 20:28:00",
        "Headline": "Torode says he has \"absolutely no recollection of any of this\" and \"racial language is wholly unacceptable in any environment\".",
        "Content": "MasterChef presenter John Torode says an allegation he used \"racial language\" was upheld in a report as part of a review into the behaviour of his former co-presenter Gregg Wallace. The report, led by law firm Lewis Silkin, found 45 of 83 allegations against Wallace were substantiated. There were also two standalone allegations made against other people, including one for using racist language. In a statement posted on his Instagram page, Torode said he was one of those people, but added that he had \"no recollection of the incident\" and said he \"did not believe that it happened\". He commented: \"Following publication of the executive summary of the investigation into Gregg Wallace while working on MasterChef, I am aware of speculation that I am one of the two other individuals against whom an allegation has been upheld. \"For the sake of transparency, I confirm that I am the individual who is alleged to have used racial language on one occasion. \"The allegation is that I did so sometime in 2018 or 2019, in a social situation, and that the person I was speaking with did not believe that it was intended in a malicious way and that I apologised immediately afterwards. \"I have absolutely no recollection of any of this, and I do not believe that it happened. \"However, I want to be clear that I've always had the view that any racial language is wholly unacceptable in any environment. I'm shocked and saddened by the allegation as I would never wish to cause anyone any offence.\" Read more:Driver jailed after cocaine haul discovered following car chaseFour people killed in Essex plane crash Wallace, 60, said he was \"deeply sorry\" for causing any distress, and never set out to \"harm or humiliate\". While the majority of the substantiated claims related to inappropriate sexual language and humour, one related to \"unwanted physical contact\", and three were about being \"in a state of undress\". The report said the number of sustained allegations made Wallace's return to MasterChef \"untenable\".  In a statement on Monday, Wallace said \"some of [his] humour and language missed the mark\", but he said, after nearly 20 years on MasterChef, \"I now see that certain patterns, shaped by traits I've only recently begun to understand, may have been misread\". Wallace, who said a \"late autism diagnosis\" had helped him understand how he is \"perceived\", criticised the BBC, saying the corporation had left him \"exposed to trial by media\". \"This has been brutal,\" he said."
    },
    {
        "title": "BBC breached editorial guidelines over Gaza documentary narrated by son of Hamas official",
        "description": "The BBC has said it breached its editorial guidelines by failing to disclose that the child narrator of a Gaza documentary was the son of a Hamas official.",
        "url": "https://news.sky.com/story/bbc-breached-editorial-guidelines-over-gaza-documentary-narrated-by-son-of-hamas-official-13396486",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bbc-broadcasting-house_6842109.jpg?20250228111317",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-07-14 11:00:00",
        "Headline": "Gaza: How To Survive A Warzone featured narration from a boy whose father has worked as Hamas's deputy minister of agriculture.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n The BBC has said it breached its editorial guidelines by failing to disclose that the child narrator of a Gaza documentary was the son of a Hamas official. A report into the controversial programme said three members of the independent production company knew about the role of the boy's father - but no one within the BBC was aware. The review called the failure to bring the information to the BBC's attention a \"significant oversight by the production company\". The independent report - commissioned by the corporation - criticised the BBC team involved in the documentary for not being \"sufficiently proactive\" with initial editorial checks, and for a \"lack of critical oversight of unanswered or partially answered questions\" ahead of broadcast. It described the background on the narrator's father as \"critical information\", which was not shared with the BBC before broadcast. While the report said there was no evidence \"to support the suggestion that the narrator's father or family influenced the content of the programme in any way\", it concluded the use of a child narrator for the programme was \"not appropriate\". Following the release of the report, media watchdog Ofcom said it would be launching its own investigation, under its rule which states that factual programmes must not materially mislead the audience. Gaza: How To Survive A Warzone aired on the BBC in February, but was pulled from iPlayer after it emerged that the child narrator was the son of Ayman Alyazouri, who has worked as Hamas's deputy minister of agriculture. How To Survive A Warzone was made by independent production company Hoyo Films, and features 13-year-old Abdullah al Yazouri, who speaks about life in Gaza during the war between Israel and Hamas. The review was led by Peter Johnston, the BBC's director of editorial complaints and reviews, who reports directly to director general Tim Davie. It found that a fee of £795 was paid for the narrator, paid to his sister. The report found that was not \"outside the range of what might be reasonable in the context\". The report did not name any individuals facing disciplinary action, but a new leadership role has been created in BBC News documentaries and current affairs, which the corporation says will be advertised in the next seven days. 👉 Listen to Sky News Daily on your podcast app 👈 While the BBC said the report found Hoyo Films did not \"intentionally\" mislead the BBC, the corporation said the independent production company \"bears most responsibility for this failure\". The broadcaster added that it also \"bears some responsibility\". It's been a tough day for the corporation, which earlier in the day saw an independent review into \"inappropriate behaviour\" by MasterChef presenter Gregg Wallace uphold more than half of the allegations against him. Arts and entertainment correspondent On the face of it, the behaviour of MasterChef presenter Gregg Wallace and a documentary about Gaza criticised for featuring the son of a Hamas minister seem like two totally separate issues. But it's not just the timing of the reports - with both arriving today - that links them. Both point to failings of management and a lack of due diligence at the BBC. The Silkin report, commissioned by production company Banijay, found more than half of the 83 allegations against Wallace have been substantiated, including one of \"unwanted physical contact\". It found that in terms of the BBC, there was \"no consolidated or central record of issues or concerns which had arisen in relation to Mr Wallace\". While the report on Gaza: How to Survive a War Zone found the BBC had breached one of its own editorial guidelines by not disclosing that the documentary's child narrator was related to a Hamas minister – with director general Tim Davie apologising for \"a significant failing in relation to accuracy\". While Wallace has been sacked from the BBC, no one has lost their job following the Gaza documentary controversy – instead the organisation is hiring a new role to help with the long-form work going forward. But is it enough? Today's reports are the latest updates in a series of scandals for the broadcaster, and with the government looking at overhauling the corporation's current funding model, the future of the BBC has never looked more uncertain. Culture secretary 'pleased' that 'catastrophic' failures acknowledged Flagging \"a significant failing\" in the documentary, Mr Davie said: \"I am sorry for this failing.\" He said action would now be taken to ensure \"proper accountability\" and also \"prevent such errors being repeated\". The BBC Board said: \"Nothing is more important than trust and transparency in our journalism. We welcome the actions the Executive are taking to avoid this failing being repeated in the future.\" Culture Secretary Lisa Nandy said she was \"pleased\" that the BBC has acknowledged \"catastrophic\" failures. She said she had had \"several meetings\" with the corporation, adding: \"I believe that they are acting now at pace to put in place measures to make sure that this cannot happen again.\" 'Really bad timing' for BBC - Culture committee chair Speaking to the Culture, Media and Sport Committee earlier this year, Mr Davie described the fallout over the documentary as \"damaging\", and said the corporation was \"not told\" about questions asked around Abdullah's father. Committee chair Caroline Dinenage told Sky presenter Mark Austin that Mr Davie and BBC chair Samir Shah would be invited back later this year. Ms Dinenage said there were \"faults on both sides\" when it came to the production of the documentary, before being asked whether the BBC's director general should consider his position. \"I think he's got an unbelievably difficult job,\" the Conservative MP said. \"We very rightly hold the BBC up to an incredible standard of expectation because they're our national broadcaster and they've got such a strong reputation around the world. \"The one thing we want to see from them is we need them to be trustworthy, we need them to be transparent, and we need them to be impartial.\" Ms Dinenage also noted the row comes at a time when the BBC is preparing for its royal charter renewal, calling it \"really bad timing\".  Children 'deserve to have their voices heard,' Hoyo Films says Hoyo Films said it takes the report findings \"extremely seriously,\" and also apologised. The company said it was \"working closely with the BBC\" to see if it could find a way to bring back parts of the documentary to iPlayer, adding: \"Our team in Gaza risked their lives to document the devastating impact of war on children. \"Gaza: How To Survive A Warzone remains a vital account, and our contributors - who have no say in the conflict - deserve to have their voices heard.\" The BBC says it has no current or future planned commissions with Hoyo Films. Following the release of the report, Israel's UK embassy questioned the finding that there had been \"no breach of impartiality\" in the documentary, and asked whether money paid to the boy could have ended up in the hands of Hamas. Ofcom previously warned that recent controversies could \"start to erode public trust and confidence\". Israel does not allow international news organisations into Gaza to report independently."
    },
    {
        "title": "Can BBC learn from Gaza documentary controversy?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>      ",
        "url": "https://news.sky.com/story/can-bbc-learn-from-gaza-documentary-controversy-13396671",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-daily-podcast-bbc_6964670.png?20250714134415",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-14 16:22:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈  The BBC breached its own editorial rules when it didn't explain that a 13-year-old, used to narrate a documentary about Gaza was, in fact, the son of a Hamas official. A review has found that the independent production company, Hoyo Films, bears most of the responsibility for what happened - but that BBC bosses should have had more oversight of the film. The corporation says it is taking action but, so far, nobody has lost their job. However, it is creating a new management role called 'Director of News Documentaries' as a result of the review. Niall Paterson speaks to correspondent Katie Spencer about the BBC's response - and former culture secretary John Whittingdale tells the podcast that he's concerned the corporation doesn't seem to learn from its mistakes."
    }
]