[
    {
        "title": "Gene Hackman's wife died from rare infectious disease around a week before actor's death, medical investigator says",
        "description": "Gene Hackman's wife died from a rare infectious disease around a week before the actor died, medical investigators have said.",
        "url": "https://news.sky.com/story/police-give-update-on-death-of-gene-hackman-and-wife-betsy-arakawa-13323478",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gene-hackman-wife-betsy-arakawa_6841105.jpg?20250228084053",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-07 20:55:00",
        "Headline": "Actor Gene Hackman had advanced Alzheimer's and \"it's quite possible he was not aware\" that his wife was deceased in their home, the chief medical investigator of New Mexico said today.",
        "Content": " Gene Hackman's wife died from a rare infectious disease around a week before the actor died, medical investigators have said. The couple were found dead in their New Mexico home on 26 February, along with one of their pet dogs. Police have previously said there were no apparent signs of foul play. At a press conference on Friday, chief medical investigator for New Mexico, doctor Heather Jarrell, gave an update on the results of post-mortem investigations carried out following their deaths. Doctor Jarrell said Hackman's wife, Betsy Arakawa, died from hantavirus pulmonary syndrome, a rare infectious disease. There were no signs of trauma and the death was a result of natural causes, she said. The doctor said Arakawa likely died on 11 February, the date she was last known to have communicated with people via email. She said Hackman had advanced Alzheimer's and died from heart disease, with data from his pacemaker last registering on 18 February. Due to his Alzheimer's, \"it's quite possible he was not aware that [his wife] was deceased,\" Dr Jarrell added. The actor tested negative for hantavirus, a rare disease spread by infected rodent droppings. Humans can contract hantavirus by breathing in contaminated air, and symptoms can start as soon as one week, or as long as eight weeks, later. It is not transmissible from person to person. There were just seven confirmed cases of hantavirus in New Mexico last year, and Arakawa is the only person confirmed to have contracted it in the state in 2025. Between 1975 and 2023, New Mexico recorded a total of 129 hantavirus cases, with 52 deaths. Santa Fe County sheriff Adan Mendoza said authorities are still waiting for data from mobile phones found at the property, but it is \"very unlikely they are going to show anything else\". \"There's no indication\" that Hackman used a mobile phone or any other technology to communicate and the couple lived a very private life before their deaths, he added.  The cause of the couple's dog's death has not been confirmed but it is now known that Arakawa had picked the animal up from the vet, where it had undergone a procedure, on 9 February. The procedure \"may explain why [the dog] was in a crate at the residence\" while two surviving dogs were found roaming the property, Mr Mendoza said. Hackman, who was widely respected as one of the greatest actors of his generation, was a five-time Oscar nominee who won the best actor in a leading role for The French Connection in 1972 and best actor in a supporting role for Unforgiven two decades later. More from Sky News:The Damned founding member diesKing Charles reveals his favourite music  At last Sunday's Academy Awards, Morgan Freeman paid tribute to Hackman. \"A community lost a giant and I lost a dear friend,\" he said. He met Arakawa, a concert pianist, in the mid-1980s and the pair married in 1991."
    },
    {
        "title": "Russia has 'all the cards' in negotiations to end Ukraine war, Trump says - as Starmer 'compares notes' with Macron",
        "description": "Donald Trump has said Russia has \"all the cards\" in negotiations to end the war with Ukraine - as Sir Keir Starmer held talks with the French president to \"compare notes\".",
        "url": "https://news.sky.com/story/trump-says-russia-has-all-the-cards-in-negotiations-to-end-ukraine-war-13323529",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-putin-us-russia_6849405.jpg?20250307202527",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-07 17:30:00",
        "Headline": "Donald Trump also suggested his priorities are in a different order to Ukraine's, by saying he wants the fighting to end before any security guarantees are made.",
        "Content": " Donald Trump has said Russia has \"all the cards\" in negotiations to end the war with Ukraine - as Sir Keir Starmer held talks with the French president to \"compare notes\". Speaking at the White House, the US president reiterated his desire to get a deal done to end the conflict, which he warned \"could lead to World War Three\". Trump latest: US president addresses latest tariff changes  But he said he had found it \"more difficult\" to deal with Ukraine, and suggested it may be easier to deal with Moscow, because \"they have all the cards\". He was also asked if Vladimir Putin was taking advantage of the decision by the US to stop sharing intelligence with Ukraine, following a series of air attacks on Ukrainian cities in recent days. \"I think he's doing what anyone else would do,\" Mr Trump replied.  However, he said he believed Mr Putin wanted to get the war \"stopped and settled\". \"I think both parties want to settle. I think we are going to get it settled,\" he added. While on social media on Friday, Mr Trump said he was \"strongly considering\" placing additional sanctions on Russia to force it into peace talks with Ukraine. \"To Russia and Ukraine, get to the table right now, before it is too late,\" Mr Trump said. It comes as Sir Keir Starmer and French President Emmanuel Macron spoke to \"compare notes\" on their work towards a possible peace in Ukraine, Downing Street said. The call, which took place on Friday evening, followed a call between the prime minister and other European leaders after European countries agreed a massive increase in defence spending. Sir Keir and Mr Macron have been leading efforts to draw together a \"coalition of the willing\" to help Kyiv. On Friday, Mr Trump also suggested his priorities are in a different order to Ukraine's - saying he wants the fighting to end before any security guarantees are made. \"Before I even think about that, I want to settle the war, get it finished,\" he said. \"As far as the question about security later, that's the easy part. The hard part is getting it settled.\" Ukrainian President Volodymyr Zelenskyy has repeatedly said his country needs \"reliable and clear\" security guarantees before a peace deal with Russia can be agreed. 👉 Follow Trump 100 on your podcast app 👈 Relations between the US and Ukraine have become fractured in recent weeks. Mr Trump's latest comments come exactly a week after his disastrous Oval Office meeting with Mr Zelenskyy - which saw the US president and his vice president, JD Vance, berate the Ukrainian leader and accuse him of being \"disrespectful\". Read more:The 5 Rs guiding Trump's world viewTrump pauses most Mexico and Canada tariffs In the days since, the Trump administration has paused military aid to Ukraine and stopped sharing US intelligence with Kyiv. Officials from Ukraine and the United States will next week hold talks about peace with Russia in Saudi Arabia."
    },
    {
        "title": "Reform UK MP Rupert Lowe reported to police over alleged threats towards party chairman",
        "description": "Reform UK has suspended MP Rupert Lowe and reported him to the police over alleged threats of physical violence towards the party's chairman.",
        "url": "https://news.sky.com/story/reform-uk-mp-rupert-lowe-reported-to-police-over-alleged-threats-towards-party-chairman-13323564",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rupert-lowe-reform-uk_6849317.jpg?20250307185645",
        "type": "Home",
        "Author": "Tim Baker",
        "Date Published": "2025-03-07 17:06:00",
        "Headline": "In a statement, Mr Lowe said the complaints were \"untrue and false\". He recently appeared to publicly question Nigel Farage's leadership of the party, something which he doubles down on in his response.",
        "Content": "\n          Political reporter\n        Reform UK has suspended MP Rupert Lowe and reported him to the police over alleged threats of physical violence towards the party's chairman. A statement from chair Zia Yusuf and chief whip Lee Anderson MP also said the party has received complaints from two female employees about alleged serious bullying in Mr Lowe's offices. Mr Yusuf and Mr Anderson said \"we understand complaints have been made to parliamentary authorities\". Mr Lowe, 67, has released a statement saying the allegations were \"untrue and false\", the accusations of physical threats were \"outrageous and entirely untrue\", and he referenced a \"vexatious complaint\" made by another staff member. Mr Lowe, the MP for Great Yarmouth, has had the whip suspended, meaning he will sit as an independent MP in the House of Commons. Mr Yusuf and Mr Anderson said in their statement that Mr Lowe had \"on at least two occasions made threats of physical violence against\" Mr Yusuf. The statement said: \"It is with regret that we feel obligated to disclose that the party received complaints from two female employees about serious bullying in the offices of the member of parliament for Great Yarmouth, Rupert Lowe.\" \n                  A pact between Nigel Farage and Kemi Badenoch?\n                 \n                  Farage says Zelenskyy is not a dictator and Trump 'should not be taken literally'\n                 \n                  Nigel Farage relinquishes majority control of Reform UK\n                 Claims of 'disturbing pattern of behaviour' It added: \"Evidence was provided to us of workplace bullying, the targeting of female staff who raised concerns, and evidence of derogatory and discriminatory remarks made about women, including reference to a perceived disability. \"We feel we have a duty of care to all our staff, whether employed directly or indirectly. Accordingly, we appointed an independent King's Counsel to conduct an investigation into the veracity of these complaints. To date, Mr Lowe has yet to cooperate with this investigation. \"In addition to these allegations of a disturbing pattern of behaviour, Mr Lowe has on at least two occasions made threats of physical violence against our party chairman. Accordingly, this matter is with the police. \"Reform stands for the highest standards of conduct in public life, and we will apply these standards without fear nor favour, including within our own party.\" Rumblings of leadership challenge Earlier this week, Mr Lowe appeared to question Nigel Farage’s leadership of Reform UK. In an interview with the Daily Mail, Mr Lowe said: \"Nigel is a fiercely independent individual and is extremely good at what we have done so far. He has got messianic qualities. \"Will those messianic qualities distil into sage leadership? \"I don't know.\" He added: “I'm not going to be by Nigel's side at the next election unless we have a proper plan to change the way we govern from top to bottom.” During Mr Farage's online falling out with Elon Musk, in which the Tesla businessman said Reform needed a new leader, Mr Lowe drew praise from Mr Musk. And in the interview with the Daily Mail, Mr Lowe noted that he was \"barely six months into being an MP\" and \"in the betting to be the next prime minister.\" 'Disappointed but not surprised' In his response to the allegations, Mr Lowe said on Friday the party leadership had a \"complete inability to accept even the most mild constructive criticism without such a malicious reaction\". He said in a statement posted on X: \"I am disappointed, but not surprised, to read Reform's untrue and false allegations. Let me be abundantly clear - this investigation is based on zero credible evidence against me, as has been repeatedly stated by the neutral investigator. None has been provided. \"I have cooperated and spoken at length with the KC they instructed, at great cost to the party, to investigate a minor staff matter.\" Read more:Farage gives up sole control of ReformParty passes 200,000 members He claimed the lawyer was \"dismayed\" the statement from Reform UK had been published - and that the investigation had not even started. Mr Lowe claimed the lawyer told him that \"no credible evidence has been given\". The MP added that he was sent an initial letter of complaint last Friday from the party with \"no evidence provided\". \"I have never made any derogatory comments about women, or those with disabilities. This is a lie. These allegations are not even referring to me. I will be seeking legal advice immediately,\" he added. Political correspondent It sounds too weird to be true, but Elon Musk may very well be the reason that Reform UK is embroiled in a messy public battle with one of its five MPs.\n Detailed and damning statements released on Friday look to be the culmination of months of growing division between Nigel Farage and Great Yarmouth MP Rupert Lowe. The allegations against him are serious, numerous and have triggered three possible investigations – from the party, the parliamentary authorities and the police. His rebuttal is equally robust, indicating he will fight hard to clear his name.\n But is this battle just about his behaviour? Or is it because of his leadership ambitions? And were they ignited after a bizarre intervention from across the pond? In January, Musk posted on X, calling for Farage to step down, saying he wasn't up to the job, and later suggested Lowe could step up as he 'makes a lot of sense'. Two months later and relations had broken down beyond repair, with a war of words erupting this week in the papers, in which Lowe called Farage messianic and he responded saying the MP probably wanted to be prime minister. There is no doubt that an endorsement from the world's richest man would flatter the ego of any aspiring politician. But given Friday's revelations, it seems that instead of kick-starting his rise to the top of Reform, Musk's meddling has instead severed his ties with the party for good. When it comes to his parliamentary career, salvaging his reputation could also prove difficult as other critical accounts of his character emerge. Sky News has heard from Labour MP Mike Kane about an incident which took place in the Commons last December, during which he says he was \"manhandled\" by the then Reform MP. The Transport minister described an angry scene in which Lowe had to be restrained by Reform's deputy leader, Richard Tice, and eventually broken up by the Sergeant at Arms. Mr Lowe did not wish to comment on the claim, but it adds yet another obstacle in the fight for his political future. 'Vexatious' complaint  Mr Lowe continued: \"It is no surprise that this vexatious statement has been issued the day after my reasonable and constructive questions of Nigel and the Reform structure. It was issued on X late on a Friday afternoon, with no prior warning. \"All I stated was that communication needs to improve, delegation needs to improve, structure needs to improve - these are all reasonable requests of a party looking to form the next government. I stand by everything I said.\" His response added: \"I do not believe that Reform members will be pleased to know that their membership fees are being spent on instructing expensive lawyers to investigate their own MPs, over matters that are entirely baseless and have been dealt with in the correct Parliamentary procedure, with HR's full involvement and support. \"The staff member in question only raised a vexatious complaint once disciplinary proceedings had been initiated against them for serious wrongdoing. The other individual mentioned, dropped her appeal.\" Read more:Other Reform MP jailed for kicking girlfriendParty seen as stronger than Tories 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Mr Lowe said he had been trying to change the way Reform is run \"behind the scenes\" for many months, and urged his supporters to \"stay with the party\". He said: \"This is our party as much as it is Nigel's.\" A Metropolitan Police spokesperson said: \"On Thursday, 6 March we received an allegation of verbal threats made by a 67-year-old man on Friday, 13 December. \"Officers are carrying out an assessment of the allegations to determine what further action may be required.\""
    },
    {
        "title": "Who were the targets of Russian spy ring dubbed 'the Minions'?",
        "description": "Six Bulgarians have been convicted of being part of a spy ring which carried out surveillance in the UK and across Europe for Russia.",
        "url": "https://news.sky.com/story/the-operations-carried-out-by-russian-spy-ring-dubbed-the-minions-13323509",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-katrin-ivanova-tihomir-ivanchev_6849259.png?20250307175120",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-07 15:23:00",
        "Headline": "The group were involved in gathering information about prominent individuals but also plotted to kidnap journalists who were critical of the Kremlin, and spied on who they believed were Ukrainian soldiers training at a US base in Germany.",
        "Content": " Six Bulgarians have been convicted of being part of a spy ring which carried out surveillance in the UK and across Europe for Russia. Following a three-month trial in London, two women and a man - Katrin Ivanova, Vanya Gaberova, and Tihomir Ivanchev - were found guilty of their involvement in the sophisticated network headquartered at a former guesthouse in Great Yarmouth, Norfolk. Three other men - Orlin Roussev, Bizer Dzhambazov, and Ivan Stoyanov - admitted the charges before the Old Bailey trial started. The Crown Prosecution Service said each person played a role in a variety of operations across Europe on behalf of the Russian state. Not all of the team were involved in all of the missions, but each individual played a role in at least two.  Here's what we know about the spy ring, nicknamed \"the Minions\", an apparent reference to the yellow characters in Despicable Me, and their operations: Operation one: Kidnap plot against Salisbury attack journalist Christo Grozev, a Bulgarian investigative journalist, was targeted by the group on a number of occasions from December 2020 until January 2023. \n                  Three people guilty of spying for Russia from Great Yarmouth seaside guesthouse\n                 \n                  Inflatable boats, rubber rings and engines seized in Bulgaria before reaching people smugglers\n                 \n                  Man 'dies on board' Jet2 flight to Liverpool as plane makes emergency landing\n                 Mr Grozev worked for the Bellingcat group and as the lead investigator on Russian affairs, he won awards for his work, including uncovering Russian links to the 2018 Salisbury attack, in which former Russian spy Sergei Skripal and his daughter were poisoned with the nerve agent novichok.  As a result of Mr Grozev's activities, he was placed on the wanted list by the Russian Interior Ministry. Mr Grozev was followed to different countries, including Austria, Montenegro and Spain. The spy ring created a number of reports for their Russian clients which set out his movements and provided information about his accommodation, vehicle and contacts. The group also considered a potential 'honeytrap' plot, robbing and killing him, or kidnapping him and taking him to Russia. Operation two: Plan to smuggle Russian out of UK by boat Roman Dobrokhotov, a Russian who lives in the UK, was targeted in November 2022. He is an investigative journalist and founder of the media outlet The Insider, which focuses on Russia and was previously based in the country. Mr Dobrokhotov fled Russia, having been arrested and then deprived of his passport. The surveillance included following him around Europe, with one member of the spy ring, Ivanova, sitting next to him on a flight from Budapest to Berlin. The group plotted to kidnap the journalist and smuggle him out of UK by boat, but messages revealed that it was deemed too dangerous.  Operation three: Staking out former Kazakhstan politician Bergey Ryskaliyev was targeted in November 2021 after seeking asylum in the UK. The surveillance included staking out locations thought to be linked to the former Kazakhstan politician and exploring ways of accessing those addresses. One member of the spy ring, Stoyanov, was filmed by two of Mr Ryskaliyev's assistants as they conducted surveillance in a parked car outside the Kazakh's residence in London. When challenged by the assistants, Stoyanov provided a cover story about working for a nearby hospital, even displaying an NHS sign in his vehicle. Read more from Sky News:Russia rejects British troops in UkraineEx-soldier jailed for spying for IranRussia expels British diplomats for 'spying' Operation four: Fake pig's blood at Kazakhstan embassy The group plotted to create a false opposition group and stage a demonstration outside the Kazakhstan embassy in September 2022. One stunt included planning to spray the building with large quantities of fake pig's blood. The intention was to feed false 'intelligence' about the group to the Kazakh Intelligence Services, via their Russian counterparts. The aim was to benefit Russia's standing in the eyes of the Kazakhs. Operation five: Ukraine forces targeted at US military base Surveillance at a US military base in Stuttgart, Germany, was carried out from late 2022 until the group's arrests in February 2023. They believed Ukrainian forces were being trained at the base to use surface-to-air weapons. The plan was to use a range of sophisticated technology designed to capture key intelligence about Ukrainian military personnel and trace them when they returned to Ukraine. Surveillance images, videos and descriptions of the base were seized from devices. A car which was recovered had been adapted to house and deploy technical surveillance devices outside the base. Operation six: Kidnap plot targeting Russian Kirill Kachur was employed by the Investigative Committee of Russia (roughly equivalent to the UK's National Crime Agency) but left the country in 2021 and was charged in his absence with embezzlement, making him an obvious source of interest for Russia.   Kachur, who spent time in Montenegro, was targeted from September 2021 to 2022. Surveillance included the use of drones and a kidnapping plot was discussed. The spy ring rented a villa near Mr Kachur's location for €5,000 (£4,200) a month, and the group liaised directly with officers of the Russian Intelligence Service on the ground. Spies each face up to 14 years in prison Ivanova, 33, Gaberova, 30, and Ivanchev, 39, were convicted on Friday of plotting to spy for an enemy state. They face up to 14 years in prison when they are sentenced in May. Ringleader Roussev, 47, Dzhambazov, 43, and Stoyanov, 32, previously pleaded guilty to spying offences.  Roussev was said to be directed by alleged Russian agent Jan Marsalek, an Austrian national wanted by Interpol after the 2020 collapse of German payment processing firm Wirecard. His whereabouts are unknown."
    },
    {
        "title": "Death row inmate executed by firing squad in US for first time in 15 years",
        "description": "A convicted double murderer has been executed by firing squad in the first use of the method in the US for 15 years.",
        "url": "https://news.sky.com/story/death-row-inmate-executed-by-firing-squad-in-us-for-first-time-in-15-years-13323865",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-brad-sigmon-death-penalty_6848929.jpg?20250307120549",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-07 23:20:00",
        "Headline": "Brad Sigmon, who was convicted of beating his ex-girlfriend's parents to death in 2001, chose to be executed by firing squad.",
        "Content": "A convicted double murderer has been executed by firing squad in the first use of the method in the US for 15 years. Brad Sigmon, 67, chose to be killed by bullets, saying he feared the alternatives of the electric chair and lethal injection would risk a slower and more painful death. He was convicted of beating his ex-girlfriend's parents, William and Gladys Larke, to death with a baseball bat at their home in the town of Taylors, South Carolina, in 2001. He told police he planned to take his ex-girlfriend on a romantic weekend before killing himself and her, and was sentenced to death in 2002. After being shot by three volunteer prison employees armed with rifles that were loaded with live ammunition, Sigmon was pronounced dead at 6.08pm (11.08pm in the UK) on Friday. He wore a black jumpsuit with a hood over his head during the execution, and had a white target with a red bullseye over his chest. Sigmon delivered a closing statement, which he said was \"one of love and a calling to my fellow Christians to help us end the death penalty\". Witnesses - who observed the execution from a chamber separated by bullet-resistant glass - included three members of the victims' family, Sigmon's attorney and spiritual advisor, a representative from the prosecuting solicitor's office, a sheriff's investigator and three members of the press. On Wednesday, prior to his death, he asked the US Supreme Court to stop his execution, arguing South Carolina's refusal to share information about its lethal injection protocol violated his rights. His lawyer, Bo King, said the last three men to be executed in the state chose lethal injection and said the process lasted about 20 minutes before they were dead. He said Sigmon was left with \"an impossible choice\" and was forced \"to decide whether to die by the firing squad, knowing that the bullets are going to break the bones in his chest and destroy his heart, or risk a 20-minute-long execution strapped to a gurney with your lungs filling with blood and fluid\". Read more:'Trump bump' turns to a Trump slumpMAGA turns on Trump-appointed Supreme Court judge Ahead of the execution, a group of protesters gathered outside the South Carolina Department of Corrections holding signs with messages including \"all life is precious\" and \"execute justice not people\". There have only been three executions by firing squad in the US since 1977, all of which were in Utah - one of only five states that still offers the method common in the 19th century during the Civil War. The most recent execution by firing squad was Ronnie Lee Gardner in 2010. He was given the death penalty for killing a man during an attempted escape from a courthouse in 1985."
    },
    {
        "title": "Syria: 'Nearly 200 killed' in country's worst violence since Assad toppled",
        "description": "Almost 200 people have died in clashes between Syrian government forces and fighters loyal to the country's former president Bashar al Assad, a war monitoring group has said.",
        "url": "https://news.sky.com/story/syria-nearly-200-killed-in-countrys-worst-violence-since-assad-toppled-13323596",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-syria-latakia-ex-president-bashar-assad_6849249.jpg?20250307174814",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-07 17:48:00",
        "Headline": "Clashes in the coastal region loyal to Bashar al Assad have seen Syria's new government, which has promised to unite the country, send reinforcements after some of its forces were ambushed.",
        "Content": " Almost 200 people have died in clashes between Syrian government forces and fighters loyal to the country's former president Bashar al Assad, a war monitoring group has said. Fighters backing the new Damascus regime attacked three villages near the coast, killing dozens of men in retaliation for attacks on government security forces by Assad loyalists, the UK-based Syrian Observatory for Human Rights (SOHR) said on Friday. SOHR said the violence erupted on Thursday afternoon when pro-Assad militants ambushed Syrian security forces in the Latakia region, a former stronghold of the deposed leader where many of the minority Alawites, who made up his support base, live. The unrest, which continued on Friday, was the worst since Assad's government was ousted in December by rebels led by the Islamist group Hayat Tahrir al Sham. Overnight, Damascus sent reinforcements to the coastal cities of Latakia and Tartus and nearby villages. Violence began when government forces tried to detain a wanted person near the coastal city of Jableh and were attacked by Assad loyalists, SOHR said.  'They killed every man' \n                  What do hidden documents tell us about Syria's missing people?\n                 \n                  Syrian equestrian champion tells of prison ordeal lasting two decades after beating Bashar al Assad's brother  \n                 \n                  Moscow denies Asma al Assad seeks divorce - as reports suggest she wants UK return\n                 Gunmen loyal to the new government attacked the villages of Sheer, Mukhtariyeh, and Haffah near the coast, killing 69 men but harming no women, according to the observatory. SOHR chief Rami Abdurrahman said: \"They killed every man they encountered.\" More than 30 men were killed in the village of Mukhtariyeh alone, Beirut-based Al-Mayadeen TV said. In addition to those killed in the villages, the dead included at least 50 members of Syria's government forces and 45 fighters loyal to Mr Assad, SOHR said. An unnamed security official, quoted by Syria's state news agency SANA, said numerous people went to the coast seeking revenge for the recent attacks on government security forces, which led to \"some individual violations\" that they are trying to stop. Large numbers of government troops were seen on Friday morning in Latakia, where some minor clashes erupted, according to security forces. The city is under curfew, along with other coastal areas. Read more on Sky News:Russia 'has all the cards' - TrumpOlympic snowboarder among FBI's most wantedSpaceX rocket explodes during test Since the change of regime in the country, minority Alawites have been victims of some sectarian violence. Syria's interim president, Ahmed al-Sharaa, said on Friday his forces will pursue the \"remnants\" of the Assad regime and bring them to trial. The former insurgent and his administration have previously promised to stamp out sectarian attacks and unite Syria after 14 years of civil war in which more than half a million people have died and millions been displaced. Geir O Pedersen, the UN special envoy for Syria, called on all parties to \"refrain from actions that could further inflame tensions, escalate conflict, exacerbate the suffering of affected communities, destabilise Syria, and jeopardise a credible and inclusive political transition\"."
    },
    {
        "title": "Rhianan Rudd inquest: MI5 investigation of groomed teen accused of terrorism continued up until her death",
        "description": "A member of MI5, who leads counterterrorism teams, has told an inquest how the security service continued to investigate Rhianan Rudd until her suicide in a care home, aged 16.",
        "url": "https://news.sky.com/story/rhianan-rudd-inquest-mi5-investigation-of-groomed-teen-accused-of-terrorism-continued-up-until-her-death-13323633",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-rhianan-rudd-inquest_6841724.jpg?20250227195523",
        "type": "Home",
        "Author": "Jason Farrell",
        "Date Published": "2025-03-07 18:49:00",
        "Headline": "Rhianan Rudd, 16, took her own life while living in a care home. She had been groomed and sexually exploited online by a white supremacist in America, and an inquest previously heard she was \"obsessed\" with Adolf Hitler.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n A member of MI5, who leads counterterrorism teams, has told an inquest how the security service continued to investigate Rhianan Rudd until her suicide in a care home, aged 16. The man, referred to in court as 'Witness A', appeared behind a blue curtain and could not be seen by anyone in the courtroom as he addressed the inquest today. He said it was necessary to investigate the teenager \"to assess the risk she posed to national security\". He told the court MI5's caseloads involved a growing number of minors who have been radicalised online, and discussed the complexities of trying to assess the difference between online \"bravado\" and someone taking \"concrete steps\" towards committing a terrorist attack. Rhianan, from Bolsover in the East Midlands, was an autistic teenager who had been groomed and sexually exploited online by a white supremacist in America. She became obsessed with Hitler, told her mum she wanted to blow up a synagogue, and had downloaded information on bomb making. Her mother referred her to deradicalisation programme Prevent in September 2020, but anti-terrorism police later arrested and charged Rhianan with terrorism offences, and she was put into care. The police investigation was dropped after Rhianan was assessed by the Home Office as a victim of modern slavery. Five months later, in May 2022, the 16-year-old took her own life at Bluebell House Residential Home in Nottinghamshire. She was found with a ligature around her neck. Her mother, Emily Carter, believes the pressure of the investigation had taken its toll. An inquest at Chesterfield Town Hall has been examining how police and social services balanced the challenges of a young girl who was both a potential danger to herself and the public. The coroner and legal teams today came to London to hear evidence from MI5. Witness A, who had worked at MI5 for 35 years, said it was known from the outset that Rhianan had self-harmed and was vulnerable. But he added: \"She appeared to have a violent right-wing extremist mindset, she showed some intent as a result of being radicalised online. \"Investigating her was the only way of understanding the threat she might pose to national security.\" Rhianan had to come off the Prevent programme while under investigation, and Witness A talked of Joint Operation Team (JOT) meetings between MI5 and Anti-Terrorism Police discussing the balance between safeguarding and investigating her. In an email, an MI5 investigating officer said they would be \"grateful for national guidance for handling such a case\". MI5 seeing 'growing rise' of casework on children Witness A said the service was \"seeing a growth of minors in our casework\" and that there had been \"a period of significant change to the sort of work we were seeing\". He told the court: \"None of us joined MI5 to investigate children. It does not sit comfortably with any of us. It's becoming a necessary requirement.\" Charging Rhianan helped with safeguarding, he argued, as her bail conditions restricted her access to the internet. After police charges were dropped, she remained a concern to the security services. The inquest heard that during a meeting in April 2022, the month before Rhianan's death, police updated MI5 and said she had recently started speaking with a German accent and dressed in camouflage on Adolf Hitler's birthday. An officer in a MI5 department known as the behavioural science unit (BSU) reported that \"Rhianan is an individual who is both vulnerable and risky at the same time\". \"Rhianan maybe in a situation where her vulnerabilities are exploited by an individual and she therefore becomes an increased risk,\" they added. More from Sky News:Reform MP reported to policeThree guilty of spying for Russia in the UK  In her case, the individual was a neo-Nazi called Chris Cook. The inquest heard how MI5 contacted the FBI in December 2020, which later provided all known communication between Rhianan and Cook. MI5 was told he had a \"personal relationship\" with Rhianan, then aged 14, and communicated with her on WhatsApp, including sending links to \"racially motivated, violent extremist books.\" Witness A said the internet had \"lowered the barriers of engagement\" allowing vulnerable people like Rhianan to meet with radical individuals. The inquest continues. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Post Office scandal: Fujitsu agrees to talks about contributing to victims' compensation",
        "description": "Fujitsu has agreed to begin talks with the UK government on contributing to compensation for victims of the Post Office scandal.",
        "url": "https://news.sky.com/story/post-office-scandal-fujitsu-agrees-to-talks-about-contributing-to-victims-compensation-13323562",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-bracknell-fujitsu-post-office_6424658.jpg?20240117141405",
        "type": "Home",
        "Author": "Adele Robinson",
        "Date Published": "2025-03-07 17:08:00",
        "Headline": "Fujitsu developed the faulty Horizon computer system responsible for erroneous shortfalls in accounting and supported the Post Office in its prosecutions.",
        "Content": "\n          Business correspondent\n              @SkyNewsAdele\n Fujitsu has agreed to begin talks with the UK government on contributing to compensation for victims of the Post Office scandal. Hundreds of sub-postmasters were falsely accused of stealing from their branches between 1999 and 2015. Fujitsu developed the faulty Horizon computer system responsible for erroneous shortfalls in accounting which led to wrongful convictions. They also supported the Post Office in its prosecutions. More than a year ago, Fujitsu boss Paul Patterson said the company had a \"moral obligation\" to contribute towards redress for victims. Business secretary Jonathan Reynolds and Mr Patterson today held a \"positive and constructive\" meeting in Japan - where Fujitsu agreed to begin talks on compensation. The UK government \"welcomes Fujitsu's repeated commitment to its moral obligation to contribute\" towards compensation for the Horizon scandal victims, a joint statement said. Ahead of the completion of the inquiry into the scandal, the pair \"agreed to progress discussions regarding Fujitsu's contribution, acknowledging many parties are involved,\" it added. \n                  Post Office scandal victim died days before compensation letter arrived - as widow says offer an 'utter disgrace'\n                 \n                  Post Office chair warns postmasters on pay uplift amid Whitehall funding talks\n                 \n                  Victims of second Post Office scandal criticise 'grinding wheels of bureaucracy' as they try to get compensation\n                 Officials will \"continue to engage with Fujitsu\", but the UK government will not be making a \"running commentary\" on discussions, the statement said. It also said the government is \"grateful\" for Fujitsu's engagement with the Post Office inquiry \"and its continued focus on delivering its public services commitments in the UK\". 'Utter disgrace' It comes as the widow of a Post Office scandal victim, who received a compensation offer days after his death, described her situation as an \"utter disgrace\". Janet Walters, 68, lost her husband Terry in February - a week before a letter arrived offering \"less than half\" of his original claim for financial redress.  Terry Walters was one of 555 sub-postmasters who won a legal battle against the Post Office in 2019. Janet described the length of time many victims have had to wait for an offer of compensation as another \"scandal\". \"I've told them I will not accept [the offer],\" Janet told Sky News. \"I think it's an utter disgrace. \"It's a scandal what they did with the Horizon system, it's a scandal now because of the length of time it's taken [on redress].\" Thousands waiting for compensation New figures show more than £768m has been now paid to more than 5,100 victims across all redress schemes. The Department for Business and Trade said this was a \"more than tripling\" of the total amount of redress paid since June 2024. Read more:Sub-postmasters still going through hell, says Alan BatesSecond Post Office IT scandal expands There are, however, still hundreds waiting for compensation in the GLO (Group Litigation Order) scheme, with more than 200 yet to receive full redress. There are also more than 4,000 yet to be paid in the Horizon Shortfall Scheme (HSS), although since last month, over 700 have received compensation.  In a separate statement after the meeting in Japan, Mr Reynolds said: \"We must never forget the lives ruined by the Horizon scandal and no amount of redress can take away that pain. But justice can and must be done. \"This government is determined to hold those responsible to account and will continue to make rapid progress on compensation and redress. \"Since we took office, we have more than tripled the total amount of redress paid to victims, and today we took another significant step towards justice.\""
    },
    {
        "title": "What is hantavirus - the rare disease that actor Gene Hackman's wife Betsy Arakawa died from?",
        "description": "Actor Gene Hackman died of heart disease around a week after his wife Betsy Arakawa died of a rare infectious disease at their home, a pathologist has said. But what do we know about the rare virus?",
        "url": "https://news.sky.com/story/what-is-hantavirus-the-rare-disease-that-actor-gene-hackmans-wife-betsy-arakawa-died-from-13323830",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-hantavirus-hps_6849575.jpg?20250307230021",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-07 22:05:00",
        "Headline": "The actor's wife Betsy Arakawa died after developing hantavirus pulmonary syndrome (HPS) around 11 February, a pathologist said. ",
        "Content": "Actor Gene Hackman died of heart disease around a week after his wife Betsy Arakawa died of a rare infectious disease at their home, a pathologist has said. But what do we know about the rare virus? The couple were found dead on 26 February in separate rooms of their Santa Fe home, along with one of their dogs, and on Friday the results of medical tests were released in New Mexico. Two-time Oscar winner Hackman was in the advanced stages of Alzheimer's when he died of heart disease, and it was likely he was at home alone with the body of his wife for a week before he passed away himself. Dr Heather Jarrell, chief medical examiner for New Mexico, told reporters Betsy Arakawa is believed to have died around 11 February. The post-mortem examination showed Ms Arakawa, also known as Betsy Hackman, died of hantavirus pulmonary syndrome - a rare but potentially fatal disease. But, what is it - and how do you get infected? HPS, commonly referred to as hantavirus disease, is a respiratory disease caused by hantaviruses which are carried by several types of rodents. \n                  Gene Hackman's wife died from rare infectious disease around a week before actor's death, medical investigator says\n                 \n                  Gene Hackman: Morgan Freeman makes emotional Oscars tribute to 'a giant and a dear friend'\n                 \n                  The Oscars moments everyone's talking about: The good, the bad and the chewing gum\n                 It is a rare condition in the US, with most cases concentrated in the western states of New Mexico, Arizona, Colorado and Utah. The New Mexico Department of Health says hantaviruses are spread by the saliva, droppings and urine of infected rodents, which in North America is most likely to be the eastern deer mouse (Peromyscus maniculatus). The virus is often transmitted through the air when people sweep out sheds or clean closets where mice have been living, or by eating food contaminated with mouse droppings. It is not transmissible from person to person, Dr Jarrell said. What are the symptoms? Symptoms, which vary between people, are thought to develop between one and eight weeks after exposure and the likelihood of death in the southwest of the US is about 38% to 50%. Early symptoms of HPS include fatigue, fever, and myalgia (muscle aches), with about half of patients also experiencing malaise, headaches, dizziness, lightheadedness, chills, sweats, and abdominal problems including nausea, vomiting and diarrhoea, according to the American Lung Association. Later symptoms include coughing, shortness of breath, and pneumonia (lungs filling with fluid). Rapid breathing and rapid heartbeat are also typical. At this stage, the disease progresses rapidly, requiring hospital treatment and often mechanical ventilation to help with breathing. What is the treatment for HPS? There is no specific cure, treatment, or vaccine for HPS, but patients have a better chance of survival when they are diagnosed early. How common is it in the US? The Centers for Disease Control and Prevention began tracking the virus after a 1993 outbreak in the Four Corners region - the area where Arizona, Colorado, New Mexico and Utah meet. The agency said that, as of the end of 2022, 864 cases of hantavirus disease were reported in the US since that tracking began. What about the UK? The most recent information about cases in the UK was released by Public Health England (PHE) in 2014. The health body described how acute kidney injury (AKI), caused by hantaviruses in rodents, was linked to exposure to pet or wild rats - but there have only been a handful of cases. It added that certain hantaviruses present in Europe, Asia and Africa tend to cause haemorrhagic and kidney disease, while new world hantaviruses in the Americas tend to cause severe respiratory disease, including HPS."
    },
    {
        "title": "Reform UK MP Rupert Lowe reported to police over alleged threats towards party chairman",
        "description": "Reform UK has suspended MP Rupert Lowe and reported him to the police over alleged threats of physical violence towards the party's chairman.",
        "url": "https://news.sky.com/story/reform-uk-mp-rupert-lowe-reported-to-police-over-alleged-threats-towards-party-chairman-13323564",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rupert-lowe-reform-uk_6849317.jpg?20250307185645",
        "type": "UK",
        "Author": "Tim Baker",
        "Date Published": "2025-03-07 17:06:00",
        "Headline": "In a statement, Mr Lowe said the complaints were \"untrue and false\". He recently appeared to publicly question Nigel Farage's leadership of the party, something which he doubles down on in his response.",
        "Content": "\n          Political reporter\n        Reform UK has suspended MP Rupert Lowe and reported him to the police over alleged threats of physical violence towards the party's chairman. A statement from chair Zia Yusuf and chief whip Lee Anderson MP also said the party has received complaints from two female employees about alleged serious bullying in Mr Lowe's offices. Mr Yusuf and Mr Anderson said \"we understand complaints have been made to parliamentary authorities\". Mr Lowe, 67, has released a statement saying the allegations were \"untrue and false\", the accusations of physical threats were \"outrageous and entirely untrue\", and he referenced a \"vexatious complaint\" made by another staff member. Mr Lowe, the MP for Great Yarmouth, has had the whip suspended, meaning he will sit as an independent MP in the House of Commons. Mr Yusuf and Mr Anderson said in their statement that Mr Lowe had \"on at least two occasions made threats of physical violence against\" Mr Yusuf. The statement said: \"It is with regret that we feel obligated to disclose that the party received complaints from two female employees about serious bullying in the offices of the member of parliament for Great Yarmouth, Rupert Lowe.\" \n                  A pact between Nigel Farage and Kemi Badenoch?\n                 \n                  Farage says Zelenskyy is not a dictator and Trump 'should not be taken literally'\n                 \n                  Nigel Farage relinquishes majority control of Reform UK\n                 Claims of 'disturbing pattern of behaviour' It added: \"Evidence was provided to us of workplace bullying, the targeting of female staff who raised concerns, and evidence of derogatory and discriminatory remarks made about women, including reference to a perceived disability. \"We feel we have a duty of care to all our staff, whether employed directly or indirectly. Accordingly, we appointed an independent King's Counsel to conduct an investigation into the veracity of these complaints. To date, Mr Lowe has yet to cooperate with this investigation. \"In addition to these allegations of a disturbing pattern of behaviour, Mr Lowe has on at least two occasions made threats of physical violence against our party chairman. Accordingly, this matter is with the police. \"Reform stands for the highest standards of conduct in public life, and we will apply these standards without fear nor favour, including within our own party.\" Rumblings of leadership challenge Earlier this week, Mr Lowe appeared to question Nigel Farage’s leadership of Reform UK. In an interview with the Daily Mail, Mr Lowe said: \"Nigel is a fiercely independent individual and is extremely good at what we have done so far. He has got messianic qualities. \"Will those messianic qualities distil into sage leadership? \"I don't know.\" He added: “I'm not going to be by Nigel's side at the next election unless we have a proper plan to change the way we govern from top to bottom.” During Mr Farage's online falling out with Elon Musk, in which the Tesla businessman said Reform needed a new leader, Mr Lowe drew praise from Mr Musk. And in the interview with the Daily Mail, Mr Lowe noted that he was \"barely six months into being an MP\" and \"in the betting to be the next prime minister.\" 'Disappointed but not surprised' In his response to the allegations, Mr Lowe said on Friday the party leadership had a \"complete inability to accept even the most mild constructive criticism without such a malicious reaction\". He said in a statement posted on X: \"I am disappointed, but not surprised, to read Reform's untrue and false allegations. Let me be abundantly clear - this investigation is based on zero credible evidence against me, as has been repeatedly stated by the neutral investigator. None has been provided. \"I have cooperated and spoken at length with the KC they instructed, at great cost to the party, to investigate a minor staff matter.\" Read more:Farage gives up sole control of ReformParty passes 200,000 members He claimed the lawyer was \"dismayed\" the statement from Reform UK had been published - and that the investigation had not even started. Mr Lowe claimed the lawyer told him that \"no credible evidence has been given\". The MP added that he was sent an initial letter of complaint last Friday from the party with \"no evidence provided\". \"I have never made any derogatory comments about women, or those with disabilities. This is a lie. These allegations are not even referring to me. I will be seeking legal advice immediately,\" he added. Political correspondent It sounds too weird to be true, but Elon Musk may very well be the reason that Reform UK is embroiled in a messy public battle with one of its five MPs.\n Detailed and damning statements released on Friday look to be the culmination of months of growing division between Nigel Farage and Great Yarmouth MP Rupert Lowe. The allegations against him are serious, numerous and have triggered three possible investigations – from the party, the parliamentary authorities and the police. His rebuttal is equally robust, indicating he will fight hard to clear his name.\n But is this battle just about his behaviour? Or is it because of his leadership ambitions? And were they ignited after a bizarre intervention from across the pond? In January, Musk posted on X, calling for Farage to step down, saying he wasn't up to the job, and later suggested Lowe could step up as he 'makes a lot of sense'. Two months later and relations had broken down beyond repair, with a war of words erupting this week in the papers, in which Lowe called Farage messianic and he responded saying the MP probably wanted to be prime minister. There is no doubt that an endorsement from the world's richest man would flatter the ego of any aspiring politician. But given Friday's revelations, it seems that instead of kick-starting his rise to the top of Reform, Musk's meddling has instead severed his ties with the party for good. When it comes to his parliamentary career, salvaging his reputation could also prove difficult as other critical accounts of his character emerge. Sky News has heard from Labour MP Mike Kane about an incident which took place in the Commons last December, during which he says he was \"manhandled\" by the then Reform MP. The Transport minister described an angry scene in which Lowe had to be restrained by Reform's deputy leader, Richard Tice, and eventually broken up by the Sergeant at Arms. Mr Lowe did not wish to comment on the claim, but it adds yet another obstacle in the fight for his political future. 'Vexatious' complaint  Mr Lowe continued: \"It is no surprise that this vexatious statement has been issued the day after my reasonable and constructive questions of Nigel and the Reform structure. It was issued on X late on a Friday afternoon, with no prior warning. \"All I stated was that communication needs to improve, delegation needs to improve, structure needs to improve - these are all reasonable requests of a party looking to form the next government. I stand by everything I said.\" His response added: \"I do not believe that Reform members will be pleased to know that their membership fees are being spent on instructing expensive lawyers to investigate their own MPs, over matters that are entirely baseless and have been dealt with in the correct Parliamentary procedure, with HR's full involvement and support. \"The staff member in question only raised a vexatious complaint once disciplinary proceedings had been initiated against them for serious wrongdoing. The other individual mentioned, dropped her appeal.\" Read more:Other Reform MP jailed for kicking girlfriendParty seen as stronger than Tories 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Mr Lowe said he had been trying to change the way Reform is run \"behind the scenes\" for many months, and urged his supporters to \"stay with the party\". He said: \"This is our party as much as it is Nigel's.\" A Metropolitan Police spokesperson said: \"On Thursday, 6 March we received an allegation of verbal threats made by a 67-year-old man on Friday, 13 December. \"Officers are carrying out an assessment of the allegations to determine what further action may be required.\""
    },
    {
        "title": "Who were the targets of Russian spy ring dubbed 'the Minions'?",
        "description": "Six Bulgarians have been convicted of being part of a spy ring which carried out surveillance in the UK and across Europe for Russia.",
        "url": "https://news.sky.com/story/the-operations-carried-out-by-russian-spy-ring-dubbed-the-minions-13323509",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-katrin-ivanova-tihomir-ivanchev_6849259.png?20250307175120",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-07 15:23:00",
        "Headline": "The group were involved in gathering information about prominent individuals but also plotted to kidnap journalists who were critical of the Kremlin, and spied on who they believed were Ukrainian soldiers training at a US base in Germany.",
        "Content": " Six Bulgarians have been convicted of being part of a spy ring which carried out surveillance in the UK and across Europe for Russia. Following a three-month trial in London, two women and a man - Katrin Ivanova, Vanya Gaberova, and Tihomir Ivanchev - were found guilty of their involvement in the sophisticated network headquartered at a former guesthouse in Great Yarmouth, Norfolk. Three other men - Orlin Roussev, Bizer Dzhambazov, and Ivan Stoyanov - admitted the charges before the Old Bailey trial started. The Crown Prosecution Service said each person played a role in a variety of operations across Europe on behalf of the Russian state. Not all of the team were involved in all of the missions, but each individual played a role in at least two.  Here's what we know about the spy ring, nicknamed \"the Minions\", an apparent reference to the yellow characters in Despicable Me, and their operations: Operation one: Kidnap plot against Salisbury attack journalist Christo Grozev, a Bulgarian investigative journalist, was targeted by the group on a number of occasions from December 2020 until January 2023. \n                  Three people guilty of spying for Russia from Great Yarmouth seaside guesthouse\n                 \n                  Inflatable boats, rubber rings and engines seized in Bulgaria before reaching people smugglers\n                 \n                  Man 'dies on board' Jet2 flight to Liverpool as plane makes emergency landing\n                 Mr Grozev worked for the Bellingcat group and as the lead investigator on Russian affairs, he won awards for his work, including uncovering Russian links to the 2018 Salisbury attack, in which former Russian spy Sergei Skripal and his daughter were poisoned with the nerve agent novichok.  As a result of Mr Grozev's activities, he was placed on the wanted list by the Russian Interior Ministry. Mr Grozev was followed to different countries, including Austria, Montenegro and Spain. The spy ring created a number of reports for their Russian clients which set out his movements and provided information about his accommodation, vehicle and contacts. The group also considered a potential 'honeytrap' plot, robbing and killing him, or kidnapping him and taking him to Russia. Operation two: Plan to smuggle Russian out of UK by boat Roman Dobrokhotov, a Russian who lives in the UK, was targeted in November 2022. He is an investigative journalist and founder of the media outlet The Insider, which focuses on Russia and was previously based in the country. Mr Dobrokhotov fled Russia, having been arrested and then deprived of his passport. The surveillance included following him around Europe, with one member of the spy ring, Ivanova, sitting next to him on a flight from Budapest to Berlin. The group plotted to kidnap the journalist and smuggle him out of UK by boat, but messages revealed that it was deemed too dangerous.  Operation three: Staking out former Kazakhstan politician Bergey Ryskaliyev was targeted in November 2021 after seeking asylum in the UK. The surveillance included staking out locations thought to be linked to the former Kazakhstan politician and exploring ways of accessing those addresses. One member of the spy ring, Stoyanov, was filmed by two of Mr Ryskaliyev's assistants as they conducted surveillance in a parked car outside the Kazakh's residence in London. When challenged by the assistants, Stoyanov provided a cover story about working for a nearby hospital, even displaying an NHS sign in his vehicle. Read more from Sky News:Russia rejects British troops in UkraineEx-soldier jailed for spying for IranRussia expels British diplomats for 'spying' Operation four: Fake pig's blood at Kazakhstan embassy The group plotted to create a false opposition group and stage a demonstration outside the Kazakhstan embassy in September 2022. One stunt included planning to spray the building with large quantities of fake pig's blood. The intention was to feed false 'intelligence' about the group to the Kazakh Intelligence Services, via their Russian counterparts. The aim was to benefit Russia's standing in the eyes of the Kazakhs. Operation five: Ukraine forces targeted at US military base Surveillance at a US military base in Stuttgart, Germany, was carried out from late 2022 until the group's arrests in February 2023. They believed Ukrainian forces were being trained at the base to use surface-to-air weapons. The plan was to use a range of sophisticated technology designed to capture key intelligence about Ukrainian military personnel and trace them when they returned to Ukraine. Surveillance images, videos and descriptions of the base were seized from devices. A car which was recovered had been adapted to house and deploy technical surveillance devices outside the base. Operation six: Kidnap plot targeting Russian Kirill Kachur was employed by the Investigative Committee of Russia (roughly equivalent to the UK's National Crime Agency) but left the country in 2021 and was charged in his absence with embezzlement, making him an obvious source of interest for Russia.   Kachur, who spent time in Montenegro, was targeted from September 2021 to 2022. Surveillance included the use of drones and a kidnapping plot was discussed. The spy ring rented a villa near Mr Kachur's location for €5,000 (£4,200) a month, and the group liaised directly with officers of the Russian Intelligence Service on the ground. Spies each face up to 14 years in prison Ivanova, 33, Gaberova, 30, and Ivanchev, 39, were convicted on Friday of plotting to spy for an enemy state. They face up to 14 years in prison when they are sentenced in May. Ringleader Roussev, 47, Dzhambazov, 43, and Stoyanov, 32, previously pleaded guilty to spying offences.  Roussev was said to be directed by alleged Russian agent Jan Marsalek, an Austrian national wanted by Interpol after the 2020 collapse of German payment processing firm Wirecard. His whereabouts are unknown."
    },
    {
        "title": "Rhianan Rudd inquest: MI5 investigation of groomed teen accused of terrorism continued up until her death",
        "description": "A member of MI5, who leads counterterrorism teams, has told an inquest how the security service continued to investigate Rhianan Rudd until her suicide in a care home, aged 16.",
        "url": "https://news.sky.com/story/rhianan-rudd-inquest-mi5-investigation-of-groomed-teen-accused-of-terrorism-continued-up-until-her-death-13323633",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-rhianan-rudd-inquest_6841724.jpg?20250227195523",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-03-07 18:49:00",
        "Headline": "Rhianan Rudd, 16, took her own life while living in a care home. She had been groomed and sexually exploited online by a white supremacist in America, and an inquest previously heard she was \"obsessed\" with Adolf Hitler.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n A member of MI5, who leads counterterrorism teams, has told an inquest how the security service continued to investigate Rhianan Rudd until her suicide in a care home, aged 16. The man, referred to in court as 'Witness A', appeared behind a blue curtain and could not be seen by anyone in the courtroom as he addressed the inquest today. He said it was necessary to investigate the teenager \"to assess the risk she posed to national security\". He told the court MI5's caseloads involved a growing number of minors who have been radicalised online, and discussed the complexities of trying to assess the difference between online \"bravado\" and someone taking \"concrete steps\" towards committing a terrorist attack. Rhianan, from Bolsover in the East Midlands, was an autistic teenager who had been groomed and sexually exploited online by a white supremacist in America. She became obsessed with Hitler, told her mum she wanted to blow up a synagogue, and had downloaded information on bomb making. Her mother referred her to deradicalisation programme Prevent in September 2020, but anti-terrorism police later arrested and charged Rhianan with terrorism offences, and she was put into care. The police investigation was dropped after Rhianan was assessed by the Home Office as a victim of modern slavery. Five months later, in May 2022, the 16-year-old took her own life at Bluebell House Residential Home in Nottinghamshire. She was found with a ligature around her neck. Her mother, Emily Carter, believes the pressure of the investigation had taken its toll. An inquest at Chesterfield Town Hall has been examining how police and social services balanced the challenges of a young girl who was both a potential danger to herself and the public. The coroner and legal teams today came to London to hear evidence from MI5. Witness A, who had worked at MI5 for 35 years, said it was known from the outset that Rhianan had self-harmed and was vulnerable. But he added: \"She appeared to have a violent right-wing extremist mindset, she showed some intent as a result of being radicalised online. \"Investigating her was the only way of understanding the threat she might pose to national security.\" Rhianan had to come off the Prevent programme while under investigation, and Witness A talked of Joint Operation Team (JOT) meetings between MI5 and Anti-Terrorism Police discussing the balance between safeguarding and investigating her. In an email, an MI5 investigating officer said they would be \"grateful for national guidance for handling such a case\". MI5 seeing 'growing rise' of casework on children Witness A said the service was \"seeing a growth of minors in our casework\" and that there had been \"a period of significant change to the sort of work we were seeing\". He told the court: \"None of us joined MI5 to investigate children. It does not sit comfortably with any of us. It's becoming a necessary requirement.\" Charging Rhianan helped with safeguarding, he argued, as her bail conditions restricted her access to the internet. After police charges were dropped, she remained a concern to the security services. The inquest heard that during a meeting in April 2022, the month before Rhianan's death, police updated MI5 and said she had recently started speaking with a German accent and dressed in camouflage on Adolf Hitler's birthday. An officer in a MI5 department known as the behavioural science unit (BSU) reported that \"Rhianan is an individual who is both vulnerable and risky at the same time\". \"Rhianan maybe in a situation where her vulnerabilities are exploited by an individual and she therefore becomes an increased risk,\" they added. More from Sky News:Reform MP reported to policeThree guilty of spying for Russia in the UK  In her case, the individual was a neo-Nazi called Chris Cook. The inquest heard how MI5 contacted the FBI in December 2020, which later provided all known communication between Rhianan and Cook. MI5 was told he had a \"personal relationship\" with Rhianan, then aged 14, and communicated with her on WhatsApp, including sending links to \"racially motivated, violent extremist books.\" Witness A said the internet had \"lowered the barriers of engagement\" allowing vulnerable people like Rhianan to meet with radical individuals. The inquest continues. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Millwall goalkeeper Liam Roberts banned for six matches after high challenge on Crystal Palace striker Jean-Philippe Mateta in FA Cup tie",
        "description": "Millwall goalkeeper Liam Roberts has been banned for six matches after his foul on Jean-Philippe Mateta which left the Crystal Palace forward needing 25 stitches in his left ear.",
        "url": "https://news.sky.com/story/millwall-goalkeeper-liam-roberts-banned-for-six-matches-after-high-challenge-on-crystal-palace-striker-jean-philippe-mateta-in-fa-cup-tie-13323710",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-crystal-palace-millwall_6843331.jpg?20250307220619",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-07 19:48:00",
        "Headline": "Mateta was stretchered off and taken to hospital where he was given 25 stitches following the clash, prompting the FA to ask for a longer ban as the standard three-game suspension was \"clearly insufficient\".",
        "Content": "Millwall goalkeeper Liam Roberts has been banned for six matches after his foul on Jean-Philippe Mateta which left the Crystal Palace forward needing 25 stitches in his left ear. Mateta was stretchered off and taken to hospital following the challenge in last Saturday's FA Cup fifth-round tie between the south London rivals at Selhurst Park. Roberts' high boot caused lacerations to Mateta's ear after the pair battled for the ball early in the Premier League side's 3-1 win. Crystal Palace chairman Steve Parish called the incident \"the most reckless\" tackle he had ever seen on a football pitch. An independent regulatory panel handed Roberts a six-match suspension, the FA said on Friday. It came after the governing body had sought a longer ban as a standard three-game ban was \"clearly insufficient\" for the offence. The Lions' goalkeeper immediately said he accepted the sanction in a statement on his club's website. \n                  Premier League veteran Ashley Young could face son Tyler in FA Cup clash\n                 \n                  Sunderland apologises to fans after stadium bar decorated in Newcastle colours ahead of FA Cup tie\n                 Roberts 'devastated' \"I am devastated by what happened. I unequivocally accept the red card as awarded and accept my punishment,\" he said. \"Furthermore, it has been extremely unpleasant to observe suggestions that I intended to harm a fellow professional. I have categorically never stepped on to a football pitch with the intention of hurting anyone. \"Misleading articles and comments have resulted in an unthinkable amount of abusive messages and threats towards my family and I. \"To the footballing community who know me and reached out with support through this tough time, thank you, I appreciate every single message.\" Millwall said they were disappointed with the outcome but respected the process that had been undertaken. The FA said the regulatory panel's written reasons for increasing the ban to six matches would be published in due course. Read more on Sky News:Three guilty of spying for RussiaOlympic snowboarder on FBI listSpaceX rocket explodes during test Mateta, who left hospital the same evening, was recovering well but will miss Saturday's Premier League match against Ipswich, Palace head coach Oliver Glasner said on Friday. \"He had no fractures or concussion. Healing from the huge wound is going as we expected,\" Glasner said, adding he hoped the Frenchman would be available to face Fulham in the quarter-finals later this month. Referee Michael Oliver initially issued only a yellow card to Roberts, but dismissed him after the VAR recommended a review."
    },
    {
        "title": "Post Office scandal: Fujitsu agrees to talks about contributing to victims' compensation",
        "description": "Fujitsu has agreed to begin talks with the UK government on contributing to compensation for victims of the Post Office scandal.",
        "url": "https://news.sky.com/story/post-office-scandal-fujitsu-agrees-to-talks-about-contributing-to-victims-compensation-13323562",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-bracknell-fujitsu-post-office_6424658.jpg?20240117141405",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2025-03-07 17:08:00",
        "Headline": "Fujitsu developed the faulty Horizon computer system responsible for erroneous shortfalls in accounting and supported the Post Office in its prosecutions.",
        "Content": "\n          Business correspondent\n              @SkyNewsAdele\n Fujitsu has agreed to begin talks with the UK government on contributing to compensation for victims of the Post Office scandal. Hundreds of sub-postmasters were falsely accused of stealing from their branches between 1999 and 2015. Fujitsu developed the faulty Horizon computer system responsible for erroneous shortfalls in accounting which led to wrongful convictions. They also supported the Post Office in its prosecutions. More than a year ago, Fujitsu boss Paul Patterson said the company had a \"moral obligation\" to contribute towards redress for victims. Business secretary Jonathan Reynolds and Mr Patterson today held a \"positive and constructive\" meeting in Japan - where Fujitsu agreed to begin talks on compensation. The UK government \"welcomes Fujitsu's repeated commitment to its moral obligation to contribute\" towards compensation for the Horizon scandal victims, a joint statement said. Ahead of the completion of the inquiry into the scandal, the pair \"agreed to progress discussions regarding Fujitsu's contribution, acknowledging many parties are involved,\" it added. \n                  Post Office scandal victim died days before compensation letter arrived - as widow says offer an 'utter disgrace'\n                 \n                  Post Office chair warns postmasters on pay uplift amid Whitehall funding talks\n                 \n                  Victims of second Post Office scandal criticise 'grinding wheels of bureaucracy' as they try to get compensation\n                 Officials will \"continue to engage with Fujitsu\", but the UK government will not be making a \"running commentary\" on discussions, the statement said. It also said the government is \"grateful\" for Fujitsu's engagement with the Post Office inquiry \"and its continued focus on delivering its public services commitments in the UK\". 'Utter disgrace' It comes as the widow of a Post Office scandal victim, who received a compensation offer days after his death, described her situation as an \"utter disgrace\". Janet Walters, 68, lost her husband Terry in February - a week before a letter arrived offering \"less than half\" of his original claim for financial redress.  Terry Walters was one of 555 sub-postmasters who won a legal battle against the Post Office in 2019. Janet described the length of time many victims have had to wait for an offer of compensation as another \"scandal\". \"I've told them I will not accept [the offer],\" Janet told Sky News. \"I think it's an utter disgrace. \"It's a scandal what they did with the Horizon system, it's a scandal now because of the length of time it's taken [on redress].\" Thousands waiting for compensation New figures show more than £768m has been now paid to more than 5,100 victims across all redress schemes. The Department for Business and Trade said this was a \"more than tripling\" of the total amount of redress paid since June 2024. Read more:Sub-postmasters still going through hell, says Alan BatesSecond Post Office IT scandal expands There are, however, still hundreds waiting for compensation in the GLO (Group Litigation Order) scheme, with more than 200 yet to receive full redress. There are also more than 4,000 yet to be paid in the Horizon Shortfall Scheme (HSS), although since last month, over 700 have received compensation.  In a separate statement after the meeting in Japan, Mr Reynolds said: \"We must never forget the lives ruined by the Horizon scandal and no amount of redress can take away that pain. But justice can and must be done. \"This government is determined to hold those responsible to account and will continue to make rapid progress on compensation and redress. \"Since we took office, we have more than tripled the total amount of redress paid to victims, and today we took another significant step towards justice.\""
    },
    {
        "title": "WWII bomb defused after forcing rail shutdown and Eurostar chaos in London and Paris",
        "description": "Eurostar services are expected to resume between London and Paris on Saturday after the discovery of an \"excessively dangerous\"&#160;unexploded Second World War bomb.",
        "url": "https://news.sky.com/story/all-eurostar-trains-to-london-cancelled-after-unexploded-wwii-bomb-found-13323152",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-eurostar-crowd-paris_6848689.jpg?20250307075312",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-07 06:07:00",
        "Headline": "All 32 trains scheduled to run between London and Paris on Friday have been cancelled, wrecking travel plans for thousands of passengers. But extra services have been added to Saturday's timetable.",
        "Content": "Eurostar services are expected to resume between London and Paris on Saturday after the discovery of an \"excessively dangerous\" unexploded Second World War bomb. The cross-Channel operator halted services on Friday morning, causing major disruption for thousands of passengers. All 32 trains scheduled to run between London and Paris were cancelled, with services suspended for the rest of the day. After moving the bomb into a hole, disposal experts managed to unscrew and then destroy its fuse, \"like you see in the movies,\" said Christophe Pezron, who heads the Paris department responsible for bomb disposal. He said that the British-made bomb, weighing 453kg, could have caused major damage had it exploded after workers inadvertently dug it up near train tracks in northern Paris. Pictures from Paris's Gare du Nord showed large queues of stranded travellers, while a large crowd of people gathered outside the check-in area at London St Pancras. Eurostar has said it expects to run a normal service between Paris and London and Paris and Brussels on Saturday. The company said it will run two extra trains - one leaving London to Paris in the morning, the other from Paris to London in the afternoon. Meanwhile, local train services in Paris have resumed and a major highway has reopened following the completion of the disposal operation. The bomb was discovered two metres underground during construction work on a bridge in the Saint-Denis area of the city in the early hours of the morning. French transport minister Philippe Tabarot said \"the whole northern part of our country was paralysed\" in the ensuing disruption, with almost 500 trains cancelled and 600,000 people in Gare du Nord affected. Police in Paris described the bomb as \"excessively dangerous\" while Mr Pezron said: \"It's the fourth one we've found in this area since 2019.\" The disruption spread to the French capital's road network as bomb disposal teams worked at the site. Police evacuated 200 people, including local schools, near a security perimeter set up around the bomb. Other residents in the area were asked to stay indoors. First and Second World War bombs are regularly discovered around France but very rarely in such a densely populated area. Official figures show that disposal teams have defused 700,000 air-dropped bombs and made safe nearly 50 million mines, shells and other explosive devices in France since the end of the Second World War. Read more from Sky News:SpaceX rocket explodes during testUK's Eurovision act for 2025 announced Eurostar said in a statement it \"sincerely apologises for the disruption and understands the inconvenience this may cause\". Earlier, France's national train operator SNCF said services were suspended at the request of the police and asked \"travellers to postpone their trip\". Trains to northern France were also brought to a halt from Gare du Nord, which is a major European transport hub and considered the world's busiest railway station outside of Japan. Fridays are the busiest day of the week for Eurostar, as many holidaymakers embark on international weekend breaks. Plans thrown into doubt Lee Bailey told Sky News he arrived at Gare du Nord to find hundreds of people waiting before being told of the unexploded bomb. \"It's a new one for me,\" he said, adding the staff were \"extremely professional\" and that Eurostar had offered him free rebooking or a refund, and an apology, but no compensation. \"I'd like to go to a Michelin (starred) restaurant in Paris on their dime, but that's not happening, apparently,\" he said. At St Pancras, Emma Roe, part of a group of eight friends, said they were looking up flights to go \"maybe to Amsterdam from Luton, just somewhere else\". Lauren Romeo-Smith, part of a group planning to travel for a weekend away to celebrate a birthday, said: \"We're looking up flights, but our options are limited.\" Eurostar said affected passengers can exchange their tickets for free to travel at a different time or date in the same travel class. Trains between London and Brussels are unaffected."
    },
    {
        "title": "Police watchdog reopens probe into Nottingham killer Valdo Calocane",
        "description": "The Independent Office for Police Conduct (IOPC) is reopening its investigation into the actions of Leicestershire Police after allegations of assault by Nottingham triple killer Valdo Calocane on two co-workers.",
        "url": "https://news.sky.com/story/police-watchdog-reopens-probe-into-nottingham-killer-after-representations-from-victims-families-13323511",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-calocane-nottingham_6768206.jpg?20241206113512",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-07 15:29:00",
        "Headline": "Valdo Calocane was reported to have pushed a woman over and punched a man in the face in May 2023 - a month before he killed Ian Coates, Grace O'Malley-Kumar and Barnaby Webber in Nottingham. ",
        "Content": "The Independent Office for Police Conduct (IOPC) is reopening its investigation into the actions of Leicestershire Police after allegations of assault by Nottingham triple killer Valdo Calocane on two co-workers. The incident took place in May 2023, a month before Calocane killed Ian Coates, Grace O'Malley-Kumar and Barnaby Webber in Nottingham on 13 June. The police watchdog previously prepared a report which said officers failed to properly investigate the allegation Calocane assaulted two warehouse workers. As a result, three officers were due to face misconduct meetings, which the force postponed, it said. The investigation is now being reopened, as the force has provided new evidence that had not previously been available to the IOPC. It will now re-examine whether Calocane's previous history, and an outstanding arrest warrant, were seen by officers before the assault investigation was closed. IOPC director Derrick Campbell said: \"Those who are closely impacted by our decision, including the bereaved families and the officers involved, have been notified and we will complete this work as quickly as possible. \"Any decision on the disciplinary outcome of our investigation will only be made once the new evidence and the results of these inquiries have been analysed.\" The watchdog's director has offered to meet with the families of the three people killed by Calocane, he added. Calocane was reported to have pushed a woman over and punched a man in the face in Kegworth, Leicestershire, on 5 May 2023 - a month before he killed his victims during a knife rampage in Nottingham. Victims' families 'welcome' decision - but have 'little faith'  The families of Miss O'Malley-Kumar, Mr Webber and Mr Coates have \"welcomed\" the decision to reopen the investigation. Speaking on their behalf, solicitor Neil Hudgell said: \"We have repeatedly raised serious concerns over a lack of thoroughness, which in our view made this investigation insufficient and incomplete. \"Any other outcome than what has been announced today would have been perverse. \"Sadly, it is another example of how the victims' families and their legal team are having to fight every step of the way for what they want. \"All they want is a complete and thorough investigation, full transparency and, ultimately, accountability.\"  The families have asked lawyers to request for a new team at the police watchdog to take over the reopened investigation. \"They have little or no faith in the quality of the current members of IOPC personnel managing this investigation,\" Mr Hudgell said. Mr Webber and Ms O'Malley-Kumar, both 19, and 65-year-old caretaker Mr Coates were killed by Calocane before he attempted to kill three others in the city in June 2023. He was handed an indefinite hospital order for the manslaughter by reason of diminished responsibility for their deaths and the attempted murders of three others. Prosecutors had accepted a plea after experts said Calocane's schizophrenia meant he was not fully responsible for his actions. More from Sky News:Unexploded WWII bomb causes Eurostar chaosThree guilty of spying for Russia from seaside town  In May last year, a judge ruled the sentence was not unduly lenient. The families of the victims recently he had \"got away with murder\". Sir Keir Starmer has promised the families there will be a judge-led inquiry into the attack. The NHS is also set to investigate allegations staff \"inappropriately\" accessed the victims' medical records."
    },
    {
        "title": "Just Stop Oil co-founder Roger Hallam has sentence reduced as 10 activists lose appeal",
        "description": "Just Stop Oil co-founder Roger Hallam has had his prison sentence reduced by a year after a High Court appeal. ",
        "url": "https://news.sky.com/story/just-stop-oil-protesters-win-appeal-sentence-cut-from-five-to-four-years-13323257",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-just-stop-oil-protest_6848857.jpg?20250307105009",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-07 09:45:00",
        "Headline": "He was part of a group of 16 activists involved in the challenge - 10 had their appeals dismissed.",
        "Content": "Just Stop Oil co-founder Roger Hallam has had his prison sentence reduced by a year after a High Court appeal.  He was among a group of 16 activists who challenged jail terms of between 15 months and five years for their roles in four demonstrations between August and November 2022. Ten of them had their appeals dismissed. Hallam was jailed for five years last July over a plot to disrupt M25 traffic, which saw 45 people climbing on to gantries over the motorway. His sentence was reduced to four years on appeal. Daniel Shaw, Louise Lancaster, Lucia Whittaker De Abreu, and Cressida Gethin each received four-year jail terms for their involvement in the same protest, which caused four days of disruption. Shaw and Lancaster's sentences were reduced to three years, while Whittaker De Abreu and Gethin's sentences were reduced to 30 months. \n                  Just Stop Oil protesters appeal against jail terms | Watch live as Court of Appeal delivers judgment \n                 \n                  Suffragette's great-granddaughter says climate protest sentences were 'disproportionate'\n                 \n                  Just Stop Oil protesters disrupt The Tempest starring Sigourney Weaver\n                 Gaie Delap, who was previously jailed for 20 months for her role in protests on the M25 had her sentence reduced to one of 18 months. Her co-defendants, George Simonson, Theresa Higginson, Paul Bell and Paul Sousek, who were imprisoned for between two years and 20 months, had their appeals dismissed, along with six others involved in different protests. They included Dr Larch Maxey, Chris Bennett, Samuel Johnson and Joe Howlett were jailed for between three years and 15 months after occupying tunnels dug under the road leading to the Navigator Oil Terminal in Thurrock, Essex. The Court of Appeal also threw out challenges from Phoebe Plummer and Anna Holland were sentenced to two years and 20 months respectively after almost \"destroying\" Vincent van Gogh's Sunflowers by throwing soup on its protective glass at London's National Gallery. Lawyers for the group of 16 told the court last month the sentences were \"manifestly excessive\", breached the activists' human rights, and should have taken into account their \"conscientious motivation\". Read more from Sky News:Eurostar trains suspended after WWII bomb foundFormer Liverpool mayor Joe Anderson charged with bribery The Crown Prosecution Service opposed the appeal, arguing \"deterrence is required in order to protect the public\". As the Lady Chief Justice Baroness Carr read out a summary of the Court of Appeal's ruling, several campaigners in court stood and turned their backs, wearing T-shirts that read \"Corruption in Court\". The sentences of Hallam and his four co-defendants were thought to have been the longest ever relating to peaceful protest. During the trial at Southwark Crown Court, prosecutors alleged the M25 protests led to an economic cost of at least £765,000 while the cost to the Metropolitan Police was more than £1.1m. They also allegedly caused more than 50,000 hours of vehicle delay, affecting more than 700,000 vehicles, and left the M25 \"compromised\" for more than 120 hours. Raj Chada, head of criminal defence at law firm Hodge Jones & Allen, which represents the other protesters, said: \"The small reduction in the case of Roger Hallam recognises the extraordinarily excessive sentences that continue to be given out to protesters in England. \"It is, however, extremely disappointing that many of the other sentences were upheld. \"No country in Europe gives such draconian sentences for peaceful protests, proving we are out of kilter with the rest of the civilised world. \"We are reviewing the judgment and considering an appeal to the Supreme Court.\""
    },
    {
        "title": "Police charge former Liverpool mayor Joe Anderson and ex-deputy council leader Derek Hatton with bribery",
        "description": "Former Liverpool mayor Joe Anderson and former deputy council leader Derek Hatton are among 12 people who have been charged as part of an investigation into council corruption.",
        "url": "https://news.sky.com/story/former-liverpool-mayor-joe-anderson-among-12-charged-with-bribery-and-misconduct-13323204",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-joe-anderson-derek-hatton_6848992.jpg?20250307131154",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-03-07 08:24:00",
        "Headline": "Left-wing firebrand Derek 'degsy' Hatton was a member of the Militant tendency that infiltrated Labour in the 1970s and 1980s.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Former Liverpool mayor Joe Anderson and former deputy council leader Derek Hatton are among 12 people who have been charged as part of an investigation into council corruption. Anderson, 67, who was first arrested in December 2020, has been charged with bribery, misconduct in a public office and conspiracy to commit misconduct in a public office, Merseyside Police said on Friday. Politics live: Defence spending boost 'not a one-off thing' Hatton, 77, who was deputy leader in the 1980s and a known militant figure on the Labour left, has been charged with bribery and one count of counsel or procure misconduct in a public office. Anderson's son David Anderson, 37, of Wavertree, is charged with conspiracy to commit misconduct in a public office. The charges are part of a long-running investigation known as Operation Aloft, which was launched by police to look into the awarding of commercial and business contracts from Liverpool City Council between 2010 and 2020. Other people charged include the former assistant director of highways and planning and the former head of regeneration. \n                  Reform UK MP Rupert Lowe reported to police over alleged threats towards party chairman\n                 \n                  Rupert Lowe: Reform UK MP reported to police for alleged bullying\n                 \n                  Politics latest: Donald Trump told to expect 'loud' protests during UK visit\n                 The full charges are: A spokesman for Merseyside Police said all 12 were due to appear at Preston Magistrates' Court on 28 March. Joe Anderson served as the first directly elected Labour Mayor of Liverpool from 2012 to 2021. He was suspended by the party following his arrest in 2020 and did not stand for re-election the following year. Derek \"Desgsy\" Hatton was a firebrand member of the Militant tendency that infiltrated Labour in the 1970s and 1980s. He was expelled from the party in 1986 as part of a purge of the hard-left under Neil Kinnock's leadership. Under the Trotskyist group's direction, Liverpool City Council set an illegal budget in 1985 - spending more than its income - in a stand against Margaret Thatcher's government. Robin Weyell, Deputy Chief Crown Prosecutor, said: \"The CPS has reviewed a full file of evidence from the Merseyside Police and has authorised the investigation team to charge 12 people with 12 offences related to bribery and misconduct in public office.\" He said criminal proceedings are now active and \"it is extremely important that there should be no reporting, commentary or sharing of information online which could in any way prejudice these proceedings\"."
    },
    {
        "title": "Gene Hackman's wife died from rare infectious disease around a week before actor's death, medical investigator says",
        "description": "Gene Hackman's wife died from a rare infectious disease around a week before the actor died, medical investigators have said.",
        "url": "https://news.sky.com/story/police-give-update-on-death-of-gene-hackman-and-wife-betsy-arakawa-13323478",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gene-hackman-wife-betsy-arakawa_6841105.jpg?20250228084053",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-07 20:55:00",
        "Headline": "Actor Gene Hackman had advanced Alzheimer's and \"it's quite possible he was not aware\" that his wife was deceased in their home, the chief medical investigator of New Mexico said today.",
        "Content": " Gene Hackman's wife died from a rare infectious disease around a week before the actor died, medical investigators have said. The couple were found dead in their New Mexico home on 26 February, along with one of their pet dogs. Police have previously said there were no apparent signs of foul play. At a press conference on Friday, chief medical investigator for New Mexico, doctor Heather Jarrell, gave an update on the results of post-mortem investigations carried out following their deaths. Doctor Jarrell said Hackman's wife, Betsy Arakawa, died from hantavirus pulmonary syndrome, a rare infectious disease. There were no signs of trauma and the death was a result of natural causes, she said. The doctor said Arakawa likely died on 11 February, the date she was last known to have communicated with people via email. She said Hackman had advanced Alzheimer's and died from heart disease, with data from his pacemaker last registering on 18 February. Due to his Alzheimer's, \"it's quite possible he was not aware that [his wife] was deceased,\" Dr Jarrell added. The actor tested negative for hantavirus, a rare disease spread by infected rodent droppings. Humans can contract hantavirus by breathing in contaminated air, and symptoms can start as soon as one week, or as long as eight weeks, later. It is not transmissible from person to person. There were just seven confirmed cases of hantavirus in New Mexico last year, and Arakawa is the only person confirmed to have contracted it in the state in 2025. Between 1975 and 2023, New Mexico recorded a total of 129 hantavirus cases, with 52 deaths. Santa Fe County sheriff Adan Mendoza said authorities are still waiting for data from mobile phones found at the property, but it is \"very unlikely they are going to show anything else\". \"There's no indication\" that Hackman used a mobile phone or any other technology to communicate and the couple lived a very private life before their deaths, he added.  The cause of the couple's dog's death has not been confirmed but it is now known that Arakawa had picked the animal up from the vet, where it had undergone a procedure, on 9 February. The procedure \"may explain why [the dog] was in a crate at the residence\" while two surviving dogs were found roaming the property, Mr Mendoza said. Hackman, who was widely respected as one of the greatest actors of his generation, was a five-time Oscar nominee who won the best actor in a leading role for The French Connection in 1972 and best actor in a supporting role for Unforgiven two decades later. More from Sky News:The Damned founding member diesKing Charles reveals his favourite music  At last Sunday's Academy Awards, Morgan Freeman paid tribute to Hackman. \"A community lost a giant and I lost a dear friend,\" he said. He met Arakawa, a concert pianist, in the mid-1980s and the pair married in 1991."
    },
    {
        "title": "Syria: 'Nearly 200 killed' in country's worst violence since Assad toppled",
        "description": "Almost 200 people have died in clashes between Syrian government forces and fighters loyal to the country's former president Bashar al Assad, a war monitoring group has said.",
        "url": "https://news.sky.com/story/syria-nearly-200-killed-in-countrys-worst-violence-since-assad-toppled-13323596",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-syria-latakia-ex-president-bashar-assad_6849249.jpg?20250307174814",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-07 17:48:00",
        "Headline": "Clashes in the coastal region loyal to Bashar al Assad have seen Syria's new government, which has promised to unite the country, send reinforcements after some of its forces were ambushed.",
        "Content": " Almost 200 people have died in clashes between Syrian government forces and fighters loyal to the country's former president Bashar al Assad, a war monitoring group has said. Fighters backing the new Damascus regime attacked three villages near the coast, killing dozens of men in retaliation for attacks on government security forces by Assad loyalists, the UK-based Syrian Observatory for Human Rights (SOHR) said on Friday. SOHR said the violence erupted on Thursday afternoon when pro-Assad militants ambushed Syrian security forces in the Latakia region, a former stronghold of the deposed leader where many of the minority Alawites, who made up his support base, live. The unrest, which continued on Friday, was the worst since Assad's government was ousted in December by rebels led by the Islamist group Hayat Tahrir al Sham. Overnight, Damascus sent reinforcements to the coastal cities of Latakia and Tartus and nearby villages. Violence began when government forces tried to detain a wanted person near the coastal city of Jableh and were attacked by Assad loyalists, SOHR said.  'They killed every man' \n                  What do hidden documents tell us about Syria's missing people?\n                 \n                  Syrian equestrian champion tells of prison ordeal lasting two decades after beating Bashar al Assad's brother  \n                 \n                  Moscow denies Asma al Assad seeks divorce - as reports suggest she wants UK return\n                 Gunmen loyal to the new government attacked the villages of Sheer, Mukhtariyeh, and Haffah near the coast, killing 69 men but harming no women, according to the observatory. SOHR chief Rami Abdurrahman said: \"They killed every man they encountered.\" More than 30 men were killed in the village of Mukhtariyeh alone, Beirut-based Al-Mayadeen TV said. In addition to those killed in the villages, the dead included at least 50 members of Syria's government forces and 45 fighters loyal to Mr Assad, SOHR said. An unnamed security official, quoted by Syria's state news agency SANA, said numerous people went to the coast seeking revenge for the recent attacks on government security forces, which led to \"some individual violations\" that they are trying to stop. Large numbers of government troops were seen on Friday morning in Latakia, where some minor clashes erupted, according to security forces. The city is under curfew, along with other coastal areas. Read more on Sky News:Russia 'has all the cards' - TrumpOlympic snowboarder among FBI's most wantedSpaceX rocket explodes during test Since the change of regime in the country, minority Alawites have been victims of some sectarian violence. Syria's interim president, Ahmed al-Sharaa, said on Friday his forces will pursue the \"remnants\" of the Assad regime and bring them to trial. The former insurgent and his administration have previously promised to stamp out sectarian attacks and unite Syria after 14 years of civil war in which more than half a million people have died and millions been displaced. Geir O Pedersen, the UN special envoy for Syria, called on all parties to \"refrain from actions that could further inflame tensions, escalate conflict, exacerbate the suffering of affected communities, destabilise Syria, and jeopardise a credible and inclusive political transition\"."
    },
    {
        "title": "Who were the targets of Russian spy ring dubbed 'the Minions'?",
        "description": "Six Bulgarians have been convicted of being part of a spy ring which carried out surveillance in the UK and across Europe for Russia.",
        "url": "https://news.sky.com/story/the-operations-carried-out-by-russian-spy-ring-dubbed-the-minions-13323509",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-katrin-ivanova-tihomir-ivanchev_6849259.png?20250307175120",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-07 15:23:00",
        "Headline": "The group were involved in gathering information about prominent individuals but also plotted to kidnap journalists who were critical of the Kremlin, and spied on who they believed were Ukrainian soldiers training at a US base in Germany.",
        "Content": " Six Bulgarians have been convicted of being part of a spy ring which carried out surveillance in the UK and across Europe for Russia. Following a three-month trial in London, two women and a man - Katrin Ivanova, Vanya Gaberova, and Tihomir Ivanchev - were found guilty of their involvement in the sophisticated network headquartered at a former guesthouse in Great Yarmouth, Norfolk. Three other men - Orlin Roussev, Bizer Dzhambazov, and Ivan Stoyanov - admitted the charges before the Old Bailey trial started. The Crown Prosecution Service said each person played a role in a variety of operations across Europe on behalf of the Russian state. Not all of the team were involved in all of the missions, but each individual played a role in at least two.  Here's what we know about the spy ring, nicknamed \"the Minions\", an apparent reference to the yellow characters in Despicable Me, and their operations: Operation one: Kidnap plot against Salisbury attack journalist Christo Grozev, a Bulgarian investigative journalist, was targeted by the group on a number of occasions from December 2020 until January 2023. \n                  Three people guilty of spying for Russia from Great Yarmouth seaside guesthouse\n                 \n                  Inflatable boats, rubber rings and engines seized in Bulgaria before reaching people smugglers\n                 \n                  Man 'dies on board' Jet2 flight to Liverpool as plane makes emergency landing\n                 Mr Grozev worked for the Bellingcat group and as the lead investigator on Russian affairs, he won awards for his work, including uncovering Russian links to the 2018 Salisbury attack, in which former Russian spy Sergei Skripal and his daughter were poisoned with the nerve agent novichok.  As a result of Mr Grozev's activities, he was placed on the wanted list by the Russian Interior Ministry. Mr Grozev was followed to different countries, including Austria, Montenegro and Spain. The spy ring created a number of reports for their Russian clients which set out his movements and provided information about his accommodation, vehicle and contacts. The group also considered a potential 'honeytrap' plot, robbing and killing him, or kidnapping him and taking him to Russia. Operation two: Plan to smuggle Russian out of UK by boat Roman Dobrokhotov, a Russian who lives in the UK, was targeted in November 2022. He is an investigative journalist and founder of the media outlet The Insider, which focuses on Russia and was previously based in the country. Mr Dobrokhotov fled Russia, having been arrested and then deprived of his passport. The surveillance included following him around Europe, with one member of the spy ring, Ivanova, sitting next to him on a flight from Budapest to Berlin. The group plotted to kidnap the journalist and smuggle him out of UK by boat, but messages revealed that it was deemed too dangerous.  Operation three: Staking out former Kazakhstan politician Bergey Ryskaliyev was targeted in November 2021 after seeking asylum in the UK. The surveillance included staking out locations thought to be linked to the former Kazakhstan politician and exploring ways of accessing those addresses. One member of the spy ring, Stoyanov, was filmed by two of Mr Ryskaliyev's assistants as they conducted surveillance in a parked car outside the Kazakh's residence in London. When challenged by the assistants, Stoyanov provided a cover story about working for a nearby hospital, even displaying an NHS sign in his vehicle. Read more from Sky News:Russia rejects British troops in UkraineEx-soldier jailed for spying for IranRussia expels British diplomats for 'spying' Operation four: Fake pig's blood at Kazakhstan embassy The group plotted to create a false opposition group and stage a demonstration outside the Kazakhstan embassy in September 2022. One stunt included planning to spray the building with large quantities of fake pig's blood. The intention was to feed false 'intelligence' about the group to the Kazakh Intelligence Services, via their Russian counterparts. The aim was to benefit Russia's standing in the eyes of the Kazakhs. Operation five: Ukraine forces targeted at US military base Surveillance at a US military base in Stuttgart, Germany, was carried out from late 2022 until the group's arrests in February 2023. They believed Ukrainian forces were being trained at the base to use surface-to-air weapons. The plan was to use a range of sophisticated technology designed to capture key intelligence about Ukrainian military personnel and trace them when they returned to Ukraine. Surveillance images, videos and descriptions of the base were seized from devices. A car which was recovered had been adapted to house and deploy technical surveillance devices outside the base. Operation six: Kidnap plot targeting Russian Kirill Kachur was employed by the Investigative Committee of Russia (roughly equivalent to the UK's National Crime Agency) but left the country in 2021 and was charged in his absence with embezzlement, making him an obvious source of interest for Russia.   Kachur, who spent time in Montenegro, was targeted from September 2021 to 2022. Surveillance included the use of drones and a kidnapping plot was discussed. The spy ring rented a villa near Mr Kachur's location for €5,000 (£4,200) a month, and the group liaised directly with officers of the Russian Intelligence Service on the ground. Spies each face up to 14 years in prison Ivanova, 33, Gaberova, 30, and Ivanchev, 39, were convicted on Friday of plotting to spy for an enemy state. They face up to 14 years in prison when they are sentenced in May. Ringleader Roussev, 47, Dzhambazov, 43, and Stoyanov, 32, previously pleaded guilty to spying offences.  Roussev was said to be directed by alleged Russian agent Jan Marsalek, an Austrian national wanted by Interpol after the 2020 collapse of German payment processing firm Wirecard. His whereabouts are unknown."
    },
    {
        "title": "Storm warning for life-threatening flash floods as Australians ordered to evacuate",
        "description": "Thousands of people have been ordered to evacuate their homes in eastern Australia ahead of the arrival of a powerful storm which risks \"dangerous and life-threatening flash flooding\".",
        "url": "https://news.sky.com/story/tropical-storm-alfredvery-rare-cyclone-bears-down-on-australia-as-thousands-ordered-to-evacuate-13323480",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-swells-gold-coast-australia_6847675.jpg?20250307225639",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-07 14:20:00",
        "Headline": "Tropical Cyclone Alfred has been downgraded but more than 250,00 homes and businesses have already lost power in Queensland and New South Wales, while at least 39 people have been rescued from flood waters.",
        "Content": "Thousands of people have been ordered to evacuate their homes in eastern Australia ahead of the arrival of a powerful storm which risks \"dangerous and life-threatening flash flooding\". Forecasters had predicted Tropical Cyclone Alfred would be the first to hit the area, north of Brisbane, in more than 50 years. But while its intensity has now weakened to a tropical low pressure system, more than 250,000 homes and businesses have already lost power in Queensland and New South Wales. More than 19,000 people have been evacuated from low-lying homes, one person is missing after being swept down a river, and at least 39 people have been rescued from flood waters.  Public transport and flights have also been suspended as the storm approaches with sustained winds near the centre of 55kph (34mph) and gusts of 85kph (52mph). It is due to make landfall on Saturday between Maroochydore, a coastal town in the Sunshine Coast region, and Bribie Island. Meteorologist Angus Hines from the government's weather agency, the Bureau of Meterology, said: \"The rain and the associated flooding... will continue to be very severe and ongoing through Friday and the weekend.\" \n                  Teenager charged after allegedly trying to enter a Jetstar plane with a gun\n                 \n                  Cyclone Alfred: What we know about rare storm nearing Australian coast\n                 \n                  Blood donor who saved the lives of 2.4 million babies dies\n                 He confirmed rainfall totals, for the last 12 hours, were more than 100mm through parts of New South Wales mid-north coast, and as high as 166mm in Meldrum. Despite Alfred weakening to a tropical low, it would continue to bring dangerous and life-threatening flash flooding \"particularly to inland parts of southern Queensland and north eastern New South Wales\", said Mr Hines. Prime Minister Anthony Albanese had been expected to call national elections on Sunday or Monday but has now ruled this out to focus on the response to the cyclone. Earlier on Friday, coastal regions were smashed by wind gusts of more than 100kph (62mph), despite the storm sitting around 200km (124 miles) offshore. Television footage showed surfers riding in the huge seas and people strolling near the beaches, forcing officials to warn residents to stay indoors or prepare to evacuate when asked. \"This isn't a time for sightseeing or for seeing what it's like to experience these conditions firsthand. Please stay safe. Be sensible,\" Mr Albanese said. Nearly 40 people rescued from flood waters In New South Wales, heavy rains lashed down and 39 people had been rescued from flood waters. One man remained missing after being swept down a river, officials in the state said. Flights have been cancelled from Sunshine Coast Airport, which is nearest the storm, along with Brisbane Airport that serves Australia's third-most populous city. Public transport in Brisbane has also been suspended. Officials had described Tropical Storm Alfred as a \"very rare event\" for Brisbane, Queensland's state capital, with the city last hit by a cyclone more than half a century ago in 1974. Discussing the delayed election announcement, Mr Albanese said: \"I have no intention of doing anything that distracts from what we need to do. And what we need to do is to look after each other at this difficult time.\" A national election must be held by mid-May, but had been expected to happen early so the government could avoid delivering a budget forecast that could show a deficit. \"It is our intention to serve a full term,\" Mr Albanese said in a television interview with the Australian Broadcasting Corporation. Warship rescues rower in peril Lithuanian rower Aurimas Mockus, 44, was rowing the 7,500 miles from San Diego, California, to Brisbane by himself when he became stranded in treacherous conditions generated by the storm last week.  As he rolled 30 times in his partially enclosed boat - in his own words, \"like a cat in a washing machine\" - an Australian warship battled 16-metre (52-foot) swells to rescue him on Monday. A relieved Mr Mockus told reporters in Sydney he thought he was going to die when he activated his emergency beacon on 28 February and waited three days to be rescued. \"I have a lot of problems in my body,\" he said. \"And then I think if I lost my mind, if I lost my belief, what I can fight for my life (with)?\""
    },
    {
        "title": "WWII bomb defused after forcing rail shutdown and Eurostar chaos in London and Paris",
        "description": "Eurostar services are expected to resume between London and Paris on Saturday after the discovery of an \"excessively dangerous\"&#160;unexploded Second World War bomb.",
        "url": "https://news.sky.com/story/all-eurostar-trains-to-london-cancelled-after-unexploded-wwii-bomb-found-13323152",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-eurostar-crowd-paris_6848689.jpg?20250307075312",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-07 06:07:00",
        "Headline": "All 32 trains scheduled to run between London and Paris on Friday have been cancelled, wrecking travel plans for thousands of passengers. But extra services have been added to Saturday's timetable.",
        "Content": "Eurostar services are expected to resume between London and Paris on Saturday after the discovery of an \"excessively dangerous\" unexploded Second World War bomb. The cross-Channel operator halted services on Friday morning, causing major disruption for thousands of passengers. All 32 trains scheduled to run between London and Paris were cancelled, with services suspended for the rest of the day. After moving the bomb into a hole, disposal experts managed to unscrew and then destroy its fuse, \"like you see in the movies,\" said Christophe Pezron, who heads the Paris department responsible for bomb disposal. He said that the British-made bomb, weighing 453kg, could have caused major damage had it exploded after workers inadvertently dug it up near train tracks in northern Paris. Pictures from Paris's Gare du Nord showed large queues of stranded travellers, while a large crowd of people gathered outside the check-in area at London St Pancras. Eurostar has said it expects to run a normal service between Paris and London and Paris and Brussels on Saturday. The company said it will run two extra trains - one leaving London to Paris in the morning, the other from Paris to London in the afternoon. Meanwhile, local train services in Paris have resumed and a major highway has reopened following the completion of the disposal operation. The bomb was discovered two metres underground during construction work on a bridge in the Saint-Denis area of the city in the early hours of the morning. French transport minister Philippe Tabarot said \"the whole northern part of our country was paralysed\" in the ensuing disruption, with almost 500 trains cancelled and 600,000 people in Gare du Nord affected. Police in Paris described the bomb as \"excessively dangerous\" while Mr Pezron said: \"It's the fourth one we've found in this area since 2019.\" The disruption spread to the French capital's road network as bomb disposal teams worked at the site. Police evacuated 200 people, including local schools, near a security perimeter set up around the bomb. Other residents in the area were asked to stay indoors. First and Second World War bombs are regularly discovered around France but very rarely in such a densely populated area. Official figures show that disposal teams have defused 700,000 air-dropped bombs and made safe nearly 50 million mines, shells and other explosive devices in France since the end of the Second World War. Read more from Sky News:SpaceX rocket explodes during testUK's Eurovision act for 2025 announced Eurostar said in a statement it \"sincerely apologises for the disruption and understands the inconvenience this may cause\". Earlier, France's national train operator SNCF said services were suspended at the request of the police and asked \"travellers to postpone their trip\". Trains to northern France were also brought to a halt from Gare du Nord, which is a major European transport hub and considered the world's busiest railway station outside of Japan. Fridays are the busiest day of the week for Eurostar, as many holidaymakers embark on international weekend breaks. Plans thrown into doubt Lee Bailey told Sky News he arrived at Gare du Nord to find hundreds of people waiting before being told of the unexploded bomb. \"It's a new one for me,\" he said, adding the staff were \"extremely professional\" and that Eurostar had offered him free rebooking or a refund, and an apology, but no compensation. \"I'd like to go to a Michelin (starred) restaurant in Paris on their dime, but that's not happening, apparently,\" he said. At St Pancras, Emma Roe, part of a group of eight friends, said they were looking up flights to go \"maybe to Amsterdam from Luton, just somewhere else\". Lauren Romeo-Smith, part of a group planning to travel for a weekend away to celebrate a birthday, said: \"We're looking up flights, but our options are limited.\" Eurostar said affected passengers can exchange their tickets for free to travel at a different time or date in the same travel class. Trains between London and Brussels are unaffected."
    },
    {
        "title": "Taiwan is one of the world's most important flashpoints - how Trump will deal with it remains uncertain",
        "description": "China's foreign minister Wang Yi has spoken out against US tariffs and accused it of \"meeting good with evil\".",
        "url": "https://news.sky.com/story/both-china-and-taiwan-are-uncertain-on-how-donald-trump-will-deal-with-one-of-the-worlds-most-important-flashpoints-13323140",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nicole-johnston-taiwan_6848610.jpg?20250307053302",
        "type": "World",
        "Author": "Nicole Johnston",
        "Date Published": "2025-03-07 06:40:00",
        "Headline": "These are unpredictable days, and as Chinese President Xi Jinping said, there could be \"rough seas\" ahead.",
        "Content": "\n          Asia correspondent\n              @nicole_reporter\n China's foreign minister Wang Yi has spoken out against US tariffs and accused it of \"meeting good with evil\". Speaking during a rare press conference in Beijing as part of the week long National People's Congress, Wang said that in the current geopolitical environment China wants to prevent a return to the \"law of the jungle\". He also addressed the status of the self-governed island of Taiwan and reiterated China's position that it is an \"inalienable part of China\" and any attempt to make it independent is \"doomed to fail\". What is still unclear is how US President Donald Trump will deal with the issue of Taiwan. Trump's tilt towards Russia and away from Ukraine has raised questions about the US' commitment to Taiwan in the event of a conflict. China insists that \"reunification\" with Taiwan is inevitable and says it will happen by force if necessary. Taiwan's government wants to maintain the status quo. Officially, the US acknowledges China's position while supplying the island with weapons to defend itself in the event of an attack. \n                  Ministers urged to act after Hong Kong activists' UK neighbours 'bribed' to hand them into Chinese embassy\n                 \n                  Are there signs that China is preparing for war?\n                 \n                  China's patience with Donald Trump is running out - as trade war rhetoric ramps up\n                 All this makes Taiwan one of the most important geopolitical flashpoints in the world. On both sides of the Taiwan Strait people have grown accustomed to the uncertainty and tension. Xiamen in southern China is only a couple of miles away from Taiwan's outlying island, Kinmen. We visited the small Chinese fishing village of Qiongtou to find out how this community sees the relationship between China and Taiwan. On a misty morning when only a few boats ventured out, Mrs Chen was waiting for her husband to return from sea. \"Taiwan is our national territory,\" Mrs Chen said. \"We are the powerful country, belonging to us is good for everyone. \"Taiwan will only have hope if it is part of our country.\" Last month, Taiwan seized a Chinese ship accusing it of cutting an undersea cable to the Island. Incidents like this highlight how hot this region can become. The question is, if it flares up, how will the US respond? So far there have been mixed messages. The US State Department recently revised its website of facts about Taiwan and removed the phrase \"we do not support Taiwan independence\". This drew a strong rebuke from China. Officially, the US policy towards Taiwan has not changed. However, with President Trump in the White House, there is no guarantee. Trump has said Taiwan should pay for its defence and accused it of stealing the US semiconductor industry. The US president clearly admires China's leader Xi Jinping and has praised him. For many Taiwanese these are troubling times. In the Chinese megacity of Wuhan, we met two Taiwanese university students, Guan Guan and Terry Tsai. They are studying in China and say they admire the country's efficiency, but value Taiwan's democracy. Guan Guan says: \"I want to live in a democratic place, but at the same time I envy the administrative efficiency of a one-party system, because I think the way they make decisions and start construction is much faster than in a democracy.\" Terry Tsai says the possibility of war over Taiwan is something he has been thinking about since he was a child. \"I wonder whether this day will come, what will Taiwan look [like], and how life in Taiwan will change,\" he says. Around the world geopolitical rifts are growing wider and there is a disquieting sense of unease. The relationship between the US, China and Russia is in a state of flux as all three countries jostle for supremacy. Read more:China 'ready for any type of war' with USNew Zealand fires UK envoy over Trump comments Qiongtou village is near one of the most contested waterways in the world. Here there is a rhythm to life, that centres around the sea. But these are unpredictable days, and as China's President Xi Jinping said, there could be \"rough seas\" ahead."
    },
    {
        "title": "Former Olympic snowboarder Ryan Wedding added to FBI's 10 most wanted list",
        "description": "A former Olympic snowboarder accused of running an international drug smuggling network behind four murders has been added to the FBI's list of 10 most wanted fugitives.",
        "url": "https://news.sky.com/story/former-olympic-snowboarder-ryan-wedding-added-to-fbis-10-most-wanted-list-13323461",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ryan-wedding-canada_6849037.jpg?20250307135518",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-07 13:54:00",
        "Headline": "The Canadian is accused of running an international drug smuggling operation behind four murders.",
        "Content": "A former Olympic snowboarder accused of running an international drug smuggling network behind four murders has been added to the FBI's list of 10 most wanted fugitives. A $10m (£7.7m) reward has been offered for information leading to the arrest of Ryan Wedding, 43, who competed for Canada in the giant slalom at the 2002 winter games. Wedding - whose aliases include \"El Jefe,\" \"Giant\" and \"Public Enemy\"- is accused of running a network that routinely shipped hundreds of kilograms of cocaine from Colombia through Mexico and Southern California, to Canada and other US locations. He is also suspected of orchestrating four murders and an attempted murder. \"Wedding went from shredding powder on the slopes at the Olympics to distributing powder cocaine on the streets of US cities and in his native Canada,\" said Akil Davis, the assistant director of the FBI's Los Angeles field office. \"The alleged murders of his competitors make Wedding a very dangerous man.\" Read more US news:Man chooses execution method not used for 15 yearsSpaceX rocket explodes during test \n                  Day 46: Why is Trump blindfolding Ukraine? \n                 \n                  Trump admits tariffs 'disturbance' as China says it is 'ready for any type of war' with US\n                 \n                  Justin Trudeau holds news conference on US tariffs\n                 Wedding was charged last year and an indictment in September alleged he and others arranged the shipment of some 60 tonnes of cocaine a year using long-haul trucks. The FBI said a dozen people had been arrested in connection with the case. US authorities allege the group killed two members of a family in Canada in retaliation for a stolen drug shipment in what officials there said was a case of mistaken identity, as well as two other people. \"The former Canadian snowboarder unleashed an avalanche of death and destruction, here and abroad,\" said special agent Matthew Allen. \"He earned the name 'El Jefe', becoming boss of a violent transnational drug trafficking organisation. \"Now, his face will be on 'The Top 10 Most Wanted' posters. He's unremitting, callous and greed-driven. \"Today's announcement beams an even brighter searchlight on him. We ask that you help us find him.\" Investigators believe Wedding is living in Mexico but have not ruled out that he could be in the US, Canada, Colombia, Honduras, Guatemala, Costa Rica, or elsewhere."
    },
    {
        "title": "Leaving Afghanistan, teen cricketer had to burn medals - now she wants right to play for country",
        "description": "Ahead of International Women's Day, I'm thinking about the millions of Afghan women and girls who continue to have their basic human rights denied.",
        "url": "https://news.sky.com/story/leaving-afghanistan-teen-cricketer-had-to-burn-medals-now-she-wants-right-to-play-for-country-13323128",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-afghanistan-cricket_6848596.jpg?20250307042908",
        "type": "World",
        "Author": "Yalda Hakim",
        "Date Published": "2025-03-07 03:20:00",
        "Headline": "In the three and a half years since the Taliban returned to power, the rights of Afghan women and girls have been savagely curtailed. Many fled, including twenty members of the Afghan women's cricket team.",
        "Content": "\n          Lead world news presenter\n              @SkyYaldaHakim\n  Ahead of International Women's Day, I'm thinking about the millions of Afghan women and girls who continue to have their basic human rights denied. Afghanistan is no longer in the headlines as it once was, but the fate of Afghan women and girls should haunt the conscience of humanity. In the three and a half years since the Taliban returned to power, the rights of Afghan women and girls have been savagely curtailed. Nowhere else on earth in this century have women and girls seen their freedoms more severely and suddenly erased. While some Taliban leaders express personal ambivalence about these policies, the reality is that the war on women is the policy the Taliban has most consistently and effectively waged since the American withdrawal from Afghanistan. Even the simple freedoms of going to public parks or the gym have been banned. Women and girls are effectively banned from playing all sports. When the Taliban swept to power, many fled, including twenty members of the Afghan women's cricket team. Some were under 18 when they left, forced to hide in hotels to stay safe before being allowed to cross the border into Pakistan and eventually seek asylum in Australia. Firooza Amiri, 21, and Benafsha Hashimi, 22, are two of these women. All they want - all any of these women want - is to be able to play the sport they love on a global stage. To do that, they will need to be recognised officially as Afghanistan's refugee team by the International Cricket Council (ICC). So far, their calls have gone unanswered. \"We really don't know why they are silent,\" Firooza says. When the women played their first high-profile match together since arriving in Australia at the end of January, they couldn't represent Afghanistan despite the country's flag punctuating the stands. Meanwhile, the men's team in Afghanistan retains full ICC membership even though the country does not have a women's team, which is a requirement of the ICC. \"You see that we are in the same position as [the men's team] but they are playing in Championship Trophy and we are not,\" Firooza says. Shabnam Eshan, 17, says: \"We deserve the opportunity to compete on the world stage... I want to show the world that Afghan women can compete at the highest level.\"  Firooza and Benafsha had both just finished high school in the summer of 2021 when their worlds were turned upside-down. Firooza had just received a contract to play in the newly established Afghanistan's national women's team. In a matter of days, everything changed, and Firooza was forced to leave and start anew in Australia. She had to burn all her medals and certificates. \"We have faced so many challenges leaving Afghanistan and starting a new life in Australia,\" Firooza told me. Their message to the ICC is simple. \"Stop ignoring us,\" Firooza says. \"This is the time for you to support us, for you to support the team... this is the time you show your support as a governing body and help us play cricket.\" Benafsha adds: \"We don't want anything from them except our rights.\" Read more:Afghan women demand ICC takes stand against TalibanAfghan women dare to dream of life free from 'gender apartheid' Shortly after the Taliban's return, I began keeping a daily tracker of how many days had passed since girls over the age of 12 had been banned from school. As of 7 March, it has been 1,266 days. Promises have been made to girls and their families by the Taliban that eventually they will be permitted to resume their studies - perhaps after the curriculum has been changed or new uniforms established. But after nearly four years, it appears the Taliban has no intention of letting girls go back to school. Despite these barriers, the team remains optimistic and says they would like to be a voice for the millions of Afghan women and girls who have been erased from the public eye and denied their rights in their country of birth. \"What we want is for you [the ICC] to just give us our rights, we deserve better,\" says Benafsha. Sky News reached out to the ICC for comment but received no reply."
    },
    {
        "title": "Gene Hackman's wife died from rare infectious disease around a week before actor's death, medical investigator says",
        "description": "Gene Hackman's wife died from a rare infectious disease around a week before the actor died, medical investigators have said.",
        "url": "https://news.sky.com/story/police-give-update-on-death-of-gene-hackman-and-wife-betsy-arakawa-13323478",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gene-hackman-wife-betsy-arakawa_6841105.jpg?20250228084053",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-07 20:55:00",
        "Headline": "Actor Gene Hackman had advanced Alzheimer's and \"it's quite possible he was not aware\" that his wife was deceased in their home, the chief medical investigator of New Mexico said today.",
        "Content": " Gene Hackman's wife died from a rare infectious disease around a week before the actor died, medical investigators have said. The couple were found dead in their New Mexico home on 26 February, along with one of their pet dogs. Police have previously said there were no apparent signs of foul play. At a press conference on Friday, chief medical investigator for New Mexico, doctor Heather Jarrell, gave an update on the results of post-mortem investigations carried out following their deaths. Doctor Jarrell said Hackman's wife, Betsy Arakawa, died from hantavirus pulmonary syndrome, a rare infectious disease. There were no signs of trauma and the death was a result of natural causes, she said. The doctor said Arakawa likely died on 11 February, the date she was last known to have communicated with people via email. She said Hackman had advanced Alzheimer's and died from heart disease, with data from his pacemaker last registering on 18 February. Due to his Alzheimer's, \"it's quite possible he was not aware that [his wife] was deceased,\" Dr Jarrell added. The actor tested negative for hantavirus, a rare disease spread by infected rodent droppings. Humans can contract hantavirus by breathing in contaminated air, and symptoms can start as soon as one week, or as long as eight weeks, later. It is not transmissible from person to person. There were just seven confirmed cases of hantavirus in New Mexico last year, and Arakawa is the only person confirmed to have contracted it in the state in 2025. Between 1975 and 2023, New Mexico recorded a total of 129 hantavirus cases, with 52 deaths. Santa Fe County sheriff Adan Mendoza said authorities are still waiting for data from mobile phones found at the property, but it is \"very unlikely they are going to show anything else\". \"There's no indication\" that Hackman used a mobile phone or any other technology to communicate and the couple lived a very private life before their deaths, he added.  The cause of the couple's dog's death has not been confirmed but it is now known that Arakawa had picked the animal up from the vet, where it had undergone a procedure, on 9 February. The procedure \"may explain why [the dog] was in a crate at the residence\" while two surviving dogs were found roaming the property, Mr Mendoza said. Hackman, who was widely respected as one of the greatest actors of his generation, was a five-time Oscar nominee who won the best actor in a leading role for The French Connection in 1972 and best actor in a supporting role for Unforgiven two decades later. More from Sky News:The Damned founding member diesKing Charles reveals his favourite music  At last Sunday's Academy Awards, Morgan Freeman paid tribute to Hackman. \"A community lost a giant and I lost a dear friend,\" he said. He met Arakawa, a concert pianist, in the mid-1980s and the pair married in 1991."
    },
    {
        "title": "Russia has 'all the cards' in negotiations to end Ukraine war, Trump says - as Starmer 'compares notes' with Macron",
        "description": "Donald Trump has said Russia has \"all the cards\" in negotiations to end the war with Ukraine - as Sir Keir Starmer held talks with the French president to \"compare notes\".",
        "url": "https://news.sky.com/story/trump-says-russia-has-all-the-cards-in-negotiations-to-end-ukraine-war-13323529",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-putin-us-russia_6849405.jpg?20250307202527",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-07 17:30:00",
        "Headline": "Donald Trump also suggested his priorities are in a different order to Ukraine's, by saying he wants the fighting to end before any security guarantees are made.",
        "Content": " Donald Trump has said Russia has \"all the cards\" in negotiations to end the war with Ukraine - as Sir Keir Starmer held talks with the French president to \"compare notes\". Speaking at the White House, the US president reiterated his desire to get a deal done to end the conflict, which he warned \"could lead to World War Three\". Trump latest: US president addresses latest tariff changes  But he said he had found it \"more difficult\" to deal with Ukraine, and suggested it may be easier to deal with Moscow, because \"they have all the cards\". He was also asked if Vladimir Putin was taking advantage of the decision by the US to stop sharing intelligence with Ukraine, following a series of air attacks on Ukrainian cities in recent days. \"I think he's doing what anyone else would do,\" Mr Trump replied.  However, he said he believed Mr Putin wanted to get the war \"stopped and settled\". \"I think both parties want to settle. I think we are going to get it settled,\" he added. While on social media on Friday, Mr Trump said he was \"strongly considering\" placing additional sanctions on Russia to force it into peace talks with Ukraine. \"To Russia and Ukraine, get to the table right now, before it is too late,\" Mr Trump said. It comes as Sir Keir Starmer and French President Emmanuel Macron spoke to \"compare notes\" on their work towards a possible peace in Ukraine, Downing Street said. The call, which took place on Friday evening, followed a call between the prime minister and other European leaders after European countries agreed a massive increase in defence spending. Sir Keir and Mr Macron have been leading efforts to draw together a \"coalition of the willing\" to help Kyiv. On Friday, Mr Trump also suggested his priorities are in a different order to Ukraine's - saying he wants the fighting to end before any security guarantees are made. \"Before I even think about that, I want to settle the war, get it finished,\" he said. \"As far as the question about security later, that's the easy part. The hard part is getting it settled.\" Ukrainian President Volodymyr Zelenskyy has repeatedly said his country needs \"reliable and clear\" security guarantees before a peace deal with Russia can be agreed. 👉 Follow Trump 100 on your podcast app 👈 Relations between the US and Ukraine have become fractured in recent weeks. Mr Trump's latest comments come exactly a week after his disastrous Oval Office meeting with Mr Zelenskyy - which saw the US president and his vice president, JD Vance, berate the Ukrainian leader and accuse him of being \"disrespectful\". Read more:The 5 Rs guiding Trump's world viewTrump pauses most Mexico and Canada tariffs In the days since, the Trump administration has paused military aid to Ukraine and stopped sharing US intelligence with Kyiv. Officials from Ukraine and the United States will next week hold talks about peace with Russia in Saudi Arabia."
    },
    {
        "title": "Death row inmate executed by firing squad in US for first time in 15 years",
        "description": "A convicted double murderer has been executed by firing squad in the first use of the method in the US for 15 years.",
        "url": "https://news.sky.com/story/death-row-inmate-executed-by-firing-squad-in-us-for-first-time-in-15-years-13323865",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-brad-sigmon-death-penalty_6848929.jpg?20250307120549",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-07 23:20:00",
        "Headline": "Brad Sigmon, who was convicted of beating his ex-girlfriend's parents to death in 2001, chose to be executed by firing squad.",
        "Content": "A convicted double murderer has been executed by firing squad in the first use of the method in the US for 15 years. Brad Sigmon, 67, chose to be killed by bullets, saying he feared the alternatives of the electric chair and lethal injection would risk a slower and more painful death. He was convicted of beating his ex-girlfriend's parents, William and Gladys Larke, to death with a baseball bat at their home in the town of Taylors, South Carolina, in 2001. He told police he planned to take his ex-girlfriend on a romantic weekend before killing himself and her, and was sentenced to death in 2002. After being shot by three volunteer prison employees armed with rifles that were loaded with live ammunition, Sigmon was pronounced dead at 6.08pm (11.08pm in the UK) on Friday. He wore a black jumpsuit with a hood over his head during the execution, and had a white target with a red bullseye over his chest. Sigmon delivered a closing statement, which he said was \"one of love and a calling to my fellow Christians to help us end the death penalty\". Witnesses - who observed the execution from a chamber separated by bullet-resistant glass - included three members of the victims' family, Sigmon's attorney and spiritual advisor, a representative from the prosecuting solicitor's office, a sheriff's investigator and three members of the press. On Wednesday, prior to his death, he asked the US Supreme Court to stop his execution, arguing South Carolina's refusal to share information about its lethal injection protocol violated his rights. His lawyer, Bo King, said the last three men to be executed in the state chose lethal injection and said the process lasted about 20 minutes before they were dead. He said Sigmon was left with \"an impossible choice\" and was forced \"to decide whether to die by the firing squad, knowing that the bullets are going to break the bones in his chest and destroy his heart, or risk a 20-minute-long execution strapped to a gurney with your lungs filling with blood and fluid\". Read more:'Trump bump' turns to a Trump slumpMAGA turns on Trump-appointed Supreme Court judge Ahead of the execution, a group of protesters gathered outside the South Carolina Department of Corrections holding signs with messages including \"all life is precious\" and \"execute justice not people\". There have only been three executions by firing squad in the US since 1977, all of which were in Utah - one of only five states that still offers the method common in the 19th century during the Civil War. The most recent execution by firing squad was Ronnie Lee Gardner in 2010. He was given the death penalty for killing a man during an attempted escape from a courthouse in 1985."
    },
    {
        "title": "'Trump bump' turns to a Trump slump - and there could be further tests ahead with tariffs on Europe",
        "description": "Fuelled by expectations of a Wall Street-friendly policy platform, a \"Trump bump\" pushed the S&P 500 up 2.5% by the time the ticker tape had been cleared. ",
        "url": "https://news.sky.com/story/trump-bump-turns-to-a-trump-slump-and-there-could-be-further-tests-ahead-with-europe-tariffs-13323513",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-new-york-stock-exchange_6771654.jpg?20241209164126",
        "type": "US",
        "Author": "Paul Kelso",
        "Date Published": "2025-03-07 15:27:00",
        "Headline": "US treasury secretary Scott Bessent said US consumers need to \"detox\" from government support while they wait for the private sector to provide the wage growth to outpace the inflationary impact of tariffs. It sounds like a more fundamental reset. ",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Fuelled by expectations of a Wall Street-friendly policy platform, a \"Trump bump\" pushed the S&P 500 up 2.5% by the time the ticker tape had been cleared.  The rally continued after his inauguration, with the index peaking 6.3% higher by mid-February. Since then, however, a \"Trump slump\" has sent markets crashing back to where they started, accelerating in the last week of unpredictable moves. Money blog: Pound set for rise against dollar The reality of an economic program built on trade wars saw the S&P hand back all its post-election gains by Tuesday, then fall further as tariffs imposed by executive order were removed by presidential whim. That Trump turned to tariffs should be no surprise. They were a central campaign promise, the \"most beautiful word\" in the president's limited lexicon. The belligerence and unpredictability with which they have been deployed, however, has left markets spinning. On Tuesday, Trump placed tariffs on America's three largest trading partners, two of whom - Mexico and Canada - it has a free-trade agreement with. They both faced 25% levies on exports to the US (10% on the Canadian heavy crude oil on which the US still depends to keep petrol prices down) while levies on Chinese imports doubled to 20%. Within 48 hours, the measures against Mexico and Canada were paused, leaving US businesses, economists, and trading partners wondering whether, for all his bluster, market sentiment could be a brake on the president's ambition. That tariffs are costly, disruptive and divisive is not in question. Faced with huge price rises, importers have two choices: to absorb the additional cost by cutting profit margins, investment and ultimately growth, or pass them on to customers, increasing prices. The impact was broad and immediate, sowing confusion and chaos. The US car industry and its suppliers saw three changes to trading arrangements in 48 hours; executives of major retailers including the giant Target warned of price increases; while three north-eastern US states faced soaring energy bills as a result of counter-tariffs from Ontario that threatened supply. Unclear motivation What is less clear is whether Trump's motivation is economic or political. Treasury secretary Scott Bessent suggested on Friday it is both. In an interview with CNBC, he said the tariffs were intended to address America's fentanyl crisis, providing leverage to persuade Canada and Mexico to tackle cross-border smuggling, and China to curb the flow of precursor chemicals. But Mr Bessent also insisted the Trump program will require consumers to \"detox\" from government support while they wait for the private sector to provide the jobs and wage growth required to outpace inflation. That sounds like a more fundamental reset, one in which the value of the dollar, falling all week, is less of a priority. Read more:Barclays and Brookfield close to £650m UK payments dealBoots' owner sold to private equity firm For the president and some of those close to him, tariffs are ideological. Their protectionist argument is that cheap imported consumer goods have hollowed out American manufacturing, with the resulting trade deficits amounting to a tax on American jobs.  Imposing tariffs runs the theory, discourages imports and encourages manufacturing at home. But that is a long-term correction, with the short-term cost borne by American companies and consumers and, in turn, a global economy that still orbits around the US. There will be further tests in the coming weeks, with the White House due to announce a global reciprocal tariff regime, including the EU and UK, on 2 April. By then we may have a better sense of whether Mr Trump's popularity, and his ego, can withstand a market downturn, rising prices, and the criticism that would come with them."
    },
    {
        "title": "Trump's 5 Rs: Former adviser on key principles behind US president's decision",
        "description": "Donald Trump's second White House term has seen him berate Ukraine's President Volodymyr Zelenskyy, attempt to pause all foreign aid, and put forward a plan to \"own\" Gaza &#8211; and he hasn't even been in office for 50 days.",
        "url": "https://news.sky.com/story/trumps-5-rs-former-adviser-on-key-principles-behind-us-presidents-decision-13323493",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-president_6849164.jpg?20250307163424",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-07 14:56:00",
        "Headline": "From reimbursement to real estate - these are the things that matter most to Donald Trump, former deputy national security adviser Matt Pottinger tells Sky News.",
        "Content": " Donald Trump's second White House term has seen him berate Ukraine's President Volodymyr Zelenskyy, attempt to pause all foreign aid, and put forward a plan to \"own\" Gaza – and he hasn't even been in office for 50 days. On the latest episode of Sky News podcast The World with Richard Engel and Yalda Hakim, Matt Pottinger - Mr Trump's deputy national security adviser during his first term - joins the hosts to unpack the leader's motivations. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 The world view that the US president subscribes to can be distilled down into five principles, according to Mr Pottinger: the five Rs. Here, he breaks down the \"things that matter\" to Mr Trump. Reciprocity  This idea is simple. \"If a country, in terms of both its national security interest and its approach to trade with the United States, treats the US the way the US treats that country, things are going to work out okay,\" Mr Pottinger explained. \n                  Russia has 'all the cards' in negotiations to end Ukraine war, Trump says - as Starmer 'compares notes' with Macron\n                 \n                  Rachel Reeves: 'People want to talk me down... I'll prove I can do it'\n                 \n                  Trump pauses tariffs on most goods from Mexico and some from Canada\n                 He continued: \"President Trump carries around this sense of aggrievement that he feels that the United States has unfairly opened its markets or has heavily subsidised other countries' security without those countries carrying enough of the burden.\"  Reindustrialisation  This is a term Mr Trump used during his first stint in office, but \"you hear it even more now\", Mr Pottinger said. He explained: \"It's this idea that the United States haemorrhaged too much of its industrial base to other countries, particularly America's number one adversary, the People's Republic of China under the Chinese Communist Party. \"He wants to draw foreign direct investment back directly. \"It's not good enough just to go to friendly nations, so-called friend-shoring. He wants on-shoring of this industrial investment.\" Reimbursement  Mr Pottinger said he first learnt this word when Mr Trump wanted to use it in a speech in Seoul back in 2017 - but advisers including himself managed to talk the US president out of it. \"We'd written a very nice speech for him […] and he wrote in a line in the middle of it saying that South Korea needs to reimburse the United States for everything that US has spent going back to 1950 to defend Korea,\" he said. \"We persuaded him not to use that line in that speech at that particular moment. \"It would have been the only thing that would have been reported about the speech and it would not have been taken well by the host. It would have been rude. \"But it's still his belief that every country that the United States defends or has provided for defence for, needs […] to be reimbursed [the US] in some way.\" Real estate  Reimbursement, Mr Pottinger explained, leads perfectly into the fourth R: real estate. Mr Trump got his start in the business world at his father's real estate company in the late 1960s and went on to develop properties including the Trump Tower in New York and numerous Trump hotels worldwide. Read more:What is Trump's position on Taiwan?Trump pauses most US and Mexico tariffs In November last year, Forbes estimated that his real estate investments account for $1.1bn of the president's $5.6bn net worth. Mr Trump's real estate interests have been reflected in some of his political proposals, including his redevelopment plan for Gaza. \"I would own this,\" he said of the Gaza Strip last month - before sharing an AI video of the territory changed into a Middle Eastern paradise with skyscrapers, yachts and a 'Trump Gaza' building. Respect  Mr Trump \"wants to be treated respectfully,\" Mr Pottinger said. \"And he's actually quite gracious as a host, when he feels that he's being treated with respect, he'll treat his counterpart with respect. \"I've been in the room in scores of meetings with foreign leaders, and that's usually how it's worked out.\""
    },
    {
        "title": "Former Olympic snowboarder Ryan Wedding added to FBI's 10 most wanted list",
        "description": "A former Olympic snowboarder accused of running an international drug smuggling network behind four murders has been added to the FBI's list of 10 most wanted fugitives.",
        "url": "https://news.sky.com/story/former-olympic-snowboarder-ryan-wedding-added-to-fbis-10-most-wanted-list-13323461",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ryan-wedding-canada_6849037.jpg?20250307135518",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-07 13:54:00",
        "Headline": "The Canadian is accused of running an international drug smuggling operation behind four murders.",
        "Content": "A former Olympic snowboarder accused of running an international drug smuggling network behind four murders has been added to the FBI's list of 10 most wanted fugitives. A $10m (£7.7m) reward has been offered for information leading to the arrest of Ryan Wedding, 43, who competed for Canada in the giant slalom at the 2002 winter games. Wedding - whose aliases include \"El Jefe,\" \"Giant\" and \"Public Enemy\"- is accused of running a network that routinely shipped hundreds of kilograms of cocaine from Colombia through Mexico and Southern California, to Canada and other US locations. He is also suspected of orchestrating four murders and an attempted murder. \"Wedding went from shredding powder on the slopes at the Olympics to distributing powder cocaine on the streets of US cities and in his native Canada,\" said Akil Davis, the assistant director of the FBI's Los Angeles field office. \"The alleged murders of his competitors make Wedding a very dangerous man.\" Read more US news:Man chooses execution method not used for 15 yearsSpaceX rocket explodes during test \n                  Day 46: Why is Trump blindfolding Ukraine? \n                 \n                  Trump admits tariffs 'disturbance' as China says it is 'ready for any type of war' with US\n                 \n                  Justin Trudeau holds news conference on US tariffs\n                 Wedding was charged last year and an indictment in September alleged he and others arranged the shipment of some 60 tonnes of cocaine a year using long-haul trucks. The FBI said a dozen people had been arrested in connection with the case. US authorities allege the group killed two members of a family in Canada in retaliation for a stolen drug shipment in what officials there said was a case of mistaken identity, as well as two other people. \"The former Canadian snowboarder unleashed an avalanche of death and destruction, here and abroad,\" said special agent Matthew Allen. \"He earned the name 'El Jefe', becoming boss of a violent transnational drug trafficking organisation. \"Now, his face will be on 'The Top 10 Most Wanted' posters. He's unremitting, callous and greed-driven. \"Today's announcement beams an even brighter searchlight on him. We ask that you help us find him.\" Investigators believe Wedding is living in Mexico but have not ruled out that he could be in the US, Canada, Colombia, Honduras, Guatemala, Costa Rica, or elsewhere."
    },
    {
        "title": "Not loyal enough to Donald Trump? MAGA turns on Supreme Court judge appointed by president",
        "description": "Fans of Donald Trump have turned against one of the justices he placed on the US Supreme Court, suggesting she has not been loyal enough to the president.",
        "url": "https://news.sky.com/story/trump-supreme-court-judge-amy-coney-barrett-maga-13323251",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-barrett-us-supreme-court_6848839.jpg?20250307102854",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-07 11:30:00",
        "Headline": "Staunch conservative Justice Amy Coney Barrett was picked by President Donald Trump for the Supreme Court. Now his fans are turning against her.",
        "Content": "Fans of Donald Trump have turned against one of the justices he placed on the US Supreme Court, suggesting she has not been loyal enough to the president. Staunch conservative Justice Amy Coney Barrett was appointed to America's highest court by Mr Trump in 2020 and has voted for major rulings, including striking down abortion rights. But that does not seem to be enough for some of the MAGA crowd. There has been anger from right-wing personalities following a couple of recent 5-4 rulings in which she has been the deciding vote against Mr Trump's agenda. Justice Barrett was among the justices who rejected the Trump administration's attempt to avoid paying federal contractors as part of the gutting of the US' foreign aid programme. \"She is a rattled law professor with her head up her a**,\" said Mike Davis, who once worked for another Supreme Court justice, describing Justice Barrett as \"weak and timid\". \"DEI judge,\" influencer Jack Posobiec complained on X, suggesting that she was a \"diversity, equity and inclusion\" hire - presumably because she is a woman.  Read more:Supreme Court allows emergency abortions in IdahoLesotho minister calls Trump 'insulting' \n                  Gene Hackman's wife died from rare infectious disease around a week before actor's death, medical investigator says\n                 \n                  Russia has 'all the cards' in negotiations to end Ukraine war, Trump says - as Starmer 'compares notes' with Macron\n                 \n                  Death row inmate executed by firing squad in US for first time in 15 years\n                 Their criticism of her comes despite Justice Barrett consistently voting in favour of conservative cases, from ending the landmark Roe v Wade abortion rights to expanding gun rights. \"It seems to me there is this impulse where personal loyalty to Donald Trump in an unquestioned way is seen as a requirement for a sitting justice on the Supreme Court,\" Anthony Kreis, a professor at Georgia State University College of Law, said. \"It doesn't matter how conservative that person might be,\" he added. Justice Barrett has spoken previously about how her appointment to the Supreme Court - and the security concerns that go with it - has affected her and her family. The White House did not respond to a message from Sky News' US partner outlet NBC News seeking comment."
    },
    {
        "title": "SpaceX Starship rocket explodes during test flight - as 'space launch debris' grounds flights in Florida",
        "description": "SpaceX's Starship rocket exploded during a test flight, months after a previous failed launch attempt - with multiple flights having to be grounded in Florida due to debris.",
        "url": "https://news.sky.com/story/spacex-starship-rocket-explodes-during-test-flight-as-space-launch-debris-grounds-flights-in-florida-13323119",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-spacex-starship_6848585.jpg?20250307020027",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-07 01:04:00",
        "Headline": "SpaceX said the Starship rocket experienced \"a rapid unscheduled disassembly\" during ascent. Flights were grounded at some Florida airports as a result of debris, but operations are now running normally.",
        "Content": " SpaceX's Starship rocket exploded during a test flight, months after a previous failed launch attempt - with multiple flights having to be grounded in Florida due to debris. The 403-foot rocket blasted off from Starbase in Boca Chica, Texas, at around 6.30pm eastern time (12.30am UK time). But, within minutes of launch, contact was lost as the spacecraft - designed to land astronauts on the moon and ferry crews to Mars - went into an out-of-control spin. Engines on top of Starship started shutting down as it streaked eastward. The flight was supposed to be a controlled entry over the Indian Ocean. It was not immediately clear where the rocket came down, but images of flaming debris seen from Florida and the Caribbean were posted online. Analysis: SpaceX crash is a new blow for Musk's Mars programme In a statement, SpaceX said: \"During Starship's ascent burn, the vehicle experienced a rapid unscheduled disassembly and contact was lost. \n                  Second SpaceX flight crash is a new blow for Musk's Mars programme\n                 \n                  Second-ever privately funded space craft touches down on moon\n                 \n                  Elon Musk calls famed astronaut Andreas Mogensen an 'idiot' after being accused of 'lying' about stranded astronauts\n                 \"Our team immediately began coordination with safety officials to implement pre-planned contingency responses. \"We will review the data from today's flight test to better understand root cause. As always, success comes from what we learn, and today's flight will offer additional lessons to improve Starship's reliability.\" Read more from Sky News:Athena moon lander does not appear to be uprightSecond-ever private-funded spacecraft lands on moon The megarocket's Super Heavy booster was successfully caught by giant mechanical arms and returned to the launch pad as planned. Speaking to Sky News from a catamaran near Ragged Island in the Bahamas, Bret Bostwick said he was watching the launch with his children when the rocket exploded. \"I was watching with my boys, seven and nine years old, and then all of a sudden, you know, boom! It just turned into a big ball of fire, actually no noise,\" he said. \"So there wasn't actually a boom at that point, but just a big ball of fire. And both my kids knew right away it had exploded again. We had seen Starship seven explode. So we're kind of, I guess, little experts down here at detecting the explosion.\" The biotechnology consultant added that initially, a \"fireball was on the horizon, and then it came over, right over the top of our boat\". He said it looked \"more like a big firework show with big streamers of different debris going down and every chunk of the ship [seemed] to glow a different colour\". Mr Bostwick said \"this one seemed to explode at about the same point as the last one\" and \"hopefully they'll learn and it'll get a little further next time\". The US Federal Aviation Authority (FAA) issued a ground notice for multiple flights after the test launch on Thursday, and said it will require SpaceX to carry out a mishap investigation into the loss of Starship. Miami, Fort Lauderdale, Palm Beach and Orlando airports were issued the notice because of \"space launch debris\" until 8pm (1am UK time). Departures at the four Florida airports were delayed by an average of 45 minutes due to the incident. It comes after the previous Starship test flight in January failed eight minutes into flight when the rocket exploded over the Bahamas. Blazing debris was sent miles across the sky over the Turks and Caicos, a British Overseas Territory. No injuries or major damage were reported. Elon Musk, SpaceX owner, said on X after the January launch: \"Preliminary indication is that we had an oxygen/fuel leak in the cavity above the ship engine firewall that was large enough to build pressure in excess of the vent capacity.\" The FAA also said it would carry out an investigation into the failed launch - which is ongoing."
    },
    {
        "title": "What is hantavirus - the rare disease that actor Gene Hackman's wife Betsy Arakawa died from?",
        "description": "Actor Gene Hackman died of heart disease around a week after his wife Betsy Arakawa died of a rare infectious disease at their home, a pathologist has said. But what do we know about the rare virus?",
        "url": "https://news.sky.com/story/what-is-hantavirus-the-rare-disease-that-actor-gene-hackmans-wife-betsy-arakawa-died-from-13323830",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-hantavirus-hps_6849575.jpg?20250307230021",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-07 22:05:00",
        "Headline": "The actor's wife Betsy Arakawa died after developing hantavirus pulmonary syndrome (HPS) around 11 February, a pathologist said. ",
        "Content": "Actor Gene Hackman died of heart disease around a week after his wife Betsy Arakawa died of a rare infectious disease at their home, a pathologist has said. But what do we know about the rare virus? The couple were found dead on 26 February in separate rooms of their Santa Fe home, along with one of their dogs, and on Friday the results of medical tests were released in New Mexico. Two-time Oscar winner Hackman was in the advanced stages of Alzheimer's when he died of heart disease, and it was likely he was at home alone with the body of his wife for a week before he passed away himself. Dr Heather Jarrell, chief medical examiner for New Mexico, told reporters Betsy Arakawa is believed to have died around 11 February. The post-mortem examination showed Ms Arakawa, also known as Betsy Hackman, died of hantavirus pulmonary syndrome - a rare but potentially fatal disease. But, what is it - and how do you get infected? HPS, commonly referred to as hantavirus disease, is a respiratory disease caused by hantaviruses which are carried by several types of rodents. \n                  Gene Hackman's wife died from rare infectious disease around a week before actor's death, medical investigator says\n                 \n                  Gene Hackman: Morgan Freeman makes emotional Oscars tribute to 'a giant and a dear friend'\n                 \n                  The Oscars moments everyone's talking about: The good, the bad and the chewing gum\n                 It is a rare condition in the US, with most cases concentrated in the western states of New Mexico, Arizona, Colorado and Utah. The New Mexico Department of Health says hantaviruses are spread by the saliva, droppings and urine of infected rodents, which in North America is most likely to be the eastern deer mouse (Peromyscus maniculatus). The virus is often transmitted through the air when people sweep out sheds or clean closets where mice have been living, or by eating food contaminated with mouse droppings. It is not transmissible from person to person, Dr Jarrell said. What are the symptoms? Symptoms, which vary between people, are thought to develop between one and eight weeks after exposure and the likelihood of death in the southwest of the US is about 38% to 50%. Early symptoms of HPS include fatigue, fever, and myalgia (muscle aches), with about half of patients also experiencing malaise, headaches, dizziness, lightheadedness, chills, sweats, and abdominal problems including nausea, vomiting and diarrhoea, according to the American Lung Association. Later symptoms include coughing, shortness of breath, and pneumonia (lungs filling with fluid). Rapid breathing and rapid heartbeat are also typical. At this stage, the disease progresses rapidly, requiring hospital treatment and often mechanical ventilation to help with breathing. What is the treatment for HPS? There is no specific cure, treatment, or vaccine for HPS, but patients have a better chance of survival when they are diagnosed early. How common is it in the US? The Centers for Disease Control and Prevention began tracking the virus after a 1993 outbreak in the Four Corners region - the area where Arizona, Colorado, New Mexico and Utah meet. The agency said that, as of the end of 2022, 864 cases of hantavirus disease were reported in the US since that tracking began. What about the UK? The most recent information about cases in the UK was released by Public Health England (PHE) in 2014. The health body described how acute kidney injury (AKI), caused by hantaviruses in rodents, was linked to exposure to pet or wild rats - but there have only been a handful of cases. It added that certain hantaviruses present in Europe, Asia and Africa tend to cause haemorrhagic and kidney disease, while new world hantaviruses in the Americas tend to cause severe respiratory disease, including HPS."
    },
    {
        "title": "Post Office scandal: Fujitsu agrees to talks about contributing to victims' compensation",
        "description": "Fujitsu has agreed to begin talks with the UK government on contributing to compensation for victims of the Post Office scandal.",
        "url": "https://news.sky.com/story/post-office-scandal-fujitsu-agrees-to-talks-about-contributing-to-victims-compensation-13323562",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-bracknell-fujitsu-post-office_6424658.jpg?20240117141405",
        "type": "Business",
        "Author": "Adele Robinson",
        "Date Published": "2025-03-07 17:08:00",
        "Headline": "Fujitsu developed the faulty Horizon computer system responsible for erroneous shortfalls in accounting and supported the Post Office in its prosecutions.",
        "Content": "\n          Business correspondent\n              @SkyNewsAdele\n Fujitsu has agreed to begin talks with the UK government on contributing to compensation for victims of the Post Office scandal. Hundreds of sub-postmasters were falsely accused of stealing from their branches between 1999 and 2015. Fujitsu developed the faulty Horizon computer system responsible for erroneous shortfalls in accounting which led to wrongful convictions. They also supported the Post Office in its prosecutions. More than a year ago, Fujitsu boss Paul Patterson said the company had a \"moral obligation\" to contribute towards redress for victims. Business secretary Jonathan Reynolds and Mr Patterson today held a \"positive and constructive\" meeting in Japan - where Fujitsu agreed to begin talks on compensation. The UK government \"welcomes Fujitsu's repeated commitment to its moral obligation to contribute\" towards compensation for the Horizon scandal victims, a joint statement said. Ahead of the completion of the inquiry into the scandal, the pair \"agreed to progress discussions regarding Fujitsu's contribution, acknowledging many parties are involved,\" it added. \n                  Post Office scandal victim died days before compensation letter arrived - as widow says offer an 'utter disgrace'\n                 \n                  Post Office chair warns postmasters on pay uplift amid Whitehall funding talks\n                 \n                  Victims of second Post Office scandal criticise 'grinding wheels of bureaucracy' as they try to get compensation\n                 Officials will \"continue to engage with Fujitsu\", but the UK government will not be making a \"running commentary\" on discussions, the statement said. It also said the government is \"grateful\" for Fujitsu's engagement with the Post Office inquiry \"and its continued focus on delivering its public services commitments in the UK\". 'Utter disgrace' It comes as the widow of a Post Office scandal victim, who received a compensation offer days after his death, described her situation as an \"utter disgrace\". Janet Walters, 68, lost her husband Terry in February - a week before a letter arrived offering \"less than half\" of his original claim for financial redress.  Terry Walters was one of 555 sub-postmasters who won a legal battle against the Post Office in 2019. Janet described the length of time many victims have had to wait for an offer of compensation as another \"scandal\". \"I've told them I will not accept [the offer],\" Janet told Sky News. \"I think it's an utter disgrace. \"It's a scandal what they did with the Horizon system, it's a scandal now because of the length of time it's taken [on redress].\" Thousands waiting for compensation New figures show more than £768m has been now paid to more than 5,100 victims across all redress schemes. The Department for Business and Trade said this was a \"more than tripling\" of the total amount of redress paid since June 2024. Read more:Sub-postmasters still going through hell, says Alan BatesSecond Post Office IT scandal expands There are, however, still hundreds waiting for compensation in the GLO (Group Litigation Order) scheme, with more than 200 yet to receive full redress. There are also more than 4,000 yet to be paid in the Horizon Shortfall Scheme (HSS), although since last month, over 700 have received compensation.  In a separate statement after the meeting in Japan, Mr Reynolds said: \"We must never forget the lives ruined by the Horizon scandal and no amount of redress can take away that pain. But justice can and must be done. \"This government is determined to hold those responsible to account and will continue to make rapid progress on compensation and redress. \"Since we took office, we have more than tripled the total amount of redress paid to victims, and today we took another significant step towards justice.\""
    },
    {
        "title": "'Trump bump' turns to a Trump slump - and there could be further tests ahead with tariffs on Europe",
        "description": "Fuelled by expectations of a Wall Street-friendly policy platform, a \"Trump bump\" pushed the S&P 500 up 2.5% by the time the ticker tape had been cleared. ",
        "url": "https://news.sky.com/story/trump-bump-turns-to-a-trump-slump-and-there-could-be-further-tests-ahead-with-europe-tariffs-13323513",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-new-york-stock-exchange_6771654.jpg?20241209164126",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-03-07 15:27:00",
        "Headline": "US treasury secretary Scott Bessent said US consumers need to \"detox\" from government support while they wait for the private sector to provide the wage growth to outpace the inflationary impact of tariffs. It sounds like a more fundamental reset. ",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Fuelled by expectations of a Wall Street-friendly policy platform, a \"Trump bump\" pushed the S&P 500 up 2.5% by the time the ticker tape had been cleared.  The rally continued after his inauguration, with the index peaking 6.3% higher by mid-February. Since then, however, a \"Trump slump\" has sent markets crashing back to where they started, accelerating in the last week of unpredictable moves. Money blog: Pound set for rise against dollar The reality of an economic program built on trade wars saw the S&P hand back all its post-election gains by Tuesday, then fall further as tariffs imposed by executive order were removed by presidential whim. That Trump turned to tariffs should be no surprise. They were a central campaign promise, the \"most beautiful word\" in the president's limited lexicon. The belligerence and unpredictability with which they have been deployed, however, has left markets spinning. On Tuesday, Trump placed tariffs on America's three largest trading partners, two of whom - Mexico and Canada - it has a free-trade agreement with. They both faced 25% levies on exports to the US (10% on the Canadian heavy crude oil on which the US still depends to keep petrol prices down) while levies on Chinese imports doubled to 20%. Within 48 hours, the measures against Mexico and Canada were paused, leaving US businesses, economists, and trading partners wondering whether, for all his bluster, market sentiment could be a brake on the president's ambition. That tariffs are costly, disruptive and divisive is not in question. Faced with huge price rises, importers have two choices: to absorb the additional cost by cutting profit margins, investment and ultimately growth, or pass them on to customers, increasing prices. The impact was broad and immediate, sowing confusion and chaos. The US car industry and its suppliers saw three changes to trading arrangements in 48 hours; executives of major retailers including the giant Target warned of price increases; while three north-eastern US states faced soaring energy bills as a result of counter-tariffs from Ontario that threatened supply. Unclear motivation What is less clear is whether Trump's motivation is economic or political. Treasury secretary Scott Bessent suggested on Friday it is both. In an interview with CNBC, he said the tariffs were intended to address America's fentanyl crisis, providing leverage to persuade Canada and Mexico to tackle cross-border smuggling, and China to curb the flow of precursor chemicals. But Mr Bessent also insisted the Trump program will require consumers to \"detox\" from government support while they wait for the private sector to provide the jobs and wage growth required to outpace inflation. That sounds like a more fundamental reset, one in which the value of the dollar, falling all week, is less of a priority. Read more:Barclays and Brookfield close to £650m UK payments dealBoots' owner sold to private equity firm For the president and some of those close to him, tariffs are ideological. Their protectionist argument is that cheap imported consumer goods have hollowed out American manufacturing, with the resulting trade deficits amounting to a tax on American jobs.  Imposing tariffs runs the theory, discourages imports and encourages manufacturing at home. But that is a long-term correction, with the short-term cost borne by American companies and consumers and, in turn, a global economy that still orbits around the US. There will be further tests in the coming weeks, with the White House due to announce a global reciprocal tariff regime, including the EU and UK, on 2 April. By then we may have a better sense of whether Mr Trump's popularity, and his ego, can withstand a market downturn, rising prices, and the criticism that would come with them."
    },
    {
        "title": "Walgreens Boots Alliance sold to private equity firm Sycamore Partners",
        "description": "The owner of high-street pharmacy chain Boots is being bought by a private equity firm, and it will no longer be a public company listed on a stock exchange. ",
        "url": "https://news.sky.com/story/walgreens-boots-alliance-sold-to-private-equity-firm-sycamore-partners-13323164",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-boots-store-london_6594067.jpg?20240629120938",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-03-07 06:54:00",
        "Headline": "It's unclear what the deal will mean for the 1,800 Boots shops but it could trigger an auction of the business. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The owner of high-street pharmacy chain Boots is being bought by a private equity firm, and it will no longer be a public company listed on a stock exchange.  Walgreens Boots Alliance had agreed to a $23.7bn (£18.37bn) deal with private equity firm Sycamore Partners, as first reported by Sky News. It means the business will no longer be a company with publicly traded shares listed on the Nasdaq stock exchange in New York. Instead, for the first time in nearly a hundred years, it will be under the private ownership of the private equity firm, which specialises in retail. Money blog: She created a six-figure business from a cardboard box In return, shareholders will get $11.45 (£8.86) per share with the possibility of receiving another $3 (£2.32) per share if other business sale conditions are met. Private equity firms acquire businesses, invest to improve financial performance and seek to then sell them for a profit. \n                  Surprise boost for retail as food sales see biggest jump since start of pandemic\n                 \n                  Retail crime: Record levels of theft and violence in our shops\n                 \n                  Hobbycraft-owner Modella circles WH Smith high street chain\n                 Other high-street businesses, such as Morrisons and Asda supermarkets, have been acquired by private equity. It's unclear what the impact of the deal will be on Boots shops in the UK but a sale of that part of the business by new owners could be triggered. The chain has announced the closure of 300 stores in 2023 while Walgreens Boots Alliance shed 90% of its share price value since 2015. A sell-off of the Boots arm of the business from the Walgreens Boots Alliance had been considered but was abandoned in 2022 amid torrid conditions in debt-financing markets. Boots was acquired by Walgreens in 2014 Walgreens Boots Alliance was founded by John Boot in 1849, who sold herbal remedies. It employs about 51,000 people in the UK in 1,800 pharmacies and opticians. Union reaction The Pharmacists' Defence Association (PDA) union said it recognised why private equity ownership \"and the inability to influence\" it, \"may be particularly worrying to pharmacists and other employees\". \"It can be assumed that any potential new owners would implicitly only buy a business that they believe they can take more value from, so at some level change will follow, but that need not be negative... as a large organisation pharmacists at Boots are already used to seeing significant change,\" the union said. \"The PDA calls upon the NHS and the General Pharmaceutical Council (GPhC) to ensure that any possible impacts on the community pharmacy network because of this development are appropriately managed to ensure access for the public and that standards are constantly maintained.\" The Union of Shop, Distributive and Allied Workers (USDAW) have been contacted for comment. Boots had no comment."
    },
    {
        "title": "Barclays and Brookfield close to £650m UK payments deal",
        "description": "Barclays is closing in on a &#163;650m deal to offload control of its UK payments business to the Canadian investment giant Brookfield Asset Management after months of negotiations.",
        "url": "https://news.sky.com/story/barclays-and-brookfield-close-to-163650m-uk-payments-deal-13323359",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-barclays-bank_6747670.jpg?20241113180508",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-07 11:19:00",
        "Headline": "Barclays would inject more than £600m into its merchant acquiring business as part of a medium-term deal to cede control of it to Canada's Brookfield Asset Management, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Barclays is closing in on a £650m deal to offload control of its UK payments business to the Canadian investment giant Brookfield Asset Management after months of negotiations. Sky News has learnt that the two companies are in the final stages of talks about a transaction that will initially see Brookfield acquiring 10% of the UK bank's merchant acquiring division. Three years after the deal completes, Brookfield would then acquire a further 80% of the unit, leaving Barclays as a 10% shareholder. Money blog: She created a six-figure business from a cardboard box Unusually, the agreement being finalised would see Barclays injecting £400m into the payments division in order to fund investment in returning it to sustainable growth, sources said on Friday. Barclays would also provide roughly £250m of regulatory capital required to secure approval for the deal, they added. A deal could be announced as early as next week, although it is more likely to be publicly confirmed later this month, insiders said. \n                  Barclays says IT glitch that locked people out of their accounts has been resolved\n                 \n                  Barclays tells customers to contact food banks as IT glitch disruption enters third day\n                 \n                  Honeymoon couple unable to access their money online as Barclays suffers major IT glitch\n                 The high street lender said in February 2024 that it was exploring a sale or partnership for the merchant acquiring division - one of the UK's largest. Estimates of the value of Barclays' merchant acquiring arm have varied wildly, ranging from less than $1bn to $2.5bn. The talks come with Barclays in a position of comparative strength under its chief executive, CS Venkatakrishnan. Its shares have soared by more than 75% over the last year and now has a market capitalisation of over £44bn. Read more:Boots' owner sold to private equity firmPizzaExpress shareholders to inject fresh dough into chain  Barclays and Brookfield declined to comment, although the bank has previously said: \"As we confirmed at our February [2024] investor update, we are exploring a number of options for investment in our market-leading merchant acquiring business, including strategic partnerships. \"We will provide any further updates in due course.\""
    },
    {
        "title": "Reform UK MP Rupert Lowe reported to police over alleged threats towards party chairman",
        "description": "Reform UK has suspended MP Rupert Lowe and reported him to the police over alleged threats of physical violence towards the party's chairman.",
        "url": "https://news.sky.com/story/reform-uk-mp-rupert-lowe-reported-to-police-over-alleged-threats-towards-party-chairman-13323564",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rupert-lowe-reform-uk_6849317.jpg?20250307185645",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-03-07 17:06:00",
        "Headline": "In a statement, Mr Lowe said the complaints were \"untrue and false\". He recently appeared to publicly question Nigel Farage's leadership of the party, something which he doubles down on in his response.",
        "Content": "\n          Political reporter\n        Reform UK has suspended MP Rupert Lowe and reported him to the police over alleged threats of physical violence towards the party's chairman. A statement from chair Zia Yusuf and chief whip Lee Anderson MP also said the party has received complaints from two female employees about alleged serious bullying in Mr Lowe's offices. Mr Yusuf and Mr Anderson said \"we understand complaints have been made to parliamentary authorities\". Mr Lowe, 67, has released a statement saying the allegations were \"untrue and false\", the accusations of physical threats were \"outrageous and entirely untrue\", and he referenced a \"vexatious complaint\" made by another staff member. Mr Lowe, the MP for Great Yarmouth, has had the whip suspended, meaning he will sit as an independent MP in the House of Commons. Mr Yusuf and Mr Anderson said in their statement that Mr Lowe had \"on at least two occasions made threats of physical violence against\" Mr Yusuf. The statement said: \"It is with regret that we feel obligated to disclose that the party received complaints from two female employees about serious bullying in the offices of the member of parliament for Great Yarmouth, Rupert Lowe.\" \n                  A pact between Nigel Farage and Kemi Badenoch?\n                 \n                  Farage says Zelenskyy is not a dictator and Trump 'should not be taken literally'\n                 \n                  Nigel Farage relinquishes majority control of Reform UK\n                 Claims of 'disturbing pattern of behaviour' It added: \"Evidence was provided to us of workplace bullying, the targeting of female staff who raised concerns, and evidence of derogatory and discriminatory remarks made about women, including reference to a perceived disability. \"We feel we have a duty of care to all our staff, whether employed directly or indirectly. Accordingly, we appointed an independent King's Counsel to conduct an investigation into the veracity of these complaints. To date, Mr Lowe has yet to cooperate with this investigation. \"In addition to these allegations of a disturbing pattern of behaviour, Mr Lowe has on at least two occasions made threats of physical violence against our party chairman. Accordingly, this matter is with the police. \"Reform stands for the highest standards of conduct in public life, and we will apply these standards without fear nor favour, including within our own party.\" Rumblings of leadership challenge Earlier this week, Mr Lowe appeared to question Nigel Farage’s leadership of Reform UK. In an interview with the Daily Mail, Mr Lowe said: \"Nigel is a fiercely independent individual and is extremely good at what we have done so far. He has got messianic qualities. \"Will those messianic qualities distil into sage leadership? \"I don't know.\" He added: “I'm not going to be by Nigel's side at the next election unless we have a proper plan to change the way we govern from top to bottom.” During Mr Farage's online falling out with Elon Musk, in which the Tesla businessman said Reform needed a new leader, Mr Lowe drew praise from Mr Musk. And in the interview with the Daily Mail, Mr Lowe noted that he was \"barely six months into being an MP\" and \"in the betting to be the next prime minister.\" 'Disappointed but not surprised' In his response to the allegations, Mr Lowe said on Friday the party leadership had a \"complete inability to accept even the most mild constructive criticism without such a malicious reaction\". He said in a statement posted on X: \"I am disappointed, but not surprised, to read Reform's untrue and false allegations. Let me be abundantly clear - this investigation is based on zero credible evidence against me, as has been repeatedly stated by the neutral investigator. None has been provided. \"I have cooperated and spoken at length with the KC they instructed, at great cost to the party, to investigate a minor staff matter.\" Read more:Farage gives up sole control of ReformParty passes 200,000 members He claimed the lawyer was \"dismayed\" the statement from Reform UK had been published - and that the investigation had not even started. Mr Lowe claimed the lawyer told him that \"no credible evidence has been given\". The MP added that he was sent an initial letter of complaint last Friday from the party with \"no evidence provided\". \"I have never made any derogatory comments about women, or those with disabilities. This is a lie. These allegations are not even referring to me. I will be seeking legal advice immediately,\" he added. Political correspondent It sounds too weird to be true, but Elon Musk may very well be the reason that Reform UK is embroiled in a messy public battle with one of its five MPs.\n Detailed and damning statements released on Friday look to be the culmination of months of growing division between Nigel Farage and Great Yarmouth MP Rupert Lowe. The allegations against him are serious, numerous and have triggered three possible investigations – from the party, the parliamentary authorities and the police. His rebuttal is equally robust, indicating he will fight hard to clear his name.\n But is this battle just about his behaviour? Or is it because of his leadership ambitions? And were they ignited after a bizarre intervention from across the pond? In January, Musk posted on X, calling for Farage to step down, saying he wasn't up to the job, and later suggested Lowe could step up as he 'makes a lot of sense'. Two months later and relations had broken down beyond repair, with a war of words erupting this week in the papers, in which Lowe called Farage messianic and he responded saying the MP probably wanted to be prime minister. There is no doubt that an endorsement from the world's richest man would flatter the ego of any aspiring politician. But given Friday's revelations, it seems that instead of kick-starting his rise to the top of Reform, Musk's meddling has instead severed his ties with the party for good. When it comes to his parliamentary career, salvaging his reputation could also prove difficult as other critical accounts of his character emerge. Sky News has heard from Labour MP Mike Kane about an incident which took place in the Commons last December, during which he says he was \"manhandled\" by the then Reform MP. The Transport minister described an angry scene in which Lowe had to be restrained by Reform's deputy leader, Richard Tice, and eventually broken up by the Sergeant at Arms. Mr Lowe did not wish to comment on the claim, but it adds yet another obstacle in the fight for his political future. 'Vexatious' complaint  Mr Lowe continued: \"It is no surprise that this vexatious statement has been issued the day after my reasonable and constructive questions of Nigel and the Reform structure. It was issued on X late on a Friday afternoon, with no prior warning. \"All I stated was that communication needs to improve, delegation needs to improve, structure needs to improve - these are all reasonable requests of a party looking to form the next government. I stand by everything I said.\" His response added: \"I do not believe that Reform members will be pleased to know that their membership fees are being spent on instructing expensive lawyers to investigate their own MPs, over matters that are entirely baseless and have been dealt with in the correct Parliamentary procedure, with HR's full involvement and support. \"The staff member in question only raised a vexatious complaint once disciplinary proceedings had been initiated against them for serious wrongdoing. The other individual mentioned, dropped her appeal.\" Read more:Other Reform MP jailed for kicking girlfriendParty seen as stronger than Tories 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Mr Lowe said he had been trying to change the way Reform is run \"behind the scenes\" for many months, and urged his supporters to \"stay with the party\". He said: \"This is our party as much as it is Nigel's.\" A Metropolitan Police spokesperson said: \"On Thursday, 6 March we received an allegation of verbal threats made by a 67-year-old man on Friday, 13 December. \"Officers are carrying out an assessment of the allegations to determine what further action may be required.\""
    },
    {
        "title": "Police charge former Liverpool mayor Joe Anderson and ex-deputy council leader Derek Hatton with bribery",
        "description": "Former Liverpool mayor Joe Anderson and former deputy council leader Derek Hatton are among 12 people who have been charged as part of an investigation into council corruption.",
        "url": "https://news.sky.com/story/former-liverpool-mayor-joe-anderson-among-12-charged-with-bribery-and-misconduct-13323204",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-joe-anderson-derek-hatton_6848992.jpg?20250307131154",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-03-07 08:24:00",
        "Headline": "Left-wing firebrand Derek 'degsy' Hatton was a member of the Militant tendency that infiltrated Labour in the 1970s and 1980s.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Former Liverpool mayor Joe Anderson and former deputy council leader Derek Hatton are among 12 people who have been charged as part of an investigation into council corruption. Anderson, 67, who was first arrested in December 2020, has been charged with bribery, misconduct in a public office and conspiracy to commit misconduct in a public office, Merseyside Police said on Friday. Politics live: Defence spending boost 'not a one-off thing' Hatton, 77, who was deputy leader in the 1980s and a known militant figure on the Labour left, has been charged with bribery and one count of counsel or procure misconduct in a public office. Anderson's son David Anderson, 37, of Wavertree, is charged with conspiracy to commit misconduct in a public office. The charges are part of a long-running investigation known as Operation Aloft, which was launched by police to look into the awarding of commercial and business contracts from Liverpool City Council between 2010 and 2020. Other people charged include the former assistant director of highways and planning and the former head of regeneration. \n                  Reform UK MP Rupert Lowe reported to police over alleged threats towards party chairman\n                 \n                  Rupert Lowe: Reform UK MP reported to police for alleged bullying\n                 \n                  Politics latest: Donald Trump told to expect 'loud' protests during UK visit\n                 The full charges are: A spokesman for Merseyside Police said all 12 were due to appear at Preston Magistrates' Court on 28 March. Joe Anderson served as the first directly elected Labour Mayor of Liverpool from 2012 to 2021. He was suspended by the party following his arrest in 2020 and did not stand for re-election the following year. Derek \"Desgsy\" Hatton was a firebrand member of the Militant tendency that infiltrated Labour in the 1970s and 1980s. He was expelled from the party in 1986 as part of a purge of the hard-left under Neil Kinnock's leadership. Under the Trotskyist group's direction, Liverpool City Council set an illegal budget in 1985 - spending more than its income - in a stand against Margaret Thatcher's government. Robin Weyell, Deputy Chief Crown Prosecutor, said: \"The CPS has reviewed a full file of evidence from the Merseyside Police and has authorised the investigation team to charge 12 people with 12 offences related to bribery and misconduct in public office.\" He said criminal proceedings are now active and \"it is extremely important that there should be no reporting, commentary or sharing of information online which could in any way prejudice these proceedings\"."
    },
    {
        "title": "Government accused of 'gutting' potential bill to ban children from social media",
        "description": "The government has been accused of \"gutting\" a potential landmark bill to stop children \"doom scrolling\" after its proposals were watered down.",
        "url": "https://news.sky.com/story/government-accused-of-gutting-potential-bill-to-ban-children-from-social-media-13323350",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-school-children-phone_6846839.jpg?20250305110408",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-03-07 11:15:00",
        "Headline": "A Labour MP has had to water down plans for a social media ban on under 16s and a smartphone ban in schools for his safer phones bill to get government support ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n The government has been accused of \"gutting\" a potential landmark bill to stop children \"doom scrolling\" after its proposals were watered down. Labour MP Josh MacAlister had originally planned for his Safer Phones legislation to include a ban on the devices in classrooms, a well as raising the \"digital age of consent\" at which social media can be used to 16. But in the face of ministerial opposition, the bill now just calls for chief medical officers to review the evidence on screen-based harms within a year - before deciding if there should be higher age restrictions on access to apps such as TikTok and Snapchat. Former Tory education secretaries hit out at the changes during a debate on the bill's second reading in the Commons on Friday, which ended with the bill being adjourned for further consideration until July. Kit Malthouse, who held the post under Liz Truss, said the bill is a \"hollowed out gesture\" and accused the government of \"capitulating to big tech\". \"I will be speaking not to celebrate progress, but to lament the gutting of what could have been a landmark bill,\" he said. He also acknowledged his own party's past failures in getting the legislation passed, adding: \"This government, sadly like the last... has dithered, diluted and capitulated. \"What remains, I'm afraid, is a hollowed out gesture and an opportunity missed.\"  Damien Hinds, who was education secretary under Theresa May and an education minister under Rishi Sunak, praised Mr MacAlister's campaigning but called the current version of the bill a \"huge missed opportunity\". He said that while the Conservative's Online Safety Bill \"made very good progress\" on protecting children from harmful content, \"we have a lot more to do on the topic of time and the addictiveness of social media\". Tory MP Sir Ashley Fox claimed nothing in the bill requires legislation and the watered-down proposals \"could all be achieved by a minister just deciding to ask the chief medical officer to produce a report or the minister to produce a plan\". He asked: \"What has happened to the legislative action that was clearly in earlier drafts in his legislation?\" Responding, former teacher Mr MacAlister said the bill had to be changed to \"secure explicit government backing\". He said the bill had been written \"to achieve change rather than just highlight the issue\". \"That is why the bill before us is narrower than where I started when this campaign began six months ago,\" he added. Changing the law 'not a big bang event' Mr MacAlister has brought forward the legislation using the Private Members Bill (PMB) mechanism, which allows backbench MPs to propose changes to the law. PMBs are rarely successful without government backing. Introducing his bill - officially known as the Protection of Children (Digital Safety and Data Protection) Bill - Mr MacAlister said reducing smartphone harms in law relies on a \"process\" not one \"big bang\" event. He said that the average 12-year-old spends 21 hours a week on their smartphone, which is \"the equivalent of four full days of school teaching per week\". \"This is a fundamental rewiring of childhood itself and it's happened in little over a decade,\" he said. Political correspondent This bill is the product of months of, at times emotional, hearings in parliament, many of which I attended. Josh MacAlister took evidence - away from the cameras - from bereaved families who believe social media played a part in their children's deaths. That evidence included medical professionals who say screen time is fuelling anxiety and destroying children's concentration spans, along with teachers, regulators and yes, even those publicity-shy tech companies who talked behind closed doors about the measures they have already put in place, and where they can go further. It was a painstaking process, and Mr MacAlister, a former teacher, made clear he wanted a proposal government would back with action, not an ideal that wouldn’t be workable. Ministers made clear that a smartphone ban in schools was off the agenda – they wanted it to be left up to headteachers. Instead, he pushed forward with restricting \"addictive by design\" apps from under-16s. The objection there? This is the year the Online Safety Act, with huge ambitions to protect children from harmful and illegal content, is being implemented in stages by Ofcom.  Ministers and some campaigners feared additional laws to limit \"doomscrolling\" would distract from that work, which some worry is already a tall order.  Hence, this final draft calls for a review of evidence lasting a year, and no firm commitment from government. Mr MacAlister says tackling smartphone harms will be a series of small steps and continued pressure, a marathon, not a sprint. It's not what many parents and MPs wanted to hear, but the government is prepared to work with it. Many countries have already taken steps to strengthen laws on children's phone usage. The French and Norwegian governments have set a 15-year age limit while last year Australia passed a world-first law banning under 16s from having social media accounts. It is understood that Technology Secretary Peter Kyle wanted to make sure the Online Safety Act, which was passed by MPs in 2023 and is being implemented in stages this year, is completed first before any potential social media ban. This intends to protect young people from illegal and harmful content with fines for tech companies who break the rules. The government has opposed a smartphone ban in schools, saying this should be up to headteachers. Most young people say social media causes harm Ahead of the debate, extensive polling of young people aged 16-24 showed that 62% of this age group say social media does more harm than good. Four in five also said they would try to keep their own children off social media for as long as possible. Half of this generation, who grew up with smartphones, agree they spent too much time on their phones and social media during childhood. Read More:Son's mental health 'severely impacted' after pornography sharedInstagram unveils new feature as govt tightens online safety rules Has Trump influenced the government? Speaking during the debate, technology minister Chris Bryant said he was \"not going to make arguments against action\" and \"everybody accepts that action is inevitable in this field\". He said the task the governent faces is \"harnessing the good\" of social media while losing what is bad, as children who are struggling with their sexuality or are neurodivergent can benefit from certain apps. However, he admitted he had \"no role\" in negotiating with Mr MacAlister or Downing Street about changing the contents of the bill, leading to Mr Malthouse raising a point of order over whether the relevant minister had been put foward to take questions. Mr Malthouse also asked whether Donald Trump had influenced the \"filleting of this bill\" as it would upset US tech firms. Mr Byrant accused him of \"subscribing to conspiracy theories\", adding: \"I haven't taken into consideration anything Donald Trump might think in this field.\""
    },
    {
        "title": "ULEZ lowers air pollution most in London boroughs that opposed it, data reveals",
        "description": "London boroughs that resisted the expansion of the ULEZ ultra low emissions scheme have enjoyed the greatest fall in a dangerous air pollutant since it was brought in, a review has found.",
        "url": "https://news.sky.com/story/anti-poison-ulez-scheme-has-lowered-air-pollution-most-in-london-boroughs-that-opposed-it-13323222",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-sadiq-khan-ulez_6848819.jpg?20250307100244",
        "type": "Politics",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-03-07 09:08:00",
        "Headline": "Outer London boroughs that had opposed the ULEZ car scheme coming to their area have seen the greatest improvement in air quality during the first year of the expanded scheme, the City Hall review found.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  London boroughs that resisted the expansion of the ULEZ ultra low emissions scheme have enjoyed the greatest fall in a dangerous air pollutant since it was brought in, a review has found. Sutton, Croydon and Merton and Bromley and Harrow all opposed Labour mayor Sir Sadiq Khan's plan to expand the ULEZ to all London boroughs in August 2023. The City Hall study, which was reviewed by independent experts, analysed the impact of the expanded ULEZ over its first year. It found levels of nitrogen oxides (NOx), which drives asthma and lung cancer, were 15% lower across all three boroughs than they would have been had they not been added to the scheme. NOx levels from cars and vans across the whole of outer London were estimated to be 14% lower. The policy, which charges drivers £12.50 for driving polluting, non-compliant vehicles, has seen the number of such cars in London fell by nearly 100,000 on an average day. Anyone who fails to pay the charge is fined. Drivers have had to pay more than £400m in these fines since the scheme expanded, analysis of TfL figures by the PA news agency found. \n                  'Rainmakers' and transboundary smog - Thailand's struggling battle against air pollution\n                 \n                  Lead pollution in ancient Rome may have lowered IQ levels, study finds\n                 \n                  Air pollution now linked to hospital admissions for mental health, study finds\n                 The Tory government at the time branded it \"Labour's war on motorists\", saying it would oblige drivers to buy new cars or cough up for the fees. The policy has \"not been anti-car, it's been anti-poison,\" Sir Sadiq told Sky News's Anna Jones today. \"The point is... by driving a pollution vehicle you yourself are breathing in poison, your kids in the back are breathing in poison.\" He added: \"No level of air pollution is safe. It can lead to thousands of premature deaths and a whole host of health issues, from asthma to cancer, heart disease, strokes and dementia.\" In London, more than 3,500 premature deaths per year were driven by toxic air, according to Imperial College London. Read more from Sky News:Just Stop Oil co-founder has sentence reducedThousands of dead fish dumped on seabed Overall, since the scheme first launched in 2019, levels of another toxic gas NO2 have decreased by 27% across the entire capital. The report also concluded ULEZ expansion has had \"no negative impact\" on footfall or spending in shops or leisure destinations in any part of London, while there has been \"no notable change in average traffic flow\". But Colin Smith, leader of Bromley Council, criticised the \"one size fits all lunacy\" approach of applying the policy across London. He said it had forced people to switch jobs, \"destroyed care networks\" and created a \"huge financial expense for people and businesses having to buy new vehicles they didn't want or need\". The Mayor said: \"If we were speaking 60 years ago, there'd be discussion, a debate about whether tobacco was dangerous and whether we should reduce smoking. I'm hoping now people know the science is quite clear: air pollution kills.\""
    },
    {
        "title": "Rachel Reeves: 'People want to talk me down... I'll prove I can do it'",
        "description": "<a href='https://podcasts.apple.com/us/podcast/electoral-dysfunction/id1613562765' target='_blank'> 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈</a>    ",
        "url": "https://news.sky.com/story/rachel-reeves-people-want-to-talk-me-down-ill-prove-i-can-do-it-13323107",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-electoral-dysfunction_6848553.png?20250306235432",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-07 05:00:00",
        "Headline": "No subtitle found",
        "Content": " 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈  Beth's been to 11 Downing Street to talk to the chancellor for Electoral Dysfunction. She took some of your questions (and a couple of Electoral Dysfunction mugs) with her. Rachel Reeves reflects on her first few months in the job, explains what she thinks of the \"Rachel from Accounts\" label and shares her own money-saving tip which she tries to do every day when at Downing Street. She also hints on what might come in her Spring Statement with some strong words on the need for welfare reform. Email us at electoraldysfunction@sky.uk, post on X to @BethRigby, or send a WhatsApp voice note on 07934 200 444.And remember, you can also watch us on YouTube!"
    },
    {
        "title": "Thousands of dead fish dumped on seabed after getting caught in trawl nets",
        "description": "Scottish environmentalists are calling for urgent action to protect marine life after a video shared with Sky News showed the alleged illegal dump of wasteful bycatch.",
        "url": "https://news.sky.com/story/thousands-of-dead-fish-dumped-on-seabed-after-getting-caught-in-trawl-nets-13323386",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-scotland-fish-marine-life_6848886.jpg?20250307112211",
        "type": "Technology",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2025-03-07 11:43:00",
        "Headline": "Environmentalists say the video is an insight into the true environmental cost of bottom-trawling for scampi.",
        "Content": "\n          News correspondent\n              @esadiya\n  Scottish environmentalists are calling for urgent action to protect marine life after a video shared with Sky News showed the alleged illegal dump of wasteful bycatch. Warning: This article contains images of dead fish The film shows the seabed littered with thousands of dead fish, shellfish, and critically endangered flapper skate. Environmentalists say it is an insight into the true environmental cost of bottom-trawling for scampi. Large volumes of fish and other marine life are routinely caught in bottom-trawl nets used to sweep the seabed. Charities say the unintended bycatch is a particular problem in prawn trawl fishery due to the small mesh size of the nets. The fisherman, who took the video and asked not to be named, said it did not look like a one-off. Read more from Sky NewsJurassic dinosaur found in ScotlandMegaberg size of Gloucestershire runs agroundWild beavers make comeback \"It appears to be multiple dumps because the fish are in varying stages of decomposition.\" \"I felt a deep sadness especially when I saw the dead flapper skate, when I saw the rope on the base of its tail. The sadness quickly turned to anger for the wastefulness involved and mistreatment of this beautiful creature.\" Skippers are required by law to release flapper skate caught accidentally. Although bycatch is not a crime, the law does require all skates and rays to be released immediately. \"This clearly did not happen here, as the flapper skate had a rope tied around its tail,\" explains Nick Underdown from the charity Open Seas. \"This shows the wasteful bycatch of other species caught in the trawl nets, which is often discarded at sea, hidden from public view.\" Open Seas called on the Scottish government and supermarkets to do more. \"The scampi industry and the supermarkets have made a lot of profit selling consumers a product that is often branded \"responsibly sourced\" while failing to do anything to actually resolve this issue,\" said Mr Underdown. \"As a priority, the Scottish government must reinstate sensible spatial limits on this type of fishing in our coastal seas.\" The charity also called for restricting trawling in sensitive sea lochs and coastal areas and bringing in better vessel monitoring to identify hotspots of harm. Sky News has contacted the Scottish government for comment."
    },
    {
        "title": "SpaceX Starship rocket explodes during test flight - as 'space launch debris' grounds flights in Florida",
        "description": "SpaceX's Starship rocket exploded during a test flight, months after a previous failed launch attempt - with multiple flights having to be grounded in Florida due to debris.",
        "url": "https://news.sky.com/story/spacex-starship-rocket-explodes-during-test-flight-as-space-launch-debris-grounds-flights-in-florida-13323119",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-spacex-starship_6848585.jpg?20250307020027",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-07 01:04:00",
        "Headline": "SpaceX said the Starship rocket experienced \"a rapid unscheduled disassembly\" during ascent. Flights were grounded at some Florida airports as a result of debris, but operations are now running normally.",
        "Content": " SpaceX's Starship rocket exploded during a test flight, months after a previous failed launch attempt - with multiple flights having to be grounded in Florida due to debris. The 403-foot rocket blasted off from Starbase in Boca Chica, Texas, at around 6.30pm eastern time (12.30am UK time). But, within minutes of launch, contact was lost as the spacecraft - designed to land astronauts on the moon and ferry crews to Mars - went into an out-of-control spin. Engines on top of Starship started shutting down as it streaked eastward. The flight was supposed to be a controlled entry over the Indian Ocean. It was not immediately clear where the rocket came down, but images of flaming debris seen from Florida and the Caribbean were posted online. Analysis: SpaceX crash is a new blow for Musk's Mars programme In a statement, SpaceX said: \"During Starship's ascent burn, the vehicle experienced a rapid unscheduled disassembly and contact was lost. \n                  Second SpaceX flight crash is a new blow for Musk's Mars programme\n                 \n                  Second-ever privately funded space craft touches down on moon\n                 \n                  Elon Musk calls famed astronaut Andreas Mogensen an 'idiot' after being accused of 'lying' about stranded astronauts\n                 \"Our team immediately began coordination with safety officials to implement pre-planned contingency responses. \"We will review the data from today's flight test to better understand root cause. As always, success comes from what we learn, and today's flight will offer additional lessons to improve Starship's reliability.\" Read more from Sky News:Athena moon lander does not appear to be uprightSecond-ever private-funded spacecraft lands on moon The megarocket's Super Heavy booster was successfully caught by giant mechanical arms and returned to the launch pad as planned. Speaking to Sky News from a catamaran near Ragged Island in the Bahamas, Bret Bostwick said he was watching the launch with his children when the rocket exploded. \"I was watching with my boys, seven and nine years old, and then all of a sudden, you know, boom! It just turned into a big ball of fire, actually no noise,\" he said. \"So there wasn't actually a boom at that point, but just a big ball of fire. And both my kids knew right away it had exploded again. We had seen Starship seven explode. So we're kind of, I guess, little experts down here at detecting the explosion.\" The biotechnology consultant added that initially, a \"fireball was on the horizon, and then it came over, right over the top of our boat\". He said it looked \"more like a big firework show with big streamers of different debris going down and every chunk of the ship [seemed] to glow a different colour\". Mr Bostwick said \"this one seemed to explode at about the same point as the last one\" and \"hopefully they'll learn and it'll get a little further next time\". The US Federal Aviation Authority (FAA) issued a ground notice for multiple flights after the test launch on Thursday, and said it will require SpaceX to carry out a mishap investigation into the loss of Starship. Miami, Fort Lauderdale, Palm Beach and Orlando airports were issued the notice because of \"space launch debris\" until 8pm (1am UK time). Departures at the four Florida airports were delayed by an average of 45 minutes due to the incident. It comes after the previous Starship test flight in January failed eight minutes into flight when the rocket exploded over the Bahamas. Blazing debris was sent miles across the sky over the Turks and Caicos, a British Overseas Territory. No injuries or major damage were reported. Elon Musk, SpaceX owner, said on X after the January launch: \"Preliminary indication is that we had an oxygen/fuel leak in the cavity above the ship engine firewall that was large enough to build pressure in excess of the vent capacity.\" The FAA also said it would carry out an investigation into the failed launch - which is ongoing."
    },
    {
        "title": "Second SpaceX flight crash is a new blow for Musk's Mars programme",
        "description": "In just two years' time, the SpaceX Starship is due to land people on the surface of the moon &#8211; and if you believe Elon Musk, embark on a mission to Mars.",
        "url": "https://news.sky.com/story/second-spacex-flight-crash-is-a-new-blow-for-musks-mars-programme-13323272",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-spacex-starship_6848576.jpg?20250307011642",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-03-07 10:12:00",
        "Headline": "The second test flight crash in two months is a significant setback for SpaceX's hopes of beating China to the moon - and for Musk's vision of getting to Mars. ",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  In just two years' time, the SpaceX Starship is due to land people on the surface of the moon – and if you believe Elon Musk, embark on a mission to Mars. So it's a significant setback for the rocket to explode so spectacularly - and publicly - for the second time in as many months. Just nine-and-a-half minutes into test flight eight, contact was lost with the upper stage. A SpaceX livestream showed the engines cutting out and the rocket veering out of control. Fiery debris was then seen streaking across the sky. \"Success comes from what we learn, and today's flight will help us improve Starship's reliability,\" the company said. Learning through failure is what drives SpaceX and its founder Elon Musk. The company had already made design changes in response to the failure of test flight seven in January. Its investigation concluded vibrations had stressed hardware in the propulsion system, which leaked and exploded. The Federal Aviation Administration was satisfied that the engineering upgrades met its safety requirements. But once again there has been a failure and the company has started a second investigation using video from inside the rocket and system data leading up to the explosion.  Starship is on an incredibly tight testing schedule. Flights had been due to ramp up this year, with 25 planned - all increasingly ambitious. There's a lot to be done before humans can clamber aboard. For such a large rocket to reach the moon it will need to be refueled before it leaves the Earth's orbit. So upwards of half a dozen 'tanker' versions of Starship will need to be launched, and the propellant then pumped into the rocket heading to the moon. There it will orbit, waiting for astronauts to arrive on NASA's own Space Launch System (SLS) rocket, and then take them down to the lunar surface. But a safe landing on the rugged terrain of the moon's south pole is far from guaranteed, as Thursday's touchdown by Intuitive Machines' Athena spacecraft shows. It appears to have fallen over. NASA and SpaceX are having to push hard to beat China back to the moon in a quest for water and minerals. Read more:The space race for the moon's waterSecond ever private moon landing touches down And Elon Musk has talked about sending the first uncrewed Starships to Mars in 2027 and astronauts soon after. But there is a risk. The Space Shuttle was one of the most complex machines ever built. One blew up on launch, another on its return to Earth. Both were the result of hardware failures. NASA is more risk-averse these days. That's why the \"stranded\" astronauts Butch Wilmore and Suni Williams were kept on the International Space Station rather than riding home on the hobbled Boeing spacecraft. It remains to be seen whether the space agency comes under increasing pressure from Donald Trump's administration to take more risks to win the space race. But it certainly won't want to put its astronauts on a rocket that just isn't ready."
    },
    {
        "title": "Gene Hackman's wife died from rare infectious disease around a week before actor's death, medical investigator says",
        "description": "Gene Hackman's wife died from a rare infectious disease around a week before the actor died, medical investigators have said.",
        "url": "https://news.sky.com/story/police-give-update-on-death-of-gene-hackman-and-wife-betsy-arakawa-13323478",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gene-hackman-wife-betsy-arakawa_6841105.jpg?20250228084053",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-07 20:55:00",
        "Headline": "Actor Gene Hackman had advanced Alzheimer's and \"it's quite possible he was not aware\" that his wife was deceased in their home, the chief medical investigator of New Mexico said today.",
        "Content": " Gene Hackman's wife died from a rare infectious disease around a week before the actor died, medical investigators have said. The couple were found dead in their New Mexico home on 26 February, along with one of their pet dogs. Police have previously said there were no apparent signs of foul play. At a press conference on Friday, chief medical investigator for New Mexico, doctor Heather Jarrell, gave an update on the results of post-mortem investigations carried out following their deaths. Doctor Jarrell said Hackman's wife, Betsy Arakawa, died from hantavirus pulmonary syndrome, a rare infectious disease. There were no signs of trauma and the death was a result of natural causes, she said. The doctor said Arakawa likely died on 11 February, the date she was last known to have communicated with people via email. She said Hackman had advanced Alzheimer's and died from heart disease, with data from his pacemaker last registering on 18 February. Due to his Alzheimer's, \"it's quite possible he was not aware that [his wife] was deceased,\" Dr Jarrell added. The actor tested negative for hantavirus, a rare disease spread by infected rodent droppings. Humans can contract hantavirus by breathing in contaminated air, and symptoms can start as soon as one week, or as long as eight weeks, later. It is not transmissible from person to person. There were just seven confirmed cases of hantavirus in New Mexico last year, and Arakawa is the only person confirmed to have contracted it in the state in 2025. Between 1975 and 2023, New Mexico recorded a total of 129 hantavirus cases, with 52 deaths. Santa Fe County sheriff Adan Mendoza said authorities are still waiting for data from mobile phones found at the property, but it is \"very unlikely they are going to show anything else\". \"There's no indication\" that Hackman used a mobile phone or any other technology to communicate and the couple lived a very private life before their deaths, he added.  The cause of the couple's dog's death has not been confirmed but it is now known that Arakawa had picked the animal up from the vet, where it had undergone a procedure, on 9 February. The procedure \"may explain why [the dog] was in a crate at the residence\" while two surviving dogs were found roaming the property, Mr Mendoza said. Hackman, who was widely respected as one of the greatest actors of his generation, was a five-time Oscar nominee who won the best actor in a leading role for The French Connection in 1972 and best actor in a supporting role for Unforgiven two decades later. More from Sky News:The Damned founding member diesKing Charles reveals his favourite music  At last Sunday's Academy Awards, Morgan Freeman paid tribute to Hackman. \"A community lost a giant and I lost a dear friend,\" he said. He met Arakawa, a concert pianist, in the mid-1980s and the pair married in 1991."
    },
    {
        "title": "The Damned founding guitarist Brian James dies",
        "description": "Brian James, founding member of The Damned, has died aged 70.",
        "url": "https://news.sky.com/story/the-damned-founding-guitarist-brian-james-dies-13323344",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-brian-james-the-damned_6848889.jpg?20250307112124",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-07 11:06:00",
        "Headline": "Brian James was part of the group's original line-up. He wrote the first UK punk single New Rose and helped the band create their debut album, 1977's Damned Damned Damned.",
        "Content": "Brian James, founding member of The Damned, has died aged 70. The guitarist, who was part of the group's original line-up, wrote the first UK punk single New Rose and helped the band create their debut album, 1977's Damned Damned Damned. A spokesperson for record label Easy Action said: \"I can confirm that Brian passed away peacefully yesterday with his family present.\" James' fellow band member, bassist Raymond \"Captain Sensible\" Burns, said in an Instagram post: \"The riffmeister, Brian has gone - that final act that happens to us all, for most is a sad and miserable affair but while it's truly awful our mate has been taken I prefer to celebrate the life... and what a life Brian James had.\" He added: \"And looking back I have to say what an absolute gent Brian was... despite having to occasionally endure some pretty appalling behaviour by yours truly he never once lost it with me - and whenever we met over the following decades we would have a drink and a bloody good laugh.\" A statement on James' Facebook page said he was \"one of the true pioneers of music, guitarist, songwriter, and true gentleman\" and a musician who was \"incessantly creative and a musical tour de force\" over his long career. It said: \"With his wife Minna, son Charlie, and daughter-in-law Alicia by his side, Brian passed peacefully on Thursday 6 March 2025.\" The Damned supported the Sex Pistols on their Anarchy Tour of the UK and went on to play with T Rex on Marc Bolan's final tour before he died. James left the band after it released its second album, Music For Pleasure, and was part of the short-lived Tanz Der Youth before he formed The Lords Of The New Church with American singer Stiv Bators and drummer Nick Turner. The band released the songs Open Your Eyes, Dance With Me and Method To My Madness. Read more from Sky News:UK's Eurovision 2025 act announcedGlastonbury reveals line-up and final headlinersMalta's Eurovision entry censored over 'appropriateness'  James went on to work with The Dripping Lips, create his own band the Brian James Gang, and release solo albums. In 2020 he and The Damned lead singer Dave Vanian, drummer Christopher \"Rat Scabies\" Millar and Burns announced the band would reform more than four decades after it began in 1976. James performed with the group in 2022. Burns said: \"When BJ, Rat, DV and myself got back together for The Damned originals shows it was magical in all sorts of ways... that we were chums again of course but also the way we managed to recreate our '76 garage punk sound right from the first chord in rehearsals. \"We were all up for doing it again too... but that'll never happen now, sadly.\" The band's set in Sao Paulo, Brazil, on Friday would be dedicated to James, he added, \"without whom The Damned would never ever have happened\"."
    },
    {
        "title": "Remember Monday announced as UK's Eurovision 2025 act",
        "description": "The UK's entry for this year's Eurovision Song Contest has been revealed.&#160;",
        "url": "https://news.sky.com/story/remember-monday-announced-as-uks-eurovision-act-13323182",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-eurovision-remember-monday_6848704.jpg?20250307081657",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-07 07:29:00",
        "Headline": "The country pop band will perform their song entry What The Hell Just Happened? at the competition in Basel, Switzerland this May.",
        "Content": "The UK's entry for this year's Eurovision Song Contest has been revealed.  Country pop band Remember Monday will perform their song What The Hell Just Happened? at the event, which is being held at the St Jakobshalle arena in Basel, Switzerland, between 13 and 17 May. The trio is made up of Charlotte Steele, Lauren Byrne and Holly-Anne Hull, who met at sixth form college. They will be the first girl band to represent the UK since 1999, when the group Precious entered with the song Say It Again. Last year Olly Alexander's performance with disco-style number Dizzy saw the UK come 18th in Malmo, Sweden, while Mae Muller's I Wrote A Song landed in second to last place in Liverpool in 2023. 'A crazy honour' Speaking to the Scott Mills Breakfast Show on BBC Radio 2 on Friday, the band said they \"feel like they are on another planet\" after the announcement. \"[Our song] What The Hell Just Happened? is exactly how we're feeling right now. It's all very surreal; our friendship goes so far back, and we definitely never imagined that we'd be doing anything like this,\" the band said. \"When you're a kid and people ask you what you want to be when you grow up, an absolute classic is 'I wanna be a pop star', so the fact that we're getting the chance to live that dream as three best friends is just wild. \"We're going to be the first girl band to represent the UK since 1999, which feels like such a crazy honour.\" Since first entering the contest in 1957, the UK has won Eurovision five times. It also holds the record for taking second place more than any other nation, finishing as runner-up 16 times, according to the Eurovision website. 2015: Electro Velvet - Still In Love With You, finished in 24th place\n\n 2016: Joe and Jake - You're Not Alone, finished in 24th place\n\n 2017: Lucie Jones - Never Give Up On You, finished in 15th\n\n 2018: SuRie - Storm, finished in 24th place\n\n 2019: Michael Rice - Bigger Than Us, finished last in 26th place\n\n 2020: James Newman - My Last Breath, contest cancelled due to COVID\n\n\n 2021: James Newman - Embers, finished in 26th place\n\n 2022: Sam Ryder - Space Man, finished in 2nd place\n\n 2023: Mae Muller - I Wrote A Song, finished in 25th place 2024: Olly Alexander - Dizzy, finished in 18th  They said they want to bring \"loads of fun\" to the contest and \"do something that you won't have seen before on the Eurovision stage\". They added: \"This is really the music World Cup and we'll do our best to bring it home.\" Read more:Malta's Eurovision entry censoredNew Eurovision rules announced to 'protect' artists The trio already have a large following on social media, including over 500,000 followers on TikTok and 11 million likes. They also appeared on singing competition show The Voice UK in 2019, where they were coached by Jennifer Hudson and were eliminated before the final of the competition. The band has released a number of tracks since appearing on The Voice, including their EP Crazy Anyway, which came out last October. They have also supported the likes of Tom Jones and American singer Dasha at their headline shows."
    }
]