[
    {
        "title": "Ex-classmates died after being treated at same mental health hospital - as concerns raised over more deaths",
        "description": "They were former classmates who both died after receiving care from the same mental health hospital three years apart.",
        "url": "https://news.sky.com/story/ex-classmates-died-after-being-treated-at-same-mental-health-hospital-as-concerns-raised-over-more-deaths-13359275",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nhs-manslaughter_6906064.png?20250504153701",
        "type": "Home",
        "Author": "Megan Harwood-Baynes and Laura Bundock, Sky News health team",
        "Date Published": "2025-06-20 23:01:00",
        "Headline": "Sky News investigates a number of deaths linked to a London NHS trust that was recently convicted in the case of 22-year-old Alice Figueiredo.",
        "Content": "By Megan Harwood-Baynes and Laura Bundock, Sky News health team    They were former classmates who both died after receiving care from the same mental health hospital three years apart. Warning: This article contains reference to suicide Multiple failings led to the death of 22-year-old Alice Figueiredo - who took her own life in July 2015 - and the NHS trust responsible for her care was charged with corporate manslaughter. Last week, following a months-long trial, the trust was found not guilty of that charge but was convicted of serious health and safety failings. Karis Braithwate, who had gone to school with Alice, also died in 2018, having been treated by the same NHS trust. Reports seen by Sky News detail a decade of deaths at North East London NHS Foundation Trust (NELFT), with coroners repeatedly raising concerns about the mental health services provided by the trust - in particular at Goodmayes Hospital in Ilford. Rushed assessments and neglect were often cited. One patient was marked as alive and well, even though he had taken his own life inside the hospital the previous day. Another patient told staff he was hearing voices telling him to kill himself, yet staff did not remove crucial items from his possession - items he would later use to take his own life. Karis, 24, was sent to Goodmayes Hospital after she tried to take her own life at a train station in October 2018. The next day, staff spent 27 minutes assessing her and a further two minutes confirming their conclusion. She was discharged from hospital in the afternoon. She then went to a nearby railway station and took her own life. Her death came less than an hour after she had left the hospital. Karis had been friends with Alice, her mother said. The pair had been classmates at the same school. Karis told her mother she was upset at being put on the same ward where Alice had taken her own life three years earlier. Her stepfather Mark Bambridge called Karis sweet and kind and said she often \"struggled with life\". He felt relief when she was taken to hospital, saying: \"She was in a place where she would be taken care of.\" Karis's mother - who asked not to be named - said her daughter confided in her about the neglect she endured at the hospital. Karis told her mother that her carer would sleep when they were supposed to be watching over her and said she never felt safe. \"She spoke of her belongings going missing, of being treated with indifference and disrespect, and of staff who showed little concern for her wellbeing,\" her mother said. Karis's mother said her daughter was failed by the hospital and the family was offered only a \"hollow, superficial and indifferent 'apology' from the administration team of those who were meant to protect her\". In the wake of the verdict in Alice's case, Karis's mother said: \"I am holding Alice's family in my thoughts and praying they receive the justice they - and we - so clearly need and deserve.\" A spokesperson for NELFT called Karis's death a \"profound tragedy\" and said the trust had conducted an in-depth review of patient safety since 2018, \"resulting in significant changes in the way we assess risk of suicide\". \"We train our staff to consider the trauma in a patient's history, rather than focusing solely on their current crisis,\" the spokesperson added. \"This approach allows us to see the person behind the diagnosis, making it easier to identify warning signs and support safe recovery.\" The trust said it had also improved record-keeping and communication between emergency workers and mental health practitioners. The man marked as alive after he'd died Sky News looked at more than 20 prevention of future death reports, which are written by a coroner to draw attention to a matter in which they think action could be taken to prevent future deaths. Behind each report is a different person, but there are some strikingly similar themes - failure to carry out adequate risk assessments; issues sharing and recording information; neglect. One report said staff at Goodmayes Hospital \"panicked and did not follow policy\" in the wake of a man's death in 2021, instead writing that he was still alive when he had died the day before. Speaking in response at the time, the trust said it had written a \"detailed action plan\" to address concerns raised. Another report said one woman developed deep vein thrombosis after she was left to sit motionless in her room. She had not eaten or drunk anything in the two days before her death, and the trust was criticised for failing to record her food intake. Responding to the report at the time, the trust said it had implemented new policies to learn from her death. Issues stretched beyond Goodmayes Hospital and spanned the entire NHS trust. One man was not given any community support and overdosed after his access to medication was not limited. Another man, a father of three, was detained under the Mental Health Act but released from Goodmayes after just a few hours. The 39-year-old was found dead two weeks later after being reported missing by his family. At his inquest, a coroner raised concerns about the lack of a detailed assessment around him, with a junior doctor saying he was the only doctor available for 11 wards and 200 patients. 'Don't kill yourself on my shift' It has been 10 years since Alice took her own life inside the walls of Goodmayes Hospital. But current patients say the issues haven't gone away. Teresa Whitbread said her 18-year-old granddaughter Chantelle was a high suicide risk but she still managed to escape from the hospital \"20 times\". \"I walked in one day and said, 'Where is Chantelle?', and no one could tell me,\" she told Sky News. On another occasion, Chantelle managed to get into the medical room and stabbed herself and a nurse with a needle. She said one nurse told her granddaughter: \"Don't kill yourself on my shift. Wait until you go home and kill yourself.\" Teresa grew emotional as she talked about her granddaughter, once a vibrant young girl and avid boxer, whose treatment is now managed by community services. \"It's made her worse,\" Teresa said of Chantelle's experience at Goodmayes Hospital. \"There's no care, there's no care plan, there's no treatment.\" The NEFLT said it could not comment on specific cases but added that \"patient safety is our absolute priority, and we work closely with our patients and their families to ensure we provide compassionate care tailored to their needs\". Chantelle's family say she is a shell of her former self and have begged mental health services not send her back to Goodmayes. \"Something has to change, and if it doesn't change, [the hospital] needs to be closed down,\" Teresa said. \"Because people are not safe in there.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "US warplanes transit through UK as Trump considers striking Iran",
        "description": "Flight tracking data shows extensive movement of US military aircraft towards the Middle East in recent days, including via the UK.",
        "url": "https://news.sky.com/story/us-warplanes-transit-through-uk-as-trump-considers-striking-iran-13386388",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-usa-england-iran-israel_6945271.jpg?20250620232005",
        "type": "Home",
        "Author": "Ben van der Merwe, Adam Parker, Kaitlin Tosh and Sophia Massam, Data &amp; Forensics Unit",
        "Date Published": "2025-06-20 23:01:00",
        "Headline": "As President Trump mulls direct involvement in the Israel-Iran conflict, Sky News has analysed the build-up of US Air Force assets near the Middle East and how they might be used.",
        "Content": "By Ben van der Merwe, Adam Parker, Kaitlin Tosh and Sophia Massam, Data & Forensics Unit   Flight tracking data shows extensive movement of US military aircraft towards the Middle East in recent days, including via the UK. Fifty-two US military planes were spotted flying over the eastern Mediterranean towards the Middle East between Monday and Thursday. That includes at least 25 that passed through Chania airport, on the Greek island of Crete - an eight-fold increase in the rate of arrivals compared to the first half of June. The movement of military equipment comes as the US considers whether to assist Israel in its conflict with Iran. Of the 52 planes spotted over the eastern Mediterranean, 32 are used for transporting troops or cargo, 18 are used for mid-air refuelling and two are reconnaissance planes. Forbes McKenzie, founder of McKenzie Intelligence, says that this indicates \"the build-up of warfighting capability, which was not [in the region] before\". Sky's data does not include fighter jets, which typically fly without publicly revealing their location. An air traffic control recording from Wednesday suggests that F-22 Raptors are among the planes being sent across the Atlantic, while 12 F-35 fighter jets were photographed travelling from the UK to the Middle East on Wednesday. Many US military planes are passing through UK  A growing number of US Air Force planes have been passing through the UK in recent days. Analysis of flight tracking data at three key air bases in the UK shows 63 US military flights landing between 16 and 19 June - more than double the rate of arrivals earlier in June. On Thursday, Sky News filmed three US military C-17A Globemaster III transport aircraft and a C-130 Hercules military cargo plane arriving at Glasgow's Prestwick Airport. Flight tracking data shows that one of the planes arrived from an air base in Jordan, having earlier travelled there from Germany. What does Israel need from US? Israeli Prime Minister Benjamin Netanyahu said on 15 March that his country's aim is to remove \"two existential threats - the nuclear threat and the ballistic missile threat\". Israel says that Iran is attempting to develop a nuclear bomb, though Iran says its nuclear facilities are only for civilian energy purposes. A US intelligence assessment in March concluded that Iran is not building a nuclear weapon. President Trump dismissed the assessment on Tuesday, saying: \"I think they were very close to having one.\" Forbes McKenzie says the Americans have a \"very similar inventory of weapons systems\" to the Israelis, \"but of course, they also have the much-talked-about GBU-57\". The GBU-57 is a 30,000lb bomb - the largest non-nuclear bomb in existence. Mr McKenzie explains that it is \"specifically designed to destroy targets which are very deep underground\". Experts say it is the only weapon with any chance of destroying Iran's main enrichment site, which is located underneath a mountain at Fordow. Air-to-air refuelling could allow Israel to carry larger bombs Among the dozens of US aircraft that Sky News tracked over the eastern Mediterranean in recent days, more than a third (18 planes) were designed for air-to-air refuelling. \"These are crucial because Israel is the best part of a thousand miles away from Iran,\" says Sky News military analyst Sean Bell. \"Most military fighter jets would struggle to do those 2,000-mile round trips and have enough combat fuel.\" The ability to refuel mid-flight would also allow Israeli planes to carry heavier munitions, including bunker-buster bombs necessary to destroy the tunnels and silos where Iran stores many of its missiles. Satellite imagery captured on 15 June shows the aftermath of Israeli strikes on a missile facility near the western city of Kermanshah, which destroyed at least 12 buildings at the site. At least four tunnel entrances were also damaged in the strikes, two of which can be seen in the image below. Writing for Jane's Defence Weekly, military analyst Jeremy Binnie says it looked like the tunnels were \"targeted using guided munitions coming in at angles, not destroyed from above using penetrator bombs, raising the possibility that the damage can be cleared, enabling any [missile launchers] trapped inside to deploy\". \"This might reflect the limited payloads that Israeli aircraft can carry to Iran,\" he adds. Penetrator bombs, also known as bunker-busters, are much heavier than other types of munitions and as a result require more fuel to transport. Israel does not have the latest generation of refuelling aircraft, Mr Binnie says, meaning it is likely to struggle to deploy a significant number of penetrator bombs. Israel has struck most of Iran's western missile bases Even without direct US assistance, the Israeli air force has managed to inflict significant damage on Iran's missile launch capacity. Sky News has confirmed Israeli strikes on at least five of Iran's six known missile bases in the west of the country. On Monday, the IDF said that its strategy of targeting western launch sites had forced Iran to rely on its bases in the centre of the country, such as Isfahan - around 1,500km (930 miles) from Israel. Among Iran's most advanced weapons are three types of solid-fuelled rockets fitted with highly manoeuvrable warheads: Fattah-1, Kheibar Shekan and Haj Qassam. The use of solid fuel makes these missiles easy to transport and fast to launch, while their manoeuvrable warheads make them better at evading Israeli air defences. However, none of them are capable of striking Israel from such a distance. Iran is known to possess five types of missile capable of travelling more than 1,500km, but only one of these uses solid fuel - the Sijjil-1. On 18 June, Iran claimed to have used this missile against Israel for the first time. Iran's missiles have caused significant damage Iran's missile attacks have killed at least 24 people in Israel and wounded hundreds, according to the Israeli foreign ministry. The number of air raid alerts in Israel has topped 1,000 every day since the start of hostilities, reaching a peak of 3,024 on 15 June. Iran has managed to strike some government buildings, including one in the city of Haifa on Friday. And on 13 June, in Iran's most notable targeting success so far, an Iranian missile impacted on or near the headquarters of Israel's defence ministry in Tel Aviv. Most of the Iranian strikes verified by Sky News, however, have hit civilian targets. These include residential buildings, a school and a university. On Thursday, one missile hit the Soroka Medical Center in Beersheba, southern Israel's main hospital. More than 70 people were injured, according to Israel's health ministry. Iranian foreign minister Abbas Araghchi said that Iran had struck a nearby technology park containing an IDF cyber defence training centre, and that the \"blast wave caused superficial damage to a small section\" of the hospital. However, the technology park is in fact 1.2km away from where the missile struck. Photos of the hospital show evidence of a direct hit, with a large section of one building's roof completely destroyed. Iran successfully struck the technology park on Friday, though its missile fell in an open area, causing damage to a nearby residential building but no casualties. Israel has killed much of Iran's military leadership  It's not clear exactly how many people Israel's strikes in Iran have killed, or how many are civilians. Estimates by human rights groups of the total number of fatalities exceed 600. What is clear is that among the military personnel killed are many key figures in the Iranian armed forces, including the military's chief of staff, deputy head of intelligence and deputy head of operations. Key figures in the powerful Revolutionary Guard have also been killed, including the militia's commander-in-chief, its aerospace force commander and its air defences commander. On Thursday, Israeli Prime Minister Benjamin Netanyahu said that US assistance was not necessary for Israel to win the war. \"We will achieve all our objectives and hit all of their nuclear facilities,\" he said. \"We have the capability to do that.\"  Forbes McKenzie says that while Israel has secured significant victories in the war so far, \"they only have so much fuel, they only have so many munitions\". \"The Americans have an ability to keep up the pace of operations that the Israelis have started, and they're able to do it for an indefinite period of time.\" Additional reporting by data journalist Joely Santa Cruz and OSINT producers Freya Gibson, Lina-Sirine Zitout and Sam Doak. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Putin says 'Ukraine is ours' and threatens nuclear strike - showing how he feels about Trump",
        "description": "He may have been speaking at an economic forum, but that didn&#8217;t stop Vladimir Putin from issuing his most hawkish comments on Ukraine in a very long time.",
        "url": "https://news.sky.com/story/putin-says-ukraine-is-ours-and-threatens-nuclear-strike-showing-how-he-feels-about-trump-13386502",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-putin-russia_6947078.jpg?20250620210149",
        "type": "Home",
        "Author": "Ivor Bennett",
        "Date Published": "2025-06-20 19:54:00",
        "Headline": "The Russian president's latest comments on the war in Ukraine are in sharp contrast to the Kremlin's recent rhetoric. ",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  He may have been speaking at an economic forum, but that didn’t stop Vladimir Putin from issuing his most hawkish comments on Ukraine in a very long time. During a Q&A at Russia's flagship investment event in St Petersburg, the Kremlin leader was asked what his end game was in the conflict. He replied: \"I have said many times that I consider the Russian and Ukrainian people to be one nation. In this sense, all of Ukraine is ours.\" The answer received rapturous applause from an auditorium full of fawning politicians and business figures. And there was more. \"There is an old rule,\" he said. \"'Where a Russian soldier sets foot, that is ours'.\" In short, he was saying that he wants the whole lot. \n                  Regime change in Iran is 'unacceptable', says the Kremlin\n                 \n                  Kellogg's, Coca-Cola and Brewdog beer on Russian shelves despite sanctions\n                 \n                  Ukraine war: 14 killed as Russian missile and drone attacks strike Kyiv - including American citizen\n                 The comments came as a surprise because they are in sharp contrast to the Kremlin's recent rhetoric. Ever since Donald Trump began his push for a peace deal, Moscow has adopted a softer tone, more conciliatory - in an apparent attempt to show Washington that it is interested in a settlement. But there was none of that kind of language here. Quite the opposite. The Russian president even, for the first time in months, threatened a nuclear strike on Ukraine. Asked how Moscow would respond if Kyiv used a dirty bomb against Russian forces, he promised \"catastrophic\" consequences for his enemy. \"This would be a colossal mistake on the part of those whom we call neo-Nazis on the territory of today's Ukraine,\" he said. \"It could be their last mistake. \"We always respond and respond in kind. Therefore, our response will be very tough.\" Read more:Iran regime change is 'unacceptable', says the KremlinWestern brands on Russian shelves despite sanctions The Kremlin's nuclear sabre-rattling was an almost weekly feature during the last days of the Biden administration, but the sabres stilled when Mr Trump came to power. But now, all of a sudden, he's returned to it. It felt like a very deliberate message from Vladimir Putin that, despite peace talks, Russia has no intention of backing down, neither on the battlefield nor at the negotiating table. I think it shows that Moscow is not too worried about upsetting Donald Trump. The American leader appears to have distanced himself from trying to mediate the conflict, but still seems to be pursuing warmer ties with Moscow. So I think these comments also show how confident Putin is that things are going his way."
    },
    {
        "title": "'Don't kill the ill' vs 'What a relief': Two terminally ill people on the assisted dying vote",
        "description": "Over the past year, Sky News has been following the journeys of two people who are terminally ill and on opposite sides of the assisted dying debate.&#160;",
        "url": "https://news.sky.com/story/dont-kill-the-ill-vs-what-a-relief-two-terminally-ill-people-on-the-assisted-dying-vote-13386479",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-philip-clare_6947034.jpg?20250620203305",
        "type": "Home",
        "Author": "Sadiya Chowdhury, news correspondent, and Lauren Hardaway, producer",
        "Date Published": "2025-06-20 19:11:00",
        "Headline": "Philip and Clare have spoken to Sky News multiple times over the past year, as the debate about assisted dying has continued. ",
        "Content": "By Sadiya Chowdhury, news correspondent, and Lauren Hardaway, producer    Over the past year, Sky News has been following the journeys of two people who are terminally ill and on opposite sides of the assisted dying debate.  Philip, a Christian pastor, views it as suicide and says supporters of the bill need more faith. Clare, a former counsellor, thinks it should be a personal choice, which for her could offer a good death. Philip died two days before Friday's historic vote, which saw MPs vote in favour of assisted dying. \"Kill the bill, don't kill the ill,\" he told Sky News days before he died. Philip said better palliative care can make all the difference. \"I still believe it's because of money. It would save millions and millions if they bump off people like me and Clare and others.\" Philip was resting in a bed in his living room when we spoke to him. Doctors had told him he had just days left. \n                  The assisted dying debate has been politics – but not as we know it\n                 \n                  Assisted dying bill: How both sides of debate reacted to historic vote\n                 \n                  MPs back legalising assisted dying in England and Wales after historic Commons vote\n                 He was struggling to eat and experiencing hallucinations. \"Just now, I went to kiss [my wife] Pauline and she's not there.\" He pointed to a corner of a biscuit he'd been eating over the last three days that's \"not even as big as my thumb\". \"That's the maximum amount of food I can eat because I'm blocked with cancer.\" \"Logically, I should be screaming and ranting and shouting. But I've been organising things like the funeral,\" he said, explaining that his belief in Jesus means he's at peace with death, however it comes. At times he cries and very often, he winces in pain. Asked what it would mean if the vote was passed, Philip said it would be \"a terrible step downwards\". Assisted dying would desensitise the British public to death, he explained. \"I personally am totally against it, because you're missing out on what God's planned for you. \"Because even now, he knows what's going to happen in me, he knows what's going to happen in the other people.\" He added: \"You'll miss the support of people who love you. Because there are people who love you. If you just reach out to them.\" Philip died on Wednesday morning, two days before the bill's third reading and ascension to the House of Lords. Clare is sitting in her friend's garden in Cirencester, Gloucestershire, surrounded by nature and absorbing the news that the vote has passed. She tells Sky News: \"Oh what a relief! Thank goodness. Thank you to all those people who were brave.\" Clare has breast cancer which has spread to her bones. Her doctors say her lungs have hardened, making it more difficult for her to breathe. \"I'm breathless all the time especially if I'm talking. I can't walk very far without being breathless. Now my heart has to work very, very hard to keep my oxygen levels up.\" Read more: How did your MP vote on the assisted dying bill? Clare has supported the Terminally Ill Adults (End of Life) Bill from its inception and calls it a \"difficult subject\". \"People are very fearful,\" she says, before acknowledging that concerns remain for vulnerable people at risk of coercion. \"Lots of people have been in controlling relationships, and I really understand how that works. \"I've got daughters and I can understand situations where people are thinking, 'oh, I don't want to be a burden on somebody else' and all of that. But I think it's [worth] remembering that this is one choice out of many.\" Clare is aware it is unlikely the law will change before she dies. \"It won't for [be there] me and it hasn't come in time for lots of people, has it?\" she says. \"All the people that have gone before that would've liked this choice to avoid suffering and indignity.\" Read more:The assisted dying debate has been politics - but not as we know itHow both sides of debate reacted to historic vote Clare turns 60 this year and is marking her birthday with 60 memorable days. \"I'm enjoying life,\" she says with a big smile. \"I don't want to die, but we all have to go.\" Assisted dying won't be for everyone in the way death is. But it has and may well continue to be a political issue with people right at its heart."
    },
    {
        "title": "Palestine Action to be banned after break in at RAF base, Sky News understands",
        "description": "The home secretary is planning to proscribe the Palestine Action group, effectively branding it as a terrorist organisation, Sky News understands. ",
        "url": "https://news.sky.com/story/palestine-action-to-be-banned-after-break-in-at-raf-base-sky-news-understands-13386424",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-plane-brize_6946805.jpg?20250620155035",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-20 17:05:00",
        "Headline": "It comes after pro-Palestinian activists targeted RAF Brize Norton and damaged two military aircraft.",
        "Content": " The home secretary is planning to proscribe the Palestine Action group, effectively branding it as a terrorist organisation, Sky News understands.  Yvette Cooper is preparing a written ministerial statement which would make becoming a member of the group illegal. The statement is expected on Monday and will then need to be enacted through new legislation. It comes after pro-Palestinian activists targeted RAF Brize Norton and damaged two military aircraft - with Sir Keir Starmer describing their actions as \"disgraceful\". A security review has now been launched after the breach. Brize Norton, in Oxfordshire, is the largest RAF station with approximately 5,800 service personnel, 300 civilian staff and 1,200 contractors. In a video shared by Palestine Action on Friday morning, a person can be seen approaching an aircraft on a scooter as music is played. The person then sprays paint into one of the plane's engines. Red paint can be seen on the ground. \n                  Ex-classmates died after being treated at same mental health hospital - as concerns raised over more deaths\n                 \n                  MPs back legalising assisted dying in England and Wales after historic Commons vote\n                 \n                  How did your MP vote on the assisted dying bill?\n                 Repurposed fire extinguishers were used to spray the paint into the turbine engines of two Airbus Voyagers, while further damage was made using crowbars. The organisation - which focuses its campaigns on multinational arms dealers and has previously targeted corporate banks - said it had damaged two military planes at the base, where flights depart on a daily basis for RAF Akrotiri in Cyprus. The group said two activists \"broke into the largest air force base in Britain and used electric scooters to swiftly manoeuvre towards the planes\". They said they did so because \"despite publicly condemning the Israeli government, Britain continues to send military cargo, fly spy planes over Gaza and refuel US/Israeli fighter jets\". \"Britain isn't just complicit, it's an active participant in the Gaza genocide and war crimes across the Middle East,\" the group said in a statement. \"By decommissioning two military planes, Palestine Action have directly intervened in the genocide and prevented crimes against the Palestinian people.\" However a senior RAF source told Sky News's security and defence editor Deborah Haynes that the aircraft have nothing to do with Israel's war in Gaza. Read more:PM could allow Trump use of British bases to attack IranChina - UK warship sailed through Taiwan Strait to 'cause trouble' After it emerged the government was planning to ban Palestine Action, the group wrote on X: \"We represent every person who stands for Palestinian liberation. If they want to ban us, they ban us all.\" The two Voyagers - out of a fleet of 10 currently being used by the RAF - have been impounded while an investigation into the extent of the damage is carried out. On X, the prime minister condemned the \"act of vandalism\", adding: \"Our Armed Forces represent the very best of Britain and put their lives on the line for us every day. It is our responsibility to support those who defend us.\" The Ministry of Defence (MoD) confirmed it is \"working closely with the police, who are investigating\". A \"proscribed organisation\" is an organisation or group that is illegal to join or show support for, because it has been identified as being concerned in terrorism. The home secretary has the powers to proscribe an organisation under the Terrorism Act 2000, if that organisation commits or participates in acts of terrorism, prepares for terrorism, promotes or encourages terrorism (including the unlawful glorification of terrorism); or is otherwise concerned in terrorism."
    },
    {
        "title": "Bayesian: Sunken British superyacht emerges from seabed",
        "description": "Salvage teams have managed to raise a British superyacht which capsized and sank 10 months ago off the coast of Sicily during a storm.",
        "url": "https://news.sky.com/story/bayesian-sunken-british-superyacht-emerges-from-seabed-13386364",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bayesian-superyacht_6946955.jpg?20250620190631",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-20 14:52:00",
        "Headline": "Captain Nick Sloane, who was behind the salvage of the Costa Concordia cruise ship in 2014, told Sky News this recovery operation will be a complex process.",
        "Content": " Salvage teams have managed to raise a British superyacht which capsized and sank 10 months ago off the coast of Sicily during a storm. The white top and blue hull of the 56-metre (184ft) Bayesian emerged from the depths of the sea for the first time since the tragedy last August which claimed seven lives, including tech tycoon Mike Lynch and his daughter. TMC Maritime, which is conducting the recovery operation, said the vessel has been slowly raised from the seabed, 50 metres (165ft) down, over the past three days to allow the steel lifting straps, slings and harnesses to be secured under the keel. On Friday, the top of the passenger area - where the accommodation was located - became visible above the water. Captain Nick Sloane, who was behind the salvage of the Costa Concordia cruise ship in 2014, told Sky News's Ashna Hurynag this recovery operation will be a complex process. He said: \"When they do that initial lift, they'll stabilise it just off the seabed and they'll do a double inspection to make sure that all the rigging points where the recovery straps are placed are in the right place.\" Captain Sloane said experts will inspect the base for other damage, remove water from internal spaces and preserve any evidence for investigators, but he added that ultimately, salvage teams will treat the yacht \"as a graveyard\". \n                  Bayesian recovery: First pieces of Mike Lynch's sunken superyacht brought to surface\n                 \n                  Family of drowned Bayesian yacht chef has 'serious concerns about failures'\n                 \n                  Guests used furniture as 'improvised ladder' to escape capsized Bayesian superyacht\n                 \"It's a very high-profile recovery because of the incident and the personalities that were lost in the tragedy,\" he said. The British-flagged luxury superyacht sank on 19 August 2024 off Porticello near Palermo during a violent storm, killing the boat's owner Mike Lynch, his 18-year-old daughter Hannah and five others. Fifteen people survived, including Mr Lynch's wife Angela Bacares, the captain and all crew members except the chef. Work began in May to recover the ship, with pieces of wreckage being pulled from the water, although progress has been hampered after a diver died last month during salvage efforts.  When the Bayesian resurfaced, the vessel was missing its 72-metre (236ft) mast, which was cut down and left on the seabed for future removal. The mast had to be detached to allow the hull to be brought to a nearly upright position that would allow the craft to be surfaced, TMC Maritime said earlier this week. Inquest proceedings in the UK are looking at the deaths of Mr Lynch and his daughter, as well as Morgan Stanley International bank chairman Jonathan Bloomer and his wife Judy, who were all British nationals. The others who died in the sinking were US lawyer Chris Morvillo and his wife Neda Morvillo, and Canadian-Antiguan national Recaldo Thomas, who was working as a chef on the vessel. Read more:Who was on superyacht when it sank?Passengers suffocated in air bubbleYacht chef's family has 'serious concerns' UK investigators issued an interim report in May which said the yacht was knocked over by \"extreme wind\" and could not recover. The report stated that the Bayesian had chosen the site where it sank as shelter from forecast thunderstorms. Wind speeds exceeded 70 knots (81mph) at the time of the sinking and \"violently\" knocked the vessel over to a 90-degree angle in under 15 seconds. Mr Lynch had been celebrating his recent acquittal on fraud charges with his family and the people who had defended him at trial."
    },
    {
        "title": "Missing Rolex case: Woman in court charged with murder after 69-year-old sister stabbed in her north London flat",
        "description": "A woman has appeared in court charged with the murder of her 69-year-old sister who was stabbed in her home.",
        "url": "https://news.sky.com/story/missing-rolex-case-woman-in-court-charged-with-murder-after-69-year-old-sister-stabbed-in-her-north-london-flat-13386056",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jennifer-abbott-rolex_6945264.jpg?20250618152931",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-20 08:08:00",
        "Headline": "Jennifer Abbott was found dead by her niece and neighbours, who broke her door down after her family had not heard from her for several days. She had last been seen walking her corgi in the area on 10 June.",
        "Content": "A woman has appeared in court charged with the murder of her 69-year-old sister who was stabbed in her home. Jennifer Abbott - also known as Sarah Steinberg - was pronounced dead at her flat in Camden, north London, last Friday. Police previously said they believed the death could be linked to a missing diamond-encrusted Rolex watch. Nancy Pexton, also 69, appeared at Highbury Magistrates' Court today, where she spoke only to confirm her name and date of birth. It is understood she is nine months younger than her sister. Pexton, of no fixed address, wore a grey prison issue tracksuit at the short hearing. She was remanded in custody to appear at the Old Bailey on Tuesday 24 June. Ms Abbott was found by her niece and neighbours, who broke her door down after her family had not heard from her for several days. \n                  Ex-classmates died after being treated at same mental health hospital - as concerns raised over more deaths\n                 \n                  MPs back legalising assisted dying in England and Wales after historic Commons vote\n                 \n                  How did your MP vote on the assisted dying bill?\n                 She had last been seen walking her corgi in the area on 10 June. A post-mortem examination gave her cause of death as sharp force trauma. Detective Inspector Barry Hart previously said: \"Our deepest sympathies are with the victim's loved ones who are being supported by specialist officers at this time.\" There has been an increased police presence in the area as detectives explore \"several lines of inquiry\". Neighbours described Ms Abbott as \"exuberant\" and \"vivacious\"."
    },
    {
        "title": "Target to reach one million Welsh speakers by 2050 has been set - but how likely is it?",
        "description": "Wales's government has set the aim of having one million Welsh speakers by 2050 - along with a doubling of the daily use of the language by then - but is that target achievable?",
        "url": "https://news.sky.com/story/target-to-reach-one-million-welsh-speakers-by-2050-has-been-set-but-how-likely-is-it-13385469",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-welsh-language-wales_6946799.jpg?20250620154615",
        "type": "Home",
        "Author": "Tomos Evans",
        "Date Published": "2025-06-20 23:01:00",
        "Headline": "Some efforts to increase the prominence of the language in recent years, including the Brecon Beacons National Park's decision to refer to itself only by its Welsh name Bannau Brycheiniog, have faced criticism from some quarters.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n Wales's government has set the aim of having one million Welsh speakers by 2050 - along with a doubling of the daily use of the language by then - but is that target achievable? Figures from the latest census in 2021 showed a fall in the number of people who could speak Welsh compared to a decade earlier. An estimated 538,000 people in Wales - or 17.8% of the population - said they could speak Welsh, compared to 562,000 in 2011 (or 19% of the population). Some efforts to increase the prominence of the language in recent years, including the Brecon Beacons National Park's decision to refer to itself only by its Welsh name Bannau Brycheiniog, have faced criticism from some quarters. But a YouGov poll of more than 1,300 Welsh people earlier this year found two-thirds (67%) were in favour of efforts to increase the use of the Welsh language, compared to a fifth (20%) who were against. Efa Gruffudd Jones, the commissioner tasked with promoting the use of the language, published her manifesto for next year's Senedd election on Friday. She told Sky News the Welsh language's position had \"stayed fairly constant over the last 20 years\". \"If we really want to change anything going forward, we need to change some of the things that we do,\" she said. \"[Targets] are inspirational, they can inspire people to do more. But, on its own, setting a target doesn't mean that you achieve it. \"So I really think we need to think hard about how we increase the numbers of Welsh speakers and how we ensure that more people can use it in their daily lives.\" Reform UK's leader Nigel Farage told ITV Wales last month that he would scrap the target if the party forms the next Welsh government. In her manifesto, Ms Gruffudd Jones has five key proposals for the next Welsh government as people in Wales prepare to head to the polls in May next year. They include increased use of the language in workplaces, more public services available in Welsh and mandatory Welsh language training for newly-qualified teachers, with the commissioner insisting such a move would not \"alienate\" potential new recruits to the profession. \"It's about creating the opportunity for everyone who wants to come into the workforce to be able to develop their skills and to be able to make sure that every child who wants Welsh-medium education in Wales [is able] to receive it,\" she said. At Welsh-medium secondary schools, at least 60% of learners have a minimum of 70% of their lessons in Welsh, according to Welsh government criteria. And at Welsh-medium primary schools, at least 80% of pupils' school activities will be in Welsh from the age of seven onwards. 'Nothing to be afraid of' The Welsh language commissioner published a report last month which found young people's use of the language socially, including on social media, was \"limited\". Gwynedd Council, in northwest Wales, has outlined plans to make Welsh the \"principal language\" of education across the county, in an effort to boost the number of people who leave school speaking the language. The proposals, which are subject to public consultation over the coming months, are set to \"remove bilingualism and bilingual teaching\" from its schools' policy. But Councillor Dewi Jones, the cabinet member for education on Gwynedd Council, has insisted English-medium education \"is not being phased out\". He told Sky News that pupils moving to Gwynedd from outside of Wales would be given support with their Welsh through the county's language immersion units. \"There's nothing to be afraid of here, I'm completely confident that any latecomers to the county will be able to fully integrate and become fully bilingual,\" Cllr Jones added. He said the council was \"very proud\" to have a \"very high number of Welsh speakers\" in the area, \"especially among young people\". \"But we're ambitious to go beyond that and ensure that all young people in Gwynedd are fully bilingual so that they have the benefits of both the Welsh language and the English language,\" he said. 'Academic language' In Ysgol Cwm Rhymni, a Welsh-medium secondary school in Caerphilly, Year 12 students have just finished their exams and are starting to think about the next steps after school. Mili, who speaks Welsh at home with her family, said the language was an \"integral part\" of her life. \"For many students, their parents don't speak Welsh, so they don't hear Welsh on a more social level, it's more of an academic language for them,\" she told Sky News. Another student Megan said there were \"a lot of people\" who wanted to use Welsh outside of school but there were \"a lack of things for them to be able to use Welsh\". \"People would be willing to speak Welsh if there are things there to allow them to speak the language once they've learned it,\" she added. Student Ben said there was a \"lack of places where you can speak Welsh in the south that aren't schools or festivals\". Meanwhile, fellow student Maisie said there were already \"a lot of opportunities\" to use Welsh outside of school, such as in Welsh-speaking groups, but they weren't \"advertised\" enough. On the streets of Cardiff Bay, opinions were mixed over the target to reach a million Welsh speakers by 2050. \"I think we could [reach it] because there are a lot of Welsh schools now, and all the schools are learning to speak Welsh,\" one woman said. \"I don't know if you will get to a million, but I certainly would aim for that, as close to that as you can,\" another added. One man said it was unrealistic as Cardiff was \"not a Welsh-speaking capital\" but that the language was spoken more widely in other areas. Read more:Rare 1588 Welsh Bible goes on display10 Welsh terms added to Oxford English dictionary What do the political parties say? Plaid Cymru's Welsh language spokesperson Heledd Fychan said the party has \"a range of progressive and radical policies\" on the Welsh language and that Wales needed \"a government that is willing to act\". Tom Giffard, the Welsh Conservatives' shadow Welsh language secretary, said \"neither language should be squeezed out of any area\" and it must be ensured that \"additional bureaucratic strain is not placed on the health or education services\". Jane Dodds, leader of the Welsh Liberal Democrats, said the party supports the vision to \"expand the use of Welsh across public services, workplaces, and education\" but that the proposals should be delivered in a way that is \"fair\" and \"inclusive\". The Labour Party declined to comment and Reform UK did not respond."
    },
    {
        "title": "MPs back legalising assisted dying in England and Wales after historic Commons vote",
        "description": "MPs have voted to approve a historic bill that would legalise assisted dying in England and Wales.",
        "url": "https://news.sky.com/story/mps-back-legalising-assisted-dying-in-historic-commons-vote-13386047",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-assisted-dying-bill_6946746.jpg?20250620145020",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2025-06-20 13:29:00",
        "Headline": "More than 300 MPs backed a bill that would allow terminally ill adults with a life expectancy of less than six months to apply for an assisted death.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  MPs have voted to approve a historic bill that would legalise assisted dying in England and Wales. The Terminally Ill Adults (End of Life) Bill was approved by 314 votes to 291 at its third reading in the House of Commons - a majority of 23. Politics Live: MPs back legalising assisted dying in historic Commons vote Labour MP Kim Leadbeater, who proposed the legislation, was seen crying in the chamber as it went through. Campaign group Dignity in Dying hailed the result as \"a landmark moment for choice, compassion and dignity at the end of life\". \"MPs have listened to dying people, to bereaved families and to the public, and have voted decisively for the reform that our country needs and deserves,\" said Sarah Wootton, its chief executive. The bill will now go to the House of Lords, where it will face further scrutiny before becoming law. Due to a four-year \"backstop\" added to the bill, it could be 2029 before assisted dying is actually offered, potentially coinciding with the end of this government's parliament. The bill would allow terminally ill adults with fewer than six months to live to apply for an assisted death, subject to approval by two doctors and a panel featuring a social worker, senior legal figure and psychiatrist. MPs have deliberated the proposals for months, with a vote in November passing with a bigger majority of 55.  Since then it has undergone some significant changes, the most controversial being the replacement of a High Court Judge's approval with the expert panel. Ms Leadbeater has always insisted her legislation would have the most robust safeguards of any assisted dying laws in the world.  Opening the debate on Friday she said that opposing the bill \"is not a neutral act. It is a vote for the status quo\". She warned that if her plan was rejected, MPs would be asked to vote on it again in 10 years and \"that fills me with despair\". Health correspondent A chain of events that started with the brutal murder of an MP almost 10 years ago has today led to historic societal change - the like of which many of us will never see again.   Assisted dying will be legalised in England and Wales. In four years' time adults with six months or less to live and who can prove their mental capacity will be allowed to choose to die.  Kim Leadbeater, the MP who has made this possible, never held political aspirations. Previously a lecturer in health, Ms Leadbeater reluctantly stood for election after her sister Jo Cox was fatally stabbed and shot to death in a politically motivated attack in 2016. \n\nAnd this is when, Ms Leadbeater says, she was forced to engage with the assisted dying debate. Because of the sheer volume of correspondence from constituents asking her to champion the cause. \n Polls have consistently shown some 70% of people support assisted dying. And ultimately, it is this seismic shift in public opinion that has carried the vote. Britain now follows Canada, the USA, Belgium, Switzerland, the Netherlands and Australia. All countries with sophisticated health systems. Nowhere has assisted dying been reversed once introduced. \n\n The relationship between doctor and patient will now also change. The question is being asked: Is an assisted death a treatment? There is no decisive answer. But it is a conversation that will now take place. The final answer could have significant consequences, especially in mental health settings. \n\n There are still many unknowns. Who will be responsible for providing the service? The NHS? There is a strong emotional connection to the health service and many would oppose the move. But others will argue that patients trust the institution and would want to die in its arms. \n\n The challenge for health leaders will be to try and reconcile the bitter divisions that now exist within the medical community. The Royal Colleges have tried to remain neutral on the issue, but continued to challenge Ms Leadbeater until the very end. \n\n Their arguments of a failure of safeguards and scrutiny did not resonate with MPs. And nor did concerns over the further erosion of palliative care.  Ms Leadbeater's much-repeated insistence that  \"this is the most scrutinised legislation anywhere in the world\" carried the most weight. \n\n Her argument that patients should not have to fear prolonged, agonising deaths or plan trips to a Dignitas clinic to die scared and alone, or be forced to take their own lives and have their bodies discovered by sons, daughters, husbands and wives because they could not endure the pain any longer was compelling.  The country believed her. The assisted dying debate was last heard in the Commons in 2015, when it was defeated by 330 votes to 118. There have been calls for a change in the law for decades, with a campaign by broadcaster Dame Esther Rantzen giving the issue renewed attention in recent years. Supporters have described the current law as not being fit for purpose, with desperate terminally ill people feeling the need to end their lives in secret or go abroad alone, for fear loved ones will be prosecuted for helping them. Ahead of the vote, an hours-long emotionally charged debate heard MPs tell personal stories about their friends and family. Maureen Burke, the Labour MP for Glasgow North East, spoke about how her terminally ill brother David was in so much pain from advanced pancreatic cancer that one of the last things he told her was that \"if there was a pill that he could take to end his life, he would very much like to take that\". She said she was \"doing right by her brother\" in voting for it. How did MPs vote? MPs were given a free vote, meaning they could vote with their conscience and not along party lines. The division list shows Prime Minister Sir Keir Starmer voted in favour of the bill, but Conservative leader Kemi Badenoch voted against. Health Secretary Wes Streeting and Justice Secretary Shabana Mahmood, who will have to deliver the bill, also voted no. Read more: Find out how your MP voted Bill 'poorly drafted' Opponents have raised both practical and ethical concerns, including that people could be coerced into seeking an assisted death and that the bill has been rushed through. Veteran Labour MP Diane Abbott said she was not opposed to the principle of assisted dying but called the legislation \"poorly drafted\". Former foreign secretary James Cleverly echoed those concerns, saying he is \"struck by the number of professional bodies which are neutral on the topic of assisted dying in general, but all are opposed to the provisions of this bill\". Recently, the Royal College of Psychiatrists, the Royal College of Pathologists and the Royal College of Physicians have raised concerns about the bill, including that there is a shortage of staff to take part in assisted dying panels.  However, public support for a change in the law remains high, according to a YouGov poll published on the eve of the vote. The survey of 2,003 adults in Great Britain suggested 73% of those asked last month were supportive of the bill, while the proportion of people who feel assisted dying should be legal in principle stood at 75%."
    },
    {
        "title": "Ex-classmates died after being treated at same mental health hospital - as concerns raised over more deaths",
        "description": "They were former classmates who both died after receiving care from the same mental health hospital three years apart.",
        "url": "https://news.sky.com/story/ex-classmates-died-after-being-treated-at-same-mental-health-hospital-as-concerns-raised-over-more-deaths-13359275",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nhs-manslaughter_6906064.png?20250504153701",
        "type": "UK",
        "Author": "Megan Harwood-Baynes and Laura Bundock, Sky News health team",
        "Date Published": "2025-06-20 23:01:00",
        "Headline": "Sky News investigates a number of deaths linked to a London NHS trust that was recently convicted in the case of 22-year-old Alice Figueiredo.",
        "Content": "By Megan Harwood-Baynes and Laura Bundock, Sky News health team    They were former classmates who both died after receiving care from the same mental health hospital three years apart. Warning: This article contains reference to suicide Multiple failings led to the death of 22-year-old Alice Figueiredo - who took her own life in July 2015 - and the NHS trust responsible for her care was charged with corporate manslaughter. Last week, following a months-long trial, the trust was found not guilty of that charge but was convicted of serious health and safety failings. Karis Braithwate, who had gone to school with Alice, also died in 2018, having been treated by the same NHS trust. Reports seen by Sky News detail a decade of deaths at North East London NHS Foundation Trust (NELFT), with coroners repeatedly raising concerns about the mental health services provided by the trust - in particular at Goodmayes Hospital in Ilford. Rushed assessments and neglect were often cited. One patient was marked as alive and well, even though he had taken his own life inside the hospital the previous day. Another patient told staff he was hearing voices telling him to kill himself, yet staff did not remove crucial items from his possession - items he would later use to take his own life. Karis, 24, was sent to Goodmayes Hospital after she tried to take her own life at a train station in October 2018. The next day, staff spent 27 minutes assessing her and a further two minutes confirming their conclusion. She was discharged from hospital in the afternoon. She then went to a nearby railway station and took her own life. Her death came less than an hour after she had left the hospital. Karis had been friends with Alice, her mother said. The pair had been classmates at the same school. Karis told her mother she was upset at being put on the same ward where Alice had taken her own life three years earlier. Her stepfather Mark Bambridge called Karis sweet and kind and said she often \"struggled with life\". He felt relief when she was taken to hospital, saying: \"She was in a place where she would be taken care of.\" Karis's mother - who asked not to be named - said her daughter confided in her about the neglect she endured at the hospital. Karis told her mother that her carer would sleep when they were supposed to be watching over her and said she never felt safe. \"She spoke of her belongings going missing, of being treated with indifference and disrespect, and of staff who showed little concern for her wellbeing,\" her mother said. Karis's mother said her daughter was failed by the hospital and the family was offered only a \"hollow, superficial and indifferent 'apology' from the administration team of those who were meant to protect her\". In the wake of the verdict in Alice's case, Karis's mother said: \"I am holding Alice's family in my thoughts and praying they receive the justice they - and we - so clearly need and deserve.\" A spokesperson for NELFT called Karis's death a \"profound tragedy\" and said the trust had conducted an in-depth review of patient safety since 2018, \"resulting in significant changes in the way we assess risk of suicide\". \"We train our staff to consider the trauma in a patient's history, rather than focusing solely on their current crisis,\" the spokesperson added. \"This approach allows us to see the person behind the diagnosis, making it easier to identify warning signs and support safe recovery.\" The trust said it had also improved record-keeping and communication between emergency workers and mental health practitioners. The man marked as alive after he'd died Sky News looked at more than 20 prevention of future death reports, which are written by a coroner to draw attention to a matter in which they think action could be taken to prevent future deaths. Behind each report is a different person, but there are some strikingly similar themes - failure to carry out adequate risk assessments; issues sharing and recording information; neglect. One report said staff at Goodmayes Hospital \"panicked and did not follow policy\" in the wake of a man's death in 2021, instead writing that he was still alive when he had died the day before. Speaking in response at the time, the trust said it had written a \"detailed action plan\" to address concerns raised. Another report said one woman developed deep vein thrombosis after she was left to sit motionless in her room. She had not eaten or drunk anything in the two days before her death, and the trust was criticised for failing to record her food intake. Responding to the report at the time, the trust said it had implemented new policies to learn from her death. Issues stretched beyond Goodmayes Hospital and spanned the entire NHS trust. One man was not given any community support and overdosed after his access to medication was not limited. Another man, a father of three, was detained under the Mental Health Act but released from Goodmayes after just a few hours. The 39-year-old was found dead two weeks later after being reported missing by his family. At his inquest, a coroner raised concerns about the lack of a detailed assessment around him, with a junior doctor saying he was the only doctor available for 11 wards and 200 patients. 'Don't kill yourself on my shift' It has been 10 years since Alice took her own life inside the walls of Goodmayes Hospital. But current patients say the issues haven't gone away. Teresa Whitbread said her 18-year-old granddaughter Chantelle was a high suicide risk but she still managed to escape from the hospital \"20 times\". \"I walked in one day and said, 'Where is Chantelle?', and no one could tell me,\" she told Sky News. On another occasion, Chantelle managed to get into the medical room and stabbed herself and a nurse with a needle. She said one nurse told her granddaughter: \"Don't kill yourself on my shift. Wait until you go home and kill yourself.\" Teresa grew emotional as she talked about her granddaughter, once a vibrant young girl and avid boxer, whose treatment is now managed by community services. \"It's made her worse,\" Teresa said of Chantelle's experience at Goodmayes Hospital. \"There's no care, there's no care plan, there's no treatment.\" The NEFLT said it could not comment on specific cases but added that \"patient safety is our absolute priority, and we work closely with our patients and their families to ensure we provide compassionate care tailored to their needs\". Chantelle's family say she is a shell of her former self and have begged mental health services not send her back to Goodmayes. \"Something has to change, and if it doesn't change, [the hospital] needs to be closed down,\" Teresa said. \"Because people are not safe in there.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Palestine Action to be banned after break in at RAF base, Sky News understands",
        "description": "The home secretary is planning to proscribe the Palestine Action group, effectively branding it as a terrorist organisation, Sky News understands. ",
        "url": "https://news.sky.com/story/palestine-action-to-be-banned-after-break-in-at-raf-base-sky-news-understands-13386424",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-plane-brize_6946805.jpg?20250620155035",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-20 17:05:00",
        "Headline": "It comes after pro-Palestinian activists targeted RAF Brize Norton and damaged two military aircraft.",
        "Content": " The home secretary is planning to proscribe the Palestine Action group, effectively branding it as a terrorist organisation, Sky News understands.  Yvette Cooper is preparing a written ministerial statement which would make becoming a member of the group illegal. The statement is expected on Monday and will then need to be enacted through new legislation. It comes after pro-Palestinian activists targeted RAF Brize Norton and damaged two military aircraft - with Sir Keir Starmer describing their actions as \"disgraceful\". A security review has now been launched after the breach. Brize Norton, in Oxfordshire, is the largest RAF station with approximately 5,800 service personnel, 300 civilian staff and 1,200 contractors. In a video shared by Palestine Action on Friday morning, a person can be seen approaching an aircraft on a scooter as music is played. The person then sprays paint into one of the plane's engines. Red paint can be seen on the ground. \n                  Ex-classmates died after being treated at same mental health hospital - as concerns raised over more deaths\n                 \n                  MPs back legalising assisted dying in England and Wales after historic Commons vote\n                 \n                  How did your MP vote on the assisted dying bill?\n                 Repurposed fire extinguishers were used to spray the paint into the turbine engines of two Airbus Voyagers, while further damage was made using crowbars. The organisation - which focuses its campaigns on multinational arms dealers and has previously targeted corporate banks - said it had damaged two military planes at the base, where flights depart on a daily basis for RAF Akrotiri in Cyprus. The group said two activists \"broke into the largest air force base in Britain and used electric scooters to swiftly manoeuvre towards the planes\". They said they did so because \"despite publicly condemning the Israeli government, Britain continues to send military cargo, fly spy planes over Gaza and refuel US/Israeli fighter jets\". \"Britain isn't just complicit, it's an active participant in the Gaza genocide and war crimes across the Middle East,\" the group said in a statement. \"By decommissioning two military planes, Palestine Action have directly intervened in the genocide and prevented crimes against the Palestinian people.\" However a senior RAF source told Sky News's security and defence editor Deborah Haynes that the aircraft have nothing to do with Israel's war in Gaza. Read more:PM could allow Trump use of British bases to attack IranChina - UK warship sailed through Taiwan Strait to 'cause trouble' After it emerged the government was planning to ban Palestine Action, the group wrote on X: \"We represent every person who stands for Palestinian liberation. If they want to ban us, they ban us all.\" The two Voyagers - out of a fleet of 10 currently being used by the RAF - have been impounded while an investigation into the extent of the damage is carried out. On X, the prime minister condemned the \"act of vandalism\", adding: \"Our Armed Forces represent the very best of Britain and put their lives on the line for us every day. It is our responsibility to support those who defend us.\" The Ministry of Defence (MoD) confirmed it is \"working closely with the police, who are investigating\". A \"proscribed organisation\" is an organisation or group that is illegal to join or show support for, because it has been identified as being concerned in terrorism. The home secretary has the powers to proscribe an organisation under the Terrorism Act 2000, if that organisation commits or participates in acts of terrorism, prepares for terrorism, promotes or encourages terrorism (including the unlawful glorification of terrorism); or is otherwise concerned in terrorism."
    },
    {
        "title": "'Don't kill the ill' vs 'What a relief': Two terminally ill people on the assisted dying vote",
        "description": "Over the past year, Sky News has been following the journeys of two people who are terminally ill and on opposite sides of the assisted dying debate.&#160;",
        "url": "https://news.sky.com/story/dont-kill-the-ill-vs-what-a-relief-two-terminally-ill-people-on-the-assisted-dying-vote-13386479",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-philip-clare_6947034.jpg?20250620203305",
        "type": "UK",
        "Author": "Sadiya Chowdhury, news correspondent, and Lauren Hardaway, producer",
        "Date Published": "2025-06-20 19:11:00",
        "Headline": "Philip and Clare have spoken to Sky News multiple times over the past year, as the debate about assisted dying has continued. ",
        "Content": "By Sadiya Chowdhury, news correspondent, and Lauren Hardaway, producer    Over the past year, Sky News has been following the journeys of two people who are terminally ill and on opposite sides of the assisted dying debate.  Philip, a Christian pastor, views it as suicide and says supporters of the bill need more faith. Clare, a former counsellor, thinks it should be a personal choice, which for her could offer a good death. Philip died two days before Friday's historic vote, which saw MPs vote in favour of assisted dying. \"Kill the bill, don't kill the ill,\" he told Sky News days before he died. Philip said better palliative care can make all the difference. \"I still believe it's because of money. It would save millions and millions if they bump off people like me and Clare and others.\" Philip was resting in a bed in his living room when we spoke to him. Doctors had told him he had just days left. \n                  The assisted dying debate has been politics – but not as we know it\n                 \n                  Assisted dying bill: How both sides of debate reacted to historic vote\n                 \n                  MPs back legalising assisted dying in England and Wales after historic Commons vote\n                 He was struggling to eat and experiencing hallucinations. \"Just now, I went to kiss [my wife] Pauline and she's not there.\" He pointed to a corner of a biscuit he'd been eating over the last three days that's \"not even as big as my thumb\". \"That's the maximum amount of food I can eat because I'm blocked with cancer.\" \"Logically, I should be screaming and ranting and shouting. But I've been organising things like the funeral,\" he said, explaining that his belief in Jesus means he's at peace with death, however it comes. At times he cries and very often, he winces in pain. Asked what it would mean if the vote was passed, Philip said it would be \"a terrible step downwards\". Assisted dying would desensitise the British public to death, he explained. \"I personally am totally against it, because you're missing out on what God's planned for you. \"Because even now, he knows what's going to happen in me, he knows what's going to happen in the other people.\" He added: \"You'll miss the support of people who love you. Because there are people who love you. If you just reach out to them.\" Philip died on Wednesday morning, two days before the bill's third reading and ascension to the House of Lords. Clare is sitting in her friend's garden in Cirencester, Gloucestershire, surrounded by nature and absorbing the news that the vote has passed. She tells Sky News: \"Oh what a relief! Thank goodness. Thank you to all those people who were brave.\" Clare has breast cancer which has spread to her bones. Her doctors say her lungs have hardened, making it more difficult for her to breathe. \"I'm breathless all the time especially if I'm talking. I can't walk very far without being breathless. Now my heart has to work very, very hard to keep my oxygen levels up.\" Read more: How did your MP vote on the assisted dying bill? Clare has supported the Terminally Ill Adults (End of Life) Bill from its inception and calls it a \"difficult subject\". \"People are very fearful,\" she says, before acknowledging that concerns remain for vulnerable people at risk of coercion. \"Lots of people have been in controlling relationships, and I really understand how that works. \"I've got daughters and I can understand situations where people are thinking, 'oh, I don't want to be a burden on somebody else' and all of that. But I think it's [worth] remembering that this is one choice out of many.\" Clare is aware it is unlikely the law will change before she dies. \"It won't for [be there] me and it hasn't come in time for lots of people, has it?\" she says. \"All the people that have gone before that would've liked this choice to avoid suffering and indignity.\" Read more:The assisted dying debate has been politics - but not as we know itHow both sides of debate reacted to historic vote Clare turns 60 this year and is marking her birthday with 60 memorable days. \"I'm enjoying life,\" she says with a big smile. \"I don't want to die, but we all have to go.\" Assisted dying won't be for everyone in the way death is. But it has and may well continue to be a political issue with people right at its heart."
    },
    {
        "title": "Target to reach one million Welsh speakers by 2050 has been set - but how likely is it?",
        "description": "Wales's government has set the aim of having one million Welsh speakers by 2050 - along with a doubling of the daily use of the language by then - but is that target achievable?",
        "url": "https://news.sky.com/story/target-to-reach-one-million-welsh-speakers-by-2050-has-been-set-but-how-likely-is-it-13385469",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-welsh-language-wales_6946799.jpg?20250620154615",
        "type": "UK",
        "Author": "Tomos Evans",
        "Date Published": "2025-06-20 23:01:00",
        "Headline": "Some efforts to increase the prominence of the language in recent years, including the Brecon Beacons National Park's decision to refer to itself only by its Welsh name Bannau Brycheiniog, have faced criticism from some quarters.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n Wales's government has set the aim of having one million Welsh speakers by 2050 - along with a doubling of the daily use of the language by then - but is that target achievable? Figures from the latest census in 2021 showed a fall in the number of people who could speak Welsh compared to a decade earlier. An estimated 538,000 people in Wales - or 17.8% of the population - said they could speak Welsh, compared to 562,000 in 2011 (or 19% of the population). Some efforts to increase the prominence of the language in recent years, including the Brecon Beacons National Park's decision to refer to itself only by its Welsh name Bannau Brycheiniog, have faced criticism from some quarters. But a YouGov poll of more than 1,300 Welsh people earlier this year found two-thirds (67%) were in favour of efforts to increase the use of the Welsh language, compared to a fifth (20%) who were against. Efa Gruffudd Jones, the commissioner tasked with promoting the use of the language, published her manifesto for next year's Senedd election on Friday. She told Sky News the Welsh language's position had \"stayed fairly constant over the last 20 years\". \"If we really want to change anything going forward, we need to change some of the things that we do,\" she said. \"[Targets] are inspirational, they can inspire people to do more. But, on its own, setting a target doesn't mean that you achieve it. \"So I really think we need to think hard about how we increase the numbers of Welsh speakers and how we ensure that more people can use it in their daily lives.\" Reform UK's leader Nigel Farage told ITV Wales last month that he would scrap the target if the party forms the next Welsh government. In her manifesto, Ms Gruffudd Jones has five key proposals for the next Welsh government as people in Wales prepare to head to the polls in May next year. They include increased use of the language in workplaces, more public services available in Welsh and mandatory Welsh language training for newly-qualified teachers, with the commissioner insisting such a move would not \"alienate\" potential new recruits to the profession. \"It's about creating the opportunity for everyone who wants to come into the workforce to be able to develop their skills and to be able to make sure that every child who wants Welsh-medium education in Wales [is able] to receive it,\" she said. At Welsh-medium secondary schools, at least 60% of learners have a minimum of 70% of their lessons in Welsh, according to Welsh government criteria. And at Welsh-medium primary schools, at least 80% of pupils' school activities will be in Welsh from the age of seven onwards. 'Nothing to be afraid of' The Welsh language commissioner published a report last month which found young people's use of the language socially, including on social media, was \"limited\". Gwynedd Council, in northwest Wales, has outlined plans to make Welsh the \"principal language\" of education across the county, in an effort to boost the number of people who leave school speaking the language. The proposals, which are subject to public consultation over the coming months, are set to \"remove bilingualism and bilingual teaching\" from its schools' policy. But Councillor Dewi Jones, the cabinet member for education on Gwynedd Council, has insisted English-medium education \"is not being phased out\". He told Sky News that pupils moving to Gwynedd from outside of Wales would be given support with their Welsh through the county's language immersion units. \"There's nothing to be afraid of here, I'm completely confident that any latecomers to the county will be able to fully integrate and become fully bilingual,\" Cllr Jones added. He said the council was \"very proud\" to have a \"very high number of Welsh speakers\" in the area, \"especially among young people\". \"But we're ambitious to go beyond that and ensure that all young people in Gwynedd are fully bilingual so that they have the benefits of both the Welsh language and the English language,\" he said. 'Academic language' In Ysgol Cwm Rhymni, a Welsh-medium secondary school in Caerphilly, Year 12 students have just finished their exams and are starting to think about the next steps after school. Mili, who speaks Welsh at home with her family, said the language was an \"integral part\" of her life. \"For many students, their parents don't speak Welsh, so they don't hear Welsh on a more social level, it's more of an academic language for them,\" she told Sky News. Another student Megan said there were \"a lot of people\" who wanted to use Welsh outside of school but there were \"a lack of things for them to be able to use Welsh\". \"People would be willing to speak Welsh if there are things there to allow them to speak the language once they've learned it,\" she added. Student Ben said there was a \"lack of places where you can speak Welsh in the south that aren't schools or festivals\". Meanwhile, fellow student Maisie said there were already \"a lot of opportunities\" to use Welsh outside of school, such as in Welsh-speaking groups, but they weren't \"advertised\" enough. On the streets of Cardiff Bay, opinions were mixed over the target to reach a million Welsh speakers by 2050. \"I think we could [reach it] because there are a lot of Welsh schools now, and all the schools are learning to speak Welsh,\" one woman said. \"I don't know if you will get to a million, but I certainly would aim for that, as close to that as you can,\" another added. One man said it was unrealistic as Cardiff was \"not a Welsh-speaking capital\" but that the language was spoken more widely in other areas. Read more:Rare 1588 Welsh Bible goes on display10 Welsh terms added to Oxford English dictionary What do the political parties say? Plaid Cymru's Welsh language spokesperson Heledd Fychan said the party has \"a range of progressive and radical policies\" on the Welsh language and that Wales needed \"a government that is willing to act\". Tom Giffard, the Welsh Conservatives' shadow Welsh language secretary, said \"neither language should be squeezed out of any area\" and it must be ensured that \"additional bureaucratic strain is not placed on the health or education services\". Jane Dodds, leader of the Welsh Liberal Democrats, said the party supports the vision to \"expand the use of Welsh across public services, workplaces, and education\" but that the proposals should be delivered in a way that is \"fair\" and \"inclusive\". The Labour Party declined to comment and Reform UK did not respond."
    },
    {
        "title": "UK weather: Yellow warning for thunderstorms as heatwave intensifies",
        "description": "A yellow warning for thunderstorms has been issued by the Met Office - as a nationwide heatwave intensifies.",
        "url": "https://news.sky.com/story/uk-weather-yellow-warning-for-thunderstorms-as-heatwave-intensifies-13386103",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-thunderstorm-lightning_6936212.jpg?20250620114927",
        "type": "UK",
        "Author": "Connor Sephton",
        "Date Published": "2025-06-20 10:12:00",
        "Headline": "It comes as high temperatures dominate, with the UK on track to break records for the warmest day of the year so far for the second day in a row.",
        "Content": "\n          News reporter\n              @ConnorSephton\n  A yellow warning for thunderstorms has been issued by the Met Office - as a nationwide heatwave intensifies. The Met Office alert is in force from 3pm on Saturday until 4am on Sunday. Forecasters said: \"The most intense thunderstorms could produce frequent lightning, large hail and gusty winds, along with some heavy downpours for a time.\" The warning covers parts of the East and West Midlands, North East and North West of England, Wales and Yorkshire. Check the weather forecast where you are Travel disruption is possible - with a \"small chance\" of power cuts and some communities being cut off by flooded roads. It comes as high temperatures continue to dominate, with the UK potentially on track to break records for the warmest day of the year so far for the second day in a row. \n                  UK weather: Amber heat health alert issued across England as hottest day of the year recorded\n                 \n                  At least 33 die in floods in Democratic Republic of Congo\n                 \n                  Seven killed as thunderstorms and tornadoes rip through US states\n                 An amber heat health alert is currently in force across England, and highs of 32.2C (90F) were recorded in Kew Gardens, west London, on Thursday. Temperatures are forecast to widely reach the low 30s today - with 33C (91F) possible in places.  Sky News weather producer Jo Wheeler said: \"Temperatures will peak on Saturday with the potential for 34C (93F) somewhere in the Midlands or South East, but fresher conditions will already be moving into the West.\" She added that some places will miss this weekend's thunderstorms altogether - but where they hit, driving conditions will be \"challenging\" because of surface water. \"As we go into the coming week, it'll be cooler, fresher and more unsettled.\" The record for the highest-ever June temperature is 35.6C (96F) and was set all the way back in 1976. Read more UK news:Inside Britain's largest nuclear weapons siteActivists break into RAF base and 'vandalise' aircraftChris Brown pleads not guilty to attempting to cause GBH Meanwhile, firefighters are warning that the dry and hot conditions have resulted in them responding to 564 wildfires across England and Wales so far this year - a 717% increase compared with the same period a year ago. This is also more than double the number seen in 2022, which went on to be the worst year in history for wildfires. The National Fire Chiefs Council is urging Britons to be cautious when enjoying the outdoors. Chairman Phil Garrigan said: \"We are deeply concerned about the escalating threat of wildfires this summer, which have the potential to become more frequent, intense, and dangerous - particularly in areas where communities border the countryside.\""
    },
    {
        "title": "Missing Rolex case: Woman in court charged with murder after 69-year-old sister stabbed in her north London flat",
        "description": "A woman has appeared in court charged with the murder of her 69-year-old sister who was stabbed in her home.",
        "url": "https://news.sky.com/story/missing-rolex-case-woman-in-court-charged-with-murder-after-69-year-old-sister-stabbed-in-her-north-london-flat-13386056",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jennifer-abbott-rolex_6945264.jpg?20250618152931",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-20 08:08:00",
        "Headline": "Jennifer Abbott was found dead by her niece and neighbours, who broke her door down after her family had not heard from her for several days. She had last been seen walking her corgi in the area on 10 June.",
        "Content": "A woman has appeared in court charged with the murder of her 69-year-old sister who was stabbed in her home. Jennifer Abbott - also known as Sarah Steinberg - was pronounced dead at her flat in Camden, north London, last Friday. Police previously said they believed the death could be linked to a missing diamond-encrusted Rolex watch. Nancy Pexton, also 69, appeared at Highbury Magistrates' Court today, where she spoke only to confirm her name and date of birth. It is understood she is nine months younger than her sister. Pexton, of no fixed address, wore a grey prison issue tracksuit at the short hearing. She was remanded in custody to appear at the Old Bailey on Tuesday 24 June. Ms Abbott was found by her niece and neighbours, who broke her door down after her family had not heard from her for several days. \n                  Ex-classmates died after being treated at same mental health hospital - as concerns raised over more deaths\n                 \n                  MPs back legalising assisted dying in England and Wales after historic Commons vote\n                 \n                  How did your MP vote on the assisted dying bill?\n                 She had last been seen walking her corgi in the area on 10 June. A post-mortem examination gave her cause of death as sharp force trauma. Detective Inspector Barry Hart previously said: \"Our deepest sympathies are with the victim's loved ones who are being supported by specialist officers at this time.\" There has been an increased police presence in the area as detectives explore \"several lines of inquiry\". Neighbours described Ms Abbott as \"exuberant\" and \"vivacious\"."
    },
    {
        "title": "The assisted dying debate has been politics – but not as we know it",
        "description": "The House of Commons is a place defined by confrontation where political battles play out and engage more actively with their constituents.",
        "url": "https://news.sky.com/story/the-assisted-dying-debate-has-been-politics-8211-but-not-as-we-know-it-13386531",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-kim-leadbeater-assisted-dying_6946554.jpg?20250620104730",
        "type": "UK",
        "Author": "Liz Bates",
        "Date Published": "2025-06-20 20:48:00",
        "Headline": "Party divisions have been put aside with MPs being asked to search their own consciences and encouraged to engage with constituents more. ",
        "Content": "\n          Political correspondent\n              @wizbates\n  The House of Commons is a place defined by confrontation where political battles play out and engage more actively with their constituents. But the atmosphere could not have been more different on Friday, as those on both sides of the assisted dying debate listened respectfully, almost solemnly, to one another in the final hours before the crucial vote. As MPs headed for the division lobbies, the bill's supporters seemed confident but nervous. Read more:How both sides of debate reacted to historic voteFind out how your MP voted on the bill When the voting was completed and the result imminent, a long and profound silence fell over the House. From the press gallery, it seemed that the entire Commons was holding its breath together, collectively aware of the historic moment we were all about to witness, whatever the outcome. The woman at the centre of this seismic moment, the bill's sponsor Kim Leadbeater, braced herself as the result came in. Many months of pressure and responsibility appeared to be lifted from her shoulders as the win was announced and colleagues gathered to commend her efforts. Throughout the process this been politics but not as we know it, with party divisions put aside and MPs asked to search their own consciences and come to their own conclusions. It has created a more collaborative atmosphere in parliament and encouraged MPs to engage more actively with their constituents.  In the end there was still anger, frustration and disappointment among those who were against the law change, either on principle or because they believed the legislation was flawed. And of course, politics will go back to being combative and voices in the Commons will be raised once again. But for a brief period, historic change was calmly ushered in. The challenge for the proponents now is to take the legislation through the next phases and deliver it with the same smoothness and determination."
    },
    {
        "title": "Assisted dying bill: How both sides of debate reacted to historic vote",
        "description": "People on both sides of the assisted dying debate have told Sky News how they feel about the outcome of today's vote &#8211; and while some are popping open champagne, others are \"incredibly disappointed\".",
        "url": "https://news.sky.com/story/assisted-dying-bill-people-on-both-sides-of-the-debate-react-to-historic-vote-13386437",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-assisted-dying-reactionds_6946954.jpg?20250620190335",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-20 17:27:00",
        "Headline": "More than 300 MPs this afternoon backed a bill that gives people in England and Wales who have less than six months to live the right to apply for an assisted death.",
        "Content": " People on both sides of the assisted dying debate have told Sky News how they feel about the outcome of today's vote – and while some are popping open champagne, others are \"incredibly disappointed\". More than 300 MPs this afternoon backed a bill that gives people in England and Wales who have less than six months to live the right to apply for an assisted death. Each request will be evaluated by two doctors and a panel featuring a social worker, senior legal figure and psychiatrist. Today's historic vote means the Terminally Ill Adults (End of Life) Bill will now go to the House of Lords for further scrutiny before becoming law. Following the landmark vote, individuals for and against it have shared their feelings on the result. Frank Tate-Sutton - For   Frank Tate-Sutton is terminally ill and told Sky News she's relieved the bill has passed, even though the law won't be changed in time for her. \"These are happy tears,\" she said. \"I am emotional. It's a very difficult subject for everybody.\" Ms Tate-Sutton said her quality of life is \"very important - and I'm losing it\". \"I don't want to die without dignity, without it being my choice, without my family knowing that this is what I want,\" she continued. \"As much as they [my family] want me alive, do they want to see me lying in my living room in a hospital bed, taking all these drugs, not being able to talk, not being able to control my bodily functions? \"That is not a life, for me - living on all the medications and not being able to exist without that… the side effects and everything.\" Mike Smith - Against   Mike Smith is a spokesperson for the disability rights group Not Dead Yet - and he has been left \"incredibly disappointed\" by the outcome of the vote. \"This particular bill had so many failings in the way safeguards are constructed and the significant scope for coercion, whether it's overt or subliminal,\" he said. Mr Smith says he fears some people will \"end up ending their lives earlier than they should do or want to\". \"There are so many disabled people around the country that have told us they're absolutely scared.\" \"I think it's this inherent fear people have about being disabled that drives this very emotional response on this really complex topic,\" he explained. \"What we know is, with good palliative care, social care, access to housing and an income, many disabled people ... can lead amazing lives.\" Rebecca Wilcox - For   Rebecca Wilcox and her TV presenter mother Dame Esther Rantzen, who has terminal cancer, have long been campaigning for a change to the UK's law on assisted dying. Speaking from Parliament Square as fellow supporters of the bill popped champagne behind her, Ms Wilcox described today's vote as \"an extraordinary moment\". \"It means so much to me,\" she said. \"I spoke to mum and her one word to describe it was 'wow'. \"She didn't think she was going to live to see the debate, let alone a conclusion that went our way.\" Read more: How did your MP vote on the bill?  In response to concerns about safeguarding, she said it will \"bring in layer upon layer of safeguards\". \"We're going to have scrutiny upon scrutiny for every case and at the moment, there is no scrutiny,\" she said. \"Coercion could be happening as we speak. \"There is now protection for vulnerable people, by having this bill passed.\" Dr Gordon Macdonald - Against  Dr Macdonald said the bill passing with a majority of 23 - less than half what its second reading achieved - is proof that \"the more people have thought about this issue, the more they've had doubts\". The doctor, who is the CEO of anti-euthanasia organisation Care not Killing, said: \"We will see what happens when it gets to the [House of] Lords, the Lords will hopefully give it more rigorous scrutiny than happened in the Commons\". His biggest concern is \"for people who are vulnerable, who will feel pressure to end their lives\". \"That might come from external forces, but it's more likely to just be internalised pressure,\" Dr Macdonald said. \"They'll feel they're a burden on their family and friends, conscious of the cost of care, and think they should do the decent thing, as they would see it in that thinking.\" It's \"of course a terrible message for society to send out to people,\" he said."
    },
    {
        "title": "Inside Britain's largest nuclear weapons site - as scientists race to build a new warhead by the 2030s",
        "description": "Vaults of enriched uranium and plutonium to make nuclear bombs are dotted about a secure site in Berkshire along with Anglo-Saxon burial mounds and a couple of lakes.",
        "url": "https://news.sky.com/story/inside-britains-largest-nuclear-weapons-site-as-scientists-race-to-build-a-new-warhead-by-the-2030s-13386012",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-laser-aldermaston_6946373.jpg?20250620064320",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2025-06-20 05:25:00",
        "Headline": "Designing and building a bomb is something the UK has not needed to do for decades.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Vaults of enriched uranium and plutonium to make nuclear bombs are dotted about a secure site in Berkshire along with Anglo-Saxon burial mounds and a couple of lakes. Surrounded by metal fences topped with barbed wire, much of the nuclear weapons facility at Aldermaston in Berkshire looks frozen in time from the 1950s rather than ready for war in the 21st century. But a renewed focus on the importance of the UK's nuclear deterrent means the government is giving much of its nuclear infrastructure a facelift as it races to build a new warhead by the 2030s when the old stock goes out of service. Sky News was among a group of news organisations given rare access to the largest of Britain's nuclear weapons locations run by AWE. The acronym stands for Atomic Weapons Establishment - but a member of staff organising the visit told me that the public body, which is owned by the Ministry of Defence, no longer attributes the letters that make up its name to those words. \"We are just A, W, E,\" she said. She did not explain why. Perhaps it is to avoid making AWE's purpose so immediately obvious to anyone interested in applying for a job but not so keen on weapons of mass destruction. For the scientists and engineers, working here though, there seems to be a sense of genuine purpose as they develop and ensure the viability and credibility of the warheads at the heart of the UK's nuclear deterrent, this country's ultimate security guarantee. \"It's nice to wake up every day and work on something that actually matters,\" said a 22-year-old apprentice called Chris. Sky News was asked not to publish his surname for security reasons. The workforce at AWE is expanding fast, with 1,500 new people joining over the past year. The organisation has some 9,500 employees in total, including about 7,000 at Aldermaston, where the warhead is developed and its component parts are manufactured. Designing and building a bomb is something the UK has not needed to do for decades - not since an international prohibition on testing nuclear weapons came into force in the 1990s. It means the new warhead, called Astrea, will not be detonated for real unless it is used - an outcome that would only ever happen in the most extreme of circumstances as explained in a new podcast series by Sky News and Tortoise called The Wargame. The last time, Britain test-fired a bomb was at a facility in Nevada in the US in 1991. With that no longer an option, the scientists at AWE must rely on old data and new technology as they build the next generation of warhead. This includes input from a supercomputer at the Aldermaston site that uses 17 megawatts of power and crunches four trillion calculations per second. Another major help is a giant laser facility. It is built in a hall, with two banks of long cylinders, lying horizontal and stacked one of top of the other running down the length of the room - these are part of the laser. The beams are then zapped in a special, separate chamber, onto tiny samples of material to see how they react under the kind of extreme pressures and temperatures that would be caused in a nuclear explosion. The heat is up to 10 million degrees - the same as the outer edge of the sun. \"You take all those beams at a billionth of a second, bring them altogether and heat a small target to those temperatures and pressures,\" one scientist said, as he explained the process to John Healey, the defence secretary, who visited the site on Thursday. Looking impressed, Mr Healey replied: \"For a non-scientist that is hard to follow let alone comprehend.\" The Orion laser facility is the only one of its kind in the world, though the US - which has a uniquely close relationship with the UK over their nuclear weapons - has similar capabilities. Maria Dawes, the director of science at AWE, said there is a sense of urgency at the organisation about the need to develop and then build the new bomb - which is a central part of the government's new defence review published in early June. \"You've probably read the strategic defence review,\" she said. \"There's very much the rhetoric of this is a new era of threat and therefore it's a new era for defence and AWE is absolutely at the heart of that and so a sense of urgency around: we need to step up and we need to make sure that we've got what our customer needs. Yes, there's very much that sense here.\" It means an organisation that has for years been purely focused on ensuring the current stockpile of warheads is safe and works must shift to becoming more dynamic as it pursues a project that will be used to defend the UK long into the future. In a sign of its importance, the government is spending £15bn over the next four years alone on the programme to build the new warheads. Part of the investment is going into revamping Aldermaston. Driving around the 700-acre site, which was once a Second World War airbase, many of the buildings were constructed into the 1950s, 1960s and 1970s. The construction of new science and research laboratories is taking place. But bringing builders onto one of the UK's most secure nuclear sites is not without risk. Everyone involved must be a British national and armed police patrols are everywhere. No one would say what will be different about the new bomb that is being developed here compared with the version that needs replacing. One official simply said the incumbent stock has a finite design life and will need to be swapped out."
    },
    {
        "title": "US warplanes transit through UK as Trump considers striking Iran",
        "description": "Flight tracking data shows extensive movement of US military aircraft towards the Middle East in recent days, including via the UK.",
        "url": "https://news.sky.com/story/us-warplanes-transit-through-uk-as-trump-considers-striking-iran-13386388",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-usa-england-iran-israel_6945271.jpg?20250620232005",
        "type": "World",
        "Author": "Ben van der Merwe, Adam Parker, Kaitlin Tosh and Sophia Massam, Data &amp; Forensics Unit",
        "Date Published": "2025-06-20 23:01:00",
        "Headline": "As President Trump mulls direct involvement in the Israel-Iran conflict, Sky News has analysed the build-up of US Air Force assets near the Middle East and how they might be used.",
        "Content": "By Ben van der Merwe, Adam Parker, Kaitlin Tosh and Sophia Massam, Data & Forensics Unit   Flight tracking data shows extensive movement of US military aircraft towards the Middle East in recent days, including via the UK. Fifty-two US military planes were spotted flying over the eastern Mediterranean towards the Middle East between Monday and Thursday. That includes at least 25 that passed through Chania airport, on the Greek island of Crete - an eight-fold increase in the rate of arrivals compared to the first half of June. The movement of military equipment comes as the US considers whether to assist Israel in its conflict with Iran. Of the 52 planes spotted over the eastern Mediterranean, 32 are used for transporting troops or cargo, 18 are used for mid-air refuelling and two are reconnaissance planes. Forbes McKenzie, founder of McKenzie Intelligence, says that this indicates \"the build-up of warfighting capability, which was not [in the region] before\". Sky's data does not include fighter jets, which typically fly without publicly revealing their location. An air traffic control recording from Wednesday suggests that F-22 Raptors are among the planes being sent across the Atlantic, while 12 F-35 fighter jets were photographed travelling from the UK to the Middle East on Wednesday. Many US military planes are passing through UK  A growing number of US Air Force planes have been passing through the UK in recent days. Analysis of flight tracking data at three key air bases in the UK shows 63 US military flights landing between 16 and 19 June - more than double the rate of arrivals earlier in June. On Thursday, Sky News filmed three US military C-17A Globemaster III transport aircraft and a C-130 Hercules military cargo plane arriving at Glasgow's Prestwick Airport. Flight tracking data shows that one of the planes arrived from an air base in Jordan, having earlier travelled there from Germany. What does Israel need from US? Israeli Prime Minister Benjamin Netanyahu said on 15 March that his country's aim is to remove \"two existential threats - the nuclear threat and the ballistic missile threat\". Israel says that Iran is attempting to develop a nuclear bomb, though Iran says its nuclear facilities are only for civilian energy purposes. A US intelligence assessment in March concluded that Iran is not building a nuclear weapon. President Trump dismissed the assessment on Tuesday, saying: \"I think they were very close to having one.\" Forbes McKenzie says the Americans have a \"very similar inventory of weapons systems\" to the Israelis, \"but of course, they also have the much-talked-about GBU-57\". The GBU-57 is a 30,000lb bomb - the largest non-nuclear bomb in existence. Mr McKenzie explains that it is \"specifically designed to destroy targets which are very deep underground\". Experts say it is the only weapon with any chance of destroying Iran's main enrichment site, which is located underneath a mountain at Fordow. Air-to-air refuelling could allow Israel to carry larger bombs Among the dozens of US aircraft that Sky News tracked over the eastern Mediterranean in recent days, more than a third (18 planes) were designed for air-to-air refuelling. \"These are crucial because Israel is the best part of a thousand miles away from Iran,\" says Sky News military analyst Sean Bell. \"Most military fighter jets would struggle to do those 2,000-mile round trips and have enough combat fuel.\" The ability to refuel mid-flight would also allow Israeli planes to carry heavier munitions, including bunker-buster bombs necessary to destroy the tunnels and silos where Iran stores many of its missiles. Satellite imagery captured on 15 June shows the aftermath of Israeli strikes on a missile facility near the western city of Kermanshah, which destroyed at least 12 buildings at the site. At least four tunnel entrances were also damaged in the strikes, two of which can be seen in the image below. Writing for Jane's Defence Weekly, military analyst Jeremy Binnie says it looked like the tunnels were \"targeted using guided munitions coming in at angles, not destroyed from above using penetrator bombs, raising the possibility that the damage can be cleared, enabling any [missile launchers] trapped inside to deploy\". \"This might reflect the limited payloads that Israeli aircraft can carry to Iran,\" he adds. Penetrator bombs, also known as bunker-busters, are much heavier than other types of munitions and as a result require more fuel to transport. Israel does not have the latest generation of refuelling aircraft, Mr Binnie says, meaning it is likely to struggle to deploy a significant number of penetrator bombs. Israel has struck most of Iran's western missile bases Even without direct US assistance, the Israeli air force has managed to inflict significant damage on Iran's missile launch capacity. Sky News has confirmed Israeli strikes on at least five of Iran's six known missile bases in the west of the country. On Monday, the IDF said that its strategy of targeting western launch sites had forced Iran to rely on its bases in the centre of the country, such as Isfahan - around 1,500km (930 miles) from Israel. Among Iran's most advanced weapons are three types of solid-fuelled rockets fitted with highly manoeuvrable warheads: Fattah-1, Kheibar Shekan and Haj Qassam. The use of solid fuel makes these missiles easy to transport and fast to launch, while their manoeuvrable warheads make them better at evading Israeli air defences. However, none of them are capable of striking Israel from such a distance. Iran is known to possess five types of missile capable of travelling more than 1,500km, but only one of these uses solid fuel - the Sijjil-1. On 18 June, Iran claimed to have used this missile against Israel for the first time. Iran's missiles have caused significant damage Iran's missile attacks have killed at least 24 people in Israel and wounded hundreds, according to the Israeli foreign ministry. The number of air raid alerts in Israel has topped 1,000 every day since the start of hostilities, reaching a peak of 3,024 on 15 June. Iran has managed to strike some government buildings, including one in the city of Haifa on Friday. And on 13 June, in Iran's most notable targeting success so far, an Iranian missile impacted on or near the headquarters of Israel's defence ministry in Tel Aviv. Most of the Iranian strikes verified by Sky News, however, have hit civilian targets. These include residential buildings, a school and a university. On Thursday, one missile hit the Soroka Medical Center in Beersheba, southern Israel's main hospital. More than 70 people were injured, according to Israel's health ministry. Iranian foreign minister Abbas Araghchi said that Iran had struck a nearby technology park containing an IDF cyber defence training centre, and that the \"blast wave caused superficial damage to a small section\" of the hospital. However, the technology park is in fact 1.2km away from where the missile struck. Photos of the hospital show evidence of a direct hit, with a large section of one building's roof completely destroyed. Iran successfully struck the technology park on Friday, though its missile fell in an open area, causing damage to a nearby residential building but no casualties. Israel has killed much of Iran's military leadership  It's not clear exactly how many people Israel's strikes in Iran have killed, or how many are civilians. Estimates by human rights groups of the total number of fatalities exceed 600. What is clear is that among the military personnel killed are many key figures in the Iranian armed forces, including the military's chief of staff, deputy head of intelligence and deputy head of operations. Key figures in the powerful Revolutionary Guard have also been killed, including the militia's commander-in-chief, its aerospace force commander and its air defences commander. On Thursday, Israeli Prime Minister Benjamin Netanyahu said that US assistance was not necessary for Israel to win the war. \"We will achieve all our objectives and hit all of their nuclear facilities,\" he said. \"We have the capability to do that.\"  Forbes McKenzie says that while Israel has secured significant victories in the war so far, \"they only have so much fuel, they only have so many munitions\". \"The Americans have an ability to keep up the pace of operations that the Israelis have started, and they're able to do it for an indefinite period of time.\" Additional reporting by data journalist Joely Santa Cruz and OSINT producers Freya Gibson, Lina-Sirine Zitout and Sam Doak. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Putin says 'Ukraine is ours' and threatens nuclear strike - showing how he feels about Trump",
        "description": "He may have been speaking at an economic forum, but that didn&#8217;t stop Vladimir Putin from issuing his most hawkish comments on Ukraine in a very long time.",
        "url": "https://news.sky.com/story/putin-says-ukraine-is-ours-and-threatens-nuclear-strike-showing-how-he-feels-about-trump-13386502",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-putin-russia_6947078.jpg?20250620210149",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-06-20 19:54:00",
        "Headline": "The Russian president's latest comments on the war in Ukraine are in sharp contrast to the Kremlin's recent rhetoric. ",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  He may have been speaking at an economic forum, but that didn’t stop Vladimir Putin from issuing his most hawkish comments on Ukraine in a very long time. During a Q&A at Russia's flagship investment event in St Petersburg, the Kremlin leader was asked what his end game was in the conflict. He replied: \"I have said many times that I consider the Russian and Ukrainian people to be one nation. In this sense, all of Ukraine is ours.\" The answer received rapturous applause from an auditorium full of fawning politicians and business figures. And there was more. \"There is an old rule,\" he said. \"'Where a Russian soldier sets foot, that is ours'.\" In short, he was saying that he wants the whole lot. \n                  Regime change in Iran is 'unacceptable', says the Kremlin\n                 \n                  Kellogg's, Coca-Cola and Brewdog beer on Russian shelves despite sanctions\n                 \n                  Ukraine war: 14 killed as Russian missile and drone attacks strike Kyiv - including American citizen\n                 The comments came as a surprise because they are in sharp contrast to the Kremlin's recent rhetoric. Ever since Donald Trump began his push for a peace deal, Moscow has adopted a softer tone, more conciliatory - in an apparent attempt to show Washington that it is interested in a settlement. But there was none of that kind of language here. Quite the opposite. The Russian president even, for the first time in months, threatened a nuclear strike on Ukraine. Asked how Moscow would respond if Kyiv used a dirty bomb against Russian forces, he promised \"catastrophic\" consequences for his enemy. \"This would be a colossal mistake on the part of those whom we call neo-Nazis on the territory of today's Ukraine,\" he said. \"It could be their last mistake. \"We always respond and respond in kind. Therefore, our response will be very tough.\" Read more:Iran regime change is 'unacceptable', says the KremlinWestern brands on Russian shelves despite sanctions The Kremlin's nuclear sabre-rattling was an almost weekly feature during the last days of the Biden administration, but the sabres stilled when Mr Trump came to power. But now, all of a sudden, he's returned to it. It felt like a very deliberate message from Vladimir Putin that, despite peace talks, Russia has no intention of backing down, neither on the battlefield nor at the negotiating table. I think it shows that Moscow is not too worried about upsetting Donald Trump. The American leader appears to have distanced himself from trying to mediate the conflict, but still seems to be pursuing warmer ties with Moscow. So I think these comments also show how confident Putin is that things are going his way."
    },
    {
        "title": "Israel 'will not stop' attacks until Iran's nuclear threat is 'dismantled', says Israel's UN ambassador",
        "description": "Israel's ambassador to the United Nations has vowed \"we will not stop\" attacks on Iran until the \"nuclear threat is dismantled\" and \"its war machine is disarmed\".",
        "url": "https://news.sky.com/story/israel-will-not-stop-attacks-until-irans-nuclear-threat-is-dismantled-says-israels-un-ambassador-13386434",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-danny-danon-israel_6947160.jpg?20250620222901",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-20 17:24:00",
        "Headline": "Britain took part in discussions with Iran on Friday to find a diplomatic solution to its nuclear ambitions, but Donald Trump was dismissive about the talks, saying \"Europe is not going to be able to help\".",
        "Content": "Israel's ambassador to the United Nations has vowed \"we will not stop\" attacks on Iran until the \"nuclear threat is dismantled\" and \"its war machine is disarmed\". The two countries traded angry accusations at the United Nations Security Council, as its secretary-general Antonio Guterres warned that expansion of the Israel-Iran conflict could \"ignite a fire no one can control\". Israel's UN ambassador Danny Danon vowed: \"We will not stop. Not until Iran's nuclear threat is dismantled, not until its war machine is disarmed.\"  Israel-Iran latest: UK warns of perilous moment His Iranian counterpart Amir Saeid Iravani said Iran would continue to respond to Israeli airstrikes targeting nuclear sites that Israel sees as part of a weapons programme. Donald Trump is seeking advice about whether to support Israel's military involvement and is expected make a decision in the next two weeks. But he told reporters in New Jersey on Friday that his director of national intelligence (DNI), Tulsi Gabbard, was wrong in suggesting there is no evidence Iran is building a nuclear weapon. \n                  US warplanes transit through UK as Trump considers striking Iran\n                 \n                  Trump's credibility gap and why Iran may want to take its chances in Israel conflict\n                 \n                  UK preparing charter flights out of Israel for British nationals\n                  Talks between Iranian and European ministers took place on Friday, but the US president was dismissive of the discussions. \"Iran doesn't want to speak to Europe. They want to speak to us. Europe is not going to be able to help in this one\". But he added that he might support a ceasefire between Iran and Israel \"depending on the circumstances\". Lammy on 'perilous moment' UK Foreign Secretary David Lammy warned \"this is a perilous moment, and it is hugely important that we don't see regional escalation of this conflict\", after he and his German, French and EU counterparts met Iran's foreign minister Abbas Araghchi in Geneva. He also referred to the role of the US in potential negotiations: \"There is a... short window to find a diplomatic solution for the Iranians to... end their nuclear programme. \"We're urging diplomacy. It's important they get back into serious talks with the United States.\"  Iran says attacks are 'grave war crimes' But the first face-to-face meeting between Western and Iranian officials since the start of the conflict, did not reveal any indication of an immediate breakthrough. Mr Araghchi described the talks as \"a very serious but respectful discussion\" but condemned what he called Israel's \"atrocities\", adding that \"Iran will continue exercising its legitimate right of self-defence against the regime\". \"Iran is ready to consider diplomacy once again... once aggression is stopped and the aggressor is held accountable for the crimes committed. In this regard, I made it clear that Iran's defence capabilities are not negotiable,\" he added. Earlier, he called Israel's attacks on nuclear facilities \"grave war crimes\". Read more:Iran's secretive 'nuclear mountain'Analysis: Talks flawed from startIran will continue to reject US talks On Friday, the Foreign Office announced that UK staff had also been evacuated from Iran, with the embassy continuing to operate remotely. Meanwhile, the UK government has announced it will use charter flights to evacuate Britons stranded in Israel once the country's airspace reopens. Iran wants 'endless negotiations' Jason Brodsky, policy director at the US-based pressure group United Against Nuclear Iran, told Sky News the talks in Geneva would not satisfy the US president. He said: \"It seems that the maximum that the Islamic Republic is prepared to give still does not meet the minimum that President Trump is able to accept. \"I think the Islamic Republic wants to lure the United States back into an endless negotiating process. They think they can dominate this process and manipulate President Trump. \"President Trump has made it very clear that a deadline means a deadline. And he has red lines as well. And his red lines is zero enrichment in Iran.\"  Protests over Israeli strikes On Friday, thousands of people protested in Iran's capital Tehran after a week of Israeli strikes which have killed at least 657 people and wounded 2,037 others, according to the Washington-based group Human Rights Activists. Israel's military says 25 fighter jets carried out airstrikes on Friday morning targeting \"missile storage and launch infrastructure components\" in western Iran. In the Israeli city of Haifa, at least 19 people were wounded by an Iranian missile barrage. UN issues nuclear warning Addressing an emergency meeting of the UN Security Council, the head of the International Atomic Energy Agency (IAEA) warned against attacks on Iran's nuclear reactors. \"A direct hit would result in a very high release of radioactivity,\" said Rafael Grossi, chief of the UN nuclear watchdog. Israel has not targeted Iran's nuclear reactors, instead focusing its strikes on the country's uranium enrichment sites. Iran has long insisted its nuclear programme is peaceful, although it enriches uranium up to 60%, well beyond the level required for an atomic power station and a step away from weapons-grade levels of 90%, according to the IAEA."
    },
    {
        "title": "Trump's credibility gap and why Iran may want to take its chances in Israel conflict",
        "description": "After hours of talks, the ayatollah's chief diplomat emerged giving little away. All eyes were on Abbas Aragchi. Would he give ground in the face of Israel's fierce bombardment of his country?",
        "url": "https://news.sky.com/story/trumps-credibility-gap-and-why-iran-may-want-to-take-its-chances-in-israel-conflict-13386520",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-us-president_6947106.jpg?20250620213313",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-06-20 20:24:00",
        "Headline": "Iran's chief diplomat held a talks with European counterparts in Geneva as tensions simmer with Israel - but the discussion was flawed from the start.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  After hours of talks, the ayatollah's chief diplomat emerged giving little away. All eyes were on Abbas Aragchi. Would he give ground in the face of Israel's fierce bombardment of his country? Yes, but only if Israel stops that bombardment which is not going to happen. Especially after a day when two of Israel's big cities suffered direct hits from Iranian missiles. The best that can be said for almost four hours of talks, is they happened and might again. There were no breakthroughs to report, no ground shifting on either side. The talks were flawed in concept from the beginning. The countries meeting Aragchi here are not involved in the conflict. Israel and America were absent. The US did send a message, via Britain's foreign secretary David Lammy. We want to talk but we're serious about getting involved with military force if you do not. But the UK was delivering an American ultimatum and threat of force it does not itself believe to be a good idea. \n                  US warplanes transit through UK as Trump considers striking Iran\n                 \n                  Israel 'will not stop' attacks until Iran's nuclear threat is 'dismantled', says Israel's UN ambassador\n                 \n                  UK preparing charter flights out of Israel for British nationals\n                 Britain and its European partners want de-escalation and oppose any idea of Donald Trump and his military getting involved. Iran is embattled, beleaguered and bombarded. But if its government is worried, its calm and collected foreign minister was showing none of it. The Iranians know Trump may send in the bombers and bunker busters within two weeks, but do they believe him? The president for whom they coined the acronym 'Trump Always Chickens Out' has a credibility gap. Read more:Is Trump losing his MAGA loyalist support over Iran?Iran's secretive 'nuclear mountain' And if he takes action that leads to a chain of events where Americans end up dying, he will be crucified for it by his own MAGA movement. Rather than buckling to concessions with an Israeli gun to their head, might the ayatollahs just take their chances in the belief this president is all talk?"
    },
    {
        "title": "China says British warship sailed through Taiwan Strait to 'cause trouble'",
        "description": "China has criticised a British warship's passage through the Taiwan Strait as a deliberate move to \"cause trouble\".",
        "url": "https://news.sky.com/story/china-says-british-warship-sailed-through-taiwan-strait-to-cause-trouble-13386024",
        "image_url": "https://e3.365dm.com/23/12/1920x1080/skynews-best-defence-imagery_6405056.jpg?20250620073056",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-20 06:07:00",
        "Headline": "The Royal Navy said its HMS Spey was conducting a routine navigation through the disputed waterway in compliance with international law.",
        "Content": "China has criticised a British warship's passage through the Taiwan Strait as a deliberate move to \"cause trouble\". The Royal Navy said its patrol vessel HMS Spey was conducting a routine navigation through the contested waterway on Wednesday as part of a long-planned deployment in compliance with international law. In response, the Eastern Theatre Command of China's People's Liberation Army (PLA) said the exercise was \"public hyping\", adding that its forces followed and monitored the ship. \"The British side's remarks distort legal principles and mislead the public; its actions deliberately cause trouble and disrupt things, undermining peace and stability in the Taiwan Strait,\" it said in a statement on Friday. \"Troops in the theatre are on high alert at all times and will resolutely counter all threats and provocations.\" The last time a British warship sailed through the strait was in 2021, when HMS Richmond was deployed in the East China Sea en route to Vietnam.  The strait is contested between Taiwan and China, which split in 1949. Today, China views Taiwan as a breakaway province - with which it promises to one day reunify, and has not ruled out the use of force to do so - and regards the waterway as its own territory. Taiwan, the US, and other Western powers regard the strait as international waters. US navy ships sail through the strait around once every two months, sometimes accompanied by those of allied nations. Responding to HMS Spey's exercise, Taiwan's foreign ministry said it \"welcomes and affirms the British side once again taking concrete actions to defend the freedom of navigation in the Taiwan Strait\". China has also carried out several military drills across the waterway, with exercises in October involving its army, navy and rocket forces. Beijing called it a \"stern warning to the separatist acts of Taiwan independence forces\" at the time. Read more from Sky News:Kremlin: Regime change in Iran is 'unacceptable'Inside Britain's largest nuclear weapons siteFather, 27, shot dead in 'mistaken identity' It comes as Taiwanese President Lai Ching-te on Thursday ordered defence and security units to step up their monitoring and intelligence efforts in response to China's military activities. Taiwan's defence ministry also reported another spike in Chinese movements close to the island over the previous 24 hours, involving 50 aircraft, concentrated in the strait and the top part of the South China Sea."
    },
    {
        "title": "How are investigators looking into the Air India crash - and how long could they take?",
        "description": "The devastating Air India plane crash which killed 229 passengers and 12 crew has been labelled a \"mystery\" by experts.",
        "url": "https://news.sky.com/story/how-are-investigators-looking-into-the-air-india-crash-and-how-long-could-they-take-13386263",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ahmedabad-plane-crash_6944966.jpg?20250618101311",
        "type": "World",
        "Author": "Jake Levison",
        "Date Published": "2025-06-20 11:44:00",
        "Headline": "Hundreds of people died after an Air India flight plummeted on 12 June, marking the world's deadliest air disaster in a decade. But what are investigators looking at now - and how long could the investigation take?",
        "Content": "\n          News reporter\n        The devastating Air India plane crash which killed 229 passengers and 12 crew has been labelled a \"mystery\" by experts. The Gatwick-bound flight, which was carrying 53 Britons, came down just after take-off from Ahmedabad airport in western India on Thursday 12 June, leaving only one survivor and also killing people on the ground. CCTV footage was captured of the crash, but experts say it has led to more questions than answers. An ongoing investigation will be reviewing the footage and other key evidence left in the crash's wake. But what are investigators looking at - and how long could it take? What is unusual about the crash? Air India Flight 171 took off from Ahmedabad Airport at 1.38pm local time on Thursday, and was only in the air for around half a minute. \n                  British survivor of Air India crash carries brother's coffin after being discharged from hospital\n                 \n                  Air India flight from Ahmedabad to London cancelled days after fatal crash\n                 \n                  Air India Boeing 787-8 Dreamliner turns around mid-flight after technical issue\n                 CCTV footage shows the plane struggling to gain altitude and it quickly begins to descend towards buildings, with its wheels still out and its nose raised.  It crashed into a densely populated neighbourhood in Ahmedabad, killing at least 29 other people on the ground. According to flight-tracking website Flightradar, the aircraft reached a height of just 625ft before crashing. The plane was a 12-year-old Boeing 787 Dreamliner, of which there are currently around 1,200 in operation worldwide. While other Boeing planes like the 787 Max have been plagued by high-profile safety incidents, this was the first deadly crash in 16 years of the Dreamliner model's operation, according to experts.  Several experts have told Sky News that they spotted potential anomalies in the footage. One of them was the landing gear, which appears to remain open throughout the clip. Former British Airways pilot Alastair Rosenschein and Paul Edwards, an aviation security analyst and fellow at the Royal Aeronautical Society, have told Sky News the landing gear should have been up and that this remains a mystery.  Mr Rosenschein is also among the experts who have called into question the aircraft's flaps, which need to be set correctly as they extend the shape of each wing and create vital extra lift at lower speeds to enable the plane to take-off and climb effectively. Some have also suggested a bird strike could be linked to the crash, but experts have pointed out that the aircraft has two engines and is designed to be able to fly on one, making this unlikely. What are investigators looking at? The investigation is being carried out by India's Aircraft Accident Investigation Bureau (AAIB) with assistance from the UK, the US and officials from Boeing. Anti-terror squads have also been part of the investigation teams, according to Reuters. Aurobindo Handa, former director general of AAIB, told Sky News that any theories about what may have caused the incident are at this point purely speculative. He says the most crucial thing for investigators was to retrieve the black boxes - or Digital Flight Data Recorders (DFDR) - from the crash site. Black boxes have two components - the flight data recorder and cockpit voice recorder - and provide crucial insights for crash investigators. They include altitude, airspeed, the status of controls and pilot conversations which help determine probable causes of crashes. They also store essential information about the configuration of the aircraft, including the flaps and landing gear. Mr Handa said that when there is a crash, the retrieval of the black boxes becomes the \"primary focus\" straight after first responders have carried out their rescue mission. It took investigators more than a day to recover the black boxes, longer than it took in many of the investigations Mr Handa oversaw, and he said this would have been because the aircraft was badly charred from fire. Indian newspaper The Economic Times reported that they were due to be sent to the US so the data could be extracted, as they had suffered fire damage and could not be analysed in India. Read more:British survivor of India crash carries brother's coffinAir India flight from Ahmedabad to London cancelled days after fatal crash The government said in a statement that the AAIB would decide where the recorders would be examined after making a \"due assessment\" of all technical, safety and security considerations. Mr Handa said analysing the boxes' raw data will take some time. \"There are hundreds of components and instruments giving feedback to the DFDRs,\" he explained. \"All the control services, all the engine parameters - everything goes into this.\" Investigators are also looking at the plane's remnants from the crash site, which they compare with the flight data when coming to conclusions. But Mr Handa said the investigators will likely be particularly reliant on the black box data in this instance because so much of the plane will be unrecoverable due to the fires. They will also be scanning CCTV footage of the nearby area and speak with witnesses to get to the root cause of the crash, according to Amit Singh, a former pilot and an aviation expert. Reuters has reported that investigators are assessing why the landing gear was open, citing a source \"with direct knowledge\", and that they are also looking at any possible operational issues with flaps. A possible bird strike is not a focus of the investigation, Reuters has reported. How long could the investigation take? Investigators across the world follow a standard UN-prescribed Manual of Accident Investigation, also called DOC 9756, which outlines detailed procedures to arrive at the most probable cause of a crash. In the case of a high-profile investigation of a major accident, countries are encouraged by the manual to publish a preliminary report within 30 days of the incident, but this is not mandatory. The guidance says the state should aim to release its final report \"in the shortest possible time and, if possible, within twelve months of the date of the occurrence\". It adds that if this is not possible, the state should release an interim statement on each anniversary of the incident detailing the progress of the investigation and any safety issues raised. Mr Handa told Sky News the findings will likely not be published anytime soon, even if the investigators believe they have found the probable cause of the crash early on, because they must examine and analyse every possibility and every piece of data available to them. He added that it is not just a case of finding the cause of the crash, but also uncovering the chain of events that led to that failure."
    },
    {
        "title": "US warplanes transit through UK as Trump considers striking Iran",
        "description": "Flight tracking data shows extensive movement of US military aircraft towards the Middle East in recent days, including via the UK.",
        "url": "https://news.sky.com/story/us-warplanes-transit-through-uk-as-trump-considers-striking-iran-13386388",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-usa-england-iran-israel_6945271.jpg?20250620232005",
        "type": "US",
        "Author": "Ben van der Merwe, Adam Parker, Kaitlin Tosh and Sophia Massam, Data &amp; Forensics Unit",
        "Date Published": "2025-06-20 23:01:00",
        "Headline": "As President Trump mulls direct involvement in the Israel-Iran conflict, Sky News has analysed the build-up of US Air Force assets near the Middle East and how they might be used.",
        "Content": "By Ben van der Merwe, Adam Parker, Kaitlin Tosh and Sophia Massam, Data & Forensics Unit   Flight tracking data shows extensive movement of US military aircraft towards the Middle East in recent days, including via the UK. Fifty-two US military planes were spotted flying over the eastern Mediterranean towards the Middle East between Monday and Thursday. That includes at least 25 that passed through Chania airport, on the Greek island of Crete - an eight-fold increase in the rate of arrivals compared to the first half of June. The movement of military equipment comes as the US considers whether to assist Israel in its conflict with Iran. Of the 52 planes spotted over the eastern Mediterranean, 32 are used for transporting troops or cargo, 18 are used for mid-air refuelling and two are reconnaissance planes. Forbes McKenzie, founder of McKenzie Intelligence, says that this indicates \"the build-up of warfighting capability, which was not [in the region] before\". Sky's data does not include fighter jets, which typically fly without publicly revealing their location. An air traffic control recording from Wednesday suggests that F-22 Raptors are among the planes being sent across the Atlantic, while 12 F-35 fighter jets were photographed travelling from the UK to the Middle East on Wednesday. Many US military planes are passing through UK  A growing number of US Air Force planes have been passing through the UK in recent days. Analysis of flight tracking data at three key air bases in the UK shows 63 US military flights landing between 16 and 19 June - more than double the rate of arrivals earlier in June. On Thursday, Sky News filmed three US military C-17A Globemaster III transport aircraft and a C-130 Hercules military cargo plane arriving at Glasgow's Prestwick Airport. Flight tracking data shows that one of the planes arrived from an air base in Jordan, having earlier travelled there from Germany. What does Israel need from US? Israeli Prime Minister Benjamin Netanyahu said on 15 March that his country's aim is to remove \"two existential threats - the nuclear threat and the ballistic missile threat\". Israel says that Iran is attempting to develop a nuclear bomb, though Iran says its nuclear facilities are only for civilian energy purposes. A US intelligence assessment in March concluded that Iran is not building a nuclear weapon. President Trump dismissed the assessment on Tuesday, saying: \"I think they were very close to having one.\" Forbes McKenzie says the Americans have a \"very similar inventory of weapons systems\" to the Israelis, \"but of course, they also have the much-talked-about GBU-57\". The GBU-57 is a 30,000lb bomb - the largest non-nuclear bomb in existence. Mr McKenzie explains that it is \"specifically designed to destroy targets which are very deep underground\". Experts say it is the only weapon with any chance of destroying Iran's main enrichment site, which is located underneath a mountain at Fordow. Air-to-air refuelling could allow Israel to carry larger bombs Among the dozens of US aircraft that Sky News tracked over the eastern Mediterranean in recent days, more than a third (18 planes) were designed for air-to-air refuelling. \"These are crucial because Israel is the best part of a thousand miles away from Iran,\" says Sky News military analyst Sean Bell. \"Most military fighter jets would struggle to do those 2,000-mile round trips and have enough combat fuel.\" The ability to refuel mid-flight would also allow Israeli planes to carry heavier munitions, including bunker-buster bombs necessary to destroy the tunnels and silos where Iran stores many of its missiles. Satellite imagery captured on 15 June shows the aftermath of Israeli strikes on a missile facility near the western city of Kermanshah, which destroyed at least 12 buildings at the site. At least four tunnel entrances were also damaged in the strikes, two of which can be seen in the image below. Writing for Jane's Defence Weekly, military analyst Jeremy Binnie says it looked like the tunnels were \"targeted using guided munitions coming in at angles, not destroyed from above using penetrator bombs, raising the possibility that the damage can be cleared, enabling any [missile launchers] trapped inside to deploy\". \"This might reflect the limited payloads that Israeli aircraft can carry to Iran,\" he adds. Penetrator bombs, also known as bunker-busters, are much heavier than other types of munitions and as a result require more fuel to transport. Israel does not have the latest generation of refuelling aircraft, Mr Binnie says, meaning it is likely to struggle to deploy a significant number of penetrator bombs. Israel has struck most of Iran's western missile bases Even without direct US assistance, the Israeli air force has managed to inflict significant damage on Iran's missile launch capacity. Sky News has confirmed Israeli strikes on at least five of Iran's six known missile bases in the west of the country. On Monday, the IDF said that its strategy of targeting western launch sites had forced Iran to rely on its bases in the centre of the country, such as Isfahan - around 1,500km (930 miles) from Israel. Among Iran's most advanced weapons are three types of solid-fuelled rockets fitted with highly manoeuvrable warheads: Fattah-1, Kheibar Shekan and Haj Qassam. The use of solid fuel makes these missiles easy to transport and fast to launch, while their manoeuvrable warheads make them better at evading Israeli air defences. However, none of them are capable of striking Israel from such a distance. Iran is known to possess five types of missile capable of travelling more than 1,500km, but only one of these uses solid fuel - the Sijjil-1. On 18 June, Iran claimed to have used this missile against Israel for the first time. Iran's missiles have caused significant damage Iran's missile attacks have killed at least 24 people in Israel and wounded hundreds, according to the Israeli foreign ministry. The number of air raid alerts in Israel has topped 1,000 every day since the start of hostilities, reaching a peak of 3,024 on 15 June. Iran has managed to strike some government buildings, including one in the city of Haifa on Friday. And on 13 June, in Iran's most notable targeting success so far, an Iranian missile impacted on or near the headquarters of Israel's defence ministry in Tel Aviv. Most of the Iranian strikes verified by Sky News, however, have hit civilian targets. These include residential buildings, a school and a university. On Thursday, one missile hit the Soroka Medical Center in Beersheba, southern Israel's main hospital. More than 70 people were injured, according to Israel's health ministry. Iranian foreign minister Abbas Araghchi said that Iran had struck a nearby technology park containing an IDF cyber defence training centre, and that the \"blast wave caused superficial damage to a small section\" of the hospital. However, the technology park is in fact 1.2km away from where the missile struck. Photos of the hospital show evidence of a direct hit, with a large section of one building's roof completely destroyed. Iran successfully struck the technology park on Friday, though its missile fell in an open area, causing damage to a nearby residential building but no casualties. Israel has killed much of Iran's military leadership  It's not clear exactly how many people Israel's strikes in Iran have killed, or how many are civilians. Estimates by human rights groups of the total number of fatalities exceed 600. What is clear is that among the military personnel killed are many key figures in the Iranian armed forces, including the military's chief of staff, deputy head of intelligence and deputy head of operations. Key figures in the powerful Revolutionary Guard have also been killed, including the militia's commander-in-chief, its aerospace force commander and its air defences commander. On Thursday, Israeli Prime Minister Benjamin Netanyahu said that US assistance was not necessary for Israel to win the war. \"We will achieve all our objectives and hit all of their nuclear facilities,\" he said. \"We have the capability to do that.\"  Forbes McKenzie says that while Israel has secured significant victories in the war so far, \"they only have so much fuel, they only have so many munitions\". \"The Americans have an ability to keep up the pace of operations that the Israelis have started, and they're able to do it for an indefinite period of time.\" Additional reporting by data journalist Joely Santa Cruz and OSINT producers Freya Gibson, Lina-Sirine Zitout and Sam Doak. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Trump's two-week timeline: What next for Iran?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈  </a>  ",
        "url": "https://news.sky.com/story/trumps-two-week-timeline-what-next-for-iran-13386004",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/sky-news-trump-100-saudi-arabia_6913749.jpg?20250519065442",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-20 02:37:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈    White House press secretary Karoline Leavitt has said Donald Trump will make a decision on whether to militarily strike Iran in the next two weeks. That's as diplomatic talks between Western governments and the Iranians ramp up. In today's episode, US correspondents Mark Stone and Martha Kelner unpick why the delay might be, and the competing voices in the ears of the president. If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk. Don't forget, you can also watch all episodes on our YouTube channel."
    },
    {
        "title": "Hundreds of jobs at risk as River Island takes axe to store base",
        "description": "Hundreds more high street jobs are being put at risk as part of a sweeping overhaul of the family-owned fashion retailer River Island.",
        "url": "https://news.sky.com/story/hundreds-of-jobs-at-risk-as-river-island-takes-axe-to-store-base-13386112",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-river-island-riverisland_6946688.jpg?20250620135029",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-20 10:35:00",
        "Headline": "The family-owned clothing retailer plans to close 33 stores and slash rents at 71 more if it can secure creditors' backing for a restructuring plan in August, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Hundreds more high street jobs are being put at risk as part of a sweeping overhaul of the family-owned fashion retailer River Island. Sky News has learnt that the clothing chain, which trades from about 230 stores, is proposing to close 33 shops in a restructuring plan which will be put to creditors in August. The fate of a further 70 stores is dependent upon agreements being reached with landlords to slash rent payments. Money latest: Why Aldi 'could be forced to rethink' business model Confirmation of the plans comes less than a month after Sky News revealed that the company, which was founded in 1948 by Bernard Lewis, was working with PricewaterhouseCoopers (PwC) on a restructuring plan. In a statement issued on Friday, Ben Lewis, River Island's chief executive, said: \"River Island is a much-loved retailer, with a decades-long history on the British high street. \"However, the well-documented migration of shoppers from the high street to online has left the business with a large portfolio of stores that is no longer aligned to our customers' needs. \"The sharp rise in the cost of doing business over the last few years has only added to the financial burden. \"We have a clear strategy to transform the business to ensure its long-term viability. \"Recent improvements in our fashion offer and in-store shopping experience are already showing very positive results, but it is only with a restructuring plan that we will be able to see this strategy through and secure River Island's future as a profitable retail business. \"We regret any job losses as a result of store closures, and we will try to keep these to a minimum.\" The company declined to comment on how many jobs would be put at risk by the initial 33 shop closures, or on the scale of the rent cuts being sought during talks with landlords. In total, it is understood to employ about 5,500 people. Fashion retailing 'fast changing' Sources said that new funding will be injected into River Island if the restructuring plan is approved in August. Previously named Lewis and Chelsea Girl, the business adopted its current brand during the 1980s. Accounts for River Island Clothing Co, for the 52 weeks ended 30 December 2023, show the company made a £33.2m pre-tax loss. Turnover during the year fell by more than 19% to £578.1m. A restructuring plan is a court-supervised process which enables companies facing financial difficulties to compromise creditors such as landlords in order to avoid insolvency proceedings. An identical process is being used to close scores of Poundland shops and slash rents at hundreds more. In its latest accounts at Companies House, River Island Holdings Limited warned of a multitude of financial and operational risks to its business. \"The market for retailing of fashion clothing is fast changing with customer preferences for more diverse, convenient and speedier shopping journeys and with increasing competition especially in the digital space,\" it said. Read more from Sky News:Sir Alan Bates backs Post Office Capture victimsReasons for sharp drop in retail sales revealed The company added: \"The key business risks for the group are the pressures of a highly competitive and changing retail environment, combined with increased economic uncertainty. \"A number of geopolitical events have resulted in continuing supply chain disruption as well as energy, labour and food price increases, driving inflation and interest rates higher and resulting in weaker disposable income and lower consumer confidence.\" Retailers have complained bitterly about the impact of tax changes announced by Rachel Reeves, the chancellor, in last autumn's budget. Since then, a cluster of well-known chains, including Lakeland and The Original Factory Shop, have been forced to seek new owners."
    },
    {
        "title": "'Inflation and customer cutbacks' blamed for big dive in retail sales",
        "description": "Retail sales volumes suffered their largest monthly fall since December 2023 last month, according to official figures which suggest a link to rising bills.",
        "url": "https://news.sky.com/story/inflation-and-customer-cutbacks-blamed-for-big-dive-in-retail-sales-13386034",
        "image_url": "https://e3.365dm.com/22/07/1920x1080/skynews-shopping-consumer-shopper_5846387.jpg?20220726192826",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-06-20 06:19:00",
        "Headline": "There's evidence that consumers have been spooked by rising bills at a time when businesses including retailers are also grappling a surge in costs linked to budget measures.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Retail sales volumes suffered their largest monthly fall since December 2023 last month, according to official figures which suggest a link to rising bills. The Office for National Statistics (ONS) reported a 2.7% decline in the quantity of goods bought in May compared with the previous month. The body said its interaction with retailers suggested \"inflation and customer cutbacks\" accounted for the fall, which was across all categories, but led by food. Money latest: The sunscreens failing safety tests The seasonally adjusted data - which reflects the effects of holidays - means that those for Easter are modified to give a clearer picture of sales trends. A poll of economists by the Reuters news agency had expected to see a decline in volumes of just 0.5% in May following April's growth of 1.3%. May was the month when households would have noticed the hit from the so-called \"awful April\" above-inflation hikes to essential bills, including council tax, water, mobiles, broadband and energy. \n                  Bank of England holds rate but eyes cuts ahead despite global risks\n                 \n                  Trump tariffs a big factor - but latest UK economic performance makes for unpleasant reading\n                 \n                  UK economy contracts - with record fall in exports to the US after Trump tariff hikes\n                 Retail sales growth had proved to be resilient this year until May but April brought a number of additional curveballs to confuse sentiment and place pressure on the economy generally.  Donald Trump's \"liberation day\" tariff regime kicked in while budget measures, including rises to minimum pay levels and employer national insurance contributions (NICs), also placed additional costs on businesses. Retail is the UK's largest private sector employer. It had threatened higher prices and hits to hiring and wage growth ahead of the tax take coming into effect. While the inflation picture for May was largely flat, the ONS reported last week employment data showing a tick up in the unemployment rate to 4.6% in the three months to April. Figures from the taxman also showed a 109,000 decline in payrolled employment during May. Further data from the ONS on Friday revealed a £1.8bn jump in additional \"compulsory social contributions\" - largely made up of NICs - in May. It took the extra tax take to a record £30.2bn across April and May but borrowing still surged to £17.7bn last month, the second highest figure on record for May, the ONS said, as Chancellor Rachel Reeves bids to grow the economy within tight fiscal rules. Consumer spending accounts for around 60% of UK output. A closely watched measure of consumer confidence covering June showed no rise in consumers' expectations for spending on so-called big ticket items. The GfK survey was taken after the UK's trade truce with the US but before Israel's air war with Iran began. That has pushed oil and natural gas prices up by double-digit percentage levels in under a week, threatening a new energy-led cost of living threat. It's another challenge that retailers, businesses more widely, and Ms Reeves could do without. Read more:Israel-Iran conflict poses new cost of living threat Thomas Pugh, economist at audit firm RSM UK, said: \"Looking ahead to the budget in the autumn, the under performance of the economy and higher borrowing costs mean the chancellor may already have lost the £9.9bn of fiscal headroom that she clawed back in March. \"Throw in the tough outlook for many government departments announced in the spending review and U-turns on welfare spending and the chancellor will probably have to announce some top-up tax increases after the summer.\""
    },
    {
        "title": "TalkTalk plots break-up of telecoms and broadband group",
        "description": "TalkTalk, the telecoms and broadband group founded by Sir Charles Dunstone, is preparing to hire City advisers to oversee a break-up of the company.",
        "url": "https://news.sky.com/story/talktalk-plots-break-up-of-telecoms-and-broadband-group-13386092",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-talktalk-talk_6639687.jpg?20240726105456",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-20 09:46:00",
        "Headline": "The company founded by Sir Charles Dunstone has convened a beauty parade of investment banks to oversee a strategic review and sale of its two divisions, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n TalkTalk, the telecoms and broadband group founded by Sir Charles Dunstone, is preparing to hire City advisers to oversee a break-up of the company. Sky News has learnt investment banks were asked to pitch this week for a mandate to oversee a potential sale of TalkTalk's two remaining businesses: its consumer arm and PXC, its wholesale and network division. City sources said on Friday that Barclays and Morgan Stanley were among the banks in the frame to oversee the strategic review, which has been triggered by separate unsolicited approaches for both parts of the group. Money latest: The sunscreens failing safety tests TalkTalk, which has been grappling with a strained balance sheet for some time, is also in talks to raise a further £100m from a combination of existing investors and asset sales, according to people close to the situation. The company has recently drafted in advisers from Alvarez & Marsal, the professional services firm, to assist its finance function with liquidity management, the people added. TalkTalk has more than 3m broadband customers, with parts of its customer base expected to be sold as part of its efforts to raise money. \n                  Hundreds of jobs at risk as River Island takes axe to store base\n                 \n                  Post Office Capture scandal: Sir Alan Bates calls for those responsible for wrongful convictions to be 'brought to account'\n                 \n                  'Inflation and customer cutbacks' blamed for big dive in retail sales\n                 It completed a £1.2bn refinancing late last year, but has been under pressure from bondholders to raise additional capital. The likely proceeds from the sales of its two divisions were unclear on Friday. Read more from Sky News:Sir Alan Bates backs Post Office Capture victims'Inflation and customer cutbacks' blamed for dive in retail salesGovt considers industrial energy cost aid Earlier this month, the Financial Times reported that BT's broadband infrastructure arm, Openreach, could block TalkTalk from adding new customers to its network in an escalating dispute over payments owed to BT Group. A TalkTalk spokesman declined to comment."
    },
    {
        "title": "Apollo-backed Athora eyes £5bn deal for Pension Insurance Corporation",
        "description": "A savings and retirement services group backed by Apollo Global Management is plotting a multibillion pound takeover of Pension Insurance Corporation (PIC), one of the City's biggest specialist insurers.",
        "url": "https://news.sky.com/story/apollo-backed-athora-eyes-1635bn-deal-for-pension-insurance-corporation-13386100",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-notes-banknotes_6938843.jpg?20250611021632",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-20 10:10:00",
        "Headline": "A takeover of the pension risk transfer specialist, which has insured liabilities at RSA and BAT, would represent a landmark deal in the industry, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A savings and retirement services group backed by Apollo Global Management is plotting a multibillion pound takeover of Pension Insurance Corporation (PIC), one of the City's biggest specialist insurers. Sky News has learnt that Athora, which was established by Apollo, the US-based alternative investments giant, is in talks to acquire control of PIC. If successfully completed, the deal - which bankers estimate could be worth between £4bn and £5bn - would represent a landmark transaction in the pension risk transfer market. Money latest: The sunscreens failing safety tests Companies such as PIC, Legal & General and Rothesay take over companies' defined benefit pension schemes and the assets behind them, and have grown significantly in the last decade. RSA, the insurer, and British American Tobacco are among the corporate names with which PIC has transacted. It has also signed agreements with Chemring and Qantas. \n                  Hundreds of jobs at risk as River Island takes axe to store base\n                 \n                  Post Office Capture scandal: Sir Alan Bates calls for those responsible for wrongful convictions to be 'brought to account'\n                 \n                  'Inflation and customer cutbacks' blamed for big dive in retail sales\n                 PIC's shareholders include CVC Capital Partners, BlackRock-owned HPS, a subsidiary of the Abu Dhabi Investment Authority and Reinet, a vehicle created from the restructuring of luxury goods group Richemont. Further details of a potential deal between Athora and PIC, including its pricing and structure, were unclear on Friday. Apollo previously looked at an offer for PIC in 2023, with rival bidders including Carlyle and KKR also emerging. Read more from Sky News:Sir Alan Bates backs Post Office Capture victims'Inflation and customer cutbacks' blamed for dive in retail salesGovt considers industrial energy cost aid The market for BGL annuities has exploded in recent years as companies seek to offload a variety of pension-related financial risks. PIC recently announced the retirement of its long-serving chief executive, Tracy Blackwell, and has yet to name her successor. Spokespeople for Apollo and PIC declined to comment."
    },
    {
        "title": "MPs back legalising assisted dying in England and Wales after historic Commons vote",
        "description": "MPs have voted to approve a historic bill that would legalise assisted dying in England and Wales.",
        "url": "https://news.sky.com/story/mps-back-legalising-assisted-dying-in-historic-commons-vote-13386047",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-assisted-dying-bill_6946746.jpg?20250620145020",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-20 13:29:00",
        "Headline": "More than 300 MPs backed a bill that would allow terminally ill adults with a life expectancy of less than six months to apply for an assisted death.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  MPs have voted to approve a historic bill that would legalise assisted dying in England and Wales. The Terminally Ill Adults (End of Life) Bill was approved by 314 votes to 291 at its third reading in the House of Commons - a majority of 23. Politics Live: MPs back legalising assisted dying in historic Commons vote Labour MP Kim Leadbeater, who proposed the legislation, was seen crying in the chamber as it went through. Campaign group Dignity in Dying hailed the result as \"a landmark moment for choice, compassion and dignity at the end of life\". \"MPs have listened to dying people, to bereaved families and to the public, and have voted decisively for the reform that our country needs and deserves,\" said Sarah Wootton, its chief executive. The bill will now go to the House of Lords, where it will face further scrutiny before becoming law. Due to a four-year \"backstop\" added to the bill, it could be 2029 before assisted dying is actually offered, potentially coinciding with the end of this government's parliament. The bill would allow terminally ill adults with fewer than six months to live to apply for an assisted death, subject to approval by two doctors and a panel featuring a social worker, senior legal figure and psychiatrist. MPs have deliberated the proposals for months, with a vote in November passing with a bigger majority of 55.  Since then it has undergone some significant changes, the most controversial being the replacement of a High Court Judge's approval with the expert panel. Ms Leadbeater has always insisted her legislation would have the most robust safeguards of any assisted dying laws in the world.  Opening the debate on Friday she said that opposing the bill \"is not a neutral act. It is a vote for the status quo\". She warned that if her plan was rejected, MPs would be asked to vote on it again in 10 years and \"that fills me with despair\". Health correspondent A chain of events that started with the brutal murder of an MP almost 10 years ago has today led to historic societal change - the like of which many of us will never see again.   Assisted dying will be legalised in England and Wales. In four years' time adults with six months or less to live and who can prove their mental capacity will be allowed to choose to die.  Kim Leadbeater, the MP who has made this possible, never held political aspirations. Previously a lecturer in health, Ms Leadbeater reluctantly stood for election after her sister Jo Cox was fatally stabbed and shot to death in a politically motivated attack in 2016. \n\nAnd this is when, Ms Leadbeater says, she was forced to engage with the assisted dying debate. Because of the sheer volume of correspondence from constituents asking her to champion the cause. \n Polls have consistently shown some 70% of people support assisted dying. And ultimately, it is this seismic shift in public opinion that has carried the vote. Britain now follows Canada, the USA, Belgium, Switzerland, the Netherlands and Australia. All countries with sophisticated health systems. Nowhere has assisted dying been reversed once introduced. \n\n The relationship between doctor and patient will now also change. The question is being asked: Is an assisted death a treatment? There is no decisive answer. But it is a conversation that will now take place. The final answer could have significant consequences, especially in mental health settings. \n\n There are still many unknowns. Who will be responsible for providing the service? The NHS? There is a strong emotional connection to the health service and many would oppose the move. But others will argue that patients trust the institution and would want to die in its arms. \n\n The challenge for health leaders will be to try and reconcile the bitter divisions that now exist within the medical community. The Royal Colleges have tried to remain neutral on the issue, but continued to challenge Ms Leadbeater until the very end. \n\n Their arguments of a failure of safeguards and scrutiny did not resonate with MPs. And nor did concerns over the further erosion of palliative care.  Ms Leadbeater's much-repeated insistence that  \"this is the most scrutinised legislation anywhere in the world\" carried the most weight. \n\n Her argument that patients should not have to fear prolonged, agonising deaths or plan trips to a Dignitas clinic to die scared and alone, or be forced to take their own lives and have their bodies discovered by sons, daughters, husbands and wives because they could not endure the pain any longer was compelling.  The country believed her. The assisted dying debate was last heard in the Commons in 2015, when it was defeated by 330 votes to 118. There have been calls for a change in the law for decades, with a campaign by broadcaster Dame Esther Rantzen giving the issue renewed attention in recent years. Supporters have described the current law as not being fit for purpose, with desperate terminally ill people feeling the need to end their lives in secret or go abroad alone, for fear loved ones will be prosecuted for helping them. Ahead of the vote, an hours-long emotionally charged debate heard MPs tell personal stories about their friends and family. Maureen Burke, the Labour MP for Glasgow North East, spoke about how her terminally ill brother David was in so much pain from advanced pancreatic cancer that one of the last things he told her was that \"if there was a pill that he could take to end his life, he would very much like to take that\". She said she was \"doing right by her brother\" in voting for it. How did MPs vote? MPs were given a free vote, meaning they could vote with their conscience and not along party lines. The division list shows Prime Minister Sir Keir Starmer voted in favour of the bill, but Conservative leader Kemi Badenoch voted against. Health Secretary Wes Streeting and Justice Secretary Shabana Mahmood, who will have to deliver the bill, also voted no. Read more: Find out how your MP voted Bill 'poorly drafted' Opponents have raised both practical and ethical concerns, including that people could be coerced into seeking an assisted death and that the bill has been rushed through. Veteran Labour MP Diane Abbott said she was not opposed to the principle of assisted dying but called the legislation \"poorly drafted\". Former foreign secretary James Cleverly echoed those concerns, saying he is \"struck by the number of professional bodies which are neutral on the topic of assisted dying in general, but all are opposed to the provisions of this bill\". Recently, the Royal College of Psychiatrists, the Royal College of Pathologists and the Royal College of Physicians have raised concerns about the bill, including that there is a shortage of staff to take part in assisted dying panels.  However, public support for a change in the law remains high, according to a YouGov poll published on the eve of the vote. The survey of 2,003 adults in Great Britain suggested 73% of those asked last month were supportive of the bill, while the proportion of people who feel assisted dying should be legal in principle stood at 75%."
    },
    {
        "title": "The assisted dying debate has been politics – but not as we know it",
        "description": "The House of Commons is a place defined by confrontation where political battles play out and engage more actively with their constituents.",
        "url": "https://news.sky.com/story/the-assisted-dying-debate-has-been-politics-8211-but-not-as-we-know-it-13386531",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-kim-leadbeater-assisted-dying_6946554.jpg?20250620104730",
        "type": "Politics",
        "Author": "Liz Bates",
        "Date Published": "2025-06-20 20:48:00",
        "Headline": "Party divisions have been put aside with MPs being asked to search their own consciences and encouraged to engage with constituents more. ",
        "Content": "\n          Political correspondent\n              @wizbates\n  The House of Commons is a place defined by confrontation where political battles play out and engage more actively with their constituents. But the atmosphere could not have been more different on Friday, as those on both sides of the assisted dying debate listened respectfully, almost solemnly, to one another in the final hours before the crucial vote. As MPs headed for the division lobbies, the bill's supporters seemed confident but nervous. Read more:How both sides of debate reacted to historic voteFind out how your MP voted on the bill When the voting was completed and the result imminent, a long and profound silence fell over the House. From the press gallery, it seemed that the entire Commons was holding its breath together, collectively aware of the historic moment we were all about to witness, whatever the outcome. The woman at the centre of this seismic moment, the bill's sponsor Kim Leadbeater, braced herself as the result came in. Many months of pressure and responsibility appeared to be lifted from her shoulders as the win was announced and colleagues gathered to commend her efforts. Throughout the process this been politics but not as we know it, with party divisions put aside and MPs asked to search their own consciences and come to their own conclusions. It has created a more collaborative atmosphere in parliament and encouraged MPs to engage more actively with their constituents.  In the end there was still anger, frustration and disappointment among those who were against the law change, either on principle or because they believed the legislation was flawed. And of course, politics will go back to being combative and voices in the Commons will be raised once again. But for a brief period, historic change was calmly ushered in. The challenge for the proponents now is to take the legislation through the next phases and deliver it with the same smoothness and determination."
    },
    {
        "title": "Palestine Action to be banned after break in at RAF base, Sky News understands",
        "description": "The home secretary is planning to proscribe the Palestine Action group, effectively branding it as a terrorist organisation, Sky News understands. ",
        "url": "https://news.sky.com/story/palestine-action-to-be-banned-after-break-in-at-raf-base-sky-news-understands-13386424",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-plane-brize_6946805.jpg?20250620155035",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-20 17:05:00",
        "Headline": "It comes after pro-Palestinian activists targeted RAF Brize Norton and damaged two military aircraft.",
        "Content": " The home secretary is planning to proscribe the Palestine Action group, effectively branding it as a terrorist organisation, Sky News understands.  Yvette Cooper is preparing a written ministerial statement which would make becoming a member of the group illegal. The statement is expected on Monday and will then need to be enacted through new legislation. It comes after pro-Palestinian activists targeted RAF Brize Norton and damaged two military aircraft - with Sir Keir Starmer describing their actions as \"disgraceful\". A security review has now been launched after the breach. Brize Norton, in Oxfordshire, is the largest RAF station with approximately 5,800 service personnel, 300 civilian staff and 1,200 contractors. In a video shared by Palestine Action on Friday morning, a person can be seen approaching an aircraft on a scooter as music is played. The person then sprays paint into one of the plane's engines. Red paint can be seen on the ground. \n                  Ex-classmates died after being treated at same mental health hospital - as concerns raised over more deaths\n                 \n                  MPs back legalising assisted dying in England and Wales after historic Commons vote\n                 \n                  How did your MP vote on the assisted dying bill?\n                 Repurposed fire extinguishers were used to spray the paint into the turbine engines of two Airbus Voyagers, while further damage was made using crowbars. The organisation - which focuses its campaigns on multinational arms dealers and has previously targeted corporate banks - said it had damaged two military planes at the base, where flights depart on a daily basis for RAF Akrotiri in Cyprus. The group said two activists \"broke into the largest air force base in Britain and used electric scooters to swiftly manoeuvre towards the planes\". They said they did so because \"despite publicly condemning the Israeli government, Britain continues to send military cargo, fly spy planes over Gaza and refuel US/Israeli fighter jets\". \"Britain isn't just complicit, it's an active participant in the Gaza genocide and war crimes across the Middle East,\" the group said in a statement. \"By decommissioning two military planes, Palestine Action have directly intervened in the genocide and prevented crimes against the Palestinian people.\" However a senior RAF source told Sky News's security and defence editor Deborah Haynes that the aircraft have nothing to do with Israel's war in Gaza. Read more:PM could allow Trump use of British bases to attack IranChina - UK warship sailed through Taiwan Strait to 'cause trouble' After it emerged the government was planning to ban Palestine Action, the group wrote on X: \"We represent every person who stands for Palestinian liberation. If they want to ban us, they ban us all.\" The two Voyagers - out of a fleet of 10 currently being used by the RAF - have been impounded while an investigation into the extent of the damage is carried out. On X, the prime minister condemned the \"act of vandalism\", adding: \"Our Armed Forces represent the very best of Britain and put their lives on the line for us every day. It is our responsibility to support those who defend us.\" The Ministry of Defence (MoD) confirmed it is \"working closely with the police, who are investigating\". A \"proscribed organisation\" is an organisation or group that is illegal to join or show support for, because it has been identified as being concerned in terrorism. The home secretary has the powers to proscribe an organisation under the Terrorism Act 2000, if that organisation commits or participates in acts of terrorism, prepares for terrorism, promotes or encourages terrorism (including the unlawful glorification of terrorism); or is otherwise concerned in terrorism."
    },
    {
        "title": "Sir Keir Starmer tries to contain rebellion among Labour MPs over welfare reforms",
        "description": "Sir Keir Starmer had a series of one-on-one meetings with Labour MPs on Friday to try to contain a rebellion on the government's welfare reforms.",
        "url": "https://news.sky.com/story/sir-keir-starmer-tries-to-contain-rebellion-among-labour-mps-over-welfare-reforms-13386480",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-keir-starmer-azerbaijan_6746516.jpg?20241112114152",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-06-20 19:14:00",
        "Headline": "While cabinet ministers do not expect mass resignations, one junior minister told Sky News that opposition to the reforms was \"pretty strong\".",
        "Content": "\n          Political correspondent\n              @tamcohen\n  Sir Keir Starmer had a series of one-on-one meetings with Labour MPs on Friday to try to contain a rebellion on the government's welfare reforms. Ahead of the assisted dying vote, the prime minister met privately with some of the dozens of MPs with concerns about the proposed cuts to sickness and disability benefits. The first vote on the legislation, which the chancellor says will save £5bn a year from the welfare bill, will be held in early July. The prime minister's involvement at this stage suggests a major effort is underway to quell a potential rebellion. Cabinet ministers say they do not expect mass resignations, but one junior minister told Sky News that opposition to the reforms was \"pretty strong\". One frontbencher, government whip Vicky Foxcroft, resigned her post yesterday, writing that she understood \"the need to address the ever-increasing welfare bill\" but did not believe the proposed cuts \"should be part of the solution\". Other junior ministers and whips have not, as yet, moved to follow her. But one government insider said: \"It's difficult to tell if the mood will harden as we get closer. There's a lot of work going on.\" \n                  Labour MP Vicky Foxcroft quits as government whip over cuts to disability benefits\n                 \n                  Is Labour facing big backlash over welfare reforms?\n                 \n                  Battle to convince MPs to back benefit cuts to more than three million households \n                 The package of reforms is aimed at encouraging more people off sickness benefits and into work, but dozens of Labour rebels said last month that the proposals were \"impossible to support\".  Welfare secretary Liz Kendall is also meeting individually with MPs. She said earlier this week that the welfare system is \"at a crossroads\" and the bill was about \"compassion, opportunity and dignity\". Read more from Sky News:Kendall: Reforms will go aheadSpending review - winners and losersIFS: Reeves risks having to raise taxes Ministers are trying to convince MPs that a £1bn fund to support disabled people into work, and the scrapping of the Work Capability Assessment, a key demand of disability groups, make the cuts package worth voting for. They insist that 90% of current claimants of personal independence payment (PIP) will not lose the benefit. But disability groups say the cuts will have a \"disastrous\" effect on vulnerable people."
    },
    {
        "title": "US singer Chris Brown pleads not guilty to attempting to cause GBH",
        "description": "Singer Chris Brown has pleaded not guilty to attempting to cause grievous bodily harm over an alleged bottle attack at a London nightclub two years ago.",
        "url": "https://news.sky.com/story/chris-brown-pleads-not-guilty-to-gbh-charge-over-alleged-bottle-attack-13385830",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-chris-brown-court_6946543.jpg?20250620103256",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-20 09:15:00",
        "Headline": "The US R&B star was arrested at a hotel in Manchester by Metropolitan Police detectives last month, after the singer flew to the city by private jet in preparation for his world tour.",
        "Content": " Singer Chris Brown has pleaded not guilty to attempting to cause grievous bodily harm over an alleged bottle attack at a London nightclub two years ago. The US R&B star was arrested at a hotel in Manchester by Metropolitan Police detectives last month, after the singer flew to the city by private jet in preparation for his world tour. The 36-year-old said he had gone \"from the cage to the stage\" after he was released on bail in time for the tour. The musician had been remanded in custody following an initial hearing at Manchester Magistrates' Court but was freed ahead of his court appearance after paying a £5m security fee to the court. Brown is accused of attempting to unlawfully and maliciously cause grievous bodily harm with intent to Abraham Diaw at a London nightclub called Tape in Hanover Square, Mayfair, on 19 February 2023. He confirmed his name and date of birth at Southwark Crown Court on Friday before entering his plea, saying: \"Not guilty ma'am.\" His co-defendant, US national Omololu Akinlolu, 39, who performs under the name Hoody Baby, pleaded not guilty to the same charge. Both defendants are further charged with assaulting Mr Diaw occasioning him actual bodily harm, with Brown also facing one count of having an offensive weapon - a bottle - in a public place. They were not asked to enter pleas to those charges, with a further court hearing set for 11 July. Last month, Manchester Magistrates Court heard Mr Diaw was standing at the bar of the nightclub when he was struck several times with a bottle, before being pursued to a separate area of the venue, where he was punched and kicked repeatedly. Around 20 people sat in the public gallery behind the dock for the hearing, many of them fans of Brown. The singer arrived at around 9am to a large group of photographers outside court and walked to the building's entrance in silence. A trial date has been set for 26 October 2026."
    }
]