[
    {
        "title": "Putin will break any peace deal where Ukraine is not 'defended' by 'coalition of the willing', Starmer warns",
        "description": "Vladimir Putin will break any peace agreement with Ukraine that is not \"defended\" by an international coalition of forces, the British prime minister has said.",
        "url": "https://news.sky.com/story/putin-will-break-any-peace-deal-where-ukraine-is-not-defended-by-coalition-of-the-willing-starmer-warns-13332903",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-starmer-pm-defence_6862737.jpg?20250320234743",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-03-20 22:47:00",
        "Headline": "The prime minister spoke as he visited a UK base to meet a group of senior military officers from more than 30 nations tasked with turning a political desire to support Kyiv into an actionable plan to help protect the country.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Vladimir Putin will break any peace agreement with Ukraine that is not \"defended\" by an international coalition of forces, the British prime minister has said. Sir Keir Starmer was talking on Thursday as he visited a UK base to meet a group of senior military officers from more than 30 nations tasked with turning a political desire to support Kyiv into an actionable plan to help protect the country from land, sea and air in the event of a ceasefire. But, with Donald Trump pushing hard for Russia and Ukraine to stop fighting now, there are concerns among analysts that the \"coalition of the willing\" - led by the UK and France - will be overtaken by events, with peace declared before it has time to get its act together. In a sign of the challenge, the southern Ukrainian city of Odesa was struck on Thursday night by what its governor described as a \"massive\" Russian drone attack even as the US president talked up the prospects for peace. US negotiators are set to meet separately with Ukrainian and Russian officials in Saudi Arabia on Monday to try to make progress on a ceasefire. Mr Trump also claimed he was on the brink of signing an economic deal with Ukraine - something that has been trailed for weeks as a key step in strengthening US-Ukraine relations and locking in Washington's support for Kyiv's future, but has yet to materialise. Ukraine war latest: Follow live updates \n                  Heathrow Airport closed after 'significant power outage' due to nearby fire\n                 \n                  Stephen Lawrence killer David Norris 'admits role in attack', says Parole Board\n                 \n                  Former first minister Nicola Sturgeon cleared in police investigation into SNP's finances\n                 Clearly alive to the urgency to act, Sir Keir greeted the group of visiting military planners at the UK's Permanent Joint Headquarters at Northwood, on the edge of London. They gathered around a large map of Ukraine spread out across a table. \"Now is the time to be doing this,\" the prime minister told the officers from a range of European and other allied countries, including Turkey, the Netherlands and Canada. Ukrainian officers were also present as well as NATO officials. \"We don't know what the outcome of any [peace] talks is going to be, but we do know that if there is a deal, it's important to have done the preparation beforehand.\" The size and shape of what Western officials have described as a \"reassurance force\" for Ukraine are unclear - so too what kind of military headquarters would command it. Initial briefings on the concept suggested it could involve thousands of troops deployed to cities and to protect critical infrastructure such as nuclear power stations, but kept back from frontline areas, while Royal Air Force warplanes and other countries' jets would protect Ukraine's skies, and various navies, including the Royal Navy, would help secure the sea. Yet, without US support, the European offer, even with backing from other aligned nations such as Canada, would not act as much of a deterrence to Russia. And that is if the coalition is ready to deploy in time for any ceasefire. Read more:Does Trump have any red lines?The 'coalition of the willing' that could secure peace in Ukraine The British prime minister said peace would only endure if \"it is a defended deal\". He offered a sense of what the military planners have been tasked with delivering after the political leaders of all the countries involved agreed to work together to help Ukraine. \"What's happening here is turning that political intention into reality - the concept into plans, whether that's in relation to what might happen at sea or air or defending borders,\" Sir Keir said. \"But it is vitally important we do that work because we know one thing for certain, which is a deal without anything behind it is something that Putin will breach. \"We know that because it's happened before. And I'm absolutely clear in my mind it will happen again.\""
    },
    {
        "title": "Former first minister Nicola Sturgeon cleared in police investigation into SNP's finances",
        "description": "Former first minister Nicola Sturgeon is no longer under investigation by Police Scotland amid a probe into the SNP's funding and finances.",
        "url": "https://news.sky.com/story/ex-snp-chief-peter-murrell-appears-in-court-charged-with-embezzlement-13332544",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nicola-sturgeon-scotland_6854180.jpg?20250320140106",
        "type": "Home",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-03-20 13:04:00",
        "Headline": "Meanwhile, former SNP chief executive Peter Murrell, who is separated from Ms Sturgeon, has appeared in court charged with embezzlement",
        "Content": "\n          Scotland reporter\n              @Jenster13\n  Former first minister Nicola Sturgeon is no longer under investigation by Police Scotland amid a probe into the SNP's funding and finances. Meanwhile, former SNP chief executive Peter Murrell, who is separated from Ms Sturgeon, has appeared in court charged with embezzlement. Speaking outside her home on Thursday, Ms Sturgeon said she was \"completely in the clear\", adding: \"That is the outcome I would always have expected. \"As I have said to all of you many times, I have done nothing wrong. So, I was confident of reaching this point and getting to this outcome, but obviously it is a relief now to have that confirmed.\" Ms Sturgeon said for almost two years she had \"this cloud of investigation\" hanging over her. She added: \"I think it won't surprise anybody to hear me say that it's not been an easy experience, so to reach this point today is obviously something I am relieved about. \"I've been trying to get on with my life and I now intend to do that.\" \n                  Nicola Sturgeon announces she will not seek re-election to Holyrood next year\n                 \n                  Scotland's former first minister Nicola Sturgeon splits from husband\n                 \n                  Nicola Sturgeon knows 'nothing more' about police probe 18 months after arrest\n                 Responding to Sky News' Scotland correspondent Connor Gillies, Ms Sturgeon said she was limited in what she could say about an active police investigation. But she added: \"All I can say is that I have done nothing wrong and I don't think there was ever a scrap of evidence that I had done anything wrong.\" Ms Sturgeon described herself as a \"stronger person today\" than she was when it all \"kicked off\". She added: \"That said, I wish none of it had happened.\" Ms Sturgeon said she had \"exciting things coming up\" including the publication of her book, which is titled Frankly and is set for release on 14 August. Murrell made no plea to the single charge when he appeared at Edinburgh Sheriff Court earlier in the day. The 60-year-old was granted bail with his next court appearance yet to be confirmed. Murrell, who had been SNP chief executive since 1999, resigned in March 2023 amid a row over party numbers. The following month he was arrested under Police Scotland's long-running Operation Branchform and was subsequently charged a year later with embezzling SNP funds. The probe, which has been ongoing since July 2021, is linked to the spending of around £600,000 raised by SNP supporters to be earmarked for Scottish independence campaigning. Ms Sturgeon and ex-party treasurer MSP Colin Beattie were also arrested and released without charge as part of the investigation. Mr Beattie has now been cleared alongside Ms Sturgeon. In a statement posted online, Mr Beattie said he was \"absolutely delighted\" to be cleared of all suspicion. The MSP for Midlothian North and Musselburgh said: \"While there was no question in my mind that I had done nothing wrong, the fact is that it created a question among those who do not know me.\" Mr Beattie thanked all those who offered support to both him and his wife. He added: \"Now, I intend to share a glass of something with my wife tonight, and tomorrow I can focus on the future as I put myself forward for consideration as the SNP candidate for the Midlothian North county constituency.\" A Police Scotland spokesperson said the probe into Ms Sturgeon and Mr Beattie had concluded and both were no longer under investigation following direction from the Crown Office and Procurator Fiscal Service (COPFS). Read more from Sky News:Sturgeon announces she will not seek re-electionLike her or loathe her, Sturgeon is a formidable politician However, COPFS has warned that the case against Murrell is active under the Contempt of Court Act 1981. A spokesperson said: \"Anyone publishing items about active cases is advised to exercise caution as material must not be commentary or analysis of evidence, witnesses or accused. \"Contempt of Court carries penalties of up to two years in prison and/or an unlimited fine.\" COPFS said prosecutors and independent counsel are dealing with Murrell's case without involving Lord Advocate Dorothy Bain KC or Solicitor General Ruth Charteris KC. The spokesperson added: \"All Scotland's prosecutors operate independently of political influence. \"Where allegations are made against people or institutions in which the public have placed trust, it is the responsibility of the authorities to conduct a thorough investigation to determine if there is evidence that criminal conduct has occurred. \"We understand public curiosity about this investigation. However, the Crown does not publicly share details of confidential inquiries where there are no proceedings in court. \"This protects the rights of the individuals concerned who are entitled to a presumption of innocence.\" In January, Ms Sturgeon announced she had split from Murrell. The pair, who first met via the SNP in 1988 and became a couple in 2003, married in 2010. The Glasgow Southside MSP announced the separation in a post on Instagram, revealing they had been \"separated for some time now\" but \"still care deeply for each other, and always will\". And just last week, Ms Sturgeon announced she will not seek re-election to Holyrood next year. She said: \"I have known in my heart for a while that the time is right for me to embrace different opportunities in a new chapter of my life.\""
    },
    {
        "title": "UN says teachers, doctors, nurses were among staff killed in Israeli strikes – which killed 91 people in Gaza",
        "description": "Israeli strikes killed at least 91 Palestinians across the Gaza Strip overnight and into Thursday, according to the Hamas-run health ministry.",
        "url": "https://news.sky.com/story/at-least-85-palestinians-killed-in-gaza-strikes-local-health-authorities-say-13332425",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-israeli-strikes-palestinians_6861838.jpg?20250320083249",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-20 09:57:00",
        "Headline": "After a two-month-long ceasefire, fighting began again in Gaza after Israel launched a series of airstrikes on the enclave earlier this week. Over 400 people were killed before it restarted ground operations as well.",
        "Content": " Israeli strikes killed at least 91 Palestinians across the Gaza Strip overnight and into Thursday, according to the Hamas-run health ministry. Five UN staff members have also been killed, according to the head of the UNRWA. It comes as Israeli attacks in Gaza have resumed this week - bringing an end to the ceasefire that had paused fighting in the 17-month war. Philippe Lazzarini, head of UNRWA, the United Nations Palestinian relief agency, said on Thursday: \"In the past few days, another five UNRWA staff have been confirmed killed, bringing the death toll to 284. \"They were teachers, doctors and nurses: serving the most vulnerable.\" He added he feared \"the worst is yet to come\". \"Under our daily watch, people in Gaza are again and again going through their worst nightmare,\" he said in a statement. \"An endless unleashing of the most inhumane ordeals.\" Tzipi Hotovely, Israel's ambassador to the UK, has told Sky News the ceasefire was first broken by Hamas because they \"stopped releasing our hostages\". Her comments came despite Hamas having released all the hostages that were agreed under phase one of the ceasefire - with phase two having not begun yet. However, Ms Hotovely said Israel had agreed to extend phase one of the ceasefire on one condition - that Hamas keeps releasing hostages. Speaking to Sky News presenter Sophy Ridge, the ambassador continued: \"We waited three weeks with no hostages being released. \"Do you expect Israel to sit and do nothing when 59 people from our people are dying there in the tunnels? \"Do you expect Israel to do nothing?\" Ms Hotovely added that Hamas can stop the war immediately by releasing all of the 59 remaining hostages.  Her comments came after the Israeli military said on Thursday evening that it had begun a ground operation in Shaboura in Rafah \"over the past few hours\". It added that Israeli troops had \"dismantled a number of terrorist infrastructure\" during the operation in southern Gaza. The Israeli military also said ground operations were continuing in northern and central Gaza - adding that troops had destroyed a hospital which Israel claims Hamas used as a command centre. Speaking in Parliament earlier, Foreign Secretary David Lammy said the UK government opposed the resumption of Israel's hostilities and added that a British national was among the wounded when a UN compound was struck on Wednesday. Israel has previously said it only targets militants and blames civilian deaths on Hamas because it operates in densely populated areas. It denied previous reports it had targeted a UN compound.  Israel resumes strikes On Tuesday, Israel resumed heavy airstrikes on the enclave killing more than 400 people, bringing to a halt the ceasefire that had paused fighting in the 17-month war. A day later, the Israeli Defense Forces (IDF) relaunched ground operations, seizing part of a key corridor that divides the north and south of Gaza - the Netzarim corridor. Meanwhile, Hamas fired three rockets at Israel without causing casualties. It was the first such attack since the resumption of the IDF's strikes. Hospitals across Gaza said the strikes hit houses in Khan Younis and Rafah in southern Gaza and the northern town of Beit Lahiya. The Israeli military said it was looking into the reports. The European Hospital in Rafah said 26 people, mostly women and children, had been killed in strikes on two family homes overnight. A father and his seven children were killed in one of the attacks, it added. The Nasser Hospital in Khan Younis received the bodies of seven people killed overnight in an attack on a home, it said. Meanwhile, Hamas said talks with mediators were ongoing. Fragile ceasefire  Hamas and Israel disagreed over how to proceed with the ceasefire after phase one came to an end. The militant group wanted to move onto phase two to negotiate Israel's permanent withdrawal from Gaza, the release of hostages in exchange for more prisoners and an eventual end to the war. Read more:What happened to the Israel-Hamas ceasefire?Siblings among those killed in one of Gaza's deadliest days Israel wanted to temporarily extend phase one and for more hostages to be released. It cut off all supplies to Gaza to try and pressure the group into doing so before restarting its military campaign. The war started after Hamas militants attacked Israeli communities in October 2023, killing 1,200 people and taking more than 250 hostages. More than 49,000 Palestinians have been killed in the ensuing conflict, according to Gaza's health authorities,"
    },
    {
        "title": "Kirsty Coventry: After historic win, new IOC president must deal with Trump, Putin and transgender issue",
        "description": "It was a win as resounding as it was historic - Kirsty Coventry becoming the first African and the first woman to assume the most powerful and prestigious role in sport.",
        "url": "https://news.sky.com/story/kirsty-coventry-after-her-historic-win-the-new-ioc-president-must-deal-with-trump-putin-and-transgender-issue-13332791",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-olympics-greece-kirsty-coventry_6862570.jpg?20250320205005",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-03-20 20:43:00",
        "Headline": "The double Olympic champion swimmer has worked on the IOC Athletes' Commission and in Zimbabwe's government as sports minister and says she has lots of experience of dealing with \"difficult men in high positions\".",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  It was a win as resounding as it was historic - Kirsty Coventry becoming the first African and the first woman to assume the most powerful and prestigious role in sport. The double Olympic champion will now lead the Olympic movement in a turbulent world. There aren't just sporting but political challenges confronting the IOC. How to handle Vladimir Putin and whether Russia's Olympic ban remains in place over the war on Ukraine? And how to deal with Donald Trump's volatility, unpredictability, and meddling as Los Angeles prepares to host the 2028 Olympics? But Mrs Coventry has been preparing for this moment since retiring from the pool - with all the experience gained on the IOC Athletes' Commission and in Zimbabwe's government as sports minister. \"I have been dealing with, let's say, difficult men in high positions since I was 20 years old,\" she said, adding her \"firm belief is that President Trump is a huge lover of sports\". \n                  Athens protest: Greek anger at lack of change boils over, two years after country's worst rail disaster\n                 \n                  Protesters hurl petrol bombs and police fire tear gas as demonstration in Greece turns violent\n                 \n                  Greece declares state of emergency on Santorini after earthquakes\n                 But, I asked, will she comply with Mr Trump's order to ban transgender women from women's events at the Olympics? \"It's going to take communication,\" she replied. \"We're going to create a task force that's going to look at the transgender issue and the protection of the female category. \"And once we've made the decision collectively as the IOC with the international federations that decision will be made very clear and we won't move from that decision.\" Not the strident approach advanced by Sebastian Coe - the only one of the seven IOC candidates to agree with Trump's trans stance. While Mrs Coventry secured 49 of the 97 votes - for an unexpected first-round win - Lord Coe picked up just eight backers. We are never told who the IOC membership - from sport, business, and royalty - picked. But a humiliating third place showed perhaps that Lord Coe was too disruptive as a change candidate and, particularly, too divisive with his push for prize money for medallists. \"It's a disappointing result, but that's what happens when you go into elections,\" the World Athletics president said. \"I think it's pretty clear that the athletes and, in particular the female members, voted for her in very big numbers in the first round.\" This seemed a win for the continuity candidate - closely aligned with Thomas Bach during his 12 years leading the IOC. When I asked the German about Lord Coe's criticism of the closed and secretive election process, he replied: \"Don't blame the voters, don't blame the procedure.\" There won't be another vote for eight years. And Mrs Coventry could then seek another four-year term. At 41, she is the second youngest IOC election winner at a time when the Olympics is trying to maintain appeal to younger audiences. And the focus will soon shift to 2036 and where those Summer Olympics will be staged. Read more from Sky News:Thursday was hottest day of the year so farPrince William visits EstoniaUnreleased Eminem music stolen and sold There is interest from Saudi Arabia, Qatar, India and Turkey. But unlike Thursday's presidential poll, there has been a shift to designations of host cities, conferring prestige rather than contests. It gives even more power to the IOC's leader as Mrs Coventry officially begins her reign on Olympic Day in June."
    },
    {
        "title": "US attorney general threatens 20-year jail sentences for damaging Elon Musk's Tesla cars",
        "description": "The US attorney general has said three people alleged to have damaged Tesla cars and charging stations could be jailed for up to 20 years.",
        "url": "https://news.sky.com/story/us-attorney-general-threatens-20-year-jail-sentences-for-damaging-elon-musks-tesla-cars-13332767",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tesla-elon-musk-vandalism_6862557.jpg?20250320202600",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-20 20:08:00",
        "Headline": "Cars and charging stations associated with Elon Musk's company have been targeted in recent weeks. Meanwhile, on Thursday, almost all Cybertrucks were recalled due to a \"dangerous road hazard\".",
        "Content": "The US attorney general has said three people alleged to have damaged Tesla cars and charging stations could be jailed for up to 20 years. Pamela Bondi announced unspecified charges against three people who used Molotov cocktails in what she called a \"wave of domestic terrorism\". It comes as US safety regulators recalled almost all Cybertrucks from Elon Musk's company due to a \"dangerous road hazard\" that increases the risk of a crash. It is the eighth recall of the Tesla vehicle for safety problems in 15 months. The National Highway Traffic Safety Administration's recall, which covers more than 46,000 Cybertrucks, warned that an exterior panel that runs along the left and right sides of the windshield can detach while driving. In a statement on the three people charged with damaging Tesla cars and charging stations, Ms Bondi said: \"The days of committing crimes without consequence have ended. \"Let this be a warning: if you join this wave of domestic terrorism against Tesla properties, the Department of Justice will put you behind bars.\" \n                  Conor McGregor says he wants to be Ireland's next president\n                 \n                  Donald Trump signs order to dismantle US department of education\n                 \n                  Moments sport acted as tool of diplomacy - as Donald Trump and Vladimir Putin discuss hockey match \n                  The department said one of those arrested threw eight Molotov cocktails at a Tesla dealership in Salem, Oregon. This defendant was also armed with a suppressed AR-15 rifle. Another is alleged to have attempted to set on fire Tesla cars using Molotov cocktails in Loveland, Colorado, and was later found in possession of materials used to produce additional incendiary weapons. The third person wrote \"profane messages against President Trump\" around Tesla charging stations before setting stations on fire with petrol bombs in Charleston, South Carolina, the department said. Each of the three people arrested faces charges carrying a minimum penalty of five years, and up to 20 years in prison, the statement added. Read more:What's gone wrong at Tesla?Tesla investor calls for Elon Musk to step down Tesla showrooms, charging stations and privately-owned cars have been repeatedly targeted since the billionaire was appointed by Donald Trump to oversee a new Department of Government Efficiency (DOGE) that is slashing US government spending. As well as the attacks and recalls, Tesla has been struggling due to increased competition from rival electric vehicles, particularly out of China. Though largely unaffected by Thursday's recall announcement, Tesla shares have plummeted 42% in 2025."
    },
    {
        "title": "Donald Trump signs order to dismantle US department of education",
        "description": "US President Donald Trump has signed an executive order calling for the dismantling of the country's department of education.",
        "url": "https://news.sky.com/story/donald-trump-signs-order-to-dismantle-us-department-of-education-13332898",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-department-of-education_6862709.jpg?20250320225511",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-20 22:45:00",
        "Headline": "Mr Trump has long promised to take the agency apart, deriding it as wasteful and polluted by liberal ideology. But the department cannot be dismantled without an act of Congress.",
        "Content": " US President Donald Trump has signed an executive order calling for the dismantling of the country's department of education. However, the department cannot be dismantled without an act of Congress, which created it in 1979. Republicans have said they will introduce a bill to achieve that. Mr Trump has long promised to take the agency apart, deriding it as wasteful and polluted by liberal ideology. It has been a long-time target of conservatives. The order would leave school policy almost entirely in the hands of states and local boards, a prospect that alarms liberal education advocates. The president blamed the department for America's lagging academic performance and said states will do a better job. \"It's doing us no good,\" Mr Trump said at the White House. The White House said the department will not close completely and retained its responsibilities for funding for low-income schools, and distributing money for children with disabilities. \n                  Conor McGregor says he wants to be Ireland's next president\n                 \n                  US attorney general threatens 20-year jail sentences for damaging Elon Musk's Tesla cars\n                 \n                  Moments sport acted as tool of diplomacy - as Donald Trump and Vladimir Putin discuss hockey match \n                 The White House said earlier on Thursday that the department will continue to manage federal student loans, but the order appears to say the opposite. The department's workforce has already been slashed in half, and there have been deep cuts to the Office for Civil Rights and the Institute of Education Sciences, which gathers data on US academic progress. Much of the agency's work revolves around managing money - both its extensive student loan portfolio and a range of aid programmes for colleges and school districts, like school meals and support for homeless students. The agency is also key in overseeing civil rights enforcement. States and districts already control local schools, including the curriculum, but some conservatives have pushed to cut strings attached to federal money and provide it to states as \"block grants\" to be used at their discretion. Read more:What are Donald Trump's tariffs?Sky News correspondents react to Trump-Putin call Advocates for public schools said eliminating the department would leave children behind in an American education system that is fundamentally unequal. \"This is a dark day for the millions of American children who depend on federal funding for a quality education, including those in poor and rural communities with parents who voted for Trump,\" NAACP president Derrick Johnson said. Democrats said the order will be fought in the courts and in Congress."
    },
    {
        "title": "Surgeon dubbed France's 'most prolific child abuser' pleads guilty to abusing 299 patients",
        "description": "A 74-year-old surgeon who is believed to be France's most prolific child abuser has pleaded guilty to sexually abusing 299 of his patients.&#160;",
        "url": "https://news.sky.com/story/surgeon-dubbed-frances-most-prolific-child-abuser-pleads-guilty-to-abusing-299-patients-13332812",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-france-surgeon_6832657.png?20250218152128",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-20 21:13:00",
        "Headline": "Joel Le Scouarnec, 74, has been on trial charged with assaulting or raping the patients, many while under anaesthesia or waking up from operations, over a 25-year period. The average age of his alleged victims was just 11.",
        "Content": "A 74-year-old surgeon who is believed to be France's most prolific child abuser has pleaded guilty to sexually abusing 299 of his patients.  Joel Le Scouarnec has been on trial charged with assaulting or raping the patients, many while under anaesthesia or waking up from operations, between 1989 and 2014. In total, he's accused of 300 separate offences - 111 rapes and 189 sexual assaults - which took place in more than a dozen hospitals. The average age of his alleged victims was just 11 years old, with an almost equal number of boys and girls. Read more: How did Le Scouarnec carry out abuse unchecked for decades? He has been on trial since early March in one of France's largest child sex abuse cases. Until now, he has admitted his guilt on a case-by-case basis during the legal proceedings. \n                  Scientist 'denied entry to US' after messages critical of Trump found on his phone\n                 \n                  French citizen Olivier Grondeau freed after more than 880 days in Iran prison amid nuclear tensions\n                 \n                  France preparing to issue 'survival manual' to all households\n                 He is serving a jail sentence, having been found guilty in 2020 of raping and sexually assaulting four young girls. Le Scouarnec kept detailed records in notebooks and diaries of the abuse he inflicted. He was never investigated during his career despite being sentenced in 2005 for owning sexually abusive images of children. He was only apprehended after he retired in 2017 when his six-year-old neighbour told her mother he had sexually abused her while she was playing in the garden of her home, in the town of Jonzac in southwest France. When the police searched Le Scouarnec's house after this, they found 300,000 indecent photos and videos of children, 70 child-sized dolls - some of which were chained up - wigs and hundreds of notebooks and diaries detailing his acts of abuse."
    },
    {
        "title": "Duchess of York offered to help secure PPE early in COVID-19 pandemic, inquiry hears",
        "description": "The Duchess of York and the Dubai royal family offered to help ministers secure PPE in the early months of the COVID-19 crisis, the inquiry into the pandemic has heard. ",
        "url": "https://news.sky.com/story/duchess-of-york-offered-to-help-secure-ppe-early-in-covid-19-pandemic-inquiry-hears-13332749",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-sarah-duchess-of-york_6862512.jpg?20250320193333",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-20 19:04:00",
        "Headline": "The duchess offered to try and help source protective equipment \"from contacts in China\" a month into the first lockdown, a PPE procurement team member told the inquiry.",
        "Content": "The Duchess of York and the Dubai royal family offered to help ministers secure PPE in the early months of the COVID-19 crisis, the inquiry into the pandemic has heard.  Sarah Ferguson, who was formerly married to Prince Andrew, made her offer of assistance as officials tried to get hold of personal protective equipment such as gloves and aprons in spring 2020. An email from April of that year - the month after the first UK lockdown was announced - was presented on Thursday during the evidence of Dawn Matthias, who joined the PPE procurement team at the start of the COVID-19 pandemic .  The message, which was sent among her colleagues, said: \"The Duchess of York has been in contact with [government PPE adviser] Lord Deighton to try and help source PPE. \"She has some contacts who have access to PPE in China and wants to be able to get these through the system.\" A separate email that had been sent by Ms Matthias at the start of April said that \"we received an offer of help from the Royal Family in Dubai\". Ms Matthias said the offer had come to officials via former minister Michael Gove and Conservative peer Lord Agnew. \n                  Police Scotland officers may have been COVID pandemic 'super-spreaders', inquiry hears\n                 \n                  COVID-19 Inquiry will not shy from criticising social media disinformation, Sky News told\n                 \n                  Scottish government to ban WhatsApp on official devices\n                 Shown the email relating to the duchess, she was asked by Jamie Shara, counsel to the inquiry, if there was \"any training or guidance about dealing with people who were senior or high up or connected for example to the royal family?\" \"Not specifically, no,\" she replied.  Asked whether a team member was tasked with handling referrals specifically from high-profile people, Ms Matthias said: \"From memory and from my understanding, royalty was sensitively handled by very senior people.\" She added: \"I don't recall it ever being an issue and don't recall it ever being widely discussed or ever receiving any direction that if I for example was directly approached by the Duchess of York for example I was forbidden to deal with that or not.\"  Details of the unexpected offers came as the inquiry continued to hear evidence in its fifth module, relating to procurement. Read more:Five years since pandemic beganCOVID scars remain in ValleysInquiry 'will tackle misinformation' Thursday's evidence looked at the so-called high-priority lane which was used to try to secure contracts quickly. The inquiry was established to examine the UK's response to and impact of the COVID-19 pandemic and to learn lessons for the future. The first part of the day's evidence was heard in a private session to avoid prejudicing an ongoing investigation into PPE Medpro, a firm linked to Baroness Michelle Mone and her partner Doug Barrowman."
    },
    {
        "title": "Putin will break any peace deal where Ukraine is not 'defended' by 'coalition of the willing', Starmer warns",
        "description": "Vladimir Putin will break any peace agreement with Ukraine that is not \"defended\" by an international coalition of forces, the British prime minister has said.",
        "url": "https://news.sky.com/story/putin-will-break-any-peace-deal-where-ukraine-is-not-defended-by-coalition-of-the-willing-starmer-warns-13332903",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-starmer-pm-defence_6862737.jpg?20250320234743",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2025-03-20 22:47:00",
        "Headline": "The prime minister spoke as he visited a UK base to meet a group of senior military officers from more than 30 nations tasked with turning a political desire to support Kyiv into an actionable plan to help protect the country.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Vladimir Putin will break any peace agreement with Ukraine that is not \"defended\" by an international coalition of forces, the British prime minister has said. Sir Keir Starmer was talking on Thursday as he visited a UK base to meet a group of senior military officers from more than 30 nations tasked with turning a political desire to support Kyiv into an actionable plan to help protect the country from land, sea and air in the event of a ceasefire. But, with Donald Trump pushing hard for Russia and Ukraine to stop fighting now, there are concerns among analysts that the \"coalition of the willing\" - led by the UK and France - will be overtaken by events, with peace declared before it has time to get its act together. In a sign of the challenge, the southern Ukrainian city of Odesa was struck on Thursday night by what its governor described as a \"massive\" Russian drone attack even as the US president talked up the prospects for peace. US negotiators are set to meet separately with Ukrainian and Russian officials in Saudi Arabia on Monday to try to make progress on a ceasefire. Mr Trump also claimed he was on the brink of signing an economic deal with Ukraine - something that has been trailed for weeks as a key step in strengthening US-Ukraine relations and locking in Washington's support for Kyiv's future, but has yet to materialise. Ukraine war latest: Follow live updates \n                  Heathrow Airport closed after 'significant power outage' due to nearby fire\n                 \n                  Stephen Lawrence killer David Norris 'admits role in attack', says Parole Board\n                 \n                  Former first minister Nicola Sturgeon cleared in police investigation into SNP's finances\n                 Clearly alive to the urgency to act, Sir Keir greeted the group of visiting military planners at the UK's Permanent Joint Headquarters at Northwood, on the edge of London. They gathered around a large map of Ukraine spread out across a table. \"Now is the time to be doing this,\" the prime minister told the officers from a range of European and other allied countries, including Turkey, the Netherlands and Canada. Ukrainian officers were also present as well as NATO officials. \"We don't know what the outcome of any [peace] talks is going to be, but we do know that if there is a deal, it's important to have done the preparation beforehand.\" The size and shape of what Western officials have described as a \"reassurance force\" for Ukraine are unclear - so too what kind of military headquarters would command it. Initial briefings on the concept suggested it could involve thousands of troops deployed to cities and to protect critical infrastructure such as nuclear power stations, but kept back from frontline areas, while Royal Air Force warplanes and other countries' jets would protect Ukraine's skies, and various navies, including the Royal Navy, would help secure the sea. Yet, without US support, the European offer, even with backing from other aligned nations such as Canada, would not act as much of a deterrence to Russia. And that is if the coalition is ready to deploy in time for any ceasefire. Read more:Does Trump have any red lines?The 'coalition of the willing' that could secure peace in Ukraine The British prime minister said peace would only endure if \"it is a defended deal\". He offered a sense of what the military planners have been tasked with delivering after the political leaders of all the countries involved agreed to work together to help Ukraine. \"What's happening here is turning that political intention into reality - the concept into plans, whether that's in relation to what might happen at sea or air or defending borders,\" Sir Keir said. \"But it is vitally important we do that work because we know one thing for certain, which is a deal without anything behind it is something that Putin will breach. \"We know that because it's happened before. And I'm absolutely clear in my mind it will happen again.\""
    },
    {
        "title": "Former first minister Nicola Sturgeon cleared in police investigation into SNP's finances",
        "description": "Former first minister Nicola Sturgeon is no longer under investigation by Police Scotland amid a probe into the SNP's funding and finances.",
        "url": "https://news.sky.com/story/ex-snp-chief-peter-murrell-appears-in-court-charged-with-embezzlement-13332544",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nicola-sturgeon-scotland_6854180.jpg?20250320140106",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-03-20 13:04:00",
        "Headline": "Meanwhile, former SNP chief executive Peter Murrell, who is separated from Ms Sturgeon, has appeared in court charged with embezzlement",
        "Content": "\n          Scotland reporter\n              @Jenster13\n  Former first minister Nicola Sturgeon is no longer under investigation by Police Scotland amid a probe into the SNP's funding and finances. Meanwhile, former SNP chief executive Peter Murrell, who is separated from Ms Sturgeon, has appeared in court charged with embezzlement. Speaking outside her home on Thursday, Ms Sturgeon said she was \"completely in the clear\", adding: \"That is the outcome I would always have expected. \"As I have said to all of you many times, I have done nothing wrong. So, I was confident of reaching this point and getting to this outcome, but obviously it is a relief now to have that confirmed.\" Ms Sturgeon said for almost two years she had \"this cloud of investigation\" hanging over her. She added: \"I think it won't surprise anybody to hear me say that it's not been an easy experience, so to reach this point today is obviously something I am relieved about. \"I've been trying to get on with my life and I now intend to do that.\" \n                  Nicola Sturgeon announces she will not seek re-election to Holyrood next year\n                 \n                  Scotland's former first minister Nicola Sturgeon splits from husband\n                 \n                  Nicola Sturgeon knows 'nothing more' about police probe 18 months after arrest\n                 Responding to Sky News' Scotland correspondent Connor Gillies, Ms Sturgeon said she was limited in what she could say about an active police investigation. But she added: \"All I can say is that I have done nothing wrong and I don't think there was ever a scrap of evidence that I had done anything wrong.\" Ms Sturgeon described herself as a \"stronger person today\" than she was when it all \"kicked off\". She added: \"That said, I wish none of it had happened.\" Ms Sturgeon said she had \"exciting things coming up\" including the publication of her book, which is titled Frankly and is set for release on 14 August. Murrell made no plea to the single charge when he appeared at Edinburgh Sheriff Court earlier in the day. The 60-year-old was granted bail with his next court appearance yet to be confirmed. Murrell, who had been SNP chief executive since 1999, resigned in March 2023 amid a row over party numbers. The following month he was arrested under Police Scotland's long-running Operation Branchform and was subsequently charged a year later with embezzling SNP funds. The probe, which has been ongoing since July 2021, is linked to the spending of around £600,000 raised by SNP supporters to be earmarked for Scottish independence campaigning. Ms Sturgeon and ex-party treasurer MSP Colin Beattie were also arrested and released without charge as part of the investigation. Mr Beattie has now been cleared alongside Ms Sturgeon. In a statement posted online, Mr Beattie said he was \"absolutely delighted\" to be cleared of all suspicion. The MSP for Midlothian North and Musselburgh said: \"While there was no question in my mind that I had done nothing wrong, the fact is that it created a question among those who do not know me.\" Mr Beattie thanked all those who offered support to both him and his wife. He added: \"Now, I intend to share a glass of something with my wife tonight, and tomorrow I can focus on the future as I put myself forward for consideration as the SNP candidate for the Midlothian North county constituency.\" A Police Scotland spokesperson said the probe into Ms Sturgeon and Mr Beattie had concluded and both were no longer under investigation following direction from the Crown Office and Procurator Fiscal Service (COPFS). Read more from Sky News:Sturgeon announces she will not seek re-electionLike her or loathe her, Sturgeon is a formidable politician However, COPFS has warned that the case against Murrell is active under the Contempt of Court Act 1981. A spokesperson said: \"Anyone publishing items about active cases is advised to exercise caution as material must not be commentary or analysis of evidence, witnesses or accused. \"Contempt of Court carries penalties of up to two years in prison and/or an unlimited fine.\" COPFS said prosecutors and independent counsel are dealing with Murrell's case without involving Lord Advocate Dorothy Bain KC or Solicitor General Ruth Charteris KC. The spokesperson added: \"All Scotland's prosecutors operate independently of political influence. \"Where allegations are made against people or institutions in which the public have placed trust, it is the responsibility of the authorities to conduct a thorough investigation to determine if there is evidence that criminal conduct has occurred. \"We understand public curiosity about this investigation. However, the Crown does not publicly share details of confidential inquiries where there are no proceedings in court. \"This protects the rights of the individuals concerned who are entitled to a presumption of innocence.\" In January, Ms Sturgeon announced she had split from Murrell. The pair, who first met via the SNP in 1988 and became a couple in 2003, married in 2010. The Glasgow Southside MSP announced the separation in a post on Instagram, revealing they had been \"separated for some time now\" but \"still care deeply for each other, and always will\". And just last week, Ms Sturgeon announced she will not seek re-election to Holyrood next year. She said: \"I have known in my heart for a while that the time is right for me to embrace different opportunities in a new chapter of my life.\""
    },
    {
        "title": "Duchess of York offered to help secure PPE early in COVID-19 pandemic, inquiry hears",
        "description": "The Duchess of York and the Dubai royal family offered to help ministers secure PPE in the early months of the COVID-19 crisis, the inquiry into the pandemic has heard. ",
        "url": "https://news.sky.com/story/duchess-of-york-offered-to-help-secure-ppe-early-in-covid-19-pandemic-inquiry-hears-13332749",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-sarah-duchess-of-york_6862512.jpg?20250320193333",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-20 19:04:00",
        "Headline": "The duchess offered to try and help source protective equipment \"from contacts in China\" a month into the first lockdown, a PPE procurement team member told the inquiry.",
        "Content": "The Duchess of York and the Dubai royal family offered to help ministers secure PPE in the early months of the COVID-19 crisis, the inquiry into the pandemic has heard.  Sarah Ferguson, who was formerly married to Prince Andrew, made her offer of assistance as officials tried to get hold of personal protective equipment such as gloves and aprons in spring 2020. An email from April of that year - the month after the first UK lockdown was announced - was presented on Thursday during the evidence of Dawn Matthias, who joined the PPE procurement team at the start of the COVID-19 pandemic .  The message, which was sent among her colleagues, said: \"The Duchess of York has been in contact with [government PPE adviser] Lord Deighton to try and help source PPE. \"She has some contacts who have access to PPE in China and wants to be able to get these through the system.\" A separate email that had been sent by Ms Matthias at the start of April said that \"we received an offer of help from the Royal Family in Dubai\". Ms Matthias said the offer had come to officials via former minister Michael Gove and Conservative peer Lord Agnew. \n                  Police Scotland officers may have been COVID pandemic 'super-spreaders', inquiry hears\n                 \n                  COVID-19 Inquiry will not shy from criticising social media disinformation, Sky News told\n                 \n                  Scottish government to ban WhatsApp on official devices\n                 Shown the email relating to the duchess, she was asked by Jamie Shara, counsel to the inquiry, if there was \"any training or guidance about dealing with people who were senior or high up or connected for example to the royal family?\" \"Not specifically, no,\" she replied.  Asked whether a team member was tasked with handling referrals specifically from high-profile people, Ms Matthias said: \"From memory and from my understanding, royalty was sensitively handled by very senior people.\" She added: \"I don't recall it ever being an issue and don't recall it ever being widely discussed or ever receiving any direction that if I for example was directly approached by the Duchess of York for example I was forbidden to deal with that or not.\"  Details of the unexpected offers came as the inquiry continued to hear evidence in its fifth module, relating to procurement. Read more:Five years since pandemic beganCOVID scars remain in ValleysInquiry 'will tackle misinformation' Thursday's evidence looked at the so-called high-priority lane which was used to try to secure contracts quickly. The inquiry was established to examine the UK's response to and impact of the COVID-19 pandemic and to learn lessons for the future. The first part of the day's evidence was heard in a private session to avoid prejudicing an ongoing investigation into PPE Medpro, a firm linked to Baroness Michelle Mone and her partner Doug Barrowman."
    },
    {
        "title": "Olympic gold medallist Tom Ford becomes fourth Cambridge rower to be barred from this year's Boat Race",
        "description": "Olympic gold medallist Tom Ford has become the fourth rower to be barred from competing for Cambridge at this year's Boat Race - as a row over eligibility criteria threatens to overshadow the historic event.",
        "url": "https://news.sky.com/story/olympic-gold-medallist-tom-ford-becomes-fourth-cambridge-rower-to-be-barred-from-this-years-boat-race-13332769",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tom-ford_6862604.jpg?20250320212912",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-20 20:17:00",
        "Headline": "Ford has fallen foul of a rule introduced after James Cracknell became the oldest person to win the race in 2019 - while three other rowers are ineligible because they are not studying for degrees. ",
        "Content": "Olympic gold medallist Tom Ford has become the fourth rower to be barred from competing for Cambridge at this year's Boat Race - as a row over eligibility criteria threatens to overshadow the historic event. Ford recently started an MBA at the University of Cambridge but enrolled for his undergraduate degree at Newcastle University in 2011. This means he fell foul of a rule introduced after double Olympic gold medallist James Cracknell came out of retirement to compete in the race between Oxford and Cambridge in 2019. Cracknell became the oldest competitor and oldest winner of the famous boat race when he competed with Cambridge six years ago. However, afterwards, the rowing clubs from both universities agreed on a new rule meaning athletes cannot not take part if they started an undergraduate course more than 12 years earlier. Ford, who won gold for Team GB in the men's eight at the 2024 Paris Olympics, will not take part this year despite having competed in a number of test races with the crew. It comes after three Cambridge university team members were barred from competing in the iconic race because they are not studying for degrees. \n                  Heathrow Airport closed after 'significant power outage' due to nearby fire\n                 \n                  Stephen Lawrence killer David Norris 'admits role in attack', says Parole Board\n                 \n                  Putin will break any peace deal where Ukraine is not 'defended' by 'coalition of the willing', Starmer warns\n                 Matt Heywood, a former under-23 world champion, Molly Foxell and Kate Cowley have all been disqualified from competing in the men's and women's races on the River Thames on 13 April. After an Oxford objection, an independent interpretation panel ruled that the three Cambridge rowers were PGCE students and not studying for degrees and were therefore ruled out. A post-graduate certificate of education (PGCE) is classified as an advanced but non-degree vocational qualification for those moving into the teaching industry. Olympic gold medallist Imogen Grant, who rows for Cambridge, told the BBC: \"PGCE students were racing before - it's written down. \"It's the interpretation which has changed. The fact that it is so close to the Boat Race is very unfair.\" Cambridge have dominated the event in recent years, winning seven consecutive women's titles and five of the past six men's. Read more from Sky News:Thursday was hottest day of the year so farPrince William visits EstoniaUnreleased Eminem music stolen and sold The Boat Race Company, which runs the contest on behalf of the clubs, said it sympathised with any athlete disappointed with the crew selection for the contest. \"This is an extremely competitive process and there are strict (publicly available) eligibility criteria for being considered for a place in a crew,\" a statement said. \"Those criteria are jointly agreed by the two competing clubs, with no involvement from any third party. Similarly, both clubs agree to the existence and ultimate authority of an independent interpretation panel to provide rulings on any disputes, or to clarify rules where necessary.\" In relation to Mr Ford not being able to take part in the race, The Boat Race Company said: \"As an Olympic gold medallist, Tom brings significant experience and learnings to the Cambridge squad. \"It is unfortunate that he is not eligible to race according to the rules jointly agreed by the two clubs, but this was known to both Tom and CUBC at the time of his admission to the university last summer.\""
    },
    {
        "title": "UK growth forecast set for major downgrade as chancellor faces difficult spring statement",
        "description": "The chancellor's update on the economy next week is not going to be an emergency budget in its truest sense. But it will be a moment when the sirens flash red.",
        "url": "https://news.sky.com/story/spring-statement-a-red-siren-moment-for-reeves-with-big-spending-squeeze-ahead-13332768",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rachel-reeves-beth-rigby_6862424.jpg?20250320174237",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-03-20 20:12:00",
        "Headline": "Rachel Reeves is likely to promise the government will go \"further and faster\" to boost economic growth when she delivers her spring statement on Wednesday - but spending cuts loom large.",
        "Content": "\n          Political editor\n              @BethRigby\n The chancellor's update on the economy next week is not going to be an emergency budget in its truest sense. But it will be a moment when the sirens flash red. It's not an emergency budget because the chancellor, as our listeners will know from our interview with Rachel Reeves on Electoral Dysfunction a couple of weeks ago, is not going to make tax changes (such a move would tip it into budget territory because it would turn the spring statement into a major fiscal event). But it looks set to be a red siren moment for a chancellor. Having staked her reputation on growing the economy and no return to austerity, she is going to have to announce a downgrade to growth forecasts and could also unveil the biggest spending squeeze on Whitehall in years. The welfare cuts this week were just the starter - the opposition are going to have a field day. Watch out in the next few days for a \"re-education\" as the Treasury tries to frame the arguments Reeves will get in at the despatch box on Wednesday. You'll hear about how the \"world has changed\", with global uncertainly knocking growth and forcing countries to invest more in defence. This is all part of the chancellor seeking to distance sluggish growth from her own budget decisions last October (the Conservatives will shout back jobs tax - their rebranding of the Reeves' £25bn hike in employers' national insurance contributions). \n                  What could be announced in Rachel Reeves' spring statement?\n                 \n                  Welfare system will be here 'for years to come' amid backlash over impending cuts\n                 \n                  When is the spring statement - and what do you need to know about it?\n                 You will also be hearing more about the need to go \"further and faster\" on the economy (the bonfire of quangos, planning rules, regulations and drive for 'efficiency savings'). But whatever arguments she makes ahead of time won't dent the sharp inhalation of breath as growth is downgraded and the chancellor outlines what's likely to be billions in cuts to the departmental budgets in an effort to plug the black hole in the public finances that has emerged from slower growth and rising debt repayments.  Economists expect the deteriorating outlook to eat up the £9.9bn of headroom she had in order to meet her own fiscal rules in the October budget. The Resolution Foundation think-tank estimates that the current account balance has shifted from that £9.9bn surplus to a deficit of around £4.4bn. Many Labour MPs think Reeves should just loosen her fiscal rules (she has legislated that day-to-day spending must be funded from tax receipts, not debt, by 2029/30), but she told me on our Electoral Dysfunction podcast that is something she will not do. Neither, I hear, is she prepared to just let the public finances sit in the red. But getting back to black is going to involve a massive spending squeeze. So watch for reductions in Whitehall departmental budgets later in the parliament. The government has already earmarked £5bn in savings from the benefits bill by 2029/30 and could whittle back projected rises in departmental spending towards the back end of parliament. Read more:What is PIP?Key welfare changes explained Departmental spending is set to rise by an average of 1.3% from 2026-27 onwards. If the chancellor reduces that, she could save billions. But the headlines will scream cuts, especially for those departments which don't have protected budgets and which could face real terms reductions. It's going to be difficult and the government is braced for cries of austerity 2.0, which is frustrating officials who are quick to point out that the government has poured billions more into public spending after executing the biggest tax and spend budget in a generation.  \"This is not a return to austerity, which was about real terms cuts,\" said one figure. \"We will be finding savings and squeezing spending but the overall level of spending will still be going up.\" But it is tense. As she looks for savings, the chancellor has asked cabinet ministers to identify 5% efficiency savings from their departments and also identify 20% of the lowest priority spending. In private, ministers are protesting about cuts. Read more:What could be announced in Rachel Reeves' spring statement?What is the spring statement - and what do you need to know? Labour peer Harriet Harman told the Electoral Dysfunction podcast that identifying such big levels of savings is going to cause consternation. \"As somebody who was told to do 2% and felt even that was incredibly difficult, then I should imagine that it is causing consternation. \"It is a very, very difficult exercise. But, you know, at the end of the day, we're in difficult circumstances. \"We've made a promise to the electorate about how are we going to run the economy, and that's what we're going to do. \"And Labour MPs, I think, you know, are very resolved on this. They know the situation's difficult. They know the government has got a set of principles that they're applying to it, and they'll be supportive of the government on this. \"So one thing we have got is political stability on this. There won't be any, you know, screeching handbrake U-turns. There won't be massive revolts and there won't be cabinet splits either.\" The government hopes protest will be dialled down as it dials up talk about 'reform' and how the government can rewire Whitehall in a way that money is trained on the frontline and services can be maintained even as budgets are whittled back. The biggest symbol of that so far being the prime minister's announcement last week that he was abolishing NHS England and folding the oversight of the NHS back into the Health department - which the government says could save up to £500m a year. But even if Harriet Harman is right on the would-be rebels and ministers have their arguments honed, a major downgrade of growth forecasts and a spending squeeze from a government that told voters it would be doing the exact opposite in the run-up to the election is set to be a very difficult day indeed. 👉 Click here to follow Electoral Dysfunction wherever you get your podcasts 👈"
    },
    {
        "title": "Boy accused of killing elderly man while girl filmed attack 'can't keep track' of murder trial lies, court hears",
        "description": "A 15-year-old boy accused of killing an elderly man has told so many lies he has \"difficulty keeping track\", a murder trial has heard.",
        "url": "https://news.sky.com/story/boy-accused-of-killing-elderly-man-while-girl-filmed-attack-cant-keep-track-of-murder-trial-lies-court-hears-13332698",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bhim-kohli-leicester_6842418.jpg?20250228162305",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-20 17:33:00",
        "Headline": "The 15-year-old is accused of racially abusing, kicking, punching and hitting 80-year-old Bhim Kohli with a slider, while a 12-year-old girl filmed the attack and laughed. Mr Kohli died from his injuries the following day.",
        "Content": "A 15-year-old boy accused of killing an elderly man has told so many lies he has \"difficulty keeping track\", a murder trial has heard. The child allegedly racially abused 80-year-old Bhim Kohli, as well as kicking and punching him as he was on the ground, while a girl, then aged 12, filmed the attack and laughed. Mr Kohli suffered a spinal injury and fractured ribs in the alleged assault in Franklin Park, Braunstone Town, near Leicester last September, and died in hospital from his injuries the following day. The youth denies Mr Kohli's murder and an alternative charge of manslaughter at Leicester Crown Court, while the girl, now 13, denies manslaughter. Neither defendant can be named because of their ages. Jurors were told the teenager lied to police and had to \"change his story\" because he did not know the girl had filmed parts of the alleged attack. He had previously said he and Mr Kohli had been in a \"tussle\" after his slider fell off and the elderly man had tried to grab it, causing him to fall to his knees before he slapped him out of \"instinct\". Prosecutor Harpreet Sandhu KC told him the story about the tussle was \"not true\" because in a video clip of the slapping assault found on the girl's Snapchat account, the boy was not wearing any sliders. \n                  Leicester City owner's death in helicopter crash was accidental, inquest finds\n                 \n                  Helicopter spun out of control before crash killed Leicester City owner, inquest told\n                 \n                  Family of Leicester City chairman killed in football stadium helicopter crash sue manufacturer for £2bn\n                 Mr Sandhu reminded him he had claimed he and Mr Kohli \"went for it [the fallen slider] at the same time\", and both ended up \"pulling\" on it during which Mr Kohli \"somehow\" ended up on the ground. But he told the defendant his story about one slider coming off \"is not true\" as in the video of the attack, \"we can't see you wearing any sliders\". The boy, who looked towards the public gallery where his mother was sitting several times while he gave evidence on Thursday, denied the allegations. Mr Sandhu said \"there was no tussle for the slider, was there?\", but the boy insisted there was. Read more from Sky News:Trump just wants deal - who will blink?Ex-Scottish leader clearedFormer F1 team owner dies The court heard the boy had lied in a statement to prosecutors a month earlier when he said Mr Kohli hit him with the slider. Mr Sandhu told him he was \"making things up\" and was struggling to \"remember the lies you have told ... you are having difficulty keeping track of your lies. \"You have given us two different versions of what Mr Kohli did with the slider. Have you given us two different versions because you can't remember the lies you have been telling?\" The boy said: \"No.\" The trial continues."
    },
    {
        "title": "Nine Just Stop Oil protesters convicted after planning to glue themselves to Heathrow runway",
        "description": "Nine Just Stop Oil protesters have been convicted after police intervened to prevent them from gluing themselves to the runways at Heathrow Airport.",
        "url": "https://news.sky.com/story/nine-just-stop-oil-protesters-convicted-after-planning-to-glue-themselves-to-heathrow-runway-13332660",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-adam-beard-rosa-hicks_6862393.jpg?20250320164130",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-20 16:07:00",
        "Headline": "Police have said the action could have disrupted the flights of 260,000 passengers if it had been successful. ",
        "Content": " Nine Just Stop Oil protesters have been convicted after police intervened to prevent them from gluing themselves to the runways at Heathrow Airport. Seven of the demonstrators, aged between 26 and 61, were arrested after they were found with glue and angle grinders close to the perimeter fence of the airport on 24 July 2024. Police have said the items in their possession showed they planned to cut through the fence and attach themselves to the surface of the airfield. Those arrested also had high-visibility vests with Just Stop Oil branding and prepared statements confirming their intention to go onto the taxiway - a part of the airfield where planes are moved from the hangar to the runway. Police have said the protesters would have had to cross one of the airport's runways to do so, \"endangering the lives of themselves, airport staff and those on flights taking off and landing\". There also would have been significant disruption to flights, as the protest would have stopped all departures and affected nearly 260,000 passengers, the seven-week trial at Isleworth Crown Court heard. Some of the passengers would need to have been diverted to other airports nationally and internationally, potentially leaving them stranded for days, the court heard. \n                  Heathrow Airport closed after 'significant power outage' due to nearby fire\n                 \n                  Stephen Lawrence killer David Norris 'admits role in attack', says Parole Board\n                 \n                  Putin will break any peace deal where Ukraine is not 'defended' by 'coalition of the willing', Starmer warns\n                 The seven protesters are Sally Davison, 37, Adam Beard, 55, Luke Elson, 32, Luke Watson, 35, Sean O'Callaghan, 30, Hannah Schafer, 61, and Rory Wilson, 26. Two key organisers - Rosa Hicks, 29, and William Goldring, 27 - were not with the group at the airport but were arrested the same day. Eight of the protesters were found guilty of conspiracy to cause a public nuisance at Heathrow Airport today. Wilson had earlier pleaded guilty to the same offence. Julia Mercer, 74, was acquitted of the charge. Read more from Sky News:Just Stop Oil protesters disrupt Hollywood icon's playCharles Darwin's grave targeted by Just Stop OilTwo found guilty of throwing soup over Van Gogh's sunflowers The nine who were convicted will all be sentenced at Isleworth Crown Court on Friday 16 May. Chief Superintendent Ian Howells, from the Met's Aviation Policing Command, said: \"The reckless actions of this particular group would have not only put their own lives and the lives of others in danger, but caused havoc at Heathrow airport, bringing flights to a standstill. \"There is a clear distinction between peaceful protest and the criminal activity that this group sought to carry out. \"This kind of action will not be tolerated and the Met will continue to work with all our partners to protect the public, prevent disruption to Londoners and those visiting our city and bring offenders to justice.\" Just Stop Oil is an environmental campaign group which is calling for the British government to halt new fossil fuel projects in the UK. The group's actions have grabbed headlines - with campaigners having glued themselves to roads and attached themselves to infrastructure at oil facilities. They have also disrupted sport events and vandalised famous artworks. Hundreds of the protesters have been arrested and some have been handed lengthy jail terms."
    },
    {
        "title": "Putin will break any peace deal where Ukraine is not 'defended' by 'coalition of the willing', Starmer warns",
        "description": "Vladimir Putin will break any peace agreement with Ukraine that is not \"defended\" by an international coalition of forces, the British prime minister has said.",
        "url": "https://news.sky.com/story/putin-will-break-any-peace-deal-where-ukraine-is-not-defended-by-coalition-of-the-willing-starmer-warns-13332903",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-starmer-pm-defence_6862737.jpg?20250320234743",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2025-03-20 22:47:00",
        "Headline": "The prime minister spoke as he visited a UK base to meet a group of senior military officers from more than 30 nations tasked with turning a political desire to support Kyiv into an actionable plan to help protect the country.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Vladimir Putin will break any peace agreement with Ukraine that is not \"defended\" by an international coalition of forces, the British prime minister has said. Sir Keir Starmer was talking on Thursday as he visited a UK base to meet a group of senior military officers from more than 30 nations tasked with turning a political desire to support Kyiv into an actionable plan to help protect the country from land, sea and air in the event of a ceasefire. But, with Donald Trump pushing hard for Russia and Ukraine to stop fighting now, there are concerns among analysts that the \"coalition of the willing\" - led by the UK and France - will be overtaken by events, with peace declared before it has time to get its act together. In a sign of the challenge, the southern Ukrainian city of Odesa was struck on Thursday night by what its governor described as a \"massive\" Russian drone attack even as the US president talked up the prospects for peace. US negotiators are set to meet separately with Ukrainian and Russian officials in Saudi Arabia on Monday to try to make progress on a ceasefire. Mr Trump also claimed he was on the brink of signing an economic deal with Ukraine - something that has been trailed for weeks as a key step in strengthening US-Ukraine relations and locking in Washington's support for Kyiv's future, but has yet to materialise. Ukraine war latest: Follow live updates \n                  Heathrow Airport closed after 'significant power outage' due to nearby fire\n                 \n                  Stephen Lawrence killer David Norris 'admits role in attack', says Parole Board\n                 \n                  Former first minister Nicola Sturgeon cleared in police investigation into SNP's finances\n                 Clearly alive to the urgency to act, Sir Keir greeted the group of visiting military planners at the UK's Permanent Joint Headquarters at Northwood, on the edge of London. They gathered around a large map of Ukraine spread out across a table. \"Now is the time to be doing this,\" the prime minister told the officers from a range of European and other allied countries, including Turkey, the Netherlands and Canada. Ukrainian officers were also present as well as NATO officials. \"We don't know what the outcome of any [peace] talks is going to be, but we do know that if there is a deal, it's important to have done the preparation beforehand.\" The size and shape of what Western officials have described as a \"reassurance force\" for Ukraine are unclear - so too what kind of military headquarters would command it. Initial briefings on the concept suggested it could involve thousands of troops deployed to cities and to protect critical infrastructure such as nuclear power stations, but kept back from frontline areas, while Royal Air Force warplanes and other countries' jets would protect Ukraine's skies, and various navies, including the Royal Navy, would help secure the sea. Yet, without US support, the European offer, even with backing from other aligned nations such as Canada, would not act as much of a deterrence to Russia. And that is if the coalition is ready to deploy in time for any ceasefire. Read more:Does Trump have any red lines?The 'coalition of the willing' that could secure peace in Ukraine The British prime minister said peace would only endure if \"it is a defended deal\". He offered a sense of what the military planners have been tasked with delivering after the political leaders of all the countries involved agreed to work together to help Ukraine. \"What's happening here is turning that political intention into reality - the concept into plans, whether that's in relation to what might happen at sea or air or defending borders,\" Sir Keir said. \"But it is vitally important we do that work because we know one thing for certain, which is a deal without anything behind it is something that Putin will breach. \"We know that because it's happened before. And I'm absolutely clear in my mind it will happen again.\""
    },
    {
        "title": "UN says teachers, doctors, nurses were among staff killed in Israeli strikes – which killed 91 people in Gaza",
        "description": "Israeli strikes killed at least 91 Palestinians across the Gaza Strip overnight and into Thursday, according to the Hamas-run health ministry.",
        "url": "https://news.sky.com/story/at-least-85-palestinians-killed-in-gaza-strikes-local-health-authorities-say-13332425",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-israeli-strikes-palestinians_6861838.jpg?20250320083249",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-20 09:57:00",
        "Headline": "After a two-month-long ceasefire, fighting began again in Gaza after Israel launched a series of airstrikes on the enclave earlier this week. Over 400 people were killed before it restarted ground operations as well.",
        "Content": " Israeli strikes killed at least 91 Palestinians across the Gaza Strip overnight and into Thursday, according to the Hamas-run health ministry. Five UN staff members have also been killed, according to the head of the UNRWA. It comes as Israeli attacks in Gaza have resumed this week - bringing an end to the ceasefire that had paused fighting in the 17-month war. Philippe Lazzarini, head of UNRWA, the United Nations Palestinian relief agency, said on Thursday: \"In the past few days, another five UNRWA staff have been confirmed killed, bringing the death toll to 284. \"They were teachers, doctors and nurses: serving the most vulnerable.\" He added he feared \"the worst is yet to come\". \"Under our daily watch, people in Gaza are again and again going through their worst nightmare,\" he said in a statement. \"An endless unleashing of the most inhumane ordeals.\" Tzipi Hotovely, Israel's ambassador to the UK, has told Sky News the ceasefire was first broken by Hamas because they \"stopped releasing our hostages\". Her comments came despite Hamas having released all the hostages that were agreed under phase one of the ceasefire - with phase two having not begun yet. However, Ms Hotovely said Israel had agreed to extend phase one of the ceasefire on one condition - that Hamas keeps releasing hostages. Speaking to Sky News presenter Sophy Ridge, the ambassador continued: \"We waited three weeks with no hostages being released. \"Do you expect Israel to sit and do nothing when 59 people from our people are dying there in the tunnels? \"Do you expect Israel to do nothing?\" Ms Hotovely added that Hamas can stop the war immediately by releasing all of the 59 remaining hostages.  Her comments came after the Israeli military said on Thursday evening that it had begun a ground operation in Shaboura in Rafah \"over the past few hours\". It added that Israeli troops had \"dismantled a number of terrorist infrastructure\" during the operation in southern Gaza. The Israeli military also said ground operations were continuing in northern and central Gaza - adding that troops had destroyed a hospital which Israel claims Hamas used as a command centre. Speaking in Parliament earlier, Foreign Secretary David Lammy said the UK government opposed the resumption of Israel's hostilities and added that a British national was among the wounded when a UN compound was struck on Wednesday. Israel has previously said it only targets militants and blames civilian deaths on Hamas because it operates in densely populated areas. It denied previous reports it had targeted a UN compound.  Israel resumes strikes On Tuesday, Israel resumed heavy airstrikes on the enclave killing more than 400 people, bringing to a halt the ceasefire that had paused fighting in the 17-month war. A day later, the Israeli Defense Forces (IDF) relaunched ground operations, seizing part of a key corridor that divides the north and south of Gaza - the Netzarim corridor. Meanwhile, Hamas fired three rockets at Israel without causing casualties. It was the first such attack since the resumption of the IDF's strikes. Hospitals across Gaza said the strikes hit houses in Khan Younis and Rafah in southern Gaza and the northern town of Beit Lahiya. The Israeli military said it was looking into the reports. The European Hospital in Rafah said 26 people, mostly women and children, had been killed in strikes on two family homes overnight. A father and his seven children were killed in one of the attacks, it added. The Nasser Hospital in Khan Younis received the bodies of seven people killed overnight in an attack on a home, it said. Meanwhile, Hamas said talks with mediators were ongoing. Fragile ceasefire  Hamas and Israel disagreed over how to proceed with the ceasefire after phase one came to an end. The militant group wanted to move onto phase two to negotiate Israel's permanent withdrawal from Gaza, the release of hostages in exchange for more prisoners and an eventual end to the war. Read more:What happened to the Israel-Hamas ceasefire?Siblings among those killed in one of Gaza's deadliest days Israel wanted to temporarily extend phase one and for more hostages to be released. It cut off all supplies to Gaza to try and pressure the group into doing so before restarting its military campaign. The war started after Hamas militants attacked Israeli communities in October 2023, killing 1,200 people and taking more than 250 hostages. More than 49,000 Palestinians have been killed in the ensuing conflict, according to Gaza's health authorities,"
    },
    {
        "title": "Conor McGregor says he wants to be Ireland's next president",
        "description": "Former mixed martial arts fighter Conor McGregor has said he wants to be the next president of Ireland and said he would put the EU Migration Pact to a referendum if elected.",
        "url": "https://news.sky.com/story/conor-mcgregor-says-he-wants-to-be-irelands-next-president-13332918",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-conor-mcgregor-white-house_6860642.jpg?20250318162358",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-20 23:44:00",
        "Headline": "McGregor said on social media that he is \"greatly\" opposed to the EU Migration Pact and promised everyone in Ireland would \"have a voice and a choice on their future\".",
        "Content": "Former mixed martial arts fighter Conor McGregor has said he wants to be the next president of Ireland and said he would put the EU Migration Pact to a referendum if elected. McGregor, who met US President Donald Trump in the Oval Office on Monday on St Patrick's Day, said on social media that he is \"greatly\" opposed to the measure but \"it is neither mine nor governments [sic] choice to make. \"It is the people of Ireland's [sic] choice!\"  In the post on his Instagram account on Thursday night, he said he would like to know why the country's government agreed with the pact \"so fervently\". He said everyone in Ireland would \"have a voice and a choice on their future!\" He urged them to vote McGregor, \"and have your voice heard!\" In a picture accompanying his post, McGregor stood in front of an aircraft holding a young child and wearing a green baseball cap with the slogan \"Make Ireland Great Again\". McGregor, 36, used his White House visit to criticise immigration, saying Ireland \"was at the cusp of potentially losing its Irishness\" due to the \"illegal immigration racket\". \n                  Why Conor McGregor has 'close to zero chance' of becoming Ireland's next president\n                 \n                  'He doesn't speak for Ireland': Irish leaders critical of McGregor-Trump meeting\n                 \n                  Conor McGregor: Tesco among shops ditching alcohol linked to MMA star after rape case\n                 The visit and comments made by McGregor in Washington drew sharp criticism from Irish Prime Minister Micheal Martin who said the remarks were \"wrong, and do not reflect the spirit of St Patrick's Day, or the views of the people of Ireland\". Read more: McGregor's chances of becoming president Deputy prime minister Simon Harris said McGregor \"has no mandate to\" speak for the people of Ireland. The Pact on Migration and Asylum is \"a set of new rules managing migration and establishing a common asylum system at EU level,\" the EU Commission says on its website. Last year, Nikita Hand, who accused McGregor of raping her, won her civil case and was awarded more than £200,000 in damages. A jury at Dublin's High Court found McGregor assaulted her in a Dublin hotel in 2018. McGregor is appealing against the outcome of the civil case. McGregor also pleaded guilty to assaulting a man in a Dublin pub in 2019. McGregor, nicknamed the Notorious, rose to worldwide prominence for winning several UFC championships."
    },
    {
        "title": "New Olympic president elected as Britain's Lord Seb Coe discovers fate",
        "description": "A new president of the International Olympic Committee (IOC) has been elected.",
        "url": "https://news.sky.com/story/new-olympic-president-elected-as-britains-lord-seb-coe-discovers-fate-13332472",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-kirsty-coventry-ioc_6862309.jpg?20250320153241",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-20 11:06:00",
        "Headline": "Kirsty Coventry, the two-time gold medallist and Zimbabwe sports minister, claimed 49 votes to become the next boss of the International Olympic Committee. Her first games in charge will be the 2026 Winter Olympics in Milan and Cortina, and the LA Summer Olympics in 2028.",
        "Content": " A new president of the International Olympic Committee (IOC) has been elected. Kirsty Coventry, the two-time Olympic gold medallist and Zimbabwe sports minister, has become the first woman and first African to be elected to the position, which is considered the most powerful job in world sport. Britain's Lord Sebastian Coe lost out in the election he entered as an outsider. The peer went up against rivals more favoured by the IOC establishment and stood apart from the field with some of his policies - including a blanket ban on transgender women competing in women's sports. Ms Coventry swept aside the competition, getting far more votes than anyone else. She won in the first round with the required 49 votes, while Juan Antonio Samaranch, in second place, got 28 votes, with Lord Coe picking up eight. Speaking after her election victory, Ms Coventry said: \"As a nine-year-old girl I never thought I would be standing up here one day, getting to give back to this incredible movement of ours. \n                  Kirsty Coventry: After historic win, new IOC president must deal with Trump, Putin and transgender issue\n                 \n                  The Olympics' own Conclave begins - as hotly contested race for IOC president reaches climax\n                 \n                  Jordan's Prince Feisal Al Hussein seeks to become the IOC's first leader from Middle East\n                 \"This is not just a huge honour, but it is a reminder of my commitment to every single one of you, that I will lead this organisation with so much pride, with the values at the core, and I will make all of you very very proud. \"Thank you from the bottom of my heart and now we've got some work together.\" Mr Samaranch congratulated her on her way to the podium to make her speech. Kirsty Coventry was born in Harare, Zimbabwe, and made her Olympic debut in 2000, a day after she turned 17. She won gold in the 200m backstroke at the 2004 and 2008 Olympics - taking home seven medals across those games. Ms Coventry joined the IOC in 2013, almost one year after a disputed athlete election at the London Olympics. Her place among the four athletes elected was eventually awarded after a Court of Arbitration for Sport ruling against two opponents. In 2016, she retired from competing after her fifth Olympic games in Rio de Janeiro, Brazil. Ahead of her victory, speaking on Wednesday, Ms Coventry said: \"Let's create some change, let's make sure that happens.\" All of the previous nine presidents were men from Europe or the US. The 41-year-old minister for sport in the Zimbabwean government has long been seen as the preferred successor to the outgoing IOC president Thomas Bach and had his support. Her manifesto offered almost complete continuity with his policies. The election almost entirely took place in the shadows in a Conclave-style process that gives the winner an eight-year mandate - with the option to run for four more. The vote was conducted in the luxury resort of Costa Navarino, in Greece, and confirmed the IOC's 10th leader in its 131-year history. Voters in the exclusive club of IOC members include royal family members, former politicians and diplomats, business leaders, sports officials and Olympic athletes - even an Oscar-winning actress, Michelle Yeoh. Members voted without hearing further presentations from the candidates in an election that swung on a discreet network of friendships and alliances largely forged out of sight. Ms Coventry's first games in charge will be the Winter Olympics in Milan and Cortina in 2026, followed by the Summer Olympics in Los Angeles in 2028. Among the issues she will have to deal with include navigating a smooth path between politics and sport in the 2028 US games opposite Donald Trump, and picking a host for the 2036 summer competition.  Read more from Sky News:Today is hottest day of the year so farPrince William visits EstoniaUnreleased Eminem music stolen and sold Previous IOC president Thomas Bach formally leaves office on Olympic Day, 23 June, having served a maximum of 12 years in office. He will pass on a financially secure IOC, on track to earn more than $8bn (£6.2bn) at the LA 2028 games. One of his signature policies has been gender parity with equal quotas of male and female athletes at the 2024 Paris Olympics and giving an improved balance of female members in the IOC and on the executive board he chairs. Also competing in the election were the heads of three other sports governing bodies: skiing's Johan Eliasch (two votes), cycling's David Lappartient (four), and gymnastics' Morinari Watanabe (four), along with Prince Feisal al Hussein of Jordan (two)."
    },
    {
        "title": "Kirsty Coventry: After historic win, new IOC president must deal with Trump, Putin and transgender issue",
        "description": "It was a win as resounding as it was historic - Kirsty Coventry becoming the first African and the first woman to assume the most powerful and prestigious role in sport.",
        "url": "https://news.sky.com/story/kirsty-coventry-after-her-historic-win-the-new-ioc-president-must-deal-with-trump-putin-and-transgender-issue-13332791",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-olympics-greece-kirsty-coventry_6862570.jpg?20250320205005",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-03-20 20:43:00",
        "Headline": "The double Olympic champion swimmer has worked on the IOC Athletes' Commission and in Zimbabwe's government as sports minister and says she has lots of experience of dealing with \"difficult men in high positions\".",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  It was a win as resounding as it was historic - Kirsty Coventry becoming the first African and the first woman to assume the most powerful and prestigious role in sport. The double Olympic champion will now lead the Olympic movement in a turbulent world. There aren't just sporting but political challenges confronting the IOC. How to handle Vladimir Putin and whether Russia's Olympic ban remains in place over the war on Ukraine? And how to deal with Donald Trump's volatility, unpredictability, and meddling as Los Angeles prepares to host the 2028 Olympics? But Mrs Coventry has been preparing for this moment since retiring from the pool - with all the experience gained on the IOC Athletes' Commission and in Zimbabwe's government as sports minister. \"I have been dealing with, let's say, difficult men in high positions since I was 20 years old,\" she said, adding her \"firm belief is that President Trump is a huge lover of sports\". \n                  Athens protest: Greek anger at lack of change boils over, two years after country's worst rail disaster\n                 \n                  Protesters hurl petrol bombs and police fire tear gas as demonstration in Greece turns violent\n                 \n                  Greece declares state of emergency on Santorini after earthquakes\n                 But, I asked, will she comply with Mr Trump's order to ban transgender women from women's events at the Olympics? \"It's going to take communication,\" she replied. \"We're going to create a task force that's going to look at the transgender issue and the protection of the female category. \"And once we've made the decision collectively as the IOC with the international federations that decision will be made very clear and we won't move from that decision.\" Not the strident approach advanced by Sebastian Coe - the only one of the seven IOC candidates to agree with Trump's trans stance. While Mrs Coventry secured 49 of the 97 votes - for an unexpected first-round win - Lord Coe picked up just eight backers. We are never told who the IOC membership - from sport, business, and royalty - picked. But a humiliating third place showed perhaps that Lord Coe was too disruptive as a change candidate and, particularly, too divisive with his push for prize money for medallists. \"It's a disappointing result, but that's what happens when you go into elections,\" the World Athletics president said. \"I think it's pretty clear that the athletes and, in particular the female members, voted for her in very big numbers in the first round.\" This seemed a win for the continuity candidate - closely aligned with Thomas Bach during his 12 years leading the IOC. When I asked the German about Lord Coe's criticism of the closed and secretive election process, he replied: \"Don't blame the voters, don't blame the procedure.\" There won't be another vote for eight years. And Mrs Coventry could then seek another four-year term. At 41, she is the second youngest IOC election winner at a time when the Olympics is trying to maintain appeal to younger audiences. And the focus will soon shift to 2036 and where those Summer Olympics will be staged. Read more from Sky News:Thursday was hottest day of the year so farPrince William visits EstoniaUnreleased Eminem music stolen and sold There is interest from Saudi Arabia, Qatar, India and Turkey. But unlike Thursday's presidential poll, there has been a shift to designations of host cities, conferring prestige rather than contests. It gives even more power to the IOC's leader as Mrs Coventry officially begins her reign on Olympic Day in June."
    },
    {
        "title": "Surgeon dubbed France's 'most prolific child abuser' pleads guilty to abusing 299 patients",
        "description": "A 74-year-old surgeon who is believed to be France's most prolific child abuser has pleaded guilty to sexually abusing 299 of his patients.&#160;",
        "url": "https://news.sky.com/story/surgeon-dubbed-frances-most-prolific-child-abuser-pleads-guilty-to-abusing-299-patients-13332812",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-france-surgeon_6832657.png?20250218152128",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-20 21:13:00",
        "Headline": "Joel Le Scouarnec, 74, has been on trial charged with assaulting or raping the patients, many while under anaesthesia or waking up from operations, over a 25-year period. The average age of his alleged victims was just 11.",
        "Content": "A 74-year-old surgeon who is believed to be France's most prolific child abuser has pleaded guilty to sexually abusing 299 of his patients.  Joel Le Scouarnec has been on trial charged with assaulting or raping the patients, many while under anaesthesia or waking up from operations, between 1989 and 2014. In total, he's accused of 300 separate offences - 111 rapes and 189 sexual assaults - which took place in more than a dozen hospitals. The average age of his alleged victims was just 11 years old, with an almost equal number of boys and girls. Read more: How did Le Scouarnec carry out abuse unchecked for decades? He has been on trial since early March in one of France's largest child sex abuse cases. Until now, he has admitted his guilt on a case-by-case basis during the legal proceedings. \n                  Scientist 'denied entry to US' after messages critical of Trump found on his phone\n                 \n                  French citizen Olivier Grondeau freed after more than 880 days in Iran prison amid nuclear tensions\n                 \n                  France preparing to issue 'survival manual' to all households\n                 He is serving a jail sentence, having been found guilty in 2020 of raping and sexually assaulting four young girls. Le Scouarnec kept detailed records in notebooks and diaries of the abuse he inflicted. He was never investigated during his career despite being sentenced in 2005 for owning sexually abusive images of children. He was only apprehended after he retired in 2017 when his six-year-old neighbour told her mother he had sexually abused her while she was playing in the garden of her home, in the town of Jonzac in southwest France. When the police searched Le Scouarnec's house after this, they found 300,000 indecent photos and videos of children, 70 child-sized dolls - some of which were chained up - wigs and hundreds of notebooks and diaries detailing his acts of abuse."
    },
    {
        "title": "Prince William's style of diplomacy is welcome in these tense times",
        "description": "Prince William's arrival in Estonia felt like the latest example of the Royal Family being right on the frontline of high-stakes diplomatic discussions.&#160;",
        "url": "https://news.sky.com/story/prince-williams-style-of-diplomacy-is-welcome-in-these-tense-times-13332717",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-estonia-tallinn-prince-of-wales_6862222.jpg?20250320140445",
        "type": "World",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-03-20 18:13:00",
        "Headline": "In high-stakes diplomatic discussions, the royals have an ability to reach an audience that politicians simply can't.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n Prince William's arrival in Estonia felt like the latest example of the Royal Family being right on the frontline of high-stakes diplomatic discussions.  There's been no attempt by the UK government and Foreign Office to shy away from why the prince was deployed. With Estonia sharing a border with Russia and being a big supporter of Ukraine, the government wants the prince to emphasise it's got the UK's full support, especially with anxiety rising over what a potential ceasefire might really mean.  The prince's meeting with President Karis was essential for both sides, and the media was quickly hurried out of their discussions - a sign of the seriousness of the talks. But while he was there to show support for his hosts, there was also important recognition of those they are playing host to, the 60,000 Ukrainian refugees who have fled to Estonia. As William visited a school, the Freedom School, set up in 2022 especially for Ukrainian students, he repeated the same message twice over - of praising Ukraine's resilience. He accepted a Taylor Swift-style bracelet in the Ukrainian colours - another little touch that you can't quite imagine a politician styling out. But that's what soft power is all about - the optics sometimes more important than words. \n                  Prince William meets Estonia's president amid tensions with Russia\n                 \n                  'New reality' of landmine use in Europe\n                 \n                  Prince William visiting Estonia in show of support for troops deterring Russian aggression\n                 It comes at a time when the concept of royal soft power has certainly felt more obvious. The King offering a hand of support to President Zelenskyy at Sandringham, just days after his clash with Donald Trump. And who can forget that letter the King sent to Mr Trump offering a second state visit, part of UK efforts to woo the US president. 👉 Listen to Sky News Daily on your podcast app 👈 There's also been a show of the monarch displaying support for Canada through two meetings with the outgoing and incoming prime ministers. William's no stranger to playing his part - remember his meeting with Donald Trump in Paris last year? Certainly a lot has changed since then. As I watched him on a walkabout in Tallinn, taking people's cameras who wanted selfies with him, it was a reminder that away from meeting presidents or prime ministers, the royals do have an ability to reach an audience that politicians simply can't. William's deployment is very much welcomed during these tense diplomatic times."
    },
    {
        "title": "China has 'executed four Canadians'",
        "description": "China has executed four Canadians over the last few months, Canada's foreign affairs minister has said.",
        "url": "https://news.sky.com/story/china-has-executed-four-canadians-13332340",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-canada-china-flags_6861833.jpg?20250320082314",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-20 10:40:00",
        "Headline": "Beijing's embassy in Ottawa said the executions were because of drug crimes and noted China does not recognise dual citizenship.",
        "Content": "China has executed four Canadians over the last few months, Canada's foreign affairs minister has said. Melanie Joly said she and former Canadian prime minister Justin Trudeau asked for clemency in the case of the dual citizens, who were accused of drug-related charges. Beijing's embassy in Ottawa said the executions were because of drug crimes and noted China does not recognise dual citizenship. \"We strongly condemn the executions,\" Ms Joly said. \"I asked personally for leniency ... They were all dual citizens.\" A spokesperson for the Chinese embassy said: \"China always imposes severe penalties on drug-related crimes. \"The facts of the crimes committed by the Canadian nationals involved in the cases are clear, and the evidence is solid and sufficient.\" China is thought to execute more prisoners each year than the rest of the world combined - though the total number is a state secret. Traditionally executions are carried out by gunshot, but lethal injections have been introduced in recent years. The Chinese embassy spokesperson said Beijing \"fully guaranteed the rights and interests of the Canadian nationals concerned,\" and urged the Canadian government to \"stop making irresponsible remarks\". Ms Joly said Canada consistently seeks clemency for Canadians facing the death penalty abroad. The families of those executed asked the government to withhold their identities, she added. Read more from Sky News:PM makes rare visit to nuclear-armed sub to show UK's strengthTrump holds 'very good' call with ZelenskyyNew rules may stop Musk making unlimited donations to Reform Canada's global affairs spokesperson Charlotte MacLeod said Ottawa is continuing to ask for clemency for Robert Schellenberg, a Canadian who was sentenced to death for drug smuggling. Amnesty International condemned the executions, saying China executed thousands of people in 2023. \"These shocking and inhumane executions of Canadian citizens by Chinese authorities should be a wake-up call for Canada,\" said Ketty Nivyabandi, the group's head for English-speaking Canada. It comes after China imposed tariffs on some Canadian farm and food imports earlier this month in retaliation for Canadian duties on Chinese-made electric vehicles and steel and aluminium products in October. Ian Brodie, a former chief of staff to ex-Canadian prime minister Stephen Harper, said it turns out \"agricultural tariffs weren't the worst part of the PRC response to EV tariffs.\" Opposition Conservative lawmaker Michael Chong said \"executing a number of Canadians in short order is unprecedented, and is clearly a sign that Beijing has no intention of improving relations with Canada\"."
    },
    {
        "title": "Donald Trump signs order to dismantle US department of education",
        "description": "US President Donald Trump has signed an executive order calling for the dismantling of the country's department of education.",
        "url": "https://news.sky.com/story/donald-trump-signs-order-to-dismantle-us-department-of-education-13332898",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-department-of-education_6862709.jpg?20250320225511",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-20 22:45:00",
        "Headline": "Mr Trump has long promised to take the agency apart, deriding it as wasteful and polluted by liberal ideology. But the department cannot be dismantled without an act of Congress.",
        "Content": " US President Donald Trump has signed an executive order calling for the dismantling of the country's department of education. However, the department cannot be dismantled without an act of Congress, which created it in 1979. Republicans have said they will introduce a bill to achieve that. Mr Trump has long promised to take the agency apart, deriding it as wasteful and polluted by liberal ideology. It has been a long-time target of conservatives. The order would leave school policy almost entirely in the hands of states and local boards, a prospect that alarms liberal education advocates. The president blamed the department for America's lagging academic performance and said states will do a better job. \"It's doing us no good,\" Mr Trump said at the White House. The White House said the department will not close completely and retained its responsibilities for funding for low-income schools, and distributing money for children with disabilities. \n                  Conor McGregor says he wants to be Ireland's next president\n                 \n                  US attorney general threatens 20-year jail sentences for damaging Elon Musk's Tesla cars\n                 \n                  Moments sport acted as tool of diplomacy - as Donald Trump and Vladimir Putin discuss hockey match \n                 The White House said earlier on Thursday that the department will continue to manage federal student loans, but the order appears to say the opposite. The department's workforce has already been slashed in half, and there have been deep cuts to the Office for Civil Rights and the Institute of Education Sciences, which gathers data on US academic progress. Much of the agency's work revolves around managing money - both its extensive student loan portfolio and a range of aid programmes for colleges and school districts, like school meals and support for homeless students. The agency is also key in overseeing civil rights enforcement. States and districts already control local schools, including the curriculum, but some conservatives have pushed to cut strings attached to federal money and provide it to states as \"block grants\" to be used at their discretion. Read more:What are Donald Trump's tariffs?Sky News correspondents react to Trump-Putin call Advocates for public schools said eliminating the department would leave children behind in an American education system that is fundamentally unequal. \"This is a dark day for the millions of American children who depend on federal funding for a quality education, including those in poor and rural communities with parents who voted for Trump,\" NAACP president Derrick Johnson said. Democrats said the order will be fought in the courts and in Congress."
    },
    {
        "title": "US attorney general threatens 20-year jail sentences for damaging Elon Musk's Tesla cars",
        "description": "The US attorney general has said three people alleged to have damaged Tesla cars and charging stations could be jailed for up to 20 years.",
        "url": "https://news.sky.com/story/us-attorney-general-threatens-20-year-jail-sentences-for-damaging-elon-musks-tesla-cars-13332767",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tesla-elon-musk-vandalism_6862557.jpg?20250320202600",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-20 20:08:00",
        "Headline": "Cars and charging stations associated with Elon Musk's company have been targeted in recent weeks. Meanwhile, on Thursday, almost all Cybertrucks were recalled due to a \"dangerous road hazard\".",
        "Content": "The US attorney general has said three people alleged to have damaged Tesla cars and charging stations could be jailed for up to 20 years. Pamela Bondi announced unspecified charges against three people who used Molotov cocktails in what she called a \"wave of domestic terrorism\". It comes as US safety regulators recalled almost all Cybertrucks from Elon Musk's company due to a \"dangerous road hazard\" that increases the risk of a crash. It is the eighth recall of the Tesla vehicle for safety problems in 15 months. The National Highway Traffic Safety Administration's recall, which covers more than 46,000 Cybertrucks, warned that an exterior panel that runs along the left and right sides of the windshield can detach while driving. In a statement on the three people charged with damaging Tesla cars and charging stations, Ms Bondi said: \"The days of committing crimes without consequence have ended. \"Let this be a warning: if you join this wave of domestic terrorism against Tesla properties, the Department of Justice will put you behind bars.\" \n                  Conor McGregor says he wants to be Ireland's next president\n                 \n                  Donald Trump signs order to dismantle US department of education\n                 \n                  Moments sport acted as tool of diplomacy - as Donald Trump and Vladimir Putin discuss hockey match \n                  The department said one of those arrested threw eight Molotov cocktails at a Tesla dealership in Salem, Oregon. This defendant was also armed with a suppressed AR-15 rifle. Another is alleged to have attempted to set on fire Tesla cars using Molotov cocktails in Loveland, Colorado, and was later found in possession of materials used to produce additional incendiary weapons. The third person wrote \"profane messages against President Trump\" around Tesla charging stations before setting stations on fire with petrol bombs in Charleston, South Carolina, the department said. Each of the three people arrested faces charges carrying a minimum penalty of five years, and up to 20 years in prison, the statement added. Read more:What's gone wrong at Tesla?Tesla investor calls for Elon Musk to step down Tesla showrooms, charging stations and privately-owned cars have been repeatedly targeted since the billionaire was appointed by Donald Trump to oversee a new Department of Government Efficiency (DOGE) that is slashing US government spending. As well as the attacks and recalls, Tesla has been struggling due to increased competition from rival electric vehicles, particularly out of China. Though largely unaffected by Thursday's recall announcement, Tesla shares have plummeted 42% in 2025."
    },
    {
        "title": "Scientist 'denied entry to US' after messages critical of Trump found on his phone",
        "description": "A French scientist has been denied entry into the US after he was found to have expressed an opinion about the Trump administration's research policy, the country's research minister has said.",
        "url": "https://news.sky.com/story/scientist-denied-entry-to-us-after-messages-critical-of-trump-found-on-his-phone-13332518",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-us-customs-border-generic_6862275.jpg?20250320145737",
        "type": "US",
        "Author": "Samuel Osborne",
        "Date Published": "2025-03-20 12:23:00",
        "Headline": "The unnamed researcher was on his way to a conference being held near Houston when he was subjected to a random check and his work computer and personal phone searched on 9 March, according to French media.",
        "Content": "\n          News reporter\n              @samuelosborne93\n A French scientist has been denied entry into the US after he was found to have expressed an opinion about the Trump administration's research policy, the country's research minister has said. The unnamed researcher was on his way to a conference being held near Houston when he was subjected to a random check and his work computer and personal phone searched on 9 March, the Agence France-Presse (AFP) news agency reported. A diplomatic source told the agency the researcher was accused of having messages \"that reflect hatred toward Trump and can be described as terrorism\". Another source said the researcher was accused of having \"hateful and conspiratorial messages\". They said the FBI opened an investigation, but \"charges were dropped\". The first source said the researcher's professional and personal equipment was confiscated, and that they were sent back to Europe the next day. \"I learned with concern that a French researcher who was travelling to a conference near Houston was denied entry to the United States before being expelled,\" said research minister Philippe Baptiste, according to AFP. \"This measure was apparently taken by the American authorities because the researcher's phone contained exchanges with colleagues and friends in which he expressed a personal opinion on the Trump administration's research policy,\" the minister added. \"Freedom of opinion, free research, and academic freedom are values ​​that we will continue to proudly uphold.\" Mr Baptiste said the scientist was part of the French National Centre for Scientific Research and the AFP news agency described him as a space researcher. Read more from Sky News:PM makes rare visit to nuclear-armed sub to show UK's strengthDefence firms demand 'patriotic' bankingNew rules may stop Musk making unlimited donations to Reform On the same day the scientist was denied entry, Mr Baptiste published a letter to American research institutions telling researchers they would be welcome in France. \"Many well-known researchers are already questioning their future in the United States,\" he said in the letter. \"We would naturally wish to welcome a certain number of them.\" The US Department for Homeland Security has been contacted for comment."
    },
    {
        "title": "Unreleased Eminem music stolen and sold online - man charged",
        "description": "A former studio engineer has been charged with stealing Eminem's unreleased music and selling it online.",
        "url": "https://news.sky.com/story/former-eminem-studio-engineer-charged-with-stealing-and-leaking-unreleased-music-13332289",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-eminem-music-detroit_6861729.jpg?20250320031853",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-20 02:59:00",
        "Headline": "FBI prosecutors say more than 25 of Eminem's unfinished songs have been played or distributed online without consent. Joseph Strange, 46, was charged with copyright infringement and interstate transportation of stolen goods.",
        "Content": "A former studio engineer has been charged with stealing Eminem's unreleased music and selling it online. FBI prosecutors say more than 25 songs from the Detroit rapper have been played or distributed online without his or Interscope Capital Labels Group's consent. A federal affidavit said Joseph Strange, a 46-year-old from Michigan, was charged via a criminal complaint with copyright infringement and interstate transportation of stolen goods. Acting US Attorney Julie Beck in Detroit said the man, who lost his job at Eminem's studio in 2021, could face up to 15 years in prison if convicted of both counts. He denies the charges. The affidavit said the music stored on password-protected hard drives kept in a safe at Eminem's studio in Ferndale, a Detroit suburb. Studio employees reported the theft to the FBI in January this year, saying unreleased music still in development was live on various websites such as Reddit and YouTube. A review found files were transferred from a hard drive in a safe to an external hard drive in October 2019 and January 2020, when Strange was a sound engineer at the studio. \n                  Eminem's mother, Debbie Nelson, dies aged 69\n                 \n                  US election: The celebrities backing Donald Trump or Kamala Harris\n                 \n                  Eminem to become a grandfather after daughter Hailie Jade confirms pregnancy\n                 Investigators also found buyers after Eminem's business associate Fred Nassar posted an online warning to fans not to distribute the music. A Canadian resident who used the screen name Doja Rat told investigators he had purchased 25 unreleased songs from Strange for about $50,000 (£38,435) in Bitcoin. Doja Rat added he raised the money from a group of fans of the Lose Yourself star, and added Strange was trying to sell some of Eminem's handwritten lyric sheets. The affidavit added another group of fans, organised by someone in Connecticut using the screen name ATL, also purchased a \"couple\" of songs from Strange for about $1,000 (£768.70). Read more:Stalker who 'terrified' Cheryl jailedYung Filly denies sexual assault charges In a statement, Strange's attorney Wade Fink his client is a married father of two \"with decades of dedication to the music industry\". He called the charges \"untested allegations\" that haven't been vetted by a grand jury or a judge, adding: \"We will handle the matter in a courtroom and we have great faith in the judges of our district.\""
    },
    {
        "title": "Bank of England holds interest rate at 4.5% amid trade war uncertainty",
        "description": "The Bank of England has kept interest rates on hold as it warned of growing economic uncertainty linked to Donald Trump's trade war.&#160;",
        "url": "https://news.sky.com/story/bank-of-england-holds-interest-rate-at-45-amid-trade-war-uncertainty-13332488",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-biz-graphic-bank-england_6643990.png?20240731155139",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-03-20 11:30:00",
        "Headline": "The vote to maintain the rate was more unified than first expected.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n The Bank of England has kept interest rates on hold as it warned of growing economic uncertainty linked to Donald Trump's trade war.  The central bank's monetary policy committee, which meets every six weeks to set borrowing costs, voted 8-1 to keep the bank rate unchanged at 4.5%. Although the decision was widely expected, the vote was more unified than many assumed. Just one member of the committee, Swati Dhingra, voted to cut rates by 25 basis points. In what may come as a surprise to some, Catherine Mann, who voted for an outsized 50 basis points cut last month, opted to hold. The Bank kept its guidance unchanged, pointing to \"a gradual and careful approach\" to rate cuts, but warned it was prepared to keep borrowing rates higher for longer if wage and price growth continues to persist. Concerns about constrained supply in the economy - which limits the economy's ability to grow without sparking inflation - have been playing on policymakers' minds. The Bank echoed these concerns again today, alongside warnings about \"second-round effects\" from higher wages and prices, which could cause inflation to spiral. \"This would warrant a relatively tighter monetary path,\" it said. \n                  Bank of England cautious as inflationary tiger stalks weak economy\n                 \n                  Inflation rise unlikely to shift Bank of England's stance on interest rates\n                 \n                  The Bank of England gold rush that's pushing up the price\n                 Trade war concerns Central bankers said they were also contending with an increasingly uncertain global outlook. In minutes of the meeting published alongside the announcement, the Bank said: \"Since the MPC's previous meeting, global trade policy uncertainty has intensified, and the United States has made a range of tariff announcements, to which some governments have responded. \"Other geopolitical uncertainties have also increased and indicators of financial market volatility have risen globally.\" The Bank was relatively sanguine about the impact of Trump's tariff policy on the economic growth in the UK but said it could not be certain about the consequences for inflation. Last night the US Federal Reserve kept its key borrowing rate on hold while downgrading growth forecasts and upgrading its inflation projections. Central bankers in the UK are also contending with heightened policy uncertainty - both at home and abroad - which means they have been cautious in their approach. Bank governor Andrew Bailey said: \"We have to be quite careful at this point in how we calibrate our response because we're still seeing a very gradual fall in inflation. We need to accumulate the evidence.\" The Bank started cutting rates in August but, since then, it has reduced the bank rate just three times as policymakers evaluate a mixed economic picture. Along with fears about supply constraints in the economy, inflation has climbed back above the Bank of England's 2% target and wage growth continues to outstrip inflation. Average weekly earnings, including bonuses, did cool from 6.1 % to 5.8% in the three months to January but the figure is still considerably higher than the inflation rate of 3%. Central bankers keep a close eye on wage growth as they fear wage pressures fuel price pressures in the economy. Inflationary pressures still exist in the economy but the Bank is balancing that against signs of an economic slowdown. The economy contracted by 0.1 % at the beginning of the year and the labour market is cooling. Recruiters are warning of a sharper slowdown when the chancellor's national insurance contribution increases kick in next month. The Bank of England reiterated this today, warning that business surveys \"generally continue to suggest weakness in growth and particularly employment intentions\". Where to for inflation? There are also reasons to be sanguine on inflation. While the headline rate jumped to 3% in January, the increase was driven by one-off factors and base effects, including VAT on private schools and a jump in airfares because of a shift in the timing of the Christmas holidays. Food inflation also rose but food prices can be volatile. The Bank is more interested in services inflation, which gives a better indication of domestically generated pressures. This came in at 5%, which was below the Bank's forecast. While the headline rate is expected to hit 3.7% by the summer, policymakers have indicated that this is likely to be a bump in the road - driven by a temporary jump in energy prices and rising water and council tax bills from April. While these will eventually drop out of the inflation rate calculation, that will offer little relief to consumers who will still have to contend with a sustained rise in the price level."
    },
    {
        "title": "Bank of England cautious as inflationary tiger stalks weak economy",
        "description": "The Bank&#8217;s decision to hold rates did not come as a surprise but the vote was more unified than expected.",
        "url": "https://news.sky.com/story/bank-of-england-cautious-as-inflationary-tiger-stalks-weak-economy-13332491",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-money-economy_6827500.jpg?20250213114357",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-03-20 11:32:00",
        "Headline": "Sky's Gurpreet Narwan says Bank of England rate-setters are having to look at the potential risks ahead - and the vast majority are clearly worried about the outlook for price growth.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n The Bank’s decision to hold rates did not come as a surprise but the vote was more unified than expected. It suggests concerns about inflation are niggling away at policymakers, even though economic growth has gone into reverse. The headwinds are coming from home and abroad. Donald Trump has injected a big dose of uncertainty into the global economy and policymakers are grappling with the possible fall out, both for growth and inflation. Money latest: Top chef rages at modern phenomenon in restaurants That was the backdrop to today's decision. While financial markets were confident that the Bank would respond by holding rates, it was not a given. Policy uncertainty is also bad for the economy and we are struggling on the growth front. The economy is stagnating and the jobs market is cooling, with a sharper slowdown coming down the road when Rachel Reeves' national insurance contribution increases come into force next month.  The spring statement later this month is also likely to include big spending cuts and possible tax rises, which could depress economic activity. Usually, this would be a strong cue for policymakers to start cutting rates and, for months now, there has been a growing clamour urging them to move faster. \n                  Bank of England holds interest rate at 4.5% amid trade war uncertainty\n                 \n                  Inflation rise unlikely to shift Bank of England's stance on interest rates\n                 \n                  The Bank of England gold rush that's pushing up the price\n                 Yet, they were almost unanimous in deciding to pause. Why? The picture is complicated because the inflationary tiger is still lurking and the fear is that a temporary jump in inflation could become embedded.  Ultimately, getting inflation down to 2% is the Bank's core mission. CPI is above target at 3% and wage growth is even higher, pushing 6%. The Bank is also increasingly concerned about the capacity of the economy, chiefly its ability to soak up more growth without prices having to rise. Then there's Trump. The UK is not in the US president's direct firing line bar tariffs on some metals and the Bank was relatively calm about the economic impact of Trump's tariff policy - for now. However, it was less certain about the impact on inflation. On the one hand, a global rise in manufacturing costs could spur inflation higher. On the other hand, imports could become cheaper if our currency devalues relative to others. It's an uncertain picture. Read more from Sky News:Why strong wage growth is a problem for the Bank of EnglandDefence firms demand 'patriotic' banking for investment push We have a relatively small, open economy, leaving us vulnerable to global fluctuations. That's something Dave Ramsden, the bank's deputy governor, flagged in a speech in South Africa a couple of weeks ago. It means we are still grappling with the worst of all possible worlds: Creeping inflation and weak economic growth. That's not an easy one to navigate for the Bank of England."
    },
    {
        "title": "Yorkshire Water to pay £40m for sewage overflow failures",
        "description": "Yorkshire Water has agreed a &#163;40m 'enforcement package' with the industry regulator after an investigation found sewage outflow and wastewater deficiencies at the company. ",
        "url": "https://news.sky.com/story/yorkshire-water-to-pay-16340m-for-sewage-overflow-failures-13332521",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-water-sewage-drinking-water_6774278.jpg?20241212161448",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-03-20 12:27:00",
        "Headline": "An agreement with the regulator forces the company to spend the bulk of the money on sewage spill prevention while a local river partnership also gets cash to enable improvement work.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Yorkshire Water has agreed a £40m 'enforcement package' with the industry regulator after an investigation found sewage outflow and wastewater deficiencies at the company.  Ofwat identified \"serious failures\" over how the firm operated and maintained its sewage network, resulting in excessive spills from storm overflows. The bulk of the penalty - £36.6m - will be spent on infrastructure upgrades over the next five years, the regulator said. Money latest: Top chef rages at modern phenomenon in restaurants The balance of £3.4m would support the work of the Great Yorkshire Rivers Partnership to help clear artificial barriers and improve water quality across the regional river network. The enforcement agreement was announced as Yorkshire Water prepares to raise bills for its five million customers by 29% from 1 April. Ofwat's bill settlements with suppliers across England and Wales - some of which are the subject of appeal - will see the vast majority of homes and businesses face inflation-busting increases. \n                  Bank of England holds interest rate at 4.5% amid trade war uncertainty\n                 \n                  Money blog: Blow to borrowers as interest rate predictions shift\n                 \n                  Bank of England cautious as inflationary tiger stalks weak economy\n                 Average bills will soar by £10 a month for 2025/26 and rise further between 2026 and 2030 in return for a step up in water company investment, particularly in the area of storm outflows which have drawn widespread anger across the UK due to rising instances of sewage releases.  Ofwat said the enforcement agreement meant that customers, rather than the Treasury, received the proceeds of the redress package. Its senior director for enforcement, Lynn Parker, said: \"Our investigation has found serious failures in how Yorkshire Water has operated and maintained its sewage works and networks, which has resulted in excessive spills from storm overflows. \"This is a significant breach and is unacceptable. \"We are pleased that Yorkshire Water has recognised this failure and is taking steps to put it right for the benefit of customers and the environment. \"We now expect them to move at pace to correct the remaining issues our investigation has identified.\" Read more from Sky News:Trade war uncertainty weighs on rate cut prospectsWhy strong wage growth is a problem for the Bank of EnglandDefence firms demand 'patriotic' banking for investment push The company's chief executive, Nicola Shaw, responded: \"We know our storm overflows operate more frequently than we, or our customers, would like them to. \"Since 2021, we've been actively taking steps to improve our performance. \"We know there's still more for us to do. \"We're at the forefront of the industry to get this resolved and we're looking forward to delivering our ambitious plans to improve river health in Yorkshire. \"We apologise for our past mistakes and hope this redress package goes some way to show our commitment to improving the environment.\""
    },
    {
        "title": "Strong wage growth and some good news for government in ONS labour market data",
        "description": "Wage growth has remained strong, the latest official figures show, as the Bank of England decided to hold interest rates. ",
        "url": "https://news.sky.com/story/strong-wage-growth-and-some-good-news-for-government-in-ons-labour-market-data-13332325",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-cost-of-living-energy-price-cap_6789796.png?20250102121246",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-03-20 06:23:00",
        "Headline": "Continued wage rises kept interest rate setters cautious as pay rises can spur inflation. But there was good news for the government in some of the data. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Wage growth has remained strong, the latest official figures show, as the Bank of England decided to hold interest rates.  Wages - excluding bonuses - grew 5.9% in the three months to January, the same amount as a month earlier, data from the Office for National Statistics (ONS) showed. Meanwhile, growth in average weekly earnings, including bonuses, fell to a surprise 5.8%. Economists polled by the Reuters news agency anticipated a 5.9% rise. Money blog: top chef reveals pet hate in restaurants It means wage growth is still high and well above the rate of overall price rises. Inflation stood at 3% in January. Both private and public sectors have seen rises, the ONS said, describing the growth as \"strong\".  It came as the Bank of England held interest rates at 4.5% at its meeting today, in part because of the inflationary impact of wage growth. \n                  Bank of England cautious as inflationary tiger stalks weak economy\n                 \n                  Bank of England holds interest rate at 4.5% amid trade war uncertainty\n                 \n                  UK and global economic growth forecasts cut - as Trump tariffs blamed\n                 Wage increases have surpassed the level of inflation since July 2023, something that could stop the interest rate setters at the Bank from cutting rates at future meetings. Unsurprising unemployment There was little change in the rate of unemployment which remained at 4.4%. The labour market picture is \"relatively unchanged\", the ONS's director of economic statistics, Liz McKeown said. The number of employees on payrolls is \"broadly flat\" with little growth seen over the last year, she added. The ONS, however, has advised caution in interpreting changes in the monthly unemployment rate due to questions over the reliability of the figures. The exact number of unemployed people is not known - partly because people don't answer the phone when the ONS calls. Some good news for government In good news for the government, data also released today showed a fall in the number of people neither in nor looking for work. Welfare reforms announced this week aim to bring down the number of people classed as \"economically inactive\". But the numbers have already gone down. ONS figures showed the economic inactivity rate for people aged 16 to 64 years was around 21.5% in the three months to January, below the same time last year as well as the preceding three months."
    },
    {
        "title": "Intertek to hand boss Lacroix multimillion pound pay boost",
        "description": "Intertek Group, the testing and inspection specialist, is to become the latest in a string of FTSE-100 companies to hand their chief executives a sizeable pay boost.",
        "url": "https://news.sky.com/story/intertek-to-hand-boss-lacroix-multimillion-pound-pay-boost-13332578",
        "image_url": "https://e3.365dm.com/21/07/1920x1080/skynews-intertek-company-firm_5462829.jpg?20210730141832",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-20 13:58:00",
        "Headline": "Andre Lacroix, who has run the testing and inspection specialist since 2015, will be the latest FTSE 100 chief to see his maximum pay package increased under proposals to be unveiled by the company on Friday, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Intertek Group, the testing and inspection specialist, is to become the latest in a string of FTSE-100 companies to hand their chief executives a sizeable pay boost. Sky News has learnt that the company, which has a market value of close to £8bn, will disclose in its annual report on Friday that Andre Lacroix has been awarded a multimillion pound increase in his maximum remuneration package. Shareholders consulted on the proposals said the increase would largely consist of a substantial hike in Mr Lacroix's variable pay through his long-term incentive opportunity. Money latest: Top chef rages at modern phenomenon in restaurants Mr Lacroix has run the company for a decade, with revenues rising by 62% during that period and operating profit up by more than 80%. The increase in his maximum pay package will make Mr Lacroix the latest in a series of blue-chip company bosses to see their earnings boosted amid intense debate about the attractiveness of the London stock market. Dame Emma Walmsley, the boss of drugs giant GSK, will see her maximum payout increase to £21.6m under a new pay policy. \n                  Bank of England holds interest rate at 4.5% amid trade war uncertainty\n                 \n                  Money blog: Blow to borrowers as interest rate predictions shift\n                 \n                  Bank of England cautious as inflationary tiger stalks weak economy\n                 Earlier this year, Sky News revealed that the chief executives of Barclays and HSBC Holdings would see their packages increase following talks with major shareholders. Read more from Sky News:Trade war uncertainty weighs on rate cut prospectsWhy strong wage growth is a problem for the Bank of EnglandDefence firms demand 'patriotic' banking for investment push Other companies capitalising on a more permissive mood among institutional investors include British American Tobacco and Compass Group, the contract caterer. Last year, Dame Julia Hoggett, chief executive of the London Stock Exchange, called for UK CEO pay to be brought more closely into line with that of US-based peers in order to help avert a flow of companies shifting their listings to New York. Intertek declined to comment."
    },
    {
        "title": "Defence firms held back by UK ethical banking standards, industry says",
        "description": "British banks should abandon outdated ethical standards and increase lending to domestic defence manufacturers in a \"patriotic\" effort to ensure the UK can meet its security needs, defence suppliers have told Sky News.",
        "url": "https://news.sky.com/story/defence-firms-held-back-by-uk-ethical-banking-standards-industry-says-13332109",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-air-defence_6539696.jpg?20240501150837",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-03-20 03:04:00",
        "Headline": "Banks are facing pressure on many fronts to bolster lending to defence companies on the frontline of UK security amid accusations that lenders are hiding behind ESG rules.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  British banks should abandon outdated ethical standards and increase lending to domestic defence manufacturers in a \"patriotic\" effort to ensure the UK can meet its security needs, defence suppliers have told Sky News. The defence industry has long complained that environment, sustainability and governance (ESG) standards, intended to guide business impact on society, have prevented small and medium-sized companies (SMEs) raising finance. With the government promising to increase defence spending to 2.5% of GDP, and the chancellor keen that SMEs in the sector should contribute increased growth, the industry believes ESG rules could hold British companies back.  Lizzie Jones of Supacat, which manufactures military vehicles used by special forces and infantry, told Sky News: \"We have absolutely felt the disinterest from banks to invest in the defence industry, which has been really hard to deal with over the last few years. \"We're hoping that the tide is beginning to change, and that actually some of the patriotic feelings that we need the defence industry, particularly right now, will help persuade the banks that investing in defence industries is good for UK growth.\" The call for support from the defence industry comes as European military chiefs meet in London to discuss operational aspects of a proposed peacekeeping force in Ukraine. Donald Trump's return to the White House, and his demand that European NATO partners scale up defence and lead any security guarantees for Ukraine, has forced a re-examination of defence priorities. \n                  UK has no plans for conscription - but future decisions will respond to 'new reality', says minister\n                 \n                  It's a critical time for the MoD - so who is Defence Secretary John Healey?\n                 \n                  Arms firms across Europe worth billions more amid talk of Ukraine defence pact\n                 Rachel Reeves has sought to link increased spending to her growth agenda, and defence will form part of the industrial strategy due later this year.  Earlier this month a group of Labour MPs, and members of the defence select committee, called on banks to end \"anti-defence\" ESG guidelines in light of the US retreat from European security, and the need to increase support for Ukraine. Improved access to finance is one of several demands from defence suppliers large and small, as the industry prepares for increased demand. Certainty of contracts, a reduction in Ministry of Defence red tape, and access to cheap energy, skilled workers and critical minerals are all also required if the UK is to enjoy \"sovereign capability\" - the ability to build and deploy its own equipment, weapons and systems. The call for a re-examination of ethical standards was echoed by one of the largest defence suppliers, Leonardo UK, the British arm of an Italian-listed multinational that manufactures helicopters and electronic warfare technology. Chief executive Clive Higgins told Sky News: \"The ESG agenda was really impacting small to medium enterprises where no banking was effectively taking place, and individuals couldn't go get a bank account because they were in the defence sector. \"We've seen a real, really proactive response from the government over the last 12 months. I think we're starting to see a shift in the tragic events going on in Ukraine, which helps people recognise the importance of defence at home, because that ensures we can enjoy the freedoms that you and I take for granted each day.\"  The UK Sustainable Finance Association, which represents a number of major investors and pension funds, rejected the argument that the defence industry is \"underinvested\". Chief executive James Alexander said: \"The notion that defence firms' low valuations and struggles for finance is because of 'ESG' criteria is nonsense. Read more:The rallying cry for defence requires big culture changesIncreased defence spending will mean cuts elsewhereDefence spending decision 'accelerated' by Trump's election win \"The UK's 'ESG' (or sustainable finance) regulations at no point prohibit defence investments. While some values-based (or 'ethical') investors may opt against investing in defence companies, they represent a small proportion of the financial system. \"Many financial institutions, including mainstream, sustainable investors, do invest in defence. Most critical to defence companies' prospects, though, is government spending, as highlighted by the rise in several defence stocks this year, as the UK and European allies have understandably announced increases in defence spending.\" The Financial Conduct Authority said last month that its ESG reporting rules contain nothing \"that prevents investment or finance for defence companies\", implying that divesting from or avoiding defence is a choice for institutions and their customers."
    },
    {
        "title": "Putin will break any peace deal where Ukraine is not 'defended' by 'coalition of the willing', Starmer warns",
        "description": "Vladimir Putin will break any peace agreement with Ukraine that is not \"defended\" by an international coalition of forces, the British prime minister has said.",
        "url": "https://news.sky.com/story/putin-will-break-any-peace-deal-where-ukraine-is-not-defended-by-coalition-of-the-willing-starmer-warns-13332903",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-starmer-pm-defence_6862737.jpg?20250320234743",
        "type": "Politics",
        "Author": "Deborah Haynes",
        "Date Published": "2025-03-20 22:47:00",
        "Headline": "The prime minister spoke as he visited a UK base to meet a group of senior military officers from more than 30 nations tasked with turning a political desire to support Kyiv into an actionable plan to help protect the country.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Vladimir Putin will break any peace agreement with Ukraine that is not \"defended\" by an international coalition of forces, the British prime minister has said. Sir Keir Starmer was talking on Thursday as he visited a UK base to meet a group of senior military officers from more than 30 nations tasked with turning a political desire to support Kyiv into an actionable plan to help protect the country from land, sea and air in the event of a ceasefire. But, with Donald Trump pushing hard for Russia and Ukraine to stop fighting now, there are concerns among analysts that the \"coalition of the willing\" - led by the UK and France - will be overtaken by events, with peace declared before it has time to get its act together. In a sign of the challenge, the southern Ukrainian city of Odesa was struck on Thursday night by what its governor described as a \"massive\" Russian drone attack even as the US president talked up the prospects for peace. US negotiators are set to meet separately with Ukrainian and Russian officials in Saudi Arabia on Monday to try to make progress on a ceasefire. Mr Trump also claimed he was on the brink of signing an economic deal with Ukraine - something that has been trailed for weeks as a key step in strengthening US-Ukraine relations and locking in Washington's support for Kyiv's future, but has yet to materialise. Ukraine war latest: Follow live updates \n                  Heathrow Airport closed after 'significant power outage' due to nearby fire\n                 \n                  Stephen Lawrence killer David Norris 'admits role in attack', says Parole Board\n                 \n                  Former first minister Nicola Sturgeon cleared in police investigation into SNP's finances\n                 Clearly alive to the urgency to act, Sir Keir greeted the group of visiting military planners at the UK's Permanent Joint Headquarters at Northwood, on the edge of London. They gathered around a large map of Ukraine spread out across a table. \"Now is the time to be doing this,\" the prime minister told the officers from a range of European and other allied countries, including Turkey, the Netherlands and Canada. Ukrainian officers were also present as well as NATO officials. \"We don't know what the outcome of any [peace] talks is going to be, but we do know that if there is a deal, it's important to have done the preparation beforehand.\" The size and shape of what Western officials have described as a \"reassurance force\" for Ukraine are unclear - so too what kind of military headquarters would command it. Initial briefings on the concept suggested it could involve thousands of troops deployed to cities and to protect critical infrastructure such as nuclear power stations, but kept back from frontline areas, while Royal Air Force warplanes and other countries' jets would protect Ukraine's skies, and various navies, including the Royal Navy, would help secure the sea. Yet, without US support, the European offer, even with backing from other aligned nations such as Canada, would not act as much of a deterrence to Russia. And that is if the coalition is ready to deploy in time for any ceasefire. Read more:Does Trump have any red lines?The 'coalition of the willing' that could secure peace in Ukraine The British prime minister said peace would only endure if \"it is a defended deal\". He offered a sense of what the military planners have been tasked with delivering after the political leaders of all the countries involved agreed to work together to help Ukraine. \"What's happening here is turning that political intention into reality - the concept into plans, whether that's in relation to what might happen at sea or air or defending borders,\" Sir Keir said. \"But it is vitally important we do that work because we know one thing for certain, which is a deal without anything behind it is something that Putin will breach. \"We know that because it's happened before. And I'm absolutely clear in my mind it will happen again.\""
    },
    {
        "title": "UK growth forecast set for major downgrade as chancellor faces difficult spring statement",
        "description": "The chancellor's update on the economy next week is not going to be an emergency budget in its truest sense. But it will be a moment when the sirens flash red.",
        "url": "https://news.sky.com/story/spring-statement-a-red-siren-moment-for-reeves-with-big-spending-squeeze-ahead-13332768",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rachel-reeves-beth-rigby_6862424.jpg?20250320174237",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-03-20 20:12:00",
        "Headline": "Rachel Reeves is likely to promise the government will go \"further and faster\" to boost economic growth when she delivers her spring statement on Wednesday - but spending cuts loom large.",
        "Content": "\n          Political editor\n              @BethRigby\n The chancellor's update on the economy next week is not going to be an emergency budget in its truest sense. But it will be a moment when the sirens flash red. It's not an emergency budget because the chancellor, as our listeners will know from our interview with Rachel Reeves on Electoral Dysfunction a couple of weeks ago, is not going to make tax changes (such a move would tip it into budget territory because it would turn the spring statement into a major fiscal event). But it looks set to be a red siren moment for a chancellor. Having staked her reputation on growing the economy and no return to austerity, she is going to have to announce a downgrade to growth forecasts and could also unveil the biggest spending squeeze on Whitehall in years. The welfare cuts this week were just the starter - the opposition are going to have a field day. Watch out in the next few days for a \"re-education\" as the Treasury tries to frame the arguments Reeves will get in at the despatch box on Wednesday. You'll hear about how the \"world has changed\", with global uncertainly knocking growth and forcing countries to invest more in defence. This is all part of the chancellor seeking to distance sluggish growth from her own budget decisions last October (the Conservatives will shout back jobs tax - their rebranding of the Reeves' £25bn hike in employers' national insurance contributions). \n                  What could be announced in Rachel Reeves' spring statement?\n                 \n                  Welfare system will be here 'for years to come' amid backlash over impending cuts\n                 \n                  When is the spring statement - and what do you need to know about it?\n                 You will also be hearing more about the need to go \"further and faster\" on the economy (the bonfire of quangos, planning rules, regulations and drive for 'efficiency savings'). But whatever arguments she makes ahead of time won't dent the sharp inhalation of breath as growth is downgraded and the chancellor outlines what's likely to be billions in cuts to the departmental budgets in an effort to plug the black hole in the public finances that has emerged from slower growth and rising debt repayments.  Economists expect the deteriorating outlook to eat up the £9.9bn of headroom she had in order to meet her own fiscal rules in the October budget. The Resolution Foundation think-tank estimates that the current account balance has shifted from that £9.9bn surplus to a deficit of around £4.4bn. Many Labour MPs think Reeves should just loosen her fiscal rules (she has legislated that day-to-day spending must be funded from tax receipts, not debt, by 2029/30), but she told me on our Electoral Dysfunction podcast that is something she will not do. Neither, I hear, is she prepared to just let the public finances sit in the red. But getting back to black is going to involve a massive spending squeeze. So watch for reductions in Whitehall departmental budgets later in the parliament. The government has already earmarked £5bn in savings from the benefits bill by 2029/30 and could whittle back projected rises in departmental spending towards the back end of parliament. Read more:What is PIP?Key welfare changes explained Departmental spending is set to rise by an average of 1.3% from 2026-27 onwards. If the chancellor reduces that, she could save billions. But the headlines will scream cuts, especially for those departments which don't have protected budgets and which could face real terms reductions. It's going to be difficult and the government is braced for cries of austerity 2.0, which is frustrating officials who are quick to point out that the government has poured billions more into public spending after executing the biggest tax and spend budget in a generation.  \"This is not a return to austerity, which was about real terms cuts,\" said one figure. \"We will be finding savings and squeezing spending but the overall level of spending will still be going up.\" But it is tense. As she looks for savings, the chancellor has asked cabinet ministers to identify 5% efficiency savings from their departments and also identify 20% of the lowest priority spending. In private, ministers are protesting about cuts. Read more:What could be announced in Rachel Reeves' spring statement?What is the spring statement - and what do you need to know? Labour peer Harriet Harman told the Electoral Dysfunction podcast that identifying such big levels of savings is going to cause consternation. \"As somebody who was told to do 2% and felt even that was incredibly difficult, then I should imagine that it is causing consternation. \"It is a very, very difficult exercise. But, you know, at the end of the day, we're in difficult circumstances. \"We've made a promise to the electorate about how are we going to run the economy, and that's what we're going to do. \"And Labour MPs, I think, you know, are very resolved on this. They know the situation's difficult. They know the government has got a set of principles that they're applying to it, and they'll be supportive of the government on this. \"So one thing we have got is political stability on this. There won't be any, you know, screeching handbrake U-turns. There won't be massive revolts and there won't be cabinet splits either.\" The government hopes protest will be dialled down as it dials up talk about 'reform' and how the government can rewire Whitehall in a way that money is trained on the frontline and services can be maintained even as budgets are whittled back. The biggest symbol of that so far being the prime minister's announcement last week that he was abolishing NHS England and folding the oversight of the NHS back into the Health department - which the government says could save up to £500m a year. But even if Harriet Harman is right on the would-be rebels and ministers have their arguments honed, a major downgrade of growth forecasts and a spending squeeze from a government that told voters it would be doing the exact opposite in the run-up to the election is set to be a very difficult day indeed. 👉 Click here to follow Electoral Dysfunction wherever you get your podcasts 👈"
    },
    {
        "title": "Starmer defends 'vital' benefit cuts - as he cites cases of his late mother and brother",
        "description": "The government can't \"shrug its shoulders\" and pretend the welfare system is \"progressive\", Sir Keir Starmer has said, as he again defended his benefit cuts. ",
        "url": "https://news.sky.com/story/starmer-defends-vital-benefit-cuts-as-he-cites-cases-of-his-late-mother-and-brother-13332557",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-sir-keir-starmer-prime-minister_6862193.jpg?20250320134630",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-03-20 13:30:00",
        "Headline": "Welfare savings announced by the government have left many in Labour feeling distinctly uncomfortable, and ministers are having to deny accusations that they're now making decisions people would traditionally expect from the Conservatives.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  The government can't \"shrug its shoulders\" and pretend the welfare system is \"progressive\", Sir Keir Starmer has said, as he again defended his benefit cuts.  The prime minister told Sky News political correspondent Serena Barker-Singh he understands why some of his backbenchers are uncomfortable, citing the cases of his late mother and brother. Politics live: Protesters get into House of Lords \"I've lived all my life with the impact of disability through my mum, who was very ill all her life,\" he said. \"And more recently, my brother, who recently died of cancer, so I do understand the concerns.\" However, he said it is \"morally indefensible that a million young people are going essentially from education on to benefits\". \"All the evidence shows if young people are in that position and so early in their lives, they're going to find it really difficult ever to get out of that,\" the prime minister said. \"There aren't many people who genuinely argue the status quo is working,\" Sir Keir added.  'We can't just shrug our shoulders' Sir Keir said there were two million people on benefits because of sickness - a figure he said would double by 2030 without action from the government. \"We can't just shrug our shoulders and pretend that it's progressive to watch millions more people go on to disability benefits when they could and many of them want to be in work,\" he added. \"That's why it's so vital that we carry out these reforms.\" The £5bn package of savings announced on Tuesday includes making it harder for people to claim a key disability benefit called personal independence payment (PIP). The government is also delaying access to the universal credit health top-up until claimants are 22, using the cash to invest in training opportunities for young people. This will go alongside a £1bn investment into \"tailored\" support to help the disabled and long-term sick get jobs, as well as several other reforms. Read more:What is PIP?Key welfare changes explained  Labour backlash The timing of the announcement has attracted criticism given Chancellor Rachel Reeves' spring statement next Wednesday, when she is expected to announce more spending cuts. At PMQs, veteran Labour left-winger Diane Abbott challenged ministers' arguments of a \"moral\" need for change, saying: \"This is about the Treasury's wish to balance the country's books on the back of the most vulnerable and poor people in this society.\" It echoes an argument the Tories are making, which is that while they broadly support reform, the cuts are only being made because of the damage they say Ms Reeves' October budget has done.  Ministers insist they would have changed things regardless of the fiscal situation, but that hasn't quelled discontent, with Labour MP Chris Webb becoming the first of the 2024 cohort to break ranks. It has led to questions about what the Starmer government stands for, following rows over cuts to the aid budget and the winter fuel payment, and the refusal to drop the two-child benefit cap. Earlier on Thursday, defence minister Luke Pollard denied Labour was now a centre-right party. It came after Health Secretary Wes Streeting rejected accusations Labour was \"turning into the Tories\"."
    },
    {
        "title": "Badenoch makes bleak local elections prediction - as Farage mocks 'comical' new slogan",
        "description": "\"Almost every\" council the Conservatives won in 2021 could be lost in this year's local elections, Tory leader Kemi Badenoch has conceded.",
        "url": "https://news.sky.com/story/badenoch-makes-bleak-local-elections-prediction-as-farage-mocks-comical-new-slogan-13332482",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-kemi-badenoch-tory_6862080.png?20250320120914",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-03-20 11:19:00",
        "Headline": "On 1 May, across England, more than 1,600 council seats will be up for re-election, alongside six mayors. The Conservative Party is facing being squeezed by the Liberal Democrats, Reform UK and local independent parties.",
        "Content": "\n          Political reporter\n        \"Almost every\" council the Conservatives won in 2021 could be lost in this year's local elections, Tory leader Kemi Badenoch has conceded. Speaking at the launch of her party's campaign, Ms Badenoch said the votes four years ago followed the COVID vaccine rollout - helping her party to 14 council gains and holding another 49. Politics live: Badenoch has a dig at Farage On 1 May, across England, more than 1,600 council seats will be up for re-election, alongside six mayors. The Tories face being squeezed by Reform on their right, as well as a blend of Liberal Democrats and independents. Ms Badenoch warned party members: \"It will be the first time since the general election, the greatest defeat in all parties' history, that we fight these seats.\" Map the 2024 election results on to the upcoming council ones, and the Tory leader admitted \"we lose almost every single one\". 'People have lost trust in politics' Labour are also likely to perform poorly, as local election results tend to reflect public opinion towards the national governing party. Measures like inheritance tax on farms, benefit cuts, planning reform, reducing winter fuel payments and others could weigh heavily on Sir Keir Starmer's chances. It was put to Ms Badenoch that lots of these protest votes look set to go to Nigel Farage's Reform UK. Asked about the differences between the Tories and Reform by Sky News deputy political editor Sam Coates, Ms Badenoch said: \"Loads of other parties just tell people what they think they want to hear. \"We think through and make sure that we are providing a credible plan that can be delivered. \"A lot of people have lost trust in politics because politicians make promises and do deliver.\" Read more:Some local elections delayed by a yearBadenoch says net zero goal 'impossible  'This is not a protest vote' But the Tory leader acknowledged the party faces \"a challenge on the right\", which she said was partly down to its record in government in recent years. \"The protest votes are going to Reform,\" she said. \"But at the end of the day, this is not a protest vote - these are local elections.\" The Tory leader instead urged people to vote for who will sort out bin collections, fix potholes and run local services well - which she said would be the Conservatives. She unveiled the slogan for her party's campaign as \"lower taxes, better services\". 👉Listen to Politics at Sam and Anne's on your podcast app👈 Mr Farage described that as \"comical\", saying the Tories' track record was of \"higher taxes and crumbling services\". The Reform leader is eyeing big gains in May, and said: \"After decades of mismanagement, Conservative councils across the country are buckling under the pressure.\" Lib Dem deputy leader Daisy Cooper said Ms Badenoch's speech was a \"desperate attempt to shore up the crumbling Conservative vote as people in the home counties turn to the Liberal Democrats\". She said her party is focusing on the cost of living, river sewage, and the NHS and social care."
    },
    {
        "title": "New rules may stop Elon Musk from making unlimited donations to Reform UK",
        "description": "Ministers are drawing up plans restricting foreign donors from giving unlimited funds to UK political parties, Sky News understands.",
        "url": "https://news.sky.com/story/foreign-donations-to-uk-political-parties-set-to-be-restricted-amid-rumours-elon-musk-is-planning-to-give-16380m-to-reform-13328570",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-nigel-farage-elon-musk_6786355.jpg?20250103182940",
        "type": "Politics",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-03-20 01:50:00",
        "Headline": "Officials are said to be anxious about the rumoured donation of $100m (around £80m) that Elon Musk has suggested he would make to Reform UK.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  Ministers are drawing up plans restricting foreign donors from giving unlimited funds to UK political parties, Sky News understands. Currently, political parties can accept donations from any company registered in the UK - and foreign donors can and have used these companies to make indirect contributions. The rules allow for British companies to be used in this way even if they don't make any money at all. However, Sky News understands that officials are currently looking at restricting donations based on how much money a company makes - either using a profit or a share of revenue to calculate a potential cap for the amount each UK business can give. The government says this is in line with its manifesto pledge to \"protect democracy by strengthening the rules around donations to political parties\". Senior government sources have told Sky News these changes are partially about Elon Musk. Officials are said to be anxious about the rumoured donation of $100m (about £80m) that Musk has suggested he would make to Reform UK. \n                  Starmer defends 'vital' benefit cuts - as he cites cases of his late mother and brother\n                 \n                  Labour not a party of the right despite big cuts, minister insists\n                 \n                  Labour MP condemns his party's 'devastating' benefit cuts\n                  The government's thinking is that the tech billionaire is likely to do this just before the next election, and they hope they can pass their Elections Bill - the legislation through which the donation loophole would be closed - through parliament before that happens. The bill would enter parliament in the next session, but ministers have told MPs that they should expect an update to these plans within months. Westminster Accounts: Search for your MP here Musk's donation would be an astronomical amount in the context of British politics. The sum would trump all political donations that have been made to any political party this year - and would inevitably make a big impact on campaigning. Elon Musk is not on the electoral register and the British arm of his company X - X.AI London Limited - has not yet made any money. Under the proposed changes, this avenue of donating money to Reform UK would not be possible. A government source said this is just one of the options on the table, adding that another change they are considering will mean enhanced due diligence checks on donations from unincorporated associations. In exclusive polling, Sky News has found that any money given to parties by foreign donors is incredibly unpopular. Read more:Benefit cuts 'will make people worse off', says MPPM wants Netflix drama shown in schools A total of 77% of respondents thought foreign nationals who are not registered to vote in the UK should not be allowed to donate to political parties, while only 7% thought they should be. Even looking specifically at Reform UK voters, who would likely benefit from a Musk donation, the percentage is roughly the same: 73% said they shouldn't donate to British politics at all, while 7% said they should. There is a lot of cash swirling all around Westminster and foreign money can and does enter UK politics. Transparency International found almost £1 in every £10 donated to parties and politicians came from unknown or dubious sources between 2001 and 2024. Whatever the motivation, these changes could bring greater transparency to what's behind any murky money swirling into Westminster. A Ministry for Housing, Communities and Local Government spokesperson said: \"As set out the in the manifesto, we will protect our democracy by strengthening the rules around donations to political parties, including enhanced safeguards against foreign donations. \"We have set out the Governments immediate priorities in delivering for the Plan for Change, at the Kings Speech.\""
    },
    {
        "title": "Adolescence writers invited to parliament to discuss show's themes with MPs, Sky News understands",
        "description": "The creators of Netflix drama Adolescence have been invited to parliament to discuss online safety with MPs, Sky News understands. ",
        "url": "https://news.sky.com/story/adolescence-writers-invited-to-parliament-to-discuss-shows-themes-with-mps-sky-news-understands-13332399",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-adolescence-stephen-graham_6862012.jpg?20250320112451",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-03-20 09:24:00",
        "Headline": "It comes after Sir Keir Starmer gave his backing for the Netflix drama to be shown in schools and parliament, as the government faces calls to do more to tackle the extreme content being served up to young people on social media.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  The creators of Netflix drama Adolescence have been invited to parliament to discuss online safety with MPs, Sky News understands.  Labour's Josh MacAlister has been in touch with representatives of actor Stephen Graham and his co-writer Jack Thorne about the possibility of a meeting, it is understood. Politics live: PM gathers military figures MPs are keen to discuss themes raised in the chart-topping show, which centres on a 13-year-old boy arrested for the murder of a young girl and the rise of incel culture. It arrived amid mounting concern over violent and sexist social media content being served up to teenagers, and calls for the government to get tough on tech firms. Graham and Thorne have expressed a desire for the series to be shown in schools and parliament to start a conversation about how to better protect children. PM wants to tackle 'abhorrent' trend Sir Keir Starmer gave that campaign his backing yesterday, revealing at PMQs he had been watching the drama with his teenage children. \"This violence carried out by young men, influenced by what they see online, is a real problem,\" he said. \"It's abhorrent, and we have to tackle it.\" Culture Secretary Lisa Nandy told Sky News the issues raised in Adolescence were ones the government should be \"acutely aware of\". And Labour MP Johnathan Brash, who has an eight-year-old boy, said he would back showing parts of the show to primary school children so they can learn about the harms of social media before they start using it. 👉 Listen to Sky News Daily on your podcast app 👈 Mr MacAlister is the MP behind the safer phones legislation, which aimed to stop children \"doom-scrolling\" by raising the age of consent to use social media from 13 to 16. However, his private members bill (PMB) had to be watered down to get government support - as PMBs don't usually pass without it. Read more:How incel culture influenced new Netflix show  Call for social media age of consent to be raised In an interview with BBC Newsnight on Wednesday, Thorne said he hoped the debate sparked by Adolescence could \"provoke\" the government into change. He pointed out Australia is set to enforce a social media ban for young children, making platforms liable for fines of up to A$50m (£25m) if they don't prevent those younger than 16 from holding accounts. The Online Safety Act, which is being implemented this year, is intended to protect young people from illegal and harmful content with fines for platforms who break the rules coming in this summer. However, MPs from across the political spectrum want further action to tackle the amount of time children spend on their smartphones. Sky News has learnt a group of around 25 Labour MPs keen for tougher action on online safety are due to hold their first meeting next week The Tories want the government to force teachers to ban smartphones from schools, with shadow education secretary Laura Trott telling Sky News she is so concerned she won't allow her children to have one."
    },
    {
        "title": "David Lammy rows back on claim Israel breaching international law with Gaza aid blockade",
        "description": "The foreign secretary has said it is \"difficult to see\" how Israel denying aid to Gaza can be compatible with international law. ",
        "url": "https://news.sky.com/story/david-lammy-rows-back-on-claim-israel-breaching-international-law-with-gaza-aid-blockade-13332509",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-gaza-khan-younis_6861825.jpg?20250320081224",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-03-20 12:07:00",
        "Headline": "Since early March, Israel has cut off all food, medicine, fuel, electricity and other supplies to Gaza's population, and more recently has resumed deadly air strikes.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  The foreign secretary has said it is \"difficult to see\" how Israel denying aid to Gaza can be compatible with international law.  The remarks in the Commons row back on stronger language used on Monday, when David Lammy said the ongoing blockade of goods and supplies was a \"breach of international law\". Politics live: Protesters get into House of Lords As a cabinet minister, Mr Lammy speaks for the government, but his assertion sparked confusion as the next day Downing Street said it is for an international court to decide if the law has been broken. It said the government's position is Israel is \"at risk\" of doing so. The Labour Muslim Network described the \"row back\" as \"shocking and disgraceful\". Mr Lammy told the Commons he \"could have been clearer\" with his initial remarks, and \"our position remains that Israel's actions in Gaza are a clear risk of breaching international humanitarian law\". He said \"ultimately these are matters for the courts\", but added: \"It's difficult to see how denying humanitarian assistance to a civilian population can be compatible with international humanitarian law.\" 'The deadliest day since the war began' Since 2 March, Israel has cut off all food, medicine, fuel, electricity and other supplies to Gaza's population of around two million people, to pressure Hamas to accept a new proposal ahead of a second phase of ceasefire. The first phase was struck in January, but the fragile peace agreement was shattered on Tuesday when Israel began a fresh wave of air strikes. Israel has also launched a \"limited ground operation\" to retake part of a key corridor in Gaza. In the Commons, Mr Lammy said a British aid worker was wounded in a strike on a UN compound in Gaza. He noted 18 March appears to have been \"the deadliest single day for Palestinians since the war began\". The Hamas-run Gaza health ministry reported at least 436 people have been killed since Tuesday - the majority being women and children. Israel has denied being behind the strike on the UN facility, which also killed a worker from Bulgaria. It has also disputed the overall fatality figures. Read more:What happened to the Israel-Hamas ceasefire?  'More bloodshed in no one's interest' The foreign secretary stressed the government \"strongly opposes Israel's resumption of hostilities\" and the \"appalling loss of life\" it has led to. He said: \"We urgently want to see a return to a ceasefire. More bloodshed is in no one's interest, Hamas must release all the hostages and negotiations must resume.\" The IDF claims it only targets militants and blames civilian deaths on Hamas because it operates in densely populated areas. Gaza's health ministry records do not distinguish between civilians and combatants. At PMQs on Wednesday, Sir Keir Starmer said he is \"deeply concerned\" about the renewed fighting and urged both sides to respect international law.  The war in Gaza began after Hamas militants carried out a cross-border raid into southern Israel on 7 October 2023, killing 1,200 people and capturing around 250 hostages, according to Israeli officials. Israel responded by launching an air and ground offensive in Gaza which has killed more than 48,000 Palestinians, say Gaza health officials."
    },
    {
        "title": "Badenoch v Farage: I'm A Celeb slapdown ",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>    ",
        "url": "https://news.sky.com/story/badenoch-v-farage-im-a-celeb-slapdown-13332311",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-20 07:42:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈  Sky News' Sam Coates and Politico's Anne McElvoy present their guide to the day ahead in British politics. As Kemi Badenoch launches her local election campaign, is Nigel Farage right, would a stint on I'm A Celebrity help the Tories' chances?And, why Keir Starmer is continuing to market himself as the securocrat PM."
    },
    {
        "title": "US attorney general threatens 20-year jail sentences for damaging Elon Musk's Tesla cars",
        "description": "The US attorney general has said three people alleged to have damaged Tesla cars and charging stations could be jailed for up to 20 years.",
        "url": "https://news.sky.com/story/us-attorney-general-threatens-20-year-jail-sentences-for-damaging-elon-musks-tesla-cars-13332767",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tesla-elon-musk-vandalism_6862557.jpg?20250320202600",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-20 20:08:00",
        "Headline": "Cars and charging stations associated with Elon Musk's company have been targeted in recent weeks. Meanwhile, on Thursday, almost all Cybertrucks were recalled due to a \"dangerous road hazard\".",
        "Content": "The US attorney general has said three people alleged to have damaged Tesla cars and charging stations could be jailed for up to 20 years. Pamela Bondi announced unspecified charges against three people who used Molotov cocktails in what she called a \"wave of domestic terrorism\". It comes as US safety regulators recalled almost all Cybertrucks from Elon Musk's company due to a \"dangerous road hazard\" that increases the risk of a crash. It is the eighth recall of the Tesla vehicle for safety problems in 15 months. The National Highway Traffic Safety Administration's recall, which covers more than 46,000 Cybertrucks, warned that an exterior panel that runs along the left and right sides of the windshield can detach while driving. In a statement on the three people charged with damaging Tesla cars and charging stations, Ms Bondi said: \"The days of committing crimes without consequence have ended. \"Let this be a warning: if you join this wave of domestic terrorism against Tesla properties, the Department of Justice will put you behind bars.\" \n                  Conor McGregor says he wants to be Ireland's next president\n                 \n                  Donald Trump signs order to dismantle US department of education\n                 \n                  Moments sport acted as tool of diplomacy - as Donald Trump and Vladimir Putin discuss hockey match \n                  The department said one of those arrested threw eight Molotov cocktails at a Tesla dealership in Salem, Oregon. This defendant was also armed with a suppressed AR-15 rifle. Another is alleged to have attempted to set on fire Tesla cars using Molotov cocktails in Loveland, Colorado, and was later found in possession of materials used to produce additional incendiary weapons. The third person wrote \"profane messages against President Trump\" around Tesla charging stations before setting stations on fire with petrol bombs in Charleston, South Carolina, the department said. Each of the three people arrested faces charges carrying a minimum penalty of five years, and up to 20 years in prison, the statement added. Read more:What's gone wrong at Tesla?Tesla investor calls for Elon Musk to step down Tesla showrooms, charging stations and privately-owned cars have been repeatedly targeted since the billionaire was appointed by Donald Trump to oversee a new Department of Government Efficiency (DOGE) that is slashing US government spending. As well as the attacks and recalls, Tesla has been struggling due to increased competition from rival electric vehicles, particularly out of China. Though largely unaffected by Thursday's recall announcement, Tesla shares have plummeted 42% in 2025."
    },
    {
        "title": "Race to clean up billions of plastic 'nurdles' that washed up in UK after tanker crash",
        "description": "Clean-up teams are in a race against time to remove billions of plastic pellets that are building up on England's east coast before they are washed back out to sea.",
        "url": "https://news.sky.com/story/race-to-clean-up-billions-of-plastic-nurdles-that-washed-up-in-uk-after-tanker-crash-13332695",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-norfolk-holme-beach_6862430.jpg?20250320174620",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-03-20 17:23:00",
        "Headline": "Jim Scott, the operations manager at Titchwell Marsh RSPB reserve, said birds are likely to mistake the pellets for fish eggs.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Clean-up teams are in a race against time to remove billions of plastic pellets that are building up on England's east coast before they are washed back out to sea. The pellets - called nurdles - were spilled from containers on board a ship that collided with a tanker off the coast of Grimsby a little over a week ago. Strong winds have blown the plastic pieces - about the size of a lentil - 50 miles south and they're now being scattered on the nature-critical beaches of Norfolk and Lincolnshire. We walked for a mile along the coast near the village of Titchwell in north Norfolk. What should be pristine sand now has a line of pellets left behind by the tide. It takes a while to see them against the natural debris of seaweed and shells. But once you get your eye in, the sheer number brings home the scale of the environmental disaster. Some are small semi-translucent balls, the \"raw\" plastic that is later moulded into everyday items. \n                  Fear seabirds might choke on tiny plastic pellets 'likely' to have come from North Sea crash\n                 \n                  North Sea ship crash: Crew of US oil tanker praised as 'heroic'\n                 \n                  Russian captain of ship in North Sea crash appears in court\n                 Others have been charred by the intense fire that followed the collision. But we also found clumps of blackened pellets that had melted together in the heat. One was two metres across, the size of a family dining table. The top looked like molten lava. But underneath you could see the hundreds of thousands of pellets that made up its rock-hard bulk. It gave off a pungent smell, similar to tar or asphalt used on a newly-laid road. Jim Scott, the operations manager at Titchwell Marsh RSPB reserve on the Norfolk coast, said birds are likely to mistake the pellets for fish eggs. \"The fear there is that birds are coming along and potentially eating those,\" he told Sky News. \"There's also the fact that as time goes on, those nurdles will degrade into smaller bits and they'll get into the food chain via plankton and then work their way up. \"And indeed we are part of food chain as well, so it's absolutely an issue for us.\" The public is being warned not to touch the pellets in case they are covered in toxic chemicals. But West Norfolk Borough Council has organised professional clean up teams to remove as much plastic as possible before higher spring tides, expected in the next few days. Large clumps are being removed by all-terrain vehicles, while vacuums and sieves are being used to clear up individual pellets. Read more from Sky News:Happiest country in the world revealedThree quarters of a million pieces of rubbish found on UK beachesNASA reveals what's next for returned astronauts But the coastline is so long - and the tidal salt marshes behind the beaches so inaccessible - that many will inevitably be left behind. Plastic pellets can now be found on shorelines around the world. According to the environmental charity Fidra almost 450,000 tonnes are spilled from the plastic supply chain every year. That's enough to make 29 billion plastic bottles. Megan Kirton, senior project officer at Fidra, said the industry must do more to stop spills - such as keeping containers of pellets below deck so they can't be released into the sea. \"It's not just in huge spills that these nurdles are getting into the environment,\" she said. \"It's the everyday handling of nurdles because the plastic supply chain is so big and because they travel so many miles, so they're leaking out of every step. \"This really needs to be better regulated to prevent that.\""
    },
    {
        "title": "Happiest country in the world revealed - and one where a stranger's most likely to return a lost wallet",
        "description": "Strangers are about twice as kind as people think, according to a UN-backed report on global happiness.",
        "url": "https://news.sky.com/story/strangers-twice-as-kind-as-people-think-study-finds-13332431",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-happiness-report_6861955.jpg?20250320101457",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-20 10:04:00",
        "Headline": "Believing in the kindness of strangers also had a much bigger impact on happiness than previously thought.",
        "Content": "Strangers are about twice as kind as people think, according to a UN-backed report on global happiness. Researchers for the World Happiness Report used lost wallets as an experiment to measure people's expectations versus reality when it came to the kindness of strangers. They found that people returned lost wallets at double the rate members of the public thought they would. Believing in the kindness of strangers also had a much bigger impact on happiness than previously thought. It even had a bigger impact on happiness than actual or expected harm. \"The wallet data are so convincing because they confirm that people are much happier living where they think people care about each other,\" said John F Helliwell, an economist at the University of British Columbia and a founding editor of the World Happiness Report. \"The wallet dropping experiments confirm the reality of these perceptions, even if they are everywhere too pessimistic.\" \n                  Nottingham attacks wouldn't have happened if authorities had listened, says family of man killed months earlier\n                 \n                  Autistic teen says he was left feeling 'inhuman' after being rejected by NHS mental health services\n                 \n                  Liam Payne's girlfriend Kate Cassidy says she is 'still working on accepting' his death\n                 Nordic nations topped the ranking of the world's happiest countries but also ranked the highest for expected and actual return of lost wallets. Read more:Oldest living Olympic medallist diesEliasch warns LA to prepare better for climate crises The UK ranked 23rd out of 147 countries and recorded its lowest average score since reporting began in 2017. The report suggested that declining happiness and social trust in the US and parts of Europe may explain the rise of political polarisation and anti-system votes. The United States fell to its lowest happiness ranking ever, coming in 24th. Researchers suggested this was partly due to a rise in the number of Americans eating their meals alone. While sharing meals with other people is strongly linked with wellbeing around the world, the number of people dining alone in America has increased 53% over the past two decades. \"The findings in this year's World Happiness Report reconfirm a fundamental truth: happiness is rooted in trust, kindness, and social connection,\" said Jeffrey D Sachs, president of the UN Sustainable Development Solutions Network who was a founding editor of the report. \"It is up to us as virtuous individuals and citizens to translate this vital truth into positive action, thereby fostering peace, civility, and wellbeing in communities worldwide.\""
    },
    {
        "title": "Actress 'shell-shocked' when asked to 'bend further' while filming with Noel Clarke, court hears",
        "description": "An actress who worked in a film directed by Noel Clarke said she felt \"shell-shocked\" when he asked her to \"bend over further\" during a scene where she was naked from the waist down, the High Court has heard.",
        "url": "https://news.sky.com/story/actress-shell-shocked-when-asked-to-bend-further-while-filming-with-noel-clarke-court-hears-13332602",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-noel-clarke-royal-courts-of-justice_6846830.jpg?20250305104132",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-20 14:30:00",
        "Headline": "An actress who worked in a production with Noel Clarke gave evidence at the High Court in London as part of his legal suit against the publisher of the Guardian. He denies allegations of misconduct.",
        "Content": "An actress who worked in a film directed by Noel Clarke said she felt \"shell-shocked\" when he asked her to \"bend over further\" during a scene where she was naked from the waist down, the High Court has heard. The woman, known only as Mila, gave evidence on Thursday in Clarke's legal case against Guardian News and Media (GNM). Mila told the court that although she felt uncomfortable about filming the nude scene, she needed the work. In her witness statement, she said: \"Noel was telling me to bend over, repeating things like 'bend over further, come on', and 'do it properly'. \"I was clearly very uncomfortable and resisting doing this, I was doing the strip tease as requested and this extra request did not feel necessary. \"He repeated these comments until I bent over further and further until I was bent completely over with my bum in the air.\" Read more from Sky News:How has Trump - the 'dealmaker' - done on foreign policy?Jack Draper: The 6ft 4in British left-hander with tennis in his blood Mila added that she felt \"hugely embarrassed, blindsided and shell shocked\" by the filming. Mila also said that while Clarke's tone \"might have sounded jovial to some, it was very persistent\". Philip Williams, for Clarke, asked her: \"Noel's tone was encouraging and jovial, that is why you put it in, because others knew it was jovial.\" Mila replied: \"He was masking his persistent direction. \"If he had been aggressive, or really, really shouting at me, that would have been hard to get away with.\" Clarke, 49, is suing the publisher of the Guardian newspaper over seven articles and a podcast, including an article in April 2021 that said 20 women who knew him professionally had come forward with allegations of misconduct. He denies the allegations, while GNM is defending its reporting as being both true and in the public interest. In Mila's witness statement, she said she later worked on another project with Clarke, but this had no sex scenes. Some time after this she received a message from Clarke \"out of the blue\", asking if they could speak, she said. Mila said that during the call he asked her if they \"were cool\" in relation to the first film they worked on. The actress said in her statement: \"I told him that I was not ok with it and that I had felt very uncomfortable at various points and that I would not let something like that happen to me again. \"Noel said he was sorry if he had made me feel uncomfortable. \"He was talking about how becoming a father had made him reflect and that he wanted to raise his sons to be upstanding young men. He said he was ringing round people to apologise.\" She added that he seemed \"panicked\" on the call, and it seemed to her that \"his purpose was either fishing to see whether I was unhappy about his treatment of me on the film, or he was trying to cover his tracks in some way\". Clarke's denial Clarke denies the allegations Mila has made, and in his witness statement, said: \"The reiteration of the scene is highly distorted and exaggerated. \"This scene was not filmed to procure any kind of personal or sexual gratification, nor was that ever the intention.\" He added: \"I did not comment in the way pleaded, and did not ask Mila to bend over in any way which made her uncomfortable, or in a way which was not true to the script.\" In relation to the phone call, Clarke said he got in contact with Mila after being made aware of comments she had made about her experience filming the nude scene. He added: \"I apologised for any hardship she may have felt or if, in retrospect, Mila felt uncomfortable. \"I confirmed that no untoward behaviour had been engaged in, and reassured her that protocol had been followed by the crew at all times. \"Mila accepted my apology, admitting that in retrospect, she had changed her mind about her involvement in the scene, and felt uncomfortable taking part in an explicit scene.\" The hearing before Mrs Justice Steyn is due to conclude in April, with a decision expected in writing at a later date."
    },
    {
        "title": "Unreleased Eminem music stolen and sold online - man charged",
        "description": "A former studio engineer has been charged with stealing Eminem's unreleased music and selling it online.",
        "url": "https://news.sky.com/story/former-eminem-studio-engineer-charged-with-stealing-and-leaking-unreleased-music-13332289",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-eminem-music-detroit_6861729.jpg?20250320031853",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-20 02:59:00",
        "Headline": "FBI prosecutors say more than 25 of Eminem's unfinished songs have been played or distributed online without consent. Joseph Strange, 46, was charged with copyright infringement and interstate transportation of stolen goods.",
        "Content": "A former studio engineer has been charged with stealing Eminem's unreleased music and selling it online. FBI prosecutors say more than 25 songs from the Detroit rapper have been played or distributed online without his or Interscope Capital Labels Group's consent. A federal affidavit said Joseph Strange, a 46-year-old from Michigan, was charged via a criminal complaint with copyright infringement and interstate transportation of stolen goods. Acting US Attorney Julie Beck in Detroit said the man, who lost his job at Eminem's studio in 2021, could face up to 15 years in prison if convicted of both counts. He denies the charges. The affidavit said the music stored on password-protected hard drives kept in a safe at Eminem's studio in Ferndale, a Detroit suburb. Studio employees reported the theft to the FBI in January this year, saying unreleased music still in development was live on various websites such as Reddit and YouTube. A review found files were transferred from a hard drive in a safe to an external hard drive in October 2019 and January 2020, when Strange was a sound engineer at the studio. \n                  Eminem's mother, Debbie Nelson, dies aged 69\n                 \n                  US election: The celebrities backing Donald Trump or Kamala Harris\n                 \n                  Eminem to become a grandfather after daughter Hailie Jade confirms pregnancy\n                 Investigators also found buyers after Eminem's business associate Fred Nassar posted an online warning to fans not to distribute the music. A Canadian resident who used the screen name Doja Rat told investigators he had purchased 25 unreleased songs from Strange for about $50,000 (£38,435) in Bitcoin. Doja Rat added he raised the money from a group of fans of the Lose Yourself star, and added Strange was trying to sell some of Eminem's handwritten lyric sheets. The affidavit added another group of fans, organised by someone in Connecticut using the screen name ATL, also purchased a \"couple\" of songs from Strange for about $1,000 (£768.70). Read more:Stalker who 'terrified' Cheryl jailedYung Filly denies sexual assault charges In a statement, Strange's attorney Wade Fink his client is a married father of two \"with decades of dedication to the music industry\". He called the charges \"untested allegations\" that haven't been vetted by a grand jury or a judge, adding: \"We will handle the matter in a courtroom and we have great faith in the judges of our district.\""
    }
]