[
    {
        "title": "Prison release mistakes 'symptom of system close to breaking point', says prisons inspector",
        "description": "The chief inspector of prisons has said the recent spate of prisoners being released too early is \"a symptom of a system that is close to breaking point\".&#160;",
        "url": "https://news.sky.com/story/prison-release-mistakes-symptom-of-system-close-to-breaking-point-says-prisons-inspector-13466917",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-brahim-kaddour-cherif_7074685.jpg?20251107123316",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-08 19:32:00",
        "Headline": "Charlie Taylor blames \"overcomplicated\" sentencing rules, driven by successive governments' responses to the prison overcrowding crisis, for the growing number of \"embarrassing and potentially dangerous\" mistaken early releases.",
        "Content": "The chief inspector of prisons has said the recent spate of prisoners being released too early is \"a symptom of a system that is close to breaking point\".  Charlie Taylor's assessment comes as it is revealed that two prisoners wrongly released last year are still at large, as are two others believed to have been freed in error in June this year. Writing in The Daily Telegraph, Mr Taylor said the growing number of mistaken early releases was \"embarrassing and potentially dangerous\". He also put it down to \"an overcomplicated sentencing framework\" and described it as \"a symptom of a system that is close to breaking point\". He said prison inspections \"repeatedly highlight the failure to keep prisons secure, safe and decent, and to provide the sort of activity that will help inmates get work on release\". In his opinion piece, the chief inspector pointed to successive governments' responses to the overcrowding crisis in the system, which put pressure on \"junior prison staff who repeatedly had to recalculate every prisoner's release date\". These calculations, he wrote, had been made harder by a series of early-release schemes brought in by successive governments. The changes, he said, \"increase the likelihood of mistakes and in three years the number of releases in error has gone up from around 50 a year to 262\".  It comes as ministers face mounting pressure over a series of high-profile manhunts, with Justice Secretary David Lammy admitting on Friday there is a \"mountain to climb\" to tackle the crisis in the prison system. Algerian sex offender Brahim Kaddour-Cherif, 24, was arrested on Friday after a police search following his release from HMP Wandsworth in south London last week, which Scotland Yard said officers only found out about on Tuesday. His recapture was partly down to investigative work by Sky's national correspondent, Tom Parmenter, who tracked Kaddour-Cherif down to Finsbury Park in north London before he handed himself in to police. Convicted fraudster Billy Smith, 35, handed himself back in on Thursday after being accidentally freed from the same jail on Monday. Read more on early release crisis:How a cup of coffee led Sky News to a sex offender on the runWrongly-released prisoner's angry reaction'I'm glad sex offender arrested'Convicted fraudster recaptured It follows the mistaken release of Hadush Kebatu, who was convicted of sexually assaulting a 14-year-old girl and a woman while living in an asylum hotel. The incidents sparked protests in Epping, Essex. Prison security checks have been toughened and an independent investigation into mistaken releases launched after the now-deported Ethiopian national was accidentally freed from HMP Chelmsford on 24 October. A total of 262 inmates were mistakenly let out in the year to March 2025 - a 128% increase on the 115 in the previous 12 months, according to the latest official figures. Of the total, 90 releases in error were of violent or sex offenders. Kaddour-Cherif was serving a sentence for trespass with intent to steal, but had previously been convicted for indecent exposure. He is understood to have overstayed his visitor's visa to the UK after arriving in 2019, and was in the process of being deported. Asked about the four missing prisoners on Friday, shadow justice secretary Robert Jenrick said: \"The chaos continues. The government keeps putting the British people at risk and is relentlessly failing victims. Does anyone have confidence in David Lammy?\" Mr Lammy said on Friday: \"We inherited a prison system in crisis, and I'm appalled at the rate of releases in error this is causing. \"I'm determined to grip this problem, but there is a mountain to climb which cannot be done overnight.  A Ministry of Justice spokesperson said releases in error \"have been increasing for several years and are another symptom of a justice system crisis inherited by this government\". In a statement on Saturday, the ministry said it has introduced \"mandatory, stronger prisoner release checks to keep our streets safe and protect the public as well as investing record amounts into our courts - including to improve operational assurance. \"We're also investing billions, reforming sentencing and building the prison places needed to keep the public safe.\""
    },
    {
        "title": "Family of Kenyan woman allegedly murdered by British soldier welcome extradition proceedings",
        "description": "The family of a Kenyan woman allegedly murdered by a British soldier have told Sky News they are \"very happy\" that extradition proceedings against him have begun.",
        "url": "https://news.sky.com/story/family-of-kenyan-woman-allegedly-murdered-by-british-soldier-welcome-extradition-proceedings-13466731",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-agnes-wanjiru-kenya_7049490.jpg?20251013061155",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-08 17:33:00",
        "Headline": "Relatives say they are \"very happy\" after suspect Robert James Purkiss appeared in court on Friday. He denies killing Agnes Wanjiru, 21, in Kenya in 2012.",
        "Content": " The family of a Kenyan woman allegedly murdered by a British soldier have told Sky News they are \"very happy\" that extradition proceedings against him have begun. Robert James Purkiss, 38, appeared at Westminster Magistrates' Court on Friday amid efforts by Kenyan prosecutors to bring him to Africa for a trial. He is accused of murdering 21-year-old Agnes Wanjiru in the town of Nanyuki, Kenya, in 2012. Her body was found in a septic tank two months after she went missing. A post-mortem examination identified a 2cm stab wound to the lower abdomen and a collapsed lung. The court heard on Friday that Purkiss allegedly confessed to the killing, telling a colleague that \"it was sex that went wrong\". However, his lawyer, David Josse KC, said the former soldier \"vehemently\" denied the charge and he did not consent to extradition. Esther Njoki, who is Ms Wanjiru's niece and a spokesperson for the family, said they were \"very happy\" that proceedings had got under way. Ms Njoki told Sky News correspondent Charlotte Leeming: \"I don't think at any time we have ever thought that he would ever get arrested. But seeing that things now are changing, we are very happy.\" Read more from Sky News:Woman stabbed in neck in 'unprovoked attack'Davina McCall reveals cancer diagnosisMan charged with stealing luggage from airport At Friday's hearing, Purkiss was remanded in custody and will appear in court again on 14 November as the proceedings continue. Ms Njoki told Sky News it had been a \"long journey\" to get to this point and that sometimes the family had felt like giving up. But she added: \"Seeing Agnes' daughter, who survived her, we had to take up that fight and to fight for her... \"I'm not doing this just for Agnes, but even for other generations to come.\"  Ms Njoki described her maternal aunt as \"lively\" and \"an extrovert,\" adding: \"We always miss her presence here, because we knew that when she was around, you're safe, and also she used to take care of us. That is the reason why I took up this role, because she took care of me.\" She vowed to continue fighting for justice, saying: \"This is just the beginning of the long process that is ahead of us... \"We have waited for far too long, 13 years, and we don't know how long the extradition process may take.\" Ms Njoki added: \"As a family, we are still grieving, especially because of the frustrations that we get, that's what makes us feel sad and even grieve more, because we are here to get peace. \"Because as long as justice has not been served, there's no peace.\""
    },
    {
        "title": "Explosives and weapons seized - with 71 arrests - as Syria launches clampdown on Islamic State cells ",
        "description": "Syria has carried out pre-emptive operations targeting Islamic State cells - arresting 71 people during 61 raids.",
        "url": "https://news.sky.com/story/explosives-and-weapons-seized-with-71-arrests-as-syria-launches-clampdown-on-islamic-state-cells-13467061",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-syrian-ministry_7076567.jpg?20251108232821",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-08 23:13:00",
        "Headline": "The raids come as Syrian President Ahmed al Sharaa travels to Washington for a meeting with Donald Trump, where he will join a coalition against IS.",
        "Content": "Syria has carried out pre-emptive operations targeting Islamic State cells - arresting 71 people during 61 raids. Explosives and weapons were seized, with the interior ministry revealing they were working on \"precise\" intelligence information. \"Many\" of those detained were wanted criminals, with forces obtaining evidence that linked them to terrorist activities. A statement added that the operation was part of \"ongoing national efforts to combat terrorism and confront plots targeting the country's security and citizens\". The raids come as Syrian President Ahmed al Sharaa travels to Washington for a meeting with Donald Trump, where he will join a coalition against IS. Meanwhile, the US is preparing to establish a military presence in Damascus to enable a security pact that is being brokered between Syria and Israel. According to the Syrian Arab News Agency, officials intercepted information that suggested Islamic State was planning to launch new attacks. \n                  Historic al Nuri mosque reopens eight years after it was destroyed by IS\n                 \n                  Hunting for ISIS: Inside the caves at heart of expanding terror network\n                 \n                  'I don't regret anything,' smiling ISIS militant on death row tells Sky News\n                 Interior ministry spokesman Nour al Din al Baba told al Ekhbariya: \"The current major threat lies in IS' attempts to reconstitute itself and recruit new members, particularly among the youth.\" Former president Bashar al Assad was ousted late last year after 25 years in power and fled to Russia after his regime came to an end. Since then, al Sharaa's transitional administration has been attempting to restore security, introduce economic reforms, and cooperate with international partners. Read more from Sky News:UK looking at Denmark model to cut illegal migrationJeremy Clarkson leads tributes to former Top Gear co-star On Friday, the UK and US removed sanctions against al Sharaa - following in the footsteps of the UN Security Council. The State Department said this was \"in recognition of the progress demonstrated by the Syrian leadership\", including work to counter narcotics and eliminate chemical weapons. Al Sharaa had faced a travel ban, asset freeze and an arms embargo for well over a decade because he was previously affiliated with al Qaeda."
    },
    {
        "title": "King, Princess of Wales, and Prince George attend Festival of Remembrance - with Sir Rod Stewart among performers",
        "description": "The King and Prime Minister are among the guests attending the Royal British Legion's Festival of&#160;Remembrance this evening.",
        "url": "https://news.sky.com/story/king-princess-of-wales-and-prince-george-attend-festival-of160remembrance-with-sir-rod-stewart-among-performers-13466869",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-festival-of-remembrance_7076312.jpg?20251108192440",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-08 19:15:00",
        "Headline": "The event at London's Royal Albert Hall marks the 80th anniversary of the end of the Second World War and the 25th anniversary of the government lifting the ban on gay, lesbian and bisexual personnel in the armed forces.",
        "Content": " The King and Prime Minister are among the guests attending the Royal British Legion's Festival of Remembrance this evening. The Princess of Wales and Prince George are also attending the event at London's Royal Albert Hall. The entertainers on the bill include Sir Rod Stewart, Sam Ryder and Keala Settle, along with performances by the Central Band of the RAF, the RAF Squadronaires and the Band of HM Royal Marines. Ted Lasso star Hannah Waddingham is on hosting duties for the festival, commemorating the 80th anniversary of the end of the Second World War, which takes place ahead of Remembrance Sunday tomorrow. The event is also marking the 25th anniversary of the UK government lifting the ban on gay, lesbian and bisexual personnel serving openly in the armed forces. The Princess of Wales was seen wearing a black dress adorned with a handmade poppy created out of silk, glass and other natural materials, along with earrings belonging to the late Queen. The Prince of Wales was absent as he is in Brazil for the COP30 climate summit. The King was announced as a patron of the Royal British Legion last year and will lead a two-minute silence at the National Service of Remembrance at the Cenotaph in London on Sunday."
    },
    {
        "title": "US aviation authority orders emergency ban on MD-11 flights after deadly Kentucky crash",
        "description": "US officials have issued an emergency order banning flights of the model of plane involved in a deadly crash in Kentucky last week, pending inspection.",
        "url": "https://news.sky.com/story/us-aviation-authority-orders-emergency-ban-on-md-11-flights-after-deadly-kentucky-crash-13467040",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-kentucky-plane-crash_7072499.jpg?20251105083337",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-08 21:54:00",
        "Headline": "The Federal Aviation Authority has issued an Emergency Airworthiness Directive after 14 people were killed in the disaster in Louisville last week. Three pilots were among the dead.",
        "Content": "US officials have issued an emergency order banning flights of the model of plane involved in a deadly crash in Kentucky last week, pending inspection. The Federal Aviation Administration (FAA) issued the Emergency Airworthiness Directive (AD) for McDonnell Douglas MD-11 aircraft after a UPS plane bound for Honolulu crashed on take-off in Louisville on Tuesday evening, killing 14 people. The victims included three pilots. Delivery firms UPS and FedEx had already grounded their fleets of the planes on Friday \"out of an abundance of caution and in the interest of safety\". The FAA said the order, which came following a recommendation by its manufacturer Boeing, was prompted after \"an accident where the left-hand engine and pylon detached from the airplane\".  A spokesperson for the authority added: \"The cause of the detachment is currently under investigation. This condition could result in the loss of continued safe flight and landing. \"The FAA is issuing this AD because the agency has determined the unsafe condition is likely to exist or develop in other products of the same type design. \"The AD prohibits further flight until the airplane is inspected and all applicable corrective actions are performed.\" Read more from Sky News:Man charged with stealing luggage from UK airportDavina McCall reveals cancer diagnosisWoman stabbed in neck in 'unprovoked attack' The MD-11 was first manufactured by McDonnell Douglas in 1988, until its merger with Boeing in 1997. It was once used by commercial airlines, including Finnair and KLM, as a passenger jet, but was retired in 2014, and is now used only as a freight plane. Government shutdown impacts commercial flights It came as more than 1,300 commercial flights were cancelled in the US on Saturday because of an FAA order, unrelated to the Kentucky crash, to reduce air traffic amid the ongoing government shutdown. The deadlock in Washington has resulted in shortages of air traffic control staff, who have not been paid for weeks. Officials have warned that the number of daily cancellations could rise in the coming days unless the political row is resolved."
    },
    {
        "title": "Former Top Gear and Fifth Gear presenter Quentin Willson dies",
        "description": "Former Top Gear and Fifth Gear presenter Quentin Willson has died.",
        "url": "https://news.sky.com/story/former-top-gear-and-fifth-gear-presenter-quentin-willson-dies-13466543",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-quentin-willson-top-gear_7075906.jpg?20251108161522",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-08 16:03:00",
        "Headline": "The Leicester-born motoring journalist joined the BBC in 1991 to co-host the original Top Gear alongside Jeremy Clarkson.",
        "Content": " Former Top Gear and Fifth Gear presenter Quentin Willson has died. The Leicester-born car dealer and motoring journalist joined the BBC show in 1991, appearing alongside the likes of Jeremy Clarkson and James May, until the original format was cancelled 10 years later. He then moved to Channel 5 to join its rival motoring show, Fifth Gear, and did not rejoin when Top Gear relaunched in 2002. The 68-year-old died on Saturday following a short battle with lung cancer, his family said. Clarkson was among those paying tribute on Saturday. He wrote on X: \"I'm far away so I've only just heard that Quentin Willson has died. We had some laughs over the years. Properly funny man.\" May also wrote: \"Quentin Willson gave me proper advice and encouragement during my earliest attempts at TV, back in the late 90s. I've never forgotten it. Great bloke.\" In a statement, Willson's family described him as a \"true national treasure\" who \"brought the joy of motoring, from combustion to electric, into our living rooms\". The broadcaster created and presented both Britain's Worst Drivers and The Car's The Star. He went on to perform on Strictly Come Dancing in 2004, where he continues to hold the lowest score in the show's history. Willson was also an avid \"consumer champion\", having advocated for a number of campaigns, including helping to freeze fuel duty with his FairFuel campaign. He recently worked \"tirelessly\" to make electric vehicles affordable through his FairCharge campaign, his family said. The family statement added: \"Long before it was fashionable, he championed the GM EV1 and the promise of electric cars, proving he was always ahead of the curve. \"Much-loved husband to Michaela, devoted father to Mercedes, Max and Mini, and cherished grandfather to Saskia, Xander and Roxana. \"Quentin will be deeply missed by his family, friends, and all who knew him personally and professionally. \"The void he has left can never be filled. His knowledge was not just learned but lived; a library of experience now beyond our reach.\""
    },
    {
        "title": "UK looking at Denmark model to cut illegal migration",
        "description": "The Home Office is looking at what Denmark is doing to cut illegal migration, Sky News understands.",
        "url": "https://news.sky.com/story/uk-looking-at-denmark-model-to-cut-illegal-migration-13466272",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-migrants-immigrants_7075818.jpg?20251108153112",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-08 12:16:00",
        "Headline": "Last month, Home Secretary Shabana Mahmood dispatched officials to the Nordic nation to study its border control and asylum policies, which are considered some of the toughest in Europe.",
        "Content": " The Home Office is looking at what Denmark is doing to cut illegal migration, Sky News understands. Last month, Home Secretary Shabana Mahmood dispatched officials to the Nordic nation to study its border control and asylum policies, which are considered some of the toughest in Europe. In particular, officials are understood to be looking at Denmark's tighter rules on family reunion and restricting most refugees to a temporary stay in the country. Ms Mahmood will announce a major shake-up of the UK's immigration system later this month, PA is reporting. Labour MPs are said to be split on the move. Some, in so-called Red Wall seats which are seen as vulnerable to challenge from Reform UK, want ministers to go further in the direction Denmark has taken. But others believe the policies will estrange progressive voters and push the Labour Party too far to the right. Denmark has adopted increasingly restrictive rules in order to deal with migration over the last few years. In Denmark, most asylum or refugee statuses are temporary. Residency can be revoked once a country is deemed safe. In order to achieve settlement, asylum seekers are required to be in full-time employment, and the length of time it takes to acquire those rights has been extended. Denmark also has tougher rules on family reunification - both the sponsor and their partner are required to be at least 24 years old, which the Danish government says is designed to prevent forced marriages.\n The sponsor must also not have claimed welfare for three years and must provide a financial guarantee for their partner. Both must also pass a Danish language test. In 2018, Denmark introduced what it called a ghetto package, a controversial plan to radically alter some residential areas, including by demolishing social housing. Areas with over 1,000 residents were defined as ghettos if more than 50% were \"immigrants and their descendants from non-Western countries\". In 2021, the left of centre government passed a law that allowed refugees arriving on Danish soil to be moved to asylum centres in a partner country - and subsequently agreed with Rwanda to explore setting up a program, although that has been put on hold. It comes as the government continues to struggle to get immigration under control, with rising numbers of small boat crossings in the Channel over the last few months and a migrant, deported under the UK's returns deal with France, re-entering the country. Some 648 people crossed the Channel to Britain in nine boats on Friday, according to Home Office figures, bringing the total for the year to 38,223. Read more:Mistaken prison releases 'could be opportunity' for LammyCulture secretary defended in 'cronyism' row  Ms Mahmood wants deterrents in place to stop migrants seeking to enter the country via unauthorised routes. She also wants to make it easier to remove those who are found to have no right to stay in the UK. Sources told the PA news agency she was eager to meet her Danish counterpart, Rasmus Stoklund, the country's immigration minister, at the earliest possible convenience. Speaking on BBC Radio 4, Mr Stoklund likened Danish society to \"the hobbits in The Lord Of The Rings\" and said people coming to the country who do not contribute positively would not be welcome. Mr Stoklund said: \"We are a small country. We live peacefully and quietly with each other. I guess you could compare us to the hobbits in The Lord Of The Rings.\" \"We expect people who come here to participate and contribute positively, and if they don't they aren't welcome.\" The split in Labour was apparent from public comments by MPs today. Stoke-on-Trent Central Labour MP Gareth Snell told Radio 4's Today programme that any change bringing \"fairness\" to an asylum system that his constituents \"don't trust\" was \"worth exploring\". Mike Tapp, a Home Office minister and MP for Dover and Deal, also said: \"There is nothing 'Reform-esque' about a firm, fair immigration system that isn't open to abuse.... Those who disagree continue to enable Reform.\" Read more:X and the far right: How Elon Musk compares migrants to Lord Of The Rings characters But Nottingham East MP Nadia Whittome, who is a member of the party's Socialist Campaign Group caucus, said: \"I think these are policies of the far right. I don't think anyone wants to see a Labour government flirting with them.\" Labour backbencher Clive Lewis, the MP for Norwich South, also described the proposals as the \"worst of both worlds\". Writing on X, he added: \"When a progressive party adopts the logic of its opponents - that migrants are a threat, that order must come before rights, that the state's job is to manage people rather than empower them - it doesn't neutralise the authoritarian right. It normalises it.\""
    },
    {
        "title": "Prison release mistakes 'symptom of system close to breaking point', says prisons inspector",
        "description": "The chief inspector of prisons has said the recent spate of prisoners being released too early is \"a symptom of a system that is close to breaking point\".&#160;",
        "url": "https://news.sky.com/story/prison-release-mistakes-symptom-of-system-close-to-breaking-point-says-prisons-inspector-13466917",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-brahim-kaddour-cherif_7074685.jpg?20251107123316",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-08 19:32:00",
        "Headline": "Charlie Taylor blames \"overcomplicated\" sentencing rules, driven by successive governments' responses to the prison overcrowding crisis, for the growing number of \"embarrassing and potentially dangerous\" mistaken early releases.",
        "Content": "The chief inspector of prisons has said the recent spate of prisoners being released too early is \"a symptom of a system that is close to breaking point\".  Charlie Taylor's assessment comes as it is revealed that two prisoners wrongly released last year are still at large, as are two others believed to have been freed in error in June this year. Writing in The Daily Telegraph, Mr Taylor said the growing number of mistaken early releases was \"embarrassing and potentially dangerous\". He also put it down to \"an overcomplicated sentencing framework\" and described it as \"a symptom of a system that is close to breaking point\". He said prison inspections \"repeatedly highlight the failure to keep prisons secure, safe and decent, and to provide the sort of activity that will help inmates get work on release\". In his opinion piece, the chief inspector pointed to successive governments' responses to the overcrowding crisis in the system, which put pressure on \"junior prison staff who repeatedly had to recalculate every prisoner's release date\". These calculations, he wrote, had been made harder by a series of early-release schemes brought in by successive governments. The changes, he said, \"increase the likelihood of mistakes and in three years the number of releases in error has gone up from around 50 a year to 262\".  It comes as ministers face mounting pressure over a series of high-profile manhunts, with Justice Secretary David Lammy admitting on Friday there is a \"mountain to climb\" to tackle the crisis in the prison system. Algerian sex offender Brahim Kaddour-Cherif, 24, was arrested on Friday after a police search following his release from HMP Wandsworth in south London last week, which Scotland Yard said officers only found out about on Tuesday. His recapture was partly down to investigative work by Sky's national correspondent, Tom Parmenter, who tracked Kaddour-Cherif down to Finsbury Park in north London before he handed himself in to police. Convicted fraudster Billy Smith, 35, handed himself back in on Thursday after being accidentally freed from the same jail on Monday. Read more on early release crisis:How a cup of coffee led Sky News to a sex offender on the runWrongly-released prisoner's angry reaction'I'm glad sex offender arrested'Convicted fraudster recaptured It follows the mistaken release of Hadush Kebatu, who was convicted of sexually assaulting a 14-year-old girl and a woman while living in an asylum hotel. The incidents sparked protests in Epping, Essex. Prison security checks have been toughened and an independent investigation into mistaken releases launched after the now-deported Ethiopian national was accidentally freed from HMP Chelmsford on 24 October. A total of 262 inmates were mistakenly let out in the year to March 2025 - a 128% increase on the 115 in the previous 12 months, according to the latest official figures. Of the total, 90 releases in error were of violent or sex offenders. Kaddour-Cherif was serving a sentence for trespass with intent to steal, but had previously been convicted for indecent exposure. He is understood to have overstayed his visitor's visa to the UK after arriving in 2019, and was in the process of being deported. Asked about the four missing prisoners on Friday, shadow justice secretary Robert Jenrick said: \"The chaos continues. The government keeps putting the British people at risk and is relentlessly failing victims. Does anyone have confidence in David Lammy?\" Mr Lammy said on Friday: \"We inherited a prison system in crisis, and I'm appalled at the rate of releases in error this is causing. \"I'm determined to grip this problem, but there is a mountain to climb which cannot be done overnight.  A Ministry of Justice spokesperson said releases in error \"have been increasing for several years and are another symptom of a justice system crisis inherited by this government\". In a statement on Saturday, the ministry said it has introduced \"mandatory, stronger prisoner release checks to keep our streets safe and protect the public as well as investing record amounts into our courts - including to improve operational assurance. \"We're also investing billions, reforming sentencing and building the prison places needed to keep the public safe.\""
    },
    {
        "title": "Family of Kenyan woman allegedly murdered by British soldier welcome extradition proceedings",
        "description": "The family of a Kenyan woman allegedly murdered by a British soldier have told Sky News they are \"very happy\" that extradition proceedings against him have begun.",
        "url": "https://news.sky.com/story/family-of-kenyan-woman-allegedly-murdered-by-british-soldier-welcome-extradition-proceedings-13466731",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-agnes-wanjiru-kenya_7049490.jpg?20251013061155",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-08 17:33:00",
        "Headline": "Relatives say they are \"very happy\" after suspect Robert James Purkiss appeared in court on Friday. He denies killing Agnes Wanjiru, 21, in Kenya in 2012.",
        "Content": " The family of a Kenyan woman allegedly murdered by a British soldier have told Sky News they are \"very happy\" that extradition proceedings against him have begun. Robert James Purkiss, 38, appeared at Westminster Magistrates' Court on Friday amid efforts by Kenyan prosecutors to bring him to Africa for a trial. He is accused of murdering 21-year-old Agnes Wanjiru in the town of Nanyuki, Kenya, in 2012. Her body was found in a septic tank two months after she went missing. A post-mortem examination identified a 2cm stab wound to the lower abdomen and a collapsed lung. The court heard on Friday that Purkiss allegedly confessed to the killing, telling a colleague that \"it was sex that went wrong\". However, his lawyer, David Josse KC, said the former soldier \"vehemently\" denied the charge and he did not consent to extradition. Esther Njoki, who is Ms Wanjiru's niece and a spokesperson for the family, said they were \"very happy\" that proceedings had got under way. Ms Njoki told Sky News correspondent Charlotte Leeming: \"I don't think at any time we have ever thought that he would ever get arrested. But seeing that things now are changing, we are very happy.\" Read more from Sky News:Woman stabbed in neck in 'unprovoked attack'Davina McCall reveals cancer diagnosisMan charged with stealing luggage from airport At Friday's hearing, Purkiss was remanded in custody and will appear in court again on 14 November as the proceedings continue. Ms Njoki told Sky News it had been a \"long journey\" to get to this point and that sometimes the family had felt like giving up. But she added: \"Seeing Agnes' daughter, who survived her, we had to take up that fight and to fight for her... \"I'm not doing this just for Agnes, but even for other generations to come.\"  Ms Njoki described her maternal aunt as \"lively\" and \"an extrovert,\" adding: \"We always miss her presence here, because we knew that when she was around, you're safe, and also she used to take care of us. That is the reason why I took up this role, because she took care of me.\" She vowed to continue fighting for justice, saying: \"This is just the beginning of the long process that is ahead of us... \"We have waited for far too long, 13 years, and we don't know how long the extradition process may take.\" Ms Njoki added: \"As a family, we are still grieving, especially because of the frustrations that we get, that's what makes us feel sad and even grieve more, because we are here to get peace. \"Because as long as justice has not been served, there's no peace.\""
    },
    {
        "title": "King, Princess of Wales, and Prince George attend Festival of Remembrance - with Sir Rod Stewart among performers",
        "description": "The King and Prime Minister are among the guests attending the Royal British Legion's Festival of&#160;Remembrance this evening.",
        "url": "https://news.sky.com/story/king-princess-of-wales-and-prince-george-attend-festival-of160remembrance-with-sir-rod-stewart-among-performers-13466869",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-festival-of-remembrance_7076312.jpg?20251108192440",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-08 19:15:00",
        "Headline": "The event at London's Royal Albert Hall marks the 80th anniversary of the end of the Second World War and the 25th anniversary of the government lifting the ban on gay, lesbian and bisexual personnel in the armed forces.",
        "Content": " The King and Prime Minister are among the guests attending the Royal British Legion's Festival of Remembrance this evening. The Princess of Wales and Prince George are also attending the event at London's Royal Albert Hall. The entertainers on the bill include Sir Rod Stewart, Sam Ryder and Keala Settle, along with performances by the Central Band of the RAF, the RAF Squadronaires and the Band of HM Royal Marines. Ted Lasso star Hannah Waddingham is on hosting duties for the festival, commemorating the 80th anniversary of the end of the Second World War, which takes place ahead of Remembrance Sunday tomorrow. The event is also marking the 25th anniversary of the UK government lifting the ban on gay, lesbian and bisexual personnel serving openly in the armed forces. The Princess of Wales was seen wearing a black dress adorned with a handmade poppy created out of silk, glass and other natural materials, along with earrings belonging to the late Queen. The Prince of Wales was absent as he is in Brazil for the COP30 climate summit. The King was announced as a patron of the Royal British Legion last year and will lead a two-minute silence at the National Service of Remembrance at the Cenotaph in London on Sunday."
    },
    {
        "title": "Former Top Gear and Fifth Gear presenter Quentin Willson dies",
        "description": "Former Top Gear and Fifth Gear presenter Quentin Willson has died.",
        "url": "https://news.sky.com/story/former-top-gear-and-fifth-gear-presenter-quentin-willson-dies-13466543",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-quentin-willson-top-gear_7075906.jpg?20251108161522",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-08 16:03:00",
        "Headline": "The Leicester-born motoring journalist joined the BBC in 1991 to co-host the original Top Gear alongside Jeremy Clarkson.",
        "Content": " Former Top Gear and Fifth Gear presenter Quentin Willson has died. The Leicester-born car dealer and motoring journalist joined the BBC show in 1991, appearing alongside the likes of Jeremy Clarkson and James May, until the original format was cancelled 10 years later. He then moved to Channel 5 to join its rival motoring show, Fifth Gear, and did not rejoin when Top Gear relaunched in 2002. The 68-year-old died on Saturday following a short battle with lung cancer, his family said. Clarkson was among those paying tribute on Saturday. He wrote on X: \"I'm far away so I've only just heard that Quentin Willson has died. We had some laughs over the years. Properly funny man.\" May also wrote: \"Quentin Willson gave me proper advice and encouragement during my earliest attempts at TV, back in the late 90s. I've never forgotten it. Great bloke.\" In a statement, Willson's family described him as a \"true national treasure\" who \"brought the joy of motoring, from combustion to electric, into our living rooms\". The broadcaster created and presented both Britain's Worst Drivers and The Car's The Star. He went on to perform on Strictly Come Dancing in 2004, where he continues to hold the lowest score in the show's history. Willson was also an avid \"consumer champion\", having advocated for a number of campaigns, including helping to freeze fuel duty with his FairFuel campaign. He recently worked \"tirelessly\" to make electric vehicles affordable through his FairCharge campaign, his family said. The family statement added: \"Long before it was fashionable, he championed the GM EV1 and the promise of electric cars, proving he was always ahead of the curve. \"Much-loved husband to Michaela, devoted father to Mercedes, Max and Mini, and cherished grandfather to Saskia, Xander and Roxana. \"Quentin will be deeply missed by his family, friends, and all who knew him personally and professionally. \"The void he has left can never be filled. His knowledge was not just learned but lived; a library of experience now beyond our reach.\""
    },
    {
        "title": "Davina McCall reveals breast cancer diagnosis a year after brain tumour surgery",
        "description": "Davina McCall has revealed she has had breast cancer, nearly a year after she had surgery to remove a brain tumour.",
        "url": "https://news.sky.com/story/davina-mccall-reveals-breast-cancer-diagnosis-a-year-after-brain-tumour-surgery-13466256",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-davina-mccall-brits_6843649.jpg?20251108121104",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-08 11:40:00",
        "Headline": "The TV presenter revealed the diagnosis in a video posted to her Instagram on Saturday, saying she was \"very angry\" when she found out, but now is in a \"much more positive place\" after undergoing surgery to remove the tumour.",
        "Content": " Davina McCall has revealed she has had breast cancer, nearly a year after she had surgery to remove a brain tumour. The TV presenter revealed the diagnosis in a video posted to her Instagram on Saturday, saying she was \"very angry\" when she found out, but now is in a \"much more positive place\" after undergoing surgery to remove the tumour three weeks ago. \"I found a lump a few weeks ago. It came and went but then I was working on The Masked Singer and Lorraine, the TV show, and Lorraine Kelly had put signs on the backs of all the doors saying 'check your breasts' and every time I went for a wee, I did that,\" she said. \"It was still there, and then one morning I saw myself in the mirror and thought 'I'm going to get that looked at'. I had a biopsy. I found out it was indeed breast cancer and I had it taken out in a lumpectomy nearly three weeks ago.\" McCall, 58, said the \"lump\" was \"very, very small\" and was discovered early. \"I am so relieved to have had it removed and to know that it hasn't spread. My lymph nodes were clear, I didn't have any removed, and all I'm going to do now is have five days of radiotherapy in January as kind of an insurance policy,\" she explained. The former Big Brother presenter thanked her medical team, family and fiance for their support, before adding: \"It's been a lot. I was very angry when I found out, but I let go of that, and I feel in a much more positive place now. \n                  Davina McCall makes emotional public appearance after brain surgery\n                 \n                  Fearne Cotton reveals she will have surgery on benign tumours - as she is supported by Davina McCall\n                 \n                  Davina McCall feeling 'stronger and stronger' after brain tumour surgery\n                 \"I think my message is: get checked if you're worried. Check yourself regularly. If you are due a mammogram, then get it done. \"I have dense breasts and I had a mammogram in August, and I was postponing the ultrasound; I just couldn't find time to do it. Don't do that. Get the ultrasound.\" Her breast cancer diagnosis came nearly a year after McCall revealed that she had a benign brain tumour, a colloid cyst, which she described as \"very rare\". She said in a video posted in November last year that chances of having it were \"three in a million\" and that she had discovered it several months previously after a company offered her a health scan in return for giving a menopause talk. McCall rose to fame presenting on MTV in the mid-1990s, and later on Channel 4's Streetmate, before becoming a household name as the host of Big Brother from 2000 to 2010. She's gone on to present programmes across the networks, and currently presents ITV dating show My Mum, Your Dad. In recent years, McCall has spoken regularly on women's health and the effects of menopause in a bid to break taboos around the subject. Her 2022 book, Menopausing, won book of the year at the British Book Awards. The same year, McCall fronted the Channel 4 documentary Davina McCall: Sex, Mind And The Menopause, and told the BBC that perimenopausal symptoms caused her difficulties multi-tasking and she considered that she had a brain tumour or Alzheimer's disease at the time. In 2023, she was appointed Member of the Order of the British Empire (MBE) for services to broadcasting. The presenter has previously raised money for Cancer Research UK by running the Race For Life in honour of her late sister, Caroline Baday, who died from lung cancer in 2012 at the age of 50. Read more from Sky News:Kendrick Lamar leads Grammy nodsCelebrity Traitors star reveals double-bluff Married twice, McCall has three children, two daughters and a son, with her second husband, presenter Matthew Robertson. She lives with her fiance, hairdresser Michael Douglas, and presents a weekly lifestyle podcast with him, called Making The Cut."
    },
    {
        "title": "UK looking at Denmark model to cut illegal migration",
        "description": "The Home Office is looking at what Denmark is doing to cut illegal migration, Sky News understands.",
        "url": "https://news.sky.com/story/uk-looking-at-denmark-model-to-cut-illegal-migration-13466272",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-france-migrant-crisis_6531111.jpg?20240423191322",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-08 12:16:00",
        "Headline": "Last month, Home Secretary Shabana Mahmood dispatched officials to the Nordic nation to study its border control and asylum policies, which are considered some of the toughest in Europe.",
        "Content": " The Home Office is looking at what Denmark is doing to cut illegal migration, Sky News understands. Last month, Home Secretary Shabana Mahmood dispatched officials to the Nordic nation to study its border control and asylum policies, which are considered some of the toughest in Europe. In particular, officials are understood to be looking at Denmark's tighter rules on family reunion and restricting most refugees to a temporary stay in the country. Ms Mahmood will announce a major shake-up of the UK's immigration system later this month, PA is reporting. Labour MPs are said to be split on the move. Some, in so-called Red Wall seats which are seen as vulnerable to challenge from Reform UK, want ministers to go further in the direction Denmark has taken. But others believe the policies will estrange progressive voters and push the Labour Party too far to the right. Denmark has adopted increasingly restrictive rules in order to deal with migration over the last few years. In Denmark, most asylum or refugee statuses are temporary. Residency can be revoked once a country is deemed safe. In order to achieve settlement, asylum seekers are required to be in full-time employment, and the length of time it takes to acquire those rights has been extended. Denmark also has tougher rules on family reunification - both the sponsor and their partner are required to be at least 24 years old, which the Danish government says is designed to prevent forced marriages.\n The sponsor must also not have claimed welfare for three years and must provide a financial guarantee for their partner. Both must also pass a Danish language test. In 2018, Denmark introduced what it called a ghetto package, a controversial plan to radically alter some residential areas, including by demolishing social housing. Areas with over 1,000 residents were defined as ghettos if more than 50% were \"immigrants and their descendants from non-Western countries\". In 2021, the left of centre government passed a law that allowed refugees arriving on Danish soil to be moved to asylum centres in a partner country - and subsequently agreed with Rwanda to explore setting up a program, although that has been put on hold. It comes as the government continues to struggle to get immigration under control, with rising numbers of small boat crossings in the Channel over the last few months and a migrant, deported under the UK's returns deal with France, re-entering the country. Some 648 people crossed the Channel to Britain in nine boats on Friday, according to Home Office figures, bringing the total for the year to 38,223. Read more:Mistaken prison releases 'could be opportunity' for LammyCulture secretary defended in 'cronyism' row  Ms Mahmood wants deterrents in place to stop migrants seeking to enter the country via unauthorised routes. She also wants to make it easier to remove those who are found to have no right to stay in the UK. Sources told the PA news agency she was eager to meet her Danish counterpart, Rasmus Stoklund, the country's immigration minister, at the earliest possible convenience. Speaking on BBC Radio 4, Mr Stoklund likened Danish society to \"the hobbits in The Lord Of The Rings\" and said people coming to the country who do not contribute positively would not be welcome. Mr Stoklund said: \"We are a small country. We live peacefully and quietly with each other. I guess you could compare us to the hobbits in The Lord Of The Rings.\" \"We expect people who come here to participate and contribute positively, and if they don't they aren't welcome.\" The split in Labour was apparent from public comments by MPs today. Stoke-on-Trent Central Labour MP Gareth Snell told Radio 4's Today programme that any change bringing \"fairness\" to an asylum system that his constituents \"don't trust\" was \"worth exploring\". Mike Tapp, a Home Office minister and MP for Dover and Deal, also said: \"There is nothing 'Reform-esque' about a firm, fair immigration system that isn't open to abuse.... Those who disagree continue to enable Reform.\" Read more:X and the far right: How Elon Musk compares migrants to Lord Of The Rings characters But Nottingham East MP Nadia Whittome, who is a member of the party's Socialist Campaign Group caucus, said: \"I think these are policies of the far right. I don't think anyone wants to see a Labour government flirting with them.\" Labour backbencher Clive Lewis, the MP for Norwich South, also described the proposals as the \"worst of both worlds\". Writing on X, he added: \"When a progressive party adopts the logic of its opponents - that migrants are a threat, that order must come before rights, that the state's job is to manage people rather than empower them - it doesn't neutralise the authoritarian right. It normalises it.\""
    },
    {
        "title": "How a cup of coffee led Sky News to a sex offender on the run",
        "description": "It started with a strong espresso in a simple cafe on a side street in north London.",
        "url": "https://news.sky.com/story/how-sky-news-helped-recapture-algerian-sex-offender-mistakenly-released-from-prison-13466089",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-prisoner-brahim-kaddour-cherif_7075045.jpg?20251107185146",
        "type": "UK",
        "Author": "Tom Parmenter",
        "Date Published": "2025-11-08 00:01:00",
        "Headline": "After picking up a lead with a group of Algerians, Sky's Tom Parmenter and Josh Masters tracked down Brahim Kaddour-Cherif, 24, in the same part of the capital where another wrongly released offender was rearrested last month.",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  It started with a strong espresso in a simple cafe on a side street in north London. Several Algerian men were inside, a few others were outside on the pavement, smoking. I'd been told the wanted prisoner might be in Finsbury Park, so I ordered a coffee and asked if they'd seen him. They were happy to tell me that some of them knew Brahim Kaddour-Cherif - the 24-year-old offender who was on the run. One of the customers revealed to me that he'd actually seen him the night before. \"He wants to hand himself to police,\" the friend said candidly. This was the beginning of the end of a high-profile manhunt. \n                  Prison release mistakes 'symptom of system close to breaking point', says prisons inspector\n                 \n                  Algerian sex offender mistakenly released from prison reacts angrily as he's arrested\n                 \n                  Why are prisoners being released by mistake?\n                 The Algerian convicted sex offender had been at large since 29 October, after he was mistakenly released from HMP Wandsworth in south London. Within an hour of meeting the friend in the cafe, he had followed myself and camera operator Josh Masters to a nearby street. We weren't yet filming - he didn't want any attention or fuss surrounding him. \"Follow me, he's in the park,\" the man told me. \"Follow - but not too close.\" We did. I was in the same park a few weeks ago after fugitive Hadush Kebatu, the Ethiopian sex offender - also wrongly released from prison - was arrested in Finsbury Park. It was odd to be back in the same spot in such similar circumstances. Read more on Tom's story:Wrongly released prisoner's angry reaction'I'm glad he's been arrested' As he led us through the park past joggers, young families and people playing tennis, the man headed for the gates near Finsbury Park station. All of a sudden, two police officers ran past us. The Met had received a tip-off from a member of the public. It was frantic. Undercover officers, uniformed cops, screeching tyres and blaring sirens. We were in the middle of the manhunt. As they scoured the streets at speed, we walked by some of the Algerian men I'd seen in the cafe. One man near the group was wearing green tracksuit bottoms, a beanie hat and had glasses on. \"It's him, it's him,\" one of the other men said to me, gesturing towards him. The man in the beanie then quickly turned on his heel and walked off. \"It's him, it's him,\" another guy agreed. The suspect was walking off while the police were still searching the nearby streets. Josh and I caught up with him and I asked directly: \"Are you Brahim?\" You may have watched the exchange in the Sky News video - he was in denial, evasive and pretended the suspect had pedalled off on a Lime bike. I can only guess he knew the game was up, but for whatever reason, he was keeping up the lie. Moments later, one of the bystanders told me \"it is him\" - with added urgency. Only the prisoner knows why he then walked up to the nearby police van - officers quickly moved to handcuff him and tell him why he was being arrested. Over the next 10 minutes, he became agitated. His story changed as I repeatedly asked if he had been the man inside HMP Wandsworth. Officers needed confirmation too - one quickly pulled out a smartphone and checked an image of the wanted man from one of Sky News' online platforms. Read more from Sky News:Teen speeding after passing driving test caused friend's deathDNA pioneer censured for offensive race remarks diesDid Putin's right-hand man make him look weak? \"It's not my f****** fault, they release me!\" he yelled at me. The search was over, the prisoner cage in the back of the van was opened and he was guided in. I then spoke to another Algerian man who had tipped off the police - he told me he hated sex offenders and the shame he felt over the whole episode. The community had done the right thing - there were two tip-offs - one to me, one to the police. The farce of this manhunt had gone on long enough."
    },
    {
        "title": "Explosives and weapons seized - with 71 arrests - as Syria launches clampdown on Islamic State cells ",
        "description": "Syria has carried out pre-emptive operations targeting Islamic State cells - arresting 71 people during 61 raids.",
        "url": "https://news.sky.com/story/explosives-and-weapons-seized-with-71-arrests-as-syria-launches-clampdown-on-islamic-state-cells-13467061",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-syrian-ministry_7076567.jpg?20251108232821",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-08 23:13:00",
        "Headline": "The raids come as Syrian President Ahmed al Sharaa travels to Washington for a meeting with Donald Trump, where he will join a coalition against IS.",
        "Content": "Syria has carried out pre-emptive operations targeting Islamic State cells - arresting 71 people during 61 raids. Explosives and weapons were seized, with the interior ministry revealing they were working on \"precise\" intelligence information. \"Many\" of those detained were wanted criminals, with forces obtaining evidence that linked them to terrorist activities. A statement added that the operation was part of \"ongoing national efforts to combat terrorism and confront plots targeting the country's security and citizens\". The raids come as Syrian President Ahmed al Sharaa travels to Washington for a meeting with Donald Trump, where he will join a coalition against IS. Meanwhile, the US is preparing to establish a military presence in Damascus to enable a security pact that is being brokered between Syria and Israel. According to the Syrian Arab News Agency, officials intercepted information that suggested Islamic State was planning to launch new attacks. \n                  Historic al Nuri mosque reopens eight years after it was destroyed by IS\n                 \n                  Hunting for ISIS: Inside the caves at heart of expanding terror network\n                 \n                  'I don't regret anything,' smiling ISIS militant on death row tells Sky News\n                 Interior ministry spokesman Nour al Din al Baba told al Ekhbariya: \"The current major threat lies in IS' attempts to reconstitute itself and recruit new members, particularly among the youth.\" Former president Bashar al Assad was ousted late last year after 25 years in power and fled to Russia after his regime came to an end. Since then, al Sharaa's transitional administration has been attempting to restore security, introduce economic reforms, and cooperate with international partners. Read more from Sky News:UK looking at Denmark model to cut illegal migrationJeremy Clarkson leads tributes to former Top Gear co-star On Friday, the UK and US removed sanctions against al Sharaa - following in the footsteps of the UN Security Council. The State Department said this was \"in recognition of the progress demonstrated by the Syrian leadership\", including work to counter narcotics and eliminate chemical weapons. Al Sharaa had faced a travel ban, asset freeze and an arms embargo for well over a decade because he was previously affiliated with al Qaeda."
    },
    {
        "title": "Trump exempts Hungary from US sanctions on Russian energy after meeting Orban",
        "description": "Hungary has been given a one-year exemption from US sanctions on using Russian energy, a White House official has said, after its Prime Minister Viktor Orban met with Donald Trump in the White House.",
        "url": "https://news.sky.com/story/trump-exempts-hungary-from-us-sanctions-on-russian-energy-after-meeting-orban-13466211",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-viktor-orban_7075387.jpg?20251108101502",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-08 09:07:00",
        "Headline": "The Hungarian prime minister succeeded in convincing the US president to allow Hungary to continue importing Russian oil and gas without being subject to the sanctions Mr Trump's administration had placed on Russian fossil fuels.",
        "Content": "Hungary has been given a one-year exemption from US sanctions on using Russian energy, a White House official has said, after its Prime Minister Viktor Orban met with Donald Trump in the White House. Mr Orban succeeded in convincing the US president to allow Hungary to continue importing Russian oil and gas without being subject to the sanctions Mr Trump's administration had placed on Russian fossil fuels. Hungary has been under heavy pressure from the European Union to end its reliance on Russian energy. The EU has mostly heavily cut or ceased its imports of Russian oil and gas. On 22 October, Mr Trump imposed sanctions against Russia's two biggest oil companies, in a major policy shift described by Vladimir Putin as an \"unfriendly act\". Mr Trump has also been pushing Europe to stop using Russian energy. Ukraine war latest: Trump gives Hungary energy sanctions relief  Mr Orban, the country's nationalist leader and a long-time ally of Mr Trump, has described access to Russian energy as a \"vital\" issue for his landlocked country. He said he planned to discuss with Mr Trump the \"consequences for the Hungarian people\" if the sanctions came into effect. Speaking at a news conference after his talks with Mr Trump, Mr Orban said Hungary had \"been granted a complete exemption from sanctions\" affecting Russian gas delivered to Hungary from the TurkStream pipeline and oil from the Druzhba pipeline. \"We asked the president to lift the sanctions,\" Mr Orban said. \"We agreed and the president decided, and he said that the sanctions will not be applied to these two pipelines.\" Mr Trump appeared to be sympathetic to Mr Orban's pleas. \"We're looking at it, because it's very different for him to get the oil and gas from other areas,\" he said.  \"As you know, they don't have ... the advantage of having sea. It's a great country, it's a big country, but they don't have sea. They don't have the ports.\" He added: \"But many European countries are buying oil and gas from Russia, and they have been for years. And I said, 'What's that all about?'\" Read more from Sky News:Putin's right-hand man made him look weakUPS and FedEx ground fleet of cargo planes after deadly crash  Orban says 'miracle can happen' in Ukraine war Mr Trump and Mr Orban also discussed the war in Ukraine, with the US president saying: \"The basic dispute is they just don't want to stop yet. And I think they will.\" The president asked Mr Orban if he thought Ukraine could win the war, with the prime minister saying a \"miracle can happen\". Hungary reliant on Russian gas and oil As part of the discussions, Hungary agreed to buy US liquefied natural gas (LNG), the US state department said, noting contracts were expected to be worth around $600m (£455m). The two nations also agreed to work together on nuclear energy, including small modular reactors. Mr Orban also said Hungary will also purchase nuclear fuel from the US-based Westinghouse Electric Company to power its Paks nuclear plant, which has until now relied on Russian-supplied nuclear fuel. International Monetary Fund figures show Hungary relied on Russia for 74% of its gas and 86% of its oil last year. It warned an EU-wide cutoff of Russian natural gas could result in output losses in Hungary exceeding 4% of its GDP."
    },
    {
        "title": "Latest hostage remains returned from Gaza identified",
        "description": "The latest hostage remains returned from Gaza have been identified as an Israeli man who died while fighting Hamas in the October 7 attacks, the office of Israeli Prime Minister Benjamin Netanyahu said in a statement.",
        "url": "https://news.sky.com/story/latest-hostage-remains-returned-from-gaza-identified-13466216",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-lior-rudaeff-israel_7075406.jpg?20251108110014",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-08 09:35:00",
        "Headline": "The remains belong to Lior Rudaeff, 61, who was born in Argentina but moved to Israel as a child. Hamas still has to hand the bodies of the five remaining hostages over to Israel under the terms of a ceasefire that took effect on 10 October.",
        "Content": "The latest hostage remains returned from Gaza have been identified as an Israeli man who died while fighting Hamas in the October 7 attacks, the office of Israeli Prime Minister Benjamin Netanyahu said in a statement. Lior Rudaeff, 61, was born in Argentina but moved to Israel as a child, according to the Hostages and Missing Families Forum. He lived in Kibbutz Nir Yitzhak, a farming community in southern Israel, where he volunteered as an ambulance driver for more than 40 years. He was a member of the community's emergency response team and died defending the kibbutz when Hamas fighters attacked on 7 October 2023, the forum said. Mr Rudaeff's body was taken to Gaza and handed back to Israel on Friday as part of the ceasefire agreement, which includes Hamas having to return all hostages and their remains. Hamas has already returned 23 hostages, but there are five bodies left to be returned under the terms of the ceasefire that took effect on 10 October. As part of the deal, Israel has returned the bodies of 15 Palestinians for each Israeli hostage. Hospital officials in Hamas-run Gaza said they have received another 15 bodies on Saturday. \n                  FAI passes vote seeking UEFA ban on Israel competing in European competitions\n                 \n                  Israel receives hostage's remains - as Turkey issues arrest warrants for 36 officials involved in the war\n                 \n                  Eleven arrested during night of protests as Maccabi Tel Aviv visit Aston Villa\n                 The bodies of 300 Palestinians have been returned so far, but authorities in Gaza have struggled to identify them without access to DNA kits, and have only identified 89 of the bodies, according to Gaza's health ministry. Meanwhile, UN officials have warned that the levels of humanitarian aid flowing into the territory fall well short of what Palestinians require. Read more from Sky News:Putin's right-hand man made him look weakUPS and FedEx ground fleet of cargo planes Under the terms of the ceasefire, Israel is supposed to allow substantially more aid into Gaza. Deputy UN spokesperson Farhan Haqq said more than 200,000 metric tonnes of aid are positioned to move in - but only 37,000 tonnes have arrived so far."
    },
    {
        "title": "FAI passes vote seeking UEFA ban on Israel competing in European competitions",
        "description": "The governing body for football in the Republic of Ireland has approved a resolution to call on UEFA to suspend Israel and its club sides from European competitions.",
        "url": "https://news.sky.com/story/irelands-fa-passes-vote-seeking-uefa-ban-on-israel-competing-in-european-competitions-13466564",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ireland-israel-football_7075930.jpg?20251108162826",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-08 16:22:00",
        "Headline": "The FAI poll, carried by 74 votes to seven, accuses Israel's FA of failing to stamp out racism and allowing Israeli clubs to play in occupied Palestinian territories and echoes similar calls by Turkish and Norwegian football bosses.",
        "Content": "The governing body for football in the Republic of Ireland has approved a resolution to call on UEFA to suspend Israel and its club sides from European competitions. Saturday's ballot of Football Association of Ireland (FAI) members - which was carried by 74 votes to seven with two abstentions - was to submit a formal resolution to European football's governing body calling for the ban over alleged violations of UEFA rules. In a statement, the FAI said Israel's FA had allegedly failed to implement and enforce an effective anti-racism policy and allowed Israeli clubs to play in illegal settlements in the occupied West Bank without the consent of the Palestinian FA. The motion, proposed by one of Ireland's leading clubs, Dublin side Bohemian FC, echoed similar calls in September by Turkish and Norwegian football bosses for Israel to be suspended from international competition. They acted after a commission established by the United Nations investigation accused Israel of committing genocide during the war in Gaza and demanded that both UEFA and FIFA, the sport's world governing body, suspend Israel from international football. Israel has denied committing genocide, with the country's foreign ministry calling the report \"distorted and false\" and saying it \"categorically rejects\" it. 'A heavy price' UEFA previously began discussing a possible ban, but talks ended after a US-brokered ceasefire took effect on 10 October. If a ban were introduced, it would put UEFA on a collision course with the US government, which is Israel's biggest global backer and co-host of next year's World Cup, with Canada and Mexico. US President Donald Trump's administration strongly opposes such a move. A UEFA ban would stop Israel from taking part in its competitions, but may not affect Israel's World Cup qualifiers, which FIFA organises. On Friday, senior US Republican politician Lindsey Graham criticised the FAI for holding the vote and said he would do everything he could to \"make those who participate in this effort to marginalise Israel in sports, and elsewhere, pay a heavy price when it comes to access to the American economy\". Read more on Sky News:How coffee led us to escaped prisonerEx-Top Gear star diesDanish immigration model favoured Mr Graham and other members of the US Congress have criticised the Irish government's plans to restrict trade with Israeli settlements in the occupied Palestinian territories. Ireland has been one of the European Union's most outspoken critics of Israel's war in Gaza. The war was triggered by a Hamas attack on Israel on 7 October, 2023, in which about 1,200 people were killed and 251 were taken hostage. Israel's retaliatory offensive has killed more than 69,000 Palestinians, according to the Hamas-run Gaza health ministry, which does not distinguish between civilians and combatants in its figures. Sky News has contacted the Israel FA for comment."
    },
    {
        "title": "Prince William's silence over Andrew may be because he's putting his family's mental health first",
        "description": "In the political arena, you will often see people try to capitalise on the wrongdoings or failures of others.",
        "url": "https://news.sky.com/story/prince-williams-silence-over-andrew-may-be-because-hes-putting-his-familys-mental-health-first-13466166",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rio-de-janeiro-christ-the-redeemer_7072774.jpg?20251108085436",
        "type": "World",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-11-08 06:51:00",
        "Headline": "Prince William has been in Brazil this week following a turbulent period for the royals after Andrew lost his titles.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  In the political arena, you will often see people try to capitalise on the wrongdoings or failures of others. For Prince William this week, at a time when his team want to show us he's not afraid to speak out or question what's happening in the world, it would have been easy for him and his advisers to try to draw comparisons between him and his uncle Andrew's failings. They didn't. It is another point of difference with how the royals operate, and those in the political sphere, into which he stepped at COP30 in order to use his diplomatic soft power. In fact, even try to ask palace sources about how William felt about the recent scandal potentially overshadowing his trip to Brazil and the response: \"He was here for Earthshot and that's what he's delivered. He comes with no other agenda but to bring about positive change and you've seen the people of Brazil embrace him this week.\" For three days, we followed Prince William all over Rio de Janeiro and beyond - a welcome distraction after the most difficult few weeks for the Royal Family. Even before the problems with his uncle Andrew, this was a royal tour with a big purpose. Every element - from volleyball on Copacabana beach, a kick around with a Brazil football legend, visiting mangroves off a remote island, his glitzy Earthshot Awards, to his carefully crafted speech for COP30 - was designed to show us more about the style and focus of the heir to the throne. After everything that's happened, it could have felt forced. It didn't. Instead, it was a showcase. \"This could have been difficult,\" one palace source told me, \"but you've seen the future king lead by example, keeping calm, carrying on, making real impact.\" As we filmed him talking to young environmental campaigners at Rio's Maracana stadium, he knew our camera was close, and yet it felt like he wanted us to hear his thoughts on leadership, or the current lack of it, loud and clear. \"If we wait for good leaders all the time, we're going to wait a very long time, you guys are my hope…you've got the ambition.\" Travelling about with him, it feels even more obvious how he wants to do things differently. His trip to the island of Paqueta was just one example of how, for him, listening to people in those communities is more important than the bilateral meetings with political figures that mean so much to the government which sends him on these trips. Showing the \"value of authenticity\", as one of his team put it. And that approach appears to have paid off. The appetite for photos of him has been insane. If you scroll through socials, you'll find shots of him looking over his hotel balcony during time off, and a video of him popping to use the public toilets at the ferry terminal in Paqueta. Holding off the negative headlines appeared to be working as he headed into the big day of his Earthshot awards on Wednesday. Read more:A fired up Prince William is a weapon only UK can deployPrince William photographed at iconic spot Diana posed at But neither he nor we knew what was coming, and when you're a member of the Royal Family there is always the occupational hazard of what may happen in other parts of the world. Because, as he made his way to COP30, the UN's climate conference in Belem, to deliver what was described to me as \"the biggest speech of his life on the climate\", the US congress committee looking into Jeffrey Epstein's crimes were sending a letter to his uncle Andrew asking him to answer their questions about his links to the convicted paedophile.  As a man who, we're told, wants to be seen as more socially engaged, you would maybe expect William to publicly acknowledge what has been an awful time for the monarchy. But there are two main reasons why he wouldn't want to stoke the narrative around this story. The first is an obvious one. It would, of course, overshadow his work. But then there is another potentially more personal one. For a man who's talked a lot about this issue, he is possibly considering the mental health of his own family members. We talk a lot about the institution, but this is a family that has had to grapple with one of their own having a serious lapse of judgement and facing the consequences. We may never know the full emotional toll the revelations and the media coverage has taken on many of them. So yes, while William is increasingly taking on the responsibilities that come with being a global leader, in the end, what you have is a man who will always endeavour to put his family and their feelings first."
    },
    {
        "title": "Missed congeniality: Beauty pageant organiser accused of calling contestant a 'dumbhead'",
        "description": "The organiser of Miss Universe has told Sky News he cannot stand down from his position - despite allegations he was aggressive towards a contestant.",
        "url": "https://news.sky.com/story/missed-congeniality160beauty-pageant-organiser-accused-of-calling-contestant-a-dumbhead-13466151",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-miss-universe-nawat_7075308.jpg?20251108140101",
        "type": "World",
        "Author": "Lucy Marley, video journalist",
        "Date Published": "2025-11-08 02:55:00",
        "Headline": "Nawat Itsaragrisil reprimanded Miss Mexico in a video that's gone viral - and at a news conference, he sobbed dramatically while asking for forgiveness.",
        "Content": "By Lucy Marley, video journalist    The organiser of Miss Universe has told Sky News he cannot stand down from his position - despite allegations he was aggressive towards a contestant. In a video that's now gone viral, Nawat Itsaragrisil appeared to reprimand Miss Mexico after she had failed to post promotional content about Thailand - this year's host country - online. Reporters at the event claimed he had called Fatima Bosch a \"dumbhead\" - something he has firmly denied. After the verbal altercation, she replied: \"You are not respecting me as a woman.\" Nawat then called for security and Bosch walked out of the room. She was joined by other contestants in a show of solidarity, including the reigning Miss Universe. The pageant's president, Mexican businessman Raul Rocha, has described his behaviour as \"public aggression\" and \"serious abuse\". At a news conference, Nawat insisted he had used the word \"damage\" rather than \"dumbhead\" - and urged reporters to check footage of the incident online. \n                  Glasgow Central: Rush-hour delays after swan found on tracks at major UK railway station\n                 \n                  Comedy Wildlife Awards 2025: The funniest animal photos of the year\n                 \n                  Zombies take to the streets in Mexico City for annual parade\n                 However, he added: \"This issue has dragged me down to this point. I understand and I apologise.\" When pressed further by journalists, Nawat appeared to start sobbing and said: \"I am a human who can feel hurt.\" He has also apologised to contestants, adding: \"If anyone (was) affected and not comfortable, it happened, I am so sorry. It's passed. Okay? Are you happy?\" The controversy has overshadowed the Miss Universe contest, with several events to go until the grand final on 21 November."
    },
    {
        "title": "Trump exempts Hungary from US sanctions on Russian energy after meeting Orban",
        "description": "Hungary has been given a one-year exemption from US sanctions on using Russian energy, a White House official has said, after its Prime Minister Viktor Orban met with Donald Trump in the White House.",
        "url": "https://news.sky.com/story/trump-exempts-hungary-from-us-sanctions-on-russian-energy-after-meeting-orban-13466211",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-viktor-orban_7075387.jpg?20251108101502",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-08 09:07:00",
        "Headline": "The Hungarian prime minister succeeded in convincing the US president to allow Hungary to continue importing Russian oil and gas without being subject to the sanctions Mr Trump's administration had placed on Russian fossil fuels.",
        "Content": "Hungary has been given a one-year exemption from US sanctions on using Russian energy, a White House official has said, after its Prime Minister Viktor Orban met with Donald Trump in the White House. Mr Orban succeeded in convincing the US president to allow Hungary to continue importing Russian oil and gas without being subject to the sanctions Mr Trump's administration had placed on Russian fossil fuels. Hungary has been under heavy pressure from the European Union to end its reliance on Russian energy. The EU has mostly heavily cut or ceased its imports of Russian oil and gas. On 22 October, Mr Trump imposed sanctions against Russia's two biggest oil companies, in a major policy shift described by Vladimir Putin as an \"unfriendly act\". Mr Trump has also been pushing Europe to stop using Russian energy. Ukraine war latest: Trump gives Hungary energy sanctions relief  Mr Orban, the country's nationalist leader and a long-time ally of Mr Trump, has described access to Russian energy as a \"vital\" issue for his landlocked country. He said he planned to discuss with Mr Trump the \"consequences for the Hungarian people\" if the sanctions came into effect. Speaking at a news conference after his talks with Mr Trump, Mr Orban said Hungary had \"been granted a complete exemption from sanctions\" affecting Russian gas delivered to Hungary from the TurkStream pipeline and oil from the Druzhba pipeline. \"We asked the president to lift the sanctions,\" Mr Orban said. \"We agreed and the president decided, and he said that the sanctions will not be applied to these two pipelines.\" Mr Trump appeared to be sympathetic to Mr Orban's pleas. \"We're looking at it, because it's very different for him to get the oil and gas from other areas,\" he said.  \"As you know, they don't have ... the advantage of having sea. It's a great country, it's a big country, but they don't have sea. They don't have the ports.\" He added: \"But many European countries are buying oil and gas from Russia, and they have been for years. And I said, 'What's that all about?'\" Read more from Sky News:Putin's right-hand man made him look weakUPS and FedEx ground fleet of cargo planes after deadly crash  Orban says 'miracle can happen' in Ukraine war Mr Trump and Mr Orban also discussed the war in Ukraine, with the US president saying: \"The basic dispute is they just don't want to stop yet. And I think they will.\" The president asked Mr Orban if he thought Ukraine could win the war, with the prime minister saying a \"miracle can happen\". Hungary reliant on Russian gas and oil As part of the discussions, Hungary agreed to buy US liquefied natural gas (LNG), the US state department said, noting contracts were expected to be worth around $600m (£455m). The two nations also agreed to work together on nuclear energy, including small modular reactors. Mr Orban also said Hungary will also purchase nuclear fuel from the US-based Westinghouse Electric Company to power its Paks nuclear plant, which has until now relied on Russian-supplied nuclear fuel. International Monetary Fund figures show Hungary relied on Russia for 74% of its gas and 86% of its oil last year. It warned an EU-wide cutoff of Russian natural gas could result in output losses in Hungary exceeding 4% of its GDP."
    },
    {
        "title": "Why US may soon have a real energy emergency",
        "description": "Donald Trump declared a questionable \"national energy emergency\" when he entered the White House. Soon, he may have one for real.",
        "url": "https://news.sky.com/story/why-us-may-soon-have-a-real-energy-emergency-13459344",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-trump-un_7071500.jpg?20251104104334",
        "type": "US",
        "Author": "Tom Clarke",
        "Date Published": "2025-11-08 00:06:00",
        "Headline": "US firms are likely to suffer because they can't get enough power, while consumers will end up paying more because of Mr Trump's dismissive approach to renewables.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n Donald Trump declared a questionable \"national energy emergency\" when he entered the White House. Soon, he may have one for real. The president promised his America would \"drill, baby drill\" to new levels of prosperity by making the most of its reserves of oil and gas. Mr Trump has now axed hundreds of billions in tax breaks and grants for low-carbon power and clean energy research and given them instead to fossil fuel investments. There's no better example than Revolution Wind, one of the largest offshore renewable energy projects in America. Nearly 80% complete, the White House ordered an immediate halt. When we visited, the massive 200m-wide turbines were going round - a temporary injunction has allowed construction to continue - but they're not yet connected to the grid. As long as Mr Trump is in power, it's not certain they'll ever be. \n                  COP's potential for change limited not by who turned up, but by the elephants not in the room\n                 \n                  COP30: China dominates renewables - and this project in Laos shows why\n                 \n                  2025 set to be among hottest years on record, UN scientists warn\n                 The future of other major wind and solar developments is also in doubt, as is more than $100bn (£75bn) in clean energy investment. There's less doubt about the fossil fuel business however. The industry is getting what it asked for after backing Mr Trump's re-election. US energy secretary Chris Wright and many key White House staff and advisers are former fossil fuel industry insiders. Analysis for Sky News, by Global Witness, reveals that since the Paris Agreement was signed in 2015, US oil and gas production has grown five times faster than the average of the world's next largest producers. An increase that really took off during Mr Trump's first presidency. The analysis of company data goes on to reveal how US oil and gas production is now forecast to continue growing - by 2035 to double that of its next closest rival, Russia. \"Instead of reducing investment in dirty oil and gas, the principal drivers of climate breakdown, the US has doubled down on fossil fuels, ramping up production,\" said Patrick Galey, of Global Witness. A fact that would probably be music to the president's ears and to many conservative Americans who voted for him. Mr Trump's \"energy emergency\" was perhaps a predictable response to the \"climate emergency\" invoked by his political rivals. The only problem is, apart from accelerating global warming, his energy plan is on course to make America worse off. 'US energy demand to grow 25%' For the first time in years, US electricity demand has been going up. It is driven in part by a race to build power-hungry data centres - further encouraged by Mr Trump's aim for American supremacy in AI. Demand is rising and renewable energy is the quickest, cheapest way to meet it. President Trump has championed supremacy in AI - backing investments in and clearing red tape for massive energy-hungry data centres. After declining, then remaining stable for years, US energy demand is now forecast to grow 25% by 2030, according to analysis by ICF International. But where will all the electricity come from? We went to Mitsubishi Power, which makes state-of- the-art gas turbines for power stations at its factory outside Savannah, Georgia. Demand for new turbines has never been greater, according to Bill Newsom, the US CEO. Wait times for new turbines is now double what it was just two years ago. And while America will need gas to meet rising demand - it's twice as clean as coal and provides \"baseload\" power that renewable energy grids can't yet match - it can't be built fast enough. American businesses, including AI, will likely suffer because they can't get the power they need. Read more from Sky News:Trump may have another motive in war on drugs escalationTrump raises tariffs on Canada in response to Reagan advert US consumers - who Mr Trump promised lower bills - will end up paying more because he also made renewable energy more expensive. And that's to say nothing of the impact on carbon emissions. The speed of transition being called for to meet the 1.5C Paris target was always going to be very expensive, as countries like the UK are finding out. But by fighting one \"emergency\" with another, Mr Trump risks making Americans - and the climate - worse off."
    },
    {
        "title": "Donald Trump illegally ordered National Guard to Portland, judge rules",
        "description": "US President Donald Trump illegally ordered the National Guard to Portland, a federal judge has ruled.",
        "url": "https://news.sky.com/story/donald-trump-illegally-ordered-national-guard-to-portland-judge-rules-13466195",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-portland-trump_7075359.jpg?20251108083128",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-08 08:16:00",
        "Headline": "The US president ordered the National Guard to deploy to Portland in late September. The City of Portland and Oregon Attorney General's Office sued after alleging the administration was exaggerating occasional violence to justify deploying troops.",
        "Content": "US President Donald Trump illegally ordered the National Guard to Portland, a federal judge has ruled. The ruling, a legal setback for the administration, is the first to permanently block Mr Trump's use of military force to suppress protests against immigration authorities. Mr Trump is seeking to do the same in Democrat-led Los Angeles, Chicago and Washington DC. The ruling replaces Judge Karin Immergut's interim order that prevented the Portland deployment. Mr Trump ordered the National Guard to Portland in response to what he said was a \"war ravaged\" city, with \"ICE Facilities under siege from attack by Antifa\" and \"crazy people\" who \"try to burn down buildings, including federal buildings\" every night. The justice department claims federal law enforcement in Portland needs the National Guard's help because they're \"unable with the regular forces to execute the laws of the United States\". But officials in Oregon say that while there have been incidents of violence at and near Portland's ICE facility, they've been small in scale and can continue to be handled local and federal law enforcement, Sky News' US partner NBC reports. The Trump administration is likely to appeal, meaning it could reach the Supreme Court, after the judge ruled the protests were not an act of rebellion against the government. 'Trump will not turn a blind eye' White House spokeswoman, Abigail Jackson, said in a statement on Friday: \"President Trump will not turn a blind eye to the lawlessness plaguing American cities and we expect to be vindicated by a higher court.\" The Oregon Attorney General's Office did not immediately respond to an email seeking comment. Read more:JD Vance's telling reaction to big 24 hours in USTrump renominates billionaire Musk ally to lead NASA Mr Trump's order to deploy troops on US soil was a sudden break with long-standing, but rarely tested norms. He ordered the National Guard into Portland in late September. The City of Portland and Oregon Attorney General's Office sued in the days afterwards after alleging the administration was exaggerating occasional violence to justify deploying troops. Democrats claimed the move abused military powers meant for genuine emergencies. So far, the troops remain on standby but have yet to take up positions in the city."
    },
    {
        "title": "US aviation authority orders emergency ban on MD-11 flights after deadly Kentucky crash",
        "description": "US officials have issued an emergency order banning flights of the model of plane involved in a deadly crash in Kentucky last week, pending inspection.",
        "url": "https://news.sky.com/story/us-aviation-authority-orders-emergency-ban-on-md-11-flights-after-deadly-kentucky-crash-13467040",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-kentucky-plane-crash_7072499.jpg?20251105083337",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-08 21:54:00",
        "Headline": "The Federal Aviation Authority has issued an Emergency Airworthiness Directive after 14 people were killed in the disaster in Louisville last week. Three pilots were among the dead.",
        "Content": "US officials have issued an emergency order banning flights of the model of plane involved in a deadly crash in Kentucky last week, pending inspection. The Federal Aviation Administration (FAA) issued the Emergency Airworthiness Directive (AD) for McDonnell Douglas MD-11 aircraft after a UPS plane bound for Honolulu crashed on take-off in Louisville on Tuesday evening, killing 14 people. The victims included three pilots. Delivery firms UPS and FedEx had already grounded their fleets of the planes on Friday \"out of an abundance of caution and in the interest of safety\". The FAA said the order, which came following a recommendation by its manufacturer Boeing, was prompted after \"an accident where the left-hand engine and pylon detached from the airplane\".  A spokesperson for the authority added: \"The cause of the detachment is currently under investigation. This condition could result in the loss of continued safe flight and landing. \"The FAA is issuing this AD because the agency has determined the unsafe condition is likely to exist or develop in other products of the same type design. \"The AD prohibits further flight until the airplane is inspected and all applicable corrective actions are performed.\" Read more from Sky News:Man charged with stealing luggage from UK airportDavina McCall reveals cancer diagnosisWoman stabbed in neck in 'unprovoked attack' The MD-11 was first manufactured by McDonnell Douglas in 1988, until its merger with Boeing in 1997. It was once used by commercial airlines, including Finnair and KLM, as a passenger jet, but was retired in 2014, and is now used only as a freight plane. Government shutdown impacts commercial flights It came as more than 1,300 commercial flights were cancelled in the US on Saturday because of an FAA order, unrelated to the Kentucky crash, to reduce air traffic amid the ongoing government shutdown. The deadlock in Washington has resulted in shortages of air traffic control staff, who have not been paid for weeks. Officials have warned that the number of daily cancellations could rise in the coming days unless the political row is resolved."
    },
    {
        "title": "UPS and FedEx ground fleet of MD-11 cargo planes after deadly Kentucky crash",
        "description": "UPS and FedEx have grounded a fleet of cargo planes \"out of an abundance of caution and in the interest of safety\" following a deadly crash in Kentucky.",
        "url": "https://news.sky.com/story/ups-and-fedex-ground-fleet-of-md-11-cargo-planes-after-deadly-kentucky-crash-13466187",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-kentucky-plane-crash_7072499.jpg?20251105083337",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-08 07:37:00",
        "Headline": "A cargo plane bound for Honolulu crashed near UPS Worldport in Louisville on Tuesday evening, killing 14 people, including the three pilots.",
        "Content": "UPS and FedEx have grounded a fleet of cargo planes \"out of an abundance of caution and in the interest of safety\" following a deadly crash in Kentucky. A McDonnell Douglas MD-11 plane bound for Honolulu crashed near UPS Worldport in Louisville on Tuesday evening, killing 14 people, including the three pilots. Authorities said the MD-11, built in 1991, was carrying 38,000 gallons of fuel at the time of the crash, which impacted two buildings, with images from the scene showing large fires burning and smoke billowing into the air. UPS said on Friday that it would ground its MD-11 aircrafts, which make up about 9% of its fleet.  \"We made this decision proactively at the recommendation of the aircraft manufacturer,\" UPS said in a statement. \"Nothing is more important to us than the safety of our employees and the communities we serve.\" FedEx, which has 28 MD-11s in operation out of a fleet of around 700, also said it would ground the planes while it conducts \"a thorough safety review based on the recommendation of the manufacturer\". \"Out of an abundance of caution, we have made the decision to immediately ground our MD-11 fleet as we conduct a thorough inspection and safety review,\" the company told Sky News' US partner network NBC. \"We are immediately implementing contingency plans within our integrated air-ground network to minimize disruptions.\" \n                  US aviation authority orders emergency ban on MD-11 flights after deadly Kentucky crash\n                 \n                  Kentucky plane crash leaves at least 11 dead\n                 \n                  Former Kentucky police officer Brett Hankison sentenced to three years in prison over Breonna Taylor death\n                 The only other US cargo airline flying MD-11s is Western Global Airlines, according to aviation analytics firm Cirium. The airline has already put the majority of its MD-11 aircraft - 12 out of 16 - into storage. The MD-11 that crashed on Tuesday was nearly airborne when a bell sounded in the cockpit, according to Todd Inman, a member of the US National Transportation Safety Board. The cockpit voice recorder revealed that the bell rang for 25 seconds while the pilots tried to control the plane, the left wing of which was ablaze and an engine missing, before the aircraft crashed into the ground in a fireball. Read more from Sky News:Why US may soon have a real energy emergencyMusk's record-breaking $1trn pay package approved There are different types of alarms with varying meanings, according to Mr Inman, who added that investigators haven't determined why the bell rang, though they know the left wing was burning and the engine on that side had detached. Flight records suggest that the MD-11 underwent maintenance for more than a month until mid-October, but it is unclear what work was done."
    },
    {
        "title": "Burger chain Five Guys hunts new investor to flip stake",
        "description": "The telecoms billionaire Sir Charles Dunstone is seeking new investors to take a big stake in Five Guys Europe, the casual dining brand he launched in Britain more than a decade ago.",
        "url": "https://news.sky.com/story/burger-chain-five-guys-hunts-new-investor-to-flip-stake-13466228",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-five-guys-food_7075381.jpg?20251108094859",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-08 10:35:00",
        "Headline": "Jointly owned by the entrepreneur Sir Charles Dunstone's investment vehicle, a deal could value Five Guys' European operation, which trades from nearly 300 sites, at well over £500m, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The telecoms billionaire Sir Charles Dunstone is seeking new investors to take a big stake in Five Guys Europe, the casual dining brand he launched in Britain more than a decade ago. Sky News has learnt that Sir Charles's investment vehicle, Freston Ventures, has retained investment bankers at Goldman Sachs to identify a buyer for a chunk of the burger chain, which employs about 6,000 people in the UK. This weekend, City sources said a stake of up to 50% in Five Guys Europe was likely to be made available to bidders, although all options are expected to be considered. Teaser documents have been circulated by Goldman Sachs to potential bidders in recent weeks, with large buyout firms said to be among those interested. One insider said that based on its projected earnings, the entirety of Five Guys Europe could be worth in the region of £600m. The investment process has been facilitated by a deal that Sir Charles is understood to have reached to acquire the 50% stake in Five Guys Europe owned by the Murrell family, which established the business in Arlington, Virginia, in 1986. Under that deal, Five Guys Europe will pay a royalty fee to the US brand-owner for its future use. Sir Charles brought the business to Britain in 2013, after striking a deal with the Murrell family following a family holiday in New York. Its first UK site opened in Covent Garden, central London, before hitting 100 outlets six years later. The chain now trades from close to 300 stores in the European territories in which it operates, which include France, Germany and Spain. In the UK, it has 177 outlets, while including the US business it boasts more than 2,000 stores across 26 countries. Five Guys Europe employs about 9,000 people across the Continent, and has plans to expand into countries including Italy and Portugal. Read more from Sky News:Post Office compensation scheme is 'half-baked', Alan Bates warnsWhy Sky-ITV deal makes sense in shifting entertainment landscape Goldman is said to have been picked for the Five Guys Europe mandate after overseeing the recent disposals of stakes in Wingstop, the fried chicken chain, to investor Sixth Street in a £400m deal; and the Indian restaurant group Dishoom, which was backed by private equity firm L Catterton in a transaction worth about £300m. The launch of the process comes with the hospitality sector on edge ahead of the budget amid fears of further rises in business taxes aimed at helping the Treasury fill an estimated £30bn fiscal black hole. Last year's budget saw Rachel Reeves hike employers' national insurance contributions, prompting employers in the hospitality and retail industries to warn of mass job cuts and business collapses in its wake. Since then, a string of casual dining businesses have fallen into administration, including, most recently, Pizza Hut's UK operation. Other well-known chains, including Cote and TGI Fridays, have changed hands in the last few months. The pandemic sounded a death knell for many casual dining businesses, particularly in the gourmet burger segment of the market, where Byron Burger has been through several insolvencies in recent years. Five Guys Europe's performance has bucked that trend, however, and now accounts for a large share of the UK's premium burger sector. Five Guys Europe recently completed a £185m debt refinancing, which placed its borrowings on a longer-term footing amid the challenging climate for restaurant operators. The company is run by John Eckbert, its chief executive. Sir Charles is best known as co-founder of the Carphone Warehouse and TalkTalk, the latter of which he remains actively involved with and is currently engaged in a process to sell. This weekend, he declined to comment when approached by Sky News."
    },
    {
        "title": "New compensation scheme for Post Office victims is 'half-baked', Sir Alan Bates warns ",
        "description": "Sir Alan Bates has told Sky News that the government's new Capture Redress Scheme is \"half-baked\".",
        "url": "https://news.sky.com/story/new-compensation-scheme-for-post-office-victims-is-half-baked-sir-alan-bates-warns-13465957",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-alan-bates-horizon_7075022.jpg?20251107182009",
        "type": "Business",
        "Author": "Adele Robinson",
        "Date Published": "2025-11-08 04:01:00",
        "Headline": "The Post Office scandal campaigner, who may also be a victim of Capture, accused officials of not learning lessons from previous compensation failures.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n  Sir Alan Bates has told Sky News that the government's new Capture Redress Scheme is \"half-baked\". The Post Office scandal campaigner, who may also be a victim of Capture, accused officials of not learning lessons from previous compensation failures. Capture was a piece of faulty computer software used in about 2,500 branches between 1992 and 1999 before the infamous Horizon scandal. Many sub-postmasters made up potentially false accounting shortfalls from their own pocket, with dozens, at least, convicted of stealing.  Sir Alan welcomed the launch of the first ever Capture Redress Scheme last week \"in general\". However, he added: \"It does seem to have gone off half-baked with almost none of the lessons that should have been learnt from the failures of the other Postmaster Schemes having been applied when compiling it.\" Sir Alan Bates, who has settled his redress claim with the government in connection with Horizon, also confirmed he may have been a victim of Capture. He said: \"I have documentation which shows that a PC running Capture was part of the inventory when we purchased our sub-post office and I know it was used until it was replaced by the infamous Horizon system toward the end of 2000.\" Despite this, Sir Alan said that - with the information he has about the scheme and making a claim - \"it does seem I may not be able submit one\".  Under the current rules, it appears claimants must submit a fully itemised claim before the Department for Business and Trade (DBT) will decide if they qualify - a process Sir Alan described as \"mad\". \"We could spend a year compiling a claim only for the DBT to say we weren't eligible in the first place.\" He called for a two-stage process: first to confirm eligibility, then to allow victims to build their case with legal support - a model he says would save time, money and avoid unnecessary legal costs. The revelation that Sir Alan may have been a Capture victim - and didn't realise until later on - raises fresh concerns about how many others remain unaware. In a statement to Sky News, a government spokesperson said: \"After over two decades of fighting for justice, victims will finally receive redress for being impacted by the Capture software and we pay tribute to all of those who have worked to expose this scandal. \"All eligible applicants will receive an interim payment of £10,000. In exceptional circumstances, the independent panel can award above £300,000, which is not a cap. \"We have been in contact with Sir Alan's legal representative and stand ready to provide further information to help all claimants.\"  It comes as documents seen by Sky News suggest that the Post Office knew about faults in Capture computer software before it was rolled out in 1992. Notes from a meeting of \"the Capture steering group\" held in February - months before the system was introduced to branches - described files as being \"corrupted\". It highlighted that: \"If the power was switched off when a file was open it would be corrupted. In this situation data should be checked and reinput.\"  Another fault mentioned in the meeting notes was if \"part of the system was closed early, to produce client summaries any additional transactions might not be captured for that day\". \"If a high error rate was detected the software would need to be reworked.\" A document called \"Capture Troubleshooting Guide\" from April 1993 - over a year after the steering group noted faults - again described \"corrupt data\" such as incorrect transaction values. It concluded that the \"cause\" of this was \"switching off the computer or a power cut (even if only for a few seconds) whilst in the Capture programme\". It also put forward instructions to remedy the fault. Rupert Lloyd-Thomas, campaigner for Capture victims, said: \"The Post Office knew ... in 1992, long before the launch, that Capture could be zapped by a power cut. \"They did nothing about it.\" Read more UK news:How a cup of coffee led Sky News to sex offender on the runNHS trust and ward manager to be sentenced over patient's death Steve Marston, who was convicted of stealing from his Post Office branch in 1998 after using Capture, said the information \"didn't come as any surprise\". \"They've known since the very beginning it should never have been released,\" he added. A Post Office spokesperson said: \"We have been very concerned about the reported problems relating to the use of the Capture software and are sincerely sorry for past failings that have caused suffering to postmasters. \"In September 2024, Kroll published an independent report which examined the Capture software that was used in some Post Office branches in the 1990s and we fully co-operated with Kroll throughout their investigation. \"We are determined that past wrongs are put right and are continuing to support the government's work in this area. \"Post Office has very limited records relating to this system and we encourage anyone who has Capture related material to share it with Post Office and the Criminal Cases Review Commission.\""
    },
    {
        "title": "Prison release mistakes 'symptom of system close to breaking point', says prisons inspector",
        "description": "The chief inspector of prisons has said the recent spate of prisoners being released too early is \"a symptom of a system that is close to breaking point\".&#160;",
        "url": "https://news.sky.com/story/prison-release-mistakes-symptom-of-system-close-to-breaking-point-says-prisons-inspector-13466917",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-brahim-kaddour-cherif_7074685.jpg?20251107123316",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-08 19:32:00",
        "Headline": "Charlie Taylor blames \"overcomplicated\" sentencing rules, driven by successive governments' responses to the prison overcrowding crisis, for the growing number of \"embarrassing and potentially dangerous\" mistaken early releases.",
        "Content": "The chief inspector of prisons has said the recent spate of prisoners being released too early is \"a symptom of a system that is close to breaking point\".  Charlie Taylor's assessment comes as it is revealed that two prisoners wrongly released last year are still at large, as are two others believed to have been freed in error in June this year. Writing in The Daily Telegraph, Mr Taylor said the growing number of mistaken early releases was \"embarrassing and potentially dangerous\". He also put it down to \"an overcomplicated sentencing framework\" and described it as \"a symptom of a system that is close to breaking point\". He said prison inspections \"repeatedly highlight the failure to keep prisons secure, safe and decent, and to provide the sort of activity that will help inmates get work on release\". In his opinion piece, the chief inspector pointed to successive governments' responses to the overcrowding crisis in the system, which put pressure on \"junior prison staff who repeatedly had to recalculate every prisoner's release date\". These calculations, he wrote, had been made harder by a series of early-release schemes brought in by successive governments. The changes, he said, \"increase the likelihood of mistakes and in three years the number of releases in error has gone up from around 50 a year to 262\".  It comes as ministers face mounting pressure over a series of high-profile manhunts, with Justice Secretary David Lammy admitting on Friday there is a \"mountain to climb\" to tackle the crisis in the prison system. Algerian sex offender Brahim Kaddour-Cherif, 24, was arrested on Friday after a police search following his release from HMP Wandsworth in south London last week, which Scotland Yard said officers only found out about on Tuesday. His recapture was partly down to investigative work by Sky's national correspondent, Tom Parmenter, who tracked Kaddour-Cherif down to Finsbury Park in north London before he handed himself in to police. Convicted fraudster Billy Smith, 35, handed himself back in on Thursday after being accidentally freed from the same jail on Monday. Read more on early release crisis:How a cup of coffee led Sky News to a sex offender on the runWrongly-released prisoner's angry reaction'I'm glad sex offender arrested'Convicted fraudster recaptured It follows the mistaken release of Hadush Kebatu, who was convicted of sexually assaulting a 14-year-old girl and a woman while living in an asylum hotel. The incidents sparked protests in Epping, Essex. Prison security checks have been toughened and an independent investigation into mistaken releases launched after the now-deported Ethiopian national was accidentally freed from HMP Chelmsford on 24 October. A total of 262 inmates were mistakenly let out in the year to March 2025 - a 128% increase on the 115 in the previous 12 months, according to the latest official figures. Of the total, 90 releases in error were of violent or sex offenders. Kaddour-Cherif was serving a sentence for trespass with intent to steal, but had previously been convicted for indecent exposure. He is understood to have overstayed his visitor's visa to the UK after arriving in 2019, and was in the process of being deported. Asked about the four missing prisoners on Friday, shadow justice secretary Robert Jenrick said: \"The chaos continues. The government keeps putting the British people at risk and is relentlessly failing victims. Does anyone have confidence in David Lammy?\" Mr Lammy said on Friday: \"We inherited a prison system in crisis, and I'm appalled at the rate of releases in error this is causing. \"I'm determined to grip this problem, but there is a mountain to climb which cannot be done overnight.  A Ministry of Justice spokesperson said releases in error \"have been increasing for several years and are another symptom of a justice system crisis inherited by this government\". In a statement on Saturday, the ministry said it has introduced \"mandatory, stronger prisoner release checks to keep our streets safe and protect the public as well as investing record amounts into our courts - including to improve operational assurance. \"We're also investing billions, reforming sentencing and building the prison places needed to keep the public safe.\""
    },
    {
        "title": "UK looking at Denmark model to cut illegal migration",
        "description": "The Home Office is looking at what Denmark is doing to cut illegal migration, Sky News understands.",
        "url": "https://news.sky.com/story/uk-looking-at-denmark-model-to-cut-illegal-migration-13466272",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-france-migrant-crisis_6531111.jpg?20240423191322",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-08 12:16:00",
        "Headline": "Last month, Home Secretary Shabana Mahmood dispatched officials to the Nordic nation to study its border control and asylum policies, which are considered some of the toughest in Europe.",
        "Content": " The Home Office is looking at what Denmark is doing to cut illegal migration, Sky News understands. Last month, Home Secretary Shabana Mahmood dispatched officials to the Nordic nation to study its border control and asylum policies, which are considered some of the toughest in Europe. In particular, officials are understood to be looking at Denmark's tighter rules on family reunion and restricting most refugees to a temporary stay in the country. Ms Mahmood will announce a major shake-up of the UK's immigration system later this month, PA is reporting. Labour MPs are said to be split on the move. Some, in so-called Red Wall seats which are seen as vulnerable to challenge from Reform UK, want ministers to go further in the direction Denmark has taken. But others believe the policies will estrange progressive voters and push the Labour Party too far to the right. Denmark has adopted increasingly restrictive rules in order to deal with migration over the last few years. In Denmark, most asylum or refugee statuses are temporary. Residency can be revoked once a country is deemed safe. In order to achieve settlement, asylum seekers are required to be in full-time employment, and the length of time it takes to acquire those rights has been extended. Denmark also has tougher rules on family reunification - both the sponsor and their partner are required to be at least 24 years old, which the Danish government says is designed to prevent forced marriages.\n The sponsor must also not have claimed welfare for three years and must provide a financial guarantee for their partner. Both must also pass a Danish language test. In 2018, Denmark introduced what it called a ghetto package, a controversial plan to radically alter some residential areas, including by demolishing social housing. Areas with over 1,000 residents were defined as ghettos if more than 50% were \"immigrants and their descendants from non-Western countries\". In 2021, the left of centre government passed a law that allowed refugees arriving on Danish soil to be moved to asylum centres in a partner country - and subsequently agreed with Rwanda to explore setting up a program, although that has been put on hold. It comes as the government continues to struggle to get immigration under control, with rising numbers of small boat crossings in the Channel over the last few months and a migrant, deported under the UK's returns deal with France, re-entering the country. Some 648 people crossed the Channel to Britain in nine boats on Friday, according to Home Office figures, bringing the total for the year to 38,223. Read more:Mistaken prison releases 'could be opportunity' for LammyCulture secretary defended in 'cronyism' row  Ms Mahmood wants deterrents in place to stop migrants seeking to enter the country via unauthorised routes. She also wants to make it easier to remove those who are found to have no right to stay in the UK. Sources told the PA news agency she was eager to meet her Danish counterpart, Rasmus Stoklund, the country's immigration minister, at the earliest possible convenience. Speaking on BBC Radio 4, Mr Stoklund likened Danish society to \"the hobbits in The Lord Of The Rings\" and said people coming to the country who do not contribute positively would not be welcome. Mr Stoklund said: \"We are a small country. We live peacefully and quietly with each other. I guess you could compare us to the hobbits in The Lord Of The Rings.\" \"We expect people who come here to participate and contribute positively, and if they don't they aren't welcome.\" The split in Labour was apparent from public comments by MPs today. Stoke-on-Trent Central Labour MP Gareth Snell told Radio 4's Today programme that any change bringing \"fairness\" to an asylum system that his constituents \"don't trust\" was \"worth exploring\". Mike Tapp, a Home Office minister and MP for Dover and Deal, also said: \"There is nothing 'Reform-esque' about a firm, fair immigration system that isn't open to abuse.... Those who disagree continue to enable Reform.\" Read more:X and the far right: How Elon Musk compares migrants to Lord Of The Rings characters But Nottingham East MP Nadia Whittome, who is a member of the party's Socialist Campaign Group caucus, said: \"I think these are policies of the far right. I don't think anyone wants to see a Labour government flirting with them.\" Labour backbencher Clive Lewis, the MP for Norwich South, also described the proposals as the \"worst of both worlds\". Writing on X, he added: \"When a progressive party adopts the logic of its opponents - that migrants are a threat, that order must come before rights, that the state's job is to manage people rather than empower them - it doesn't neutralise the authoritarian right. It normalises it.\""
    },
    {
        "title": "Why US may soon have a real energy emergency",
        "description": "Donald Trump declared a questionable \"national energy emergency\" when he entered the White House. Soon, he may have one for real.",
        "url": "https://news.sky.com/story/why-us-may-soon-have-a-real-energy-emergency-13459344",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-trump-un_7071500.jpg?20251104104334",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-11-08 00:06:00",
        "Headline": "US firms are likely to suffer because they can't get enough power, while consumers will end up paying more because of Mr Trump's dismissive approach to renewables.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n Donald Trump declared a questionable \"national energy emergency\" when he entered the White House. Soon, he may have one for real. The president promised his America would \"drill, baby drill\" to new levels of prosperity by making the most of its reserves of oil and gas. Mr Trump has now axed hundreds of billions in tax breaks and grants for low-carbon power and clean energy research and given them instead to fossil fuel investments. There's no better example than Revolution Wind, one of the largest offshore renewable energy projects in America. Nearly 80% complete, the White House ordered an immediate halt. When we visited, the massive 200m-wide turbines were going round - a temporary injunction has allowed construction to continue - but they're not yet connected to the grid. As long as Mr Trump is in power, it's not certain they'll ever be. \n                  COP's potential for change limited not by who turned up, but by the elephants not in the room\n                 \n                  COP30: China dominates renewables - and this project in Laos shows why\n                 \n                  2025 set to be among hottest years on record, UN scientists warn\n                 The future of other major wind and solar developments is also in doubt, as is more than $100bn (£75bn) in clean energy investment. There's less doubt about the fossil fuel business however. The industry is getting what it asked for after backing Mr Trump's re-election. US energy secretary Chris Wright and many key White House staff and advisers are former fossil fuel industry insiders. Analysis for Sky News, by Global Witness, reveals that since the Paris Agreement was signed in 2015, US oil and gas production has grown five times faster than the average of the world's next largest producers. An increase that really took off during Mr Trump's first presidency. The analysis of company data goes on to reveal how US oil and gas production is now forecast to continue growing - by 2035 to double that of its next closest rival, Russia. \"Instead of reducing investment in dirty oil and gas, the principal drivers of climate breakdown, the US has doubled down on fossil fuels, ramping up production,\" said Patrick Galey, of Global Witness. A fact that would probably be music to the president's ears and to many conservative Americans who voted for him. Mr Trump's \"energy emergency\" was perhaps a predictable response to the \"climate emergency\" invoked by his political rivals. The only problem is, apart from accelerating global warming, his energy plan is on course to make America worse off. 'US energy demand to grow 25%' For the first time in years, US electricity demand has been going up. It is driven in part by a race to build power-hungry data centres - further encouraged by Mr Trump's aim for American supremacy in AI. Demand is rising and renewable energy is the quickest, cheapest way to meet it. President Trump has championed supremacy in AI - backing investments in and clearing red tape for massive energy-hungry data centres. After declining, then remaining stable for years, US energy demand is now forecast to grow 25% by 2030, according to analysis by ICF International. But where will all the electricity come from? We went to Mitsubishi Power, which makes state-of- the-art gas turbines for power stations at its factory outside Savannah, Georgia. Demand for new turbines has never been greater, according to Bill Newsom, the US CEO. Wait times for new turbines is now double what it was just two years ago. And while America will need gas to meet rising demand - it's twice as clean as coal and provides \"baseload\" power that renewable energy grids can't yet match - it can't be built fast enough. American businesses, including AI, will likely suffer because they can't get the power they need. Read more from Sky News:Trump may have another motive in war on drugs escalationTrump raises tariffs on Canada in response to Reagan advert US consumers - who Mr Trump promised lower bills - will end up paying more because he also made renewable energy more expensive. And that's to say nothing of the impact on carbon emissions. The speed of transition being called for to meet the 1.5C Paris target was always going to be very expensive, as countries like the UK are finding out. But by fighting one \"emergency\" with another, Mr Trump risks making Americans - and the climate - worse off."
    },
    {
        "title": "Former Top Gear and Fifth Gear presenter Quentin Willson dies",
        "description": "Former Top Gear and Fifth Gear presenter Quentin Willson has died.",
        "url": "https://news.sky.com/story/former-top-gear-and-fifth-gear-presenter-quentin-willson-dies-13466543",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-quentin-willson-top-gear_7075906.jpg?20251108161522",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-08 16:03:00",
        "Headline": "The Leicester-born motoring journalist joined the BBC in 1991 to co-host the original Top Gear alongside Jeremy Clarkson.",
        "Content": " Former Top Gear and Fifth Gear presenter Quentin Willson has died. The Leicester-born car dealer and motoring journalist joined the BBC show in 1991, appearing alongside the likes of Jeremy Clarkson and James May, until the original format was cancelled 10 years later. He then moved to Channel 5 to join its rival motoring show, Fifth Gear, and did not rejoin when Top Gear relaunched in 2002. The 68-year-old died on Saturday following a short battle with lung cancer, his family said. Clarkson was among those paying tribute on Saturday. He wrote on X: \"I'm far away so I've only just heard that Quentin Willson has died. We had some laughs over the years. Properly funny man.\" May also wrote: \"Quentin Willson gave me proper advice and encouragement during my earliest attempts at TV, back in the late 90s. I've never forgotten it. Great bloke.\" In a statement, Willson's family described him as a \"true national treasure\" who \"brought the joy of motoring, from combustion to electric, into our living rooms\". The broadcaster created and presented both Britain's Worst Drivers and The Car's The Star. He went on to perform on Strictly Come Dancing in 2004, where he continues to hold the lowest score in the show's history. Willson was also an avid \"consumer champion\", having advocated for a number of campaigns, including helping to freeze fuel duty with his FairFuel campaign. He recently worked \"tirelessly\" to make electric vehicles affordable through his FairCharge campaign, his family said. The family statement added: \"Long before it was fashionable, he championed the GM EV1 and the promise of electric cars, proving he was always ahead of the curve. \"Much-loved husband to Michaela, devoted father to Mercedes, Max and Mini, and cherished grandfather to Saskia, Xander and Roxana. \"Quentin will be deeply missed by his family, friends, and all who knew him personally and professionally. \"The void he has left can never be filled. His knowledge was not just learned but lived; a library of experience now beyond our reach.\""
    },
    {
        "title": "Davina McCall reveals breast cancer diagnosis a year after brain tumour surgery",
        "description": "Davina McCall has revealed she has had breast cancer, nearly a year after she had surgery to remove a brain tumour.",
        "url": "https://news.sky.com/story/davina-mccall-reveals-breast-cancer-diagnosis-a-year-after-brain-tumour-surgery-13466256",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-davina-mccall-brits_6843649.jpg?20251108121104",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-08 11:40:00",
        "Headline": "The TV presenter revealed the diagnosis in a video posted to her Instagram on Saturday, saying she was \"very angry\" when she found out, but now is in a \"much more positive place\" after undergoing surgery to remove the tumour.",
        "Content": " Davina McCall has revealed she has had breast cancer, nearly a year after she had surgery to remove a brain tumour. The TV presenter revealed the diagnosis in a video posted to her Instagram on Saturday, saying she was \"very angry\" when she found out, but now is in a \"much more positive place\" after undergoing surgery to remove the tumour three weeks ago. \"I found a lump a few weeks ago. It came and went but then I was working on The Masked Singer and Lorraine, the TV show, and Lorraine Kelly had put signs on the backs of all the doors saying 'check your breasts' and every time I went for a wee, I did that,\" she said. \"It was still there, and then one morning I saw myself in the mirror and thought 'I'm going to get that looked at'. I had a biopsy. I found out it was indeed breast cancer and I had it taken out in a lumpectomy nearly three weeks ago.\" McCall, 58, said the \"lump\" was \"very, very small\" and was discovered early. \"I am so relieved to have had it removed and to know that it hasn't spread. My lymph nodes were clear, I didn't have any removed, and all I'm going to do now is have five days of radiotherapy in January as kind of an insurance policy,\" she explained. The former Big Brother presenter thanked her medical team, family and fiance for their support, before adding: \"It's been a lot. I was very angry when I found out, but I let go of that, and I feel in a much more positive place now. \n                  Davina McCall makes emotional public appearance after brain surgery\n                 \n                  Fearne Cotton reveals she will have surgery on benign tumours - as she is supported by Davina McCall\n                 \n                  Davina McCall feeling 'stronger and stronger' after brain tumour surgery\n                 \"I think my message is: get checked if you're worried. Check yourself regularly. If you are due a mammogram, then get it done. \"I have dense breasts and I had a mammogram in August, and I was postponing the ultrasound; I just couldn't find time to do it. Don't do that. Get the ultrasound.\" Her breast cancer diagnosis came nearly a year after McCall revealed that she had a benign brain tumour, a colloid cyst, which she described as \"very rare\". She said in a video posted in November last year that chances of having it were \"three in a million\" and that she had discovered it several months previously after a company offered her a health scan in return for giving a menopause talk. McCall rose to fame presenting on MTV in the mid-1990s, and later on Channel 4's Streetmate, before becoming a household name as the host of Big Brother from 2000 to 2010. She's gone on to present programmes across the networks, and currently presents ITV dating show My Mum, Your Dad. In recent years, McCall has spoken regularly on women's health and the effects of menopause in a bid to break taboos around the subject. Her 2022 book, Menopausing, won book of the year at the British Book Awards. The same year, McCall fronted the Channel 4 documentary Davina McCall: Sex, Mind And The Menopause, and told the BBC that perimenopausal symptoms caused her difficulties multi-tasking and she considered that she had a brain tumour or Alzheimer's disease at the time. In 2023, she was appointed Member of the Order of the British Empire (MBE) for services to broadcasting. The presenter has previously raised money for Cancer Research UK by running the Race For Life in honour of her late sister, Caroline Baday, who died from lung cancer in 2012 at the age of 50. Read more from Sky News:Kendrick Lamar leads Grammy nodsCelebrity Traitors star reveals double-bluff Married twice, McCall has three children, two daughters and a son, with her second husband, presenter Matthew Robertson. She lives with her fiance, hairdresser Michael Douglas, and presents a weekly lifestyle podcast with him, called Making The Cut."
    },
    {
        "title": "Missed congeniality: Beauty pageant organiser accused of calling contestant a 'dumbhead'",
        "description": "The organiser of Miss Universe has told Sky News he cannot stand down from his position - despite allegations he was aggressive towards a contestant.",
        "url": "https://news.sky.com/story/missed-congeniality160beauty-pageant-organiser-accused-of-calling-contestant-a-dumbhead-13466151",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-miss-universe-nawat_7075308.jpg?20251108140101",
        "type": "Entertainment",
        "Author": "Lucy Marley, video journalist",
        "Date Published": "2025-11-08 02:55:00",
        "Headline": "Nawat Itsaragrisil reprimanded Miss Mexico in a video that's gone viral - and at a news conference, he sobbed dramatically while asking for forgiveness.",
        "Content": "By Lucy Marley, video journalist    The organiser of Miss Universe has told Sky News he cannot stand down from his position - despite allegations he was aggressive towards a contestant. In a video that's now gone viral, Nawat Itsaragrisil appeared to reprimand Miss Mexico after she had failed to post promotional content about Thailand - this year's host country - online. Reporters at the event claimed he had called Fatima Bosch a \"dumbhead\" - something he has firmly denied. After the verbal altercation, she replied: \"You are not respecting me as a woman.\" Nawat then called for security and Bosch walked out of the room. She was joined by other contestants in a show of solidarity, including the reigning Miss Universe. The pageant's president, Mexican businessman Raul Rocha, has described his behaviour as \"public aggression\" and \"serious abuse\". At a news conference, Nawat insisted he had used the word \"damage\" rather than \"dumbhead\" - and urged reporters to check footage of the incident online. \n                  Glasgow Central: Rush-hour delays after swan found on tracks at major UK railway station\n                 \n                  Comedy Wildlife Awards 2025: The funniest animal photos of the year\n                 \n                  Zombies take to the streets in Mexico City for annual parade\n                 However, he added: \"This issue has dragged me down to this point. I understand and I apologise.\" When pressed further by journalists, Nawat appeared to start sobbing and said: \"I am a human who can feel hurt.\" He has also apologised to contestants, adding: \"If anyone (was) affected and not comfortable, it happened, I am so sorry. It's passed. Okay? Are you happy?\" The controversy has overshadowed the Miss Universe contest, with several events to go until the grand final on 21 November."
    },
    {
        "title": "Missed congeniality: Beauty pageant organiser accused of calling contestant a 'dumbhead'",
        "description": "The organiser of Miss Universe has told Sky News he cannot stand down from his position - despite allegations he was aggressive towards a contestant.",
        "url": "https://news.sky.com/story/missed-congeniality160beauty-pageant-organiser-accused-of-calling-contestant-a-dumbhead-13466151",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-miss-universe-nawat_7075308.jpg?20251108140101",
        "type": "Strange",
        "Author": "Lucy Marley, video journalist",
        "Date Published": "2025-11-08 02:55:00",
        "Headline": "Nawat Itsaragrisil reprimanded Miss Mexico in a video that's gone viral - and at a news conference, he sobbed dramatically while asking for forgiveness.",
        "Content": "By Lucy Marley, video journalist    The organiser of Miss Universe has told Sky News he cannot stand down from his position - despite allegations he was aggressive towards a contestant. In a video that's now gone viral, Nawat Itsaragrisil appeared to reprimand Miss Mexico after she had failed to post promotional content about Thailand - this year's host country - online. Reporters at the event claimed he had called Fatima Bosch a \"dumbhead\" - something he has firmly denied. After the verbal altercation, she replied: \"You are not respecting me as a woman.\" Nawat then called for security and Bosch walked out of the room. She was joined by other contestants in a show of solidarity, including the reigning Miss Universe. The pageant's president, Mexican businessman Raul Rocha, has described his behaviour as \"public aggression\" and \"serious abuse\". At a news conference, Nawat insisted he had used the word \"damage\" rather than \"dumbhead\" - and urged reporters to check footage of the incident online. \n                  Glasgow Central: Rush-hour delays after swan found on tracks at major UK railway station\n                 \n                  Comedy Wildlife Awards 2025: The funniest animal photos of the year\n                 \n                  Zombies take to the streets in Mexico City for annual parade\n                 However, he added: \"This issue has dragged me down to this point. I understand and I apologise.\" When pressed further by journalists, Nawat appeared to start sobbing and said: \"I am a human who can feel hurt.\" He has also apologised to contestants, adding: \"If anyone (was) affected and not comfortable, it happened, I am so sorry. It's passed. Okay? Are you happy?\" The controversy has overshadowed the Miss Universe contest, with several events to go until the grand final on 21 November."
    }
]