[
    {
        "title": "'US security guarantee' the only path to peace in Ukraine, Starmer says - ahead of Trump meeting next week",
        "description": "A \"US security guarantee\" is the only path to peace in Ukraine, Sir Keir Starmer has said. ",
        "url": "https://news.sky.com/story/us-backstop-is-only-path-to-peace-in-ukraine-starmer-says-ahead-of-trump-meeting-next-week-13311500",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-paris-security-summit_6831903.jpg?20250217192149",
        "type": "Home",
        "Author": "Andy Hayes, news reporter",
        "Date Published": "2025-02-17 15:49:00",
        "Headline": "The prime minister says we are in a \"new era\" in which nations cannot \"cling hopelessly to the comforts of the past\" - after attending talks in Paris.",
        "Content": "By Andy Hayes, news reporter   A \"US security guarantee\" is the only path to peace in Ukraine, Sir Keir Starmer has said.  Speaking in Paris after an emergency summit with European leaders, the prime minister said a \"US backstop\" is the \"only way to effectively deter Russia from attacking Ukraine again\". And he said the future of Ukraine is not the only thing at stake. \"It is an existential question for Europe as a whole, and therefore vital for Britain's national interests,\" he added. \"This is a once in a generation moment for the collective security of our continent.\" It is a \"new era\", he said, in which nations cannot \"cling hopelessly to the comforts of the past\". Any peace deal for Ukraine must \"safeguard its sovereignty\" and deter Russian leader Vladimir Putin from engaging in \"further aggression in the future\", Sir Keir added. Follow live: Russia gives more details ahead of peace talks with US The prime minister joined the leaders of France, Germany, Italy, Poland, Spain, the Netherlands, Denmark and the European Union at the Elysee Palace in Paris, alongside NATO secretary general Mark Rutte. The meeting was called by French President Emmanuel Macron after Donald Trump shocked continental leaders by arranging bilateral talks between the US and Russia - excluding Europe and Ukraine. The talks are set to begin in Saudi Arabia on Tuesday. Sir Keir however insisted that \"Europe must play its role\", adding: \"I'm prepared to consider committing British forces on the ground alongside others if there is a lasting peace agreement. \"So I will go to Washington next week to meet President Trump and discuss what we see as the key elements of a lasting peace.\" It is \"clear the US is not going to leave NATO\", Sir Keir said. Analysis: Sombre Starmer confronts emerging new world order He added: \"But we Europeans will have to do more. The issue of burden sharing is not new, but it is now pressing and Europeans will have to step up, both in terms of spending and the capabilities that we provide. \"I spoke to President Zelenskyy on Friday. I will do so again in the coming days. And we envisage further [engagement] with European colleagues when I return from the US.\" Britain will \"take a leading responsibility, as we always have\", the prime minister said, adding that \"democracy must prevail\".  Read more:Pope stable in hospital and 'asks for prayers'Israel says it will receive bodies of four hostages Mr Trump stunned Ukraine and Europe last week when he announced he had called Mr Putin to discuss ending the war, without consulting them. Leaders have been left scrambling to confront a new future in which they have less US protection and support and must do more to ensure the security of their own continent. Asked by Sky News's Europe correspondent, Adam Parsons, whether the US has undermined the UK, Europe and Ukraine by unilaterally starting talks with Russia, Sir Keir said the US wanted \"lasting peace\", as did Ukraine, before reiterating his point about a \"US backstop\" being necessary to support any security guarantees."
    },
    {
        "title": "Emergency teams responding after plane crash in Toronto",
        "description": "At least 18 people have been injured in a plane crash that's left an aircraft upside down at a Canadian airport, an official has said. ",
        "url": "https://news.sky.com/story/emergency-teams-responding-after-incident-involving-plane-during-landing-in-canada-toronto-pearson-airport-says-13311604",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-plane-toronto_6831981.jpg?20250217204547",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-17 19:56:00",
        "Headline": "Footage from the airport shows the snow-covered plane upside down on the tarmac. ",
        "Content": " At least 18 people have been injured in a plane crash that's left an aircraft upside down at a Canadian airport, an official has said.  Images from Toronto Pearson International Airport show the snow-covered plane belly up on the tarmac. The flight, operated by Delta subsidiary Endeavor Air, crashed while landing at around 2.30pm local time (7.30pm UK time). All 80 people on board - 76 passengers and four crew - were evacuated, the Federal Aviation Administration (FAA) said. In a press conference, Toronto Pearson fire chief Todd Aitken said 18 people had been injured. A spokesperson for the Peel Region paramedic service told Sky News the injuries ranged from minor to serious - but none were life-threatening. The fire chief added that there had been no crosswinds and the runway was dry at the time of the incident. Canada Police has said it does not know the circumstances surrounding the crash. The airport posted on X that the incident involved a plane arriving from Minneapolis. \"Emergency teams are responding. All passengers and crew are accounted for,\" the statement added. Ontario's premier Doug Ford said he is \"relieved there are no casualties after the incident\". \"Provincial officials are in contact with the airport and local authorities and will provide any help that's needed,\" he added in a post on X. Delta has said it is aware of reports of an incident involving an Endeavor Air flight, and Canada's Transportation Safety Board has said it is \"deploying a team to investigate\" the accident. All departures and arrivals at the airport were paused minutes after the crash. They resumed at 5pm local time (10pm UK time) but Delta flights will remain suspended until the end of the day, the airline said. More from Sky News:Hospitalised pope 'asks for prayers'Rebels seize second city in Congo Toronto has been blighted by bad weather in recent days and this afternoon, the airport was experiencing blowing snow and winds of up to 65mph, according to the Meteorological Service of Canada. The temperature was around -8.6C. Prior to the crash, dozens of departures and arrivals at the airport had been delayed due to the weather. The airport had posted images on X after 53cm of snow fell over the past week. The incident comes after two recent crashes in North America. Last month 67 people killed when an army helicopter collided with a passenger jet in Washington DC. In a separate incident, at least seven people died in a medical transport plane crash in Philadelphia."
    },
    {
        "title": "Woman shot dead at Kent pub on Valentine's Day named by police",
        "description": "A woman who was shot dead at a village pub in Kent on Valentine's Day has been named by police. ",
        "url": "https://news.sky.com/story/woman-shot-dead-at-kent-pub-on-valentines-day-named-by-police-13311283",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/2372502170289854307_6831718.jpg?20250217152823",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-17 08:35:00",
        "Headline": "Kent Police named the victim of the shooting as 43-year-old Lisa Smith. Officers said they believed the suspect in the shooting had fallen from a bridge and they were \"focusing efforts on searches to recover him from the water\".",
        "Content": "A woman who was shot dead at a village pub in Kent on Valentine's Day has been named by police.  Lisa Smith, 43, from Slough, was pronounced dead outside The Three Horseshoes in Knockholt on Friday evening. The suspect, who was known to the victim, fled in a car that was seen a few hours later on the Queen Elizabeth II bridge, which crosses the River Thames at Dartford, 17 miles away. It comes as a CCTV recording which captured the sound of gunshots near the site of the shooting has been released. Footage also shows a heavy police presence on the bridge where the suspect's vehicle was found.  Detectives said a gun was discovered inside the vehicle and they were not looking for anyone else in connection with the shooting. In a statement on Monday, Kent Police said they believed the suspect fell from the bridge and \"officers are focusing efforts on searches to recover him from the water\". While officers said the victim and suspect were known to each other, they have not revealed how they are connected. Michelle Thomas, who runs The Three Horseshoes pub near Sevenoaks, told Sky News she heard two loud bangs that she initially \"thought were fireworks\" on the night of the shooting. She described the aftermath, describing \"so much commotion - screaming, shouting, crying\" and adding the attack had left the community in \"absolute shock\". She said the victim, Ms Smith, had been to the pub before \"mostly in the summer\" but \"wasn't a regular\". Read more from Sky News:Polar vortex threatens USHospitalised pope 'asks for prayers'Expect military cuts unless spending rises On Saturday, there was intense activity from forensic teams in white overalls gathering evidence from the car park next to the pub. The focus of the investigation was bullet casings reportedly on the ground next to a blue Seat, which had a smashed front passenger window. Over the weekend, flowers were laid outside the pub near the scene of the shooting. Kent Police previously said: \"Specialist officers continue to work with the families of both parties involved to support them following this tragic incident.\""
    },
    {
        "title": "Princess of Wales shares portraits drawn by George, Charlotte and Louis",
        "description": "The Princess of Wales has shared a series of portraits drawn by herself, Prince George, Princess Charlotte and Prince Louis. ",
        "url": "https://news.sky.com/story/princess-of-wales-shares-portraits-drawn-by-george-charlotte-and-louis-13311478",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-princess-of-wales-kate_6680518.jpg?20240909163613",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-17 14:59:00",
        "Headline": "The artworks - which also include one by the Princess of Wales herself - have been shared to promote Kate's Shaping Us initiative, which promotes early years education. ",
        "Content": "The Princess of Wales has shared a series of portraits drawn by herself, Prince George, Princess Charlotte and Prince Louis.  Pictures of the artworks were shared on Instagram to help publicise Kate's Shaping Us campaign, which highlights how children begin developing social and emotional skills in early childhood. The caption reads: \"Drawing portraits with children can provide a moment of connection as you spend time looking at and focusing on one another, as well as being creative and - most importantly - having lots of fun together!\" While Kensington Palace has not confirmed which family member created each portrait - or who they are of - it appears the children have all drawn their mother. The first image, in red, shows a figure with long hair and a shirt collar, as does the second, which features more colours. The third is a portrait of a long-haired person sitting in an armchair. The final image is the only which differs. It's a chalk portrait of a young boy, possibly Prince Louis, with his eyes closed. It's not the first time the Wales family have shown their artistic sides. Kate is a keen photographer and she's been behind the lens for many of the official photos of George, 11, Charlotte, nine, and six-year-old Louis released over the years. More from Sky News:Royals release Valentine's messagesKate visits children's hospice Earlier this month, the palace released a photo of the princess to mark World Cancer Day, which had been taken by Louis. Kate revealed she had finished chemotherapy and was \"cancer free\" in a video released in November last year. In 2022, the Prince and Princess of Wales marked Christmas Day by sharing a painting of a reindeer with two robins by George. William, Kate and their children are currently enjoying a half-term holiday, according to reports."
    },
    {
        "title": "Woman stole nearly £3,000 worth of Jellycat toys from garden centres sentenced",
        "description": "A woman who stole Jellycat soft toys worth almost &#163;3,000 from garden centres in Norfolk has been sentenced for shoplifting.",
        "url": "https://news.sky.com/story/woman-stole-nearly-1633000-worth-of-jellycat-toys-from-garden-centres-sentenced-13311618",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-jellycat-toys-ruby-smith_6831972.jpg?20250217212531",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-17 20:33:00",
        "Headline": "Ruby Smith, who had around 40 of the collectables when police raided her home, admitted seven counts of theft and was handed a 26-week prison sentence suspended for 24 months.",
        "Content": "A woman who stole Jellycat soft toys worth almost £3,000 from garden centres in Norfolk has been sentenced for shoplifting. Ruby Smith, 35, from Eye in Suffolk, was handed a 26-week prison sentence, suspended for 24 months, after admitting seven counts of theft from a shop at an earlier hearing, Norfolk Police said. Smith, who was found to have around 40 of the collectables when police raided her home, was also ordered to pay £1,400 in compensation and a £154 victim surcharge at Norwich Crown Court on Monday. She was caught on CCTV walking around stores and putting the cuddly toys into her bag, her clothing, or a child's pram before walking out without paying. The seven incidents of shoplifting, between July and September last year, happened at three different Norfolk garden centres in Bressingham, Wroxham, and Thetford. Read more:Kate shares childrens' portraitsUK ticketholder claims £63m jackpotPlane upside down after landing Smith was also made subject to electronic monitoring for three months and was ordered to attend an accredited programme for 40 days and complete up to seven days at a rehabilitation activity programme. Jellycat, founded in London in 1999, is known for its plush toys, which retail on its website from around £12 for smaller items up to £200 for a giant one."
    },
    {
        "title": "Pope stable in hospital and 'asks for prayers', Vatican says - as doctors treat 'complex' infection",
        "description": "The pope's condition is \"stable\" and he is \"touched by messages of affection\", the Vatican has said in an update amid his hospital stay. ",
        "url": "https://news.sky.com/story/pope-francis-in-hospital-for-fourth-day-as-he-continues-bronchitis-treatment-13311315",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pope-francis-vatican_6830249.jpg?20250217125924",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-17 09:16:00",
        "Headline": "The Vatican said Pope Francis will be in hospital for as long as necessary - while the pontiff has continued to make phone calls from his bed to members of a Catholic parish in Gaza.",
        "Content": "The pope's condition is \"stable\" and he is \"touched by messages of affection\", the Vatican has said in an update amid his hospital stay.  Earlier on Monday, the Vatican said Pope Francis' respiratory tract infection is presenting a \"complex clinical picture\" and he will need to remain in hospital. Concerns have been growing about the 88-year-old's increasingly frail health. Spokesman Matteo Bruni said the results of tests conducted in recent days indicate the pontiff is suffering from a \"polymicrobial respiratory tract infection\" that needed a further change in his drug therapy. Polymicrobial infections are caused by a mix of viruses, bacteria, fungi and parasites. In a later update on Monday, the Vatican said his clinical conditions are stable and that he \"read and worked\" on Monday morning, adding \"he's touched by the numerous messages of affection and closeness that he continues to receive in these hours\". \"In particular he intends to thank those who are currently hospitalised, for the affection and love that they express through the drawings and good wishes; he prays for them and asks that they pray for him.\" It was not specified earlier whether the pope was suffering from a bacterial or viral infection. There was no length of time given for the pope's hospitalisation, but the spokesman added the complexity of his symptoms \"will require an appropriate hospital stay\".  The pope was admitted to Rome's Gemelli hospital in a \"fair\" condition on Friday to be treated for a respiratory tract infection. His doctors have advised complete rest. He was unable to deliver his regular weekly prayer on Sunday to pilgrims in St Peter's Square or lead a special mass for artists to mark the Catholic Church's Jubilee Year. On social media at the weekend, the pope wrote: \"Thank you for the affection, prayer and closeness with which you accompany me in these days.\" The pope had been suffering from bronchitis for more than a week before he was taken to hospital. He is said to have insisted on finishing his morning audiences on Friday before leaving the Vatican to be admitted to hospital. The pope was finding it increasingly difficult to complete speeches and commitments last week because he was short of breath. 'Pope sounded a bit tired' However, from his hospital bed at the weekend, the pope continued to make phone calls to members of a Catholic parish in Gaza, Italian broadcaster Mediaset reported. A parish member said the pope had called on both Friday and Saturday and was in \"good humour\" but sounded \"a bit tired\". The pope's next scheduled appointment is his weekly general audience on Wednesday. He is then due to preside on Sunday at the ordination of deacons as part of a Holy Year weekend. Both commitments remain on the official Vatican schedule, but appear to be in doubt. Read more on Sky News:Polar vortex to bring 'life-threatening cold' to USSinger Conor Maynard issues health update The pontiff is being treated at Rome's largest hospital in a suite designed for popes. The Argentinian pope had part of one lung removed after a pulmonary infection as a young man. When he had a bad case of pneumonia in 2023, he left hospital after three days - he later said he had been admitted after feeling faint and having a sharp pain in his chest. In the same year, Pope Francis spent nine days at the Gemelli hospital when he had surgery for an abdominal hernia. Science and technology editor As we age, our ability to fight off infections or ailments that wouldn't have troubled us before gradually diminishes. Pope Francis is 88 and unlike many people lucky enough to live that long, has a demanding job that likely leaves less time for the rest that our bodies, especially ageing ones, need. The latest update from the Vatican suggests he isn't gravely ill – able to sit up and eat breakfast – but that his doctors have concluded the bronchitis he is suffering will require a longer hospital stay. Bronchitis – an inflammation of the main airways leading to the lungs – can be severe as it can narrow those pipes leading to difficulty breathing. It's only a real concern if the infection doesn't respond well to treatment and spreads deeper into the lungs themselves causing pneumonia. The Vatican has said the pope's infection is \"polymicrobial\" meaning more than one type of microbe (bacteria, virus or fungal agent) has been identified. That will mean adjusting the types of medication used to treat the infection, which in some cases can be tricky, especially if one of the bugs is resistant to common antimicrobial drugs – something that is increasingly common. The pope is possibly more vulnerable to lung infections than a person of equivalent age as he had part of one lung removed following a severe infection when he was just 21. He was previously hospitalised in 2023 with pneumonia and made a good recovery. Beyond that, it's unwise for anyone to pontificate on anyone's personal health, least of all the pontiff's."
    },
    {
        "title": "Craig and Lindsay Foreman were warned to not travel to 'unsafe' Balochistan",
        "description": "A Pakistani carpenter has told Sky News he warned a British couple who have been detained in Iran not to travel to dangerous parts of Balochistan.",
        "url": "https://news.sky.com/story/craig-and-lindsay-foreman-were-warned-to-not-travel-to-unsafe-balochistan-13311521",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-lindsay-foreman-iran_6829326.jpg?20250217112820",
        "type": "Home",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2025-02-17 16:38:00",
        "Headline": "The British couple, who were on a motorcycling trip across the globe, have been detained on security-related charges in Iran. A man has now told Sky News he warned them against travelling to some \"unsafe\" areas. ",
        "Content": "\n          News correspondent\n              @esadiya\n  A Pakistani carpenter has told Sky News he warned a British couple who have been detained in Iran not to travel to dangerous parts of Balochistan. Khalid Mehmood, 30, said he had been looking forward to meeting Craig and Lindsay Foreman after they told him they expected to cross the border from Iran on 20 January and then travel to Quetta, the capital of Balochistan - a province of Pakistan. He said hasn't spoken to the couple for weeks. Mr and Ms Foreman were reportedly held in Iran in January but the country's state-run media revealed last week they had been accused of security-related offences. According to Ms Foreman's social media, the couple were on a motorbiking trip across the globe to Australia as part of a positive psychology mission.  \"I am very happy whenever any foreigners come to explore Pakistan,\" Mr Mehmood, who is based in Islamabad, told Sky News, explaining he had recommended \"beautiful cities\" for the couple to visit. \"I stopped them going to some Balochistan cities because they are not safe,\" he said. On 30 December, Ms Foreman posted about how they were about to face \"one of the most challenging\" parts of their trip: Iran and Pakistan. Ms Foreman's most recent Facebook post was shared on 3 January and detailed a meeting with a mullah in Isfahan, a city in central Iran. Iranian state media said on Wednesday that a man and woman were in custody on security-related charges in the south-eastern city of Kerman. The couple's family later confirmed their identity. Mr Mehmood said Ms Foreman had asked for travel advice from locals via Facebook and that she had been advised against travelling through the Balochistan belt, which runs from Taftan on the border with Iran to Quetta. Social media users responding to Ms Foreman said people in the area drive cars and buses \"like maniacs,\" and truck drivers are \"sleep deprived or high\". Read more:What we know about the ForemansFormer Iranian prisoner speaks out In a Facebook post, Ms Foreman explained how she and her husband had to change their original route after failing to get visas for Algeria. The couple were planning to arrive in Brisbane, Australia, by 1 July, where Ms Foreman is due to attend a psychology conference. The Foreign Office warns people are at risk of \"arrest, detention and a death sentence\" if they travel to Iran. It also advises against all travel to Balochistan, except the province's southern coast. A Foreign Office spokesperson earlier said: \"We are providing consular assistance to two British nationals detained in Iran and are in contact with the local authorities.\""
    },
    {
        "title": "Chiltern Firehouse: Fire at luxury London hotel 'started from pizza oven'",
        "description": "A fire that ripped through a luxury central London hotel popular with celebrities started accidentally from a pizza oven, the London Fire Brigade (LFB) has said.",
        "url": "https://news.sky.com/story/chiltern-firehouse-fire-at-luxury-london-hotel-started-from-pizza-oven-13311564",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-chiltern-firehouse_6828973.jpg?20250214200837",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-17 18:07:00",
        "Headline": "Burning wood fell from a ground-floor oven, setting fire to the space between the basement and ground floor at the five-star hotel, which had been due to host a star-studded post-BAFTA Film Awards party on Sunday evening.",
        "Content": " A fire that ripped through a luxury central London hotel popular with celebrities started accidentally from a pizza oven, the London Fire Brigade (LFB) has said. Chiltern Firehouse was partially destroyed by the Valentine's Day fire, which began when burning wood fell from the oven, \"igniting the void between the basement and ground floor,\" LFB said. The five-star hotel in Marylebone, a repurposed former fire station, had been due to host a star-studded post-BAFTA Film Awards party on Sunday evening. It spread via ducting, pipes, or tubes used to ventilate buildings, and damaged parts of the ground floor and half of the second floor and destroyed the third floor and roof of the four-storey hotel, London Fire Brigade said. Assistant commissioner Paul McCourt said: \"Crews worked incredibly hard for over eight hours in arduous conditions. \"Presented with a complex fire in a historically significant building, formerly Manchester Square Fire Station, firefighters successfully contained the fire, preventing it from spreading to neighbouring properties.\" Around 100 people were evacuated and there were no injuries as a result of the blaze, which started shortly before 3pm on Friday and was tackled by around 125 firefighters. Read more from Sky News:Driver charged over girl's death'We can't keep knives out of schools'Woman shot dead on Valentine's Day named The venue's bar and restaurant are popular with British stars, as well as celebrities visiting the capital. Taylor Swift chose it for a night out after finishing her Wembley shows last year, while the likes of Tom Cruise and Kate Moss have also been spotted over the years."
    },
    {
        "title": "At least 31 dead after bus crash in Bolivia",
        "description": "At least 31 people have died after a bus crash in Bolivia, police have said.",
        "url": "https://news.sky.com/story/at-least-31-dead-after-bus-crash-in-bolivia-13311649",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-istock-potosi-bolivia_6832048.jpg?20250217222752",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-17 22:16:00",
        "Headline": "The mountainous route the vehicle was on has lots of twists and turns, a police officer says.",
        "Content": "At least 31 people have died after a bus crash in Bolivia, police have said. An officer said the driver appeared to have lost control of the vehicle, causing it to drop more than 2,600 ft (800m) off a precipice in the southwestern area of Yocalla. Among the injured, 10 adults and four children were taken to hospital, with several in intensive care, a healthcare official said. The mountainous route the vehicle was on has lots of twists and turns, the police officer said, adding that speed could have been another factor in the accident. Read more on Sky News:Delta plane upside down on Toronto runwayWoman shot dead at Kent pub on Valentine's Day named"
    },
    {
        "title": "EuroMillions ticketholder in UK stakes claim for £65m jackpot",
        "description": "A single ticketholder in the UK has put forward a claim for Friday's &#163;65.3m EuroMillions jackpot, the National Lottery operator says.",
        "url": "https://news.sky.com/story/euromillions-ticketholder-in-uk-stakes-claim-for-16365m-jackpot-13311441",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-lottery-ticket-euromillions_6640536.jpg?20241128141219",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-17 13:44:00",
        "Headline": "Last month someone from the UK also bagged the top prize in the EuroMillions draw, after an anonymous winner took home £83.4m in January.",
        "Content": "A single ticketholder in the UK has put forward a claim for Friday's £65.3m EuroMillions jackpot, the National Lottery operator says. It is the second time this year that a UK ticketholder has scooped the top prize, according to Allwyn. January's £83.4m EuroMillions jackpot was won by an anonymous UK winner, who ranks 23rd on the lottery's \"most spectacular\" wins of all time. The Valentine's Day win will now go through the process of validation and if confirmed it will be up to the ticketholder if they go public. But Allwyn also says other people may be missing out. Andy Carter, from the National Lottery operator, said: \"It's been an astonishing weekend of millionaire-making... but we are still missing seven from 14 EuroMillions millionaires from Friday night's special draw. \"We're asking everyone to check their tickets and we're very much looking forward to meeting all the lucky winners soon.\" Read more from Sky News:Reform UK's Tice on climate changeConcerns grow for the Pope's healthVictim of Valentine's Day shooting named Meanwhile, a perfect match was made in Saturday's Lotto draw, bagging one ticketholder a jackpot of £7.4m who came forward over the weekend. Last year four UK players banked EuroMillions jackpots including one payout of £177m at the end of November - the third largest ever won by a British player."
    },
    {
        "title": "'US security guarantee' the only path to peace in Ukraine, Starmer says - ahead of Trump meeting next week",
        "description": "A \"US security guarantee\" is the only path to peace in Ukraine, Sir Keir Starmer has said. ",
        "url": "https://news.sky.com/story/us-backstop-is-only-path-to-peace-in-ukraine-starmer-says-ahead-of-trump-meeting-next-week-13311500",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-paris-security-summit_6831903.jpg?20250217192149",
        "type": "UK",
        "Author": "Andy Hayes, news reporter",
        "Date Published": "2025-02-17 15:49:00",
        "Headline": "The prime minister says we are in a \"new era\" in which nations cannot \"cling hopelessly to the comforts of the past\" - after attending talks in Paris.",
        "Content": "By Andy Hayes, news reporter   A \"US security guarantee\" is the only path to peace in Ukraine, Sir Keir Starmer has said.  Speaking in Paris after an emergency summit with European leaders, the prime minister said a \"US backstop\" is the \"only way to effectively deter Russia from attacking Ukraine again\". And he said the future of Ukraine is not the only thing at stake. \"It is an existential question for Europe as a whole, and therefore vital for Britain's national interests,\" he added. \"This is a once in a generation moment for the collective security of our continent.\" It is a \"new era\", he said, in which nations cannot \"cling hopelessly to the comforts of the past\". Any peace deal for Ukraine must \"safeguard its sovereignty\" and deter Russian leader Vladimir Putin from engaging in \"further aggression in the future\", Sir Keir added. Follow live: Russia gives more details ahead of peace talks with US The prime minister joined the leaders of France, Germany, Italy, Poland, Spain, the Netherlands, Denmark and the European Union at the Elysee Palace in Paris, alongside NATO secretary general Mark Rutte. The meeting was called by French President Emmanuel Macron after Donald Trump shocked continental leaders by arranging bilateral talks between the US and Russia - excluding Europe and Ukraine. The talks are set to begin in Saudi Arabia on Tuesday. Sir Keir however insisted that \"Europe must play its role\", adding: \"I'm prepared to consider committing British forces on the ground alongside others if there is a lasting peace agreement. \"So I will go to Washington next week to meet President Trump and discuss what we see as the key elements of a lasting peace.\" It is \"clear the US is not going to leave NATO\", Sir Keir said. Analysis: Sombre Starmer confronts emerging new world order He added: \"But we Europeans will have to do more. The issue of burden sharing is not new, but it is now pressing and Europeans will have to step up, both in terms of spending and the capabilities that we provide. \"I spoke to President Zelenskyy on Friday. I will do so again in the coming days. And we envisage further [engagement] with European colleagues when I return from the US.\" Britain will \"take a leading responsibility, as we always have\", the prime minister said, adding that \"democracy must prevail\".  Read more:Pope stable in hospital and 'asks for prayers'Israel says it will receive bodies of four hostages Mr Trump stunned Ukraine and Europe last week when he announced he had called Mr Putin to discuss ending the war, without consulting them. Leaders have been left scrambling to confront a new future in which they have less US protection and support and must do more to ensure the security of their own continent. Asked by Sky News's Europe correspondent, Adam Parsons, whether the US has undermined the UK, Europe and Ukraine by unilaterally starting talks with Russia, Sir Keir said the US wanted \"lasting peace\", as did Ukraine, before reiterating his point about a \"US backstop\" being necessary to support any security guarantees."
    },
    {
        "title": "Woman shot dead at Kent pub on Valentine's Day named by police",
        "description": "A woman who was shot dead at a village pub in Kent on Valentine's Day has been named by police. ",
        "url": "https://news.sky.com/story/woman-shot-dead-at-kent-pub-on-valentines-day-named-by-police-13311283",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/2372502170289854307_6831718.jpg?20250217152823",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-17 08:35:00",
        "Headline": "Kent Police named the victim of the shooting as 43-year-old Lisa Smith. Officers said they believed the suspect in the shooting had fallen from a bridge and they were \"focusing efforts on searches to recover him from the water\".",
        "Content": "A woman who was shot dead at a village pub in Kent on Valentine's Day has been named by police.  Lisa Smith, 43, from Slough, was pronounced dead outside The Three Horseshoes in Knockholt on Friday evening. The suspect, who was known to the victim, fled in a car that was seen a few hours later on the Queen Elizabeth II bridge, which crosses the River Thames at Dartford, 17 miles away. It comes as a CCTV recording which captured the sound of gunshots near the site of the shooting has been released. Footage also shows a heavy police presence on the bridge where the suspect's vehicle was found.  Detectives said a gun was discovered inside the vehicle and they were not looking for anyone else in connection with the shooting. In a statement on Monday, Kent Police said they believed the suspect fell from the bridge and \"officers are focusing efforts on searches to recover him from the water\". While officers said the victim and suspect were known to each other, they have not revealed how they are connected. Michelle Thomas, who runs The Three Horseshoes pub near Sevenoaks, told Sky News she heard two loud bangs that she initially \"thought were fireworks\" on the night of the shooting. She described the aftermath, describing \"so much commotion - screaming, shouting, crying\" and adding the attack had left the community in \"absolute shock\". She said the victim, Ms Smith, had been to the pub before \"mostly in the summer\" but \"wasn't a regular\". Read more from Sky News:Polar vortex threatens USHospitalised pope 'asks for prayers'Expect military cuts unless spending rises On Saturday, there was intense activity from forensic teams in white overalls gathering evidence from the car park next to the pub. The focus of the investigation was bullet casings reportedly on the ground next to a blue Seat, which had a smashed front passenger window. Over the weekend, flowers were laid outside the pub near the scene of the shooting. Kent Police previously said: \"Specialist officers continue to work with the families of both parties involved to support them following this tragic incident.\""
    },
    {
        "title": "Craig and Lindsay Foreman were warned to not travel to 'unsafe' Balochistan",
        "description": "A Pakistani carpenter has told Sky News he warned a British couple who have been detained in Iran not to travel to dangerous parts of Balochistan.",
        "url": "https://news.sky.com/story/craig-and-lindsay-foreman-were-warned-to-not-travel-to-unsafe-balochistan-13311521",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-lindsay-foreman-iran_6829326.jpg?20250217112820",
        "type": "UK",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2025-02-17 16:38:00",
        "Headline": "The British couple, who were on a motorcycling trip across the globe, have been detained on security-related charges in Iran. A man has now told Sky News he warned them against travelling to some \"unsafe\" areas. ",
        "Content": "\n          News correspondent\n              @esadiya\n  A Pakistani carpenter has told Sky News he warned a British couple who have been detained in Iran not to travel to dangerous parts of Balochistan. Khalid Mehmood, 30, said he had been looking forward to meeting Craig and Lindsay Foreman after they told him they expected to cross the border from Iran on 20 January and then travel to Quetta, the capital of Balochistan - a province of Pakistan. He said hasn't spoken to the couple for weeks. Mr and Ms Foreman were reportedly held in Iran in January but the country's state-run media revealed last week they had been accused of security-related offences. According to Ms Foreman's social media, the couple were on a motorbiking trip across the globe to Australia as part of a positive psychology mission.  \"I am very happy whenever any foreigners come to explore Pakistan,\" Mr Mehmood, who is based in Islamabad, told Sky News, explaining he had recommended \"beautiful cities\" for the couple to visit. \"I stopped them going to some Balochistan cities because they are not safe,\" he said. On 30 December, Ms Foreman posted about how they were about to face \"one of the most challenging\" parts of their trip: Iran and Pakistan. Ms Foreman's most recent Facebook post was shared on 3 January and detailed a meeting with a mullah in Isfahan, a city in central Iran. Iranian state media said on Wednesday that a man and woman were in custody on security-related charges in the south-eastern city of Kerman. The couple's family later confirmed their identity. Mr Mehmood said Ms Foreman had asked for travel advice from locals via Facebook and that she had been advised against travelling through the Balochistan belt, which runs from Taftan on the border with Iran to Quetta. Social media users responding to Ms Foreman said people in the area drive cars and buses \"like maniacs,\" and truck drivers are \"sleep deprived or high\". Read more:What we know about the ForemansFormer Iranian prisoner speaks out In a Facebook post, Ms Foreman explained how she and her husband had to change their original route after failing to get visas for Algeria. The couple were planning to arrive in Brisbane, Australia, by 1 July, where Ms Foreman is due to attend a psychology conference. The Foreign Office warns people are at risk of \"arrest, detention and a death sentence\" if they travel to Iran. It also advises against all travel to Balochistan, except the province's southern coast. A Foreign Office spokesperson earlier said: \"We are providing consular assistance to two British nationals detained in Iran and are in contact with the local authorities.\""
    },
    {
        "title": "Chiltern Firehouse: Fire at luxury London hotel 'started from pizza oven'",
        "description": "A fire that ripped through a luxury central London hotel popular with celebrities started accidentally from a pizza oven, the London Fire Brigade (LFB) has said.",
        "url": "https://news.sky.com/story/chiltern-firehouse-fire-at-luxury-london-hotel-started-from-pizza-oven-13311564",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-chiltern-firehouse_6828973.jpg?20250214200837",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-17 18:07:00",
        "Headline": "Burning wood fell from a ground-floor oven, setting fire to the space between the basement and ground floor at the five-star hotel, which had been due to host a star-studded post-BAFTA Film Awards party on Sunday evening.",
        "Content": " A fire that ripped through a luxury central London hotel popular with celebrities started accidentally from a pizza oven, the London Fire Brigade (LFB) has said. Chiltern Firehouse was partially destroyed by the Valentine's Day fire, which began when burning wood fell from the oven, \"igniting the void between the basement and ground floor,\" LFB said. The five-star hotel in Marylebone, a repurposed former fire station, had been due to host a star-studded post-BAFTA Film Awards party on Sunday evening. It spread via ducting, pipes, or tubes used to ventilate buildings, and damaged parts of the ground floor and half of the second floor and destroyed the third floor and roof of the four-storey hotel, London Fire Brigade said. Assistant commissioner Paul McCourt said: \"Crews worked incredibly hard for over eight hours in arduous conditions. \"Presented with a complex fire in a historically significant building, formerly Manchester Square Fire Station, firefighters successfully contained the fire, preventing it from spreading to neighbouring properties.\" Around 100 people were evacuated and there were no injuries as a result of the blaze, which started shortly before 3pm on Friday and was tackled by around 125 firefighters. Read more from Sky News:Driver charged over girl's death'We can't keep knives out of schools'Woman shot dead on Valentine's Day named The venue's bar and restaurant are popular with British stars, as well as celebrities visiting the capital. Taylor Swift chose it for a night out after finishing her Wembley shows last year, while the likes of Tom Cruise and Kate Moss have also been spotted over the years."
    },
    {
        "title": "Woman stole nearly £3,000 worth of Jellycat toys from garden centres sentenced",
        "description": "A woman who stole Jellycat soft toys worth almost &#163;3,000 from garden centres in Norfolk has been sentenced for shoplifting.",
        "url": "https://news.sky.com/story/woman-stole-nearly-1633000-worth-of-jellycat-toys-from-garden-centres-sentenced-13311618",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-jellycat-toys-ruby-smith_6831972.jpg?20250217212531",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-17 20:33:00",
        "Headline": "Ruby Smith, who had around 40 of the collectables when police raided her home, admitted seven counts of theft and was handed a 26-week prison sentence suspended for 24 months.",
        "Content": "A woman who stole Jellycat soft toys worth almost £3,000 from garden centres in Norfolk has been sentenced for shoplifting. Ruby Smith, 35, from Eye in Suffolk, was handed a 26-week prison sentence, suspended for 24 months, after admitting seven counts of theft from a shop at an earlier hearing, Norfolk Police said. Smith, who was found to have around 40 of the collectables when police raided her home, was also ordered to pay £1,400 in compensation and a £154 victim surcharge at Norwich Crown Court on Monday. She was caught on CCTV walking around stores and putting the cuddly toys into her bag, her clothing, or a child's pram before walking out without paying. The seven incidents of shoplifting, between July and September last year, happened at three different Norfolk garden centres in Bressingham, Wroxham, and Thetford. Read more:Kate shares childrens' portraitsUK ticketholder claims £63m jackpotPlane upside down after landing Smith was also made subject to electronic monitoring for three months and was ordered to attend an accredited programme for 40 days and complete up to seven days at a rehabilitation activity programme. Jellycat, founded in London in 1999, is known for its plush toys, which retail on its website from around £12 for smaller items up to £200 for a giant one."
    },
    {
        "title": "Cory Dove and Matthew Steward inquest: Childhood friends died when quad bike collided with minibus in Turkey",
        "description": "Two childhood friends on holiday in Turkey died when the quad bike they were riding crashed with a minibus, an inquest has heard.",
        "url": "https://news.sky.com/story/cory-dove-and-matthew-steward-inquest-childhood-friends-died-when-quad-bike-collided-with-minibus-in-turkey-13311512",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-matthew-steward-quad-bike_6831750.jpg?20250217160638",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-17 16:06:00",
        "Headline": "Cory Dove, who was driving the quad bike, \"was driving fast on the winding road\", when it entered a bend and \"crossed into\" the opposite lane, hitting a bus travelling at less than 20mph as it headed for a hotel.",
        "Content": "Two childhood friends on holiday in Turkey died when the quad bike they were riding crashed with a minibus, an inquest has heard. Matthew Steward and Cory Dove, both fathers from Harwich in Essex, were riding the hired vehicle when they hit the bus \"head-on\" just before midnight on 13 May last year, Turkish officials said in a report. Construction worker Mr Dove, 26, was driving the quad bike, and Mr Steward, a 26-year-old factory worker, was his passenger, Monday's hearing in Chelmsford was told. Mr Dove \"crashed his ATV (all-terrain vehicle)... while he was driving fast on the winding road\", and both men were thrown from the vehicle, the report said. The bus was on the correct side of the road heading in the opposite direction when, according to the driver, the quad bike entered a bend and \"crossed into my rightful lane\". The bus driver said he was going to a hotel to pick up staff, was travelling at 30kmh (19 mph), and was \"easily able to slow down\" but the quad bike \"violated the lane and hit my vehicle from the front left side at speed.\" Prosecutors decided to take no action against the driver, Essex's senior coroner Lincoln Brookes said, quoting from documents obtained by Mr Steward's parents from Turkish authorities. Both men died from multiple traumatic injuries as the result of a road traffic collision, the coroner concluded, adding that while there was a police report, \"it's not what I would call a forensic collision investigation here\". He said there were no details about whether either vehicle had mechanical defects, but both men were within the legal UK drink-drive limit, according to post-mortems carried out in the UK. In a statement read at the inquest, Mr Dove's mother Sarah said her son had two children, aged eight and one, and \"loved his family and friends\". \"Cory went on holiday with his girlfriend and his two boys,\" she said, where he \"met up with a childhood friend of his\". \"He spent the day with him and in the evening himself and his friend went out... and a bus hit them both,\" she said. She said Mr Dove \"grew up on motorbikes and quadbikes, he knew how to ride which makes this so hard to believe he's gone\". Read more from Sky News:Polar vortex threatens USConcerns grow for Pope's healthWoman shot dead on Valentine's Day named Mr Steward, an electrical components factory worker, was also a father and his family said in a statement read to the inquest that he had a passion for metal detecting and Christmas lights. \"We were robbed of many fulfilling years,\" they said, adding: \"He will be truly missed.\" Mr Dove's partner said the pair had been travelling to a shop at the time of the crash and had made the journey \"multiple times\" that day. Mr Brookes extended his condolences to family members in court, adding: \"The pain shared I cannot begin to imagine to be honest.\""
    },
    {
        "title": "Princess of Wales shares portraits drawn by George, Charlotte and Louis",
        "description": "The Princess of Wales has shared a series of portraits drawn by herself, Prince George, Princess Charlotte and Prince Louis. ",
        "url": "https://news.sky.com/story/princess-of-wales-shares-portraits-drawn-by-george-charlotte-and-louis-13311478",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-princess-of-wales-kate_6680518.jpg?20240909163613",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-17 14:59:00",
        "Headline": "The artworks - which also include one by the Princess of Wales herself - have been shared to promote Kate's Shaping Us initiative, which promotes early years education. ",
        "Content": "The Princess of Wales has shared a series of portraits drawn by herself, Prince George, Princess Charlotte and Prince Louis.  Pictures of the artworks were shared on Instagram to help publicise Kate's Shaping Us campaign, which highlights how children begin developing social and emotional skills in early childhood. The caption reads: \"Drawing portraits with children can provide a moment of connection as you spend time looking at and focusing on one another, as well as being creative and - most importantly - having lots of fun together!\" While Kensington Palace has not confirmed which family member created each portrait - or who they are of - it appears the children have all drawn their mother. The first image, in red, shows a figure with long hair and a shirt collar, as does the second, which features more colours. The third is a portrait of a long-haired person sitting in an armchair. The final image is the only which differs. It's a chalk portrait of a young boy, possibly Prince Louis, with his eyes closed. It's not the first time the Wales family have shown their artistic sides. Kate is a keen photographer and she's been behind the lens for many of the official photos of George, 11, Charlotte, nine, and six-year-old Louis released over the years. More from Sky News:Royals release Valentine's messagesKate visits children's hospice Earlier this month, the palace released a photo of the princess to mark World Cancer Day, which had been taken by Louis. Kate revealed she had finished chemotherapy and was \"cancer free\" in a video released in November last year. In 2022, the Prince and Princess of Wales marked Christmas Day by sharing a painting of a reindeer with two robins by George. William, Kate and their children are currently enjoying a half-term holiday, according to reports."
    },
    {
        "title": "Bridget Jones 4 breaks UK box office romcom record",
        "description": "Bridget Jones: Mad About the Boy has achieved the highest-ever opening for a romcom in the UK and Ireland, according to Universal.",
        "url": "https://news.sky.com/story/bridget-jones-4-breaks-uk-box-office-romcom-record-13311455",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-renee-zellweger-bridget-jones_6831637.jpg?20250217142810",
        "type": "UK",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-17 15:34:00",
        "Headline": "Bridget Jones: Mad About The Boy - starring Renée Zellweger, Leo Woodall and Chiwetel Ejiofor - has beaten the franchise's own previous record for best-performing romcom in the UK on its opening weekend.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Bridget Jones: Mad About the Boy has achieved the highest-ever opening for a romcom in the UK and Ireland, according to Universal. The fourth movie in the franchise, set around the titular unlucky-in-love heroine, took $15.5m, (£12.3m) in its first weekend, beating Marvel's first release of the year, Captain America: Brave New World. It overtakes the second film in the franchise, Bridget Jones: The Edge Of Reason - the previous record holder, which took $13.1m (£10.4m). Less of a household name in the US, Bridget's latest adventure didn't get a cinema release in the US, going straight to Universal's streaming service Peacock. The film's success in the UK follows impressive pre-sales, which were better than those of the record-breaking Margot Robbie movie Barbie - one-half of last year's \"Barbenheimer\" phenomenon. Produced by Working Title - the production company behind British hits including Four Weddings And A Funeral, Love Actually and Notting Hill - Bridget Jones 4 is now their highest-ever opening. It was also the franchise's biggest opening in Poland, Netherlands, Denmark, Norway, Sweden and Finland. \n                  Mad About The Boy: Bridget Jones is back - but is she still relevant?\n                 \n                  Bridget Jones: A heroine of our time or an absolute disgrace?\n                 \n                  Most anticipated films coming to cinemas in 2025\n                 With hit-and-miss reviews from critics, audiences seem to be enjoying the show, rating the movie 86% fresh on film review aggregator Rotten Tomatoes. The character first appeared in 1995 as anonymous columns in The Independent written by journalist Helen Fielding. A word-of-mouth hit, Fielding's four subsequent books about Bridget were bestsellers.  Speaking ahead of the film's release, the film's star, Renée Zellweger told Sky News playing Bridget was \"the best job in the world\". Starring in the latest instalment alongside Chiwetel Ejiofor and Leo Woodall, Zellweger went on: \"I love her. I love her humour. I love her vulnerability. I love her imperfection. I love the opportunity to play out her miscalculating a plan and it maybe, surprising her in her execution. I love all of it.\" The first film earned Zellweger an Oscar nod for her portrayal of Bridget, and the character's name has gone into the lexicon to describe a 30-something single woman on the lookout for love. A polarizing character, while some loved the character's relatability, others felt her obsession with her appearance and finding a man flew in the face of what it meant to be an independent woman. Fielding has said the key to Bridget's appeal lies in her revealing \"the gap between how you feel you are supposed to be and how you really are inside\". Bridget Jones: Mad About The Boy is in cinemas now."
    },
    {
        "title": "Sir Keir Starmer joins Europe in confronting reality of Trump and Putin's emerging new world order",
        "description": "Sir Keir Starmer was the first leader to arrive at this meeting in Paris, strolling down the road from the British Embassy.",
        "url": "https://news.sky.com/story/sir-keir-starmer-joins-europe-in-confronting-reality-of-trump-and-putins-emerging-new-world-order-13311642",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-emmanuel-macron_6831937.jpg?20250217200030",
        "type": "UK",
        "Author": "Adam Parsons",
        "Date Published": "2025-02-17 22:02:00",
        "Headline": "European leaders tried to reassert themselves in Paris after being pushed to the sidelines but there is a growing sense that the US and Russia see the world in the same way and may strike deals on more than the future of Ukraine.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n  Sir Keir Starmer was the first leader to arrive at this meeting in Paris, strolling down the road from the British Embassy. When he emerged, after three hours of discussion, he looked sombre. Sir Keir, like the other political heavyweights who came to the Elysee Palace, knows that Europe has been battered and marginalised over the past week or so by the actions and rhetoric that have come out of Washington. So this meeting was, to an extent, about political leaders reasserting themselves. But when we spoke, it was clear that it was also about laying down a line. Not so much about what a peace deal for Ukraine might look like, but how it would be policed. The prime minister said he was prepared to deploy British troops on the ground but was emphatic that the US would have to provide what he called a \"backstop\". He didn't elaborate on exactly what this would mean, but it's clear that he's talking about America committing its military muscle to secure Ukraine's future. \"A lasting peace\", as the prime minister insists, rather than a ceasefire that, European leaders believe, will simply allow Vladimir Putin to regroup his forces and launch another offensive. Sir Keir is trying to flex some diplomatic muscles - striking a more strident tone than, say, Olaf Scholz, the surely-soon-to-be former chancellor of Germany, while also promising to go to Washington next week for talks with Donald Trump, and then reporting back to European leaders. It is, one suspects, a rare chance for Sir Keir to take a leadership role in post-Brexit Europe, and it's one he wants to take. Read more:Delta plane upside down on Toronto runwayDetained Brits were warned to not travel to 'unsafe' areaWoman, 35, sentenced over Jellycat thefts But the bigger fear for Europeans may be that America and Russia don't want to talk to each other about just Ukraine - but also trade deals, geopolitical agreements, and potential land carve-ups. If Donald Trump really does see America's future in the stark terms of a transactional deal-maker, he may have more in common with Putin than he does with most European leaders. And that would look like a new world order."
    },
    {
        "title": "Rotherham: Alleged rapists face trial at end of 2026 due to court backlog",
        "description": "Three men charged with rape and other offences against two teenage girls in Rotherham will not be tried until the end of next year, a court has heard.",
        "url": "https://news.sky.com/story/rotherham-alleged-rapists-face-trial-at-end-of-2026-due-to-court-backlog-13311426",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sheffield-crown-court_6831600.jpg?20250217132126",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-17 13:08:00",
        "Headline": "Basharat Dad, 40, Nasser Dad, 44, and Reza Tavakoli, 54, were due to enter pleas at Sheffield Crown Court. ",
        "Content": "Three men charged with rape and other offences against two teenage girls in Rotherham will not be tried until the end of next year, a court has heard. Basharat Dad, 40, Nasser Dad, 44, and Reza Tavakoli, 54, were arrested as part of the National Crime Agency's (NCA) Operation Stovewood, which is investigating child sexual exploitation in the South Yorkshire town between 1997 and 2013. The alleged offences happened in the Rotherham area between March 2004 and December 2009 and involved two girls, who were aged between 13 and 16 at the time, according to the NCA. Basharat Dad, formerly of Rotherham, is charged with 13 counts of rape, four offences of trafficking within the UK for sexual exploitation, and one offence of false imprisonment. Nasser Dad, also formerly of Rotherham, is charged with two counts of rape, while Tavakoli, of Upperthorpe, Sheffield, is charged with rape and false imprisonment. Read more from Sky News:Woman shot dead at pub on Valentine's Day namedMan who raped and murdered Irish backpacker jailed The men were due to enter pleas at Sheffield Crown Court on Monday but the Dads, who are in custody, weren't produced from prison. Judge Sarah Wright fixed a provisional trial date for 30 November 2026 after hearing no earlier date was available because of the current backlog of cases in crown courts. But the judge said she would make further inquiries to see if the trial could be brought forward. Tavakoli was granted bail when he appeared in court on Monday morning and all three are expected to appear again for a case management hearing on 24 March."
    },
    {
        "title": "Emergency teams responding after plane crash in Toronto",
        "description": "At least 18 people have been injured in a plane crash that's left an aircraft upside down at a Canadian airport, an official has said. ",
        "url": "https://news.sky.com/story/emergency-teams-responding-after-incident-involving-plane-during-landing-in-canada-toronto-pearson-airport-says-13311604",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-plane-toronto_6831981.jpg?20250217204547",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-17 19:56:00",
        "Headline": "Footage from the airport shows the snow-covered plane upside down on the tarmac. ",
        "Content": " At least 18 people have been injured in a plane crash that's left an aircraft upside down at a Canadian airport, an official has said.  Images from Toronto Pearson International Airport show the snow-covered plane belly up on the tarmac. The flight, operated by Delta subsidiary Endeavor Air, crashed while landing at around 2.30pm local time (7.30pm UK time). All 80 people on board - 76 passengers and four crew - were evacuated, the Federal Aviation Administration (FAA) said. In a press conference, Toronto Pearson fire chief Todd Aitken said 18 people had been injured. A spokesperson for the Peel Region paramedic service told Sky News the injuries ranged from minor to serious - but none were life-threatening. The fire chief added that there had been no crosswinds and the runway was dry at the time of the incident. Canada Police has said it does not know the circumstances surrounding the crash. The airport posted on X that the incident involved a plane arriving from Minneapolis. \"Emergency teams are responding. All passengers and crew are accounted for,\" the statement added. Ontario's premier Doug Ford said he is \"relieved there are no casualties after the incident\". \"Provincial officials are in contact with the airport and local authorities and will provide any help that's needed,\" he added in a post on X. Delta has said it is aware of reports of an incident involving an Endeavor Air flight, and Canada's Transportation Safety Board has said it is \"deploying a team to investigate\" the accident. All departures and arrivals at the airport were paused minutes after the crash. They resumed at 5pm local time (10pm UK time) but Delta flights will remain suspended until the end of the day, the airline said. More from Sky News:Hospitalised pope 'asks for prayers'Rebels seize second city in Congo Toronto has been blighted by bad weather in recent days and this afternoon, the airport was experiencing blowing snow and winds of up to 65mph, according to the Meteorological Service of Canada. The temperature was around -8.6C. Prior to the crash, dozens of departures and arrivals at the airport had been delayed due to the weather. The airport had posted images on X after 53cm of snow fell over the past week. The incident comes after two recent crashes in North America. Last month 67 people killed when an army helicopter collided with a passenger jet in Washington DC. In a separate incident, at least seven people died in a medical transport plane crash in Philadelphia."
    },
    {
        "title": "Ukraine war: Who is attending Russia and US peace talks?",
        "description": "Top US and Russian officials are set to meet in Saudi Arabia on Tuesday with the aim of restoring ties and setting up negotiations to end the war in Ukraine.",
        "url": "https://news.sky.com/story/ukraine-war-who-is-attending-russia-and-us-peace-talks-13311471",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sergey-lavrov-yuri-ushakov_6831417.jpg?20250217105620",
        "type": "World",
        "Author": "Jake Levison",
        "Date Published": "2025-02-17 14:47:00",
        "Headline": "Ukraine and European representatives have been snubbed for the Russia-US talks in Riyadh this week. But which top officials from the two nations will attend?",
        "Content": "\n          News reporter\n       Top US and Russian officials are set to meet in Saudi Arabia on Tuesday with the aim of restoring ties and setting up negotiations to end the war in Ukraine. The Kremlin has said the discussions in Riyadh could pave the way for a face-to-face meeting between US President Donald Trump and Russian leader Vladimir Putin \"very soon\". It comes after the pair held a ground-breaking lengthy phone call last Wednesday. Follow peace talk and Ukraine war updates live Riyadh, which is also involved in talks with Washington over the future of the Gaza Strip, has played a role in early contacts between the Trump administration. But who will be involved in the discussions tomorrow? Marco Rubio \n                  'US security guarantee' the only path to peace in Ukraine, Starmer says - ahead of Trump meeting next week\n                 \n                  Sir Keir Starmer 'prepared to send troops to Ukraine' if peace deal reached - as European leaders gear up for crisis talks\n                 \n                  Alexei Navalny's widow pays tribute on first anniversary of his death - as supporters help choose design for tombstone\n                 Mr Trump's secretary of state, who arrived in Riyadh on Monday, serves as the president's chief foreign affairs adviser and the country's top diplomat. Mr Rubio, a former Florida senator, already spoke to Russian foreign affairs minister Sergey Lavrov over the phone on Saturday, discussing the war in Ukraine and other topics, according to readouts of the call from both countries. The US president and Mr Rubio were adversaries when they both ran to be the Republican presidential candidate in 2016, launching public insults at one another. But over the past few years Mr Rubio has softened some of his stances to align more closely with Mr Trump's views, particularly on foreign policy - so much so that he was one of three final contenders for Mr Trump's vice-presidential pick for this term, eventually losing out to JD Vance. Before he was made secretary of state, the 53-year-old said Ukraine needed to seek a negotiated settlement with Russia rather than focus on regaining all territory that Russia has taken in the last decade. \"I'm not on Russia's side - but unfortunately the reality of it is that the way the war in Ukraine is going to end is with a negotiated settlement,\" he said in September. Michael Waltz US national security adviser Michael Waltz will be alongside Mr Rubio during the US-Russia talks. The 51-year-old is a Green Beret veteran who served in Afghanistan, the Middle East and Africa. Since 2019, he has represented a congressional district in the House, where he's a member of the Armed Services, Foreign Affairs and Intelligence committees. Before his appointment in Mr Trump's cabinet, he co-wrote an article in The Economist that laid out his view of how the US could move to convince Russia to end the war: either by offering to ease sanctions or threatening greater assistance to Kyiv. \"America can use economic leverage, including lifting the pause on exports of liquefied natural gas and cracking down on Russia's illicit oil sales, to bring Mr Putin to the table,\" he wrote in the 2 November piece, co-authored with Matthew Kroenig, a former Pentagon strategist. \"If he refuses to talk, Washington can, as Mr Trump argued, provide more weapons to Ukraine with fewer restrictions on their use. Faced with this pressure, Mr Putin will probably take the opportunity to wind the conflict down.\" He said that he didn't want Moscow to be able to declare its actions in Ukraine a victory. Instead, he wrote that requiring Mr Putin to accept a deal whereby Ukraine remains an independent state, closely tied to the West \"would be a strategic defeat for the Russian leader and seen as such in Beijing\". Steve Witkoff Mr Witkoff, Mr Trump's special Middle East envoy, is a long-time friend of the president's and a fellow billionaire real estate developer. The 67-year-old, who has known Mr Trump for decades, is a Republican donor and served on one of the president's Great American Economic Revival Industry Groups to combat the effects of the COVID-19 pandemic. Like Mr Trump, he made his fortune in real estate in both New York and Florida, and brought family members - his wife, Lauren, and sons Alex and Zach - into the Witkoff Group. He is regularly seen bonding with Mr Trump on the golf course, and was present on the course in Florida during the apparent assassination attempt on the president last September. Mr Witkoff has been busy in his new Middle East role, having been Mr Trump's man in the room for the extremely fragile Israel-Hamas ceasefire negotiations. In a Fox News interview on Sunday, he confirmed he was heading to Riyadh, adding: \"And hopefully we'll make some really good progress.\" Sergei Lavrov Sergei Lavrov is Russia's longstanding foreign minister, having taken the role back in 2004. The highly decorated Kremlin official has been described as \"the Jedi master of the dark arts of Russian diplomacy\" by Sky News' international affairs editor Dominic Waghorn. He said Mr Lavrov is \"a diplomatic bruiser who cajoles and bullies where he sees fit\" who has been known, like others at the Kremlin, to make outlandish claims about the reality of the war. Initially, when rumours of a Russian invasion sparked, he said it would never happen - then once it began, he for some time insisted that it hadn't. The 74-year-old made headlines when he unintentionally made the audience at an international conference in India laugh in March 2023 by attempting to portray his country as the victim of the war in Ukraine. \"The war, which we are trying to stop, which was launched against us using Ukrainian people, of course, influenced the policy of Russia, including energy policy,\" he said to a chorus of laughs and groans. Yuri Ushakov Mr Putin's foreign policy adviser Yuri Ushakov will join Mr Lavrov or the Russian side of the table. Americans will be familiar with the Kremlin official, as he served as the Ambassador of Russia to the United States from 1998 until 2008 before taking up his current post in 2012. What exactly is the meeting for? Specifically, Kremlin spokesman Dmitry Peskov told reporters that the meeting would focus on restoring US-Russia relations and setting up talks for a potential Ukraine peace deal. The talks will be among the first high-level in-person discussions in years between Russian and US officials and are meant to precede a meeting between Mr Trump and Mr Putin. Mr Rubio has said the coming weeks and days would determine whether Mr Putin is serious about making peace. Read more:Man who raped and murdered Irish backpacker jailed for lifePM 'prepared to send troops to Ukraine' if peace deal reached Keith Kellogg, Mr Trump's special envoy for Ukraine and Russia, is not expected to attend the meeting, as he is at NATO's HQ in Brussels, but he has been working with Mr Trump on a plan to broker a war-ending deal with Russia. They have offered scant details about such a plan, nor any timescale for its implementation. This meeting comes off the back of Mr Trump's phone call with Mr Putin last week. Writing about the call on Truth Social, the US president said: \"As we both agreed, we want to stop the millions of deaths taking place in the War with Russia/Ukraine. \"We agreed to work together, very closely, including visiting each other's Nations. We have also agreed to have our respective teams start negotiations immediately.\" Ukraine and Europe are not invited The US and Russia have excluded Ukraine and Europe from the meeting, as tensions grow between America and European countries. It's prompted European leaders to put together their own impromptu talks in Paris, with Sir Keir Starmer saying: \"We cannot allow any divisions in the alliance to distract from the external enemies we face.\" Ukrainian President Volodymyr Zelenskyy has confirmed his country has been left out of the talks in Saudi Arabia, saying any negotiations without them will have \"no result\". \"And we cannot acknowledge anything, any arrangements about us, that were made without us. And we will not recognise such agreements,\" he told reporters on Monday. Speaking to Sky News' US partner network NBC News, Ukraine's president thanked Donald Trump for his support, but added there is not \"any leader in the world who can really make a deal with Vladimir Putin without us\". Asked whether he believed Mr Trump was negotiating in good faith, Mr Zelenskyy said: \"I hope so. I hope so. Yes, I count on it. \"I trust Trump because he's the president of the US, because your people voted for him and I respect their choice.\" In an interview on CBS News on Sunday, Mr Rubio moved to reassure Europe and Ukraine that they would be part of negotiations further down the line if they were to materialise. He said: \"If it's real negotiations, and we're not there yet, but if that were to happen, Ukraine will have to be involved because they're the one that were invaded, and the Europeans will have to be involved because… they have sanctions on Putin and Russia as well, and they've contributed to this effort.\""
    },
    {
        "title": "Pope stable in hospital and 'asks for prayers', Vatican says - as doctors treat 'complex' infection",
        "description": "The pope's condition is \"stable\" and he is \"touched by messages of affection\", the Vatican has said in an update amid his hospital stay. ",
        "url": "https://news.sky.com/story/pope-francis-in-hospital-for-fourth-day-as-he-continues-bronchitis-treatment-13311315",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pope-francis-vatican_6830249.jpg?20250217125924",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-17 09:16:00",
        "Headline": "The Vatican said Pope Francis will be in hospital for as long as necessary - while the pontiff has continued to make phone calls from his bed to members of a Catholic parish in Gaza.",
        "Content": "The pope's condition is \"stable\" and he is \"touched by messages of affection\", the Vatican has said in an update amid his hospital stay.  Earlier on Monday, the Vatican said Pope Francis' respiratory tract infection is presenting a \"complex clinical picture\" and he will need to remain in hospital. Concerns have been growing about the 88-year-old's increasingly frail health. Spokesman Matteo Bruni said the results of tests conducted in recent days indicate the pontiff is suffering from a \"polymicrobial respiratory tract infection\" that needed a further change in his drug therapy. Polymicrobial infections are caused by a mix of viruses, bacteria, fungi and parasites. In a later update on Monday, the Vatican said his clinical conditions are stable and that he \"read and worked\" on Monday morning, adding \"he's touched by the numerous messages of affection and closeness that he continues to receive in these hours\". \"In particular he intends to thank those who are currently hospitalised, for the affection and love that they express through the drawings and good wishes; he prays for them and asks that they pray for him.\" It was not specified earlier whether the pope was suffering from a bacterial or viral infection. There was no length of time given for the pope's hospitalisation, but the spokesman added the complexity of his symptoms \"will require an appropriate hospital stay\".  The pope was admitted to Rome's Gemelli hospital in a \"fair\" condition on Friday to be treated for a respiratory tract infection. His doctors have advised complete rest. He was unable to deliver his regular weekly prayer on Sunday to pilgrims in St Peter's Square or lead a special mass for artists to mark the Catholic Church's Jubilee Year. On social media at the weekend, the pope wrote: \"Thank you for the affection, prayer and closeness with which you accompany me in these days.\" The pope had been suffering from bronchitis for more than a week before he was taken to hospital. He is said to have insisted on finishing his morning audiences on Friday before leaving the Vatican to be admitted to hospital. The pope was finding it increasingly difficult to complete speeches and commitments last week because he was short of breath. 'Pope sounded a bit tired' However, from his hospital bed at the weekend, the pope continued to make phone calls to members of a Catholic parish in Gaza, Italian broadcaster Mediaset reported. A parish member said the pope had called on both Friday and Saturday and was in \"good humour\" but sounded \"a bit tired\". The pope's next scheduled appointment is his weekly general audience on Wednesday. He is then due to preside on Sunday at the ordination of deacons as part of a Holy Year weekend. Both commitments remain on the official Vatican schedule, but appear to be in doubt. Read more on Sky News:Polar vortex to bring 'life-threatening cold' to USSinger Conor Maynard issues health update The pontiff is being treated at Rome's largest hospital in a suite designed for popes. The Argentinian pope had part of one lung removed after a pulmonary infection as a young man. When he had a bad case of pneumonia in 2023, he left hospital after three days - he later said he had been admitted after feeling faint and having a sharp pain in his chest. In the same year, Pope Francis spent nine days at the Gemelli hospital when he had surgery for an abdominal hernia. Science and technology editor As we age, our ability to fight off infections or ailments that wouldn't have troubled us before gradually diminishes. Pope Francis is 88 and unlike many people lucky enough to live that long, has a demanding job that likely leaves less time for the rest that our bodies, especially ageing ones, need. The latest update from the Vatican suggests he isn't gravely ill – able to sit up and eat breakfast – but that his doctors have concluded the bronchitis he is suffering will require a longer hospital stay. Bronchitis – an inflammation of the main airways leading to the lungs – can be severe as it can narrow those pipes leading to difficulty breathing. It's only a real concern if the infection doesn't respond well to treatment and spreads deeper into the lungs themselves causing pneumonia. The Vatican has said the pope's infection is \"polymicrobial\" meaning more than one type of microbe (bacteria, virus or fungal agent) has been identified. That will mean adjusting the types of medication used to treat the infection, which in some cases can be tricky, especially if one of the bugs is resistant to common antimicrobial drugs – something that is increasingly common. The pope is possibly more vulnerable to lung infections than a person of equivalent age as he had part of one lung removed following a severe infection when he was just 21. He was previously hospitalised in 2023 with pneumonia and made a good recovery. Beyond that, it's unwise for anyone to pontificate on anyone's personal health, least of all the pontiff's."
    },
    {
        "title": "At least 31 dead after bus crash in Bolivia",
        "description": "At least 31 people have died after a bus crash in Bolivia, police have said.",
        "url": "https://news.sky.com/story/at-least-31-dead-after-bus-crash-in-bolivia-13311649",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-istock-potosi-bolivia_6832048.jpg?20250217222752",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-17 22:16:00",
        "Headline": "The mountainous route the vehicle was on has lots of twists and turns, a police officer says.",
        "Content": "At least 31 people have died after a bus crash in Bolivia, police have said. An officer said the driver appeared to have lost control of the vehicle, causing it to drop more than 2,600 ft (800m) off a precipice in the southwestern area of Yocalla. Among the injured, 10 adults and four children were taken to hospital, with several in intensive care, a healthcare official said. The mountainous route the vehicle was on has lots of twists and turns, the police officer said, adding that speed could have been another factor in the accident. Read more on Sky News:Delta plane upside down on Toronto runwayWoman shot dead at Kent pub on Valentine's Day named"
    },
    {
        "title": "Israel says it will receive bodies of four hostages held by Hamas in Gaza",
        "description": "Israel says it is preparing to receive the bodies of four hostages held by Hamas in Gaza.",
        "url": "https://news.sky.com/story/israel-says-it-will-receive-bodies-of-four-hostages-held-by-hamas-in-gaza-13311482",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gaza-hamas-israel_6831792.jpg?20250217172018",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-17 15:10:00",
        "Headline": "Israeli security officials also said they were working to bring back six living hostages on Saturday.",
        "Content": "Israel says it is preparing to receive the bodies of four hostages held by Hamas in Gaza. Israeli security officials also said they were working to bring back six living hostages on Saturday. The announcement came as relatives and supporters of those held hostage in Gaza since Hamas' 7 October attack in 2023 marked 500 days of their captivity with the number 500 laid out on the beach in Tel Aviv, Israel. Meanwhile, on Monday, Israeli army said it had killed Mohammad Shaheen, the head of operations in Lebanon for Hamas, in the port city of Sidon. Hamas confirmed Mr Shaheen's death but described him as a military commander. On Monday, Israeli forces also said they would remain in five strategic locations in southern Lebanon close to the border despite Tuesday's deadline for a full withdrawal. Israel had originally agreed to withdraw all its forces from southern Lebanon under its ceasefire agreement with Hezbollah, but said on Monday any such move must be done \"in a way that the security of our civilians is kept\". The initial withdrawal deadline was in late January, but Lebanon agreed to extend it to 18 February. Lebanese president Joseph Aoun said the ceasefire agreement \"must be respected,\" claiming Israel \"cannot be trusted\". Read more from Sky News:Israel receives US shipment of heavy bombsNorth Korea leader triggers huge explosion in capital He said Lebanese officials were \"working diplomatically to achieve the complete Israeli withdrawal, and I will not accept that a single Israeli remains on Lebanese territory\". Giving reasons behind the latest drone strike, Israel accused Mr Shaheen of \"recently planning terror attacks, directed and funded by Iran, from Lebanese territory against the citizens of the state of Israel\". Footage showed a car engulfed in flames following the strike near a Lebanese army checkpoint and Sidon's municipal sports stadium. Lebanon's state news agency said emergency teams had removed one body from the car, but did not identify the victim. Since the ceasefire, Israel has continued air strikes in southern and eastern Lebanon, claiming it is targeting military sites containing missiles and combat equipment. Israel and Lebanon have exchanged accusations of violating the ceasefire agreement."
    },
    {
        "title": "Netanyahu signals moving ahead with Trump's Gaza plan as Israel receives unblocked US shipment of heavy bombs",
        "description": "Benjamin Netanyahu has suggested moving ahead with Donald Trump's plan to clear out Palestinians from Gaza, as Israel received a previously blocked shipment of heavy bombs.",
        "url": "https://news.sky.com/story/netanyahu-signals-moving-ahead-with-trumps-gaza-plan-as-israel-receives-unblocked-us-shipment-of-heavy-bombs-13311209",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-israel-missiles-bombs_6831174.png?20250217030208",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-17 00:43:00",
        "Headline": "The Israeli prime minister has called President Trump's proposal to transfer the Palestinian population out of Gaza \"the only viable plan to enable a different future\" for the region.",
        "Content": "Benjamin Netanyahu has suggested moving ahead with Donald Trump's plan to clear out Palestinians from Gaza, as Israel received a previously blocked shipment of heavy bombs. President Trump's proposal to transfer the Palestinian population out of Gaza and redevelop it under US ownership has been criticised by Palestinians, human rights groups, regional powers and US allies, but Mr Netanyahu said on Sunday it is \"the only viable plan to enable a different future\". The Israeli prime minister also denied claims it was ethnic cleansing. Ever since the UN General Assembly voted for Palestine to be split into an Arab state and a Jewish state, against significant opposition in 1947, the issue of land, and who it belongs to, has been one of the most divisive in the region. Mr Netanyahu said that any emigration from Gaza should be \"voluntary\" but rights groups and critics warned the plan amounted to coercion given Israel had razed the enclave. The Israeli PM said he and Mr Trump had a \"common strategy\" for Gaza and that the US president's plan was \"right on the dot\". Speaking to reporters in Florida on Sunday, Mr Trump said: \"I told Bibi [Benjamin Netanyahu] you do whatever you want.\" \n                  Benjamin Netanyahu says Gaza ceasefire will end if Hamas does not free hostages by Saturday\n                 \n                  Trump's Gaza plan is so outrageous, it might just be part of something bigger\n                 \n                  Day 17: Can Trump take over the Gaza Strip?\n                 He added:\"[It] will be up to Israel what the next step is, in consultation with me.\" The comments raise further concerns for the fragile Gaza ceasefire, which came under threat last week. Hamas initially said it would not be releasing the hostages scheduled to be sent back to Israel over worries about the supply of vitally needed aid - but later backtracked. 'Peace through strength' - with heavy bombs It comes as Israel has received a shipment of heavy MK-84 bombs from the US, initially blocked by Joe Biden, that Mr Trump greenlit. Mr Trump said he lifted the block because he believed in \"peace through strength\". The MK-84 is an unguided 907kg bomb that can rip through thick concrete and metal, creating a wide blast radius. The Biden administration refused to clear the weapons for export over fears of what they could do in the densely populated Gaza Strip. Mr Trump said on Sunday: \"They contracted for the weapons a long time ago with the Biden administration, and then Biden wouldn't deliver the weapons. But I look at it differently. I say peace through strength.\" Read more:Gaza ceasefire explainedIsrael-Hamas war: 100 years leading herePeace efforts thrown into further doubt Phase two of ceasefire deal Israel's security cabinet is set to meet on Monday to discuss the second phase of the ceasefire agreement which brought to an end around 16 months of fighting, triggered by the 7 October 2023 attack. More than 48,000 Palestinians have been killed, according to the Hamas-run Gaza health ministry, which does not differentiate between civilians and combatants in its count. At least 1,200 people were killed and more than 250 taken hostage when Hamas launched its massacre in Israel. A ceasefire agreed last month managed to finally pause fighting, but its first phase ends in two weeks. Negotiations on the second phase were meant to begin two weeks ago. If successful, it would continue the release of hostages in exchange for more Palestinian prisoners as well as a lasting truce and the withdrawal of Israeli forces. Mr Trump's special Middle East envoy, Steve Witkoff, told Fox News that \"phase two is absolutely going to begin\" and he had \"very productive\" calls on Sunday with Mr Netanyahu and officials from Egypt and Qatar, which serve as mediators, about continuing talks this week.  Three Palestinians killed Meanwhile, over the weekend the Hamas-run Gaza interior ministry blamed Israel for the deaths of three Palestinian police officers in Rafah. It said the officers had been deployed to secure the entry of aid trucks and this was a clear violation of the ceasefire. Israel's military said it had attacked several armed individuals moving towards Israeli forces."
    },
    {
        "title": "Man who raped and murdered Irish backpacker in India jailed for life",
        "description": "A man who raped and murdered an Irish backpacker in India eight years ago has been jailed for life.",
        "url": "https://news.sky.com/story/man-who-raped-and-murdered-irish-backpacker-in-india-jailed-for-life-13311227",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-danielle-mclaughlin_6828496.jpg?20250214110458",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-17 06:00:00",
        "Headline": "The body of Danielle McLaughlin, 28, from County Donegal, was found by a farmer on a beach popular with holidaymakers in Goa in March 2017.",
        "Content": "A man who raped and murdered an Irish backpacker in India eight years ago has been jailed for life. Danielle McLaughlin's body was found on a beach popular with holidaymakers in Goa in March 2017. The 28-year-old County Donegal woman had been raped and strangled, a post-mortem examination found. Vikat Bhagat, 31, was found guilty at a court in India on Friday. At the time, Ms McLaughlin had travelled to the southern Indian state with a female Australian friend and was staying in a beach hut. The pair had been celebrating Holi - a Hindu festival - in a nearby village. A day later, a farmer found her body in a remote location in Canacona. Speaking after the guilty verdict last week, Ms McLaughlin's mother and a sister said justice had \"finally been achieved\". \"There was no other suspect or gang involved in Danielle's death and (Vikat) Bhagat was solely responsible for cruelly ending her beautiful life,\" her mother Andrea Brannigan and sister Joleen McLaughlin Brannigan said. \"We have endured what has been effectively an eight-year murder trial with many delays and problems, right until the end, all taking place thousands of miles away from Danielle's home.\" Ireland's deputy premier, Simon Harris, also paid tribute to her mother for what he called her \"determination and resilience\" and said he hoped the verdict \"represents some closure for the family\". Read more from Sky News:Temperatures could hit 14C after fortnight of 'anticyclonic gloom'Reform 'stronger' than Tories, Sky News poll suggests Speaking later on Monday, the family's solicitor Desmond Doherty said the family are \"exhausted\" and \"anxious to get home\". He told BBC's Good Morning Ulster programme they are due to fly back to Ireland from India, and he believes there had been more than 250 hearings as part of the court process. \"The process here would be that a family would turn up at a court and be advised what was happening by the prosecution,\" Mr Doherty said. \"She [Danielle's mother] actually was centrally involved in the entire process, so it has come to a successful conclusion from that point of view.\""
    },
    {
        "title": "More than 1,000 rescued from cyber scam centres near Thailand",
        "description": "More than 1,000 people rescued from cyber scam centres near Thailand will be handed over by Myanmar, its military government has announced.",
        "url": "https://news.sky.com/story/more-than-1000-rescued-from-cyber-scam-centres-near-thailand-13311317",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-thailand-myanmar-trafficking_6831390.jpg?20250217100646",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-17 09:17:00",
        "Headline": "According to the UN, hundreds of thousands of people have been trafficked and forced into illegal work at cyber scam centres. ",
        "Content": "More than 1,000 people rescued from cyber scam centres near Thailand will be handed over by Myanmar, its military government has announced. The ruling State Administration Council said on Monday that around 1,030 foreign nationals were rescued from scam centres in the country over the past three weeks. Authorities said they have already returned 61 people to their home countries and would send the rest back after their personal details could be verified. Bloomberg news agency reported that the government's information ministry said the scam centre victims are mostly from Asian countries including India and China. Some other people rescued were from East Africa. The return comes as part of a crackdown on scam centres where hundreds of thousands of people have been trafficked and forced into illegal work. According to the UN, the criminal gangs generate billions each year and operate across southeast Asia - particularly along the Thai-Myanmar border. Read more from Sky News:North Korea leader triggers huge explosion in capitalIsrael receives US shipment of heavy bombs \n                  Myanmar frees more than 6,000 prisoners as country marks anniversary of independence from Britain\n                 \n                  'They fall in love with me': Inside the fraud factories driving the online scam boom\n                 \n                  Sky News wins International Emmy Award for Myanmar war documentary The Last Hospital\n                 Thailand redoubled efforts to curb the scam gangs after Chinese actor Wang Xing was abducted in the country in January, having been lured there on the promise of an acting job. He was freed by Thai police who found him in Myanmar days after his disappearance. Earlier this month, Bangkok cut electricity, internet and fuel supplies to five border areas in Myanmar in a bid to cripple the criminal centres. Last week, Thailand's army said it had received 260 human trafficking victims from Myanmar, with more than half coming from Ethiopia. In a statement, the Thai army said: \"After screening the group and verifying their nationalities, it was found that there were 20 nationalities.\""
    },
    {
        "title": "Rwanda-backed M23 rebels seize second major city in Democratic Republic of the Congo",
        "description": "Rwandan-backed rebels have occupied a second major city in the Democratic Republic of the Congo (DRC).",
        "url": "https://news.sky.com/story/rwanda-backed-m23-rebels-seize-second-major-city-in-democratic-republic-of-the-congo-13311379",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-m23-rebels-congo-drc_6831558.jpg?20250217123806",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-17 11:29:00",
        "Headline": "The Congo River Alliance, a group of rebel outfits including the Rwandan-backed M23, said its fighters \"decided to assist the population of Bukavu\" in addressing its security challenges under the \"old regime\".",
        "Content": "Rwandan-backed rebels have occupied a second major city in the Democratic Republic of the Congo (DRC). The Congo River Alliance, a group of rebel outfits including M23, said in a statement its fighters \"decided to assist the population of Bukavu\" in addressing its security challenges under the \"old regime\". Alliance spokesperson Lawrence Kanyuka, who previously ruled out a takeover of the city in eastern DRC, added: \"Our forces have been working to restore the security for the people and their property, much to the satisfaction of the entire population.\" M23 official Bernard Maheshe Byamungu - who has been sanctioned by the UN Security Council for rights abuses - also told residents they have been living in a \"jungle\". \"We are going to clean up the disorder left over from the old regime,\" he added. The Congolese government acknowledged for the first time that Bukavu had been \"occupied\", saying in a statement on social media that it was \"doing everything possible to restore order and territorial integrity\" in the region. South Kivu Governor Jean-Jacques Purusi also told the Reuters news agency that Congolese troops had withdrawn to avoid fighting in densely populated areas. He said \"they're in my residence already... and my office,\" and added he and his staff have safely left the city. Read more:Inside Congolese city overrun by rebelsUK facing 'generational' security challenge, warns PM It comes just days after M23 rebels said they seized Kavumu airport, which serves the South Kivu province and is a key strategic location for the Congolese army. A civil society source in the region told the Reuters news agency on Friday: \"The city of Bukavu can no longer hold.\" Bukavu is the provincial capital of South Kivu, which is located in the mineral-rich eastern DRC. After the takeover, local resident Blaise Byamungu told the Associated Press news agency that M23 marched into the city, which had been \"abandoned by all the authorities and without any loyalist force\". \"Is the government waiting for them to take over other towns to take action? It's cowardice,\" they added. One of more than 100 armed groups active in the mineral-rich eastern regions of the country, the M23 rebels have been pushing south since they seized Goma, the largest city in the east of the DRC, in January.  M23, or the March 23 Movement, has previously expressed a desire to march to DRC's capital Kinshasa.  But after declaring a ceasefire earlier in February, Mr Kanyuka said: \"It must be made clear that we have no intention of capturing Bukavu or other areas.\" More than six million people in the region have been displaced by the fighting, creating the largest humanitarian crisis in the world. Earlier this month, the UN said almost 3,000 people had been killed. The M23 rebels are backed by some 4,000 troops from Rwanda, according to UN experts, far more than in 2012 when they first briefly captured Goma and then withdrew after international pressure. Rwanda denies backing the rebel group, and its government frames the conflict between the DRC and M23 as the defence of ethnic Tutsis in the east of the country from ethnic Hutu forces - linked to the Rwandan genocide three decades ago. Around 800,000 Tutsis, moderate Hutus and others were killed by the Hutu-led government forces in 1994."
    },
    {
        "title": "North Korea leader Kim Jong Un triggers huge explosion in capital for construction project",
        "description": "North Korea's leader Kim Jong Un has detonated explosives creating a massive blast during a groundbreaking ceremony at a construction site in the capital, state-run media has reported.",
        "url": "https://news.sky.com/story/north-korea-leader-kim-jong-un-triggers-huge-explosion-in-capital-for-construction-project-13311235",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kim-jong-un-north-korea_6831209.jpg?20250217073541",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-17 06:26:00",
        "Headline": "The development in the Hwasong suburb of Pyongyang aims to build 10,000 flats, part of a five-year project to construct 50,000 new apartments.",
        "Content": "North Korea's leader Kim Jong Un has detonated explosives creating a massive blast during a groundbreaking ceremony at a construction site in the capital, state-run media has reported. Footage showed Mr Kim making a speech in Pyongyang on Sunday, surrounded by enthusiastically cheering crowds, before twisting a switch to ignite explosions. The blast threw enormous clouds of dust and smoke into the air. The project in the Hwasong suburb aims to build 10,000 flats, part of a five-year plan to construct 50,000 new apartments. He addressed hundreds of people, reportedly construction workers, who were standing in coordinated sections. They had been assembled with matching hard hats to create colourful sections in the crowds. \"The Hwasong area will soon become more famous not only as a cradle of the happy and civilised life of the people but as a land of history, which tells new miraculous tales of indomitable socialist Korea,\" Mr Kim said in a speech translated by the state-run Korean Central News Agency (KCNA). \n                  North Koreans 'blow themselves up with grenades rather than risk capture', say Ukraine soldiers\n                 \n                  Volodymyr Zelenskyy offers captured North Korean soldiers for Ukrainians held by Russia\n                 \n                  Ukraine says it has captured two North Korean soldiers on the battlefield in Russia\n                 The Hwasong district has already seen a number of new apartment blocks over the past few years. Sky News is not able to independently verify the reports as international media is rarely allowed access to North Korea. Read more from Sky News:Man jailed over Irish backpacker murderPM 'prepared to send troops to Ukraine'Poll: Reform seen as stronger than Tories On Sunday Mr Kim also visited his family's mausoleum on what would have been his father's birthday. Kim Jong Il's birthday, which falls on 16 February, is widely celebrated as a major holiday in North Korea, called the Day of the Shining Star. But it was the first time in four years that the young Kim visited the Kumsusan Palace of Sun in the capital Pyongyang, which houses the embalmed bodies of his father and grandfather, for the anniversary. He pledged to continue the \"sacred struggle\" for prosperity and security, state media KCNA said on Monday."
    },
    {
        "title": "US weather: Ten dead as polar vortex brings 'life-threatening cold' to US",
        "description": "Extreme weather and life-threatening cold temperatures are set to hit western states near the Rocky Mountains - after severe flooding killed at least 10 people in the eastern US over the weekend.",
        "url": "https://news.sky.com/story/us-weather-polar-vortex-to-bring-life-threatening-cold-to-mountain-states-after-winter-storms-and-lethal-floods-13311253",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-colorado-extreme-weather_6831305.jpg?20250217084428",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-17 07:34:00",
        "Headline": "The National Weather Service said a winter storm tracking from the Central Plains to the Mid-Atlantic is expected to strike later this week. It marks the 10th - and coldest - polar vortex this season so far.",
        "Content": " Extreme weather and life-threatening cold temperatures are set to hit western states near the Rocky Mountains - after severe flooding killed at least 10 people in the eastern US over the weekend. The National Weather Service's (NWS) weather prediction centre said a winter storm tracking from the Central Plains to the Mid-Atlantic is expected to strike later this week. On Tuesday, temperatures in northeastern Montana are predicted to dip as low as -42.7C, along with a wind chill that could reach -51C. Elsewhere, the weather service said wind chill temperatures as low as -45.6C were expected in most of North Dakota, which remained under an \"extreme cold warning,\" along with large parts of South Dakota and Minnesota. It marks the 10th - and coldest - polar vortex this season so far, with pressure systems pushing cold air from the Arctic southwards into North America and Europe. What is a polar vortex? The polar vortex is a large area of low pressure and cold air surrounding both of the Earth's poles and refers to the counter-clockwise flow of air that helps keep the colder air near the poles. \n                  Southern US braced for rare winter storm - as LA warned of further fires\n                 \n                  Mayotte hit by new storm just weeks after devastating cyclone\n                 \n                  UK weather: Fresh alerts for snow and ice as severe flooding triggers rescue operation\n                 This occurs regularly during winter and is often associated with large outbreaks of Arctic air in the US. In a post on social media, the NWS said the weather system \"will produce a swath of both heavy and disruptive snowfall\". 'Frostbite within minutes' It also said that \"a bitterly cold air-mass containing dangerous wind chills temperatures looks to stretch from the Great Plains to the northeast\" - and that there is \"high confidence for widespread, record-breaking cold\" in the central states. The NWS added: \"Wind chills between -30F and -60F are expected across the northern Plains, lingering for multiple days. \"These extreme conditions can cause frostbite within minutes. Sub-zero wind chills will likely extend as far south as Texas, Arkansas, and western Tennessee and Kentucky.\" Avalanche warnings were also issued for numerous areas of the Rocky Mountains stretching from Colorado to Washington state, with the danger rated highest in Utah. Kentucky floods kill at least nine It comes after flooding in the eastern states killed at least 10 people, with nine deaths - including a mother and seven-year-old child - reported in Kentucky and one death in Georgia. Kentucky Governor Andy Beshear said on Sunday that the storm was \"one of the most serious weather events we've dealt with in at least a decade\". He added in a post on social media: \"We need Kentuckians to remain alert. There are more than 300 road closures, with leaders saying the statewide impact is historic.\""
    },
    {
        "title": "Ukraine war: Who is attending Russia and US peace talks?",
        "description": "Top US and Russian officials are set to meet in Saudi Arabia on Tuesday with the aim of restoring ties and setting up negotiations to end the war in Ukraine.",
        "url": "https://news.sky.com/story/ukraine-war-who-is-attending-russia-and-us-peace-talks-13311471",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sergey-lavrov-yuri-ushakov_6831417.jpg?20250217105620",
        "type": "US",
        "Author": "Jake Levison",
        "Date Published": "2025-02-17 14:47:00",
        "Headline": "Ukraine and European representatives have been snubbed for the Russia-US talks in Riyadh this week. But which top officials from the two nations will attend?",
        "Content": "\n          News reporter\n       Top US and Russian officials are set to meet in Saudi Arabia on Tuesday with the aim of restoring ties and setting up negotiations to end the war in Ukraine. The Kremlin has said the discussions in Riyadh could pave the way for a face-to-face meeting between US President Donald Trump and Russian leader Vladimir Putin \"very soon\". It comes after the pair held a ground-breaking lengthy phone call last Wednesday. Follow peace talk and Ukraine war updates live Riyadh, which is also involved in talks with Washington over the future of the Gaza Strip, has played a role in early contacts between the Trump administration. But who will be involved in the discussions tomorrow? Marco Rubio \n                  'US security guarantee' the only path to peace in Ukraine, Starmer says - ahead of Trump meeting next week\n                 \n                  Sir Keir Starmer 'prepared to send troops to Ukraine' if peace deal reached - as European leaders gear up for crisis talks\n                 \n                  Alexei Navalny's widow pays tribute on first anniversary of his death - as supporters help choose design for tombstone\n                 Mr Trump's secretary of state, who arrived in Riyadh on Monday, serves as the president's chief foreign affairs adviser and the country's top diplomat. Mr Rubio, a former Florida senator, already spoke to Russian foreign affairs minister Sergey Lavrov over the phone on Saturday, discussing the war in Ukraine and other topics, according to readouts of the call from both countries. The US president and Mr Rubio were adversaries when they both ran to be the Republican presidential candidate in 2016, launching public insults at one another. But over the past few years Mr Rubio has softened some of his stances to align more closely with Mr Trump's views, particularly on foreign policy - so much so that he was one of three final contenders for Mr Trump's vice-presidential pick for this term, eventually losing out to JD Vance. Before he was made secretary of state, the 53-year-old said Ukraine needed to seek a negotiated settlement with Russia rather than focus on regaining all territory that Russia has taken in the last decade. \"I'm not on Russia's side - but unfortunately the reality of it is that the way the war in Ukraine is going to end is with a negotiated settlement,\" he said in September. Michael Waltz US national security adviser Michael Waltz will be alongside Mr Rubio during the US-Russia talks. The 51-year-old is a Green Beret veteran who served in Afghanistan, the Middle East and Africa. Since 2019, he has represented a congressional district in the House, where he's a member of the Armed Services, Foreign Affairs and Intelligence committees. Before his appointment in Mr Trump's cabinet, he co-wrote an article in The Economist that laid out his view of how the US could move to convince Russia to end the war: either by offering to ease sanctions or threatening greater assistance to Kyiv. \"America can use economic leverage, including lifting the pause on exports of liquefied natural gas and cracking down on Russia's illicit oil sales, to bring Mr Putin to the table,\" he wrote in the 2 November piece, co-authored with Matthew Kroenig, a former Pentagon strategist. \"If he refuses to talk, Washington can, as Mr Trump argued, provide more weapons to Ukraine with fewer restrictions on their use. Faced with this pressure, Mr Putin will probably take the opportunity to wind the conflict down.\" He said that he didn't want Moscow to be able to declare its actions in Ukraine a victory. Instead, he wrote that requiring Mr Putin to accept a deal whereby Ukraine remains an independent state, closely tied to the West \"would be a strategic defeat for the Russian leader and seen as such in Beijing\". Steve Witkoff Mr Witkoff, Mr Trump's special Middle East envoy, is a long-time friend of the president's and a fellow billionaire real estate developer. The 67-year-old, who has known Mr Trump for decades, is a Republican donor and served on one of the president's Great American Economic Revival Industry Groups to combat the effects of the COVID-19 pandemic. Like Mr Trump, he made his fortune in real estate in both New York and Florida, and brought family members - his wife, Lauren, and sons Alex and Zach - into the Witkoff Group. He is regularly seen bonding with Mr Trump on the golf course, and was present on the course in Florida during the apparent assassination attempt on the president last September. Mr Witkoff has been busy in his new Middle East role, having been Mr Trump's man in the room for the extremely fragile Israel-Hamas ceasefire negotiations. In a Fox News interview on Sunday, he confirmed he was heading to Riyadh, adding: \"And hopefully we'll make some really good progress.\" Sergei Lavrov Sergei Lavrov is Russia's longstanding foreign minister, having taken the role back in 2004. The highly decorated Kremlin official has been described as \"the Jedi master of the dark arts of Russian diplomacy\" by Sky News' international affairs editor Dominic Waghorn. He said Mr Lavrov is \"a diplomatic bruiser who cajoles and bullies where he sees fit\" who has been known, like others at the Kremlin, to make outlandish claims about the reality of the war. Initially, when rumours of a Russian invasion sparked, he said it would never happen - then once it began, he for some time insisted that it hadn't. The 74-year-old made headlines when he unintentionally made the audience at an international conference in India laugh in March 2023 by attempting to portray his country as the victim of the war in Ukraine. \"The war, which we are trying to stop, which was launched against us using Ukrainian people, of course, influenced the policy of Russia, including energy policy,\" he said to a chorus of laughs and groans. Yuri Ushakov Mr Putin's foreign policy adviser Yuri Ushakov will join Mr Lavrov or the Russian side of the table. Americans will be familiar with the Kremlin official, as he served as the Ambassador of Russia to the United States from 1998 until 2008 before taking up his current post in 2012. What exactly is the meeting for? Specifically, Kremlin spokesman Dmitry Peskov told reporters that the meeting would focus on restoring US-Russia relations and setting up talks for a potential Ukraine peace deal. The talks will be among the first high-level in-person discussions in years between Russian and US officials and are meant to precede a meeting between Mr Trump and Mr Putin. Mr Rubio has said the coming weeks and days would determine whether Mr Putin is serious about making peace. Read more:Man who raped and murdered Irish backpacker jailed for lifePM 'prepared to send troops to Ukraine' if peace deal reached Keith Kellogg, Mr Trump's special envoy for Ukraine and Russia, is not expected to attend the meeting, as he is at NATO's HQ in Brussels, but he has been working with Mr Trump on a plan to broker a war-ending deal with Russia. They have offered scant details about such a plan, nor any timescale for its implementation. This meeting comes off the back of Mr Trump's phone call with Mr Putin last week. Writing about the call on Truth Social, the US president said: \"As we both agreed, we want to stop the millions of deaths taking place in the War with Russia/Ukraine. \"We agreed to work together, very closely, including visiting each other's Nations. We have also agreed to have our respective teams start negotiations immediately.\" Ukraine and Europe are not invited The US and Russia have excluded Ukraine and Europe from the meeting, as tensions grow between America and European countries. It's prompted European leaders to put together their own impromptu talks in Paris, with Sir Keir Starmer saying: \"We cannot allow any divisions in the alliance to distract from the external enemies we face.\" Ukrainian President Volodymyr Zelenskyy has confirmed his country has been left out of the talks in Saudi Arabia, saying any negotiations without them will have \"no result\". \"And we cannot acknowledge anything, any arrangements about us, that were made without us. And we will not recognise such agreements,\" he told reporters on Monday. Speaking to Sky News' US partner network NBC News, Ukraine's president thanked Donald Trump for his support, but added there is not \"any leader in the world who can really make a deal with Vladimir Putin without us\". Asked whether he believed Mr Trump was negotiating in good faith, Mr Zelenskyy said: \"I hope so. I hope so. Yes, I count on it. \"I trust Trump because he's the president of the US, because your people voted for him and I respect their choice.\" In an interview on CBS News on Sunday, Mr Rubio moved to reassure Europe and Ukraine that they would be part of negotiations further down the line if they were to materialise. He said: \"If it's real negotiations, and we're not there yet, but if that were to happen, Ukraine will have to be involved because they're the one that were invaded, and the Europeans will have to be involved because… they have sanctions on Putin and Russia as well, and they've contributed to this effort.\""
    },
    {
        "title": "Day 29: Q&A - Trump's IQ, Ukraine and the presidential Sharpie pen",
        "description": "<a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/day-29-qa-trumps-iq-ukraine-and-the-presidential-sharpie-pen-13310518",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-100-trump-podcast_6818183.jpg?20250218013625",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-17 05:00:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈   On this episode, our US correspondents James Matthews, Martha Kelner and Mark Stone tackle listeners' questions on everything from the influence of Elon Musk in the Republican Party, to Donald Trump’s plans for Ukraine, to the story behind the pen President Trump uses to sign all his executive orders. If you've got a question you'd like James, Martha and Mark to answer, you can email it to trump100@sky.uk"
    },
    {
        "title": "Netanyahu signals moving ahead with Trump's Gaza plan as Israel receives unblocked US shipment of heavy bombs",
        "description": "Benjamin Netanyahu has suggested moving ahead with Donald Trump's plan to clear out Palestinians from Gaza, as Israel received a previously blocked shipment of heavy bombs.",
        "url": "https://news.sky.com/story/netanyahu-signals-moving-ahead-with-trumps-gaza-plan-as-israel-receives-unblocked-us-shipment-of-heavy-bombs-13311209",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-israel-missiles-bombs_6831174.png?20250217030208",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-17 00:43:00",
        "Headline": "The Israeli prime minister has called President Trump's proposal to transfer the Palestinian population out of Gaza \"the only viable plan to enable a different future\" for the region.",
        "Content": "Benjamin Netanyahu has suggested moving ahead with Donald Trump's plan to clear out Palestinians from Gaza, as Israel received a previously blocked shipment of heavy bombs. President Trump's proposal to transfer the Palestinian population out of Gaza and redevelop it under US ownership has been criticised by Palestinians, human rights groups, regional powers and US allies, but Mr Netanyahu said on Sunday it is \"the only viable plan to enable a different future\". The Israeli prime minister also denied claims it was ethnic cleansing. Ever since the UN General Assembly voted for Palestine to be split into an Arab state and a Jewish state, against significant opposition in 1947, the issue of land, and who it belongs to, has been one of the most divisive in the region. Mr Netanyahu said that any emigration from Gaza should be \"voluntary\" but rights groups and critics warned the plan amounted to coercion given Israel had razed the enclave. The Israeli PM said he and Mr Trump had a \"common strategy\" for Gaza and that the US president's plan was \"right on the dot\". Speaking to reporters in Florida on Sunday, Mr Trump said: \"I told Bibi [Benjamin Netanyahu] you do whatever you want.\" \n                  Benjamin Netanyahu says Gaza ceasefire will end if Hamas does not free hostages by Saturday\n                 \n                  Trump's Gaza plan is so outrageous, it might just be part of something bigger\n                 \n                  Day 17: Can Trump take over the Gaza Strip?\n                 He added:\"[It] will be up to Israel what the next step is, in consultation with me.\" The comments raise further concerns for the fragile Gaza ceasefire, which came under threat last week. Hamas initially said it would not be releasing the hostages scheduled to be sent back to Israel over worries about the supply of vitally needed aid - but later backtracked. 'Peace through strength' - with heavy bombs It comes as Israel has received a shipment of heavy MK-84 bombs from the US, initially blocked by Joe Biden, that Mr Trump greenlit. Mr Trump said he lifted the block because he believed in \"peace through strength\". The MK-84 is an unguided 907kg bomb that can rip through thick concrete and metal, creating a wide blast radius. The Biden administration refused to clear the weapons for export over fears of what they could do in the densely populated Gaza Strip. Mr Trump said on Sunday: \"They contracted for the weapons a long time ago with the Biden administration, and then Biden wouldn't deliver the weapons. But I look at it differently. I say peace through strength.\" Read more:Gaza ceasefire explainedIsrael-Hamas war: 100 years leading herePeace efforts thrown into further doubt Phase two of ceasefire deal Israel's security cabinet is set to meet on Monday to discuss the second phase of the ceasefire agreement which brought to an end around 16 months of fighting, triggered by the 7 October 2023 attack. More than 48,000 Palestinians have been killed, according to the Hamas-run Gaza health ministry, which does not differentiate between civilians and combatants in its count. At least 1,200 people were killed and more than 250 taken hostage when Hamas launched its massacre in Israel. A ceasefire agreed last month managed to finally pause fighting, but its first phase ends in two weeks. Negotiations on the second phase were meant to begin two weeks ago. If successful, it would continue the release of hostages in exchange for more Palestinian prisoners as well as a lasting truce and the withdrawal of Israeli forces. Mr Trump's special Middle East envoy, Steve Witkoff, told Fox News that \"phase two is absolutely going to begin\" and he had \"very productive\" calls on Sunday with Mr Netanyahu and officials from Egypt and Qatar, which serve as mediators, about continuing talks this week.  Three Palestinians killed Meanwhile, over the weekend the Hamas-run Gaza interior ministry blamed Israel for the deaths of three Palestinian police officers in Rafah. It said the officers had been deployed to secure the entry of aid trucks and this was a clear violation of the ceasefire. Israel's military said it had attacked several armed individuals moving towards Israeli forces."
    },
    {
        "title": "China says US 'gravely backpedalled' over change to language around Taiwan",
        "description": "China says the US has \"gravely backpedalled\" on its position on Taiwan after a government fact sheet was changed to remove a line on American opposition to independence for the breakaway province.",
        "url": "https://news.sky.com/story/china-says-us-gravely-backpedalled-over-change-to-language-around-taiwan-13311332",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-taiwan-asia_6831415.jpg?20250217104907",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-17 10:00:00",
        "Headline": "The US State Department has removed a line on American opposition to independence for Taiwan from a government factsheet.",
        "Content": "China says the US has \"gravely backpedalled\" on its position on Taiwan after a government fact sheet was changed to remove a line on American opposition to independence for the breakaway province. \"We urge the US to... stop emboldening and supporting Taiwan independence and avoid further damaging China-US relations and the peace and stability of the Taiwan Strait,\" Chinese foreign ministry spokesperson Guo Jiakun said. Taiwan and China split in 1949 during the civil war that brought the communists to power on the mainland, with the defeated Nationalists fleeing across the Taiwan Strait to set up a rival government on the island. Today, China views Taiwan as a breakaway province, with which it promises to one day reunify, and has not ruled out the use of force to do so. Tensions between the US and China over Taiwan's independence have spanned decades, particularly as Chinese warplanes have repeatedly flown close to the island's airspace. The latest row comes after the US State Department removed the phrase \"we do not support Taiwan independence\" from a fact sheet last week.  The document on America's relations with Taiwan is posted on its website. Taiwan's government welcomed the move, though a statement on Monday did not mention the language specifically. Its foreign ministry noted the change with updated text that is \"positive and friendly toward us, reflecting the close and amicable partnership between Taiwan and the United States\". Read more:Explosion in Taiwan kills at least four peopleChina conducts major military drills around Taiwan It's unclear exactly why the State Department changed the language - it did so briefly in May 2022 before changing it back - and whether it signifies a change in approach under President Donald Trump. In a statement, the State Department said: \"As is routine, the fact sheet was updated to inform the general public about our unofficial relationship with Taiwan.\" \"The United States remains committed to its one China policy,\" the spokesperson said, referring to Washington officially taking no position on Taiwan's sovereignty and only acknowledging China's position on the subject. It added that the US opposes any \"unilateral changes to the status quo from either side\"."
    },
    {
        "title": "Reynolds set for fresh talks on British Steel rescue deal",
        "description": "The business secretary will this week hold a fresh round of talks with British Steel's Chinese owner amid protracted talks about a state bailout of the Scunthorpe-based company.",
        "url": "https://news.sky.com/story/reynolds-set-for-fresh-talks-on-british-steel-rescue-deal-13311458",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-nick-martin-port-talbot_6560831.jpg?20240520134355",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-17 14:22:00",
        "Headline": "Jonathan Reynolds, the business secretary, will discuss Jingye Group's request for a bailout for the Scunthorpe-based steelmaker with the Chinese group's boss on Tuesday, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The business secretary will this week hold a fresh round of talks with British Steel's Chinese owner amid protracted talks about a state bailout of the Scunthorpe-based company. Sky News has learnt that Jonathan Reynolds will discuss the future of the industrial group with Jingye Group's boss, Li Huiming, in the latest chapter of a negotiation which has been dragging on for more than two years. Jingye, which bought British Steel in 2020, is seeking hundreds of millions of pounds from the government to electrify steelmaking at its Scunthorpe plant, where thousands of people are employed. Money blog: Nearly 300 pubs permanently closed last year It follows a £500m grant handed to Tata Steel, owner of the Port Talbot site in South Wales, last autumn. Over the weekend, Mr Reynolds signed off on a consultation on plans to support the steel industry, including state financial support worth up to £2.5bn. The proposals include tackling high electricity costs and improving the UK's scrap metal processing capabilities. \n                  Topps Tiles' purchase of rival CTD could bring up prices and make service worse - CMA\n                 \n                  Money blog: Britain's favourite banks revealed - and there's a new winner\n                 \n                  Increasing defence spending will mean government breaking promises elsewhere\n                 \"The UK steel industry has a long-term future under this government,\" Mr Reynolds insisted on Sunday. It comes amid the uncertainty for producers posed by US President Donald Trump's broad imposition of tariffs on overseas steel companies. Whitehall sources said that no formal decisions were expected to be reached during Tuesday's talks between Mr Reynolds and Mr Li. A spokesperson for the Department for Business and Trade declined to comment."
    },
    {
        "title": "Topps Tiles' purchase of rival CTD could bring up prices and make service worse - CMA",
        "description": "The UK competition regulator has warned Topp Tiles' purchase of 30 rival shops could make prices more expensive and services worse.",
        "url": "https://news.sky.com/story/topps-tiles-purchase-of-rival-ctd-could-bring-up-prices-and-make-service-worse-cma-13311294",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-topps-tiles-shop-display_6831328.jpg?20250217090018",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-02-17 12:14:00",
        "Headline": "Only four local areas in England and Scotland were identified as competition concerns. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The UK competition regulator has warned Topp Tiles' purchase of 30 rival shops could make prices more expensive and services worse. On Monday the competition regulator the Competition and Market Authority (CMA) said the acquisition of CTD Tiles stores could lead to competition issues. Money blog: Nearly 300 pubs permanently closed last year Those competition issues could mean less choice, and worse deals and service. Topp Tiles is the largest specialist tile retailer in the UK and CTD Tiles was the second biggest before it collapsed into administration last year and was bought for £9m. It meant Topp Tiles effectively bought its previous biggest competitor. \"Whether you're retiling your own home or a business that provides renovation services, the merger could make such projects more expensive,\" the CMA's executive director for mergers Joel Bamford said. Only parts of Britain, however, will be impacted by the deal, the CMA said. \n                  UK biggest phone network created as Three-Vodafone merger gets conditional approval\n                 \n                  Housebuilders Barratt and Redrow push ahead with £2.5bn merger despite competition concerns\n                 \n                  'Best and worst' UK banks for customer satisfaction revealed by poll\n                 The issues are confined to four areas of Scotland and England. After reviewing the deal, by examining internal documents and evidence from customers and competitors, the CMA judged in most areas there are \"sufficient\" competitors to Topp Tiles. Read more:Baby formula prices and branding leading to 'poor outcomes' for parents, watchdog says Home renovators and tradespeople in \"a small number of sites\" in Dorking, Edinburgh, Inverness and Aberdeen could see a reduction in competitive deals and product choice, it added. In a statement to the stock market, Topps said in response: \"The company will continue to work with the CMA in a constructive and professional manner, as it has done throughout this process. \"A further announcement will be made in due course.\" What now? Topps Tiles has until 24 February to offer solutions to the CMA's concerns. If no solutions are put forward the case will be investigated in more depth. Political pressure The regulator has come under government pressure in recent weeks to prioritise economic growth. Both Prime Minister Keir Starmer and Chancellor Rachel Reeves wrote to regulators urging them to place expanding the economy at the heart of their missions. Ms Reeves said in recent months post-financial crash regulation had \"gone too far\" while the prime minister pledged to get rid of regulation that \"needlessly holds back investment\". The CMA chair was removed last month by the Department for Business and Trade amid this push on regulators."
    },
    {
        "title": "Increasing defence spending will mean government breaking promises elsewhere",
        "description": "Donald Trump is demanding that European allies spend more on defence, and the prime minister is nodding along.",
        "url": "https://news.sky.com/story/increasing-defence-spending-will-mean-government-breaking-promises-elsewhere-13311445",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-john-healey-estonia_6780401.jpg?20241219122921",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-02-17 13:54:00",
        "Headline": "Bringing up defence spending to 2.5% of GDP would amount to an extra £5bn-£6bn in cash terms, a figure that could easily eat up most of the chancellor's financial headroom.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Donald Trump is demanding that European allies spend more on defence, and the prime minister is nodding along. At a summit in Paris, Sir Keir Starmer will urge his counterparts to take the new president seriously and to make concrete spending commitments before the NATO summit in June. Starmer is taking a leading role at the summit, but some might (rightfully) point out that Britain has itself dithered when it comes to parting with actual cash. Labour has already pledged to increase defence spending from 2.3% to 2.5% of GDP but, as of yet, there is no date for when the target will be met - unsurprisingly the Treasury wants to push it back as far as possible. Money blog: Nearly 300 pubs permanently closed last year The challenge is clear: An increase in defence spending means sacrifices will have to be made elsewhere, and promises might have to be broken. Ministers must weigh geopolitical and diplomatic risks against their domestic agenda.  This government has promised to adequately fund public services, but it is also committed to keeping a lid on borrowing, imposing a fiscal rule that requires tax receipts to cover day-to-day spending. It is managing for now. Business taxes have been hiked up to support public services - at a considerable political cost to the chancellor. Little room for manoeuvre  However, she will need to find even more money if she wants to avoid real-term cuts to courts, prisons and local authorities after this year. Rachel Reeves has promised she won't go after businesses again, but the government has also promised that it won't raise VAT, income tax or national insurance, meaning she has little room for manoeuvre. She could eat into the headroom against her fiscal target - £9.9bn - but that is already set to shrink considerably when the Office for Budget Responsibility (OBR) publishes updated economic forecasts alongside the budget next month. The watchdog is likely to downgrade the country's growth prospects, which means forecasts for tax receipts will also shrink. The Treasury is already eyeing departmental budget cuts to meet the target, an unpopular decision that runs against the government's political ambitions. So, how does all of that square with plans to increase defence spending from 2.3% to 2.5% of GDP? The move would amount to an extra £5bn-£6bn in cash terms, taking total defence spending to around £66bn a year. It may not seem like a huge sum, but it is significant in the context of the tight public finances and could easily eat up most of the chancellor's headroom. It might not even be enough Even 2.5% won't silence the critics. Military chiefs have warned that the extra sums won't be sufficient to meet current targets and would require the military to rein in its ambitions. Going to 3% of GDP would mean spending £20bn more on defence. If the country were to placate the US president and go all the way to 5% of GDP, that would mean spending around £80bn more. That's twice as large as the historically large tax rises in the autumn budget, which amounted to around £40bn. Within the current framework, that seems implausible. So, could the framework change? Britain is in the same fiscal bind as much of Europe, but the bloc has agreed to temporarily ease its fiscal rules to allow countries to spend more on defence. EU fiscal rules require countries to maintain debt-to-GDP ratios below 60% and annual deficits at 3% or below. However, Ursula von der Leyen announced the change at the Munich Security Conference on Friday \"This will allow member states to substantially increase their defence expenditure,\" she said. A tough decision That's not a decision Britain could take lightly. Changing the fiscal rules less than a year after setting them could damage credibility within the financial markets. The government is already ramping up borrowing to fund investment, which it has marked out as a spending exception necessary to spur economic growth. If it starts creating more exceptions, that could create jitters among investors. Read more from Sky News:'Swingeing' military cuts without spending rise, PM warnedChina says US 'gravely backpedalled' over Taiwan language Ben Zaranko Associate Director at the Institute for Fiscal Studies, said: \"If defence spending does need to rise significantly, it's difficult to overstate the seriousness of the fiscal challenge this would pose to the government. \"Meeting the pressures of an ageing population on the NHS while simultaneously ramping up defence expenditure, in an era of stagnant growth and elevated interest rates, would be an epochal challenge - and certainly not one that could be met while sticking to the letter of Labour's manifesto promises.\""
    },
    {
        "title": "'US security guarantee' the only path to peace in Ukraine, Starmer says - ahead of Trump meeting next week",
        "description": "A \"US security guarantee\" is the only path to peace in Ukraine, Sir Keir Starmer has said. ",
        "url": "https://news.sky.com/story/us-backstop-is-only-path-to-peace-in-ukraine-starmer-says-ahead-of-trump-meeting-next-week-13311500",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-paris-security-summit_6831903.jpg?20250217192149",
        "type": "Politics",
        "Author": "Andy Hayes, news reporter",
        "Date Published": "2025-02-17 15:49:00",
        "Headline": "The prime minister says we are in a \"new era\" in which nations cannot \"cling hopelessly to the comforts of the past\" - after attending talks in Paris.",
        "Content": "By Andy Hayes, news reporter   A \"US security guarantee\" is the only path to peace in Ukraine, Sir Keir Starmer has said.  Speaking in Paris after an emergency summit with European leaders, the prime minister said a \"US backstop\" is the \"only way to effectively deter Russia from attacking Ukraine again\". And he said the future of Ukraine is not the only thing at stake. \"It is an existential question for Europe as a whole, and therefore vital for Britain's national interests,\" he added. \"This is a once in a generation moment for the collective security of our continent.\" It is a \"new era\", he said, in which nations cannot \"cling hopelessly to the comforts of the past\". Any peace deal for Ukraine must \"safeguard its sovereignty\" and deter Russian leader Vladimir Putin from engaging in \"further aggression in the future\", Sir Keir added. Follow live: Russia gives more details ahead of peace talks with US The prime minister joined the leaders of France, Germany, Italy, Poland, Spain, the Netherlands, Denmark and the European Union at the Elysee Palace in Paris, alongside NATO secretary general Mark Rutte. The meeting was called by French President Emmanuel Macron after Donald Trump shocked continental leaders by arranging bilateral talks between the US and Russia - excluding Europe and Ukraine. The talks are set to begin in Saudi Arabia on Tuesday. Sir Keir however insisted that \"Europe must play its role\", adding: \"I'm prepared to consider committing British forces on the ground alongside others if there is a lasting peace agreement. \"So I will go to Washington next week to meet President Trump and discuss what we see as the key elements of a lasting peace.\" It is \"clear the US is not going to leave NATO\", Sir Keir said. Analysis: Sombre Starmer confronts emerging new world order He added: \"But we Europeans will have to do more. The issue of burden sharing is not new, but it is now pressing and Europeans will have to step up, both in terms of spending and the capabilities that we provide. \"I spoke to President Zelenskyy on Friday. I will do so again in the coming days. And we envisage further [engagement] with European colleagues when I return from the US.\" Britain will \"take a leading responsibility, as we always have\", the prime minister said, adding that \"democracy must prevail\".  Read more:Pope stable in hospital and 'asks for prayers'Israel says it will receive bodies of four hostages Mr Trump stunned Ukraine and Europe last week when he announced he had called Mr Putin to discuss ending the war, without consulting them. Leaders have been left scrambling to confront a new future in which they have less US protection and support and must do more to ensure the security of their own continent. Asked by Sky News's Europe correspondent, Adam Parsons, whether the US has undermined the UK, Europe and Ukraine by unilaterally starting talks with Russia, Sir Keir said the US wanted \"lasting peace\", as did Ukraine, before reiterating his point about a \"US backstop\" being necessary to support any security guarantees."
    },
    {
        "title": "Sir Keir Starmer joins Europe in confronting reality of Trump and Putin's emerging new world order",
        "description": "Sir Keir Starmer was the first leader to arrive at this meeting in Paris, strolling down the road from the British Embassy.",
        "url": "https://news.sky.com/story/sir-keir-starmer-joins-europe-in-confronting-reality-of-trump-and-putins-emerging-new-world-order-13311642",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-emmanuel-macron_6831937.jpg?20250217200030",
        "type": "Politics",
        "Author": "Adam Parsons",
        "Date Published": "2025-02-17 22:02:00",
        "Headline": "European leaders tried to reassert themselves in Paris after being pushed to the sidelines but there is a growing sense that the US and Russia see the world in the same way and may strike deals on more than the future of Ukraine.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n  Sir Keir Starmer was the first leader to arrive at this meeting in Paris, strolling down the road from the British Embassy. When he emerged, after three hours of discussion, he looked sombre. Sir Keir, like the other political heavyweights who came to the Elysee Palace, knows that Europe has been battered and marginalised over the past week or so by the actions and rhetoric that have come out of Washington. So this meeting was, to an extent, about political leaders reasserting themselves. But when we spoke, it was clear that it was also about laying down a line. Not so much about what a peace deal for Ukraine might look like, but how it would be policed. The prime minister said he was prepared to deploy British troops on the ground but was emphatic that the US would have to provide what he called a \"backstop\". He didn't elaborate on exactly what this would mean, but it's clear that he's talking about America committing its military muscle to secure Ukraine's future. \"A lasting peace\", as the prime minister insists, rather than a ceasefire that, European leaders believe, will simply allow Vladimir Putin to regroup his forces and launch another offensive. Sir Keir is trying to flex some diplomatic muscles - striking a more strident tone than, say, Olaf Scholz, the surely-soon-to-be former chancellor of Germany, while also promising to go to Washington next week for talks with Donald Trump, and then reporting back to European leaders. It is, one suspects, a rare chance for Sir Keir to take a leadership role in post-Brexit Europe, and it's one he wants to take. Read more:Delta plane upside down on Toronto runwayDetained Brits were warned to not travel to 'unsafe' areaWoman, 35, sentenced over Jellycat thefts But the bigger fear for Europeans may be that America and Russia don't want to talk to each other about just Ukraine - but also trade deals, geopolitical agreements, and potential land carve-ups. If Donald Trump really does see America's future in the stark terms of a transactional deal-maker, he may have more in common with Putin than he does with most European leaders. And that would look like a new world order."
    },
    {
        "title": "'We could not make it work': Kemi Badenoch admits Tories couldn't find money for major defence boost",
        "description": "There's been a lot of talk in politics recently about \"Western values\".",
        "url": "https://news.sky.com/story/we-could-not-make-it-work-kemi-badenoch-admits-tories-couldnt-find-money-for-major-defence-boost-13311529",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kemi-badenoch-conference_6831392.jpg?20250217100752",
        "type": "Politics",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-02-17 17:09:00",
        "Headline": "In an interview with Sky News, Ms Badenoch says the previous government wanted to get defence spending to 3% of national income by 2030 -  but that there was not enough money to make it happen.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  There's been a lot of talk in politics recently about \"Western values\". Just last week, the new US vice president JD Vance spoke about the \"crisis\" in the West and accused European governments of retreating from their values. He said Europe was determined to ignore voter concerns on migration and said free speech was in retreat. Today an alliance of politicians, leaders, thinkers, and even YouTubers congregated in east London at the \"Alliance for Responsible Citizenship\" conference to discuss the future of right wing politics and Kemi Badenoch was given the keynote speech. The problem is, she's competing with Nigel Farage to be the most compelling figure on the right, and according to various polling, is seemingly losing that battle. Politics latest: Starmer 'prepared to send troops to Ukraine' The leader of the Conservatives used her speech to say it was only her party who could be the guardian of Western civilization, and even compared herself to Donald Trump. But when I caught up with her later, she was more hazy on how much money we should be spending on defence. Ms Badenoch said the Tories had looked into increasing the current expenditure from around 2.3% of national income to 3% - but there wasn't enough money to do so. She said: \"I remember being in cabinet, seeing if we could get to 3% by 2030, and we could not make it work because we were paying so much in debt and so much on welfare. \"We've got to rewire our economy so we can look after our country.\" The Tories pledged before last year's election to hit 2.5% by 2030. Discussing this target, Ms Badenoch admitted: \"At the moment, we can't afford to do much more. We have got to change our economy around.\" Read more:PM 'must quickly' raise defence spendingScientists condemn Richard Tice's comments She also seemed unconcerned by Mr Trump's intervention in the Ukraine war - another major issue the Tory party would ordinarily seize on. 👉 Listen to Sky News Daily on your podcast app 👈 When I asked her about Trump's decision to engage with Vladimir Putin so early on and potentially cut out Ukraine in future negotiations, she said: \"Let's see what happens.\" She welcomed Mr Trump's attempts to \"end the war\", but insisted her party remained \"strong supporters of Ukraine\". \"What I'm not going to do is rush to a judgment,\" the Tory leader added. \"Nothing has actually been settled.\""
    },
    {
        "title": "'Categorically wrong': Scientists condemn comments by Reform's Richard Tice that man-made climate change is 'garbage'",
        "description": "Scientists have spoken out after Reform UK's deputy leader dismissed scientific consensus on man-made climate as \"garbage\".",
        "url": "https://news.sky.com/story/reform-uks-richard-tice-dismisses-man-made-climate-change-as-garbage-13311385",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-richard-tice-reform-uk_6831587.jpg?20250217130946",
        "type": "Politics",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-02-17 11:39:00",
        "Headline": "Richard Tice also said the scientists who agreed with him were \"not a minority\", though his view is contrary to major consensus.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  Scientists have spoken out after Reform UK's deputy leader dismissed scientific consensus on man-made climate as \"garbage\". Richard Tice MP told Sky's political correspondent Ali Fortescue: \"There's no evidence that man-made CO2 is going to change climate change. Given that it's gone on for millions of years, it will go on for millions of years.\" Fortescue challenged him with the findings of more than 200 international scientists that humans activities like burning fossil fuels are to blame for the recent hotter climate. Human influence is \"unequivocal\", said the report, which was signed off by all governments, including fossil-fuel-rich Russia, USA and Saudi Arabia. \"No, that's absolute garbage,\" Mr Tice said. \"The climate changed for millions of years before man-made CO2.\" Dr George Adamson from King's College London said the idea that Richard Tice had \"discovered something that climate scientists don't know about is of course preposterous\". The climate did change for years before humans began burning fossil fuels at scale. But what alarms scientists now is how quickly it has changed in the last few decades - too fast for nature or societies to keep up. Many came out today to rebut Mr Tice's claims. Dr Andrew Jarvis from Lancaster University called the comments \"categorically wrong\", while Dr Philipp Breul from Imperial College London said Mr Tice was \"missing the point\". \"We are causing the climate to change significantly faster than it has, to the best of our knowledge, in the last million years,\" added Dr Breul. \"This incredibly fast rate of change is the real problem, as it does not leave neither society nor the ecosystem time to adapt.\" Professor Sheila Rowan, vice president of The Royal Society of independent scientists, said the \"evidence is clear\" that burning fossil fuels has \"resulted in fundamental changes to our planet\". Mr Tice also said there were \"a thousand\" scientists who agreed with him, who were \"not a minority\". But the scientific consensus on humans causing recent climate change is greater than 99%, according to an analysis of more than 3,000 peer-reviewed studies. Bob Ward, policy director at LSE University's Grantham Research Institute and Geological Society fellow, called the comments \"pure misinformation\". \"There is not a single credible scientific organisation in the UK or the world that agrees with him about the causes or consequences of climate change,\" said Mr Ward. Prof Ed Hawkins from Reading University told Sky News: \"Of course there are natural factors which can cause the climate to vary, but they occur slowly, over thousands to millions of years, whereas the warming we have observed has happened over decades.\" The climate has warmed by 1.3C since the pre-industrial era, when humans began to burn fossil fuels at scale, according to the Copernicus science body. Earlier last week, Mr Tice set out plans to impose taxes on the renewable energy sector and scrap the UK's net zero target, if Reform UK were elected into power. He blamed these for higher energy bills and for the deindustrialisation of Britain. Reform UK only has five MPs, but last week topped a poll of voters for the first time, albeit by a tiny margin. Around two in three people who voted for Reform UK last year think it's important the government cares about climate action, according to research by More In Common. It found that although Reform voters are \"less enthusiastic about climate policies\" than other voters, climate is low on their agenda."
    },
    {
        "title": "Reynolds set for fresh talks on British Steel rescue deal",
        "description": "The business secretary will this week hold a fresh round of talks with British Steel's Chinese owner amid protracted talks about a state bailout of the Scunthorpe-based company.",
        "url": "https://news.sky.com/story/reynolds-set-for-fresh-talks-on-british-steel-rescue-deal-13311458",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-nick-martin-port-talbot_6560831.jpg?20240520134355",
        "type": "Politics",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-17 14:22:00",
        "Headline": "Jonathan Reynolds, the business secretary, will discuss Jingye Group's request for a bailout for the Scunthorpe-based steelmaker with the Chinese group's boss on Tuesday, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The business secretary will this week hold a fresh round of talks with British Steel's Chinese owner amid protracted talks about a state bailout of the Scunthorpe-based company. Sky News has learnt that Jonathan Reynolds will discuss the future of the industrial group with Jingye Group's boss, Li Huiming, in the latest chapter of a negotiation which has been dragging on for more than two years. Jingye, which bought British Steel in 2020, is seeking hundreds of millions of pounds from the government to electrify steelmaking at its Scunthorpe plant, where thousands of people are employed. Money blog: Nearly 300 pubs permanently closed last year It follows a £500m grant handed to Tata Steel, owner of the Port Talbot site in South Wales, last autumn. Over the weekend, Mr Reynolds signed off on a consultation on plans to support the steel industry, including state financial support worth up to £2.5bn. The proposals include tackling high electricity costs and improving the UK's scrap metal processing capabilities. \n                  Topps Tiles' purchase of rival CTD could bring up prices and make service worse - CMA\n                 \n                  Money blog: Britain's favourite banks revealed - and there's a new winner\n                 \n                  Increasing defence spending will mean government breaking promises elsewhere\n                 \"The UK steel industry has a long-term future under this government,\" Mr Reynolds insisted on Sunday. It comes amid the uncertainty for producers posed by US President Donald Trump's broad imposition of tariffs on overseas steel companies. Whitehall sources said that no formal decisions were expected to be reached during Tuesday's talks between Mr Reynolds and Mr Li. A spokesperson for the Department for Business and Trade declined to comment."
    },
    {
        "title": "Reform UK seen as stronger and more trustworthy than Tories, Sky News poll suggests",
        "description": "Tories trail Reform UK on a range of key indicators according to an exclusive new YouGov poll for Sky News that reveals Nigel Farage's party now has the potential to reach as much of the electorate as the party run by Kemi Badenoch.&#160;",
        "url": "https://news.sky.com/story/reform-uk-leads-the-conservative-party-on-a-number-of-key-indicators-sky-news-poll-finds-13311204",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-nigel-farage-kemi-badenoch_6831154.png?20250216232303",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-02-17 00:01:00",
        "Headline": "Reform UK has made strides catching up to a beleaguered Conservative Party in recent months and now exclusive polling shows the scale of the challenge that Kemi Badenoch is facing against Nigel Farage.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Tories trail Reform UK on a range of key indicators according to an exclusive new YouGov poll for Sky News that reveals Nigel Farage's party now has the potential to reach as much of the electorate as the party run by Kemi Badenoch.  Detailed comparisons of voter opinion towards the Tories and Reform UK reveal that profound damage to the Tory brand is still evident, while the figures suggest that the new challenger party which has topped recent voting intention polls has the capacity to perform at least as well. This brand testing is helpful so early in a parliament when distinctive policy programmes have not been set out by other parties. Sky News and YouGov tested the Tories and Reform on a string of key positive and negative measurements. Only 10% of voters currently see the Tories as strong, while 61% see them as weak. Reform UK does much better on this measure, with 31% of voters calling Reform UK strong, and 27% weak. This means three times as many voters see Reform as strong as the Tories. There is a similar gap over whether both parties have a sense of direction. Only 18% of voters say they think the Conservatives have a clear sense of purpose, 59% say that's unclear. However, the figures are different with Reform UK, and more positive, 49% say it has a clear sense of purpose, only 24% say they are unclear on what the party stands for. That means voters are more than twice as likely to see Reform UK as having a clear direction when compared to the Tories. The gap is smaller when it comes to trust, though Reform UK still does better than the Tories. Only 11% say the Tories are trustworthy, 65% say they're untrustworthy. Again the Reform figures are higher, although by less than others - 19% say they are trustworthy, 52% untrustworthy 👉Listen to Politics At Jack And Sam's on your podcast app👈 Back 10 years ago, when Nigel Farage led UKIP, some thought he or the party brand was potentially too toxic to lead or for him to become prime minister. They believed there might be a ceiling on his support that was lower than the pool of potential Tory voters. But how has that picture changed now he's leading the new party Reform UK? One way to measure this is to compare the proportion of the electorate who say they would never vote Tory - those who definitely rule it out - with the proportion that would never vote Reform UK. Some 56% say they definitely would not vote Reform UK - leaving a potential pool of voters of 44%. But an almost identical figure say they would never vote Tory - 55% - meaning their potential pool of voters is 45%, within the margin of error. This means there is no discernable lower ceiling on Reform UK than the Tories. Read more from Sky News:'Whole cabinet' recognises need for more defence spendingExtra 2 million NHS appointments in Labour's first five monthsWhat does the assisted dying bill propose? Voters on the right look more likely to switch from Tory to Reform than the other way around. Among people who voted Reform UK in the election, some 46% can rule out voting Tory. However among Conservative voters in last year's general election, that drops to 36%. Some 24% of Tory voters last year \"will\" or \"might\" vote for Reform UK now, while 8% of Reform voters \"will\" or \"might\" vote Tory."
    },
    {
        "title": "'Categorically wrong': Scientists condemn comments by Reform's Richard Tice that man-made climate change is 'garbage'",
        "description": "Scientists have spoken out after Reform UK's deputy leader dismissed scientific consensus on man-made climate as \"garbage\".",
        "url": "https://news.sky.com/story/reform-uks-richard-tice-dismisses-man-made-climate-change-as-garbage-13311385",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-richard-tice-reform-uk_6831587.jpg?20250217130946",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-02-17 11:39:00",
        "Headline": "Richard Tice also said the scientists who agreed with him were \"not a minority\", though his view is contrary to major consensus.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  Scientists have spoken out after Reform UK's deputy leader dismissed scientific consensus on man-made climate as \"garbage\". Richard Tice MP told Sky's political correspondent Ali Fortescue: \"There's no evidence that man-made CO2 is going to change climate change. Given that it's gone on for millions of years, it will go on for millions of years.\" Fortescue challenged him with the findings of more than 200 international scientists that humans activities like burning fossil fuels are to blame for the recent hotter climate. Human influence is \"unequivocal\", said the report, which was signed off by all governments, including fossil-fuel-rich Russia, USA and Saudi Arabia. \"No, that's absolute garbage,\" Mr Tice said. \"The climate changed for millions of years before man-made CO2.\" Dr George Adamson from King's College London said the idea that Richard Tice had \"discovered something that climate scientists don't know about is of course preposterous\". The climate did change for years before humans began burning fossil fuels at scale. But what alarms scientists now is how quickly it has changed in the last few decades - too fast for nature or societies to keep up. Many came out today to rebut Mr Tice's claims. Dr Andrew Jarvis from Lancaster University called the comments \"categorically wrong\", while Dr Philipp Breul from Imperial College London said Mr Tice was \"missing the point\". \"We are causing the climate to change significantly faster than it has, to the best of our knowledge, in the last million years,\" added Dr Breul. \"This incredibly fast rate of change is the real problem, as it does not leave neither society nor the ecosystem time to adapt.\" Professor Sheila Rowan, vice president of The Royal Society of independent scientists, said the \"evidence is clear\" that burning fossil fuels has \"resulted in fundamental changes to our planet\". Mr Tice also said there were \"a thousand\" scientists who agreed with him, who were \"not a minority\". But the scientific consensus on humans causing recent climate change is greater than 99%, according to an analysis of more than 3,000 peer-reviewed studies. Bob Ward, policy director at LSE University's Grantham Research Institute and Geological Society fellow, called the comments \"pure misinformation\". \"There is not a single credible scientific organisation in the UK or the world that agrees with him about the causes or consequences of climate change,\" said Mr Ward. Prof Ed Hawkins from Reading University told Sky News: \"Of course there are natural factors which can cause the climate to vary, but they occur slowly, over thousands to millions of years, whereas the warming we have observed has happened over decades.\" The climate has warmed by 1.3C since the pre-industrial era, when humans began to burn fossil fuels at scale, according to the Copernicus science body. Earlier last week, Mr Tice set out plans to impose taxes on the renewable energy sector and scrap the UK's net zero target, if Reform UK were elected into power. He blamed these for higher energy bills and for the deindustrialisation of Britain. Reform UK only has five MPs, but last week topped a poll of voters for the first time, albeit by a tiny margin. Around two in three people who voted for Reform UK last year think it's important the government cares about climate action, according to research by More In Common. It found that although Reform voters are \"less enthusiastic about climate policies\" than other voters, climate is low on their agenda."
    },
    {
        "title": "Bridget Jones 4 breaks UK box office romcom record",
        "description": "Bridget Jones: Mad About the Boy has achieved the highest-ever opening for a romcom in the UK and Ireland, according to Universal.",
        "url": "https://news.sky.com/story/bridget-jones-4-breaks-uk-box-office-romcom-record-13311455",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-renee-zellweger-bridget-jones_6831637.jpg?20250217142810",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-17 15:34:00",
        "Headline": "Bridget Jones: Mad About The Boy - starring Renée Zellweger, Leo Woodall and Chiwetel Ejiofor - has beaten the franchise's own previous record for best-performing romcom in the UK on its opening weekend.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Bridget Jones: Mad About the Boy has achieved the highest-ever opening for a romcom in the UK and Ireland, according to Universal. The fourth movie in the franchise, set around the titular unlucky-in-love heroine, took $15.5m, (£12.3m) in its first weekend, beating Marvel's first release of the year, Captain America: Brave New World. It overtakes the second film in the franchise, Bridget Jones: The Edge Of Reason - the previous record holder, which took $13.1m (£10.4m). Less of a household name in the US, Bridget's latest adventure didn't get a cinema release in the US, going straight to Universal's streaming service Peacock. The film's success in the UK follows impressive pre-sales, which were better than those of the record-breaking Margot Robbie movie Barbie - one-half of last year's \"Barbenheimer\" phenomenon. Produced by Working Title - the production company behind British hits including Four Weddings And A Funeral, Love Actually and Notting Hill - Bridget Jones 4 is now their highest-ever opening. It was also the franchise's biggest opening in Poland, Netherlands, Denmark, Norway, Sweden and Finland. \n                  Mad About The Boy: Bridget Jones is back - but is she still relevant?\n                 \n                  Bridget Jones: A heroine of our time or an absolute disgrace?\n                 \n                  Most anticipated films coming to cinemas in 2025\n                 With hit-and-miss reviews from critics, audiences seem to be enjoying the show, rating the movie 86% fresh on film review aggregator Rotten Tomatoes. The character first appeared in 1995 as anonymous columns in The Independent written by journalist Helen Fielding. A word-of-mouth hit, Fielding's four subsequent books about Bridget were bestsellers.  Speaking ahead of the film's release, the film's star, Renée Zellweger told Sky News playing Bridget was \"the best job in the world\". Starring in the latest instalment alongside Chiwetel Ejiofor and Leo Woodall, Zellweger went on: \"I love her. I love her humour. I love her vulnerability. I love her imperfection. I love the opportunity to play out her miscalculating a plan and it maybe, surprising her in her execution. I love all of it.\" The first film earned Zellweger an Oscar nod for her portrayal of Bridget, and the character's name has gone into the lexicon to describe a 30-something single woman on the lookout for love. A polarizing character, while some loved the character's relatability, others felt her obsession with her appearance and finding a man flew in the face of what it meant to be an independent woman. Fielding has said the key to Bridget's appeal lies in her revealing \"the gap between how you feel you are supposed to be and how you really are inside\". Bridget Jones: Mad About The Boy is in cinemas now."
    },
    {
        "title": "Singer Conor Maynard issues health update after being rushed to hospital",
        "description": "Singer Conor Maynard has updated fans on his health after he was rushed to hospital.",
        "url": "https://news.sky.com/story/singer-conor-maynard-issues-health-update-after-being-rushed-to-hospital-13311213",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-conor-maynard-instagram_6831181.png?20250217040842",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-17 07:00:00",
        "Headline": "The 32-year-old posted pictures of himself in a stretcher, with his neck in a brace, on his social media on Sunday.",
        "Content": "Singer Conor Maynard has updated fans on his health after he was rushed to hospital. The 32-year-old said he had fallen down a flight of stairs, sharing the news on his social media. He captioned a photo of him lying on a stretcher with his head and neck in a brace as \"Sunday Funday\". Another video, also shared on Sunday evening, showed him being wheeled outside on a stretcher by two paramedics. A few hours later he provided fans with an update. He said: \"I'm doing ok guys. You're not allowed to laugh … but I fell down some stairs. \"But nothing too serious, you can breathe now.\" Read more from Sky News:BAFTA Awards 2025: The full list of winnersShakira taken to hospitalPopular South Korean actress found dead Maynard shot to fame in 2012 with the release of Can't Say No. He released his most recent album in 2023 and is popular on TikTok."
    }
]