[
    {
        "title": "'I thought I was going to die': Passenger tells of panic during knife attack on train",
        "description": "A student has told how she thought she \"was going to die\" during a mass stabbing on a high-speed train. ",
        "url": "https://news.sky.com/story/i-thought-i-was-going-to-die-passenger-tells-of-panic-during-knife-attack-on-train-13462705",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-train-stabbing-witness_7069830.jpg?20251102183936",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-02 16:02:00",
        "Headline": "Student Amira Ostalski tells Sky News how she picked up a metal tray in the buffet car to defend herself as people around her were stabbed. ",
        "Content": " A student has told how she thought she \"was going to die\" during a mass stabbing on a high-speed train.  Amira Ostalski was travelling to London for a Saturday night out with her friend Vanessa on the \"very busy\" 6.25pm Doncaster to King's Cross LNER service. She told Sky News correspondent Dan Whitehead they were \"listening to music, just having a good time\", when \"panic and chaos\" broke out in her carriage, Coach G, between Peterborough and Huntingdon. Follow latest: Moment train attack suspect was arrested pictured \"I see five rows ahead of us a guy in a white t-shirt just jumps out of his seat,\" she said. \"People are screaming, 'he's got a knife'.... I'm guessing he stabbed the person right in front of me.\" Ms Ostalski said she came within 2m of the attacker but only caught a glimpse of him, adding: \"He was just a black bearded guy wearing all black and a hoody. \"I didn't see the knife he was holding. I'm guessing because it was already in the body or something.\" She said she \"started running\" and was \"trying to calm everyone down\" because there was a boy, around six years old, who hid in the toilets with his mum. \"Everyone's running. A guy next to me is holding his arm saying he's been stabbed. He was running. I see people covered in blood,\" she said. \"Everyone was shocked, everyone was terrified. People wanted to know what was going on, everyone's pushing and shoving. Everyone's getting trampled.\" Ms Ostalski said she heard some people crying on the phone \"in tears and in shock, thinking they're going to be stabbed\". \"It was horrific, it was really horrific because we had no idea where he was and the conductor who tried to stop him, he got stabbed as well. \"We felt that we were not safe because we were trying to get the train to stop but it wasn't stopping.\" Ms Ostalski said she ran into the buffet car where she picked up a metal tray to protect herself and her friend. \"I was honestly so petrified. I thought in that moment it was the last time I was ever going to be alive. I thought I was going to die,\" she said. Read more:Police rehearsed train knife attack scenario in MarchWhat we know so far Ms Ostalski said she saw the attacker again when the train was stopped at Huntingdon station, holding a bottle in his left hand by the door. \"He just looked so calm and I think that was the most terrifying thing,\" she said.  Police declared a major incident and armed officers can be seen in video footage sprinting along the platform. Ms Ostalski said she thought she and the other passengers were safe when the train was evacuated. But when she reached the car park, she turned around and saw the attacker jump the fence and start coming towards them. \"I have to admit, the police came really quickly and managed to detain him,\" she said. \"I saw them running then took the knife and he got tasered and fell right on the spot.\" Two men born in Britain were initially arrested but one has been released, leaving a 32-year-old in custody on suspicion of attempted murder. Police do not believe the incident was motivated by terrorism. Eleven people were treated in hospital but police said on Sunday that only one - the member of staff who tried to stop the attacker - was still in a life-threatening condition. Ms Ostalski said she finally found safety in a taxi but will remember the ordeal for the rest of her life. \"Honestly, I'm scared to sit on a train,\" she added."
    },
    {
        "title": "Police rehearsed a knife attack scenario on a train line in March - here's what went differently this time",
        "description": "British Transport Police held an emergency exercise for press officers in March, which ironically involved a stabbing on a train travelling south near Huntingdon.",
        "url": "https://news.sky.com/story/police-rehearsed-a-knife-attack-scenario-on-a-train-line-in-march-heres-what-went-differently-this-time-13462585",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-huntingdon-stabbing_7069380.jpg?20251102083357",
        "type": "Home",
        "Author": "Martin Brunt",
        "Date Published": "2025-11-02 14:15:00",
        "Headline": "No subtitle found",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n  British Transport Police held an emergency exercise for press officers in March, which ironically involved a stabbing on a train travelling south near Huntingdon. In the training drill, the train stopped immediately between stations when a passenger pulled the emergency cord. It took police 25 minutes to reach the train and casualties, far longer than the eight minutes in which Cambridgeshire firearms officers reached the scene at Huntingdon station. Follow latest: 'Nothing to suggest' terror attack, police say Chris Webb, a crisis communications expert who helped run the exercise, said: \"People think if you pull the emergency cord on a train it stops immediately, but that's not what happens these days. \"As soon as the driver knows there is a problem, he or she radios the line operator HQ and they discuss where to stop. \"The decision last night was to keep going to Huntingdon station, where it was much easier for armed police to get on.\" \n                  'Heroic' rail worker who tried to stop train knife attacker still in life-threatening condition\n                 \n                  'I thought I was going to die': Passenger tells of panic during knife attack on train\n                 \n                  Nine-month-old baby dies after dog attack in Wales\n                 He added: \"It must have been awful for passengers when the train kept going for another ten minutes or so. \"It's always a balance. It might have prolonged the attack, but stopping in the middle of nowhere can mean the attack stops but it's much more difficult for the emergency services to get there.\" Mr Webb, former head of news at Scotland Yard, said such exercises are held regularly by train operators. A similar drill was carried out on the London Underground weeks before the 7/7 bombings in 2005. \"There are always lessons to learn but you cannot guard against everything.\" In the training exercise in March the suspect was a white man with mental health issues. He was shot dead by police.  Read more:What we know so far about the Huntingdon train stabbingsEyewitness recalls horror attack on high-speed train What happened in the Huntingdon attack? Police triggered the Plato code to all emergency services in their initial response to the Huntingdon train stabbing, but that did not label it a terrorist attack. Plato is called for a major incident where it's thought a suspect is on the loose and has already, or is liable to, cause serious injury. Plato does not denote a terror attack, though it is often used in terrorist incidents. In a Plato response paramedics, fire fighters and other first responders are sent to a safe rendezvous point while armed police go in and deal with the suspect. Plato depicts a situation where unarmed responders are vulnerable and are kept back until it is safe to approach casualties. There are exceptions and it's understood the East of England Ambulance Service has a special Hazardous Area Response Team (HART) which was allowed to accompany armed police onto the platform where the two suspects were arrested last night. Once other first responders were allowed in, Plato was called off - an important part of the operation. Plato was called during the initial response to the Manchester Arena bomb attack in 2017, but the fire service was not told it had been called off for two hours and that meant its officers did not go in to help with the rescue."
    },
    {
        "title": "Nine-month-old baby dies after dog attack in Wales",
        "description": "A nine-month-old baby has died after a dog attack in a Welsh town.",
        "url": "https://news.sky.com/story/nine-month-old-baby-dies-after-dog-attack-in-wales-13462974",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-baby-dog-attack-rogiet_7070205.jpg?20251102215622",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-02 21:32:00",
        "Headline": "Police said the dog has been seized and removed from the property in Rogiet.",
        "Content": "A nine-month-old baby has died after a dog attack in a Welsh town. Gwent Police were called to an address in Rogiet, in Monmouthshire, south-east Wales, at around 6pm on Sunday. The force said officers went to the scene in Crossway at around 6pm with paramedics from the Welsh Ambulance Service. A nine-month-old baby was pronounced dead at the scene. Police said the dog has been seized and removed from the property. Gwent Police Chief Superintendent John Davies said: \"We understand that there will be concerns around this incident, but officers are on scene and will be making further enquiries as the investigation progresses. \"If you have concerns or information then please do stop and talk with us.\""
    },
    {
        "title": "Five mountaineers die after avalanche in Italy",
        "description": "Five German mountaineers have died in an avalanche in northern Italy.",
        "url": "https://news.sky.com/story/five-german-mountaineers-die-and-two-rescued-after-avalanche-in-italy-13462642",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-avalanche-italy_7069785.jpg?20251102150646",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-02 15:00:00",
        "Headline": "The victims were travelling in three groups but rescuers said they didn't know why they were still ascending at a relatively late hour.",
        "Content": "Five German mountaineers have died in an avalanche in northern Italy. It hit around 4pm on Saturday near Cima Vertana, in the Ortles mountains, at an altitude of more than 3,500m (11,500ft). Two men survived and were flown to hospital by helicopter. The bodies of three of the victims - two men and a woman - were recovered on Saturday, while a man and his 17-year-old daughter were found on Sunday morning. They were traveling independently of each other in three groups. Rescuers said they didn't know why the climbers were still ascending at a relatively late hour. \"They had been dragged to the lower part of the gully where the avalanche occurred,\" said rescue spokesman Federico Catania. \"Rescue teams are now returning to the valley, also considering the worsening weather conditions at high altitude.\" Read more from Sky News:Two Louvre heist suspects 'convicted over theft in 2015'Number of dead in Jamaica due to Hurricane Melissa rises to 28 Italy's South Tyrol is popular with German mountaineers - but avalanches are an ever-present risk. The country has one of the higher 10-year average death tolls for avalanches among major ski nations, with off-piste and backcountry skiers and snowboarders often among the victims."
    },
    {
        "title": "Remains of three more Gaza hostages handed over by Hamas, says Israel",
        "description": "Israel has said Hamas has handed over the remains of three more hostages from Gaza.",
        "url": "https://news.sky.com/story/bodies-of-three-newly-recovered-hostages-to-be-handed-over-on-sunday-night-says-hamas-13462762",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gaza-israeli-hostages_7070159.jpg?20251102200442",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-02 16:51:00",
        "Headline": "Seventeen sets of remains had previously been handed over but the bodies of 11 more hostages were thought to still be in Gaza.",
        "Content": "Israel has said Hamas has handed over the remains of three more hostages from Gaza. The group said they were discovered in a southern Gaza tunnel on Sunday. Israel Defence Forces said \"three coffins of deceased hostages\" were transported in its care by the Red Cross this evening. Tests to verify their identity will be done at the forensic institute in Tel Aviv. It comes after Israeli sources said the remains of three other people repatriated on Saturday did not match any of the missing hostages.  Israeli Prime Minister Benjamin Netanyahu earlier this week ordered new airstrikes after he accused Hamas of releasing remains of a hostage who had already been recovered. All 20 living hostages were freed under the Gaza ceasefire deal, which began on 10 October. \n                  Israel says latest remains returned from Gaza are not hostages\n                 \n                  Israel carries out fresh strike on Gaza and accuses Hamas of preparing 'imminent terror attack'\n                 \n                  Will a night of bombing mean the ceasefire rope finally frays too far?\n                 The remains of 28 dead Israelis were meant to be immediately handed over but Hamas has blamed the ruinous state of Gaza and a lack of equipment for problems locating them all. Egypt and the Red Cross have been using diggers to help search the rubble. Seventeen sets of remains had previously been handed over, but the bodies of 11 more hostages were thought to still be in Gaza, including those of two foreign nationals. Israel has accused Hamas of deliberately stalling. On Thursday, it said the remains of two hostages returned by Hamas had been confirmed as Sahar Baruch and Amiram Cooper, both taken during the 7 October terror attack. Israel released nearly 2,000 Palestinian prisoners when the truce began, and has handed over more than 200 bodies, but the violence hasn't stopped completely. Gaza health authorities say 236 people have been killed in strikes since the ceasefire began. Nearly half are said to have happened in a single day earlier this week when Israel retaliated for what it said was the death of a solider in \"enemy fire\". Hamas denied responsibility for the shooting. On Sunday, a Palestinian man was also killed by an airstrike near a vegetable market in Gaza City's Shejaia suburb, according to Gaza's health ministry and the Al-Ahli Hospital. Israel said one of its jets had attacked a fighter posing a threat to its forces. Three of its soldiers are said to have been killed during the truce. \"There are still Hamas pockets in the areas under our control in Gaza, and we are systematically eliminating them,\"Israeli Prime Minister Benjamin Netanyahu said in a broadcast on Sunday. The 20-point ceasefire plan was brokered by President Trump and has allowed Gazans to return to their devastated communities after Israeli troops pulled back. More desperately needed aid has also been allowed in. It remains to be seen whether the truce can hold long enough to make progress on other difficult questions; such as Gaza's future governance, reconstruction, and the disarmament of Hamas. About 1,200 people were killed and 251 kidnapped in the Hamas terror attack that sparked the war two years ago. Gaza officials say more than 68,600 Palestinians have died in attacks - a figure which doesn't break down the number of civilians and fighters."
    },
    {
        "title": "Two Louvre jewellery heist suspects 'convicted over theft in 2015'",
        "description": "Two of the suspects in the Louvre jewellery heist were convicted of involvement in the same theft case a decade ago, French prosecutors have revealed. ",
        "url": "https://news.sky.com/story/two-louvre-jewellery-heist-suspects-convicted-over-theft-in-2015-13462615",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-louvre-paris_7066014.jpg?20251029163806",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-02 14:31:00",
        "Headline": "French prosecutors say team that carried out the raid are more likely small-time criminals than Ocean's Eleven style professionals. ",
        "Content": "Two of the suspects in the Louvre jewellery heist were convicted of involvement in the same theft case a decade ago, French prosecutors have revealed.  Paris prosecutor Laure Beccuau said three alleged members, of what French media have dubbed the four-strong \"commando\" team who carried out the raid, are now in custody. The thieves stole nine items - one of which was dropped and recovered at the scene - worth an estimated £76m in less than eight minutes while the world-famous museum was open to visitors on 19 October. They forced open a window and cut into cases with power tools after gaining access via a vehicle-mounted mechanical lift, before fleeing on scooters.  But prosecutors said the audacious raid appears to be the work of small-time criminals from the northern suburbs of Paris rather than Ocean's Eleven-style professional gangsters. \"This is not quite everyday delinquency… but it is a type of delinquency that we do not generally associate with the upper echelons of organised crime,\" Ms Beccuau told franceinfo radio. The thieves dropped the most precious of the jewels - Empress Eugenie's crown, made of gold, emerald and diamonds - during their getaway, left tools and other items at the scene, and failed to set fire to the movers' truck before fleeing. \n                  Five new arrests in Louvre heist investigation - with one suspect 'traced via DNA'\n                 \n                  Prosecutor furious as news leaks of Louvre heist gang arrests\n                 \n                  Louvre director offers to resign and admits jewel heist was 'terrible failure' \n                 Ms Bacau said the DNA of a 37-year-old man - who was handed preliminary charges of theft by an organised gang and criminal conspiracy on Saturday - was found inside the lift. His criminal record contained 11 previous convictions, including 10 for theft, while a 39-year-old man handed similar preliminary charges on Wednesday has 15 previous convictions, including two for theft. \"What's interesting about these records, when we compare them, is that … we see that they were both involved in the same theft case, for which they were convicted in Paris in 2015,\" Ms Beccuau said. A 34-year-old man suspected of being part of the team who carried out the heist was also hit with preliminary charges on Wednesday. A 38-year-old woman who was handed preliminary charges of \"complicity\" on Saturday is said to be the girlfriend of the 37-year-old suspect, said Ms Beccuau, who added there was some \"closeness\" between all four of the suspects, who are are being held in custody. At least one suspect still at large France's interior minister Laurent Nunez said he is \"optimistic\" about the investigation but not that \"the loot will be recovered quickly\". \"There are four perpetrators, at least one of whom remains at large, plus possibly the one or those who ordered the crime and the jewelry,\" he told Le Parisien newspaper. Read more:'Race against time' as police try to recover 'priceless' jewels'Matter of time' before thieves struck, expert says Ms Beccuau did not say whether investigators are any closer to finding the stolen jewels, which included an emerald necklace and earrings tied to Empress Marie-Louise, Napoleon Bonaparte's second wife, as well as a reliquary brooch. They also took a sapphire diadem (a jewelled headband), necklace and single earring from a set linked to 19th-century queens Marie-Amelie and Hortense, Empress Eugenie's diamond diadem and her large corsage-bow brooch. \"We are examining all the possibilities on the parallel market for selling this jewellery, which I hope will not happen anytime soon. … It could be used for money laundering, it could be used for trade, all leads are being explored,\" Ms Beccuau said."
    },
    {
        "title": "Andrew could be stripped of remaining honorary military title, defence secretary says",
        "description": "Andrew Mountbatten Windsor could be stripped of his honorary rank of vice admiral, the Defence Secretary has said.",
        "url": "https://news.sky.com/story/andrew-could-be-stripped-of-remaining-honorary-military-title-defence-secretary-says-13462425",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-duke-of-york-prince-andrew_7022295.jpg?20250916164822",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-02 10:08:00",
        "Headline": "John Healey tells Sky News that the disgraced royal could lose his rank  of vice admiral.",
        "Content": " Andrew Mountbatten Windsor could be stripped of his honorary rank of vice admiral, the Defence Secretary has said. Andrew was made a vice admiral on his 55th birthday in 2015 and retained the rank even after giving up his other military positions in 2022. John Healey told Sky's Sunday Morning with Trevor Phillips: \"We've seen Andrew surrender the military positions that he's had and we're looking now at the one remaining position he has, which is the honorary vice admiral position and, we've got a process underway for that.\" Asked what that process is, he said: \"We're being guided by the King and we're now looking to remove.\" Mr Healey was also asked if the government would legislate to remove Andrew from the line of succession. He said that is a \"matter for the King\" but his personal view is \"it's neither here nor there\" as Andrew has lost all other of his royal titles. Meanwhile Kevin Hollinrake, the Conservative Party chairman, told Trevor Phillips: \"Andrew's 8th in line to succession of the monarchy. Parliament's got many better things to do than to legislate for something that will never happen.\" \n                  'Heroic' rail worker who tried to stop train knife attacker still in life-threatening condition\n                 \n                  'I thought I was going to die': Passenger tells of panic during knife attack on train\n                 \n                  Nine-month-old baby dies after dog attack in Wales\n                 The King's brother was stripped of his prince and Duke of York titles by the monarch over his links to paedophile financier Jeffrey Epstein on Thursday. He lost his last remaining royal titles and privileges following the posthumous publication of a memoir by Virginia Giuffre, one of Epstein's victims. Now simply known as Andrew Mountbatten Windsor, he will move from Royal Lodge to the Sandringham estate in Norfolk - with his future accommodation to be privately funded by the monarch. Andrew had a career spanning more than 20 years in the Royal Navy, and served in the Falklands War. Ms Giuffre, who took her own life earlier this year, has claimed that - as a teenager - she had sex with Andrew on three occasions after being trafficked by billionaire paedophile Epstein and his ex-girlfriend Ghislaine Maxwell. Andrew has always denied the allegations. Ms Giuffre's family hailed the King's decision to remove Andrew's titles, saying: \"An ordinary American girl from an ordinary American family, brought down a British prince with her truth and extraordinary courage.\"  Pressure is now building on Andrew to give evidence before a powerful US Congressional committee. The House Oversight Committee is investigating the Epstein affair, and several of its members have invited Andrew to come and give evidence, presenting it as an opportunity to clear his name. Royal biographer Andrew Morton said be believes there \"are more revelations to come\" about Epstein from the committee. He told Sky News: \"Given the fact that Andrew hasn't been fully comprehensive in his admissions and emails have emerged which go further than his Newsnight interview, I think that will be the fear inside the palace\" In a 2019 interview with Newsnight, Andrew claimed that he cut off contact with Epstein in 2010 following his release from jail for prostituting minors. However emails released since suggest they stayed in touch for longer.  "
    },
    {
        "title": "'I thought I was going to die': Passenger tells of panic during knife attack on train",
        "description": "A student has told how she thought she \"was going to die\" during a mass stabbing on a high-speed train. ",
        "url": "https://news.sky.com/story/i-thought-i-was-going-to-die-passenger-tells-of-panic-during-knife-attack-on-train-13462705",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-train-stabbing-witness_7069830.jpg?20251102183936",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-02 16:02:00",
        "Headline": "Student Amira Ostalski tells Sky News how she picked up a metal tray in the buffet car to defend herself as people around her were stabbed. ",
        "Content": " A student has told how she thought she \"was going to die\" during a mass stabbing on a high-speed train.  Amira Ostalski was travelling to London for a Saturday night out with her friend Vanessa on the \"very busy\" 6.25pm Doncaster to King's Cross LNER service. She told Sky News correspondent Dan Whitehead they were \"listening to music, just having a good time\", when \"panic and chaos\" broke out in her carriage, Coach G, between Peterborough and Huntingdon. Follow latest: Moment train attack suspect was arrested pictured \"I see five rows ahead of us a guy in a white t-shirt just jumps out of his seat,\" she said. \"People are screaming, 'he's got a knife'.... I'm guessing he stabbed the person right in front of me.\" Ms Ostalski said she came within 2m of the attacker but only caught a glimpse of him, adding: \"He was just a black bearded guy wearing all black and a hoody. \"I didn't see the knife he was holding. I'm guessing because it was already in the body or something.\" She said she \"started running\" and was \"trying to calm everyone down\" because there was a boy, around six years old, who hid in the toilets with his mum. \"Everyone's running. A guy next to me is holding his arm saying he's been stabbed. He was running. I see people covered in blood,\" she said. \"Everyone was shocked, everyone was terrified. People wanted to know what was going on, everyone's pushing and shoving. Everyone's getting trampled.\" Ms Ostalski said she heard some people crying on the phone \"in tears and in shock, thinking they're going to be stabbed\". \"It was horrific, it was really horrific because we had no idea where he was and the conductor who tried to stop him, he got stabbed as well. \"We felt that we were not safe because we were trying to get the train to stop but it wasn't stopping.\" Ms Ostalski said she ran into the buffet car where she picked up a metal tray to protect herself and her friend. \"I was honestly so petrified. I thought in that moment it was the last time I was ever going to be alive. I thought I was going to die,\" she said. Read more:Police rehearsed train knife attack scenario in MarchWhat we know so far Ms Ostalski said she saw the attacker again when the train was stopped at Huntingdon station, holding a bottle in his left hand by the door. \"He just looked so calm and I think that was the most terrifying thing,\" she said.  Police declared a major incident and armed officers can be seen in video footage sprinting along the platform. Ms Ostalski said she thought she and the other passengers were safe when the train was evacuated. But when she reached the car park, she turned around and saw the attacker jump the fence and start coming towards them. \"I have to admit, the police came really quickly and managed to detain him,\" she said. \"I saw them running then took the knife and he got tasered and fell right on the spot.\" Two men born in Britain were initially arrested but one has been released, leaving a 32-year-old in custody on suspicion of attempted murder. Police do not believe the incident was motivated by terrorism. Eleven people were treated in hospital but police said on Sunday that only one - the member of staff who tried to stop the attacker - was still in a life-threatening condition. Ms Ostalski said she finally found safety in a taxi but will remember the ordeal for the rest of her life. \"Honestly, I'm scared to sit on a train,\" she added."
    },
    {
        "title": "Nine-month-old baby dies after dog attack in Wales",
        "description": "A nine-month-old baby has died after a dog attack in a Welsh town.",
        "url": "https://news.sky.com/story/nine-month-old-baby-dies-after-dog-attack-in-wales-13462974",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-baby-dog-attack-rogiet_7070205.jpg?20251102215622",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-02 21:32:00",
        "Headline": "Police said the dog has been seized and removed from the property in Rogiet.",
        "Content": "A nine-month-old baby has died after a dog attack in a Welsh town. Gwent Police were called to an address in Rogiet, in Monmouthshire, south-east Wales, at around 6pm on Sunday. The force said officers went to the scene in Crossway at around 6pm with paramedics from the Welsh Ambulance Service. A nine-month-old baby was pronounced dead at the scene. Police said the dog has been seized and removed from the property. Gwent Police Chief Superintendent John Davies said: \"We understand that there will be concerns around this incident, but officers are on scene and will be making further enquiries as the investigation progresses. \"If you have concerns or information then please do stop and talk with us.\""
    },
    {
        "title": "Police rehearsed a knife attack scenario on a train line in March - here's what went differently this time",
        "description": "British Transport Police held an emergency exercise for press officers in March, which ironically involved a stabbing on a train travelling south near Huntingdon.",
        "url": "https://news.sky.com/story/police-rehearsed-a-knife-attack-scenario-on-a-train-line-in-march-heres-what-went-differently-this-time-13462585",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-huntingdon-stabbing_7069380.jpg?20251102083357",
        "type": "UK",
        "Author": "Martin Brunt",
        "Date Published": "2025-11-02 14:15:00",
        "Headline": "No subtitle found",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n  British Transport Police held an emergency exercise for press officers in March, which ironically involved a stabbing on a train travelling south near Huntingdon. In the training drill, the train stopped immediately between stations when a passenger pulled the emergency cord. It took police 25 minutes to reach the train and casualties, far longer than the eight minutes in which Cambridgeshire firearms officers reached the scene at Huntingdon station. Follow latest: 'Nothing to suggest' terror attack, police say Chris Webb, a crisis communications expert who helped run the exercise, said: \"People think if you pull the emergency cord on a train it stops immediately, but that's not what happens these days. \"As soon as the driver knows there is a problem, he or she radios the line operator HQ and they discuss where to stop. \"The decision last night was to keep going to Huntingdon station, where it was much easier for armed police to get on.\" \n                  'Heroic' rail worker who tried to stop train knife attacker still in life-threatening condition\n                 \n                  'I thought I was going to die': Passenger tells of panic during knife attack on train\n                 \n                  Nine-month-old baby dies after dog attack in Wales\n                 He added: \"It must have been awful for passengers when the train kept going for another ten minutes or so. \"It's always a balance. It might have prolonged the attack, but stopping in the middle of nowhere can mean the attack stops but it's much more difficult for the emergency services to get there.\" Mr Webb, former head of news at Scotland Yard, said such exercises are held regularly by train operators. A similar drill was carried out on the London Underground weeks before the 7/7 bombings in 2005. \"There are always lessons to learn but you cannot guard against everything.\" In the training exercise in March the suspect was a white man with mental health issues. He was shot dead by police.  Read more:What we know so far about the Huntingdon train stabbingsEyewitness recalls horror attack on high-speed train What happened in the Huntingdon attack? Police triggered the Plato code to all emergency services in their initial response to the Huntingdon train stabbing, but that did not label it a terrorist attack. Plato is called for a major incident where it's thought a suspect is on the loose and has already, or is liable to, cause serious injury. Plato does not denote a terror attack, though it is often used in terrorist incidents. In a Plato response paramedics, fire fighters and other first responders are sent to a safe rendezvous point while armed police go in and deal with the suspect. Plato depicts a situation where unarmed responders are vulnerable and are kept back until it is safe to approach casualties. There are exceptions and it's understood the East of England Ambulance Service has a special Hazardous Area Response Team (HART) which was allowed to accompany armed police onto the platform where the two suspects were arrested last night. Once other first responders were allowed in, Plato was called off - an important part of the operation. Plato was called during the initial response to the Manchester Arena bomb attack in 2017, but the fire service was not told it had been called off for two hours and that meant its officers did not go in to help with the rescue."
    },
    {
        "title": "'They've got a knife, I've been stabbed': Eyewitness recalls horror attack on high-speed train",
        "description": "A passenger who witnessed a mass stabbing on board a high-speed train heading for London told Sky News he heard someone yelling: \"They've got a knife. I've been stabbed.\"",
        "url": "https://news.sky.com/story/theyve-got-a-knife-ive-been-stabbed-eyewitness-recalls-horror-attack-on-high-speed-train-13462332",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-huntingdon-train-stabbing_7069303.jpg?20251101230224",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-02 03:17:00",
        "Headline": "Witnesses spoke of people trampling over each other and hiding in toilets as the attack unfolded.",
        "Content": " A passenger who witnessed a mass stabbing on board a high-speed train heading for London told Sky News he heard someone yelling: \"They've got a knife. I've been stabbed.\" The witness, who gave his name as Gavin, said there were \"extremely bloodied\" people and police shouting \"get down, get down!\" as passengers scrambled to leave the train. Ten people were taken to hospital - nine with life-threatening injuries - after the incident on the 6.25pm LNER train from Doncaster to London King's Cross on Saturday. Two people have been arrested and counter-terrorism police have been called in to join the investigation. Sky News correspondent Gurpreet Narwan at the scene said some of the first-hand accounts were \"quite terrifying\". \"We are hearing about people trampling over each other. We are hearing about passengers hiding in the toilets,\" she said. Gavin said: \"The armed police were pointing to the suspect as we came off the train. \n                  'I thought I was going to die': Passenger tells of panic during knife attack on train\n                 \n                  What we know so far about the Huntingdon train attack\n                 \n                  Train stabbing latest: 'Hero' train staff member fighting for life after trying to stop knife attacker - as one suspect released\n                 \"Police were shouting 'get down, get down'! \"He (a suspect) was waving quite a large knife. They detained him. I think it was a Taser that got him down in the end.\"  Emergency stop Passengers had pulled the emergency cord, he said, which caused the train to make an unscheduled stop at Huntingdon, where armed police boarded. Gavin added he saw someone moving through his carriage, and saying: \"They've got a knife, I've been stabbed.\" \"They were making their way through the carriage to get away from the suspects. They were extremely bloodied,\" he added. He says by the time the train stopped, \"they were basically on the floor\". \"That person ended up collapsing on the floor. They were taken to an ambulance pretty much straight away,\" he said. Read moreMajor incident declared at Huntingdon train station - as it happenedAndrew urged to 'be a man' and tell police about his time with Epstein Chief Superintendent Chris Casey of British Transport Police said: \"This is a shocking incident and first and foremost my thoughts are with those who have been injured this evening and their families. \"We're conducting urgent enquiries to establish what has happened, and it could take some time before we are in a position to confirm anything further. \"At this early stage, it would not be appropriate to speculate on the causes of the incident. \"Our response is ongoing at the station and will be for some time.\""
    },
    {
        "title": "Andrew could be stripped of remaining honorary military title, defence secretary says",
        "description": "Andrew Mountbatten Windsor could be stripped of his honorary rank of vice admiral, the Defence Secretary has said.",
        "url": "https://news.sky.com/story/andrew-could-be-stripped-of-remaining-honorary-military-title-defence-secretary-says-13462425",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-duke-of-york-prince-andrew_7022295.jpg?20250916164822",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-02 10:08:00",
        "Headline": "John Healey tells Sky News that the disgraced royal could lose his rank  of vice admiral.",
        "Content": " Andrew Mountbatten Windsor could be stripped of his honorary rank of vice admiral, the Defence Secretary has said. Andrew was made a vice admiral on his 55th birthday in 2015 and retained the rank even after giving up his other military positions in 2022. John Healey told Sky's Sunday Morning with Trevor Phillips: \"We've seen Andrew surrender the military positions that he's had and we're looking now at the one remaining position he has, which is the honorary vice admiral position and, we've got a process underway for that.\" Asked what that process is, he said: \"We're being guided by the King and we're now looking to remove.\" Mr Healey was also asked if the government would legislate to remove Andrew from the line of succession. He said that is a \"matter for the King\" but his personal view is \"it's neither here nor there\" as Andrew has lost all other of his royal titles. Meanwhile Kevin Hollinrake, the Conservative Party chairman, told Trevor Phillips: \"Andrew's 8th in line to succession of the monarchy. Parliament's got many better things to do than to legislate for something that will never happen.\" \n                  'Heroic' rail worker who tried to stop train knife attacker still in life-threatening condition\n                 \n                  'I thought I was going to die': Passenger tells of panic during knife attack on train\n                 \n                  Nine-month-old baby dies after dog attack in Wales\n                 The King's brother was stripped of his prince and Duke of York titles by the monarch over his links to paedophile financier Jeffrey Epstein on Thursday. He lost his last remaining royal titles and privileges following the posthumous publication of a memoir by Virginia Giuffre, one of Epstein's victims. Now simply known as Andrew Mountbatten Windsor, he will move from Royal Lodge to the Sandringham estate in Norfolk - with his future accommodation to be privately funded by the monarch. Andrew had a career spanning more than 20 years in the Royal Navy, and served in the Falklands War. Ms Giuffre, who took her own life earlier this year, has claimed that - as a teenager - she had sex with Andrew on three occasions after being trafficked by billionaire paedophile Epstein and his ex-girlfriend Ghislaine Maxwell. Andrew has always denied the allegations. Ms Giuffre's family hailed the King's decision to remove Andrew's titles, saying: \"An ordinary American girl from an ordinary American family, brought down a British prince with her truth and extraordinary courage.\"  Pressure is now building on Andrew to give evidence before a powerful US Congressional committee. The House Oversight Committee is investigating the Epstein affair, and several of its members have invited Andrew to come and give evidence, presenting it as an opportunity to clear his name. Royal biographer Andrew Morton said be believes there \"are more revelations to come\" about Epstein from the committee. He told Sky News: \"Given the fact that Andrew hasn't been fully comprehensive in his admissions and emails have emerged which go further than his Newsnight interview, I think that will be the fear inside the palace\" In a 2019 interview with Newsnight, Andrew claimed that he cut off contact with Epstein in 2010 following his release from jail for prostituting minors. However emails released since suggest they stayed in touch for longer.  "
    },
    {
        "title": "Vitor Pereira sacked as Wolves manager just weeks after signing new contract, as club remains winless and bottom of the Premier League",
        "description": "Wolves have sacked head coach Vitor Pereira, with the club sitting bottom of the Premier League table and without a win this season.",
        "url": "https://news.sky.com/story/vitor-pereira-sacked-as-wolves-manager-just-weeks-after-signing-new-contract-as-club-remains-winless-and-bottom-of-the-premier-league-13462521",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-wolves-vitor-pereira_7069650.jpg?20251102134307",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-02 13:03:00",
        "Headline": "Pereira was appointed by Wolves in December 2024 and helped saved the club from relegation last season. ",
        "Content": "Wolves have sacked head coach Vitor Pereira, with the club sitting bottom of the Premier League table and without a win this season. Pereira's departure comes only 45 days after he signed a new three-year contract at Wolves. On Saturday, they suffered a 3-0 defeat at Craven Cottage against Fulham, with Pereira subjected to chants of \"you're getting sacked in the morning\" by the travelling fans. They also lost 4-3 to Chelsea in the Carabao Cup fourth round on Wednesday. The Midlands club have only two points from their first 10 Premier League games of the season, leaving them eight points from safety. No club has ever survived with two or fewer points at this stage of a Premier League season. Wolves are the only winless side in England's top four divisions, scoring just seven goals and conceding 22, the most of any Premier League club. \n                  Premier League's Brittain seeks extra time as Manchester City verdict looms\n                 \n                  Nottingham Forest boss Ange Postecoglou sacked by Premier League club after eight games in charge\n                 \n                  Former Premier League referee David Coote pleads guilty to making indecent image of child\n                 Pereira was appointed by Wolves as Gary O'Neil's successor in December 2024 when they were second from bottom of the Premier League. He steered them to a 16th-placed finish, 17 points clear of the relegation zone. In a statement, Wolves' executive chairman Jeff Shi said: \"Vitor and his team worked tirelessly for Wolves and helped guide us through a challenging period last season, for which we are grateful. \"Unfortunately, the start to this season has been a disappointment and, despite our strong desire to give the head coach time and matches to find an improvement, we have reached a point where we must make a change. \"We thank Vitor and his staff for their efforts and wish them the very best for the future.\" All eight of Pereira's backroom staff have also left the club, with Under-21 head coach James Collins and U18 head coach Richard Walker set to take over training while the club finalise the appointment of a new first-team head coach. Pereira's replacement faces some challenges in the weeks ahead, meeting some difficult Premier League opponents in the next few fixtures, among them Chelsea, Manchester United and Arsenal. Read more from Sky News:Postecoglou sacked after eight gamesManchester City verdict loomsRecord-breaking transfer window Pereira described Saturday's defeat to Fulham as the worst of his tenure. He said: \"Today I felt my team physically were not in condition, not at the level to face Fulham. \"I must talk to my players to understand what the problem was today. I can say to you I am doing my best and working hard. I cannot control time or the confidence the club has. \"But me and my staff are trying everything to help the team to perform and get results.\""
    },
    {
        "title": "Number of dead in Jamaica due to Hurricane Melissa rises to 28",
        "description": "A total of 28 people have died following Hurricane Melissa's rampage across Jamaica, the government has confirmed.",
        "url": "https://news.sky.com/story/hurricane-melissa-leaves-28-dead-after-tearing-through-jamaica-13462331",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-hurricane-melissa-jamaica_7069326.jpg?20251102124017",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-02 01:34:00",
        "Headline": "The Jamaican government confirms the fatalities - as the first British repatriation flight was setting off from the island on Saturday evening.",
        "Content": "A total of 28 people have died following Hurricane Melissa's rampage across Jamaica, the government has confirmed. Melissa, one of the strongest storms on record to make landfall in the Caribbean, brought with it winds of up to 185mph when it hit the island earlier this week. The Red Cross described it as a \"disaster of unprecedented catastrophe\". Melissa ravaged through Jamaica, Haiti, the Dominican Republic, and Cuba. It weakened by the time it reached Cuba on Wednesday morning but still brought devastation - with houses collapsed and roads blocked. A statement from the government of Jamaica said it was \"deeply saddened to confirm 28 fatalities associated with the passage of Hurricane Melissa\". It went on: \"We extend heartfelt condolences to the families, friends, and communities mourning their loved ones.\" Eyewitness: 'Send help' - the desperate pleas from Hurricane Melissa survivors The confirmation came as the first British repatriation flight was setting off from the island on Saturday evening local time. The flight, chartered by the Foreign, Commonwealth and Development Office, was for those \"unable to leave Jamaica on commercial routes\". Essential relief supplies are now rolling into some of the hardest hit areas. The UK government is mobilising an additional £5m in emergency humanitarian funding - on top of £2.5m announced earlier this week - to support the region's recovery.This new funding will enable the UK to send humanitarian supplies - including more than 3,000 shelter kits and over 1,500 solar-powered lanterns to help those whose homes have been damaged and those without power. Read more:Before and after images show hurricane's destructionDo we need new 'category 6' for most extreme storms? The UK is working with the World Food Programme and Red Cross, to ensure emergency relief reaches those who need it most. At least 25 people died in the southern Haitian coastal town of Petit-Goave after the La Digue river burst its banks as a result of the hurricane, according to the town's mayor Jean Bertrand Subreme."
    },
    {
        "title": "Two Louvre jewellery heist suspects 'convicted over theft in 2015'",
        "description": "Two of the suspects in the Louvre jewellery heist were convicted of involvement in the same theft case a decade ago, French prosecutors have revealed. ",
        "url": "https://news.sky.com/story/two-louvre-jewellery-heist-suspects-convicted-over-theft-in-2015-13462615",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-louvre-paris_7066014.jpg?20251029163806",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-02 14:31:00",
        "Headline": "French prosecutors say team that carried out the raid are more likely small-time criminals than Ocean's Eleven style professionals. ",
        "Content": "Two of the suspects in the Louvre jewellery heist were convicted of involvement in the same theft case a decade ago, French prosecutors have revealed.  Paris prosecutor Laure Beccuau said three alleged members, of what French media have dubbed the four-strong \"commando\" team who carried out the raid, are now in custody. The thieves stole nine items - one of which was dropped and recovered at the scene - worth an estimated £76m in less than eight minutes while the world-famous museum was open to visitors on 19 October. They forced open a window and cut into cases with power tools after gaining access via a vehicle-mounted mechanical lift, before fleeing on scooters.  But prosecutors said the audacious raid appears to be the work of small-time criminals from the northern suburbs of Paris rather than Ocean's Eleven-style professional gangsters. \"This is not quite everyday delinquency… but it is a type of delinquency that we do not generally associate with the upper echelons of organised crime,\" Ms Beccuau told franceinfo radio. The thieves dropped the most precious of the jewels - Empress Eugenie's crown, made of gold, emerald and diamonds - during their getaway, left tools and other items at the scene, and failed to set fire to the movers' truck before fleeing. \n                  Five new arrests in Louvre heist investigation - with one suspect 'traced via DNA'\n                 \n                  Prosecutor furious as news leaks of Louvre heist gang arrests\n                 \n                  Louvre director offers to resign and admits jewel heist was 'terrible failure' \n                 Ms Bacau said the DNA of a 37-year-old man - who was handed preliminary charges of theft by an organised gang and criminal conspiracy on Saturday - was found inside the lift. His criminal record contained 11 previous convictions, including 10 for theft, while a 39-year-old man handed similar preliminary charges on Wednesday has 15 previous convictions, including two for theft. \"What's interesting about these records, when we compare them, is that … we see that they were both involved in the same theft case, for which they were convicted in Paris in 2015,\" Ms Beccuau said. A 34-year-old man suspected of being part of the team who carried out the heist was also hit with preliminary charges on Wednesday. A 38-year-old woman who was handed preliminary charges of \"complicity\" on Saturday is said to be the girlfriend of the 37-year-old suspect, said Ms Beccuau, who added there was some \"closeness\" between all four of the suspects, who are are being held in custody. At least one suspect still at large France's interior minister Laurent Nunez said he is \"optimistic\" about the investigation but not that \"the loot will be recovered quickly\". \"There are four perpetrators, at least one of whom remains at large, plus possibly the one or those who ordered the crime and the jewelry,\" he told Le Parisien newspaper. Read more:'Race against time' as police try to recover 'priceless' jewels'Matter of time' before thieves struck, expert says Ms Beccuau did not say whether investigators are any closer to finding the stolen jewels, which included an emerald necklace and earrings tied to Empress Marie-Louise, Napoleon Bonaparte's second wife, as well as a reliquary brooch. They also took a sapphire diadem (a jewelled headband), necklace and single earring from a set linked to 19th-century queens Marie-Amelie and Hortense, Empress Eugenie's diamond diadem and her large corsage-bow brooch. \"We are examining all the possibilities on the parallel market for selling this jewellery, which I hope will not happen anytime soon. … It could be used for money laundering, it could be used for trade, all leads are being explored,\" Ms Beccuau said."
    },
    {
        "title": "Five mountaineers die after avalanche in Italy",
        "description": "Five German mountaineers have died in an avalanche in northern Italy.",
        "url": "https://news.sky.com/story/five-german-mountaineers-die-and-two-rescued-after-avalanche-in-italy-13462642",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-avalanche-italy_7069785.jpg?20251102150646",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-02 15:00:00",
        "Headline": "The victims were travelling in three groups but rescuers said they didn't know why they were still ascending at a relatively late hour.",
        "Content": "Five German mountaineers have died in an avalanche in northern Italy. It hit around 4pm on Saturday near Cima Vertana, in the Ortles mountains, at an altitude of more than 3,500m (11,500ft). Two men survived and were flown to hospital by helicopter. The bodies of three of the victims - two men and a woman - were recovered on Saturday, while a man and his 17-year-old daughter were found on Sunday morning. They were traveling independently of each other in three groups. Rescuers said they didn't know why the climbers were still ascending at a relatively late hour. \"They had been dragged to the lower part of the gully where the avalanche occurred,\" said rescue spokesman Federico Catania. \"Rescue teams are now returning to the valley, also considering the worsening weather conditions at high altitude.\" Read more from Sky News:Two Louvre heist suspects 'convicted over theft in 2015'Number of dead in Jamaica due to Hurricane Melissa rises to 28 Italy's South Tyrol is popular with German mountaineers - but avalanches are an ever-present risk. The country has one of the higher 10-year average death tolls for avalanches among major ski nations, with off-piste and backcountry skiers and snowboarders often among the victims."
    },
    {
        "title": "At least 26 people dead after Kenya landslide",
        "description": "At least 26 people have died and 25 others are still missing after a landslide in western Kenya during heavy rains. ",
        "url": "https://news.sky.com/story/at-least-26-people-dead-after-kenya-landslide-13462792",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-kenya-landslides_7069982.jpg?20251102173450",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-02 17:25:00",
        "Headline": "Heavy rains are continuing across the country, with floods reported in several counties, and thousands of people displaced.",
        "Content": " At least 26 people have died and 25 others are still missing after a landslide in western Kenya during heavy rains.  The government has stepped up the search mission, with four military planes deployed to help access the area that has been completely cut off after roads were washed away in devastating floods on Saturday. But rescue efforts were suspended on Sunday after flash floods from a hill in the Chesongoch area in Kenya's Rift Valley region. Heavy rains are continuing across the country, with floods reported in several counties, and thousands of people displaced. The Kenyan government is urging anyone living in areas prone to flooding or landslides to move as the wet weather is expected to continue. Interior minister Kipchumba Murkomen said supplies will be airlifted to affected areas, including 15 schools that have been cut off, where national exam papers will also be flown in. He said the government will pay the medical bills of more than 30 injured people and resettle dozens of others whose homes have been swept away. \n                  Ex-British soldiers among those who fathered Kenyan children while at Army base, court rules\n                 \n                  Former Kenyan prime minister Raila Odinga dies aged 80\n                 \n                  Agnes Wanjiru: Niece of Kenyan woman 'murdered by British soldier' comes to UK to seek justice\n                 Oscar Okum, regional manager for the Kenya Red Cross, said the Rift Valley area was still susceptible to landslides. \"Today, while we were doing search and recovery and rescue, we have had roads that are already opened being populated again by mudslides,\" he said. \"So it's still an active incidence and we urge the community members to move to safer grounds for purposes of their safety, lives and livelihoods as well.\" Hundreds of people have been killed in recent years in landslides and flooding in Kenya, with scientists saying climate change is causing more intense and frequent extreme weather events. Read more from Sky News:US carries out another lethal strike in CaribbeanHamas says bodies of three newly recovered hostages will be handed over  In the worst incident last year, 61 people were killed in a mudslide and flash floods in central Kenya. Landslides in the east of neighbouring Uganda have also killed at least 13 people in the last week, according to the Uganda Red Cross."
    },
    {
        "title": "Remains of three more Gaza hostages handed over by Hamas, says Israel",
        "description": "Israel has said Hamas has handed over the remains of three more hostages from Gaza.",
        "url": "https://news.sky.com/story/bodies-of-three-newly-recovered-hostages-to-be-handed-over-on-sunday-night-says-hamas-13462762",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gaza-israeli-hostages_7070159.jpg?20251102200442",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-02 16:51:00",
        "Headline": "Seventeen sets of remains had previously been handed over but the bodies of 11 more hostages were thought to still be in Gaza.",
        "Content": "Israel has said Hamas has handed over the remains of three more hostages from Gaza. The group said they were discovered in a southern Gaza tunnel on Sunday. Israel Defence Forces said \"three coffins of deceased hostages\" were transported in its care by the Red Cross this evening. Tests to verify their identity will be done at the forensic institute in Tel Aviv. It comes after Israeli sources said the remains of three other people repatriated on Saturday did not match any of the missing hostages.  Israeli Prime Minister Benjamin Netanyahu earlier this week ordered new airstrikes after he accused Hamas of releasing remains of a hostage who had already been recovered. All 20 living hostages were freed under the Gaza ceasefire deal, which began on 10 October. \n                  Israel says latest remains returned from Gaza are not hostages\n                 \n                  Israel carries out fresh strike on Gaza and accuses Hamas of preparing 'imminent terror attack'\n                 \n                  Will a night of bombing mean the ceasefire rope finally frays too far?\n                 The remains of 28 dead Israelis were meant to be immediately handed over but Hamas has blamed the ruinous state of Gaza and a lack of equipment for problems locating them all. Egypt and the Red Cross have been using diggers to help search the rubble. Seventeen sets of remains had previously been handed over, but the bodies of 11 more hostages were thought to still be in Gaza, including those of two foreign nationals. Israel has accused Hamas of deliberately stalling. On Thursday, it said the remains of two hostages returned by Hamas had been confirmed as Sahar Baruch and Amiram Cooper, both taken during the 7 October terror attack. Israel released nearly 2,000 Palestinian prisoners when the truce began, and has handed over more than 200 bodies, but the violence hasn't stopped completely. Gaza health authorities say 236 people have been killed in strikes since the ceasefire began. Nearly half are said to have happened in a single day earlier this week when Israel retaliated for what it said was the death of a solider in \"enemy fire\". Hamas denied responsibility for the shooting. On Sunday, a Palestinian man was also killed by an airstrike near a vegetable market in Gaza City's Shejaia suburb, according to Gaza's health ministry and the Al-Ahli Hospital. Israel said one of its jets had attacked a fighter posing a threat to its forces. Three of its soldiers are said to have been killed during the truce. \"There are still Hamas pockets in the areas under our control in Gaza, and we are systematically eliminating them,\"Israeli Prime Minister Benjamin Netanyahu said in a broadcast on Sunday. The 20-point ceasefire plan was brokered by President Trump and has allowed Gazans to return to their devastated communities after Israeli troops pulled back. More desperately needed aid has also been allowed in. It remains to be seen whether the truce can hold long enough to make progress on other difficult questions; such as Gaza's future governance, reconstruction, and the disarmament of Hamas. About 1,200 people were killed and 251 kidnapped in the Hamas terror attack that sparked the war two years ago. Gaza officials say more than 68,600 Palestinians have died in attacks - a figure which doesn't break down the number of civilians and fighters."
    },
    {
        "title": "As Russia marks Stalin's political repression, some fear the country's dark history could repeat itself",
        "description": "In the shadow of the headquarters of Russia's FSB security service, formerly the home of the Soviet-era KGB, people came to lay flowers this week.",
        "url": "https://news.sky.com/story/as-russia-marks-stalins-political-repression-some-fear-the-countrys-dark-history-could-repeat-itself-13461584",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-russia-moscow_7068335.jpg?20251101010202",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-11-02 00:01:00",
        "Headline": "Many were remembering relatives who were targeted in the dictator's infamous purges, marking Russia's annual day of remembrance. But while the focus was ostensibly on the past, one couldn't help but think about the present too.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  In the shadow of the headquarters of Russia's FSB security service, formerly the home of the Soviet-era KGB, people came to lay flowers this week. Hundreds of roses, hydrangeas and carnations were left around a huge stone on Moscow's Lubyanka Square. The Solovetsky Stone is a memorial to victims of political repression and the thousands who were killed under Soviet leader Joseph Stalin. Many here were remembering relatives who were targeted in the dictator's infamous purges, marking Russia's annual day of remembrance. But while the focus was ostensibly on the past, one couldn't help but think about the present too. Since its invasion of Ukraine three and a half years ago, Russia has been fighting a war on two fronts - one on the battlefield against its neighbour and one at home against domestic opponents. More than 20,000 people have been detained for speaking out against the conflict, according to human rights group OVD-Info. So, could Russia's dark history of repression repeat itself? \"It could be possible, entirely possible,\" said Iraida, who was at the stone to honour her great-grandparents. \"Say the wrong thing, think the wrong thing, or turn on the wrong channel, sing the wrong song. \"It's very sad. Very sad that people can't express their thoughts.\" Read more:Underneath Russian bravado to US sanctions, there will be concernWelcome to Russia's alternative Eurovision The song she appeared to be referring to is Swan Lake Cooperative by exiled Russian rapper Noize MC. Openly critical of the Kremlin, he's been labelled as a \"foreign agent\" by the authorities, which banned his song because it promoted \"violent changes to the foundation of the constitutional order\". Despite this, the song was recently performed by a group of young street musicians in St Petersburg and footage of their impromptu concert went viral on social media. It wasn't the only illicit material they played. The band, called Stoptime, also had crowds singing along to You Are A Soldier by Monetochka, who is another anti-war artist classified as a foreign agent and living in exile. To those who oppose Russia's current trajectory, it was music to their ears. But it didn't last long. Stoptime's three teenage members were soon arrested, tried and jailed. At first, they were convicted of organising an unplanned gathering. But then more charges followed, including the much more serious one of discrediting the Russian army, and it means they now face more jail time. The case serves as yet another example of Russia's crackdown on dissent, in which any form of protest, real or perceived, is silenced. It's not just musicians who are targeted. Also in court this week was Maxim Kruglov, the deputy leader of the liberal Yabloko party, which opposes the war in Ukraine. He's charged with spreading fake news about the armed forces. If found guilty, he could face a decade behind bars. \"It is re-Stalinism,\" says Yabloko leader Nikolai Rybakov, when I ask how he would characterise the continuing wave of arrests. \"It's about the atmosphere in the country, an atmosphere of danger, and of course it's about a climate of fear.\" You could certainly sense that atmosphere back at the Solovetsky Stone, which has previously served as a focal point for supporters of the late opposition leader Alexei Navalny. Everyone, including us, was under the watchful gaze of the authorities. Two police vans were parked nearby, dozens of armed officers stood ready for action, and there were numerous plain-clothed FSB agents taking photographs and videos of people's faces. (Amid a crowd of mostly pensioners, the agents are easy to spot.) By laying flowers here, people risked being marked out as potential trouble-makers. At one point, an elderly man arrived wearing a sign around his neck that bore the letters \"SVO\". In Russian, they form a frequently-used acronym for the war in Ukraine, which the Kremlin still refers to as a \"Special Military Operation\". It wasn't immediately clear if this was a protest or not, but suddenly there was tension. Police began to circle, eyeballing the sign. There was a flurry of nervous muttering into radios. Were we about to witness the latest anti-war arrest? In the end, the officers backed away as the pensioner began to light candles and lay flowers - the letters apparently a reference to something else. Either way, it felt like a very rare reprieve."
    },
    {
        "title": "'We will treat them EXACTLY how we treated al Qaeda' - US carries out another lethal strike in Caribbean",
        "description": "The US military has carried out a fresh strike on what it claims are drug smugglers in the Caribbean Sea - as tensions with Venezuela&#160;remain high.",
        "url": "https://news.sky.com/story/we-will-treat-them-exactly-how-we-treated-al-qaeda-us-carries-out-another-lethal-strike-in-caribbean-13462365",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-venezuela-caribbean_7069368.png?20251102081501",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-02 07:35:00",
        "Headline": "Three people were killed in the latest incident, at least the 15th strike by the US in the Caribbean or eastern Pacific since early September.",
        "Content": "The US military has carried out a fresh strike on what it claims are drug smugglers in the Caribbean Sea - as tensions with Venezuela remain high. Secretary for War Pete Hegseth announced the strike on Saturday, claiming the vessel was operated by a US-designated terrorist organisation, but did not name which group was targeted. He said three people were killed. \"This vessel - like EVERY OTHER - was known by our intelligence to be involved in illicit narcotics smuggling, was transiting along a known narco-trafficking route, and carrying narcotics,\" he said. It's at least the 15th strike by the US in the Caribbean or eastern Pacific since early September - operations that Venezuela has said amount to murder and whose legal justification is unclear. At least 64 people have now been killed in the strikes. The rhetoric coming out of the White House, coupled with the presence of American military ships in the region, has raised questions about a possible armed conflict between the US and Venezuela. \n                  More than a dozen killed as US attacks alleged drug boats in Pacific 'on Donald Trump's orders'\n                 \n                  Is Trump getting ready to run for a third term?\n                 \n                  Warships, the CIA and potential 'precision attacks' - the US-Venezuela crisis explained\n                 American politicians have repeatedly demanded more information from the Trump administration about the legal basis for the strikes, as well as more details about the cartels they have allegedly targeted. \"These narco-terrorists are bringing drugs to our shores to poison Americans at home - and they will not succeed,\" Mr Hegseth said on Saturday. \"The Department will treat them EXACTLY how we treated Al-Qaeda. We will continue to track them, map them, hunt them, and kill them.\"  Read more:Is Trump preparing to go to war with Venezuela?Satellite images show US military edging closer to Venezuela President Donald Trump has accused Venezuela's President Nicolas Maduro of leading an organised crime gang - without providing evidence - and declined to answer when questioned if the CIA has the authority to assassinate him. In return, the Venezuelan leader has accused Mr Trump of seeking regime change and of \"fabricating a new eternal war\" against his country, as he appealed to the American people for peace. A number of US navy vessels are in the region and the USS Gerald R Ford aircraft carrier - the largest warship in the world - is also moving closer to Venezuela as speculation persists about possible further military action."
    },
    {
        "title": "Murdoch-backed Brave Bison in £50m bid for M&C Saatchi division",
        "description": "A deal-hungry London-listed marketing group backed by Rupert Murdoch and Lord Ashcroft, the former Tory treasurer, has made a &#163;50m approach to buy a division of M&C Saatchi.",
        "url": "https://news.sky.com/story/murdoch-backed-brave-bison-in-16350m-bid-for-mc-saatchi-division-13462408",
        "image_url": "https://e3.365dm.com/23/07/1920x1080/skynews-mc-saatchi-business_6228238.jpg?20251102093928",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-02 09:37:00",
        "Headline": "The London-listed company run by brothers Oli and Theo Green has made a cash-and-stock offer for M&C Performance, a digital media planning and buying operation, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A deal-hungry London-listed marketing group backed by Rupert Murdoch and Lord Ashcroft, the former Tory treasurer, has made a £50m approach to buy a division of M&C Saatchi. Sky News has learnt that Brave Bison, run by brothers Oli and Theo Green, has tabled a cash-and-stock proposal to acquire M&C Performance. The target handles media planning and buying across digital channels, a key growth area in the marketing industry. M&C Performance's clients include Amazon and Meta, the owner of Facebook, Instagram and WhatsApp. City sources said this weekend that M&C Saatchi had received the offer from Brave Bison but that its response was unclear. If it progresses, it would be the latest in a string of deals for Brave Bison, which has bought five other businesses this year alone. Among them was MiniMBA, an e-learning and training business serving marketing and technology professionals, which it bought from Centaur Media. Brave Bison, whose clients include Primark and Real Madrid, has also bought Engage, a sports marketing specialist. Any deal for M&C Performance would involve issuing new stock as well as utilising Brave Bison's debt facilities, banking sources suggested on Sunday. Brave Bison's shares have almost doubled during the year to date, while M&C Saatchi's stock has fallen by 22% during the same period. The latter has a market capitalisation of roughly £160m, little more than half the value of an offer three years ago which priced it at more than £300m including debt. Mr Murdoch's News Corporation took a stake in Brave Bison earlier this year through a combinationn of their influencer marketing divisions. The Green brothers took over Brave Bison in 2020, and have overseen a sharp strategic realignment and improvement in its performance. Last year, it bought the podcaster and entrepreneur Steven Bartlett's social media and influencer agency, SocialChain. At Friday's stock market close, Brave Bison had a market capitalisation of about £82m. Both Brave Bison and M&C Saatchi declined to comment."
    }
]