[
    {
        "title": "Andrew moves out of Royal Lodge - as police assess new allegation",
        "description": "Andrew Mountbatten-Windsor has moved out of Royal Lodge, palace sources have said - as police assess claims that a woman was sent to the former duke by Jeffrey Epstein in 2010.",
        "url": "https://news.sky.com/story/andrew-moves-out-of-royal-lodge-as-police-assess-new-allegation-epstein-sent-woman-to-former-duke-in-2010-13502991",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-andrew-mountbatten_7151313.jpg?20260203233217",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-03 22:37:00",
        "Headline": "Thames Valley Police said it is assessing a claim that a woman was sent by Jeffrey Epstein to Andrew at Royal Lodge in 2010. The former duke has not responded to the newest claim, but has previously denied all wrongdoing related to Epstein.",
        "Content": "Andrew Mountbatten-Windsor has moved out of Royal Lodge, palace sources have said - as police assess claims that a woman was sent to the former duke by Jeffrey Epstein in 2010. Andrew's move is part of a permanent move to Norfolk, which may take some time, according to Sky's royal correspondent Rhiannon Mills. He is now living in a house on Sandringham Estate in Norfolk, which is seen as temporary accommodation. There will be a further move in the coming months once final arrangements have been made. The palace had announced last October that the King had started the process of removing the style, title and honours of the former prince after the Epstein-linked allegations against him had started to \"distract\" from the Royal Family's work. Andrew had lived at Royal Lodge, a 30-room mansion on the Windsor Estate, for more than 20 years. It emerged he had been paying a \"peppercorn rent\" - a legal term used to show that rent technically exists, so the lease is valid, but it's nominal - often £1 a year or even nothing at all. \n                  Prince Edward forced to address Epstein scandal due to his brother\n                 \n                  The Epstein Files - where's Donald Trump?\n                 \n                  New Andrew allegation must be investigated, says former Metropolitan Police chief\n                 It comes as police assess a claim that a woman was sent by Epstein to Andrew at Royal Lodge in 2010. The encounter allegedly took place when the woman was in her 20s, her lawyer told the BBC earlier this week. A Thames Valley Police spokesperson said: \"We are aware of reports about a woman said to have been taken to an address in Windsor in 2010 for sexual purposes. \"We are assessing the information in line with our established procedures. We take any reports of sexual crimes extremely seriously and encourage anyone with information to come forward. \"At this time, these allegations have not been reported to Thames Valley Police by either the lawyer or their client.\" Andrew has not commented on the latest claims but has previously denied any wrongdoing related to Epstein. Read more:Epstein survivors condemn US government's handling of filesEpstein files: The key findings so far Last year Andrew and his ex-wife Sarah Ferguson agreed they would leave the property in exchange for two separate residences. Andrew previously faced accusations of sexual misconduct from Virginia Giuffre. He made a financial payment to her in an out-of-court settlement in 2022 after Ms Giuffre had launched a civil case against him. Andrew has vehemently denied the allegations involving Ms Giuffre, who took her own life in April last year."
    },
    {
        "title": "Tories to use ancient mechanism to force release of Mandelson vetting papers after criminal investigation launched",
        "description": "The Conservatives will today attempt to force the release of all information relating to Sir Keir Starmer's appointment of Peter Mandelson as ambassador to the United States after new revelations about his ties to Jeffrey Epstein.",
        "url": "https://news.sky.com/story/tories-to-use-ancient-mechanism-to-try-and-force-release-of-mandelson-vetting-papers-13502888",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-peter-mandelson-house-of-lords_7152981.jpg?20260202082256",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-03 20:02:00",
        "Headline": "So-called humble addresses are binding on ministers if passed, with several Labour MPs telling Sky News they would be prepared to vote with the Opposition.",
        "Content": "The Conservatives will today attempt to force the release of all information relating to Sir Keir Starmer's appointment of Peter Mandelson as ambassador to the United States after new revelations about his ties to Jeffrey Epstein. Party leader Kemi Badenoch has demanded No 10 explain the vetting process after she claimed that concerns were \"waived away\" so the PM could make a \"political appointment of a man who is a close friend of a convicted paedophile\". It comes after the Metropolitan Police announced they had launched a criminal investigation into misconduct in public office offences after files released by US authorities appeared to show Mandelson had passed internal discussions from the heart of UK government to Epstein after the global financial crash. Mandelson was business secretary in Gordon Brown's government at the time, was later made a life peer and last year was appointed the UK's ambassador to the US. He was sacked as ambassador in September, after new emails revealed he sent messages of support to Epstein even as the disgraced financier faced jail for sex offences in 2008. His friendship with Epstein had already been known at the time of his appointment, but Number 10 argued it was not aware of its \"depth and extent\". The Conservatives will use their Opposition Day to table a humble address - an arcane mechanism that can compel the government of the day to produce certain documents. \n                  Lord Mandelson resigns after Epstein files - how did we get here?\n                 \n                  Starmer, Badenoch and McSweeney: Who are the winners and losers of the Mandelson-Epstein scandal?\n                 \n                  The end of a scandal-tainted career: Mandelson had no alternative but to resign\n                 The documents they will want to be published include due diligence work carried out by the Cabinet Office; emails between Mandelson and the PM's chief of staff Morgan McSweeney on his association with Epstein; minutes of meetings held about the appointment and details of payments made to Mandelson on his departure from the ambassador role. Humble addresses, if passed, are binding on ministers. Several Labour MPs have told Sky News they were prepared to vote with the Opposition on the humble address. Left-wing MP Richard Burgon told Sky News' chief political correspondent Jon Craig that it would be \"crazy\" if the government opposed the motion, as \"we can't have a situation where the government is dragged kicking and screaming to do the right thing\". Mrs Badenoch said Labour MPs \"need to do what they know is right\" and argued it \"is about the reputation of our parliament and our country\". She said: \"I hope MPs of all parties, and especially those in Labour, will join us in fighting for the truth, for full justice for Epstein's victims and for openness and honesty with the British people. \"If the prime minister had a backbone, he'd allow his MPs to vote with their conscience and put their country before their party.\" No 10 added an amendment to the humble address calling for all documents to be published \"except papers prejudicial to UK national security or international relations\", according to the Commons order paper. Mandelson has stepped down from the House of Lords following the latest revelations. He has previously said: \"I was wrong to believe Epstein following his conviction [in 2008 for procuring a child for prostitution and of soliciting a prostitute] and to continue my association with him afterwards. I apologise unequivocally for doing so to the women and girls who suffered.\""
    },
    {
        "title": "Two people die after light aircraft crash in Greater Manchester",
        "description": "Two people have died after a light aircraft crash in Greater Manchester.",
        "url": "https://news.sky.com/story/light-aircraft-crashes-in-greater-manchester-with-two-people-believed-to-be-on-board-13502720",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-littleborough-manchester_7154530.jpg?20260203145720",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-03 12:30:00",
        "Headline": "The crash happened in a farmland area in Littleborough, Rochdale, on Tuesday morning.",
        "Content": "Two people have died after a light aircraft crash in Greater Manchester. The crash happened in a farmland area in Littleborough, Rochdale, shortly after 11am. Greater Manchester Police said two men were found and they were pronounced dead at the scene. It is not believed there was anyone else on board and there were no reported injuries on the ground. Chief Superintendent Danny Inglis said: \"This is a devastating incident where two people have lost their lives and our thoughts are with their families and friends. \"We have been working closely with emergency service colleagues and partner agencies throughout the day to establish the full circumstances and we will be on scene overnight and into tomorrow. \"There will be an enhanced presence as officers and investigators comprehensively survey the area and ensure all available evidence is recovered. \n                  Andrew moves out of Royal Lodge - as police assess new allegation\n                 \n                  Lord Mandelson resigns after Epstein files - how did we get here?\n                 \n                  Tories to use ancient mechanism to force release of Mandelson vetting papers after criminal investigation launched\n                 \"If anyone has any information, or witnessed the crash, we would urge you to get in touch with us.\" Photos shared on social media appear to show a yellow parachute partly wrapped around the base of an electricity pylon. There are reports that the aircraft which crashed is a Cirrus SR20, a plane which is fitted with a parachute system designed to deploy in an emergency. The flight tracking website, flightradar24, posted a message on X showing an image of a Cirrus aircraft, believed to be involved in the accident. It said a plane departed Birmingham Airport at 9.59am and the last signal was received at around 10.39am \"south of the M62 motorway near Marsden\". It has not officially been confirmed whether this is the aircraft which crashed. A Birmingham Airport spokesman confirmed a private light aircraft left its XLR Executive Jet Centre at around 10am on Tuesday. Other images from the scene show a large response from the emergency services, with several fire engines, police and ambulance vehicles. The Air Accidents Investigation Branch (AAIB) issued a statement related to the crash. \"An accident involving a light aircraft which occurred today (3 February) near Rochdale, Greater Manchester has been notified to the AAIB. \"An investigation has been launched and a multidisciplinary team of inspectors are on their way to the accident site.\""
    },
    {
        "title": "The UK's new cancer strategy is bold and ambitious - it can't afford to be anything else",
        "description": "A National Cancer Plan for England \"that will revolutionise the way we treat cancer\". It is a bold and ambitious claim to make, but this strategy cannot afford to be anything else.",
        "url": "https://news.sky.com/story/the-uks-new-cancer-strategy-is-bold-and-ambitious-it-cant-afford-to-be-anything-else-13502922",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-istock-cancer-cells_7154893.jpg?20260203215210",
        "type": "Home",
        "Author": "Ashish Joshi",
        "Date Published": "2026-02-03 21:33:00",
        "Headline": "In around 10 years time, three out of four people diagnosed with cancer will be living well or cured within five years of their diagnosis.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n A National Cancer Plan for England \"that will revolutionise the way we treat cancer\". It is a bold and ambitious claim to make, but this strategy cannot afford to be anything else. Cancer destroys far too many lives. According to the charity Macmillan, someone in the UK is diagnosed with the disease at least every 75 seconds. That is a grim statistic. On Wednesday, the government will publish a new 10-year plan to tackle it, pledging that more people will survive a diagnosis in the coming years. This cancer plan says it puts \"patients at the very heart of it\". Eleven thousand people responded to the call for evidence: stories of resilience against the odds, personal battles against a healthcare system buckling under the cancer burden. The metrics are quantifiable. In around 10 years time, three out of four people diagnosed with cancer will be living well or cured from cancer within five years of their diagnosis. 👉 Listen to Sky News Daily on your podcast app 👈 According to the Department of Health, this would represent the fastest rate of improvement in cancer outcomes this century, and would translate to 320,000 more lives saved over the lifetime of the plan. \n                  Cancer care: What can the NHS learn from Denmark? \n                 \n                  Denmark has become a cancer pioneer - this is why UK is lagging behind\n                 \n                  AI-assisted mammograms result in fewer aggressive and advanced breast cancers, study suggests\n                 The document will also pledge that the NHS will meet all its cancer waiting time targets by 2029, and is set to be joined with other announcements, including a big expansion in robot-assisted surgery and faster diagnostic tests to cut down delays in cancer diagnosis and treatment. This is achievable. But it will take commitment and investment. The Danes have done it. They have had five successive national cancer plans. Our health ministers have been studying their blueprint very carefully to apply the most successful interventions into our own plan. Smaller organisations working at a local level will be empowered and financed to support their own communities. This is practical and sensible. Some £6bn has been earmarked for capital investment to invest in the latest technology, AI and robotic surgery to identify and treat cancer quickly. Cancer is indiscriminate. So children and young people will, for the first time, be given a dedicated chapter in this plan to meet their own special needs. According to the latest data from the World Health Organization, four in 10 cancer cases are preventable. It has examined 30 preventable causes, including tobacco, alcohol, high body mass index, physical inactivity, air pollution, ultraviolet radiation, and, for the first time, nine cancer-causing infections. This area will come under renewed focus after the government's success in introducing the Tobacco and Vapes Bill to ensure an entirely smoke-free generation. Read more from Ashish Joshi:Denmark is a cancer pioneer - this is why UK is behindCritical report raises pressure on NHS maternity services Community Diagnostic Centres easily accessible with a high street presence, and open for days and hours that suit ordinary people, will speed up diagnoses. And importantly, as science makes great strides in extending life, survivors must not be left alone to face the \"cancer cliff edge\", the feeling of abandonment after their cancer treatment has finished. Survivorship is as important as early diagnosis. All of this is to be welcomed and applauded, but to move to this level will need a big step change. Many hospitals still cannot share imaging or pathology results in a timely way due to old technology holding them back. And some estates are not fit for purpose, let alone to house a specialist cancer ward. I have stood under gaping ceiling holes where rain pours through into overflowing buckets, feet away from patients undergoing chemotherapy. Cancer patients have been failed for far too long."
    },
    {
        "title": "Starmer, Badenoch and McSweeney: Who are the winners and losers of the Mandelson-Epstein scandal?",
        "description": "Sir Keir Starmer and the Labour high command may be relieved that Peter Mandelson has quit the House of Lords.",
        "url": "https://news.sky.com/story/starmer-badenoch-and-mcsweeney-who-are-the-winners-and-losers-of-the-mandelson-epstein-scandal-13502982",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-epstein-peter-mandelson_7154992.jpg?20260203231928",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2026-02-03 23:28:00",
        "Headline": "For Sir Keir Starmer and the soon-to-be ex-peer, the fallout may be about to get even worse, as Mr Mandelson faces a full-blown police inquiry while the prime minister's torment is set to resume on Wednesday.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Sir Keir Starmer and the Labour high command may be relieved that Peter Mandelson has quit the House of Lords. But for both the prime minister and the soon-to-be ex-peer, their humiliation and torment may be about to get even worse. Mr Mandelson faces a full-blown probe by the Met's specialist crime team into allegations of misconduct in public office, for which the maximum penalty is life imprisonment. Jeffrey Epstein scandal - latest Yes, really! It's that serious. In an interview with The Times carried out last week but published on Monday, Mandelson referred to a \"handful of misguided historical emails, which I deeply regret sending\". On other claims, Lord Mandelson questioned the authenticity of the documents, citing false claims he had a US social security number, questionable US-dollar cheque payments into UK banks, incorrect beneficiary details, and multiple basic errors in dates, spelling and formatting. The police investigation, no doubt extremely complex, could last several months, and if he's prosecuted, Mr Mandelson's agony could last years, even if he's acquitted. The torment for the prime minister is more immediate. He faces a potentially painful onslaught from Kemi Badenoch at Wednesday's Prime Minister's Questions, followed by a bruising Commons debate. The PM must be cursing the parliamentary calendar, because Wednesday is an opposition day in the Commons, which means the Conservatives choose the business. And this time the Tories are using a tactic used by Labour in opposition. In the parliamentary jargon, it's called a humble address, which means the Tory motion demands publication of all the papers relating to Sir Keir's appointment of Mr Mandelson as ambassador to the US. Yes, all of them! In theory, at least. A paper trail, in other words. It's a device Labour employed with some success during the endless Commons debates on Brexit a few years back when Sir Keir was opposition leader. This time, though, the prime minister could face a major rebellion from Labour backbenchers if he whips his MPs to vote against the Tory motion. But will he? \"I'll vote for a paper trail to be released,\" left-wing serial rebel Richard Burgon told Sky News. \"But there shouldn't be a vote. They shouldn't be opposing the motion. \"It would be crazy to do so. We can't have a situation where the government is dragged kicking and screaming to do the right thing.\" The government is not falling into the Tory trap, however. It will commit to publishing documents about the Mandelson appointment. But ministers have tabled an amendment to the Conservative motion proposing an exemption for papers affecting national security. The PM's amendment adds: \"Except papers prejudicial to UK national security of international relations.\" Which could, of course, mean there are a large number of exemptions. Too many, the Conservatives may claim. Kemi Badenoch claims the normal procedures were \"waived away\" so the prime minister could appoint Mr Mandelson as ambassador, despite his close relationship with a convicted paedophile. \"Let's see all the correspondence, emails, mobile phone records,\" she said. \"We want to see everything.\" The Tories also plan to turn up the heat on the PM's controversial chief of staff, Morgan McSweeney, a man who's already the pantomime villain of Labour's woes and blunders. \"Morgan McSweeney, a close protégé of Peter Mandelson, was involved in the vetting,\" said the Tory leader. \"Morgan McSweeney is a man whose fingerprints are all over this embarrassment.\" Read more on Sky News:Mandelson quits Labour Party over Epstein linksMandelson 'has no recollection' of $75,000Scandal-tainted career is over For the PM, the Mandelson nightmare couldn't have come at a worse time. His poll ratings are through the floor, he faces a horrible by-election on 26 February and horrendous local and national elections in May. The mavericks and malcontents on the Labour benches claim the only question about Sir Keir's survival is when his mutineers move to oust him: after the by-election or after the May elections. McSweeney, therefore, could be a convenient scapegoat, sacrificed to save an embattled prime minister. A No 10 svengali dumped just like Alastair Campbell, Andy Coulson and Dominic Cummings were before him. The only winners from the Mandelson fiasco are Westminster's opposition parties. Not just the Conservatives, either. The Liberal Democrats and Scottish National party led demands for the police investigation. Despite the PM's tough talk and his claim that Mandelson \"let his country down\", a damning verdict of his bad judgement in him could mean he ends up being as big a loser as the Prince of Darkness himself."
    },
    {
        "title": "Jill Biden's ex-husband William Stevenson charged with murder after death of wife",
        "description": "The ex-husband of former first lady Jill Biden has been charged with first-degree murder after the death of his wife.",
        "url": "https://news.sky.com/story/william-stevenson-jill-bidens-ex-husband-charged-with-murder-after-death-of-wife-in-delaware-13502851",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-william-stevenson-jill-biden_7154724.jpg?20260203180132",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-03 17:27:00",
        "Headline": "William Stevenson, 77, was indicted on first-degree murder by a grand jury on Monday, in connection with 64-year-old Linda Stevenson's death last year. ",
        "Content": "The ex-husband of former first lady Jill Biden has been charged with first-degree murder after the death of his wife. William Stevenson, 77, was indicted on Monday by a grand jury in New Castle County, Delaware, in connection with the death of 64-year-old Linda Stevenson last year. Mrs Biden married Stevenson in February 1970, when she was 18 years old and a student at the University of Delaware, and he was 23. They were only married for five years. In March of 1975, she met then Democratic senator for Delaware Joe Biden, and a civil divorce between her and Stevenson was granted in May of that year. New Castle County Police said Stevenson was taken into custody at the home in Oak Hill without incident on Monday afternoon. He has since been arraigned and sent to the Howard Young Correction Institution in Wilmington, where he has been unable to pay a $500,000 (£365,207) cash bail. According to authorities, at around 11.16pm on 28 December, officers responded to a reported domestic dispute at a residence in Oak Hill, just west of Wilmington in New Castle County. \n                  Tesla shareholders approve Elon Musk's huge pay package\n                 \n                  Elon Musk cannot keep $55bn Tesla pay package, judge rules\n                 \n                  Joe Biden marks 49 years since car crash that killed his first wife and infant daughter\n                 Upon entering the home, emergency services found Mrs Stevenson unresponsive in the living room. She was later pronounced dead at the scene. Read more from Sky News:Coastal road swept away into seaTeen boy's four-hour swim to save family Delaware state police say Mrs Stevenson's body has been turned over to the Delaware Division of Forensic Science, where a post mortem examination will be conducted to determine the cause and manner of her death. The office of Jill and ex-president Joe Biden declined to comment to Sky's US partner network NBC News."
    },
    {
        "title": "Albanian burglars chased by ex-Aston Villa and Brentford player jailed for break-in spree",
        "description": "Two Albanian burglars have been jailed for 56 months each after targeting seven properties, including the home of a footballer.",
        "url": "https://news.sky.com/story/albanian-burglars-chased-by-ex-aston-villa-and-brentford-player-jailed-for-break-in-spree-13502892",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-burglars-cheshire-erisjan-laska-denis-puka_7154824.jpg?20260203205357",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-03 20:04:00",
        "Headline": "Denis Puka, 28, and Erisjan Laska, 29, have been sentenced for 56 months each after targeting seven properties with a third unidentified male during a stay in a Warrington Airbnb.",
        "Content": "Two Albanian burglars have been jailed for 56 months each after targeting seven properties, including the home of a footballer. Denis Puka, 28, Erisjan Laska, 29, and a third unidentified man equipped themselves with masks, tools and walkie-talkies to go on a string of break-ins last year. Their operation had been \"sophisticated and well-planned\", Judge Steven Everett said. The trio booked an Airbnb room in Warrington to use as a base for their offending. From there, they travelled into Cheshire in a Seat Leon car fitted with three false registration plates. Among the properties they targeted between 5-7 June was that of Scott Hogan, 33, a former Aston Villa, Brentford and Birmingham City footballer who now plays for MK Dons. On 7 June, he was woken up by torchlight shining though his bedroom window at around 11.30pm. During the attempted burglary, Mr Hogan's then-pregnant wife and his young daughter were in the house Prosecutor Nardeen Nemat said: \"The defendants climbed over the fence and into the garden. One defendant climbed onto the shoulder of another, and climbed up the trellising on the house to reach the bedroom window. \"Mr Hogan was in his bedroom when he was woken up by a torch light shining through his bedroom window. He looked out and saw three males on the ground.\" She added that Mr Hogan ran after the males, but the males ran away.\" 'Sleepless nights full of stress and anxiety' He told the court that the incident had \"led to many sleepless nights full of stress and anxiety\". He said: \"I can't put into words completely what a dramatic effect this has had on me and my family.\" While nothing was stolen, Mr Hogan has since installed a new security system to protect his family. Prior to the attempted raid on Mr Horgan's house, two addresses were targeted on 5 June. The defendants gained access to one of the properties, and ransacked every room except the bedroom, where their victims were sleeping, although nothing was stolen on either occasion. Read more:Masked thieves steal statue of local hero boxerSnapchat predator coerced boys to perform sex acts The following night they again came away empty handed after being disturbed while targeting houses in Grappenhall and Knutsford, but were later successful at a mansion in Northwich as the owners were away in holiday. The defendants stole Breitling and Rolex watches - worth £9,000 in total. They were arrested after the Seat Leon was recovered from a housing estate in Warrington more than a week later with various items found inside including mobile phones, clothing worn by the defendants, tools and the false registration plates. Sentencing the pair on Tuesday, Judge Everett told them: \"What is clear is that this was a sophisticated, well-planned conspiracy. \"Each of you should understand the sheer devastation you caused by your selfish and despicable acts.\""
    },
    {
        "title": "US aircraft carrier scrambles fighter jet to down 'aggressive' Iranian drone as tensions rise ahead of talks",
        "description": "A US fighter jet has shot down an Iranian drone that was flying \"aggressively\" towards an aircraft carrier, the US military has said.",
        "url": "https://news.sky.com/story/us-aircraft-carrier-scrambles-fighter-jet-to-down-aggressive-iranian-drone-as-tensions-rise-ahead-of-talks-13502879",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-uss-abraham-lincoln_7154772.jpg?20260203191919",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-03 19:08:00",
        "Headline": "It approached the USS Abraham Lincoln in the Arabian Sea with \"unclear intent\" before it was intercepted by one of the vessel's aircraft, the US military said.",
        "Content": "A US fighter jet has shot down an Iranian drone that was flying \"aggressively\" towards an aircraft carrier, the US military has said. The incident in the Arabian Sea comes as Washington prepares for talks with Tehran later this week. The Shahed-139 drone had approached the USS Abraham Lincoln with \"unclear intent\" before it was downed by an F-35C fighter launched from the vessel, US military spokesperson Captain Tim Hawkins said in a statement on Tuesday. Capt Hawkins said the aircraft \"continued to fly towards the ship, part of a \"large armada\" deployed in the region, despite de-escalatory measures taken by US forces operating in international waters\". No US personnel were harmed, and no equipment was damaged, in the incident, about 500 miles (800km) from Iran's southern coast, he said. Reports in Iran appeared to dispute the US version of events, as ​media sources, including ​the semi-official Fars ‍news agency, said an ‌Iranian drone completed ​a \"surveillance mission ⁠in international waters\". Hours later, Iranian forces, including a drone, harassed a US-flagged and crewed merchant vessel that was sailing in the Strait of Hormuz. \n                  Donald Trump seeks $1bn in damages from Harvard University\n                 \n                  The Epstein Files - where's Donald Trump?\n                 \n                  ICE agents in Minneapolis to be issued with body-worn cameras after fatal shootings\n                 Two boats carrying Iran's Islamic Revolutionary Guard Corps forces, and a Mohajer drone, approached the Stena Imperative \"at high speeds, and threatened to board and seize the tanker\", Mr Hawkins said. The destroyer USS McFaul responded, escorting the Stena Imperative \"with defensive air support from the US Air Force\", the statement said, adding that the merchant vessel was now sailing safely. White House ​Press ​Secretary Karoline ‍Leavitt, who confirmed the US had shot down the drone on Fox News, said talks with Tehran scheduled for later this week in Turkey, will still go ahead. Tensions are high between the long-time enemies as US President Donald Trump tries to get Iran to make a deal over its nuclear programme. On Monday, he told reporters that his administration had \"talks going on with Iran. We'll see how it all works out\". He wouldn't say what, if any, threshold he had for military action against the country, which Iran's supreme leader, Ayatollah Ali Khamenei has said would lead to a regional war. The drone shooting came hours after Masoud Pezeshkian, Iran's president, said that he told the country's foreign minister to \"pursue fair and equitable negotiations\" with the US, one of the first clear signs from Tehran that it wants to try to negotiate with Washington. Read more:Doctors' disturbing accounts of crackdownIran heads for make or break this week Iran's government spent weeks putting down protests that began in late December against growing economic instability before broadening into a challenge to the Islamic Republic. Anywhere between 33,000 and 50,000 people died in the violence, according to estimates from human rights organisations and doctors. Tehran has admitted that 3,117 people have been killed, the majority of them being security forces and civilians, rather than protesters. Mr Trump promised in early January to \"rescue\" Iranians from their government's bloody crackdown."
    },
    {
        "title": "Andrew moves out of Royal Lodge - as police assess new allegation",
        "description": "Andrew Mountbatten-Windsor has moved out of Royal Lodge, palace sources have said - as police assess claims that a woman was sent to the former duke by Jeffrey Epstein in 2010.",
        "url": "https://news.sky.com/story/andrew-moves-out-of-royal-lodge-as-police-assess-new-allegation-epstein-sent-woman-to-former-duke-in-2010-13502991",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-andrew-mountbatten_7151313.jpg?20260203233217",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-03 22:37:00",
        "Headline": "Thames Valley Police said it is assessing a claim that a woman was sent by Jeffrey Epstein to Andrew at Royal Lodge in 2010. The former duke has not responded to the newest claim, but has previously denied all wrongdoing related to Epstein.",
        "Content": "Andrew Mountbatten-Windsor has moved out of Royal Lodge, palace sources have said - as police assess claims that a woman was sent to the former duke by Jeffrey Epstein in 2010. Andrew's move is part of a permanent move to Norfolk, which may take some time, according to Sky's royal correspondent Rhiannon Mills. He is now living in a house on Sandringham Estate in Norfolk, which is seen as temporary accommodation. There will be a further move in the coming months once final arrangements have been made. The palace had announced last October that the King had started the process of removing the style, title and honours of the former prince after the Epstein-linked allegations against him had started to \"distract\" from the Royal Family's work. Andrew had lived at Royal Lodge, a 30-room mansion on the Windsor Estate, for more than 20 years. It emerged he had been paying a \"peppercorn rent\" - a legal term used to show that rent technically exists, so the lease is valid, but it's nominal - often £1 a year or even nothing at all. \n                  Prince Edward forced to address Epstein scandal due to his brother\n                 \n                  The Epstein Files - where's Donald Trump?\n                 \n                  New Andrew allegation must be investigated, says former Metropolitan Police chief\n                 It comes as police assess a claim that a woman was sent by Epstein to Andrew at Royal Lodge in 2010. The encounter allegedly took place when the woman was in her 20s, her lawyer told the BBC earlier this week. A Thames Valley Police spokesperson said: \"We are aware of reports about a woman said to have been taken to an address in Windsor in 2010 for sexual purposes. \"We are assessing the information in line with our established procedures. We take any reports of sexual crimes extremely seriously and encourage anyone with information to come forward. \"At this time, these allegations have not been reported to Thames Valley Police by either the lawyer or their client.\" Andrew has not commented on the latest claims but has previously denied any wrongdoing related to Epstein. Read more:Epstein survivors condemn US government's handling of filesEpstein files: The key findings so far Last year Andrew and his ex-wife Sarah Ferguson agreed they would leave the property in exchange for two separate residences. Andrew previously faced accusations of sexual misconduct from Virginia Giuffre. He made a financial payment to her in an out-of-court settlement in 2022 after Ms Giuffre had launched a civil case against him. Andrew has vehemently denied the allegations involving Ms Giuffre, who took her own life in April last year."
    },
    {
        "title": "Tories to use ancient mechanism to force release of Mandelson vetting papers after criminal investigation launched",
        "description": "The Conservatives will today attempt to force the release of all information relating to Sir Keir Starmer's appointment of Peter Mandelson as ambassador to the United States after new revelations about his ties to Jeffrey Epstein.",
        "url": "https://news.sky.com/story/tories-to-use-ancient-mechanism-to-try-and-force-release-of-mandelson-vetting-papers-13502888",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-peter-mandelson-house-of-lords_7152981.jpg?20260202082256",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-03 20:02:00",
        "Headline": "So-called humble addresses are binding on ministers if passed, with several Labour MPs telling Sky News they would be prepared to vote with the Opposition.",
        "Content": "The Conservatives will today attempt to force the release of all information relating to Sir Keir Starmer's appointment of Peter Mandelson as ambassador to the United States after new revelations about his ties to Jeffrey Epstein. Party leader Kemi Badenoch has demanded No 10 explain the vetting process after she claimed that concerns were \"waived away\" so the PM could make a \"political appointment of a man who is a close friend of a convicted paedophile\". It comes after the Metropolitan Police announced they had launched a criminal investigation into misconduct in public office offences after files released by US authorities appeared to show Mandelson had passed internal discussions from the heart of UK government to Epstein after the global financial crash. Mandelson was business secretary in Gordon Brown's government at the time, was later made a life peer and last year was appointed the UK's ambassador to the US. He was sacked as ambassador in September, after new emails revealed he sent messages of support to Epstein even as the disgraced financier faced jail for sex offences in 2008. His friendship with Epstein had already been known at the time of his appointment, but Number 10 argued it was not aware of its \"depth and extent\". The Conservatives will use their Opposition Day to table a humble address - an arcane mechanism that can compel the government of the day to produce certain documents. \n                  Lord Mandelson resigns after Epstein files - how did we get here?\n                 \n                  Starmer, Badenoch and McSweeney: Who are the winners and losers of the Mandelson-Epstein scandal?\n                 \n                  The end of a scandal-tainted career: Mandelson had no alternative but to resign\n                 The documents they will want to be published include due diligence work carried out by the Cabinet Office; emails between Mandelson and the PM's chief of staff Morgan McSweeney on his association with Epstein; minutes of meetings held about the appointment and details of payments made to Mandelson on his departure from the ambassador role. Humble addresses, if passed, are binding on ministers. Several Labour MPs have told Sky News they were prepared to vote with the Opposition on the humble address. Left-wing MP Richard Burgon told Sky News' chief political correspondent Jon Craig that it would be \"crazy\" if the government opposed the motion, as \"we can't have a situation where the government is dragged kicking and screaming to do the right thing\". Mrs Badenoch said Labour MPs \"need to do what they know is right\" and argued it \"is about the reputation of our parliament and our country\". She said: \"I hope MPs of all parties, and especially those in Labour, will join us in fighting for the truth, for full justice for Epstein's victims and for openness and honesty with the British people. \"If the prime minister had a backbone, he'd allow his MPs to vote with their conscience and put their country before their party.\" No 10 added an amendment to the humble address calling for all documents to be published \"except papers prejudicial to UK national security or international relations\", according to the Commons order paper. Mandelson has stepped down from the House of Lords following the latest revelations. He has previously said: \"I was wrong to believe Epstein following his conviction [in 2008 for procuring a child for prostitution and of soliciting a prostitute] and to continue my association with him afterwards. I apologise unequivocally for doing so to the women and girls who suffered.\""
    },
    {
        "title": "Starmer, Badenoch and McSweeney: Who are the winners and losers of the Mandelson-Epstein scandal?",
        "description": "Sir Keir Starmer and the Labour high command may be relieved that Peter Mandelson has quit the House of Lords.",
        "url": "https://news.sky.com/story/starmer-badenoch-and-mcsweeney-who-are-the-winners-and-losers-of-the-mandelson-epstein-scandal-13502982",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-epstein-peter-mandelson_7154992.jpg?20260203231928",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2026-02-03 23:28:00",
        "Headline": "For Sir Keir Starmer and the soon-to-be ex-peer, the fallout may be about to get even worse, as Mr Mandelson faces a full-blown police inquiry while the prime minister's torment is set to resume on Wednesday.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Sir Keir Starmer and the Labour high command may be relieved that Peter Mandelson has quit the House of Lords. But for both the prime minister and the soon-to-be ex-peer, their humiliation and torment may be about to get even worse. Mr Mandelson faces a full-blown probe by the Met's specialist crime team into allegations of misconduct in public office, for which the maximum penalty is life imprisonment. Jeffrey Epstein scandal - latest Yes, really! It's that serious. In an interview with The Times carried out last week but published on Monday, Mandelson referred to a \"handful of misguided historical emails, which I deeply regret sending\". On other claims, Lord Mandelson questioned the authenticity of the documents, citing false claims he had a US social security number, questionable US-dollar cheque payments into UK banks, incorrect beneficiary details, and multiple basic errors in dates, spelling and formatting. The police investigation, no doubt extremely complex, could last several months, and if he's prosecuted, Mr Mandelson's agony could last years, even if he's acquitted. The torment for the prime minister is more immediate. He faces a potentially painful onslaught from Kemi Badenoch at Wednesday's Prime Minister's Questions, followed by a bruising Commons debate. The PM must be cursing the parliamentary calendar, because Wednesday is an opposition day in the Commons, which means the Conservatives choose the business. And this time the Tories are using a tactic used by Labour in opposition. In the parliamentary jargon, it's called a humble address, which means the Tory motion demands publication of all the papers relating to Sir Keir's appointment of Mr Mandelson as ambassador to the US. Yes, all of them! In theory, at least. A paper trail, in other words. It's a device Labour employed with some success during the endless Commons debates on Brexit a few years back when Sir Keir was opposition leader. This time, though, the prime minister could face a major rebellion from Labour backbenchers if he whips his MPs to vote against the Tory motion. But will he? \"I'll vote for a paper trail to be released,\" left-wing serial rebel Richard Burgon told Sky News. \"But there shouldn't be a vote. They shouldn't be opposing the motion. \"It would be crazy to do so. We can't have a situation where the government is dragged kicking and screaming to do the right thing.\" The government is not falling into the Tory trap, however. It will commit to publishing documents about the Mandelson appointment. But ministers have tabled an amendment to the Conservative motion proposing an exemption for papers affecting national security. The PM's amendment adds: \"Except papers prejudicial to UK national security of international relations.\" Which could, of course, mean there are a large number of exemptions. Too many, the Conservatives may claim. Kemi Badenoch claims the normal procedures were \"waived away\" so the prime minister could appoint Mr Mandelson as ambassador, despite his close relationship with a convicted paedophile. \"Let's see all the correspondence, emails, mobile phone records,\" she said. \"We want to see everything.\" The Tories also plan to turn up the heat on the PM's controversial chief of staff, Morgan McSweeney, a man who's already the pantomime villain of Labour's woes and blunders. \"Morgan McSweeney, a close protégé of Peter Mandelson, was involved in the vetting,\" said the Tory leader. \"Morgan McSweeney is a man whose fingerprints are all over this embarrassment.\" Read more on Sky News:Mandelson quits Labour Party over Epstein linksMandelson 'has no recollection' of $75,000Scandal-tainted career is over For the PM, the Mandelson nightmare couldn't have come at a worse time. His poll ratings are through the floor, he faces a horrible by-election on 26 February and horrendous local and national elections in May. The mavericks and malcontents on the Labour benches claim the only question about Sir Keir's survival is when his mutineers move to oust him: after the by-election or after the May elections. McSweeney, therefore, could be a convenient scapegoat, sacrificed to save an embattled prime minister. A No 10 svengali dumped just like Alastair Campbell, Andy Coulson and Dominic Cummings were before him. The only winners from the Mandelson fiasco are Westminster's opposition parties. Not just the Conservatives, either. The Liberal Democrats and Scottish National party led demands for the police investigation. Despite the PM's tough talk and his claim that Mandelson \"let his country down\", a damning verdict of his bad judgement in him could mean he ends up being as big a loser as the Prince of Darkness himself."
    },
    {
        "title": "The UK's new cancer strategy is bold and ambitious - it can't afford to be anything else",
        "description": "A National Cancer Plan for England \"that will revolutionise the way we treat cancer\". It is a bold and ambitious claim to make, but this strategy cannot afford to be anything else.",
        "url": "https://news.sky.com/story/the-uks-new-cancer-strategy-is-bold-and-ambitious-it-cant-afford-to-be-anything-else-13502922",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-istock-cancer-cells_7154893.jpg?20260203215210",
        "type": "UK",
        "Author": "Ashish Joshi",
        "Date Published": "2026-02-03 21:33:00",
        "Headline": "In around 10 years time, three out of four people diagnosed with cancer will be living well or cured within five years of their diagnosis.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n A National Cancer Plan for England \"that will revolutionise the way we treat cancer\". It is a bold and ambitious claim to make, but this strategy cannot afford to be anything else. Cancer destroys far too many lives. According to the charity Macmillan, someone in the UK is diagnosed with the disease at least every 75 seconds. That is a grim statistic. On Wednesday, the government will publish a new 10-year plan to tackle it, pledging that more people will survive a diagnosis in the coming years. This cancer plan says it puts \"patients at the very heart of it\". Eleven thousand people responded to the call for evidence: stories of resilience against the odds, personal battles against a healthcare system buckling under the cancer burden. The metrics are quantifiable. In around 10 years time, three out of four people diagnosed with cancer will be living well or cured from cancer within five years of their diagnosis. 👉 Listen to Sky News Daily on your podcast app 👈 According to the Department of Health, this would represent the fastest rate of improvement in cancer outcomes this century, and would translate to 320,000 more lives saved over the lifetime of the plan. \n                  Cancer care: What can the NHS learn from Denmark? \n                 \n                  Denmark has become a cancer pioneer - this is why UK is lagging behind\n                 \n                  AI-assisted mammograms result in fewer aggressive and advanced breast cancers, study suggests\n                 The document will also pledge that the NHS will meet all its cancer waiting time targets by 2029, and is set to be joined with other announcements, including a big expansion in robot-assisted surgery and faster diagnostic tests to cut down delays in cancer diagnosis and treatment. This is achievable. But it will take commitment and investment. The Danes have done it. They have had five successive national cancer plans. Our health ministers have been studying their blueprint very carefully to apply the most successful interventions into our own plan. Smaller organisations working at a local level will be empowered and financed to support their own communities. This is practical and sensible. Some £6bn has been earmarked for capital investment to invest in the latest technology, AI and robotic surgery to identify and treat cancer quickly. Cancer is indiscriminate. So children and young people will, for the first time, be given a dedicated chapter in this plan to meet their own special needs. According to the latest data from the World Health Organization, four in 10 cancer cases are preventable. It has examined 30 preventable causes, including tobacco, alcohol, high body mass index, physical inactivity, air pollution, ultraviolet radiation, and, for the first time, nine cancer-causing infections. This area will come under renewed focus after the government's success in introducing the Tobacco and Vapes Bill to ensure an entirely smoke-free generation. Read more from Ashish Joshi:Denmark is a cancer pioneer - this is why UK is behindCritical report raises pressure on NHS maternity services Community Diagnostic Centres easily accessible with a high street presence, and open for days and hours that suit ordinary people, will speed up diagnoses. And importantly, as science makes great strides in extending life, survivors must not be left alone to face the \"cancer cliff edge\", the feeling of abandonment after their cancer treatment has finished. Survivorship is as important as early diagnosis. All of this is to be welcomed and applauded, but to move to this level will need a big step change. Many hospitals still cannot share imaging or pathology results in a timely way due to old technology holding them back. And some estates are not fit for purpose, let alone to house a specialist cancer ward. I have stood under gaping ceiling holes where rain pours through into overflowing buckets, feet away from patients undergoing chemotherapy. Cancer patients have been failed for far too long."
    },
    {
        "title": "Albanian burglars chased by ex-Aston Villa and Brentford player jailed for break-in spree",
        "description": "Two Albanian burglars have been jailed for 56 months each after targeting seven properties, including the home of a footballer.",
        "url": "https://news.sky.com/story/albanian-burglars-chased-by-ex-aston-villa-and-brentford-player-jailed-for-break-in-spree-13502892",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-burglars-cheshire-erisjan-laska-denis-puka_7154824.jpg?20260203205357",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-03 20:04:00",
        "Headline": "Denis Puka, 28, and Erisjan Laska, 29, have been sentenced for 56 months each after targeting seven properties with a third unidentified male during a stay in a Warrington Airbnb.",
        "Content": "Two Albanian burglars have been jailed for 56 months each after targeting seven properties, including the home of a footballer. Denis Puka, 28, Erisjan Laska, 29, and a third unidentified man equipped themselves with masks, tools and walkie-talkies to go on a string of break-ins last year. Their operation had been \"sophisticated and well-planned\", Judge Steven Everett said. The trio booked an Airbnb room in Warrington to use as a base for their offending. From there, they travelled into Cheshire in a Seat Leon car fitted with three false registration plates. Among the properties they targeted between 5-7 June was that of Scott Hogan, 33, a former Aston Villa, Brentford and Birmingham City footballer who now plays for MK Dons. On 7 June, he was woken up by torchlight shining though his bedroom window at around 11.30pm. During the attempted burglary, Mr Hogan's then-pregnant wife and his young daughter were in the house Prosecutor Nardeen Nemat said: \"The defendants climbed over the fence and into the garden. One defendant climbed onto the shoulder of another, and climbed up the trellising on the house to reach the bedroom window. \"Mr Hogan was in his bedroom when he was woken up by a torch light shining through his bedroom window. He looked out and saw three males on the ground.\" She added that Mr Hogan ran after the males, but the males ran away.\" 'Sleepless nights full of stress and anxiety' He told the court that the incident had \"led to many sleepless nights full of stress and anxiety\". He said: \"I can't put into words completely what a dramatic effect this has had on me and my family.\" While nothing was stolen, Mr Hogan has since installed a new security system to protect his family. Prior to the attempted raid on Mr Horgan's house, two addresses were targeted on 5 June. The defendants gained access to one of the properties, and ransacked every room except the bedroom, where their victims were sleeping, although nothing was stolen on either occasion. Read more:Masked thieves steal statue of local hero boxerSnapchat predator coerced boys to perform sex acts The following night they again came away empty handed after being disturbed while targeting houses in Grappenhall and Knutsford, but were later successful at a mansion in Northwich as the owners were away in holiday. The defendants stole Breitling and Rolex watches - worth £9,000 in total. They were arrested after the Seat Leon was recovered from a housing estate in Warrington more than a week later with various items found inside including mobile phones, clothing worn by the defendants, tools and the false registration plates. Sentencing the pair on Tuesday, Judge Everett told them: \"What is clear is that this was a sophisticated, well-planned conspiracy. \"Each of you should understand the sheer devastation you caused by your selfish and despicable acts.\""
    },
    {
        "title": "Two people die after light aircraft crash in Greater Manchester",
        "description": "Two people have died after a light aircraft crash in Greater Manchester.",
        "url": "https://news.sky.com/story/light-aircraft-crashes-in-greater-manchester-with-two-people-believed-to-be-on-board-13502720",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-littleborough-manchester_7154530.jpg?20260203145720",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-03 12:30:00",
        "Headline": "The crash happened in a farmland area in Littleborough, Rochdale, on Tuesday morning.",
        "Content": "Two people have died after a light aircraft crash in Greater Manchester. The crash happened in a farmland area in Littleborough, Rochdale, shortly after 11am. Greater Manchester Police said two men were found and they were pronounced dead at the scene. It is not believed there was anyone else on board and there were no reported injuries on the ground. Chief Superintendent Danny Inglis said: \"This is a devastating incident where two people have lost their lives and our thoughts are with their families and friends. \"We have been working closely with emergency service colleagues and partner agencies throughout the day to establish the full circumstances and we will be on scene overnight and into tomorrow. \"There will be an enhanced presence as officers and investigators comprehensively survey the area and ensure all available evidence is recovered. \n                  Andrew moves out of Royal Lodge - as police assess new allegation\n                 \n                  Lord Mandelson resigns after Epstein files - how did we get here?\n                 \n                  Tories to use ancient mechanism to force release of Mandelson vetting papers after criminal investigation launched\n                 \"If anyone has any information, or witnessed the crash, we would urge you to get in touch with us.\" Photos shared on social media appear to show a yellow parachute partly wrapped around the base of an electricity pylon. There are reports that the aircraft which crashed is a Cirrus SR20, a plane which is fitted with a parachute system designed to deploy in an emergency. The flight tracking website, flightradar24, posted a message on X showing an image of a Cirrus aircraft, believed to be involved in the accident. It said a plane departed Birmingham Airport at 9.59am and the last signal was received at around 10.39am \"south of the M62 motorway near Marsden\". It has not officially been confirmed whether this is the aircraft which crashed. A Birmingham Airport spokesman confirmed a private light aircraft left its XLR Executive Jet Centre at around 10am on Tuesday. Other images from the scene show a large response from the emergency services, with several fire engines, police and ambulance vehicles. The Air Accidents Investigation Branch (AAIB) issued a statement related to the crash. \"An accident involving a light aircraft which occurred today (3 February) near Rochdale, Greater Manchester has been notified to the AAIB. \"An investigation has been launched and a multidisciplinary team of inspectors are on their way to the accident site.\""
    },
    {
        "title": "Coastal road swept away into the sea in Devon",
        "description": "A coastal road that was hit by three named storms has been destroyed after another downpour.",
        "url": "https://news.sky.com/story/coastal-road-hit-by-three-named-storms-swept-away-into-the-sea-in-a-matter-of-hours-13502820",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-caroline-voaden-a379_7154658.jpg?20260203165005",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-03 16:27:00",
        "Headline": "South West England was badly hit by storms Goretti, Ingrid and Chandra, which brought heavy rain and flooding last month. The A379 in Devon has been destroyed.",
        "Content": "A coastal road that was hit by three named storms has been destroyed after another downpour. Part of the A379 in Devon, connecting the villages of Torcross and Slapton, near Dartmouth, broke apart overnight, with its sea defences destroyed in January's three named storms - Goretti, Ingrid and Chandra. The storms all brought heavy rain to many areas of the UK, particularly the South West, leading to flooding and widespread travel disruption. Read more: Rain alerts for southwest in already flood-hit areas Images from the scene show that sections of the road, and a public car park, have disappeared into the sea. Devon County Council has warned that the damage to the A379 could cost \"tens of millions of pounds\" to repair, while Liberal Democrat MP Caroline Voaden said: \"This is the news we've all been dreading.\" Ms Voaden, the MP for South Devon, who was at Westminster to urge the government to provide more funding for roads on Tuesday, said earlier: \"One of my team is on the ground now, and said the force of the waves is shaking the road. It's terrifying.\" She also said: \"Protection measures are needed, but government support is simply not there. \"Billions have been dedicated to Northern Powerhouse Rail, while our coastal communities are left defenceless to our changing climate.\" Read more from Sky News:Teenage boy's four-hour swim to save family swept out to seaSon of Norway's crown princess denies rape as trial begins Devon County Council leader Julian Brazil, also at Westminster, said in a statement: \"It's devastating for the local community, and our priority is the families whose lives and livelihoods are directly affected by this. \"The route is not looking good, and we're likely to be looking at tens of millions of pounds to repair it. The county can't afford to rebuild the road, and we're desperately looking for help from government.\" The road was previously washed away during Storm Emma in March 2018 - also called the Beast from the East - and reopened later that year after extensive repairs."
    },
    {
        "title": "'I still would like to meet Putin': Epstein's unrequited love for Russian leader",
        "description": "What has Vladimir Putin got to do with Jeffrey Epstein?",
        "url": "https://news.sky.com/story/i-still-would-like-to-meet-putin-epsteins-unrequited-love-for-russian-leader-13502862",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-putin-epstein_7154740.jpg?20260203183022",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2026-02-03 19:10:00",
        "Headline": "From 2013 onwards, the emails show Epstein made several bids to meet Putin through the former Norwegian PM Thorbjorn Jagland.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n What has Vladimir Putin got to do with Jeffrey Epstein? The Russian president's name appears more than 1,000 times in the latest files. His inclusion does not imply any wrongdoing, and there's no evidence the two ever met, but boy, it sounds like Epstein wanted to. The emails appear to reveal repeated attempts by the convicted sex offender to court the Kremlin leader. And there's even an audio file in which Epstein can be heard coaching someone on how to approach Putin. Follow live - Epstein files latest \"I would send a note to Putin, saying 'I'm going to leave government on March 14th. I'm going to be in Scandinavia, or I plan to be in western, northern Europe. We should have dinner'. That's it, no more. It has to be very short,\" he says in the recording. \n                  Starmer, Badenoch and McSweeney: Who are the winners and losers of the Mandelson-Epstein scandal?\n                 \n                  Prince Edward forced to address Epstein scandal due to his brother\n                 \n                  The Epstein Files - where's Donald Trump?\n                 The first substantive mention of Vladimir Putin in the latest files, unearthed by Sky's Data and Forensics team, is from September 2011. An unnamed contact refers to a meeting Epstein said he had arranged with Putin later that month, while Putin was Russia's prime minister. There's no evidence it took place, and there are no other details. From 2013 onwards, by which time Putin had returned to the presidency, the emails show Epstein made several bids to meet him through the former Norwegian PM Thorbjorn Jagland. From Epstein with love In May that year, Epstein emailed Jagland, who was then serving as secretary-general of the Council of Europe, saying: \"I know you are going to meet putin [sic] on the 20th, He is desperate to engage western investment in his country...I have his solution.\" He adds: \"I recoginize [sic] that there are human rights issues that are at the forefront of your trip howver [sic], if it is helpful to you, I would be happy to meet with him sometime in june [sic] and explain the solution to his top prioirty [sic], I think this would be good for your goals.\" But it appears it never happened. After pestering Jagland to follow up within Putin's team, Epstein complains that he has heard nothing back. In January 2014, Jagland told Epstein he was going to meet Putin in Sochi. \"Why don't you come?\" he asks. We don't know what happened next. But in July that year, Epstein still sounds desperate to meet the Russian president. In an email, a contact tells him: \"I wasn't able to convince Reid to change his schedule to go meet Putin with you.\" \"Bad idea now after plane crash,\" Epstein replies - a reference to Malaysian Airlines flight MH17, which was shot down over eastern Ukraine three days prior, killing all 298 people on board. But it seems it did not put Epstein off for long. Read more:Prince Edward forced to address Epstein scandalEpstein files: Key findings so far A year later, in July 2015, he tells Jagland: \"I still would like to meet putin [sic] and talk economy, i would really appreciate your assistance.\" There are more attempts in 2016, 2017 and finally in June 2018 - just one line in an email to Jagland once again: \"Would love to meet with putin [sic].\" It's certainly no smoking gun - it appears to be more a case of unrequited love. Silence in Moscow When asked about files, the Kremlin said on Tuesday it did not receive any offers from Epstein about a meeting with Vladimir Putin. Still, it's interesting to see how the Russian media is covering this story because, well, they are not. There's very little mention of it at all, and where there is, the focus is elsewhere - on Bill Clinton, Peter Mandelson and the crown princess of Norway. So even though there's no evidence or implication that he ever actually met with Epstein, Vladimir Putin's appearance in the files is still not something Moscow wants to highlight."
    },
    {
        "title": "US aircraft carrier scrambles fighter jet to down 'aggressive' Iranian drone as tensions rise ahead of talks",
        "description": "A US fighter jet has shot down an Iranian drone that was flying \"aggressively\" towards an aircraft carrier, the US military has said.",
        "url": "https://news.sky.com/story/us-aircraft-carrier-scrambles-fighter-jet-to-down-aggressive-iranian-drone-as-tensions-rise-ahead-of-talks-13502879",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-uss-abraham-lincoln_7154772.jpg?20260203191919",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-03 19:08:00",
        "Headline": "It approached the USS Abraham Lincoln in the Arabian Sea with \"unclear intent\" before it was intercepted by one of the vessel's aircraft, the US military said.",
        "Content": "A US fighter jet has shot down an Iranian drone that was flying \"aggressively\" towards an aircraft carrier, the US military has said. The incident in the Arabian Sea comes as Washington prepares for talks with Tehran later this week. The Shahed-139 drone had approached the USS Abraham Lincoln with \"unclear intent\" before it was downed by an F-35C fighter launched from the vessel, US military spokesperson Captain Tim Hawkins said in a statement on Tuesday. Capt Hawkins said the aircraft \"continued to fly towards the ship, part of a \"large armada\" deployed in the region, despite de-escalatory measures taken by US forces operating in international waters\". No US personnel were harmed, and no equipment was damaged, in the incident, about 500 miles (800km) from Iran's southern coast, he said. Reports in Iran appeared to dispute the US version of events, as ​media sources, including ​the semi-official Fars ‍news agency, said an ‌Iranian drone completed ​a \"surveillance mission ⁠in international waters\". Hours later, Iranian forces, including a drone, harassed a US-flagged and crewed merchant vessel that was sailing in the Strait of Hormuz. \n                  Donald Trump seeks $1bn in damages from Harvard University\n                 \n                  The Epstein Files - where's Donald Trump?\n                 \n                  ICE agents in Minneapolis to be issued with body-worn cameras after fatal shootings\n                 Two boats carrying Iran's Islamic Revolutionary Guard Corps forces, and a Mohajer drone, approached the Stena Imperative \"at high speeds, and threatened to board and seize the tanker\", Mr Hawkins said. The destroyer USS McFaul responded, escorting the Stena Imperative \"with defensive air support from the US Air Force\", the statement said, adding that the merchant vessel was now sailing safely. White House ​Press ​Secretary Karoline ‍Leavitt, who confirmed the US had shot down the drone on Fox News, said talks with Tehran scheduled for later this week in Turkey, will still go ahead. Tensions are high between the long-time enemies as US President Donald Trump tries to get Iran to make a deal over its nuclear programme. On Monday, he told reporters that his administration had \"talks going on with Iran. We'll see how it all works out\". He wouldn't say what, if any, threshold he had for military action against the country, which Iran's supreme leader, Ayatollah Ali Khamenei has said would lead to a regional war. The drone shooting came hours after Masoud Pezeshkian, Iran's president, said that he told the country's foreign minister to \"pursue fair and equitable negotiations\" with the US, one of the first clear signs from Tehran that it wants to try to negotiate with Washington. Read more:Doctors' disturbing accounts of crackdownIran heads for make or break this week Iran's government spent weeks putting down protests that began in late December against growing economic instability before broadening into a challenge to the Islamic Republic. Anywhere between 33,000 and 50,000 people died in the violence, according to estimates from human rights organisations and doctors. Tehran has admitted that 3,117 people have been killed, the majority of them being security forces and civilians, rather than protesters. Mr Trump promised in early January to \"rescue\" Iranians from their government's bloody crackdown."
    },
    {
        "title": "Teenage boy swims for four hours to save family swept out to sea",
        "description": "A 13-year-old Australian boy has described battling \"massive\" waves to swim around four hours to shore and raise the alarm after his family were swept out to sea.",
        "url": "https://news.sky.com/story/australian-boy-13-swims-four-hours-to-save-family-swept-out-to-sea-13502670",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-austin-appelbee-australia_7154232.png?20260203105942",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-03 10:53:00",
        "Headline": "Austin Appelbee says he was thinking happy thoughts to get him through his gruelling swim to shore through rough seas, while the rest of his family were singing and joking to keep their spirits up while they waited for rescue.",
        "Content": "A 13-year-old Australian boy has described battling \"massive\" waves to swim around four hours to shore and raise the alarm after his family were swept out to sea. Austin Appelbee was with his mother, brother and sister on an inflatable kayak and paddleboards when they got into difficulties on Friday as strong winds picked up off the coast of Western Australia. Desperate to get help, Joanne Appelbee, 47, asked her son to swim around 4km (2.5 miles) to shore. Austin told local broadcaster ABC: \"I was very puffed out but I couldn't feel how tired I was. I don't know, I was more thinking of a lot of things that, you know, was happening in my life. \"I think at one point I was thinking of Thomas the Tank Engine, trying to get the happiest things in my head... not the bad things that'll distract me... at this time the waves are massive and I have no life jacket on. Anyway, I just keep swimming.\" Austin said he initially set off for help on an inflatable kayak that was taking on water. He abandoned the kayak and then took off his life jacket because it impeded his swimming. The family, from the state capital, Perth, found themselves stranded with only lifejackets and no means of communication. \n                  Australia swelters in record heatwave as temperatures soar to nearly 50C\n                 \n                  Djokovic apologises after ball nearly hits ball girl during history-making win at Australian Open\n                 \n                  Gunman at large in Lake Cargelligo, Australia, after three people shot dead \n                 They had to wait 10 hours before rescuers reached the group, which included Austin's brother, Beau, 12, and his eight-year-old sister, Grace. \"We kept positive, we were singing and we were joking and... we were treating it as a bit of a game until the sun started to go down and that's when it was getting very choppy. Very big waves,\" Joanne said. Scariest moment ever \"Ten hours we were out there, and I think definitely eight and half of them were the most scariest we've ever been through ever,\" she added. Austin also said his ordeal was not over when he finished his swim. \"I just keep swimming... and then finally I just made it to shore and I hit the bottom of the beach and I just collapsed and then after that I had to sprint two kilometres to go get to the phone.\" Read more from Sky News:French raid on Elon Musk's XTrump seeks $1bn from HarvardFuel leak delays NASA's mega-rocket Mum: 'Super proud' Mum Joanne said she was \"super proud\" of her son and was just grateful the family survived being stuck so far out to sea. \"To keep going for so long... he's absolutely amazing. Me and his dad are super proud. She said: \"One of the hardest decisions I ever had to make was to say to Austin, 'try and get to shore and get some help. This could get really serious really quickly'. \"We made it, we're alive and that's the most important thing, and I have all three babies. All three of them made it. That was all that mattered. It was good.\" A search helicopter found Joanne and her two children wearing life jackets and clinging to a paddleboard at 8.30pm (12.30pm UK time), police said. They had drifted 14km (9 miles) from Quindalup, where they had originally entered the water. \"The actions of the 13-year-old boy cannot be praised highly enough - his determination and courage ultimately saved the lives of his mother and siblings,\" Police Inspector James Bradley said. The teenager survived his ordeal relatively unscathed, needing only a crutch to help his sore legs bear his weight."
    },
    {
        "title": "Air India flight from Heathrow grounded after 'possible defect' with fuel control switch",
        "description": "A Boeing 787-8 Dreamliner, operated by Air India, has been grounded after reports of a \"possible defect\" with a fuel control switch on the same model of aircraft which crashed in Ahmedabad last June.",
        "url": "https://news.sky.com/story/air-india-flight-from-london-grounded-after-possible-defect-with-fuel-control-switch-13502590",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-air-india-boeing-787-8_6939901.jpg?20250612100837",
        "type": "World",
        "Author": "Neville Lazarus",
        "Date Published": "2026-02-03 07:25:00",
        "Headline": "Sky News has seen paperwork, logged by one of the pilots, highlighting a potential fault with a switch that is at the centre of an investigation into the Air India Flight 171 crash.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n A Boeing 787-8 Dreamliner, operated by Air India, has been grounded after reports of a \"possible defect\" with a fuel control switch on the same model of aircraft which crashed in Ahmedabad last June. Air India said it was getting \"the pilot's concerns checked on a priority basis\" after the incident reported on the flight - AI132 - from Heathrow to Bengaluru on Monday. It added the airline had previously examined the fuel control switches on its entire Boeing 787 fleet and \"had found no issues\". In a statement to Sky News, Boeing said: \"We are in contact with Air India and are supporting their review of this matter.\" Last June, Air India Flight 171 to Gatwick struck a building shortly after take-off in Ahmedabad, killing 260 people. Briton Viswashkumar Ramesh was the only passenger who walked away from the wreckage. According to a preliminary report, published by India's Aircraft Accident Investigation Bureau (AAIB) in July, switches in the cockpit that controlled fuel were moved to a \"CUTOFF\" position. Paperwork has been seen by Sky News, reportedly showing a potential fault with a fuel control switch, which was logged by one of the pilots on Flight 132 after the plane landed early on Tuesday morning. \n                  Mortuary workers exposed to 'dangerously high' levels of toxin from Air India crash bodies, says report\n                 \n                  Initial report does not blame captain for Air India crash, court tells pilot's father\n                 \n                  Only survivor of Air India Flight 171 crash tells Sky News the trauma 'broke' him\n                 The entry reads: \"LEFT FUEL CONTROL SWITCH SLIPS FROM RUN TO CUT OFF WHEN PUSHED DOWN SLIGHTLY. IT DOES NOT LOCK IN ITS POSITION.\" It is unclear why the crew decided to proceed with the flight if, as reported, the switch failed to remain locked in the \"RUN\" position and moved towards \"CUTOFF\" during engine start-up. Sky News understands this happened on two consecutive attempts during the engine start-up procedure. A malfunction such as this, under specific conditions, could lead to an inadvertent engine shutdown in flight. Captain Amit Singh, founder of the aviation safety group Safety Matters Foundation, said: \"The incident is especially alarming as it mirrors a known risk previously identified by the US Federal Aviation Administration (FAA). \"In 2018, the FAA issued Safety Alert For Operators SAIB NM-18-33, explicitly warning that certain fuel control switches, including those on Boeing 787s, could malfunction in this exact manner, increasing the risk of accidental engine shutdown.\" A statement from Air India said: \"We are aware that one of our pilots has reported a possible defect on the fuel control switch of a Boeing 787-8 aircraft. \"After receiving this initial information, we have grounded the aircraft and are involving the OEM [Original Equipment Manufacturer] to get the pilot's concerns checked on a priority basis. The matter has been communicated to the aviation regulator, DGCA [Directorate General of Civil Aviation]. \"Air India had checked the fuel control switches on all Boeing 787 aircraft in its fleet after a directive from the DGCA and had found no issues. At Air India, the safety of our passengers and crew remains top priority.\" 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 Captain Singh told Sky News: \"The fuel switches are relevant to AI171 because it points to a possible hazard: unintended switch movement. \"Investigators can confirm or dismiss this using recorded data, switch inspection and maintenance records. It does not prove the cause, but it's a sensible line to check.\" In July, Air India said it had \"completed precautionary inspections on the locking mechanism of Fuel Control Switch (FCS) on all Boeing 787 and Boeing 737 aircraft in its fleet\" and \"no issues were found\". Captain Singh described the most recent report of an apparent fuel control switch issue as \"deeply troubling\" after the airline's checks found no issues. \"This discrepancy raises urgent questions,\" he added. Read more from Sky News:Ukraine hits out at 'infantile' FIFA bossEpstein: Mandelson urged to testifyICE agents issued body-worn cameras Sumeet Sabharwal was the captain on Flight 171, which crashed in June, and was in charge as the pilot-in-command, while Clive Kunder was the first officer flying the plane. The initial report from investigators stated that, in an audio recording from the cockpit, one of the pilots is heard asking the other why he \"cut off\", an apparent reference to the fuel control switches. The other pilot responds that he did not do so. The 15-page report did not identify which comments were made by the flight's captain and which were made by the first officer."
    },
    {
        "title": "French investigators raid Paris offices of Elon Musk's X",
        "description": "Investigators have raided the Paris offices of Elon Musk's social media site X, formerly known as Twitter.",
        "url": "https://news.sky.com/story/french-investigators-raid-paris-offices-of-elon-musks-x-13502669",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-elon-musk-x-twitter_7154226.jpg?20260203105154",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-03 10:48:00",
        "Headline": "Prosecutors said they had summoned Musk, the platform's billionaire owner, to come for questioning.",
        "Content": "Investigators have raided the Paris offices of Elon Musk's social media site X, formerly known as Twitter. French prosecutors said they were widening their probe into the platform and had summoned its billionaire owner for questioning. Present and past employees, including former chief executive Linda Yaccarino, who left the company last year, were also summoned as witnesses. The investigation, originally launched last month, will now cover the site's alleged complicity in the possession and distribution of child abuse images. It also relates to allegations of sexual deepfakes, Holocaust denial, fraudulent data extraction and abuse of algorithms on the site. The move follows complaints that Grok, the platform's AI chatbot, was being used to generate sexual photos of real women and children. In a statement, the Paris prosecutor's office confirmed it had conducted a joint raid with the cybercrime unit of the French police and Europol. \n                  Elon Musk's SpaceX buys Elon Musk's xAI\n                 \n                  Tesla axes EV models in drive for robotics revenue\n                 \n                  Man given Musk's Neuralink brain chip in UK trial says it 'feels magical' and gives new hope\n                 Authorities were taking a \"constructive approach\", the statement said, \"with the objective of ultimately ensuring the compliance of the X platform with French law\". It added that witnesses were being summoned voluntarily \"to allow them to explain their position\" and \"the compliance measures they plan to implement\". The prosecutor's office also posted on X to confirm the raid, and added that it would be leaving the platform. Last year, a Sky News investigation into algorithmic bias on X found that the platform was boosting right-wing and extreme content to users in the UK, regardless of the users' political leaning. Read more:The X Effect: How Elon Musk is boosting the British right An X spokesperson told Sky News at the time of publication that eventually users will be able to adjust their feeds \"dynamically\", by asking X's AI tool Grok, which now powers the algorithm driving the platform's \"For You\" feed. British regulatory watchdog Ofcom also opened a formal investigation into X last month under the UK's Online Safety Act to determine whether the firm was complying with its duties to protect people from illegal content. A spokesperson for X did not immediately respond to a request for comment. But Musk has previously accused French prosecutors of launching a \"politically-motivated criminal investigation\"."
    },
    {
        "title": "The Epstein Files - where's Donald Trump?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈&#160; </a>",
        "url": "https://news.sky.com/story/why-are-we-not-talking-about-donald-trump-in-the-epstein-files-13502556",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-t100-epstein_7153946.jpg?20260203042651",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-03 04:10:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈   The fallout from the release of more than three million documents on Friday by the Department of Justice. The Epstein files… with fresh questions aimed at Andrew Mountbatten-Windsor and Lord Peter Mandelson. Plus - what's Trump's involvement in the files? Plus - the Trump Kennedy Center? \"Closed for refurbishment,\" so says the president. Why? And the Grammys get political. You can watch all episodes on our YouTube channel. Email us on trump100@sky.uk with your comments and questions."
    },
    {
        "title": "'I still would like to meet Putin': Epstein's unrequited love for Russian leader",
        "description": "What has Vladimir Putin got to do with Jeffrey Epstein?",
        "url": "https://news.sky.com/story/i-still-would-like-to-meet-putin-epsteins-unrequited-love-for-russian-leader-13502862",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-putin-epstein_7154740.jpg?20260203183022",
        "type": "US",
        "Author": "Ivor Bennett",
        "Date Published": "2026-02-03 19:10:00",
        "Headline": "From 2013 onwards, the emails show Epstein made several bids to meet Putin through the former Norwegian PM Thorbjorn Jagland.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n What has Vladimir Putin got to do with Jeffrey Epstein? The Russian president's name appears more than 1,000 times in the latest files. His inclusion does not imply any wrongdoing, and there's no evidence the two ever met, but boy, it sounds like Epstein wanted to. The emails appear to reveal repeated attempts by the convicted sex offender to court the Kremlin leader. And there's even an audio file in which Epstein can be heard coaching someone on how to approach Putin. Follow live - Epstein files latest \"I would send a note to Putin, saying 'I'm going to leave government on March 14th. I'm going to be in Scandinavia, or I plan to be in western, northern Europe. We should have dinner'. That's it, no more. It has to be very short,\" he says in the recording. \n                  Starmer, Badenoch and McSweeney: Who are the winners and losers of the Mandelson-Epstein scandal?\n                 \n                  Prince Edward forced to address Epstein scandal due to his brother\n                 \n                  The Epstein Files - where's Donald Trump?\n                 The first substantive mention of Vladimir Putin in the latest files, unearthed by Sky's Data and Forensics team, is from September 2011. An unnamed contact refers to a meeting Epstein said he had arranged with Putin later that month, while Putin was Russia's prime minister. There's no evidence it took place, and there are no other details. From 2013 onwards, by which time Putin had returned to the presidency, the emails show Epstein made several bids to meet him through the former Norwegian PM Thorbjorn Jagland. From Epstein with love In May that year, Epstein emailed Jagland, who was then serving as secretary-general of the Council of Europe, saying: \"I know you are going to meet putin [sic] on the 20th, He is desperate to engage western investment in his country...I have his solution.\" He adds: \"I recoginize [sic] that there are human rights issues that are at the forefront of your trip howver [sic], if it is helpful to you, I would be happy to meet with him sometime in june [sic] and explain the solution to his top prioirty [sic], I think this would be good for your goals.\" But it appears it never happened. After pestering Jagland to follow up within Putin's team, Epstein complains that he has heard nothing back. In January 2014, Jagland told Epstein he was going to meet Putin in Sochi. \"Why don't you come?\" he asks. We don't know what happened next. But in July that year, Epstein still sounds desperate to meet the Russian president. In an email, a contact tells him: \"I wasn't able to convince Reid to change his schedule to go meet Putin with you.\" \"Bad idea now after plane crash,\" Epstein replies - a reference to Malaysian Airlines flight MH17, which was shot down over eastern Ukraine three days prior, killing all 298 people on board. But it seems it did not put Epstein off for long. Read more:Prince Edward forced to address Epstein scandalEpstein files: Key findings so far A year later, in July 2015, he tells Jagland: \"I still would like to meet putin [sic] and talk economy, i would really appreciate your assistance.\" There are more attempts in 2016, 2017 and finally in June 2018 - just one line in an email to Jagland once again: \"Would love to meet with putin [sic].\" It's certainly no smoking gun - it appears to be more a case of unrequited love. Silence in Moscow When asked about files, the Kremlin said on Tuesday it did not receive any offers from Epstein about a meeting with Vladimir Putin. Still, it's interesting to see how the Russian media is covering this story because, well, they are not. There's very little mention of it at all, and where there is, the focus is elsewhere - on Bill Clinton, Peter Mandelson and the crown princess of Norway. So even though there's no evidence or implication that he ever actually met with Epstein, Vladimir Putin's appearance in the files is still not something Moscow wants to highlight."
    },
    {
        "title": "Survivors of Jeffrey Epstein's abuse condemn US government's handling of files",
        "description": "Survivors of Jeffrey Epstein's abuse have condemned the US Department of Justice's release of files about the disgraced financier, with one saying \"a five-year-old could have done a better job\".",
        "url": "https://news.sky.com/story/survivors-of-jeffrey-epsteins-abuse-condemn-us-governments-handling-of-files-13502871",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lisa-phillips-jess-michaels_7154845.jpg?20260203211053",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-03 22:32:00",
        "Headline": "Jess Michaels and Lisa Phillips told Sky News the US Department of Justice had failed to protect victims with their redactions to the latest Epstein files. In a court filing, the DOJ said it was \"removing documents that inadvertently were produced\".",
        "Content": "Survivors of Jeffrey Epstein's abuse have condemned the US Department of Justice's release of files about the disgraced financier, with one saying \"a five-year-old could have done a better job\". Jess Michaels claims she was raped by Epstein in his penthouse after meeting him as a 22-year-old professional dancer in 1991. Speaking to Sky News' Jonathan Samuels on The World she said she hoped \"that justice would finally happen\" but said there are \"extreme redactions and then extreme neglect to (not) redact\". Follow latest: Police launch investigation into Mandelson claims Lawyers for the survivors have criticised the US Department of Justice's redactions of personal information from the Epstein files released on Friday, with the identity of at least one woman who had not previously come forward with allegations having been revealed. \"A five-year-old could have done a better job redacting these files with colour-coded crayons. It is an embarrassment that our Department of Justice put this out as their very best work,\" Ms Michaels said. \"It is shocking the damage this department of justice has done with the way that they have released survivors' personal information out there, when they literally had one job, which was to redact survivors' names.\" Ms Michaels added: \"I was willing to give the benefit of the doubt that it was just sloppy incompetence. \"But now it feels almost like it's purposeful to intimidate survivors, to punish survivors, to discredit survivors, and then not to hold the perpetrators actually guilty.\" Survivor says files redacts 'powerful people' Another survivor, Lisa Phillips, agreed that the US Department of Justice's latest release of Epstein files \"had a lot of redactions of people, powerful people... that were there\" with the disgraced financier. She said \"we should be able to see who those people are\". The US Department of Justice, in a court filing on Monday, said it was in the process of \"removing documents that inadvertently were produced and contain victim-identifying information\". Read more:The end of a scandal-tainted careerPrince forced to address Epstein scandal Survivors call for Mandelson and Andrew to testify The latest release of the files contained further revelations of Andrew Mountbatten Windsor and Peter Mandelson's relationship with Epstein. Both men have always denied wrongdoing. Ms Michaels said \"anyone that spent any significant time with Jeffrey Epstein should be called to testify before Congress\". Ms Phillips, who said she once met Andrew at the pool on Epstein's island, said \"everybody wants to hear\" him testify. She added: \"I would be the first person to want to hear about that testimony.\" Epstein died in prison in 2019 while awaiting trial on sex trafficking charges."
    },
    {
        "title": "Donald Trump seeks $1bn in damages from Harvard University",
        "description": "Donald Trump has said his administration will sue Harvard University for $1bn in damages as an ongoing row between the two sides deepens.",
        "url": "https://news.sky.com/story/donald-trump-seeks-1bn-from-harvard-university-in-legal-clash-13502633",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-harvard-university_7154145.jpg?20260203095041",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-03 09:28:00",
        "Headline": "Talks have been ongoing for months, with the president saying last September a deal was close, and that the university would pay $500m to settle. But now Mr Trump is seeking $1bn in damages.",
        "Content": "Donald Trump has said his administration will sue Harvard University for $1bn in damages as an ongoing row between the two sides deepens. The White House has threatened to withhold federal funds from several US universities over a number of issues. Mr Trump has criticised their approaches to diversity and trans rights, and said they have allowed antisemitism on campus during pro-Palestinian protests against Israel's war in Gaza. Some Ivy League schools, including Columbia and Brown University, have agreed deals with the White House and accepted certain demands, but Harvard sued the government over the federal funding freeze last year. The administration has cancelled hundreds of grants for Harvard researchers, saying the university failed to do enough to address harassment of Jewish students, which prompted the institution to take legal action. Talks with Harvard have been ongoing for months, with the American president saying last September that a deal was close, and that the university would pay $500m (£365m) to settle. But now Mr Trump wants $1bn (£730m) in damages, after the New York Times reported White House demands for a payment had been dropped. \n                  US aircraft carrier scrambles fighter jet to down 'aggressive' Iranian drone as tensions rise ahead of talks\n                 \n                  The Epstein Files - where's Donald Trump?\n                 \n                  ICE agents in Minneapolis to be issued with body-worn cameras after fatal shootings\n                 \"We are now seeking One Billion Dollars in damages, and want nothing further to do, into the future, with Harvard University,\" he wrote on his social network, Truth Social. He also accused the Ivy League institution, based in Cambridge, Massachusetts, of feeding \"nonsense\" to the newspaper, and of proposing a \"convoluted\" and \"wholly inadequate\" scheme in a bid to avoid paying up. \"It was merely a way of Harvard getting out of a large cash settlement of more than 500 Million Dollars, a number that should be much higher for the serious and heinous illegalities that they have committed,\" he wrote. He shared an excerpt from the New York Times too, in which it was suggested that the university had no choice but to agree a deal, given its dependence on federal funding. Harvard did not immediately respond to a request for comment. Read more from Sky News:President and his long history of lawsuits against mediaTrump sues JPMorgan Chase for $5bn in debanking row Columbia agreed to pay more than $220m (£161m) to the government and Brown said it will pay $50m (£36m) to support local workforce development. The president is no stranger to the courts, and has repeatedly filed lawsuits against those who have incurred his displeasure. He is currently suing the BBC in a multi-billion dollar lawsuit over the way one of his speeches was edited in a Panorama documentary."
    },
    {
        "title": "Jill Biden's ex-husband William Stevenson charged with murder after death of wife",
        "description": "The ex-husband of former first lady Jill Biden has been charged with first-degree murder after the death of his wife.",
        "url": "https://news.sky.com/story/william-stevenson-jill-bidens-ex-husband-charged-with-murder-after-death-of-wife-in-delaware-13502851",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-william-stevenson-jill-biden_7154724.jpg?20260203180132",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-03 17:27:00",
        "Headline": "William Stevenson, 77, was indicted on first-degree murder by a grand jury on Monday, in connection with 64-year-old Linda Stevenson's death last year. ",
        "Content": "The ex-husband of former first lady Jill Biden has been charged with first-degree murder after the death of his wife. William Stevenson, 77, was indicted on Monday by a grand jury in New Castle County, Delaware, in connection with the death of 64-year-old Linda Stevenson last year. Mrs Biden married Stevenson in February 1970, when she was 18 years old and a student at the University of Delaware, and he was 23. They were only married for five years. In March of 1975, she met then Democratic senator for Delaware Joe Biden, and a civil divorce between her and Stevenson was granted in May of that year. New Castle County Police said Stevenson was taken into custody at the home in Oak Hill without incident on Monday afternoon. He has since been arraigned and sent to the Howard Young Correction Institution in Wilmington, where he has been unable to pay a $500,000 (£365,207) cash bail. According to authorities, at around 11.16pm on 28 December, officers responded to a reported domestic dispute at a residence in Oak Hill, just west of Wilmington in New Castle County. \n                  Tesla shareholders approve Elon Musk's huge pay package\n                 \n                  Elon Musk cannot keep $55bn Tesla pay package, judge rules\n                 \n                  Joe Biden marks 49 years since car crash that killed his first wife and infant daughter\n                 Upon entering the home, emergency services found Mrs Stevenson unresponsive in the living room. She was later pronounced dead at the scene. Read more from Sky News:Coastal road swept away into seaTeen boy's four-hour swim to save family Delaware state police say Mrs Stevenson's body has been turned over to the Delaware Division of Forensic Science, where a post mortem examination will be conducted to determine the cause and manner of her death. The office of Jill and ex-president Joe Biden declined to comment to Sky's US partner network NBC News."
    },
    {
        "title": "Signs of forced entry at home of missing US TV presenter Savannah Guthrie's mother after 'kidnap'",
        "description": "Investigators looking into the disappearance of US TV host Savannah Guthrie's mother have found signs of forced entry at her Arizona home.",
        "url": "https://news.sky.com/story/signs-of-forced-entry-at-home-of-missing-us-tv-presenter-savannah-guthries-mother-after-kidnap-13502819",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-savannah-nancy-guthrie_7154671.jpg?20260203165830",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-03 16:10:00",
        "Headline": "Investigators believe that the 84-year-old - who is mother to the NBC News presenter - was abducted during the night but do not think she was taken as part of a robbery, home invasion or ransom plot",
        "Content": "Investigators looking into the disappearance of US TV host Savannah Guthrie's mother have found signs of forced entry at her Arizona home. Savannah Guthrie is a main co-anchor on Today, the morning show on NBC News, the US sister network of Sky News. A person familiar with the inquiry told the Associated Press that evidence in the home of Nancy Guthrie, 84, indicated that she had been kidnapped during the night. They said that several of Nancy Guthrie's personal items, including her mobile phone, wallet and her car, had been left in her property. Investigators do not believe at this point that the abduction was part of a robbery, home invasion or kidnapping-for-ransom plot, the person said. Police officers are currently reviewing information from licence plate cameras and surveillance video from nearby homes while working to analyse data from local phone towers. Nancy Guthrie was first reported missing by her family after she failed to appear at church on Sunday. \n                  The Epstein Files - where's Donald Trump?\n                 \n                  Epstein files: Key findings so far after more than three million pages released\n                 \n                  'I still would like to meet Putin': Epstein's unrequited love for Russian leader\n                 She was last seen at her home near Tucson, Arizona, the night before at around 9.30pm. In a social media post made on Monday, Savannah Guthrie described her mother as \"a woman of deep conviction, a good and faithful servant\". She asked supporters to \"raise your prayers with us and believe with us that she will be lifted by them in this very moment. Bring her home\". Pima County Sheriff Chris Nanos urged whoever has Nancy Guthrie to free her because she could die without access to medication. He said: \"If she's alive right now, her meds are vital. I can't stress that enough. It's been better than 24 hours, and the family tells us if she doesn't have those meds, it can become fatal.\" He added that investigators has taken samples that they hoped would provide at least part of a DNA profile. People searching for Nancy Guthrie used drones and search dogs and were supported by volunteers and Border Patrol. Search crews have now been pulled back, however. Mr Nanos said: \"We don't see this as a search mission so much as it is a crime scene.\" He previously said that Nancy Guthrie's disappearance was not \"dementia related\". Read more:The key findings from Epstein filesTrump seeks $1bn in damages from Harvard \"She's as sharp as a tack,\" he said. \"The family wants everyone to know that this isn't someone who just wandered off.\" Savannah Guthrie often brought her mother on Today as a guest. Speaking on the show in 2022 on Nancy Guthrie's 80th birthday, she said: \"She has met unthinkable challenges in her life with grit, without self-pity, with determination and always, always with unshakeable faith. \"She loves us, her family, fiercely, and her selflessness and sacrifice for us, her steadfastness and her unmovable confidence is the reason any of us grew up to do anything.\""
    },
    {
        "title": "Fuel leak delays NASA's mega-rocket moon mission",
        "description": "Houston has a problem.",
        "url": "https://news.sky.com/story/fuel-leak-delays-nasas-mega-rocket-moon-mission-13502636",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nasa-artemis_7137906.jpg?20260203135400",
        "type": "US",
        "Author": "Thomas Moore",
        "Date Published": "2026-02-03 09:40:00",
        "Headline": "NASA says it is now targeting a March launch for its new rocket after encountering a fuel leak during a crucial test.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n Houston has a problem. Once again, NASA's new mega-rocket has suffered a significant leak of explosive hydrogen propellant during a countdown rehearsal. It means plans to launch four astronauts on a mission around the moon have been delayed until March. Lift-off had been scheduled for as soon as Sunday. But the space agency says the delay will give engineers extra time to resolve the issue. Everything you need to know about Artemis II The so-called \"wet\" dress rehearsal at Kennedy Space Centre in Florida was a critical pre-launch test of the rocket, which has only flown once before. It's a run-through of all the events running up to launch, including fuelling the rocket. \n                  Everything to know about Artemis II - the NASA mission to send astronauts around the moon\n                 \n                  Huge NASA rocket reaches launch pad after painstaking 1mph journey\n                 \n                  Artemis mission live: NASA's mega-rocket painstakingly crawls towards launch pad\n                 But the countdown was paused twice because hydrogen was found to be leaking from the seal between the fuelling hose and the rocket. Engineers thought they had resolved the issue and finished filling up the two-million-litre hydrogen tank. But after entering the \"replenish phase\", when the tank is kept topped up, the hydrogen leak was once again found to exceed safety limits with just over five minutes left on the countdown. Hydrogen is a notoriously difficult propellant to handle. The molecule is extremely small, making it hard to contain. It's also pumped into the rocket as a liquid at high pressure and at -253C it's so cold that seals can become unreliable. The first - uncrewed - test flight of the Artemis rocket in 2022 was delayed by three months because of a series of problems, including hydrogen leaks. The rocket was twice rolled back to its maintenance hangar for repairs. NASA had hoped the fuelling issues had been resolved this time around. With humans on board for this flight, they are taking no chances. The astronauts have been released from quarantine in Houston, but will once again begin shielding from infections around two weeks before the next launch date, currently due to be 6 March. Read more from Sky News:Stunning aurora filmed from ISSMysterious iron 'bar' in spaceTim Peake on the new space race 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 The delay to the launch isn't a huge surprise because it is a new rocket. But there is another countdown in the minds of the NASA and White House administrations. China hopes to land taikonauts on the lunar surface by 2030 and the United States wants to be there first. This flight around the moon is designed to test the rocket and the Orion crew capsule ahead of a moon landing, optimistically scheduled for 2028. Engineers will be under pressure to find a fix."
    },
    {
        "title": "ICE agents in Minneapolis to be issued with body-worn cameras after fatal shootings",
        "description": "Officers tasked with carrying out a controversial immigration crackdown in Minneapolis will be equipped with body-worn cameras following the fatal shooting of two protesters.",
        "url": "https://news.sky.com/story/ice-agents-in-minneapolis-to-be-issued-with-body-worn-cameras-after-fatal-shootings-13502555",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-minneapolis-immigration_7153945.jpg?20260203034245",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-03 02:00:00",
        "Headline": "Donald Trump has indicated support for the move, saying the cameras will mean people \"can't lie about what's happening\" in the city.",
        "Content": "Officers tasked with carrying out a controversial immigration crackdown in Minneapolis will be equipped with body-worn cameras following the fatal shooting of two protesters. Homeland security secretary Kristi Noem said every agent from her department in the city, including those from Immigration and Customs Enforcement (ICE), will be given one. She also said body cameras would be sent to officers nationwide as funding becomes available. It is the latest attempt from the White House to alleviate tensions after two people were shot dead by federal agents in Minneapolis last month, sparking widespread backlash across the US. Alex Pretti, a 37-year-old ICU nurse, was killed by immigration officers just weeks after mother-of-three Renee Good was shot dead by an ICE agent in her car. Following Mr Pretti's death, Ms Noem claimed he \"came with a weapon and dozens of rounds of ammunition and attacked\" officers, who took action to \"defend their lives\". However, several videos that emerged of the shooting appeared to show Mr Pretti with only a mobile phone in his hand as officers tackled him to the ground, with one removing a handgun from his trousers. 👉 Listen to Sky News Daily on your podcast app 👈 The Department of Homeland Security has previously said at least four Customs and Border Protection officers on the scene when Mr Pretti was shot were wearing body cameras. However, that footage has not been made public. It is also not yet known if any of the ICE officers at the scene of Ms Good's killing were wearing cameras. Trump: Cameras mean 'people can't lie' In response to Ms Noem's announcement, Donald Trump insisted it was not his decision but said he was largely in favour of the initiative. \"They [body-worn cameras] generally tend to be good for law enforcement, because people can't lie about what's happening,\" the US president said. \"So, it's generally speaking I think 80% good for law enforcement. But if she wants to do the camera thing, that's okay with me.\" Read more from Sky News:Son of Norway's crown princess arrestedUkraine hits out at 'infantile' FIFA boss Since Mr Pretti's death, Mr Trump has sent Tom Homan - his so-called \"border tsar\" - to Minneapolis to replace US border patrol commander Gregory Bovino, who had been overseeing ICE in the city. Two agents involved in Mr Pretti's fatal shooting have been placed on administrative leave, while the Department of Justice has opened a federal civil rights investigation into the incident. The situation in Minneapolis has prompted increased calls for all immigration enforcement officers to wear body cameras. In 2022, former president Joe Biden ordered that federal law enforcement officers wear body cameras as part of an executive order that included other policing reform measures. However, Mr Trump rescinded that directive after starting his second term."
    },
    {
        "title": "Elon Musk's SpaceX buys Elon Musk's xAI",
        "description": "SpaceX has announced it has acquired artificial intelligence start-up xAI in a deal that that brings together two companies owned by Elon Musk.&#160;",
        "url": "https://news.sky.com/story/elon-musks-spacex-buys-elon-musks-xai-13502553",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-elon-musk-x-artificial-intelligence_7131790.jpg?20260110083527",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-02-03 00:07:00",
        "Headline": "The world's richest man says combining two of his most notable companies would create \"the most ambitious, vertically-integrated innovation engine\". ",
        "Content": "SpaceX has announced it has acquired artificial intelligence start-up xAI in a deal that that brings together two companies owned by Elon Musk.  In a statement, Mr Musk said the deal would create \"the most ambitious, vertically-integrated innovation engine on (and off) Earth, with AI, rockets, space-based internet, direct-to-mobile device communications and the world's foremost real-time information and free speech platform\". The world's richest man, who also owns Tesla, social media platform X, and satellite communications company Starlink, said the combination would aim to develop AI data centres in space, and called the move \"not just the next chapter, but the next book in SpaceX and xAI's mission\". X, formerly Twitter, was itself bought by xAI last year. Mr Musk bought Twitter in 2022 for $44bn (£38bn). A $1trn company Of the latest deal, Mr Musk wrote: \"In the long term, space-based AI is obviously the only way to scale. \"The only logical solution therefore is to transport these resource-intensive efforts to a location with vast power and space. I mean, space is called 'space' for a reason. \"By directly harnessing near-constant solar power with little operating or maintenance costs, these satellites will transform our ability to scale compute. \"It's always sunny in space.\" The combined company would have a valuation of $1.25trn (£910bn), according to Bloomberg, and the deal comes ahead of SpaceX's anticipated initial public offering, expected to be announced later this year. SpaceX are not the only company to explore the idea of putting AI data centres in space. Google last year revealed a new research project called Project Suncatcher that would equip solar-powered satellites with AI computer chips. Mississippi officials last month announced that xAI is set to spend $20bn (£14.6bn) to build a data centre near the state's border with Tennessee. Read more from Sky News:Stars hit out at ICE during Grammy awardsTrump to close Kennedy Center for two years SpaceX's acquisition of xAI comes weeks after X came under fire following complaints that users were using the platform's AI chatbot, Grok, to make sexualised photos of real women and children It prompted an investigation by the UK's independent online safety watchdog, Ofcom, and calls from Prime Minister Sir Keir Starmer for the platform to comply with UK laws \"immediately\". The company has since announced the AI tool will no longer be able to undress pictures of real people. \"We have implemented technological measures to prevent the Grok account from allowing the editing of images of real people in revealing clothing such as bikinis,\" X previously said in a statement. \"This restriction applies to all users, including paid subscribers.\""
    },
    {
        "title": "Football watchdog pitches up to Premier League clubs summit",
        "description": "The bosses of English football's new watchdog will next week pitch up to a summit of the game's most powerful clubs as they await the outcome of the probe into alleged financial improprieties at Manchester City.",
        "url": "https://news.sky.com/story/football-watchdog-pitches-up-to-premier-league-clubs-summit-13502692",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-premier-league-football_7046488.jpg?20251009082759",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-02-03 11:36:00",
        "Headline": "The chairman and CEO of the Independent Football Regulator will next week attend a private meeting of the 20 top-flight clubs for the first time, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The bosses of English football's new watchdog will next week pitch up to a summit of the game's most powerful clubs as they await the outcome of the probe into alleged financial improprieties at Manchester City. Sky News has learnt that David Kogan and Richard Monks, respectively the chair and chief executive of the Independent Football Regulator (IFR), will attend a meeting of Premier League shareholders for the first time. Mr Kogan and Mr Monks are expected to make a brief presentation to the 20 top-flight clubs, which include Arsenal, Liverpool, Newcastle United and West Ham United. Money blog: Gold set for biggest rise since 2008; Greggs taking on Costa and Starbucks with new product Their appearance will come a month after the IFR outlined the proposed scope of its inaugural State of the Game report, which will explore the flow of money through the English football pyramid. According to a statement from the watchdog last month, the review will examine how financial flows within the game have shifted, including in relation to \"cliff-edges\" between or within leagues. The IFR will ultimately have powers to impose a financial redistribution agreement on the Premier League, dictating how much money its clubs must hand over to their lower league counterparts. \n                  Former Premier League referee David Coote avoids jail sentence over sexual video of schoolboy\n                 \n                  How much has sacking managers cost Manchester United?\n                 \n                  Chelsea's new boss Liam Rosenior convicted of speeding\n                 Prior to the regulator's formal establishment, talks were held between the Premier League and English Football League about a multi-year deal worth close to £1bn, but no agreement was struck. The Premier League, which declined to comment on the attendance of the IFR at next week's shareholder meeting, initially expressed scepticism about the need to establish an industry regulator. The IFR was conceived during Boris Johnson's stint as prime minister, when the formation of a European Super League involving six of England's top clubs sparked outrage across the sporting and political arenas. The ESL project was quickly abandoned by its Premier League participants, but successive Conservative and Labour administrations decided to press ahead with setting up the regulator. A verdict in the Manchester City case, which saw the serial Premier League champions charged with more than 100 breaches of the competition's rules, is now said by some in the sport to be close. A spokesman for the IFR declined to comment."
    },
    {
        "title": "Proptech platform OneDome finds home for $25m funding injection",
        "description": "A financial and property technology business which integrates elements of the homebuying process has clinched a $25m funding injection as it seeks to accelerate its expansion.",
        "url": "https://news.sky.com/story/proptech-platform-onedome-finds-home-for-25m-funding-injection-13502663",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-building-construction_6851336.jpg?20250309162142",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-02-03 10:36:00",
        "Headline": "The homebuying service which struck a deal with Channel 4 Ventures last year will announce on Wednesday the completion of a pre-Series C funding round, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A financial and property technology business which integrates elements of the homebuying process has clinched a $25m funding injection as it seeks to accelerate its expansion. Sky News understands that OneDome will confirm on Wednesday the pre-Series C fundraising, taking the total sum it has raised to $40m. The latest round includes a media-for-equity deal with Channel 4, the state-owned broadcaster, worth up to £7.5m, which was reported by Sky News late last year. OneDome's HomeBuyer service provides mortgage advice, conveyancing and transaction management in a single fixed-price bundle sold for £999. Last year, the company acquired Trussle, the online mortgage broker, which had raised funds from investors including Goldman Sachs. OneDome - chaired by the veteran former City lawyer Sir Nigel Knowles - has set a five-year target of being involved in 10% of all UK homebuying transactions. The company, which says it is already profitable, wants to triple revenues by the end of 2026. \n                  Elon Musk's SpaceX buys Elon Musk's xAI\n                 \n                  Mortgage blow as major lenders hike rates | Money blog\n                 \n                  Football watchdog pitches up to Premier League clubs summit\n                 The platform arranges roughly $1.4bn of mortgage lending every month and works with a network of over 500 mortgage brokers, making it one of the largest mortgage and property platforms in Britain. \"Buying a home is still one of the most stressful and disjointed financial transactions people go through,\" Babek Ismayil, OneDome's founder and chief executive, said. \"We started OneDome to fix that by bringing everything under one roof and turning homebuying into a simple, transparent retail experience. \"This funding allows us to scale what is already a profitable and fast-growing platform, while continuing to challenge how homes are bought and financed in the UK.\" OneDome declined to name the other investors in the latest round, saying they were family offices across the UK, Saudi Arabia, the United States, and Australia."
    },
    {
        "title": "Tories to use ancient mechanism to force release of Mandelson vetting papers after criminal investigation launched",
        "description": "The Conservatives will today attempt to force the release of all information relating to Sir Keir Starmer's appointment of Peter Mandelson as ambassador to the United States after new revelations about his ties to Jeffrey Epstein.",
        "url": "https://news.sky.com/story/tories-to-use-ancient-mechanism-to-try-and-force-release-of-mandelson-vetting-papers-13502888",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-peter-mandelson-house-of-lords_7152981.jpg?20260202082256",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-03 20:02:00",
        "Headline": "So-called humble addresses are binding on ministers if passed, with several Labour MPs telling Sky News they would be prepared to vote with the Opposition.",
        "Content": "The Conservatives will today attempt to force the release of all information relating to Sir Keir Starmer's appointment of Peter Mandelson as ambassador to the United States after new revelations about his ties to Jeffrey Epstein. Party leader Kemi Badenoch has demanded No 10 explain the vetting process after she claimed that concerns were \"waived away\" so the PM could make a \"political appointment of a man who is a close friend of a convicted paedophile\". It comes after the Metropolitan Police announced they had launched a criminal investigation into misconduct in public office offences after files released by US authorities appeared to show Mandelson had passed internal discussions from the heart of UK government to Epstein after the global financial crash. Mandelson was business secretary in Gordon Brown's government at the time, was later made a life peer and last year was appointed the UK's ambassador to the US. He was sacked as ambassador in September, after new emails revealed he sent messages of support to Epstein even as the disgraced financier faced jail for sex offences in 2008. His friendship with Epstein had already been known at the time of his appointment, but Number 10 argued it was not aware of its \"depth and extent\". The Conservatives will use their Opposition Day to table a humble address - an arcane mechanism that can compel the government of the day to produce certain documents. \n                  Lord Mandelson resigns after Epstein files - how did we get here?\n                 \n                  Starmer, Badenoch and McSweeney: Who are the winners and losers of the Mandelson-Epstein scandal?\n                 \n                  The end of a scandal-tainted career: Mandelson had no alternative but to resign\n                 The documents they will want to be published include due diligence work carried out by the Cabinet Office; emails between Mandelson and the PM's chief of staff Morgan McSweeney on his association with Epstein; minutes of meetings held about the appointment and details of payments made to Mandelson on his departure from the ambassador role. Humble addresses, if passed, are binding on ministers. Several Labour MPs have told Sky News they were prepared to vote with the Opposition on the humble address. Left-wing MP Richard Burgon told Sky News' chief political correspondent Jon Craig that it would be \"crazy\" if the government opposed the motion, as \"we can't have a situation where the government is dragged kicking and screaming to do the right thing\". Mrs Badenoch said Labour MPs \"need to do what they know is right\" and argued it \"is about the reputation of our parliament and our country\". She said: \"I hope MPs of all parties, and especially those in Labour, will join us in fighting for the truth, for full justice for Epstein's victims and for openness and honesty with the British people. \"If the prime minister had a backbone, he'd allow his MPs to vote with their conscience and put their country before their party.\" No 10 added an amendment to the humble address calling for all documents to be published \"except papers prejudicial to UK national security or international relations\", according to the Commons order paper. Mandelson has stepped down from the House of Lords following the latest revelations. He has previously said: \"I was wrong to believe Epstein following his conviction [in 2008 for procuring a child for prostitution and of soliciting a prostitute] and to continue my association with him afterwards. I apologise unequivocally for doing so to the women and girls who suffered.\""
    },
    {
        "title": "Starmer, Badenoch and McSweeney: Who are the winners and losers of the Mandelson-Epstein scandal?",
        "description": "Sir Keir Starmer and the Labour high command may be relieved that Peter Mandelson has quit the House of Lords.",
        "url": "https://news.sky.com/story/starmer-badenoch-and-mcsweeney-who-are-the-winners-and-losers-of-the-mandelson-epstein-scandal-13502982",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-epstein-peter-mandelson_7154992.jpg?20260203231928",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2026-02-03 23:28:00",
        "Headline": "For Sir Keir Starmer and the soon-to-be ex-peer, the fallout may be about to get even worse, as Mr Mandelson faces a full-blown police inquiry while the prime minister's torment is set to resume on Wednesday.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Sir Keir Starmer and the Labour high command may be relieved that Peter Mandelson has quit the House of Lords. But for both the prime minister and the soon-to-be ex-peer, their humiliation and torment may be about to get even worse. Mr Mandelson faces a full-blown probe by the Met's specialist crime team into allegations of misconduct in public office, for which the maximum penalty is life imprisonment. Jeffrey Epstein scandal - latest Yes, really! It's that serious. In an interview with The Times carried out last week but published on Monday, Mandelson referred to a \"handful of misguided historical emails, which I deeply regret sending\". On other claims, Lord Mandelson questioned the authenticity of the documents, citing false claims he had a US social security number, questionable US-dollar cheque payments into UK banks, incorrect beneficiary details, and multiple basic errors in dates, spelling and formatting. The police investigation, no doubt extremely complex, could last several months, and if he's prosecuted, Mr Mandelson's agony could last years, even if he's acquitted. The torment for the prime minister is more immediate. He faces a potentially painful onslaught from Kemi Badenoch at Wednesday's Prime Minister's Questions, followed by a bruising Commons debate. The PM must be cursing the parliamentary calendar, because Wednesday is an opposition day in the Commons, which means the Conservatives choose the business. And this time the Tories are using a tactic used by Labour in opposition. In the parliamentary jargon, it's called a humble address, which means the Tory motion demands publication of all the papers relating to Sir Keir's appointment of Mr Mandelson as ambassador to the US. Yes, all of them! In theory, at least. A paper trail, in other words. It's a device Labour employed with some success during the endless Commons debates on Brexit a few years back when Sir Keir was opposition leader. This time, though, the prime minister could face a major rebellion from Labour backbenchers if he whips his MPs to vote against the Tory motion. But will he? \"I'll vote for a paper trail to be released,\" left-wing serial rebel Richard Burgon told Sky News. \"But there shouldn't be a vote. They shouldn't be opposing the motion. \"It would be crazy to do so. We can't have a situation where the government is dragged kicking and screaming to do the right thing.\" The government is not falling into the Tory trap, however. It will commit to publishing documents about the Mandelson appointment. But ministers have tabled an amendment to the Conservative motion proposing an exemption for papers affecting national security. The PM's amendment adds: \"Except papers prejudicial to UK national security of international relations.\" Which could, of course, mean there are a large number of exemptions. Too many, the Conservatives may claim. Kemi Badenoch claims the normal procedures were \"waived away\" so the prime minister could appoint Mr Mandelson as ambassador, despite his close relationship with a convicted paedophile. \"Let's see all the correspondence, emails, mobile phone records,\" she said. \"We want to see everything.\" The Tories also plan to turn up the heat on the PM's controversial chief of staff, Morgan McSweeney, a man who's already the pantomime villain of Labour's woes and blunders. \"Morgan McSweeney, a close protégé of Peter Mandelson, was involved in the vetting,\" said the Tory leader. \"Morgan McSweeney is a man whose fingerprints are all over this embarrassment.\" Read more on Sky News:Mandelson quits Labour Party over Epstein linksMandelson 'has no recollection' of $75,000Scandal-tainted career is over For the PM, the Mandelson nightmare couldn't have come at a worse time. His poll ratings are through the floor, he faces a horrible by-election on 26 February and horrendous local and national elections in May. The mavericks and malcontents on the Labour benches claim the only question about Sir Keir's survival is when his mutineers move to oust him: after the by-election or after the May elections. McSweeney, therefore, could be a convenient scapegoat, sacrificed to save an embattled prime minister. A No 10 svengali dumped just like Alastair Campbell, Andy Coulson and Dominic Cummings were before him. The only winners from the Mandelson fiasco are Westminster's opposition parties. Not just the Conservatives, either. The Liberal Democrats and Scottish National party led demands for the police investigation. Despite the PM's tough talk and his claim that Mandelson \"let his country down\", a damning verdict of his bad judgement in him could mean he ends up being as big a loser as the Prince of Darkness himself."
    },
    {
        "title": "Woman prisoners 'traded as pawns for political gain' by 'Orwellian' Scottish government policy, court told",
        "description": "Female prisoners are being treated as \"pawns\" by an \"Orwellian\" government policy which allows transgender inmates to be placed in women's jails, a court has heard.",
        "url": "https://news.sky.com/story/woman-prisoners-traded-as-pawns-for-political-gain-by-orwellian-scottish-government-policy-court-told-13502710",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-court-of-session-edinburgh_7154497.jpg?20260203142926",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-03 12:13:00",
        "Headline": "For Women Scotland is taking legal action against the Scottish government, claiming its policy over the management of transgender prisoners is \"unlawful\". ",
        "Content": "Female prisoners are being treated as \"pawns\" by an \"Orwellian\" government policy which allows transgender inmates to be placed in women's jails, a court has heard. Advocate Aidan O'Neill KC accused Scottish ministers on Tuesday of breaching the human rights of biological females in jails with the practice. Mr O'Neill was speaking on the first day of a judicial review at the Court of Session in Edinburgh brought by campaign group For Women Scotland (FWS). The organisation believes that biological men who identify as women should not be allowed in women's prisons. Current Scottish Prison Service (SPS) guidance allows for a transgender woman to be admitted into the female prison estate if the inmate does not meet the violence against women and girls criteria, and there is no other basis \"to suppose\" they could pose an \"unacceptable risk of harm\" to those also housed there. FWS has brought its case before judge Lady Ross at Scotland's highest civil court and is seeking a legal order declaring the policy over the management and placement of transgender prisoners to be \"unlawful\". It is also calling for the court to order ministers to abandon the policy. \n                  Scotland's health secretary Neil Gray repeatedly asked if Queen Elizabeth University Hospital is 'safe'\n                 \n                  Scottish government vows to release 'Salmond files' but refuses to set date as it faces legal action over the delay\n                 \n                  The winners and losers in the Scottish budget\n                 In legal arguments published ahead of the three-day hearing, the Scottish government said a \"blanket rule\" about placing transgender prisoners in jails according to their biological sex \"would violate the rights of some prisoners\". The government plans to argue that placing inmates in a prison for those of the opposite biological sex \"may be required\" to prevent a violation of the Human Rights Act and Scotland Act 1998. As proceedings got under way, Mr O'Neill said the policy meant that biological men convicted of serious violent offences, including murder, were being placed in jail alongside vulnerable women. He said women prisoners were being \"gaslit\" and argued that their safety was being put at risk. Mr O'Neill also said the policy breached FWS's landmark UK Supreme Court win last year which stated that the words \"men\", \"women\" and \"sex\" refer to biological sex - and which confirms that public authorities may lawfully provide female-only spaces that exclude men. 'Traded as pawns for political gain' Mr O'Neill said: \"What's happening here is that women in prison are being treated and used by the Scottish government in this case to be traded as pawns for political gain. \"Who knows what backroom deals have been made between the Scottish government and other parties, perhaps that insists that this case be defended and fought before the court. \"This is because the law isn't in their favour. What we have, it appears, is the insistence on the maintenance, even in the light of the decision of the UK Supreme Court - which the Scottish ministers lost soundly, roundly, completely and unequivocally - that this policy has somehow to be maintained. \"But it's a policy which is based on, I submit, institutional neglect of and contempt for women's rights. \"It's almost - if I can use Orwellian terms for it - Animal Farm like. \"Women good. But men identifying as women better. Or all women are equal, but men identifying as women are more equal than others.\" Read more from Sky News:Sarwar vows to ban trans women from female prisons if FM Mr O'Neill stated he would be using the term women when he means women, and man when he means man. 'Women are being psychologically manipulated' Mr O'Neill claimed women prisoners were being treated as \"human shields\" by the Scottish ministers and said the policy had the effect of \"gaslighting\" females in the prison system. He added: \"Women are being psychologically manipulated into questioning their own sanity or ability to reason by this policy, because it's being kind to trans-identifying men.\" Mr O'Neill said there was no ruling from the European Court of Human Rights in Strasbourg which supports the policy. The hearing continues."
    },
    {
        "title": "Elon Musk's xAI chatbot Grok faces ICO probe after allegedly creating sexual imagery of children",
        "description": "The UK's information watchdog will investigate reports that Elon Musk's AI chatbot, Grok, has been used to generate sexual imagery of children.",
        "url": "https://news.sky.com/story/probe-launched-into-claims-elon-musks-ai-engine-used-to-generate-sexual-imagery-of-children-13502686",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-elon-musk-grok_7133741.jpg?20260112211628",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-03 11:19:00",
        "Headline": "\"The reports about Grok raise deeply troubling questions,\" said William Malcolm of the Information Commissioner's Office. ",
        "Content": "The UK's information watchdog will investigate reports that Elon Musk's AI chatbot, Grok, has been used to generate sexual imagery of children. Grok was developed by Musk's xAI in 2023, designed to be a \"truth-seeking\" assistant with a witty, rebellious personality. Integrated into X, formerly Twitter, it uses real-time data from the platform to generate text, images and code. But complaints have mounted that Grok was being used to generate sexual photos of real women and children, and now the Information Commissioner's Office (ICO) is investigating. The announcement comes on the same day the X offices in Paris were raided by French prosecutors examining similar allegations. In a statement on its website, the ICO confirmed it had opened a formal probe into two X companies concerning their processing of personal data in relation to Grok, and the AI's potential to produce harmful sexualised image and video content. \"We have taken this step following reports that Grok has been used to generate non‑consensual sexual imagery of individuals, including children,\" the statement said. \n                  Andrew moves out of Royal Lodge - as police assess new allegation\n                 \n                  Lord Mandelson resigns after Epstein files - how did we get here?\n                 \n                  Tories to use ancient mechanism to force release of Mandelson vetting papers after criminal investigation launched\n                 \"The reported creation and circulation of such content raises serious concerns under UK data protection law and presents a risk of significant potential harm to the public.\" William Malcolm of the ICO said the investigation would probe whether X Internet Unlimited Company and xAI had complied with data protection laws, and provided sufficient safeguards. He said: \"The reports about Grok raise deeply troubling questions about how people's personal data has been used to generate intimate or sexualised images without their knowledge or consent, and whether the necessary safeguards were put in place to prevent this. \"Losing control of personal data in this way can cause immediate and significant harm. This is particularly the case where children are involved. \"Our role is to address the data protection concerns at the centre of this, while recognising that other organisations also have important responsibilities.\" Ofcom also investigating Another regulatory watchdog, Ofcom, also opened a formal investigation into X last month under the UK's Online Safety Act, to determine whether the firm was complying with its duties to protect people from illegal content. The European Commission launched a probe into Grok last month too, looking at whether it disseminates illegal content, such as manipulated sexualised images, in the EU. The EU is one of a number of authorities around the world to have raised concerns about Grok, with government officials in Germany, Sweden, India, Japan, Malaysia, California, Indonesia and Philippines among those that have spoken out. Mr Malcolm said the ICO was working closely with Ofcom and \"international regulators\". Grok has restricted image editing but yet to say where In a separate statement, regulator Ofcom said - while it was probing X - it was not investigating xAI, which provides the standalone Grok chatbot app. Ofcom also said its investigation into X was still gathering evidence and warned the probe could take months. On why it was not investigating xAI, the statement said: \"When we opened our investigation into X, we said we were assessing whether we should also investigate xAI, as the provider of the standalone Grok service. \"We continue to demand answers from xAI about the risks it poses. We are examining whether to launch an investigation into its compliance with the rules.\" Ofcom said that because of the way the Online Safety Act relates to chatbots, it was currently unable to investigate the creation of illegal images by the standalone Grok itself. xAI said on 14 January it had restricted image editing for Grok AI users and blocked users, based on their location, from generating images of people in revealing clothing in \"jurisdictions where it's illegal\". It is yet to identify the countries where those restrictions apply. xAI earlier said it had limited the use of Grok's image generation and editing features to paying subscribers only."
    },
    {
        "title": "Fuel leak delays NASA's mega-rocket moon mission",
        "description": "Houston has a problem.",
        "url": "https://news.sky.com/story/fuel-leak-delays-nasas-mega-rocket-moon-mission-13502636",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nasa-artemis_7137906.jpg?20260203135400",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2026-02-03 09:40:00",
        "Headline": "NASA says it is now targeting a March launch for its new rocket after encountering a fuel leak during a crucial test.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n Houston has a problem. Once again, NASA's new mega-rocket has suffered a significant leak of explosive hydrogen propellant during a countdown rehearsal. It means plans to launch four astronauts on a mission around the moon have been delayed until March. Lift-off had been scheduled for as soon as Sunday. But the space agency says the delay will give engineers extra time to resolve the issue. Everything you need to know about Artemis II The so-called \"wet\" dress rehearsal at Kennedy Space Centre in Florida was a critical pre-launch test of the rocket, which has only flown once before. It's a run-through of all the events running up to launch, including fuelling the rocket. \n                  Everything to know about Artemis II - the NASA mission to send astronauts around the moon\n                 \n                  Huge NASA rocket reaches launch pad after painstaking 1mph journey\n                 \n                  Artemis mission live: NASA's mega-rocket painstakingly crawls towards launch pad\n                 But the countdown was paused twice because hydrogen was found to be leaking from the seal between the fuelling hose and the rocket. Engineers thought they had resolved the issue and finished filling up the two-million-litre hydrogen tank. But after entering the \"replenish phase\", when the tank is kept topped up, the hydrogen leak was once again found to exceed safety limits with just over five minutes left on the countdown. Hydrogen is a notoriously difficult propellant to handle. The molecule is extremely small, making it hard to contain. It's also pumped into the rocket as a liquid at high pressure and at -253C it's so cold that seals can become unreliable. The first - uncrewed - test flight of the Artemis rocket in 2022 was delayed by three months because of a series of problems, including hydrogen leaks. The rocket was twice rolled back to its maintenance hangar for repairs. NASA had hoped the fuelling issues had been resolved this time around. With humans on board for this flight, they are taking no chances. The astronauts have been released from quarantine in Houston, but will once again begin shielding from infections around two weeks before the next launch date, currently due to be 6 March. Read more from Sky News:Stunning aurora filmed from ISSMysterious iron 'bar' in spaceTim Peake on the new space race 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 The delay to the launch isn't a huge surprise because it is a new rocket. But there is another countdown in the minds of the NASA and White House administrations. China hopes to land taikonauts on the lunar surface by 2030 and the United States wants to be there first. This flight around the moon is designed to test the rocket and the Orion crew capsule ahead of a moon landing, optimistically scheduled for 2028. Engineers will be under pressure to find a fix."
    },
    {
        "title": "China to ban hidden door handles seen on some electric cars",
        "description": "The world's second-largest economy and major electric car maker is to ban hidden door handles, a common feature on electric vehicles (EVs). ",
        "url": "https://news.sky.com/story/china-to-ban-hidden-door-handles-seen-on-some-electric-cars-13502676",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-electric-car-congestion-charge_6995864.jpg?20250820035029",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-03 11:02:00",
        "Headline": "From next year, new car models will have to have both exterior and interior handles with mechanical releases.",
        "Content": "The world's second-largest economy and major electric car maker is to ban hidden door handles, a common feature on electric vehicles (EVs).  China will ban hidden door handles from next year, making it the first country to do so. Instead, cars must have a mechanical release function for handles, except for car boots, according to details released by China's Ministry of Industry and Information Technology. Money blog: Gold set for biggest rise since 2008; Greggs taking on Costa and Starbucks with new product It's doing so to address safety concerns after EV accidents where electronic doors reportedly failed to operate and trapped passengers inside. Last year, the US National Highway Traffic Safety Administration opened an investigation into some of Tesla's door ‍release controls. Hidden door handles open with a key fob, mobile phone ⁠or by manually pressing them. \n                  Driver's claim electric vehicle moved of own accord before it killed boy dismissed by crash expert\n                 \n                  £1.5bn package announced to help Britain switch to electric vehicles\n                 \n                  Direct cost of Jaguar Land Rover cyber attack which impacted UK economic growth revealed\n                 The design was pioneered by electric vehicle company Tesla and adopted by Chinese competitors. What's changing? Under China's new safety technical ‌requirements, every car door should be equipped with both exterior and interior handles with mandatory mechanical releases. The policy also sets out rules for where handles must be located ‍and how they should function so they can be opened in an emergency. Interior handles must also be clearly ‌visible. New vehicle models must comply with the latest door handle ⁠design regulation from 1 January ‌2027, while approved models will come in scope on 1 January 2029, the ministry said. Tesla has been contacted for comment."
    },
    {
        "title": "Elon Musk's SpaceX buys Elon Musk's xAI",
        "description": "SpaceX has announced it has acquired artificial intelligence start-up xAI in a deal that that brings together two companies owned by Elon Musk.&#160;",
        "url": "https://news.sky.com/story/elon-musks-spacex-buys-elon-musks-xai-13502553",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-elon-musk-x-artificial-intelligence_7131790.jpg?20260110083527",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-03 00:07:00",
        "Headline": "The world's richest man says combining two of his most notable companies would create \"the most ambitious, vertically-integrated innovation engine\". ",
        "Content": "SpaceX has announced it has acquired artificial intelligence start-up xAI in a deal that that brings together two companies owned by Elon Musk.  In a statement, Mr Musk said the deal would create \"the most ambitious, vertically-integrated innovation engine on (and off) Earth, with AI, rockets, space-based internet, direct-to-mobile device communications and the world's foremost real-time information and free speech platform\". The world's richest man, who also owns Tesla, social media platform X, and satellite communications company Starlink, said the combination would aim to develop AI data centres in space, and called the move \"not just the next chapter, but the next book in SpaceX and xAI's mission\". X, formerly Twitter, was itself bought by xAI last year. Mr Musk bought Twitter in 2022 for $44bn (£38bn). A $1trn company Of the latest deal, Mr Musk wrote: \"In the long term, space-based AI is obviously the only way to scale. \"The only logical solution therefore is to transport these resource-intensive efforts to a location with vast power and space. I mean, space is called 'space' for a reason. \"By directly harnessing near-constant solar power with little operating or maintenance costs, these satellites will transform our ability to scale compute. \"It's always sunny in space.\" The combined company would have a valuation of $1.25trn (£910bn), according to Bloomberg, and the deal comes ahead of SpaceX's anticipated initial public offering, expected to be announced later this year. SpaceX are not the only company to explore the idea of putting AI data centres in space. Google last year revealed a new research project called Project Suncatcher that would equip solar-powered satellites with AI computer chips. Mississippi officials last month announced that xAI is set to spend $20bn (£14.6bn) to build a data centre near the state's border with Tennessee. Read more from Sky News:Stars hit out at ICE during Grammy awardsTrump to close Kennedy Center for two years SpaceX's acquisition of xAI comes weeks after X came under fire following complaints that users were using the platform's AI chatbot, Grok, to make sexualised photos of real women and children It prompted an investigation by the UK's independent online safety watchdog, Ofcom, and calls from Prime Minister Sir Keir Starmer for the platform to comply with UK laws \"immediately\". The company has since announced the AI tool will no longer be able to undress pictures of real people. \"We have implemented technological measures to prevent the Grok account from allowing the editing of images of real people in revealing clothing such as bikinis,\" X previously said in a statement. \"This restriction applies to all users, including paid subscribers.\""
    },
    {
        "title": "French investigators raid Paris offices of Elon Musk's X",
        "description": "Investigators have raided the Paris offices of Elon Musk's social media site X, formerly known as Twitter.",
        "url": "https://news.sky.com/story/french-investigators-raid-paris-offices-of-elon-musks-x-13502669",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-elon-musk-x-twitter_7154226.jpg?20260203105154",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-03 10:48:00",
        "Headline": "Prosecutors said they had summoned Musk, the platform's billionaire owner, to come for questioning.",
        "Content": "Investigators have raided the Paris offices of Elon Musk's social media site X, formerly known as Twitter. French prosecutors said they were widening their probe into the platform and had summoned its billionaire owner for questioning. Present and past employees, including former chief executive Linda Yaccarino, who left the company last year, were also summoned as witnesses. The investigation, originally launched last month, will now cover the site's alleged complicity in the possession and distribution of child abuse images. It also relates to allegations of sexual deepfakes, Holocaust denial, fraudulent data extraction and abuse of algorithms on the site. The move follows complaints that Grok, the platform's AI chatbot, was being used to generate sexual photos of real women and children. In a statement, the Paris prosecutor's office confirmed it had conducted a joint raid with the cybercrime unit of the French police and Europol. \n                  Elon Musk's SpaceX buys Elon Musk's xAI\n                 \n                  Tesla axes EV models in drive for robotics revenue\n                 \n                  Man given Musk's Neuralink brain chip in UK trial says it 'feels magical' and gives new hope\n                 Authorities were taking a \"constructive approach\", the statement said, \"with the objective of ultimately ensuring the compliance of the X platform with French law\". It added that witnesses were being summoned voluntarily \"to allow them to explain their position\" and \"the compliance measures they plan to implement\". The prosecutor's office also posted on X to confirm the raid, and added that it would be leaving the platform. Last year, a Sky News investigation into algorithmic bias on X found that the platform was boosting right-wing and extreme content to users in the UK, regardless of the users' political leaning. Read more:The X Effect: How Elon Musk is boosting the British right An X spokesperson told Sky News at the time of publication that eventually users will be able to adjust their feeds \"dynamically\", by asking X's AI tool Grok, which now powers the algorithm driving the platform's \"For You\" feed. British regulatory watchdog Ofcom also opened a formal investigation into X last month under the UK's Online Safety Act to determine whether the firm was complying with its duties to protect people from illegal content. A spokesperson for X did not immediately respond to a request for comment. But Musk has previously accused French prosecutors of launching a \"politically-motivated criminal investigation\"."
    },
    {
        "title": "KPop Demon Hunters stars to perform at BAFTAs in first live show outside US",
        "description": "The singing stars behind KPop Demon Hunters' biggest hit are set to perform at the BAFTAs later this month - their first live performance outside the US.",
        "url": "https://news.sky.com/story/kpop-demon-hunters-stars-to-perform-at-baftas-in-first-live-show-outside-us-13502667",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-kpop-demon-hunters_7127037.jpg?20260105124518",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-03 12:00:00",
        "Headline": "Golden, the hit song from the KPop Demon Hunters soundtrack, made history at the weekend as it became the first ever K-pop song to win a Grammy, following previous wins at the Golden Globes - however, the film was ineligible for nomination at the BAFTAs.",
        "Content": "The singing stars behind KPop Demon Hunters' biggest hit are set to perform at the BAFTAs later this month - their first live performance outside the US. Ejae (Rumi), Audrey Nuna (Mira), and Rei Ami (Zoey), the singing voices behind the fictional band HUNTR/X, will perform the record-breaking hit Golden from the film's soundtrack, organisers have announced. The song made history at the weekend as it became the first ever K-pop song to win a Grammy, following previous wins for best animated film and best original song at the Golden Globes in January. However, despite its success at US awards ceremonies - including nominations for best animated film and best original song at the Oscars next month - the film was ineligible for awards at the BAFTAs as it was first released on Netflix and not in UK cinemas. \"Performing at the EE BAFTA Film Awards is a golden moment that our younger selves could never have imagined!,\" the singers said in a statement. \"We're so proud to represent Netflix's KPop Demon Hunters and spread the film's positive message to fans around the globe.\" Within two months of its release in June, KPop Demon Hunters became Netflix's most watched film of all time, and has now had more than 500 million streams. Golden, the headline track from the film's soundtrack, topped the Billboard chart in the US for eight consecutive weeks and the UK charts for 10 non-consecutive weeks, and made Spotify's top 10 of songs streamed globally in 2025. Read more:BAFTAs: The full list of stars and films nominatedBad Bunny to Olivia Dean: The big winners at the Grammys Emma Baehr, BAFTA executive director of awards and content, said the film had had a \"phenomenal impact on the hearts and minds of audiences of all ages around the world\" and that she was \"thrilled\" to welcome the singers bringing \"K-pop energy\" to the ceremony. \"Not only are we here to celebrate exceptional films and the people who make them, we also want to create an unmissable night of entertainment, and we can't wait to roll out the EE BAFTA Film Awards red carpet for such an iconic trio,\" she said. The singers were the voices behind the film's soundtrack but the spoken words were voiced by three different actresses, Arden Cho (Rumi), May Hong (Mira) and Ji-young Yoo (Zoey). The BAFTAs ceremony will take place at London's Royal Festival Hall on Sunday 22 February, with stars including Timothee Chalamet, Jessie Buckley, Leonardo DiCaprio, Emma Stone, Michael B Jordan, Kate Hudson, Teyana Taylor and Paul Mescal in the running for awards."
    },
    {
        "title": "Man sentenced after trying to break into Anya Taylor-Joy's bedroom during burglary",
        "description": "A man has been sentenced for breaking into a house where actor Anya Taylor-Joy was staying and using a crowbar to try to get into her bedroom.",
        "url": "https://news.sky.com/story/man-sentenced-after-trying-to-break-into-anya-taylor-joys-bedroom-during-burglary-13502653",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-anya-taylor-joy-saturday-night-live_7154609.jpg?20260203160209",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-03 10:11:00",
        "Headline": "Kirk Holdrick initially denied the London burglary and claimed DNA found at the scene was there because he had been to a party at the property .",
        "Content": "A man has been sentenced for breaking into a house where actor Anya Taylor-Joy was staying and using a crowbar to try to get into her bedroom. Kirk Holdrick, 43, and another man smashed their way into the London mansion in balaclavas in the early hours of 12 February 2023. They were confronted by Taylor-Joy's husband, Malcolm MacRae, who had gone to investigate the sound of breaking glass. He ran back to the bedroom and barricaded himself and his wife in - armed only with a lamp - as the raiders tried to prise open the door. CCTV captured Holdrick and his accomplice climbing a wall to the home and becoming \"startled\" as they triggered a security light. Wood Green Crown Court heard they fled after MacRae claimed to have a gun. Prosecutors believe they may have been specifically targeting the Hollywood star. \n                  Hollywood stars descend on Dior's first Scottish fashion show since 1955\n                 \n                  Mad Max: Director George Miller on tech limitations, the origin of the franchise and the future of film\n                 \n                  Anya Taylor-Joy and Chris Hemsworth discuss Furiosa: A Mad Max Saga\n                 Taylor-Joy - known for productions such as The Queen's Gambit, Peaky Blinders and the Dune films - was still barricaded inside with her husband when police arrived. Nine days later, Holdrick broke into another house in the famous millionaires' enclave of Sandbanks and tied up a woman and her daughter at gunpoint. Holdrick and accomplice Ashley Fulton dressed as police to gain entry. They dragged the daughter by her hair and threatened to burn her with an iron and shoot her dead if they weren't given the code to the safe. They failed but made off with about £200,000 worth of watches, jewellery and cash. In November, Holdrick was jailed for 12 years after admitting the Sandbanks raid and received a further three-year term this week for the burglary involving Taylor-Joy and her husband. He initially denied the London burglary and claimed DNA found at the scene was there because he had been to a party at the property. However, he pleaded guilty in December last year. Holdrick, who once dated a cast member from The Only Way Is Essex, was also jailed for life in 2005 for an armed robbery on a security van and has convictions dating back to his teens."
    },
    {
        "title": "Signs of forced entry at home of missing US TV presenter Savannah Guthrie's mother after 'kidnap'",
        "description": "Investigators looking into the disappearance of US TV host Savannah Guthrie's mother have found signs of forced entry at her Arizona home.",
        "url": "https://news.sky.com/story/signs-of-forced-entry-at-home-of-missing-us-tv-presenter-savannah-guthries-mother-after-kidnap-13502819",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-savannah-nancy-guthrie_7154671.jpg?20260203165830",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-03 16:10:00",
        "Headline": "Investigators believe that the 84-year-old - who is mother to the NBC News presenter - was abducted during the night but do not think she was taken as part of a robbery, home invasion or ransom plot",
        "Content": "Investigators looking into the disappearance of US TV host Savannah Guthrie's mother have found signs of forced entry at her Arizona home. Savannah Guthrie is a main co-anchor on Today, the morning show on NBC News, the US sister network of Sky News. A person familiar with the inquiry told the Associated Press that evidence in the home of Nancy Guthrie, 84, indicated that she had been kidnapped during the night. They said that several of Nancy Guthrie's personal items, including her mobile phone, wallet and her car, had been left in her property. Investigators do not believe at this point that the abduction was part of a robbery, home invasion or kidnapping-for-ransom plot, the person said. Police officers are currently reviewing information from licence plate cameras and surveillance video from nearby homes while working to analyse data from local phone towers. Nancy Guthrie was first reported missing by her family after she failed to appear at church on Sunday. \n                  The Epstein Files - where's Donald Trump?\n                 \n                  Epstein files: Key findings so far after more than three million pages released\n                 \n                  'I still would like to meet Putin': Epstein's unrequited love for Russian leader\n                 She was last seen at her home near Tucson, Arizona, the night before at around 9.30pm. In a social media post made on Monday, Savannah Guthrie described her mother as \"a woman of deep conviction, a good and faithful servant\". She asked supporters to \"raise your prayers with us and believe with us that she will be lifted by them in this very moment. Bring her home\". Pima County Sheriff Chris Nanos urged whoever has Nancy Guthrie to free her because she could die without access to medication. He said: \"If she's alive right now, her meds are vital. I can't stress that enough. It's been better than 24 hours, and the family tells us if she doesn't have those meds, it can become fatal.\" He added that investigators has taken samples that they hoped would provide at least part of a DNA profile. People searching for Nancy Guthrie used drones and search dogs and were supported by volunteers and Border Patrol. Search crews have now been pulled back, however. Mr Nanos said: \"We don't see this as a search mission so much as it is a crime scene.\" He previously said that Nancy Guthrie's disappearance was not \"dementia related\". Read more:The key findings from Epstein filesTrump seeks $1bn in damages from Harvard \"She's as sharp as a tack,\" he said. \"The family wants everyone to know that this isn't someone who just wandered off.\" Savannah Guthrie often brought her mother on Today as a guest. Speaking on the show in 2022 on Nancy Guthrie's 80th birthday, she said: \"She has met unthinkable challenges in her life with grit, without self-pity, with determination and always, always with unshakeable faith. \"She loves us, her family, fiercely, and her selflessness and sacrifice for us, her steadfastness and her unmovable confidence is the reason any of us grew up to do anything.\""
    },
    {
        "title": "Masked thieves steal statue of local hero boxer from London park using three-wheel bike and hi-vis jacket",
        "description": "A bronze statue of a world champion boxer has been stolen from a park in east London - as CCTV footage captured the brazen theft by a masked gang.",
        "url": "https://news.sky.com/story/masked-men-steal-statue-of-local-hero-boxer-from-london-park-using-three-wheel-bike-and-hi-vis-jacket-13502824",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-statue-teddy-baldock_7154625.jpg?20260203162007",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2026-02-03 16:32:00",
        "Headline": "The statue of Teddy Baldock, known as \"The Pride of Poplar\", was removed from its stone plinth on Sunday night by four suspects dressed in black, police said.",
        "Content": "A bronze statue of a world champion boxer has been stolen from a park in east London - as CCTV footage captured the brazen theft by a masked gang. The statue of Teddy Baldock was removed from its stone plinth in Langdon Park in Poplar on Sunday night, the Metropolitan Police said. Police, who were told of the theft at 8.07pm, published CCTV images showing four suspects at the scene, all dressed in black with their faces covered. They \"wiggled\" the statue free \"before placing it in a three-wheel cargo bike and covering it with a high-vis jacket\", the force said on Tuesday. No tools were seen to be used. The suspects were last seen travelling northbound towards Bromley-by-Bow underground station, the Met added. Detective Superintendent Oliver Richter said it was \"very distressing\" for the community \"to have a monument of a local hero treated this way. \n                  Albanian burglars chased by ex-Aston Villa and Brentford player jailed for break-in spree\n                 \n                  Snapchat predator coerced boys to perform sex acts in exchange for Xbox and PlayStation codes\n                 \n                  Man dies from 'unsurvivable' injuries after being found in Bristol street\n                 Detectives were \"working at pace to identify those responsible and will continue to follow every available line of enquiry\", he said, as he appealed for anyone with information to get in touch. The statue of Baldock - Britain's youngest boxing world champion - was erected in the park in 2014 following a fundraising campaign led by his grandson A plaque on the plinth describes him as \"The Pride of Poplar\". Baldock was Britain's youngest world champion \"of the modern era\", British Boxers said on its website, adding it was \"unlikely that any London boxer has enjoyed a larger following than did the popular East Ender\". Read more on Sky News:Light aircraft crashes with two believed to be on boardBaby in serious condition after e-bike his pregnant woman Born in Poplar in 1907, he defeated US fighter Archie Bell for the vacant world bantamweight title at the Royal Albert Hall in 1927, aged just 19. The only British boxer to win a world title during the 1920s, Baldock held the European Champion and British Bantamweight Champion belts from 1928 to 1931, British Boxers said. He retired from boxing aged only 24 after 73 wins in 81 professional fights, and died in 1971."
    }
]