[
    {
        "title": "Teachers to be trained to spot signs of misogyny in boys and teach about healthy relationships",
        "description": "Teachers will be trained to spot early signs of misogyny in boys and steer them away from it as part of the government's long-awaited strategy to tackle violence against women and girls (VAWG).",
        "url": "https://news.sky.com/story/schools-will-have-to-teach-about-healthy-relationships-to-tackle-misogyny-13484951",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/school-students-teachers_6967281.jpg?20251210151738",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-17 20:01:00",
        "Headline": "A range of measures are being unveiled as part of the government's long-awaited strategy to halve violence against women and girls in a decade.",
        "Content": "Teachers will be trained to spot early signs of misogyny in boys and steer them away from it as part of the government's long-awaited strategy to tackle violence against women and girls (VAWG). Sir Keir Starmer warned \"too often toxic ideas are taking hold early and going unchallenged\", with more than 40% of young men said to hold a positive view of misogynistic influencer Andrew Tate. He has been challenged about his ideology in the past and called the concerns \"garbage\". Sir Keir's government will formally unveil a £20m package of measures today, with £16m coming from the taxpayer and £4m from philanthropists and partners. Teachers will also get specialist training on how to talk to pupils about issues like consent and the dangers of sharing intimate images - and all secondary school pupils in England will be taught about healthy relationships. Such lessons will be mandatory by the end of this parliament in 2029, with schools to be chosen for a pilot scheme in 2026, which experts will be brought in to deliver. And an online helpline will be set up for teenagers with concerns about their own behaviour in relationships. The measures are part of the government's strategy to halve VAWG in a decade, and the prime minister said it's a \"responsibility we owe to the next generation\". \"Every parent should be able to trust that their daughter is safe at school, online and in her relationships,\" he said. \"This government is stepping in sooner - backing teachers, calling out misogyny, and intervening when warning signs appear - to stop harm before it starts.\" Department for Education-commissioned research found 70% of secondary school teachers surveyed said their school had actively dealt with sexual violence and/or harassment between children. VAWG minister Jess Phillips told Sky News political editor Beth Rigby she had spoken to her own children about what's normal sexual behaviour and what isn't because she knows \"what they might be exposed to\". She said if the government does nothing to intervene, VAWG could double rather than be halved. Read more: Teams deployed to tackle violence 'emergency'Domestic abuse survivors to get NHS help The government has already announced several other measures to tackle VAWG this week, including introducing specialist rape and sexual offences investigators to every police force, better support for survivors in the NHS, and a £19m funding boost for councils to provide safe housing for domestic abuse survivors. Investment 'falls short' But Dame Nicole Jacobs, the domestic abuse commissioner for England and Wales, said the commitments \"do not go far enough\" and schools are overburdened already. \"Today's strategy rightly recognises the scale of this challenge and the need to address the misogynistic attitudes that underpin it, but the level of investment to achieve this falls seriously short,\" she said. Claire Waxman, the incoming victims commissioner, added: \"Victim services are not an optional extra to this strategy - they must be the backbone of it. \"Without clear, sustainable investment and cross-government leadership, I am concerned we run the risk of the strategy amounting to less than the sum of its parts; a wish list of tactical measures rather than a bold, unifying strategic framework.\""
    },
    {
        "title": "Jess Phillips on tackling violence against women and girls: 'I've tried to talk to my children about strangulation - it's not normal sexual behaviour'",
        "description": "There have been three strategies by three successive governments to tackle violence against women and girls (VAWG) since 2010, and one refresh.",
        "url": "https://news.sky.com/story/jess-phillips-on-tackling-violence-against-women-and-girls-ive-tried-to-talk-to-my-children-about-strangulation-its-not-normal-sexual-behaviour-13485013",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jess-phillips-beth-rigby_7113553.jpg?20251218001825",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-12-17 22:49:00",
        "Headline": "At least one in every 12 women will be a victim of violence against women and girls, but the number is probably higher than that, as this sort of violence is typically underreported.",
        "Content": "\n          Political editor\n              @BethRigby\n There have been three strategies by three successive governments to tackle violence against women and girls (VAWG) since 2010, and one refresh. What has been the result of these endeavours? Police chiefs in 2024 described the scale of violence against women and girls as \"a national emergency\" as over one million incidents were reported in 2022/3, accounting for 20% of all police recorded crime. At least one in every 12 women will be a victim, but the number is probably higher than that, as this sort of violence is typically underreported. You will likely know a woman who is the victim of abuse. When you look at the situation, and think of all the mums, sisters, daughters, aunts and friends, it makes you want to put your head in your hands: strategy after strategy, plan after plan, women and girls and the victims of abuse are being let down. Today, the government will launch a new strategy, drawn up by Jess Phillips, the safeguarding minister, that will attempt to finally put this right. The promise is to halve violence against women and girls in a decade after what has been, as Phillips puts it, \"a catalogue of failures\". That catalogue of failures is long. Successive governments had \"failed to deliver a genuinely whole-of-government approach\", concluded the National Audit Office (NAO) at the beginning of this year, as it detailed a string of shortcomings when it came to VAWG plans: partial implementation; failure to learn from past strategies; no oversight of government funding being used for VAWG; a focus on victim support rather than prevention; and a lack of buy-in from government departments. Phillips, who spent her career campaigning for victims of domestic violence before becoming an MP, wants to break that chain with her new plan, which has three pillars: prevention, with a focus on boys and young men to challenge misogyny and promote healthy relationships; stopping abusers, with more efforts and power for police forces to track down abusers; and more victim support. It is a strategy that has been delayed three times. It was first expected in the spring, then the summer, to autumn, before eventually landing 18 months into a Labour government. The delays have drawn criticism from campaigners, frustrated they \"put more lives at risk\". Read more:Schools will teach about healthy relationships to tackle misogyny 'I'm going to be getting up in everybody's business' When I spoke to Phillips about those delays on the Electoral Dysfunction podcast, she made no apology for that: \"I could have hit the deadline and missed the point.\" \"I'm not really interested in a headline that says, 'minister delivers a strategy one time',\" she said, explaining she'd had to \"bang heads together\" in different government departments to get buy-in and coordination (something the NAO said previous strategies lacked). Phillips said the strategy contains a written action plan with time frames in it, as she insists the target to halve VAWG can be hit within the decade, despite the delay. There will be an inter-ministerial VAWG group to improve cross-government working. She said: \"What we have been doing is going into other government departments and building up relationships with their teams. We have VAWG-specific staff in Number 10 now. That's never existed before. And we have been in the Department of Health. We have been in the Department of Transport. The real answer is I'm going to be getting up in everybody's business. That's the reason it has taken so long.\" Strategy also focuses on men and boys Speaking to Phillips, you cannot doubt her determination to make it a reality, and much of this strategy focuses on men and boys as well as women and girls, with a big focus on prevention and stopping abuse. \"I would be failing, we would be failing, if we didn't try to prevent people who were already perpetrating - and stopping people becoming perpetrators in the first place,\" she said. That involves the classroom and more conversations and bringing in men and boys to make them feel they are part of this. Risk of 'doubling' VAWG When I point out to Phillips that one in four 18 to 29-year-olds had favourable views towards Andrew Tate, she was quick to make the point that three out of four don't. \"If we don't do something about the situation with what young people, both victims and perpetrators, are exposed to, then not only would we not halve [VAWG in a decade], but I would also be talking about the risk of doubling it,\" she said. 'I have spoken to my children in really explicit terms' What struck me in our conversation, and as a mum of two teenagers myself, is the role Phillips said we all need to take in talking to our children about what they are being exposed to online. Phillips points out that the age profile of perpetrators is dropping as younger people become more exposed to violent pornography. One of the elements in the strategy is to ban strangulation in porn. Another is to have mandatory guidance in secondary schools to offer lessons on culture, increasing awareness of artificial intelligence and how pornography links to misogyny. Phillips, who has two sons, said it's incumbent on all of us to have those conversations with our kids about what is normal sexual behaviour and what is not. \"I have spoken to my children in really explicit terms about the things that I think they might be seeing and think as standardised in sexual practice,\" she told me. \"I have tried to talk to them about things like strangulation. I have said it is totally and utterly not like normal sexual behaviour because I know what they might be exposed to.\" Criticism over handling of grooming gangs But as a campaigner around domestic violence and now a minister charged with halving VAWG, Phillips has also faced criticism over the government's handling of grooming gangs. Fiona Goddard, who was abused by an organised street gang in Bradford, quit her role on the victims panel in the autumn and called for the resignation of the minister over her handling of the inquiry setup, which Phillips admitted she found personally difficult. She said: \"I'm not going to lie and pretend that it's nice when the thing that you care the most about in the world is the thing you are criticised for. And actually, when Fiona Goddard does that, I just take it. Fiona Goddard has every right to criticise me. When other people who never have done a bar's work in this area, but want to use that to politically criticise, I think that's cynical. \"One of the things that I think has been hardest about this process is that I am held to a different standard to literally everybody else. Now of course I should be held to a different standard because let's be honest, Beth, I'm better than most people who've had my job before because of my experience.\" 'The strategy isn't the end, it's the beginning' Phillips, the victim herself of a torrent of online abuse from Elon Musk over grooming gangs earlier this year, before the latest furore over the setting up of the national inquiry, now has police protection. I wonder whether the launch of the strategy might be the moment Phillips steps back, but she's having none of it. \"The strategy isn't the end, it's the beginning. There's a lot of work to do. I would be lying if I didn't say it didn't have a mental toll on me, but I am not the only person doing this work, it isn't all on me… the upside is better, it's worth it,\" she said. The strategy Phillips is spearheading is the fourth in 15 years. After a series of false starts, Phillips insisted this time it will be different. For the sake of our women and our girls, I hope she is right."
    },
    {
        "title": "Rob Reiner's son appears in court accused of murdering Hollywood director and wife",
        "description": "Rob Reiner's son Nick made his first court appearance on Wednesday on two counts of first-degree murder in the killing of his parents.",
        "url": "https://news.sky.com/story/rob-reiners-son-appears-in-court-accused-of-murdering-hollywood-director-and-wife-13484931",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nick-reiner-murder_7113354.jpg?20251217195009",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-17 20:01:00",
        "Headline": "Nick Reiner, the youngest son of Rob Reiner and Michele Singer, appeared in court in shackles and weaning a suicide prevention smock, as he faces charges of first-degree murder in the killing of his parents. ",
        "Content": "Rob Reiner's son Nick made his first court appearance on Wednesday on two counts of first-degree murder in the killing of his parents. Wearing a suicide prevention smock and shackles, the 32-year-old did not enter a plea as he appeared from behind the glass wall of a custody area. His next court appearance will be on 7 January. As it happened: Nick Reiner makes first court appearance Nick Reiner spoke only to say, \"yes, your honour\" to agree to the date. He was charged Tuesday with killing the 78-year-old actor and director Rob Reiner and his wife, Michele Singer Reiner, Los Angeles County District Attorney Nathan Hochman announced at a news conference. Nick Reiner is being held without bail and could face the death penalty. Along with the two counts of first-degree murder, prosecutors added a special circumstance of multiple murders, as well as an allegation that he personally used a dangerous and deadly weapon, a knife. Speaking outside the court, Nick Reiner's lawyer, Alan Jackson, called on the public not to \"rush to judgement\". Mr Jackson pointed to \"complex and serious issues that are associated with this case\" that needed to be thoroughly and \"very carefully dealt with and examined\". He added that it was a \"devastating tragedy that has befallen the Reiner family\". 'Unimaginable pain' Nick Reiner's two siblings Jake and Romy have released a statement, saying \"words cannot even begin to describe the unimaginable pain we are experiencing every moment of the day\". \"The horrific and devastating loss of our parents, Rob and Michele Reiner, is something that no one should ever experience,\" they said. \"They weren't just our parents; they were our best friends. We are grateful for the outpouring of condolences, kindness, and support we have received not only from family and friends but people from all walks of life.\" The two asked for \"respect and privacy\" and for speculation to be treated with \"compassion and humanity\". Authorities have not disclosed a motive for the killings. Rob Reiner and Michele Singer Reiner were found dead from apparent stab wounds in their home in the upscale Brentwood neighbourhood of Los Angeles. Read more from Sky News:Moment Nick Reiner arrested for murder of his parentsCould Reiner actually face the death penalty? Nick Reiner did not resist when he was arrested hours later near the University of Southern California, about 14 miles (22.5 kilometres) from the crime scene, according to police. Rob Reiner was a celebrated director, whose work included some of the most memorable films of the 1980s and 1990s, including This Is Spinal Tap, The Princess Bride, When Harry Met Sally and A Few Good Men. He met Michele Singer, a photographer, movie producer and advocate for LGBTQ+ rights, in 1989, while directing When Harry Met Sally."
    },
    {
        "title": "Pivotal talks for the future of the Ukraine war take place today - here's why they matter",
        "description": "EU leaders will meet in Brussels today to try to agree the release of &#8364;210bn (&#163;184bn) to help fund Ukraine's war with Russia.",
        "url": "https://news.sky.com/story/pivotal-talks-for-the-future-of-the-ukraine-war-take-place-today-heres-why-they-matter-13484969",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-volodymyr-zelenskyy_7113475.jpg?20251217220057",
        "type": "Home",
        "Author": "Alistair Bunkall, Europe correspondent in Brussels",
        "Date Published": "2025-12-17 21:07:00",
        "Headline": "Thursday is a crucial day for Ukraine's European allies as they look to prove they still have a major role to play in shaping the future of the conflict - with or without the backing of US President Donald Trump.",
        "Content": "By Alistair Bunkall, Europe correspondent in Brussels  EU leaders will meet in Brussels today to try to agree the release of €210bn (£184bn) to help fund Ukraine's war with Russia. The money, which comes from Russian assets frozen after Moscow's full-scale invasion of Ukraine in 2022, is mostly held in the Belgian-headquartered clearing house, Euroclear. The money is seen as vital to Ukraine's ability to keep fighting, because the country faces bankruptcy in early 2026 if it doesn't receive more international assistance. That means Kyiv would no longer be able to pay soldiers, police and civil servants or buy weapons to defend itself. Latest updates on Ukraine war Last night, Volodymyr Zelenskyy, who is expected to brief the EU leaders today, wrote on X: \"The result Europe produces - must make Russia feel that its desire to continue the war next year is pointless, because Ukraine will have support. This rests entirely with Europe.\" The Belgian government has so far prevented the move amid fears it will expose the small country to Russian legal action in the future. The EU is racing to find solutions to Belgium's concerns, including passing an emergency bill that secures the sanctions against Russia indefinitely, superseding the need to renew them every six months and thereby insulating it from veto votes from Russian-leaning EU member states like Hungary and Slovakia. Belgium also wants guarantees that all EU members will share any financial cost of Russian action against it. Why the push to use Russian assets? The US, which has so far given billions of dollars to Kyiv, is losing interest under Donald Trump and can no longer be relied upon for financial support. Previously, the EU had been giving the interest generated from the frozen assets to Ukraine, but was worried it might destabilise the Eurozone economy if it touched the assets itself. That has changed, however, as Ukraine's need has become more acute and fears over Russia's wider imperialist ambitions have grown in recent months. This unlocking of seized Russian assets is also being seen as a way to buy Brussels more leverage in peace negotiations, as well as reducing Kyiv's dependency on Washington. Read more:South Africans fighting for RussiaRussia trying to 'bully' UK and allies German Chancellor Friedrich Merz, who has been leading the campaign to release the funds, warned that \"Europe would be severely damaged for years\" if they fail to pass the vote and \"this step is not about prolonging the war but about bringing the war to an end as soon as possible\". In short, the consequences of using the frozen assets are now considered less risky than the consequences of not taking this action. What's at stake? Trump wanted the money to be invested in two US investment funds, something the EU rejects. The US president has recently been scathing of European leaders, and the EU sees Thursday's meeting as an opportunity to show its strength and unity. In theory, the EU could pass the policy by majority vote, thereby sidelining the Belgian government, but officials are reluctant to go down this path for fear of alienating Belgium and causing a diplomatic rift in the alliance. Much is riding on the meeting. If the EU fails to pass the vote, its credibility will take a severe blow. It will likely become even more irrelevant in peace talks, and Vladimir Putin might look to take advantage of a divided Europe."
    },
    {
        "title": "Aria Thorpe: Images released of girl, 9, stabbed to death - as boy appears in court charged with murder",
        "description": "Police have released photos of nine-year-old Aria Thorpe, who was stabbed to death in Somerset.",
        "url": "https://news.sky.com/story/boy-charged-with-murder-of-nine-year-old-girl-as-victim-named-13484630",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-aria-thorpe-killed_7113294.jpg?20251217175951",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-17 08:17:00",
        "Headline": "A 15-year-old boy, who cannot be named because of his age, has been charged with murdering Aria Thorpe in Weston-super-Mare. It's believed she died from a single stab wound.",
        "Content": "Police have released photos of nine-year-old Aria Thorpe, who was stabbed to death in Somerset. One image shows the girl in a white sleeveless top and wearing a hairband with Minnie Mouse-style ears. The other picture is of Aria in a pink dress, wearing a rosette and \"happy birthday\" headband, surrounded by balloons. Her family approved the release of the images. It comes as a teenage boy appeared in court charged with the girl's murder. Aria died after suffering a single stab wound on Monday, Avon and Somerset Police said. Emergency services were called to Lime Close in Weston-super-Mare at 6.09pm but Aria was pronounced dead at the scene. A 15-year-old boy, who cannot be named because of his age, appeared at Bristol Magistrates' Court on Wednesday charged with her murder. During a brief hearing, he spoke only to confirm his name, address and date of birth. He was remanded into youth detention accommodation ahead of a hearing at Bristol Crown Court on Friday. A police cordon remains in place at the scene of Aria's death as forensics officers continue their work. Read more from Sky News:NHS facing 'worst-case scenario' as doctors strikeArrests over plot to steal 'tonnes' of charity clothes to fund crime Superintendent Jen Appleford, from Avon and Somerset Police, said the community was in shock and Aria's family were being supported by police. \"It is impossible to adequately describe how traumatic the past 36 hours have been for them and we'd like to reiterate in the strongest possible terms their request for privacy,\" she said. Supt Appleford said police were working with local schools and other agencies to make sure support is available."
    },
    {
        "title": "King meets Huntingdon train attack heroes, including guard who protected passengers",
        "description": "The King has met survivors of last month's Huntingdon train mass stabbing, during a special reception at Buckingham Palace.",
        "url": "https://news.sky.com/story/king-meets-huntingdon-train-attack-heroes-including-guard-who-protected-passengers-from-being-stabbed-13484868",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-train-king_7113338.jpg?20251217192049",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-17 15:57:00",
        "Headline": "More than 10 people were hurt in the attack on the 6.25pm service from Doncaster to London King's Cross on 1 November.",
        "Content": "The King has met survivors of last month's Huntingdon train mass stabbing, during a special reception at Buckingham Palace. He shook hands with train guard Samir Zitouni, who was seriously injured as he stepped in to protect passengers. More than 10 people were hurt in the stabbing on the 6.25pm LNER service from Doncaster to London King's Cross on 1 November, which diverted to Huntingdon. The monarch also met Andrew Johnson, who previously served in the Royal Navy, and was driving the service at the time of the attack. He was praised by Prime Minister Sir Keir Starmer for his quick thinking when he moved the train on to a slow line. That decision allowed it to stop at Huntingdon station, leading to a quicker response time by emergency services and potentially saving lives. Mr Zitouni was credited with saving multiple lives, but was left in a critical condition due to injuries he suffered in the attack. \n                  Man accused of Huntingdon train stabbings refuses to attend court\n                 \n                  Man attempts train hijack a week after Huntingdon stabbings\n                 \n                  Huntingdon train stabbing victim 'didn't have much choice' but to fight back\n                 Stephen Crean, a football fan who had been returning home after watching Nottingham Forest's 2-2 draw with Manchester United, was also injured while fighting back to protect others during the incident. Mr Crean said he would need plastic surgery following his injuries. Amira Ostalski, a student who suddenly found herself in danger, said she ran into the buffet car where she picked up a metal tray to protect herself and her friend. \"I was honestly so petrified. I thought in that moment it was the last time I was ever going to be alive. I thought I was going to die,\" she said. Anthony Williams was charged with 10 counts of attempted murder, one count of actual bodily harm and one count of possession of a bladed article following the train attack. He remains in custody pending further court hearings scheduled for next year."
    },
    {
        "title": "If Abramovich fends off legal action long enough, could he eventually be able to spend Chelsea funds as he wishes?",
        "description": "Through all the threats to sue by Sir Keir Starmer's government, Roman Abramovich has stayed silent and still sanctioned.",
        "url": "https://news.sky.com/story/if-abramovich-fends-off-legal-action-long-enough-could-he-eventually-be-able-to-spend-chelsea-funds-as-he-wishes-13484927",
        "image_url": "https://e3.365dm.com/22/05/1920x1080/skynews-abramovich-roman-chelsea_5763393.jpg?20220507111901",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-12-17 18:32:00",
        "Headline": "The government has threatened to sue the former Chelsea FC owner if he does not hand over the profits from selling the club to help Ukrainians.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Through all the threats to sue by Sir Keir Starmer's government, Roman Abramovich has stayed silent and still sanctioned. The Russian's approval is needed to release the funds of the Chelsea sale to help the victims of the war in Ukraine. And the pressure - raised through the year and ratcheted up on Wednesday from Westminster - has not seen him give any indication about complying with the government's demands. Politics latest: Foreign secretary says Chelsea cash must be used for Ukraine victims As someone who rarely spoke publicly during his 19 years owning Chelsea, being largely quiet since being forced to sell up in 2022 after being sanctioned over his alleged links to Vladimir Putin is not unusual. Especially when speaking out could be risky for him and his family. Mr Abramovich has never condemned Russia's war on Ukraine or called for it to end - and he has never supported it publicly. \n                  Teachers to be trained to spot signs of misogyny in boys and teach about healthy relationships\n                 \n                  Jess Phillips on tackling violence against women and girls: 'I've tried to talk to my children about strangulation - it's not normal sexual behaviour'\n                 \n                  King meets Huntingdon train attack heroes, including guard who protected passengers\n                 There has only been an attempt to link him to peace talks early in the all-out war in 2022, while Turkey is reported to be one of his preferred bases. Wednesday's government news release was headlined: \"Government gives Abramovich final chance to pay £2.5bn to Ukraine or risk court action.\" But delayed accounts for Chelsea's former parent company from the Abramovich era were recently released, indicating he might not want to release all the sale proceeds, and there is actually £2.35bn in frozen funds. There is not the same assurance from a 2022 statement on Chelsea's website, which said: \"I will not be asking for any loans to be repaid.\" In fact, it says he would \"gift the net proceeds of sale, after allowing for other balance sheet items\". The accounts show there are £1.54bn of loans owed by the Fordstam former Chelsea parent company to Mr Abramovich's companies. If they were to be repaid, there would be £923m for humanitarian causes. Read more:Reeves threatens to sue Abramovich over Chelsea FC sale proceeds But when Sky News asked about this, Foreign Secretary Yvette Cooper said: \"It's clear that £2.5bn of the proceeds from the sale … was the commitment that was made as part of the agreement at that time.\" While Mr Abramovich has always said \"all victims of the war in Ukraine\", the government says it will only consider a proposal to send the cash to \"the most vulnerable in Ukraine\". But the government does now say: \"Any future gains earned by the foundation can be spent more broadly on victims of conflict worldwide.\" Could that provide leeway for Russians to eventually benefit from the funds or, even potentially, another cause, the victims of another conflict? We cannot ask Mr Abramovich questions about the fate of the funds, and his most recently named lawyers did not respond to emails requesting comment. There are notable unresolved issues impacting any sanctioned Russian oligarchs. Will the government be able to maintain sanctions if there is a Ukraine peace deal? And if Mr Abramovich fends off legal action long enough, could he eventually be able to spend the Chelsea funds as he wishes and be more associated with the benevolence?"
    },
    {
        "title": "Oscars set to leave ABC and will be streamed live on YouTube from 2029",
        "description": "The Oscars will be streamed live on YouTube from 2029 after being broadcast on the ABC network for decades.",
        "url": "https://news.sky.com/story/oscars-set-to-leave-abc-and-will-be-streamed-live-on-youtube-from-2029-13484929",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-oscar-statuettes-oscars_7113469.jpg?20251217220012",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-17 18:28:00",
        "Headline": "The Academy of Motion Picture Arts and Sciences announced the move on Wednesday, saying YouTube will have the exclusive global rights to the Oscars from 2029 to 2033.",
        "Content": "The Oscars will be streamed live on YouTube from 2029 after being broadcast on the ABC network for decades. It means the annual film awards will be available to the video-sharing platform's two billion users for free around the world in four years. The Academy of Motion Picture Arts and Sciences announced the deal with Google-owned YouTube on Wednesday, saying the streaming giant will have the exclusive global rights to the Hollywood awards from 2029 to 2033. YouTube will effectively be the home to all things Oscars, including red-carpet coverage, the Governors Awards and the Oscar nominations announcement. The Academy Awards ceremony has been broadcast by ABC for most of its history, but 2028 will be its last year showing the Oscars as they celebrate their 100th anniversary. \"The Oscars, including red carpet coverage, behind-the-scenes content, Governors Ball access, and more, will be available live and for free to over two billion viewers around the world on YouTube, and to YouTube TV subscribers in the United States,\" an announcement on the Academy Awards' website read. \"We are thrilled to enter into a multifaceted global partnership with YouTube to be the future home of the Oscars and our year-round academy programming,\" said academy chief executive Bill Kramer and academy president Lynette Howell Taylor. \n                  Diane Keaton's family issue statement as cause of death given\n                 \n                  Oscars 2025: Anora sweeps the Academy Awards with five awards including best picture\n                 \n                  Oscars backstage: Six highlights from the Academy Awards winners room\n                 They said the new partnership with the platform \"will allow us to expand access to the work of the academy to the largest worldwide audience possible\". 'Inspiring new generation of creativity and film lovers' \"The Oscars are one of our essential cultural institutions, honouring excellence in storytelling and artistry,\" said YouTube chief executive Neal Mohan. \"Partnering with the academy to bring this celebration of art and entertainment to viewers all over the world will inspire a new generation of creativity and film lovers while staying true to the Oscars' storied legacy.\" Read more from Sky News:Paramount backer pulls out of Warner Bros takeover bidSydney Sweeney on challenges women face to 'have it all' The awards will be available with audio tracks in many languages, in addition to closed captioning. Last year's Academy Awards were watched by 19.7 million viewers on the Disney-owned ABC, a five-year high but far below the show's biggest audience of 57 million in 1998. The network has been the broadcast home to the Oscars for almost its entire history. NBC first televised the Oscars in 1953, but ABC picked up the rights in 1961. Aside from a period between 1971 and 1975, when NBC again aired the show, the Oscars have been on ABC."
    },
    {
        "title": "Major motorway closure over Christmas period as part of £100m project",
        "description": "A large stretch of motorway running along the south coast of England will be closed for more than 10 days over the Christmas period so an underpass can be slid into place.",
        "url": "https://news.sky.com/story/major-motorway-closure-over-christmas-period-as-part-of-163100m-project-13484976",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-m27-underpass_7113460.jpg?20251217214336",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-17 21:28:00",
        "Headline": "A ready-made underpass weighing 8,500 tonnes will be installed underneath the M27 carriageway.",
        "Content": "A large stretch of motorway running along the south coast of England will be closed for more than 10 days over the Christmas period so an underpass can be slid into place. The M27 will be shut between junctions nine and 11 from 8pm on Christmas Eve until 4am on 4 January. During this time, a ready-made underpass weighing 8,500 tonnes will be installed underneath the carriageway, as part of a £100m project to upgrade junction 10 near Fareham, Hampshire. The upgrade will allow for more traffic for the Welborne Garden Village development, which will provide up to 6,000 new homes, along with schools and community services. As part of the works to create an \"all-moves\" junction, the pre-constructed concrete structure will be slid 65 metres into a trench cut into the motorway embankment. The carriageway will then be reconstructed above the new underpass while the motorway is closed. The structure is two and a half times heavier than HMS Victory, which the National Museum of the Royal Navy says is the oldest commissioned warship in the world. \n                  Teachers to be trained to spot signs of misogyny in boys and teach about healthy relationships\n                 \n                  Jess Phillips on tackling violence against women and girls: 'I've tried to talk to my children about strangulation - it's not normal sexual behaviour'\n                 \n                  King meets Huntingdon train attack heroes, including guard who protected passengers\n                 The M27 runs along the south coast between Cadnam and Cosham in Hampshire and connects Portsmouth and Southampton along the Solent. Read more from Sky News:'Prolonged' heavy rain bringing travel disruption and floodingWhat are nicotine pouches and are they safer than smoking? Lulu Bowerman, Hampshire County Council's cabinet member for highways, said: \"After months of meticulous planning, we are putting the final preparations in place for what will be a major and complex engineering operation. \"Once the M27 closes from 8pm on Christmas Eve, work will continue around the clock, 24 hours a day, seven days a week, to complete the job safely and as quickly as possible.\" Ms Bowerman noted that the signed diversion route along the A27 will be very busy, so motorists are advised to plan ahead \"and consider if you need to travel in this area at all\". \"The work has been planned at a time when traffic levels are lower, but we appreciate it will cause inconvenience, and we thank everyone for their understanding in advance as we deliver these vital improvements,\" she added. Andrew Jackson, National Highways programme manager, pointed out that these works \"allow us to accelerate this important scheme and stimulate economic growth across the region\"."
    },
    {
        "title": "Ethan McLeod: Macclesfield footballer dies in car accident on way back from game",
        "description": "Macclesfield footballer Ethan McLeod has died in a car accident on a motorway, the club have said.",
        "url": "https://news.sky.com/story/ethan-mcleod-macclesfield-footballer-dies-in-car-accident-on-way-back-from-game-13484810",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ethon-mcleod-macclesfield_7113103.jpg?20251217144359",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-17 13:27:00",
        "Headline": "The 21-year-old was travelling back from a National League North match away at Bedford Town when he was involved in an accident on the M1.",
        "Content": "Macclesfield footballer Ethan McLeod has died in a car accident on a motorway, the club have said. The 21-year-old forward was travelling back from a National League North match away at Bedford Town on Tuesday night when the accident happened on the M1. His white Mercedes collided with the nearside metal barrier close to junction 15 of the motorway at around 10.40pm. Northamptonshire Police said members of the public and officers tried to help but he died at the scene. McLeod signed for Macclesfield FC in July this year after a successful trial. He had previously spent a decade in the Wolverhampton Wanderers academy before leaving the West Midlands club in September last year. During the 2024/25 season, he had spells at Rushall and Stourbridge. He made his debut for Macclesfield in their league game against Chorley in September and had scored two goals in four appearances. 'Incredibly talented' player Paying tribute, the club described him as an \"incredibly talented\" member of the first team squad, with an \"infectious personality\". The club said in a statement: \"In giving his all in everything he did, Ethan effortlessly pushed us all to be the best we can be - both on and off the pitch.\" Ethan's death has \"devastated our entire club\", the statement also said, adding that his \"unique smile that mesmerised us all will never be forgotten\". \"May you rest in peace Ethan - you will forever be a Silkman.\" Read more from Sky News:UK to rejoin EU's Erasmus student exchange schemeTeenage boy charged over murder of nine-year-old girl Minute's silence planned Wolves paid tribute to McLeod in a post on X and announced they will hold a minute's silence at Saturday's Premier League match against Brentford. \"We are heartbroken by the tragic passing of Ethan McLeod at the age of 21,\" said Wolves. \"Ethan joined @WolvesAcademy at seven-years-old and went on to sign professional terms at the club, before leaving in September 2024. \"We are sending our thoughts and love to Ethan's family, friends and everyone at Macclesfield. Ethan's younger brother Conor is currently in our under-21 squad and the whole club will be providing care and support to him and his family.\" 'History-maker' Rushall said in their own statement: \"We are absolutely devastated to learn of the tragic passing of Ethan McLeod in the past 24 hours. \"Ethan was a history-maker for us, scoring the winning penalty against Peterborough Sports to send us to the first round of the FA Cup last season. \"His name will be etched into the history books of our club forever. We will be remembering Ethan at our home game against Leek Town on Saturday. Our thoughts are with all of Ethan's friends and family and Macclesfield FC at this tragic time. RIP Ethan.\" The Professional Footballers' Association posted on X: \"This is such tragic news. The thoughts of everyone at the PFA are with Ethan's family, friends, team-mates and loved ones. Rest In Peace, Ethan.\""
    },
    {
        "title": "Teachers to be trained to spot signs of misogyny in boys and teach about healthy relationships",
        "description": "Teachers will be trained to spot early signs of misogyny in boys and steer them away from it as part of the government's long-awaited strategy to tackle violence against women and girls (VAWG).",
        "url": "https://news.sky.com/story/schools-will-have-to-teach-about-healthy-relationships-to-tackle-misogyny-13484951",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/school-students-teachers_6967281.jpg?20251210151738",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-17 20:01:00",
        "Headline": "A range of measures are being unveiled as part of the government's long-awaited strategy to halve violence against women and girls in a decade.",
        "Content": "Teachers will be trained to spot early signs of misogyny in boys and steer them away from it as part of the government's long-awaited strategy to tackle violence against women and girls (VAWG). Sir Keir Starmer warned \"too often toxic ideas are taking hold early and going unchallenged\", with more than 40% of young men said to hold a positive view of misogynistic influencer Andrew Tate. He has been challenged about his ideology in the past and called the concerns \"garbage\". Sir Keir's government will formally unveil a £20m package of measures today, with £16m coming from the taxpayer and £4m from philanthropists and partners. Teachers will also get specialist training on how to talk to pupils about issues like consent and the dangers of sharing intimate images - and all secondary school pupils in England will be taught about healthy relationships. Such lessons will be mandatory by the end of this parliament in 2029, with schools to be chosen for a pilot scheme in 2026, which experts will be brought in to deliver. And an online helpline will be set up for teenagers with concerns about their own behaviour in relationships. The measures are part of the government's strategy to halve VAWG in a decade, and the prime minister said it's a \"responsibility we owe to the next generation\". \"Every parent should be able to trust that their daughter is safe at school, online and in her relationships,\" he said. \"This government is stepping in sooner - backing teachers, calling out misogyny, and intervening when warning signs appear - to stop harm before it starts.\" Department for Education-commissioned research found 70% of secondary school teachers surveyed said their school had actively dealt with sexual violence and/or harassment between children. VAWG minister Jess Phillips told Sky News political editor Beth Rigby she had spoken to her own children about what's normal sexual behaviour and what isn't because she knows \"what they might be exposed to\". She said if the government does nothing to intervene, VAWG could double rather than be halved. Read more: Teams deployed to tackle violence 'emergency'Domestic abuse survivors to get NHS help The government has already announced several other measures to tackle VAWG this week, including introducing specialist rape and sexual offences investigators to every police force, better support for survivors in the NHS, and a £19m funding boost for councils to provide safe housing for domestic abuse survivors. Investment 'falls short' But Dame Nicole Jacobs, the domestic abuse commissioner for England and Wales, said the commitments \"do not go far enough\" and schools are overburdened already. \"Today's strategy rightly recognises the scale of this challenge and the need to address the misogynistic attitudes that underpin it, but the level of investment to achieve this falls seriously short,\" she said. Claire Waxman, the incoming victims commissioner, added: \"Victim services are not an optional extra to this strategy - they must be the backbone of it. \"Without clear, sustainable investment and cross-government leadership, I am concerned we run the risk of the strategy amounting to less than the sum of its parts; a wish list of tactical measures rather than a bold, unifying strategic framework.\""
    },
    {
        "title": "Jess Phillips on tackling violence against women and girls: 'I've tried to talk to my children about strangulation - it's not normal sexual behaviour'",
        "description": "There have been three strategies by three successive governments to tackle violence against women and girls (VAWG) since 2010, and one refresh.",
        "url": "https://news.sky.com/story/jess-phillips-on-tackling-violence-against-women-and-girls-ive-tried-to-talk-to-my-children-about-strangulation-its-not-normal-sexual-behaviour-13485013",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jess-phillips-beth-rigby_7113553.jpg?20251218001825",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-12-17 22:49:00",
        "Headline": "At least one in every 12 women will be a victim of violence against women and girls, but the number is probably higher than that, as this sort of violence is typically underreported.",
        "Content": "\n          Political editor\n              @BethRigby\n There have been three strategies by three successive governments to tackle violence against women and girls (VAWG) since 2010, and one refresh. What has been the result of these endeavours? Police chiefs in 2024 described the scale of violence against women and girls as \"a national emergency\" as over one million incidents were reported in 2022/3, accounting for 20% of all police recorded crime. At least one in every 12 women will be a victim, but the number is probably higher than that, as this sort of violence is typically underreported. You will likely know a woman who is the victim of abuse. When you look at the situation, and think of all the mums, sisters, daughters, aunts and friends, it makes you want to put your head in your hands: strategy after strategy, plan after plan, women and girls and the victims of abuse are being let down. Today, the government will launch a new strategy, drawn up by Jess Phillips, the safeguarding minister, that will attempt to finally put this right. The promise is to halve violence against women and girls in a decade after what has been, as Phillips puts it, \"a catalogue of failures\". That catalogue of failures is long. Successive governments had \"failed to deliver a genuinely whole-of-government approach\", concluded the National Audit Office (NAO) at the beginning of this year, as it detailed a string of shortcomings when it came to VAWG plans: partial implementation; failure to learn from past strategies; no oversight of government funding being used for VAWG; a focus on victim support rather than prevention; and a lack of buy-in from government departments. Phillips, who spent her career campaigning for victims of domestic violence before becoming an MP, wants to break that chain with her new plan, which has three pillars: prevention, with a focus on boys and young men to challenge misogyny and promote healthy relationships; stopping abusers, with more efforts and power for police forces to track down abusers; and more victim support. It is a strategy that has been delayed three times. It was first expected in the spring, then the summer, to autumn, before eventually landing 18 months into a Labour government. The delays have drawn criticism from campaigners, frustrated they \"put more lives at risk\". Read more:Schools will teach about healthy relationships to tackle misogyny 'I'm going to be getting up in everybody's business' When I spoke to Phillips about those delays on the Electoral Dysfunction podcast, she made no apology for that: \"I could have hit the deadline and missed the point.\" \"I'm not really interested in a headline that says, 'minister delivers a strategy one time',\" she said, explaining she'd had to \"bang heads together\" in different government departments to get buy-in and coordination (something the NAO said previous strategies lacked). Phillips said the strategy contains a written action plan with time frames in it, as she insists the target to halve VAWG can be hit within the decade, despite the delay. There will be an inter-ministerial VAWG group to improve cross-government working. She said: \"What we have been doing is going into other government departments and building up relationships with their teams. We have VAWG-specific staff in Number 10 now. That's never existed before. And we have been in the Department of Health. We have been in the Department of Transport. The real answer is I'm going to be getting up in everybody's business. That's the reason it has taken so long.\" Strategy also focuses on men and boys Speaking to Phillips, you cannot doubt her determination to make it a reality, and much of this strategy focuses on men and boys as well as women and girls, with a big focus on prevention and stopping abuse. \"I would be failing, we would be failing, if we didn't try to prevent people who were already perpetrating - and stopping people becoming perpetrators in the first place,\" she said. That involves the classroom and more conversations and bringing in men and boys to make them feel they are part of this. Risk of 'doubling' VAWG When I point out to Phillips that one in four 18 to 29-year-olds had favourable views towards Andrew Tate, she was quick to make the point that three out of four don't. \"If we don't do something about the situation with what young people, both victims and perpetrators, are exposed to, then not only would we not halve [VAWG in a decade], but I would also be talking about the risk of doubling it,\" she said. 'I have spoken to my children in really explicit terms' What struck me in our conversation, and as a mum of two teenagers myself, is the role Phillips said we all need to take in talking to our children about what they are being exposed to online. Phillips points out that the age profile of perpetrators is dropping as younger people become more exposed to violent pornography. One of the elements in the strategy is to ban strangulation in porn. Another is to have mandatory guidance in secondary schools to offer lessons on culture, increasing awareness of artificial intelligence and how pornography links to misogyny. Phillips, who has two sons, said it's incumbent on all of us to have those conversations with our kids about what is normal sexual behaviour and what is not. \"I have spoken to my children in really explicit terms about the things that I think they might be seeing and think as standardised in sexual practice,\" she told me. \"I have tried to talk to them about things like strangulation. I have said it is totally and utterly not like normal sexual behaviour because I know what they might be exposed to.\" Criticism over handling of grooming gangs But as a campaigner around domestic violence and now a minister charged with halving VAWG, Phillips has also faced criticism over the government's handling of grooming gangs. Fiona Goddard, who was abused by an organised street gang in Bradford, quit her role on the victims panel in the autumn and called for the resignation of the minister over her handling of the inquiry setup, which Phillips admitted she found personally difficult. She said: \"I'm not going to lie and pretend that it's nice when the thing that you care the most about in the world is the thing you are criticised for. And actually, when Fiona Goddard does that, I just take it. Fiona Goddard has every right to criticise me. When other people who never have done a bar's work in this area, but want to use that to politically criticise, I think that's cynical. \"One of the things that I think has been hardest about this process is that I am held to a different standard to literally everybody else. Now of course I should be held to a different standard because let's be honest, Beth, I'm better than most people who've had my job before because of my experience.\" 'The strategy isn't the end, it's the beginning' Phillips, the victim herself of a torrent of online abuse from Elon Musk over grooming gangs earlier this year, before the latest furore over the setting up of the national inquiry, now has police protection. I wonder whether the launch of the strategy might be the moment Phillips steps back, but she's having none of it. \"The strategy isn't the end, it's the beginning. There's a lot of work to do. I would be lying if I didn't say it didn't have a mental toll on me, but I am not the only person doing this work, it isn't all on me… the upside is better, it's worth it,\" she said. The strategy Phillips is spearheading is the fourth in 15 years. After a series of false starts, Phillips insisted this time it will be different. For the sake of our women and our girls, I hope she is right."
    },
    {
        "title": "King meets Huntingdon train attack heroes, including guard who protected passengers",
        "description": "The King has met survivors of last month's Huntingdon train mass stabbing, during a special reception at Buckingham Palace.",
        "url": "https://news.sky.com/story/king-meets-huntingdon-train-attack-heroes-including-guard-who-protected-passengers-from-being-stabbed-13484868",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-train-king_7113338.jpg?20251217192049",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-17 15:57:00",
        "Headline": "More than 10 people were hurt in the attack on the 6.25pm service from Doncaster to London King's Cross on 1 November.",
        "Content": "The King has met survivors of last month's Huntingdon train mass stabbing, during a special reception at Buckingham Palace. He shook hands with train guard Samir Zitouni, who was seriously injured as he stepped in to protect passengers. More than 10 people were hurt in the stabbing on the 6.25pm LNER service from Doncaster to London King's Cross on 1 November, which diverted to Huntingdon. The monarch also met Andrew Johnson, who previously served in the Royal Navy, and was driving the service at the time of the attack. He was praised by Prime Minister Sir Keir Starmer for his quick thinking when he moved the train on to a slow line. That decision allowed it to stop at Huntingdon station, leading to a quicker response time by emergency services and potentially saving lives. Mr Zitouni was credited with saving multiple lives, but was left in a critical condition due to injuries he suffered in the attack. \n                  Man accused of Huntingdon train stabbings refuses to attend court\n                 \n                  Man attempts train hijack a week after Huntingdon stabbings\n                 \n                  Huntingdon train stabbing victim 'didn't have much choice' but to fight back\n                 Stephen Crean, a football fan who had been returning home after watching Nottingham Forest's 2-2 draw with Manchester United, was also injured while fighting back to protect others during the incident. Mr Crean said he would need plastic surgery following his injuries. Amira Ostalski, a student who suddenly found herself in danger, said she ran into the buffet car where she picked up a metal tray to protect herself and her friend. \"I was honestly so petrified. I thought in that moment it was the last time I was ever going to be alive. I thought I was going to die,\" she said. Anthony Williams was charged with 10 counts of attempted murder, one count of actual bodily harm and one count of possession of a bladed article following the train attack. He remains in custody pending further court hearings scheduled for next year."
    },
    {
        "title": "Aria Thorpe: Images released of girl, 9, stabbed to death - as boy appears in court charged with murder",
        "description": "Police have released photos of nine-year-old Aria Thorpe, who was stabbed to death in Somerset.",
        "url": "https://news.sky.com/story/boy-charged-with-murder-of-nine-year-old-girl-as-victim-named-13484630",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-aria-thorpe-killed_7113294.jpg?20251217175951",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-17 08:17:00",
        "Headline": "A 15-year-old boy, who cannot be named because of his age, has been charged with murdering Aria Thorpe in Weston-super-Mare. It's believed she died from a single stab wound.",
        "Content": "Police have released photos of nine-year-old Aria Thorpe, who was stabbed to death in Somerset. One image shows the girl in a white sleeveless top and wearing a hairband with Minnie Mouse-style ears. The other picture is of Aria in a pink dress, wearing a rosette and \"happy birthday\" headband, surrounded by balloons. Her family approved the release of the images. It comes as a teenage boy appeared in court charged with the girl's murder. Aria died after suffering a single stab wound on Monday, Avon and Somerset Police said. Emergency services were called to Lime Close in Weston-super-Mare at 6.09pm but Aria was pronounced dead at the scene. A 15-year-old boy, who cannot be named because of his age, appeared at Bristol Magistrates' Court on Wednesday charged with her murder. During a brief hearing, he spoke only to confirm his name, address and date of birth. He was remanded into youth detention accommodation ahead of a hearing at Bristol Crown Court on Friday. A police cordon remains in place at the scene of Aria's death as forensics officers continue their work. Read more from Sky News:NHS facing 'worst-case scenario' as doctors strikeArrests over plot to steal 'tonnes' of charity clothes to fund crime Superintendent Jen Appleford, from Avon and Somerset Police, said the community was in shock and Aria's family were being supported by police. \"It is impossible to adequately describe how traumatic the past 36 hours have been for them and we'd like to reiterate in the strongest possible terms their request for privacy,\" she said. Supt Appleford said police were working with local schools and other agencies to make sure support is available."
    },
    {
        "title": "Duke of Marlborough charged with strangulation offences",
        "description": "The&#160;Duke&#160;of Marlborough has been charged with intentional strangulation.",
        "url": "https://news.sky.com/story/duke-of-marlborough-charged-with-strangulation-offences-13484547",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-duke-of-marlborough_7112875.jpg?20251217113011",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-17 00:01:00",
        "Headline": "The 70-year-old has been summonsed to appear at Oxford Magistrates' Court on Thursday, following his arrest in May last year.",
        "Content": "The Duke of Marlborough has been charged with intentional strangulation. Charles James Spencer-Churchill, a relative of Sir Winston Churchill and Diana, Princess of Wales, is accused of three offences between November 2022 and May 2024, Thames Valley Police said. The 70-year-old has been summonsed to appear at Oxford Magistrates' Court on Thursday, following his arrest in May last year. The three charges of non-fatal intentional strangulation are alleged to have taken place in Woodstock, Oxfordshire, against the same person. Spencer-Churchill is the 12th Duke of Marlborough and a member of one of Britain's most aristocratic families. He inherited his dukedom in 2014, following the death of his father, the 11th Duke of Marlborough. Read more from Sky News:UK to rejoin Erasmus in 2027Inflation falls by more than expected Prior to this, Spencer-Churchill was the Marquess of Blandford, and also known as Jamie Blandford. His ancestral family home is Sir Winston's birthplace, the 300-year-old Blenheim Palace in Woodstock. But the duke does not own the 18th-century baroque palace - and has no role in the running of the residence and vast estate. The duke's representatives have been approached for comment."
    },
    {
        "title": "Ethan McLeod: Macclesfield footballer dies in car accident on way back from game",
        "description": "Macclesfield footballer Ethan McLeod has died in a car accident on a motorway, the club have said.",
        "url": "https://news.sky.com/story/ethan-mcleod-macclesfield-footballer-dies-in-car-accident-on-way-back-from-game-13484810",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ethon-mcleod-macclesfield_7113103.jpg?20251217144359",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-17 13:27:00",
        "Headline": "The 21-year-old was travelling back from a National League North match away at Bedford Town when he was involved in an accident on the M1.",
        "Content": "Macclesfield footballer Ethan McLeod has died in a car accident on a motorway, the club have said. The 21-year-old forward was travelling back from a National League North match away at Bedford Town on Tuesday night when the accident happened on the M1. His white Mercedes collided with the nearside metal barrier close to junction 15 of the motorway at around 10.40pm. Northamptonshire Police said members of the public and officers tried to help but he died at the scene. McLeod signed for Macclesfield FC in July this year after a successful trial. He had previously spent a decade in the Wolverhampton Wanderers academy before leaving the West Midlands club in September last year. During the 2024/25 season, he had spells at Rushall and Stourbridge. He made his debut for Macclesfield in their league game against Chorley in September and had scored two goals in four appearances. 'Incredibly talented' player Paying tribute, the club described him as an \"incredibly talented\" member of the first team squad, with an \"infectious personality\". The club said in a statement: \"In giving his all in everything he did, Ethan effortlessly pushed us all to be the best we can be - both on and off the pitch.\" Ethan's death has \"devastated our entire club\", the statement also said, adding that his \"unique smile that mesmerised us all will never be forgotten\". \"May you rest in peace Ethan - you will forever be a Silkman.\" Read more from Sky News:UK to rejoin EU's Erasmus student exchange schemeTeenage boy charged over murder of nine-year-old girl Minute's silence planned Wolves paid tribute to McLeod in a post on X and announced they will hold a minute's silence at Saturday's Premier League match against Brentford. \"We are heartbroken by the tragic passing of Ethan McLeod at the age of 21,\" said Wolves. \"Ethan joined @WolvesAcademy at seven-years-old and went on to sign professional terms at the club, before leaving in September 2024. \"We are sending our thoughts and love to Ethan's family, friends and everyone at Macclesfield. Ethan's younger brother Conor is currently in our under-21 squad and the whole club will be providing care and support to him and his family.\" 'History-maker' Rushall said in their own statement: \"We are absolutely devastated to learn of the tragic passing of Ethan McLeod in the past 24 hours. \"Ethan was a history-maker for us, scoring the winning penalty against Peterborough Sports to send us to the first round of the FA Cup last season. \"His name will be etched into the history books of our club forever. We will be remembering Ethan at our home game against Leek Town on Saturday. Our thoughts are with all of Ethan's friends and family and Macclesfield FC at this tragic time. RIP Ethan.\" The Professional Footballers' Association posted on X: \"This is such tragic news. The thoughts of everyone at the PFA are with Ethan's family, friends, team-mates and loved ones. Rest In Peace, Ethan.\""
    },
    {
        "title": "If Abramovich fends off legal action long enough, could he eventually be able to spend Chelsea funds as he wishes?",
        "description": "Through all the threats to sue by Sir Keir Starmer's government, Roman Abramovich has stayed silent and still sanctioned.",
        "url": "https://news.sky.com/story/if-abramovich-fends-off-legal-action-long-enough-could-he-eventually-be-able-to-spend-chelsea-funds-as-he-wishes-13484927",
        "image_url": "https://e3.365dm.com/22/05/1920x1080/skynews-abramovich-roman-chelsea_5763393.jpg?20220507111901",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-12-17 18:32:00",
        "Headline": "The government has threatened to sue the former Chelsea FC owner if he does not hand over the profits from selling the club to help Ukrainians.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Through all the threats to sue by Sir Keir Starmer's government, Roman Abramovich has stayed silent and still sanctioned. The Russian's approval is needed to release the funds of the Chelsea sale to help the victims of the war in Ukraine. And the pressure - raised through the year and ratcheted up on Wednesday from Westminster - has not seen him give any indication about complying with the government's demands. Politics latest: Foreign secretary says Chelsea cash must be used for Ukraine victims As someone who rarely spoke publicly during his 19 years owning Chelsea, being largely quiet since being forced to sell up in 2022 after being sanctioned over his alleged links to Vladimir Putin is not unusual. Especially when speaking out could be risky for him and his family. Mr Abramovich has never condemned Russia's war on Ukraine or called for it to end - and he has never supported it publicly. \n                  Teachers to be trained to spot signs of misogyny in boys and teach about healthy relationships\n                 \n                  Jess Phillips on tackling violence against women and girls: 'I've tried to talk to my children about strangulation - it's not normal sexual behaviour'\n                 \n                  King meets Huntingdon train attack heroes, including guard who protected passengers\n                 There has only been an attempt to link him to peace talks early in the all-out war in 2022, while Turkey is reported to be one of his preferred bases. Wednesday's government news release was headlined: \"Government gives Abramovich final chance to pay £2.5bn to Ukraine or risk court action.\" But delayed accounts for Chelsea's former parent company from the Abramovich era were recently released, indicating he might not want to release all the sale proceeds, and there is actually £2.35bn in frozen funds. There is not the same assurance from a 2022 statement on Chelsea's website, which said: \"I will not be asking for any loans to be repaid.\" In fact, it says he would \"gift the net proceeds of sale, after allowing for other balance sheet items\". The accounts show there are £1.54bn of loans owed by the Fordstam former Chelsea parent company to Mr Abramovich's companies. If they were to be repaid, there would be £923m for humanitarian causes. Read more:Reeves threatens to sue Abramovich over Chelsea FC sale proceeds But when Sky News asked about this, Foreign Secretary Yvette Cooper said: \"It's clear that £2.5bn of the proceeds from the sale … was the commitment that was made as part of the agreement at that time.\" While Mr Abramovich has always said \"all victims of the war in Ukraine\", the government says it will only consider a proposal to send the cash to \"the most vulnerable in Ukraine\". But the government does now say: \"Any future gains earned by the foundation can be spent more broadly on victims of conflict worldwide.\" Could that provide leeway for Russians to eventually benefit from the funds or, even potentially, another cause, the victims of another conflict? We cannot ask Mr Abramovich questions about the fate of the funds, and his most recently named lawyers did not respond to emails requesting comment. There are notable unresolved issues impacting any sanctioned Russian oligarchs. Will the government be able to maintain sanctions if there is a Ukraine peace deal? And if Mr Abramovich fends off legal action long enough, could he eventually be able to spend the Chelsea funds as he wishes and be more associated with the benevolence?"
    },
    {
        "title": "Major motorway closure over Christmas period as part of £100m project",
        "description": "A large stretch of motorway running along the south coast of England will be closed for more than 10 days over the Christmas period so an underpass can be slid into place.",
        "url": "https://news.sky.com/story/major-motorway-closure-over-christmas-period-as-part-of-163100m-project-13484976",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-m27-underpass_7113460.jpg?20251217214336",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-17 21:28:00",
        "Headline": "A ready-made underpass weighing 8,500 tonnes will be installed underneath the M27 carriageway.",
        "Content": "A large stretch of motorway running along the south coast of England will be closed for more than 10 days over the Christmas period so an underpass can be slid into place. The M27 will be shut between junctions nine and 11 from 8pm on Christmas Eve until 4am on 4 January. During this time, a ready-made underpass weighing 8,500 tonnes will be installed underneath the carriageway, as part of a £100m project to upgrade junction 10 near Fareham, Hampshire. The upgrade will allow for more traffic for the Welborne Garden Village development, which will provide up to 6,000 new homes, along with schools and community services. As part of the works to create an \"all-moves\" junction, the pre-constructed concrete structure will be slid 65 metres into a trench cut into the motorway embankment. The carriageway will then be reconstructed above the new underpass while the motorway is closed. The structure is two and a half times heavier than HMS Victory, which the National Museum of the Royal Navy says is the oldest commissioned warship in the world. \n                  Teachers to be trained to spot signs of misogyny in boys and teach about healthy relationships\n                 \n                  Jess Phillips on tackling violence against women and girls: 'I've tried to talk to my children about strangulation - it's not normal sexual behaviour'\n                 \n                  King meets Huntingdon train attack heroes, including guard who protected passengers\n                 The M27 runs along the south coast between Cadnam and Cosham in Hampshire and connects Portsmouth and Southampton along the Solent. Read more from Sky News:'Prolonged' heavy rain bringing travel disruption and floodingWhat are nicotine pouches and are they safer than smoking? Lulu Bowerman, Hampshire County Council's cabinet member for highways, said: \"After months of meticulous planning, we are putting the final preparations in place for what will be a major and complex engineering operation. \"Once the M27 closes from 8pm on Christmas Eve, work will continue around the clock, 24 hours a day, seven days a week, to complete the job safely and as quickly as possible.\" Ms Bowerman noted that the signed diversion route along the A27 will be very busy, so motorists are advised to plan ahead \"and consider if you need to travel in this area at all\". \"The work has been planned at a time when traffic levels are lower, but we appreciate it will cause inconvenience, and we thank everyone for their understanding in advance as we deliver these vital improvements,\" she added. Andrew Jackson, National Highways programme manager, pointed out that these works \"allow us to accelerate this important scheme and stimulate economic growth across the region\"."
    },
    {
        "title": "Two arrested after shouting 'intifada' slogans, police say",
        "description": "Two people have been arrested after shouting slogans calling for \"intifada\", the Metropolitan Police said.",
        "url": "https://news.sky.com/story/two-arrested-after-shouting-intifada-slogans-police-say-13484765",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-palestine-bondi-beach_7112927.jpg?20251217121136",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-17 11:51:00",
        "Headline": "Police in Manchester and London say \"the context has changed\" after violence against Jewish people in Sydney and the UK. ",
        "Content": "Two people have been arrested after shouting slogans calling for \"intifada\", the Metropolitan Police said. The arrests came during a protest by pro-Palestinian demonstrators outside the Ministry of Justice in Westminster, London, on Wednesday evening. A third person was arrested for \"obstructing\" police as they made the first two arrests for the chanting. The Met later confirmed two further arrests for public order offences, one of which was racially aggravated - bringing the total arrested to five. It comes after police in London and Manchester said protesters face arrest for chanting the slogan \"globalise the intifada\" in the wake of the Bondi Beach terrorist attack. Greater Manchester Police (GMP) and Metropolitan Police bosses released a joint statement after two gunmen killed 15 people as they targeted Jewish people gathered to celebrate Hanukkah in Sydney. It came around two months after two people were killed in a terrorist attack at the Heaton Park Synagogue in Manchester. Follow live: Alleged gunman charged The chief rabbi, Sir Ephraim Mirvis is among high-profile voices to demand action against hate speech seen at regular pro-Palestinian marches in the UK after the Bondi Beach attack. He said it must be made clear slogans such as \"globalise the intifada\" are \"unlawful\", adding that both the Sydney and Manchester attacks show the potential consequences of such words. Reacting to news that protesters face arrest if they use the slogan, Sir Ephraim said on X: \"This announcement is a most welcome development, and an important step towards challenging the hateful rhetoric we have seen on our streets, which has inspired acts of violence and terror.\" Intifada means \"uprising\" in Arabic and refers to two specific Palestinian uprisings against Israel, first in the late 1980s and then in the early 2000s. Thousands of people were killed, according to several estimates. Met Commissioner Sir Mark Rowley and GMP Chief Constable Sir Stephen Watson said in a statement: \"We know communities are concerned about placards and chants such as 'globalise the intifada' and those using it at future protest or in a targeted way should expect the Met and GMP to take action. \"Violent acts have taken place, the context has changed - words have meaning and consequence. We will act decisively and make arrests.\" The move has been welcomed by Jewish groups, including the Community Security Trust, a charity which provides protection for Jews in Britain, which said the announcement came \"not a moment too soon\". But Ben Jamal, from the Palestine Solidarity Campaign, said it \"marks another low in the political repression of protest for Palestinian rights\". Read more:Who were the suspected gunmen in Bondi beach attack?Mourners pay respect at victim's funeral On Tuesday, the Met said it imposed conditions on a pro-Palestine protest near the BBC headquarters in central London because it would have caused \"serious disruption to the lives of Jewish Londoners attending a nearby synagogue and a private Hannukah event in the immediate vicinity\". Later, the Met said two people had been arrested for shouting 'intifada' during a protest outside the Ministry of Justice. Sajid Akram, 50, was shot dead by police after opening fire on 1,000 people in the Archer Park area of Bondi Beach on Sunday evening, while his son Naveed, 24, has been charged with 59 offences, including 15 counts of murder and committing a terrorist attack. Sir Keir Starmer has acknowledged the Bondi Beach attack was not an \"isolated incident\" but part of a pattern of incidents focused on Jewish holy days. Justice minister Alex Davies-Jones suggested people should refrain from using chants such as \"globalise the intifada\" and \"from the river to the sea\". The use of \"from the river to the sea\" has drawn anger from some pro-Israel supporters, who argue the phrase calls for the eradication of the Israeli state. Mr Davies-Jones told Sky News \"any chants that are designed to intimidate, call for violence, call for the murder of Jews, are totally unacceptable\"."
    },
    {
        "title": "UK weather: Warning of 'prolonged' heavy rain bringing travel disruption and flooding ",
        "description": "Britons have been warned to prepare for additional heavy rainfall following a severe weather system that led to dense fog and flight cancellations.",
        "url": "https://news.sky.com/story/uk-weather-warning-of-prolonged-heavy-rain-bringing-travel-disruption-and-flooding-13484745",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-uk-winter-weather-fog_7113010.jpg?20251217131736",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-17 15:08:00",
        "Headline": "The Met Office says it is too soon to confirm if Britain will see a white Christmas though cold weather looks \"less likely\", as more heavy rain approaches. ",
        "Content": "Britons have been warned to prepare for additional heavy rainfall following a severe weather system that led to dense fog and flight cancellations. Forecasters said a low-pressure system had brought extreme weather to much of the UK, with heavy rain and localised flooding expected to continue into Thursday. The Met Office issued a yellow warning for heavy falls in England's southeast and parts of Wales on Tuesday, with the high ground of Dartmoor and the hills of south Wales predicted to see 40-60mm of rain. Check the forecast for your area The alert is also in place for Thursday, with South Wales and Dartmoor again predicted to see the highest rainfall, of 40-50mm, accompanied by strong winds. England's south coast, including Portsmouth and Brighton, has also been slapped with a yellow warning for Thursday, with heavier rain expected after midday. The Downs could be hit by as many as 40-50mm of rain, the Met Office said, though most areas should expect 15-25mm. \n                  2025 is the UK's sunniest year ever - with record levels for solar power\n                 \n                  UK weather: Heavy rain and flooding to hit parts of UK as new warning issued\n                 \n                  UK weather: 'Danger to life' warning as heavy rain and floods set to hit parts of country this weekend\n                 Heavy fog across much of England's south on Wednesday morning resulted in at least seven flights from London City Airport being cancelled. However, the airport's normal operations had resumed by 10am. A yellow warning for fog was in place until 10am this morning for large parts of central and northern England. Sky News Weather meteorologist Dr Chris England said more rain would spread from the west eastwards this afternoon, bringing the risk of further travel disruptions. \"Britain will see a band of prolonged and locally heavy rain spreading from the west this afternoon, clearing through the currently mainly dry south-east overnight,\" he said. \"The rain, heaviest over south-western hills and falling on already saturated ground, will bring a risk of localised flooding and travel disruption, especially to parts of southern Wales and the West Country.\" Read More:The UK has recorded its sunniest year on recordHeavy rain and flooding to hit parts of UK Dr England said more rain would be in store on Saturday, following a drier Friday. \"A further rain band spreading across all of Britain from the south-west tomorrow will bring a renewed risk of disruption there, with the risk extending to much of southern England later,\" Dr England said. \"Friday looks drier, but there'll be more rain on Saturday.\" Can Britain expect a white Christmas? High pressure is expected to build into next week, the Met Office has predicted, bringing drier and colder conditions for the week of Christmas. Britons can expect probable overnight frosts, mist and more fog, though significant cold weather looks less likely. The Met Office said on Tuesday that it was too early to confirm if there would be snow on Christmas Day, though it would update its forecasts when more information comes in."
    },
    {
        "title": "Pivotal talks for the future of the Ukraine war take place today - here's why they matter",
        "description": "EU leaders will meet in Brussels today to try to agree the release of &#8364;210bn (&#163;184bn) to help fund Ukraine's war with Russia.",
        "url": "https://news.sky.com/story/pivotal-talks-for-the-future-of-the-ukraine-war-take-place-today-heres-why-they-matter-13484969",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-volodymyr-zelenskyy_7113475.jpg?20251217220057",
        "type": "World",
        "Author": "Alistair Bunkall, Europe correspondent in Brussels",
        "Date Published": "2025-12-17 21:07:00",
        "Headline": "Thursday is a crucial day for Ukraine's European allies as they look to prove they still have a major role to play in shaping the future of the conflict - with or without the backing of US President Donald Trump.",
        "Content": "By Alistair Bunkall, Europe correspondent in Brussels  EU leaders will meet in Brussels today to try to agree the release of €210bn (£184bn) to help fund Ukraine's war with Russia. The money, which comes from Russian assets frozen after Moscow's full-scale invasion of Ukraine in 2022, is mostly held in the Belgian-headquartered clearing house, Euroclear. The money is seen as vital to Ukraine's ability to keep fighting, because the country faces bankruptcy in early 2026 if it doesn't receive more international assistance. That means Kyiv would no longer be able to pay soldiers, police and civil servants or buy weapons to defend itself. Latest updates on Ukraine war Last night, Volodymyr Zelenskyy, who is expected to brief the EU leaders today, wrote on X: \"The result Europe produces - must make Russia feel that its desire to continue the war next year is pointless, because Ukraine will have support. This rests entirely with Europe.\" The Belgian government has so far prevented the move amid fears it will expose the small country to Russian legal action in the future. The EU is racing to find solutions to Belgium's concerns, including passing an emergency bill that secures the sanctions against Russia indefinitely, superseding the need to renew them every six months and thereby insulating it from veto votes from Russian-leaning EU member states like Hungary and Slovakia. Belgium also wants guarantees that all EU members will share any financial cost of Russian action against it. Why the push to use Russian assets? The US, which has so far given billions of dollars to Kyiv, is losing interest under Donald Trump and can no longer be relied upon for financial support. Previously, the EU had been giving the interest generated from the frozen assets to Ukraine, but was worried it might destabilise the Eurozone economy if it touched the assets itself. That has changed, however, as Ukraine's need has become more acute and fears over Russia's wider imperialist ambitions have grown in recent months. This unlocking of seized Russian assets is also being seen as a way to buy Brussels more leverage in peace negotiations, as well as reducing Kyiv's dependency on Washington. Read more:South Africans fighting for RussiaRussia trying to 'bully' UK and allies German Chancellor Friedrich Merz, who has been leading the campaign to release the funds, warned that \"Europe would be severely damaged for years\" if they fail to pass the vote and \"this step is not about prolonging the war but about bringing the war to an end as soon as possible\". In short, the consequences of using the frozen assets are now considered less risky than the consequences of not taking this action. What's at stake? Trump wanted the money to be invested in two US investment funds, something the EU rejects. The US president has recently been scathing of European leaders, and the EU sees Thursday's meeting as an opportunity to show its strength and unity. In theory, the EU could pass the policy by majority vote, thereby sidelining the Belgian government, but officials are reluctant to go down this path for fear of alienating Belgium and causing a diplomatic rift in the alliance. Much is riding on the meeting. If the EU fails to pass the vote, its credibility will take a severe blow. It will likely become even more irrelevant in peace talks, and Vladimir Putin might look to take advantage of a divided Europe."
    },
    {
        "title": "Police charge alleged Bondi Beach attacker - as funerals begin for victims",
        "description": "One of the alleged gunmen in the killing of 15 people on Bondi Beach has been charged.",
        "url": "https://news.sky.com/story/bondi-beach-shooting-funerals-begin-for-victims-with-alleged-gunman-set-to-be-charged-13484582",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sydney-australia_7112548.jpg?20251217043449",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-17 04:03:00",
        "Headline": "Naveed Akram - who's said to have carried out the attack with his father - has been charged with 59 offences, including 15 counts of murder and a terror charge.",
        "Content": "One of the alleged gunmen in the killing of 15 people on Bondi Beach has been charged. Naveed Akram, 24, faces 59 counts, including 15 of murder and a terror charge. The other alleged attacker, his 50-year-old father Sajid, died at the scene in Sydney. The charges came as people gathered for funerals three days after Sunday's terror attack shocked Australia and intensified concerns about rising antisemitism. Some 22 victims remain in hospital following the shooting, carried out at an event marking the start of the Jewish celebration of Hanukkah. At the first of the funerals, relatives mourned the death of British-born Rabbi Eli Schlanger, a 41-year-old father of five, who organised the Chanukah by the Sea event. Often speaking through tears, his father-in-law, Rabbi Yehoram Ulman, expressed his \"biggest regret\" that he \"could have done more\" to tell him \"how much we love him\". \"I hope he knew that. I'm sure he knew it,\" he added. \"But I think it should've been said more often.\" The father of 10-year-old victim Matilda, whose surname has been withheld at her family's request, spoke at a vigil on Tuesday night. Local media reported him as saying: \"We came here from Ukraine… and I thought that Matilda is the most Australian name that can ever exist. \"So just remember the name, remember her.\" Read more: Who were the suspected gunmen? Police have said the two alleged gunmen - who were shot by officers - were motivated by Islamic State ideology. A recent trip to the Philippines is under investigation. The older Akram used an Indian passport to travel, while his son used an Australian one. The Akrams stayed at the GV Hotel in Davao from 1 November to 28 November, according to a source, who said police had visited on Wednesday. The pair are said to have only left their rooms for meals and no one was seen visiting them. Davao is in an area associated with Islamic extremism but a spokesman for the president of the Philippines said he rejected the claim the country is an \"ISIS training hotspot\". New South Wales to debate gun reforms The Australian government and intelligence services have come under pressure because the alleged attackers were legally able to acquire the high-powered rifles and shotguns used in the attack. Prime Minister Anthony Albanese has vowed to toughen the country's gun laws after its deadliest mass shooting in three decades, and the state parliament in New South Wales will reconvene next week to discuss reforms. They include capping the number of guns allowed by a single person and making some shotguns harder to access. State premier Chris Minns told a news conference: \"We've got a monumental task in front of us. It's huge. \"It's a huge responsibility to pull the community together. \"We need a summer of calm and togetherness, not division.\" Mr Albanese has vowed to work with the Jewish community to \"stamp out and eradicate antisemitism\". The prime minister has been accused of not doing enough to prevent its spread since the war in Gaza began two years ago. Fellow world leaders have expressed their shock and anguish since the attack, including British Prime Minister Sir Keir Starmer, who hosted a Hanukkah event at Downing Street on Tuesday. And speaking at the White House last night, US President Donald Trump said: \"We join in mourning all of those who were killed, and we're praying for the swift recovery of the wounded.\""
    },
    {
        "title": "Trump says the quiet part out loud - and seems to have three aims for Venezuela",
        "description": "Donald Trump has said the quiet stuff out loud. His Tuesday evening social media post on Venezuela feels like an offload, a dump of thoughts. But it is nonetheless very revealing.",
        "url": "https://news.sky.com/story/trump-says-the-quiet-part-out-loud-and-seems-to-have-three-ultimate-aims-for-venezuela-13484579",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-us-president_7112545.jpg?20251217022957",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-12-17 01:51:00",
        "Headline": "On the face of it, it's all part of an anti-drug mission, to counter the drug trade from Venezuela into America. At least that's the public messaging. And the missile and drone attacks on suspected drug boats in the region are all part of the play.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n Donald Trump has said the quiet stuff out loud. His Tuesday evening social media post on Venezuela feels like an offload, a dump of thoughts. But it is nonetheless very revealing. \"Venezuela is completely surrounded by the largest Armada ever assembled in the History of South America,\" the US president says. \"It will only get bigger, and the shock to them will be like nothing they have ever seen before…\" That's a reference to the massive US naval and Air Force presence in the Caribbean off Venezuela. It is indeed an armada, and it's been there for months now. On the face of it, it's all part of an anti-drug mission, to counter the drug trade from Venezuela into America. At least that's the public messaging. And the missile and drone attacks on suspected drug boats in the region are all part of the play. And that's why the second part of his post is particularly interesting, because he now appears to be saying out loud what plenty have suspected all along - that this is actually about regime change, and it is about oil far more than it is about drugs. He says that the military will remain in place \"until such time as they [Venezuela] return to the United States of America all of the Oil, Land, and other Assets that they previously stole from us\". He continues: \"The illegitimate Maduro Regime is using Oil from these stolen Oil Fields to finance themselves, Drug Terrorism, Human Trafficking, Murder, and Kidnapping.\" This is a reference to the fact that the US was once a huge importer of Venezuelan oil. American companies based in the country extracted the oil and refineries on the Texan coast processed it. The refineries were adapted over decades to refine the thick, heavy crude that is typical of Venezuela. The process was big business for American firms until Venezuela, under Hugo Chavez in the 2000s, nationalised the foreign oil assets. Read more:The US-Venezuela crisis explained Trump wants all that back - the oil, the revenue, the influence. So all this, it seems clear now, is about oil, and it is about spheres of influence - hemispheres. Trump is determined to assert American control over the western hemisphere. The ultimate ambition it seems is threefold: • To remove the Maduro regime and support a friendly, compliant government;• To seize control of the oil, through commercial partnerships, not force;• And to stop any drug and people smuggling into the US. With this latest social post, Trump has now said all that out loud. Interesting days ahead are certain."
    },
    {
        "title": "Finnish PM apologises over 'slanted eyes' controversy after 'racist' post by Miss Finland",
        "description": "The Finnish prime minister has apologised to Asian nations amid a growing controversy over the \"slanted eyes\" scandal which saw members of parliament post derogatory images.",
        "url": "https://news.sky.com/story/finnish-pm-apologises-over-slanted-eyes-controversy-after-racist-post-by-miss-finland-13484871",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-finland-sarah-dzafce_7113220.jpg?20251217165234",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-17 20:50:00",
        "Headline": "The controversy started earlier this month when the Miss Finland title holder, Sarah Dzafce, was pictured pulling back her eyes in her friend's social media post captioned: \"Eating with a Chinese person\".",
        "Content": "The Finnish prime minister has apologised to Asian nations amid a growing controversy over the \"slanted eyes\" scandal which saw members of parliament post derogatory images. The controversy started earlier this month when the Miss Finland title holder, Sarah Dzafce, was pictured pulling back her eyes in her friend's social media post captioned: \"Eating with a Chinese person\". Dzafce, who is not of Asian origin, said she did not intend to offend anyone and apologised. But the 22-year-old was nonetheless stripped of the title she had only won in September. Finns Party MPs Kaisa Garedew and Juho Eerola reacted by posting similar pictures of themselves, Finland's public broadcaster, Yle, reported, as did Finns Party MEP Sebastian Tynkkynen. Mr Eerola has since apologised for his post. Dubbed the \"slanted eyes\" scandal by Finnish media, the incident is the latest in a series of cases in which members ofthe Finns Party, a junior partner in the governing coalition, have been accused of posting or making racist remarks. \n                  Tampere: Four people stabbed near shopping centre in Finland\n                 \n                  Five killed after two helicopters collide in Finland\n                 \n                  Finnish president reveals Trump running out of patience with Putin over Ukraine ceasefire\n                 Prime Minister Petteri Orpo of the pro-business National Coalition Party, who leads a four-party coalition that includesthe Finns, issued a statement offering his sincere apologies on Wednesday. \"These posts do not reflect Finland's values of equality and inclusion,\" Mr Orpo said in statements released by Finnishembassies in China, Japan and South Korea. \"Our message in Finland and to all our friends abroad is that the government takes racism seriously and is committed tocombating the issue,\" he said. Read more from Sky News:Elon Musk is winning the space race - and looks unstoppableParamount backer pulls out of Warner Bros takeover bid The Miss Finland organisation, in a statement to Reuters, said it was apolitical but had acted in accordance with its values and principles. Already shortly after taking office in 2023, Mr Orpo's government faced a no-confidence vote over racist online posts and statements made by several cabinet members from the Finns Party."
    },
    {
        "title": "Roman Abramovich: PM demands Russian oligarch transfers £2.5bn to help Ukraine or face legal action",
        "description": "The UK government has demanded that Russian oligarch Roman Abramovich gives &#163;2.5bn from the sale of Chelsea Football Club to be used for humanitarian purposes in Ukraine, or face legal action.",
        "url": "https://news.sky.com/story/roman-abramovich-pm-demands-russian-oligarch-transfers-16325bn-to-help-ukraine-or-face-legal-action-13484841",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-keir-starmer-roman-abramovich_7113120.jpg?20251217145554",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-17 14:36:00",
        "Headline": "Roman Abramovich has been told to transfer the frozen profits from the sale of his stake in Chelsea FC for humanitarian assistance in Ukraine, or be taken to court.",
        "Content": "The UK government has demanded that Russian oligarch Roman Abramovich gives £2.5bn from the sale of Chelsea Football Club to be used for humanitarian purposes in Ukraine, or face legal action. Sir Keir Starmer announced at Prime Minister's Questions at lunchtime that the Treasury is issuing a licence for the transfer of the frozen funds to a foundation to be used to provide aid in Ukraine. If he does not do so within 90 days, the government will take him to court in the UK. Politics latest: UK to rejoin EU's Erasmus student exchange scheme The prime minister said: \"My message to Abramovich is this: the clock is ticking, honour the commitment that you made, and pay up now. \"And if you don't, we're prepared to go to court, so every penny reaches those whose lives have been torn apart by Putin's illegal war.\" Home Secretary Yvette Cooper told Sky News political editor Beth Rigby the government has \"tried every possible avenue to get him to do the right thing\", but it has \"come to nothing\". \n                  Teachers to be trained to spot signs of misogyny in boys and teach about healthy relationships\n                 \n                  Jess Phillips on tackling violence against women and girls: 'I've tried to talk to my children about strangulation - it's not normal sexual behaviour'\n                 \n                  Politics latest: Abramovich cash from Chelsea sale must be used for aid in Ukraine, says foreign secretary\n                 Mr Abramovich rose to prominence in the UK when he bought Chelsea Football Club in 2003, before pumping billions into the club, winning several trophies including multiple Premier League titles and the Champions League. He made his billions in the post-Soviet Russian era, and has been said to be an ally to Vladimir Putin. However, when Russia invaded Ukraine in 2022, Mr Abramovich was sanctioned by the Boris Johnson government due to his links to the Russian leader. As part of this, he was forced to sell his stake in Chelsea, and he announced that the frozen proceeds would be earmarked \"for the benefit of all victims of the war in Ukraine\", including \"providing critical funds towards the urgent and immediate needs of victims, as well as supporting the long-term work of recovery\". But the £2.5bn received for the sale has stayed in the deep freeze ever since, not available to support Kyiv and kept in an inaccessible account. Asked by journalists if Mr Abramovich has given a reason for not agreeing to transfer the funds for use in Ukraine, the prime minister's official spokesman said: \"He disputes that the funds should be used exclusively for humanitarian purposes in Ukraine. \"He wants to spend them more widely. And negotiations on this have not resulted in an agreed outcome.\" Ms Cooper said the government has been \"very clear\" the proceeds from the Chelsea sale \"need to go into humanitarian support in Ukraine\". \"It is the Ukrainian people who have suffered as a result of Putin's aggression as a result of this war, and that is where this funding needs to go,\" she added. Downing Street said Mr Abramovich would need to set up the foundation and arrange the transfer in line with the licence, otherwise legal action would be taken - although the spokesperson would not say under what legislation they would take action under. This move from the UK government is in line with a wider European push for Moscow to foot the bill for deaths and destruction triggered by its invasion. Sky News has contacted Mr Abramovich's last known legal representatives in the United States and Belgium for comment."
    },
    {
        "title": "Tears as relative of youngest victim of Bondi Beach shooting hits out at 'evil' attackers",
        "description": "Last Sunday, smiling at the camera, showing off freshly applied face paint and cuddling a baby goat, 10-year-old Matilda was the picture of happiness. And yet minutes later she was fighting for her life.",
        "url": "https://news.sky.com/story/tears-as-relative-of-youngest-victim-of-bondi-beach-shooting-hits-out-at-evil-attackers-13484794",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bondi-beach-shooting_7110449.jpg?20251215053150",
        "type": "World",
        "Author": "Jonathan Samuels",
        "Date Published": "2025-12-17 12:43:00",
        "Headline": "Matilda's aunt Lina Chernykh describes her niece as \"friendly and happy, and with a lot of friends\" and says the gunmen who went on the rampage \"must never have had love\".",
        "Content": "\n          Presenter\n              @jonathansamuels\n Last Sunday, smiling at the camera, showing off freshly applied face paint and cuddling a baby goat, 10-year-old Matilda was the picture of happiness. And yet minutes later she was fighting for her life. Inseparable from her younger sister Summer, the girls had been enjoying the Hanukkah party with their parents. Her funeral on Thursday will be another difficult day for Sydney's Jewish community as they bury the youngest victim of the Bondi massacre. Her traumatised parents have visited the makeshift memorial just metres from where Matilda was shot. Through tears her father, Michael, told journalists: \"I named her Matilda because she was our first Australian, we came here from Ukraine and Matilda was the first born in Australia and I thought that 'Matilda' is the most Australian name that can ever exist so just remember the name, remember her.\" I meet Matilda's aunt Lina Chernykh who describes her niece as \"friendly and happy, and with a lot of friends\". After first hearing the news about the massacre Lina prayed Matilda would not die, even if it meant life-changing injuries. She broke down in tears telling me how she would have pushed Matilda round in a wheelchair if it had meant she survived. I ask her what she thinks about the gunmen who went on the rampage. \"I feel sorry for them,\" she says. \"They must never have had love - how can someone happy in love do this? They are evil.\" Read more:Alleged Bondi Beach attacker charged with 59 offencesMourners pay respects at funeral of Bondi victim Only a few weeks ago Matilda was practising her dance moves at her grandad's birthday party. Now her family are carrying out her funeral. Inundated with messages of support from strangers around the world - they want Matilda's love of life to be passed on. Lina tells me quietly that she hopes people will remember Matilda as the smiling youngster she was, rather than the child who was killed. \"Remember her just as a happy child, a happy person… I hope people around the world give love to their kids and not hate.\""
    },
    {
        "title": "World Cup winning team to get $50m as FIFA boosts total prize fund by 50% ",
        "description": "The prize for winning next year's football World Cup in North America will increase to $50m (&#163;37m), FIFA has announced. ",
        "url": "https://news.sky.com/story/world-cup-winning-team-to-get-50m-as-fifa-boosts-total-prize-fund-by-50-13484827",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-trophy-lionel-messi_7107494.jpg?20251211142859",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-17 13:57:00",
        "Headline": "Football's world governing body says the 48 teams at World Cup 2026 in North America will all get a share of a $655m (£490m) prize kitty.",
        "Content": "The prize for winning next year's football World Cup in North America will increase to $50m (£37m), FIFA has announced.  Football's global governing body is boosting the overall prize pot for the tournament by 50%, compared to Qatar in 2022 when the champions Argentina won $42m. Forty-eight teams will compete in the expanded tournament - hosted by the US, Canada and Mexico - and share $655m (£490m). The 2026 World Cup will be a huge money-spinner in terms of advertising rights and ticket sales and is expected to earn FIFA at least $10bn (£7.4bn) in revenue. The announcement follows FIFA confirming a limited number of cheaper tickets will be available for each game after widespread criticism they were grossly overpriced. The prizes for the tournament are as follows: Winners - $50mRunner-up - $33m3rd - $29m4th - $27m5th-8th - $19m9th-16th - $15m17th-32nd - $11m33rd-48th - $9m \n                  2026 World Cup draw: England and Scotland learn group stage opponents for tournament in USA, Canada and Mexico \n                 \n                  The day the House votes to release the Epstein files\n                 All 48 teams will also get $1.5m to cover \"preparation costs\", according to FIFA, meaning a payout of at least $10.5m (£7.8m) each. Gianni Infantino, the head of FIFA said the event would be \"groundbreaking in its financial contribution to the global football community\". While $655m will be dished out in prize money, FIFA said a total of $727m (£544m) would be \"distributed\" as a result of the tournament. However, it didn't specify where the other $72m will go. The 2026 World Cup will be a huge money-spinner in terms of advertising rights and ticket sales and is expected to earn FIFA at least $10bn (£7.4bn) in revenue. Read more:Explainer: Want to get tickets to the 2026 World Cup?Everything you need to know about the World Cup FIFA had been urged to halt ticket sales recently after it emerged fans faced paying \"extortionate\" prices for tickets, with the cheapest for the final priced over £3,000. A \"Supporter Entry Tier\" was announced this week, offering a limited number of $60 (£45) tickets for all games, including the final. However, only 10% of national associations' allocated tickets will fall under this category and it represents less than one percent of overall capacity for each match. The FA is getting 4,022 tickets for England's opening game against Croatia, so just 402 will be available for £45. It's up to the national associations to decide how to distribute them, with the most loyal fans likely to get priority. Football Supporters' Association chair, Tom Greatrex, said: \"The record prize fund demonstrates there is no shortage of money associated with the World Cup. \"More teams, bigger stadia, greater number of commercial partners - which all underlines that there is no need to charge extortionate ticket prices to the supporters who bring the vibrancy to the World Cup finals. \"Unless they reconsider the ticket pricing model, FIFA are in danger of undermining the spectacle of the finals by pricing out those who bring colour, atmosphere and emotion to games - ironically devaluing the 'product' to their commercial partners.\""
    },
    {
        "title": "Thousands of dinosaur footprints discovered on Italian rock face",
        "description": "Thousands of dinosaur footprints from around 210 million years ago have been found on a rock face in northern Italy.",
        "url": "https://news.sky.com/story/thousands-of-dinosaur-footprints-discovered-on-italian-rock-face-13484689",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-triassic-dinosaur-fraeel-valley_7112665.jpg?20251217081502",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-17 10:26:00",
        "Headline": "Some of the footprints are up to 40cm wide and showing claw marks, with experts describing the collection as among the \"most spectacular\" they have seen.",
        "Content": "Thousands of dinosaur footprints from around 210 million years ago have been found on a rock face in northern Italy. A wildlife photographer made the discovery at Stelvio National Park, revealing \"tens of thousands\" of prints which are \"more or less well-preserved\". Initial estimations put the \"spectacular\" collection at around 20,000 prints spread across an area of three miles, with experts describing some of the prints as being up to 40cm wide and showing claw marks. The tracks were discovered in September by Elio Della Ferrera, who was setting up to photograph deer and vultures when his camera was trained on a vertical wall above the nearest road. He said: \"The huge surprise was not so much in discovering the footprints, but in discovering such a huge quantity. \"There are really tens of thousands of prints up there, more or less well-preserved.'' Despite being in plain sight, the wall is mostly in the shade and the prints would still have been hard to spot without a very strong camera lens, he added. Cristiano Dal Sasso, paleontologist at Milan's Natural History Museum, said: \"This is one of the largest and oldest footprint sites in Italy, and among the most spectacular I've seen in 35 years. \"This time reality really surpasses fantasy. \"There are very obvious traces of individuals that have walked at a slow, calm, quiet rhythmic pace, without running.\" The prints were found at the entrance to the national park, a mile from the mountain town of Bormio, where the men's alpine skiing will be held at the Winter Olympics in February. Read more from Sky News:Couple win second £1m lottery2025 is the UK's sunniest year ever Experts believe the prints were left by herds of long-necked herbivores, likely plateosaurs, more than 200 million years ago during the Triassic period when the area was a warm lagoon. The conditions would have been ideal for dinosaurs to roam along beaches, leaving tracks in the mud near the water \"when the sediments were still soft\"."
    },
    {
        "title": "Maccabi Tel Aviv FC given fan ban and €20,000 fine by UEFA for 'racist' chanting",
        "description": "Maccabi Tel Aviv, whose supporters were controversially excluded from a match at Aston Villa last month, have been given a suspended one-match away fan ban by&#160;UEFA&#160;for behaviour it called \"racist and/or discriminatory\".",
        "url": "https://news.sky.com/story/maccabi-tel-aviv-fc-given-fan-ban-and-836420000-fine-by-uefa-13484924",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-maccabi-stuttgart_7113342.jpg?20251217193126",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-17 18:14:00",
        "Headline": "It is understood that the sanction relates to anti-Arab chanting by Maccabi fans.",
        "Content": "Maccabi Tel Aviv, whose supporters were controversially excluded from a match at Aston Villa last month, have been given a suspended one-match away fan ban by UEFA for behaviour it called \"racist and/or discriminatory\". The Israeli club was also fined €20,000 (£17,550) by UEFA's control, ethics and disciplinary body (CEDB) in relation to their fan's conduct at a Europa League away game against Stuttgart on 11 December. The CEDB also imposed a ban on Maccabi selling tickets to their fans for their next UEFA competition match away from home, suspended for a probationary period of two years. It is understood that the sanction related to anti-Arab chanting by Maccabi fans. Maccabi supporters were controversially barred from travelling for safety reasons for an earlier Europa League tie away game to Villa on 6 November by the local safety advisory group (SAG), which said it had acted on advice from West Midlands Police. The decision was heavily criticised by Prime Minister Keir Starmer, who described it as \"wrong\". Read more from Sky News:PM demands Abramovich transfers £2.5bn for Ukraine or face legal actionFIFA announces £45 World Cup tickets in price climbdown \n                  FIFA announces £45 World Cup tickets in climbdown after outcry over pricing\n                 \n                  Paris Saint-Germain ordered to pay Kylian Mbappe €60m  French court rules\n                 \n                  PSG's Qatari owner adds to squad with swoop on Belgian side\n                 Culture Secretary Lisa Nandy called on the police to review its decision. Police chiefs were called to give evidence to the Home Affairs Committee of MPs on 1 December regarding the decision, with the committee chair Karen Bradley having requested further information in letters to the police, the SAG and the UK Football Policing Unit. The fine was one of a number levied against international sides by the UEFA body, including a €116,000 fine against Bayern Munich for blocking of public passageways and lighting of fireworks. There was no immediate comment from Maccabi in response to its fine and fan ban. Maccabi Tel Aviv CEO Jack Angelides admitted to Sky News last month the club has a racism problem in sections of the fan base. He said: \"We know we've got a long road ahead. There are elements in the club that are not in line with our values, our morals, and we do expend a lot of energy and have been for many, many years in trying to… eradicate that.\""
    },
    {
        "title": "Rob Reiner's son appears in court accused of murdering Hollywood director and wife",
        "description": "Rob Reiner's son Nick made his first court appearance on Wednesday on two counts of first-degree murder in the killing of his parents.",
        "url": "https://news.sky.com/story/rob-reiners-son-appears-in-court-accused-of-murdering-hollywood-director-and-wife-13484931",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nick-reiner-murder_7113354.jpg?20251217195009",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-17 20:01:00",
        "Headline": "Nick Reiner, the youngest son of Rob Reiner and Michele Singer, appeared in court in shackles and weaning a suicide prevention smock, as he faces charges of first-degree murder in the killing of his parents. ",
        "Content": "Rob Reiner's son Nick made his first court appearance on Wednesday on two counts of first-degree murder in the killing of his parents. Wearing a suicide prevention smock and shackles, the 32-year-old did not enter a plea as he appeared from behind the glass wall of a custody area. His next court appearance will be on 7 January. As it happened: Nick Reiner makes first court appearance Nick Reiner spoke only to say, \"yes, your honour\" to agree to the date. He was charged Tuesday with killing the 78-year-old actor and director Rob Reiner and his wife, Michele Singer Reiner, Los Angeles County District Attorney Nathan Hochman announced at a news conference. Nick Reiner is being held without bail and could face the death penalty. Along with the two counts of first-degree murder, prosecutors added a special circumstance of multiple murders, as well as an allegation that he personally used a dangerous and deadly weapon, a knife. Speaking outside the court, Nick Reiner's lawyer, Alan Jackson, called on the public not to \"rush to judgement\". Mr Jackson pointed to \"complex and serious issues that are associated with this case\" that needed to be thoroughly and \"very carefully dealt with and examined\". He added that it was a \"devastating tragedy that has befallen the Reiner family\". 'Unimaginable pain' Nick Reiner's two siblings Jake and Romy have released a statement, saying \"words cannot even begin to describe the unimaginable pain we are experiencing every moment of the day\". \"The horrific and devastating loss of our parents, Rob and Michele Reiner, is something that no one should ever experience,\" they said. \"They weren't just our parents; they were our best friends. We are grateful for the outpouring of condolences, kindness, and support we have received not only from family and friends but people from all walks of life.\" The two asked for \"respect and privacy\" and for speculation to be treated with \"compassion and humanity\". Authorities have not disclosed a motive for the killings. Rob Reiner and Michele Singer Reiner were found dead from apparent stab wounds in their home in the upscale Brentwood neighbourhood of Los Angeles. Read more from Sky News:Moment Nick Reiner arrested for murder of his parentsCould Reiner actually face the death penalty? Nick Reiner did not resist when he was arrested hours later near the University of Southern California, about 14 miles (22.5 kilometres) from the crime scene, according to police. Rob Reiner was a celebrated director, whose work included some of the most memorable films of the 1980s and 1990s, including This Is Spinal Tap, The Princess Bride, When Harry Met Sally and A Few Good Men. He met Michele Singer, a photographer, movie producer and advocate for LGBTQ+ rights, in 1989, while directing When Harry Met Sally."
    },
    {
        "title": "Trump says the quiet part out loud - and seems to have three aims for Venezuela",
        "description": "Donald Trump has said the quiet stuff out loud. His Tuesday evening social media post on Venezuela feels like an offload, a dump of thoughts. But it is nonetheless very revealing.",
        "url": "https://news.sky.com/story/trump-says-the-quiet-part-out-loud-and-seems-to-have-three-ultimate-aims-for-venezuela-13484579",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-us-president_7112545.jpg?20251217022957",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-12-17 01:51:00",
        "Headline": "On the face of it, it's all part of an anti-drug mission, to counter the drug trade from Venezuela into America. At least that's the public messaging. And the missile and drone attacks on suspected drug boats in the region are all part of the play.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n Donald Trump has said the quiet stuff out loud. His Tuesday evening social media post on Venezuela feels like an offload, a dump of thoughts. But it is nonetheless very revealing. \"Venezuela is completely surrounded by the largest Armada ever assembled in the History of South America,\" the US president says. \"It will only get bigger, and the shock to them will be like nothing they have ever seen before…\" That's a reference to the massive US naval and Air Force presence in the Caribbean off Venezuela. It is indeed an armada, and it's been there for months now. On the face of it, it's all part of an anti-drug mission, to counter the drug trade from Venezuela into America. At least that's the public messaging. And the missile and drone attacks on suspected drug boats in the region are all part of the play. And that's why the second part of his post is particularly interesting, because he now appears to be saying out loud what plenty have suspected all along - that this is actually about regime change, and it is about oil far more than it is about drugs. He says that the military will remain in place \"until such time as they [Venezuela] return to the United States of America all of the Oil, Land, and other Assets that they previously stole from us\". He continues: \"The illegitimate Maduro Regime is using Oil from these stolen Oil Fields to finance themselves, Drug Terrorism, Human Trafficking, Murder, and Kidnapping.\" This is a reference to the fact that the US was once a huge importer of Venezuelan oil. American companies based in the country extracted the oil and refineries on the Texan coast processed it. The refineries were adapted over decades to refine the thick, heavy crude that is typical of Venezuela. The process was big business for American firms until Venezuela, under Hugo Chavez in the 2000s, nationalised the foreign oil assets. Read more:The US-Venezuela crisis explained Trump wants all that back - the oil, the revenue, the influence. So all this, it seems clear now, is about oil, and it is about spheres of influence - hemispheres. Trump is determined to assert American control over the western hemisphere. The ultimate ambition it seems is threefold: • To remove the Maduro regime and support a friendly, compliant government;• To seize control of the oil, through commercial partnerships, not force;• And to stop any drug and people smuggling into the US. With this latest social post, Trump has now said all that out loud. Interesting days ahead are certain."
    },
    {
        "title": "Oscars set to leave ABC and will be streamed live on YouTube from 2029",
        "description": "The Oscars will be streamed live on YouTube from 2029 after being broadcast on the ABC network for decades.",
        "url": "https://news.sky.com/story/oscars-set-to-leave-abc-and-will-be-streamed-live-on-youtube-from-2029-13484929",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-oscar-statuettes-oscars_7113469.jpg?20251217220012",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-17 18:28:00",
        "Headline": "The Academy of Motion Picture Arts and Sciences announced the move on Wednesday, saying YouTube will have the exclusive global rights to the Oscars from 2029 to 2033.",
        "Content": "The Oscars will be streamed live on YouTube from 2029 after being broadcast on the ABC network for decades. It means the annual film awards will be available to the video-sharing platform's two billion users for free around the world in four years. The Academy of Motion Picture Arts and Sciences announced the deal with Google-owned YouTube on Wednesday, saying the streaming giant will have the exclusive global rights to the Hollywood awards from 2029 to 2033. YouTube will effectively be the home to all things Oscars, including red-carpet coverage, the Governors Awards and the Oscar nominations announcement. The Academy Awards ceremony has been broadcast by ABC for most of its history, but 2028 will be its last year showing the Oscars as they celebrate their 100th anniversary. \"The Oscars, including red carpet coverage, behind-the-scenes content, Governors Ball access, and more, will be available live and for free to over two billion viewers around the world on YouTube, and to YouTube TV subscribers in the United States,\" an announcement on the Academy Awards' website read. \"We are thrilled to enter into a multifaceted global partnership with YouTube to be the future home of the Oscars and our year-round academy programming,\" said academy chief executive Bill Kramer and academy president Lynette Howell Taylor. \n                  Diane Keaton's family issue statement as cause of death given\n                 \n                  Oscars 2025: Anora sweeps the Academy Awards with five awards including best picture\n                 \n                  Oscars backstage: Six highlights from the Academy Awards winners room\n                 They said the new partnership with the platform \"will allow us to expand access to the work of the academy to the largest worldwide audience possible\". 'Inspiring new generation of creativity and film lovers' \"The Oscars are one of our essential cultural institutions, honouring excellence in storytelling and artistry,\" said YouTube chief executive Neal Mohan. \"Partnering with the academy to bring this celebration of art and entertainment to viewers all over the world will inspire a new generation of creativity and film lovers while staying true to the Oscars' storied legacy.\" Read more from Sky News:Paramount backer pulls out of Warner Bros takeover bidSydney Sweeney on challenges women face to 'have it all' The awards will be available with audio tracks in many languages, in addition to closed captioning. Last year's Academy Awards were watched by 19.7 million viewers on the Disney-owned ABC, a five-year high but far below the show's biggest audience of 57 million in 1998. The network has been the broadcast home to the Oscars for almost its entire history. NBC first televised the Oscars in 1953, but ABC picked up the rights in 1961. Aside from a period between 1971 and 1975, when NBC again aired the show, the Oscars have been on ABC."
    },
    {
        "title": "Sharp inflation slowdown leaves door to interest rate cut wide open",
        "description": "The rate of inflation hit a much lower than expected 3.2% last month, according to official figures which should lock in an interest rate cut by the Bank of England on Thursday.",
        "url": "https://news.sky.com/story/sharp-inflation-slowdown-leaves-door-open-to-interest-rate-cut-13484594",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-istock-stock-file-generic_7001519.jpg?20250826080130",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-12-17 06:07:00",
        "Headline": "A supermarket price war helps the headline rate of inflation ease by more than predicted, according to figures from the Office for National Statistics.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The rate of inflation hit a much lower than expected 3.2% last month, according to official figures which should lock in an interest rate cut by the Bank of England on Thursday. The Office for National Statistics (ONS) reported an easing in the pace of the main consumer prices index measure from the 3.6% annual rate seen in October. The main downwards pressure came from food costs amid a supermarket price war to secure custom ahead of the core Christmas season. Money latest: What the fall in inflation means for you ONS chief economist Grant Fitzner noted decreases in the prices paid for cakes, biscuits and breakfast cereals in particular. \"Tobacco prices also helped pull the rate down, with prices easing slightly this month after a large rise a year ago\", he wrote. \"The fall in the price of women's clothing was another downward driver. \n                  Pound tumbles after inflation falls by more than expected; Greggs to put up prices | Money blog\n                 \n                  Fujitsu chief to face MPs grilling over Post Office compensation\n                 \n                  Paddy Power Betfair to pay £2m for failing to protect gamblers\n                 \"The increase in the cost of goods leaving factories slowed, driven by lower food inflation, while the annual cost of raw materials for businesses continued to rise.\" The data marked further downwards progress for the headline rate after a spike this year which economists have partly attributed to higher employment costs, imposed after the government's first budget, being passed on to consumers. This price wave has muddied the waters over the pace of interest rate reductions by the Bank, which has wanted to see more evidence that inflation is not being further stoked by factors including strong wage growth. It will be encouraged by better than expected slowdowns in other closely-watched inflation measures which strip out volatile elements, such as food and energy, as well as services inflation. Recent data has also shown intensifying weakness in the labour market, with the unemployment rate surging by a percentage point to 5.1% since Labour took office. Separate ONS figures have also found that the economy contracted for two consecutive months in the run-up to Rachel Reeves's second budget. London Stock Exchange Group Data shows more than 90% of financial market participants are expecting the Bank to agree a rate cut to 3.75% - the lowest level in almost three years - from 4%. The inflation data will come as a relief to the chancellor after a tough few months for her politically given the wider economic data and backlash over the Treasury's handling of the lead up to the budget. Ms Reeves said: \"I know families across Britain who are worried about bills will welcome this fall in inflation. \"Getting bills down is my top priority. That is why I froze rail fares and prescription fees and cut £150 off average energy bills at the budget this year. \"The Bank of England agree this will help cut prices and expect inflation to fall faster next year as a result.\""
    },
    {
        "title": "Fujitsu chief to face MPs grilling over Post Office compensation",
        "description": "The boss of Fujitsu's British operations will face a fresh grilling from MPs next month amid pressure on the Japanese software company to fork out hundreds of millions of pounds as part of the vast Horizon IT scandal compensation bill.",
        "url": "https://news.sky.com/story/fujitsu-chief-to-face-mps-grilling-over-post-office-compensation-13484879",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-post-office-sign_7068058.jpg?20251031171735",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-17 16:18:00",
        "Headline": "Paul Patterson will appear before the business and trade select committee on 6 January amid mounting pressure on Fujitsu to make a sizeable contribution to the Horizon scandal compensation bill, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The boss of Fujitsu's British operations will face a fresh grilling from MPs next month amid pressure on the Japanese software company to fork out hundreds of millions of pounds as part of the vast Horizon IT scandal compensation bill. Sky News has learnt that Paul Patterson, director of Fujitsu Services, will be questioned by the Commons business and trade select committee on January 6 about its discussions with the government about a major financial contribution. Mr Patterson last appeared before the committee almost two years ago. Fujitsu, which supplied the faulty Horizon system that led to hundreds of sub-postmasters being wrongly convicted of fraud and theft, has repeatedly acknowledged its obligation to bear part of the financial cost of compensating victims. The conclusion of Sir Wyn Williams's inquiry into the scandal is expected to pave the way for the company and the government to hammer out a final agreement on the size of its contribution. A Fujitsu spokesperson said: \"We remain committed to providing our full cooperation to the Inquiry as Sir Wyn prepares his final report, and we are engaged with government regarding Fujitsu's contribution to compensation.\" Next month's hearing will come soon after Fujitsu and the Post Office agreed a further extension of their Horizon supply agreement. \n                  Sharp inflation slowdown leaves door to interest rate cut wide open\n                 \n                  Pound tumbles after inflation falls by more than expected; Greggs to put up prices | Money blog\n                 \n                  Paddy Power Betfair to pay £2m for failing to protect gamblers\n                 The government-owned company is to pay another £41m to Fujitsu for the use of the Horizon system from next April until 31 March 2027. The Post Office is expected to move to an alternative supplier after the expiry of that contract. Horizon was initially introduced in 1999, meaning it is likely to have been in service for nearly 30 years by the time it is formally abandoned by the Post Office. A spokesperson for the business and trade committee declined to comment."
    },
    {
        "title": "Paddy Power Betfair to pay £2m for failing to protect gamblers",
        "description": "Paddy Power Betfair is to pay &#163;2m for acting too slowly on concerning customer behaviours, including one player who staked &#163;86,000 over 16 days and another who placed 300 bets in eight hours.",
        "url": "https://news.sky.com/story/paddy-power-betfair-to-pay-1632m-for-failing-to-protect-gamblers-13484749",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-betfair-gambling_7112896.jpg?20251217115029",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-17 11:20:00",
        "Headline": "A spokesperson for Flutter Entertainment - which owns Paddy Power Betfair - says it takes safer gambling responsibilities \"incredibly seriously\" and has industry-leading safeguards.",
        "Content": "Paddy Power Betfair is to pay £2m for acting too slowly on concerning customer behaviours, including one player who staked £86,000 over 16 days and another who placed 300 bets in eight hours. The Gambling Commission found social responsibility failures in a review of the firm last year and said some customer interactions \"fell far short\". John Pierce, the watchdog's director of enforcement, said the £2m settlement reflected the seriousness of the case. Betting firms must have systems and processes to monitor activity and identify worrying behaviours, but Paddy Power Betfair's were found to be lacking in some cases. The commission said \"the velocity of spend, increasing deposits, overnight gambling, and changing betting patterns did not appear to be identified by the licensees or acted upon until the next day\". The firm failed to intervene fast enough despite a customer betting £86,000 and losing £6,000 over 16 days, with a manual review only starting when the losses mounted. It also didn't promptly identify another gambler who went on a 17-day spree, including one session of seven hours and 46 minutes in which they put up £20,000 in more than 300 bets. \n                  Sharp inflation slowdown leaves door to interest rate cut wide open\n                 \n                  Pound tumbles after inflation falls by more than expected; Greggs to put up prices | Money blog\n                 \n                  Fujitsu chief to face MPs grilling over Post Office compensation\n                 Another gambler deposited £25,000 over 25 days before being interacted with, according to the commission's statement. \"Operators must ensure systems to identify and address harm work effectively and at the right time,\" said Mr Pierce. \"Over-reliance on automation and failure to intervene when clear harm indicators are present exposes consumers to unnecessary risk.\" The commission described the £2m as \"a payment in lieu of a financial penalty\". However, it said the firm had quickly instigated a plan to fix the failings and fully cooperated with the investigation. Read more from Sky News:Duke of Marlborough charged with strangulation offencesPound tumbles after inflation falls by more than expected In 2023, the commission also fined Paddy Power and Betfair £490,000 for sending messages to the phones of vulnerable customers who had asked to be excluded. A spokesperson for Flutter Entertainment - which owns Paddy Power Betfair - said it takes safer gambling responsibilities \"incredibly seriously\" and has industry-leading safeguards. \"Customer safety is our number one priority and there is no suggestion that any of the customers reviewed by the Gambling Commission experienced any harm,\" the spokesperson said. \"Our controls have evolved significantly and we recently introduced a next generation customer safety platform, with the vast majority of checks now happening in real-time. \"As such, we are confident that the issues highlighted by the commission in its public statement would not be repeated today.\""
    },
    {
        "title": "Permira enlists ex-PA Consulting chief for Interpath bid",
        "description": "The private equity firm Permira is working with a professional services veteran as it plots a takeover of the firm drafted in to oversee a controversial costs purge at Manchester United Football Club.",
        "url": "https://news.sky.com/story/permira-enlists-ex-pa-consulting-chief-for-interpath-bid-13484656",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tgi-fridays-gv_7094081.jpg?20251127225032",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-17 09:31:00",
        "Headline": "The buyout firm is working with Alan Middleton, who ran PA Consulting Group for 15 years, as it vies with rival bidders to acquire the former restructuring arm of KPMG UK, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity firm Permira is working with a professional services veteran as it plots a takeover of the firm drafted in to oversee a controversial costs purge at Manchester United Football Club. Sky News has learnt that Permira has enlisted help from Alan Middleton, the former chief executive of PA Consulting Group, as part of its pursuit of Interpath Advisory. City sources said on Wednesday that indicative offers for the business - which used to be the restructuring division of KPMG UK - had been submitted this week. Money latest: What the fall in inflation means for you Blackstone, Bridgepoint Onex and PAI Partners are among the other buyout firms understood to have expressed interest in acquiring Interpath. Banking sources expect the deal to command a price tag of up to £900m. HIG Europe, the majority shareholder in Interpath, is being advised by bankers at Moelis on the auction. \n                  Sharp inflation slowdown leaves door to interest rate cut wide open\n                 \n                  Pound tumbles after inflation falls by more than expected; Greggs to put up prices | Money blog\n                 \n                  Fujitsu chief to face MPs grilling over Post Office compensation\n                 Interpath was spun out of KPMG UK in 2021 in a deal triggered by the changing regulatory climate in the audit profession. Growing concerns over conflicts of interest between accountancy giants' audit and consulting arms had been exacerbated by the collapse of companies such as BHS and Carillion, prompting a number of disposals by 'big four' firms. Interpath has advised on a string of prominent restructuring and cost-saving mandates for clients, including acting as administrator to the UK and Ireland subsidiaries of Claire's, the accessories retailer which collapsed during the summer. It is now advising on a restructuring of the casual dining business TGI Fridays. Sources said that Interpath had doubled its earnings before interest, tax, depreciation and amortisation since HIG Europe acquired the business four-and-a-half years ago. It is also said to be on track to record a 20% increase in annual revenues in the current financial year. A sale of Interpath is expected to be agreed during the first quarter of 2026. Permira and HIG declined to comment."
    },
    {
        "title": "Teachers to be trained to spot signs of misogyny in boys and teach about healthy relationships",
        "description": "Teachers will be trained to spot early signs of misogyny in boys and steer them away from it as part of the government's long-awaited strategy to tackle violence against women and girls (VAWG).",
        "url": "https://news.sky.com/story/schools-will-have-to-teach-about-healthy-relationships-to-tackle-misogyny-13484951",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/school-students-teachers_6967281.jpg?20251210151738",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-17 20:01:00",
        "Headline": "A range of measures are being unveiled as part of the government's long-awaited strategy to halve violence against women and girls in a decade.",
        "Content": "Teachers will be trained to spot early signs of misogyny in boys and steer them away from it as part of the government's long-awaited strategy to tackle violence against women and girls (VAWG). Sir Keir Starmer warned \"too often toxic ideas are taking hold early and going unchallenged\", with more than 40% of young men said to hold a positive view of misogynistic influencer Andrew Tate. He has been challenged about his ideology in the past and called the concerns \"garbage\". Sir Keir's government will formally unveil a £20m package of measures today, with £16m coming from the taxpayer and £4m from philanthropists and partners. Teachers will also get specialist training on how to talk to pupils about issues like consent and the dangers of sharing intimate images - and all secondary school pupils in England will be taught about healthy relationships. Such lessons will be mandatory by the end of this parliament in 2029, with schools to be chosen for a pilot scheme in 2026, which experts will be brought in to deliver. And an online helpline will be set up for teenagers with concerns about their own behaviour in relationships. The measures are part of the government's strategy to halve VAWG in a decade, and the prime minister said it's a \"responsibility we owe to the next generation\". \"Every parent should be able to trust that their daughter is safe at school, online and in her relationships,\" he said. \"This government is stepping in sooner - backing teachers, calling out misogyny, and intervening when warning signs appear - to stop harm before it starts.\" Department for Education-commissioned research found 70% of secondary school teachers surveyed said their school had actively dealt with sexual violence and/or harassment between children. VAWG minister Jess Phillips told Sky News political editor Beth Rigby she had spoken to her own children about what's normal sexual behaviour and what isn't because she knows \"what they might be exposed to\". She said if the government does nothing to intervene, VAWG could double rather than be halved. Read more: Teams deployed to tackle violence 'emergency'Domestic abuse survivors to get NHS help The government has already announced several other measures to tackle VAWG this week, including introducing specialist rape and sexual offences investigators to every police force, better support for survivors in the NHS, and a £19m funding boost for councils to provide safe housing for domestic abuse survivors. Investment 'falls short' But Dame Nicole Jacobs, the domestic abuse commissioner for England and Wales, said the commitments \"do not go far enough\" and schools are overburdened already. \"Today's strategy rightly recognises the scale of this challenge and the need to address the misogynistic attitudes that underpin it, but the level of investment to achieve this falls seriously short,\" she said. Claire Waxman, the incoming victims commissioner, added: \"Victim services are not an optional extra to this strategy - they must be the backbone of it. \"Without clear, sustainable investment and cross-government leadership, I am concerned we run the risk of the strategy amounting to less than the sum of its parts; a wish list of tactical measures rather than a bold, unifying strategic framework.\""
    },
    {
        "title": "Jess Phillips on tackling violence against women and girls: 'I've tried to talk to my children about strangulation - it's not normal sexual behaviour'",
        "description": "There have been three strategies by three successive governments to tackle violence against women and girls (VAWG) since 2010, and one refresh.",
        "url": "https://news.sky.com/story/jess-phillips-on-tackling-violence-against-women-and-girls-ive-tried-to-talk-to-my-children-about-strangulation-its-not-normal-sexual-behaviour-13485013",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jess-phillips-beth-rigby_7113553.jpg?20251218001825",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-12-17 22:49:00",
        "Headline": "At least one in every 12 women will be a victim of violence against women and girls, but the number is probably higher than that, as this sort of violence is typically underreported.",
        "Content": "\n          Political editor\n              @BethRigby\n There have been three strategies by three successive governments to tackle violence against women and girls (VAWG) since 2010, and one refresh. What has been the result of these endeavours? Police chiefs in 2024 described the scale of violence against women and girls as \"a national emergency\" as over one million incidents were reported in 2022/3, accounting for 20% of all police recorded crime. At least one in every 12 women will be a victim, but the number is probably higher than that, as this sort of violence is typically underreported. You will likely know a woman who is the victim of abuse. When you look at the situation, and think of all the mums, sisters, daughters, aunts and friends, it makes you want to put your head in your hands: strategy after strategy, plan after plan, women and girls and the victims of abuse are being let down. Today, the government will launch a new strategy, drawn up by Jess Phillips, the safeguarding minister, that will attempt to finally put this right. The promise is to halve violence against women and girls in a decade after what has been, as Phillips puts it, \"a catalogue of failures\". That catalogue of failures is long. Successive governments had \"failed to deliver a genuinely whole-of-government approach\", concluded the National Audit Office (NAO) at the beginning of this year, as it detailed a string of shortcomings when it came to VAWG plans: partial implementation; failure to learn from past strategies; no oversight of government funding being used for VAWG; a focus on victim support rather than prevention; and a lack of buy-in from government departments. Phillips, who spent her career campaigning for victims of domestic violence before becoming an MP, wants to break that chain with her new plan, which has three pillars: prevention, with a focus on boys and young men to challenge misogyny and promote healthy relationships; stopping abusers, with more efforts and power for police forces to track down abusers; and more victim support. It is a strategy that has been delayed three times. It was first expected in the spring, then the summer, to autumn, before eventually landing 18 months into a Labour government. The delays have drawn criticism from campaigners, frustrated they \"put more lives at risk\". Read more:Schools will teach about healthy relationships to tackle misogyny 'I'm going to be getting up in everybody's business' When I spoke to Phillips about those delays on the Electoral Dysfunction podcast, she made no apology for that: \"I could have hit the deadline and missed the point.\" \"I'm not really interested in a headline that says, 'minister delivers a strategy one time',\" she said, explaining she'd had to \"bang heads together\" in different government departments to get buy-in and coordination (something the NAO said previous strategies lacked). Phillips said the strategy contains a written action plan with time frames in it, as she insists the target to halve VAWG can be hit within the decade, despite the delay. There will be an inter-ministerial VAWG group to improve cross-government working. She said: \"What we have been doing is going into other government departments and building up relationships with their teams. We have VAWG-specific staff in Number 10 now. That's never existed before. And we have been in the Department of Health. We have been in the Department of Transport. The real answer is I'm going to be getting up in everybody's business. That's the reason it has taken so long.\" Strategy also focuses on men and boys Speaking to Phillips, you cannot doubt her determination to make it a reality, and much of this strategy focuses on men and boys as well as women and girls, with a big focus on prevention and stopping abuse. \"I would be failing, we would be failing, if we didn't try to prevent people who were already perpetrating - and stopping people becoming perpetrators in the first place,\" she said. That involves the classroom and more conversations and bringing in men and boys to make them feel they are part of this. Risk of 'doubling' VAWG When I point out to Phillips that one in four 18 to 29-year-olds had favourable views towards Andrew Tate, she was quick to make the point that three out of four don't. \"If we don't do something about the situation with what young people, both victims and perpetrators, are exposed to, then not only would we not halve [VAWG in a decade], but I would also be talking about the risk of doubling it,\" she said. 'I have spoken to my children in really explicit terms' What struck me in our conversation, and as a mum of two teenagers myself, is the role Phillips said we all need to take in talking to our children about what they are being exposed to online. Phillips points out that the age profile of perpetrators is dropping as younger people become more exposed to violent pornography. One of the elements in the strategy is to ban strangulation in porn. Another is to have mandatory guidance in secondary schools to offer lessons on culture, increasing awareness of artificial intelligence and how pornography links to misogyny. Phillips, who has two sons, said it's incumbent on all of us to have those conversations with our kids about what is normal sexual behaviour and what is not. \"I have spoken to my children in really explicit terms about the things that I think they might be seeing and think as standardised in sexual practice,\" she told me. \"I have tried to talk to them about things like strangulation. I have said it is totally and utterly not like normal sexual behaviour because I know what they might be exposed to.\" Criticism over handling of grooming gangs But as a campaigner around domestic violence and now a minister charged with halving VAWG, Phillips has also faced criticism over the government's handling of grooming gangs. Fiona Goddard, who was abused by an organised street gang in Bradford, quit her role on the victims panel in the autumn and called for the resignation of the minister over her handling of the inquiry setup, which Phillips admitted she found personally difficult. She said: \"I'm not going to lie and pretend that it's nice when the thing that you care the most about in the world is the thing you are criticised for. And actually, when Fiona Goddard does that, I just take it. Fiona Goddard has every right to criticise me. When other people who never have done a bar's work in this area, but want to use that to politically criticise, I think that's cynical. \"One of the things that I think has been hardest about this process is that I am held to a different standard to literally everybody else. Now of course I should be held to a different standard because let's be honest, Beth, I'm better than most people who've had my job before because of my experience.\" 'The strategy isn't the end, it's the beginning' Phillips, the victim herself of a torrent of online abuse from Elon Musk over grooming gangs earlier this year, before the latest furore over the setting up of the national inquiry, now has police protection. I wonder whether the launch of the strategy might be the moment Phillips steps back, but she's having none of it. \"The strategy isn't the end, it's the beginning. There's a lot of work to do. I would be lying if I didn't say it didn't have a mental toll on me, but I am not the only person doing this work, it isn't all on me… the upside is better, it's worth it,\" she said. The strategy Phillips is spearheading is the fourth in 15 years. After a series of false starts, Phillips insisted this time it will be different. For the sake of our women and our girls, I hope she is right."
    },
    {
        "title": "If Abramovich fends off legal action long enough, could he eventually be able to spend Chelsea funds as he wishes?",
        "description": "Through all the threats to sue by Sir Keir Starmer's government, Roman Abramovich has stayed silent and still sanctioned.",
        "url": "https://news.sky.com/story/if-abramovich-fends-off-legal-action-long-enough-could-he-eventually-be-able-to-spend-chelsea-funds-as-he-wishes-13484927",
        "image_url": "https://e3.365dm.com/22/05/1920x1080/skynews-abramovich-roman-chelsea_5763393.jpg?20220507111901",
        "type": "Politics",
        "Author": "Rob Harris",
        "Date Published": "2025-12-17 18:32:00",
        "Headline": "The government has threatened to sue the former Chelsea FC owner if he does not hand over the profits from selling the club to help Ukrainians.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Through all the threats to sue by Sir Keir Starmer's government, Roman Abramovich has stayed silent and still sanctioned. The Russian's approval is needed to release the funds of the Chelsea sale to help the victims of the war in Ukraine. And the pressure - raised through the year and ratcheted up on Wednesday from Westminster - has not seen him give any indication about complying with the government's demands. Politics latest: Foreign secretary says Chelsea cash must be used for Ukraine victims As someone who rarely spoke publicly during his 19 years owning Chelsea, being largely quiet since being forced to sell up in 2022 after being sanctioned over his alleged links to Vladimir Putin is not unusual. Especially when speaking out could be risky for him and his family. Mr Abramovich has never condemned Russia's war on Ukraine or called for it to end - and he has never supported it publicly. \n                  Teachers to be trained to spot signs of misogyny in boys and teach about healthy relationships\n                 \n                  Jess Phillips on tackling violence against women and girls: 'I've tried to talk to my children about strangulation - it's not normal sexual behaviour'\n                 \n                  King meets Huntingdon train attack heroes, including guard who protected passengers\n                 There has only been an attempt to link him to peace talks early in the all-out war in 2022, while Turkey is reported to be one of his preferred bases. Wednesday's government news release was headlined: \"Government gives Abramovich final chance to pay £2.5bn to Ukraine or risk court action.\" But delayed accounts for Chelsea's former parent company from the Abramovich era were recently released, indicating he might not want to release all the sale proceeds, and there is actually £2.35bn in frozen funds. There is not the same assurance from a 2022 statement on Chelsea's website, which said: \"I will not be asking for any loans to be repaid.\" In fact, it says he would \"gift the net proceeds of sale, after allowing for other balance sheet items\". The accounts show there are £1.54bn of loans owed by the Fordstam former Chelsea parent company to Mr Abramovich's companies. If they were to be repaid, there would be £923m for humanitarian causes. Read more:Reeves threatens to sue Abramovich over Chelsea FC sale proceeds But when Sky News asked about this, Foreign Secretary Yvette Cooper said: \"It's clear that £2.5bn of the proceeds from the sale … was the commitment that was made as part of the agreement at that time.\" While Mr Abramovich has always said \"all victims of the war in Ukraine\", the government says it will only consider a proposal to send the cash to \"the most vulnerable in Ukraine\". But the government does now say: \"Any future gains earned by the foundation can be spent more broadly on victims of conflict worldwide.\" Could that provide leeway for Russians to eventually benefit from the funds or, even potentially, another cause, the victims of another conflict? We cannot ask Mr Abramovich questions about the fate of the funds, and his most recently named lawyers did not respond to emails requesting comment. There are notable unresolved issues impacting any sanctioned Russian oligarchs. Will the government be able to maintain sanctions if there is a Ukraine peace deal? And if Mr Abramovich fends off legal action long enough, could he eventually be able to spend the Chelsea funds as he wishes and be more associated with the benevolence?"
    },
    {
        "title": "Starmer critic elected leader of Unison - the UK's biggest union",
        "description": "Andrea Egan, a vocal critic of Sir Keir Starmer, has been elected as the next general secretary of Unison, the UK's biggest trade union, in a fresh blow for No 10.",
        "url": "https://news.sky.com/story/starmer-critic-elected-leader-of-unison-the-uks-biggest-union-13484740",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-andrea-egan-labour_7112891.jpg?20251217114520",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-17 11:08:00",
        "Headline": "Andrea Egan will replace Christina McAnea, an ally of the PM,  as Unison general secretary, in a new setback for No 10.",
        "Content": "Andrea Egan, a vocal critic of Sir Keir Starmer, has been elected as the next general secretary of Unison, the UK's biggest trade union, in a fresh blow for No 10. In a vote of union members, Ms Egan defeated incumbent Christina McAnea by 60% to 40%, on a turnout of 7%, it was announced on Wednesday. She will take up her post in January. Her election will significantly weaken Sir Keir's support on Labour's ruling National Executive Committee, and could see the union's funding for the party reduced. Unison, which has over 1.4 million members, donated £1.49m to the Labour last year, and is the party's largest union donor. Politics latest: Starmer to face Badenoch at final PMQs of 2025 Ms Egan, who was expelled from Labour in 2022, has vowed to end Unison's \"subservient\" relationship with the party. She has promised to launch \"a \"comprehensive review of our relationship with the Labour Party\", as well as oppose funding for Labour MPs and candidates who \"fail to stand against welfare cuts and other attacks on our members' living standards and policies\". \n                  Unison leadership result shows Starmer's grip on Labour machine is slipping\n                 \n                  Angela Rayner calls on MPs to sit 'through the night' to get workers' rights bill through parliament\n                 \n                  Sir Keir Starmer insists budget leaks and leadership speculation did not come from him\n                 In her manifesto, Ms Egan also said that the founding of Your Party by former Labour leader and left-wing MP Zarah Sultana means that many union members \"see the possibility of a viable alternative to Labour for the first time\". She said she would \"make clear to this Labour government what our members expect and the consequences for failing to meet those expectations\". Your Party welcomed Ms Egan's election as leader, saying in a statement: \"Andrea's victory on an anti-austerity ticket shows that working-class people won't take more cuts and more decline. \"Unison members have said no to Starmer's crumbs off the table, no to chronic low pay, no to underfunding and no to privatisation. It really is time for real change.\" Ms Egan's election could also be significant as growing numbers within Labour debate whether to keep Sir Keir as leader, or replace him in a bid to boost the party's derisory position in the national polls. In an interview with Politics Home earlier this month, Ms Egan criticised the prime minister, saying Labour under his leadership was \"not connected to working people\". She also suggested she could back Greater Manchester mayor Andy Burnham to take his place. \"I am a fan of Andy. I mean, he's the King of the North!\" she told the magazine. Although Mr Burnham would first need to be elected to parliament to be able to become leader. Mainstream, a Labour grouping backed by Mr Burnham, has welcomed Ms Egan's election as Unison general secretary, saying: \"This result shows clearly that vast swathes of Labour's historic coalition feel the government has fallen out of step with its mainstream. \"By working hand in hand with our partners in the trade union movement, the Labour Party has ushered in huge advances for working people before and it can do so again - but only if the party rediscovers its progressive instincts.\" Despite her criticisms of him, Sir Keir was quick to congratulate Ms Egan, writing on X: \"Congratulations to @Andrea4GS on her election as general secretary of UNISON. I look forward to working with her.\" He also paid tribute to Ms McAnea for her \"outstanding contribution to the Labour and trade union movement\", and playing an \"important role in securing the landmark Employment Rights Bill\", which passed both Houses of Parliament on Tuesday."
    },
    {
        "title": "Unison leadership result shows Starmer's grip on Labour machine is slipping",
        "description": "Unison has until now been one of the most loyal unions to Labour under Sir Keir Starmer - but as of Wednesday, that is no longer the case.",
        "url": "https://news.sky.com/story/unison-result-shows-starmers-grip-on-the-labour-machine-is-slipping-13484692",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-keir-starmer-downing-street_7104783.jpg?20251208133510",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-12-17 10:27:00",
        "Headline": "Andrea Egan's election shows the left is on the march - in what will be welcome news for Andy Burnham.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n Unison has until now been one of the most loyal unions to Labour under Sir Keir Starmer - but as of Wednesday, that is no longer the case. The union with a reputation for being moderate has just elected left-winger Andrea Egan as its new general secretary, replacing Christina McAnea who served in the top role since 2021. The development is a significant blow to the prime minister and Number 10, who strongly backed Ms McAnea's campaign for re-election. The fact she lost, and turnout was so low, is seen as a damning indictment of the Downing Street operation and is seen as a boost to any potential Andy Burnham leadership bid. It has parallels with how Lucy Powell's election as deputy leader in October was seen as a repudiation of Sir Keir's ailing leadership. With Ms McAnea now gone, the safe haven she provided for Sir Keir against the continued criticism of Unite, another key party donor, has vanished. Instead, he faces hostility on two fronts from the two biggest unions in the country. As one Labour insider put it: \"Keir's grip on the party and its organs is slipping.\" \n                  Almost two in three Labour members back Burnham over Starmer for leader, poll shows\n                 \n                  More than half of Labour members do not want Starmer to lead party into next general election - poll\n                 \n                  Andy Burnham says Labour MPs want him to oust Starmer\n                 What's more, Sir Keir could find that Ms Egan could enter her new role with an axe to grind. In 2022, when Labour was in opposition and was accused of blocking left-wing candidates from standing for parliament, Ms Egan found herself expelled for her links to Socialist Appeal, a small Trotskyist group which the party said did not share its \"aims or values\". 'You reap what you sow' For critics of Sir Keir and Number 10, Ms Egan's election is a sign that their style of party management has come back to bite them. Not only is Ms Egan likely to follow Sharon Graham, the Unite general secretary, in publicly criticising Labour - there is also talk in union circles that she may push to disaffiliate from the party altogether, further fracturing its fragile coalition. One supporter said Ms Egan was a \"long-term Labour person who should have never been expelled\" and added: \"You reap what you sow.\" Reacting to Ms Egan's election, another source told Sky News: \"Unison is the biggest union in the country, Labour's biggest affiliate, and has generally been in the 'critical friend' camp over the years. It's now led by someone who was thrown out of the party three years ago. This could go anywhere.\" They added: \"Andrea can't control everything - there's an elected national executive and conference - but it's huge for Labour, taken together with how Unite behave.\" Another Labour insider said Ms Egan's election showed there had been a \"mood shift in Labour's support base\" and that Sir Keir \"seems completely blind to the real threat to his leadership\". \"It's not Reform, it's his own voters who are absconding en masse to more left-wing alternatives.\" Read more:Open borders 'not pragmatic right now', says Green Party leader'Urgent' review into foreign interference in British politics Boost for Burnham? Even before her election, Ms Egan made it clear she thinks there is a better left-wing alternative to Sir Keir - none other than the ambitious Greater Manchester mayor Andy Burnham. Her victory has fuelled chatter that Mr Burnham's shaky path back into parliament could be made a little smoother by gifting him more allies on Labour's National Executive Committee (NEC), the party's ruling body which holds his fate in its hands. If Mr Burnham were to run for parliament in a potential by-election, he would need to be accepted on to the shortlist of candidates controlled by the NEC. Unison currently has two representatives on the committee who could now end up reflecting Ms Egan's views, thereby strengthening the voice of the left on the body that has long been dominated by Starmer loyalists - although the fundamental makeup will not change. For the soft left, Ms Egan's election may not shift the dial totally away from Sir Keir but it is symbolic. It confirms what they have long suspected - that the mood music is changing, and it's not to a tune the prime minister will like."
    },
    {
        "title": "Roman Abramovich: PM demands Russian oligarch transfers £2.5bn to help Ukraine or face legal action",
        "description": "The UK government has demanded that Russian oligarch Roman Abramovich gives &#163;2.5bn from the sale of Chelsea Football Club to be used for humanitarian purposes in Ukraine, or face legal action.",
        "url": "https://news.sky.com/story/roman-abramovich-pm-demands-russian-oligarch-transfers-16325bn-to-help-ukraine-or-face-legal-action-13484841",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-keir-starmer-roman-abramovich_7113120.jpg?20251217145554",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-17 14:36:00",
        "Headline": "Roman Abramovich has been told to transfer the frozen profits from the sale of his stake in Chelsea FC for humanitarian assistance in Ukraine, or be taken to court.",
        "Content": "The UK government has demanded that Russian oligarch Roman Abramovich gives £2.5bn from the sale of Chelsea Football Club to be used for humanitarian purposes in Ukraine, or face legal action. Sir Keir Starmer announced at Prime Minister's Questions at lunchtime that the Treasury is issuing a licence for the transfer of the frozen funds to a foundation to be used to provide aid in Ukraine. If he does not do so within 90 days, the government will take him to court in the UK. Politics latest: UK to rejoin EU's Erasmus student exchange scheme The prime minister said: \"My message to Abramovich is this: the clock is ticking, honour the commitment that you made, and pay up now. \"And if you don't, we're prepared to go to court, so every penny reaches those whose lives have been torn apart by Putin's illegal war.\" Home Secretary Yvette Cooper told Sky News political editor Beth Rigby the government has \"tried every possible avenue to get him to do the right thing\", but it has \"come to nothing\". \n                  Teachers to be trained to spot signs of misogyny in boys and teach about healthy relationships\n                 \n                  Jess Phillips on tackling violence against women and girls: 'I've tried to talk to my children about strangulation - it's not normal sexual behaviour'\n                 \n                  Politics latest: Abramovich cash from Chelsea sale must be used for aid in Ukraine, says foreign secretary\n                 Mr Abramovich rose to prominence in the UK when he bought Chelsea Football Club in 2003, before pumping billions into the club, winning several trophies including multiple Premier League titles and the Champions League. He made his billions in the post-Soviet Russian era, and has been said to be an ally to Vladimir Putin. However, when Russia invaded Ukraine in 2022, Mr Abramovich was sanctioned by the Boris Johnson government due to his links to the Russian leader. As part of this, he was forced to sell his stake in Chelsea, and he announced that the frozen proceeds would be earmarked \"for the benefit of all victims of the war in Ukraine\", including \"providing critical funds towards the urgent and immediate needs of victims, as well as supporting the long-term work of recovery\". But the £2.5bn received for the sale has stayed in the deep freeze ever since, not available to support Kyiv and kept in an inaccessible account. Asked by journalists if Mr Abramovich has given a reason for not agreeing to transfer the funds for use in Ukraine, the prime minister's official spokesman said: \"He disputes that the funds should be used exclusively for humanitarian purposes in Ukraine. \"He wants to spend them more widely. And negotiations on this have not resulted in an agreed outcome.\" Ms Cooper said the government has been \"very clear\" the proceeds from the Chelsea sale \"need to go into humanitarian support in Ukraine\". \"It is the Ukrainian people who have suffered as a result of Putin's aggression as a result of this war, and that is where this funding needs to go,\" she added. Downing Street said Mr Abramovich would need to set up the foundation and arrange the transfer in line with the licence, otherwise legal action would be taken - although the spokesperson would not say under what legislation they would take action under. This move from the UK government is in line with a wider European push for Moscow to foot the bill for deaths and destruction triggered by its invasion. Sky News has contacted Mr Abramovich's last known legal representatives in the United States and Belgium for comment."
    },
    {
        "title": "Alzheimer's among elderly more widespread than previously thought, new study shows",
        "description": "Alzheimer's disease is more widespread in people above the age of 85 than previously thought, a pioneering study has suggested.",
        "url": "https://news.sky.com/story/alzheimers-among-elderly-more-widespread-than-previously-thought-new-study-shows-13484660",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-blood-test-study_7112827.jpg?20251217103411",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-17 15:58:00",
        "Headline": "The study found more than one in 10 people over the age of 70 would meet the criteria for drugs that can slow down the early stages of the disease.",
        "Content": "Alzheimer's disease is more widespread in people above the age of 85 than previously thought, a pioneering study has suggested. Researchers used a simple blood test to search for biomarkers associated with the development of dementia. The study also found more than one in 10 people over the age of 70 would meet the criteria for drugs that can slow down the early stages of Alzheimer's. Researchers at King's College London, University of Gothenburg and Stavanger University Hospital analysed 11,486 blood samples provided by people over the age of 57 taking part in the Trondelag Health Study (HUNT) in Norway. They looked for how regularly proteins in the blood that have been linked to cognitive impairment came up, or the gradual deterioration in thinking, memory and reasoning. The frequency of Alzheimer's disease neuropathological changes (ADNC) - deposits of proteins in the brain that lead to the death of nerve cells - grew with age, according to the analysis. The study found it was higher in older people, but lower than previously estimated in the younger groups. ADNC was present in fewer than 8% of those aged 65-69, jumping to 65.2% in patients over the age of 90. Read more from Sky News:UK to rejoin Erasmus in 2027Inflation falls by more than expected In people over 70, the study found 10% had symptomless pre-clinical Alzheimer's disease, while 9.8% had Alzheimer's dementia. Some 10.4% had prodromal Alzheimer's, the stage between pre-clinical and dementia, when memory and thinking problems due to cognitive impairment are noticeable. Researchers suggest 11% of the over-70s group would be eligible for antibody treatments, which slow down the early stages of Alzheimer's. These drugs include lecanemab and donanemab, which are licensed for UK use but will not be made available on the NHS after the spending watchdog argued their benefits are \"too small\" to justify the cost. Researchers also found ADNC \"was more prevalent in individuals with lower education\". Dr Richard Oakley, associate director of research and innovation at Alzheimer's Society, said: \"This is the first time we've seen this type of data from such a large group of people, with over 11,000 blood samples analysed. \"It is a stark reminder of the scale of dementia. We already know it's the UK's biggest killer, but its impact may be even bigger than we think.\" He added: \"Blood tests could transform how Alzheimer's disease is diagnosed. They are quicker, cheaper and can be easier for patients than scans or lumbar punctures. Ultimately, these tests could help many more people get a diagnosis earlier.\" Blood tests to diagnose Alzheimer's are also not available on the NHS. Doctors currently use lumbar punctures or PET scans to test for ADNC. But a trial announced in September will recruit 1,100 people from memory clinics to investigate how well a blood test works on the health service, with results expected in three years. Dag Aarsland, a professor of old age psychiatry at King's Institute of Psychiatry, Psychology & Neuroscience (IoPPN), said of the Trondelag Health Study findings: \"If we are to meet this global challenge, it is vital that we are able to detect signs of dementia at the earliest possible stages. \"This blood test looks to be an effective means of providing that clarity at scale.\""
    },
    {
        "title": "Final frontier: The race to control space",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/final-frontier-the-race-to-control-space-13484885",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-daily-pod-space-race_7113207.png?20251217163312",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-17 16:43:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 It's been 25 years since an astronaut crew first set foot on the International Space Station - and it's been occupied ever since. The ISS is set to be \"deorbited\" in 2030, where NASA will \"safely dispose\" of it into a remote part of the ocean. But humankind's ambition to explore the universe remains as limitless as ever. What will the new space race between the US and China look like? Or could the ambitions of tech billionaires Elon Musk and Jeff Bezos take us into another dimension? Niall is joined by Sky's science correspondent Thomas Moore. Producer: Tom GillespieEditor: Mike Bovill"
    },
    {
        "title": "Oscars set to leave ABC and will be streamed live on YouTube from 2029",
        "description": "The Oscars will be streamed live on YouTube from 2029 after being broadcast on the ABC network for decades.",
        "url": "https://news.sky.com/story/oscars-set-to-leave-abc-and-will-be-streamed-live-on-youtube-from-2029-13484929",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-oscar-statuettes-oscars_7113469.jpg?20251217220012",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-17 18:28:00",
        "Headline": "The Academy of Motion Picture Arts and Sciences announced the move on Wednesday, saying YouTube will have the exclusive global rights to the Oscars from 2029 to 2033.",
        "Content": "The Oscars will be streamed live on YouTube from 2029 after being broadcast on the ABC network for decades. It means the annual film awards will be available to the video-sharing platform's two billion users for free around the world in four years. The Academy of Motion Picture Arts and Sciences announced the deal with Google-owned YouTube on Wednesday, saying the streaming giant will have the exclusive global rights to the Hollywood awards from 2029 to 2033. YouTube will effectively be the home to all things Oscars, including red-carpet coverage, the Governors Awards and the Oscar nominations announcement. The Academy Awards ceremony has been broadcast by ABC for most of its history, but 2028 will be its last year showing the Oscars as they celebrate their 100th anniversary. \"The Oscars, including red carpet coverage, behind-the-scenes content, Governors Ball access, and more, will be available live and for free to over two billion viewers around the world on YouTube, and to YouTube TV subscribers in the United States,\" an announcement on the Academy Awards' website read. \"We are thrilled to enter into a multifaceted global partnership with YouTube to be the future home of the Oscars and our year-round academy programming,\" said academy chief executive Bill Kramer and academy president Lynette Howell Taylor. \n                  Diane Keaton's family issue statement as cause of death given\n                 \n                  Oscars 2025: Anora sweeps the Academy Awards with five awards including best picture\n                 \n                  Oscars backstage: Six highlights from the Academy Awards winners room\n                 They said the new partnership with the platform \"will allow us to expand access to the work of the academy to the largest worldwide audience possible\". 'Inspiring new generation of creativity and film lovers' \"The Oscars are one of our essential cultural institutions, honouring excellence in storytelling and artistry,\" said YouTube chief executive Neal Mohan. \"Partnering with the academy to bring this celebration of art and entertainment to viewers all over the world will inspire a new generation of creativity and film lovers while staying true to the Oscars' storied legacy.\" Read more from Sky News:Paramount backer pulls out of Warner Bros takeover bidSydney Sweeney on challenges women face to 'have it all' The awards will be available with audio tracks in many languages, in addition to closed captioning. Last year's Academy Awards were watched by 19.7 million viewers on the Disney-owned ABC, a five-year high but far below the show's biggest audience of 57 million in 1998. The network has been the broadcast home to the Oscars for almost its entire history. NBC first televised the Oscars in 1953, but ABC picked up the rights in 1961. Aside from a period between 1971 and 1975, when NBC again aired the show, the Oscars have been on ABC."
    },
    {
        "title": "Rob Reiner's son appears in court accused of murdering Hollywood director and wife",
        "description": "Rob Reiner's son Nick made his first court appearance on Wednesday on two counts of first-degree murder in the killing of his parents.",
        "url": "https://news.sky.com/story/rob-reiners-son-appears-in-court-accused-of-murdering-hollywood-director-and-wife-13484931",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nick-reiner-murder_7113354.jpg?20251217195009",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-17 20:01:00",
        "Headline": "Nick Reiner, the youngest son of Rob Reiner and Michele Singer, appeared in court in shackles and weaning a suicide prevention smock, as he faces charges of first-degree murder in the killing of his parents. ",
        "Content": "Rob Reiner's son Nick made his first court appearance on Wednesday on two counts of first-degree murder in the killing of his parents. Wearing a suicide prevention smock and shackles, the 32-year-old did not enter a plea as he appeared from behind the glass wall of a custody area. His next court appearance will be on 7 January. As it happened: Nick Reiner makes first court appearance Nick Reiner spoke only to say, \"yes, your honour\" to agree to the date. He was charged Tuesday with killing the 78-year-old actor and director Rob Reiner and his wife, Michele Singer Reiner, Los Angeles County District Attorney Nathan Hochman announced at a news conference. Nick Reiner is being held without bail and could face the death penalty. Along with the two counts of first-degree murder, prosecutors added a special circumstance of multiple murders, as well as an allegation that he personally used a dangerous and deadly weapon, a knife. Speaking outside the court, Nick Reiner's lawyer, Alan Jackson, called on the public not to \"rush to judgement\". Mr Jackson pointed to \"complex and serious issues that are associated with this case\" that needed to be thoroughly and \"very carefully dealt with and examined\". He added that it was a \"devastating tragedy that has befallen the Reiner family\". 'Unimaginable pain' Nick Reiner's two siblings Jake and Romy have released a statement, saying \"words cannot even begin to describe the unimaginable pain we are experiencing every moment of the day\". \"The horrific and devastating loss of our parents, Rob and Michele Reiner, is something that no one should ever experience,\" they said. \"They weren't just our parents; they were our best friends. We are grateful for the outpouring of condolences, kindness, and support we have received not only from family and friends but people from all walks of life.\" The two asked for \"respect and privacy\" and for speculation to be treated with \"compassion and humanity\". Authorities have not disclosed a motive for the killings. Rob Reiner and Michele Singer Reiner were found dead from apparent stab wounds in their home in the upscale Brentwood neighbourhood of Los Angeles. Read more from Sky News:Moment Nick Reiner arrested for murder of his parentsCould Reiner actually face the death penalty? Nick Reiner did not resist when he was arrested hours later near the University of Southern California, about 14 miles (22.5 kilometres) from the crime scene, according to police. Rob Reiner was a celebrated director, whose work included some of the most memorable films of the 1980s and 1990s, including This Is Spinal Tap, The Princess Bride, When Harry Met Sally and A Few Good Men. He met Michele Singer, a photographer, movie producer and advocate for LGBTQ+ rights, in 1989, while directing When Harry Met Sally."
    },
    {
        "title": "Kneecap's charity run cheered on by Irish president",
        "description": "Moglai Bap of the hip hop trio&#160;Kneecap took part in a charity run through Dublin, along with more than 200 runners, with the Irish president cheering them on.",
        "url": "https://news.sky.com/story/kneecaps-charity-run-cheered-on-by-irish-president-13484887",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-kneecap-moglai-bap_7113225.jpg?20251217165713",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-17 16:43:00",
        "Headline": "More than 200 runners took part in a 10km fundraiser for Gaza, led by Kneecap's Moglai Bap ahead of the trio's Dublin show.",
        "Content": "Moglai Bap of the hip hop trio Kneecap took part in a charity run through Dublin, along with more than 200 runners, with the Irish president cheering them on. The 10km (6.2 miles) event was organised by the Belfast rap group to raise funds for the Gaza Food and Play project, which provides emergency food, water and crucial psychosocial support for children in Gaza. Many of the runners carried Palestinian flags, wore Bohs jerseys, and chanted \"Free Palestine\" along the route. As the group approached the presidential residence, Áras an Uachtaráin, they paused near a gap in the surrounding hedge to cheer and clap for president Catherine Connolly as she offered words of encouragement. Addressing Moglai Bap, whose real name is Naoise Ó Cairealláin, in Irish, Ms Connolly told him to keep going. The runners briefly stopped to snap selfies across the boundary separating the public park from the presidential grounds, with some calling out encouragement like \"good on you\" and \"fair play.\" Climate activist Greta Thunberg also took part in the event. \n                  Terror charge against Kneecap rapper cannot continue, court says\n                 \n                  Canada bans Kneecap from entering country as rappers threaten legal action\n                 \n                  Sky Arts Awards: Charli XCX, Kneecap and Sally Rooney among nominees\n                 The charity run took place as Kneecap got ready to play the second night of their two sold-out shows at Dublin's 3Arena on Wednesday. Read more from Sky News:Duke of Marlborough charged with strangulation offencesPM attacks 'utterly irresponsible' doctors' strikes Kneecap have attracted controversy for their provocative lyrics and outspoken political views. Their explicit style and vocal support for Palestine have divided opinion, with supporters praising their defiance and critics accusing them of courting controversy. Last year, Kneecap won a discrimination case against the UK government after then business secretary Kemi Badenoch attempted to block the band from receiving a £14,250 funding award."
    }
]