[
    {
        "title": "'Toxic' army unit charged with investigating sex crimes allowing abusers to 'get away with it' in own ranks, whistleblower says",
        "description": "More than a dozen women came forward to report a staff sergeant&#160;in the Royal Military Police (RMP) for sexual abuse, but he was allowed to resign from the army instead of face charges.",
        "url": "https://news.sky.com/story/toxic-army-unit-charged-with-investigating-sex-crimes-allowing-abusers-to-get-away-with-it-in-own-ranks-whistleblower-says-13368216",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-royal-military-police_6917105.png?20250515121926",
        "type": "Home",
        "Author": "Becky Johnson, social affairs correspondent, and Rebecca Spencer, specialist producer",
        "Date Published": "2025-05-15 10:15:00",
        "Headline": "A female veteran of the Royal Military Police tells Sky News she experienced sexual harassment and assault, and heard rape allegations against male colleagues.",
        "Content": "By Becky Johnson, social affairs correspondent, and Rebecca Spencer, specialist producer   More than a dozen women came forward to report a staff sergeant in the Royal Military Police (RMP) for sexual abuse, but he was allowed to resign from the army instead of face charges. Warning: This article contains material some readers may find distressing That's the claim of a whistleblower who served as a sergeant in the RMP for over a decade and says she was one of the man's victims. Amy, not her real name, says a \"toxic\" culture in the military police means sexual predators in the army are \"getting away with stuff that they shouldn't be getting away with\". It's a rare insight into life inside the Royal Military Police, the corps charged with investigating crime in the army. Amy described how the man who assaulted her would go into women's rooms and sit on their beds. She says he used to force her to go out driving with him at night and talk about sex. \"He preyed on the young, new females that were in the unit,\" she says. \n                  'Sensitive military documents' found in Newcastle street\n                 \n                  Jaysley Beck: Mother of soldier who took her own life says she has 'sleepless nights' knowing there are still abusers in the Army \n                 \n                  Army sexual harassment investigations to be removed from chain of command\n                 \"One day, I was out with my friends in town and he was on patrol... There were two of us that went over to speak to him and I had quite a low-cut top on. \"So he hooked his finger around my top and pulled my boob out\". She recalls as she tried to stop him, \"he grabbed my hand and put it on his penis\". She claims there are other men in the RMP who've been accused of sexual offences, recalling hearing of five separate allegations of rape against male colleagues by female colleagues. \"If all of this sexual assault and bullying and rapes are going on within the military police, how can they then go out and investigate the wider army for doing the same things?\" she says. \"It doesn't work.\" 'He got away with it' Looking back on her career in the army is difficult for Amy. After leaving, she tried to settle back into life as a civilian with a new job and a young family to look after, but says she worried about bumping into former colleagues in the street. \"It's taken me a long time to heal,\" she says. \"I was very bitter towards my military career when I left, but I've had to sort of learn, build myself up again and remember the good times because they were really good times as well... I think it was just so bad at points.\" When she joined the RMP, she believed she would be part of a unit \"representing how the rest of the soldiers should be conducting themselves\". The reality, she says, was that she had become part of \"one of the most toxic\" corps in the army. She recalls being told that the staff sergeant she had reported for sexual assault would be allowed to resign. \"They basically told me he's not going to be charged, but will be leaving the military... doing him a favour,\" she says. \"He got away with it all,\" she adds. \"He's not going to lose his pension and whatever else he would have lost with a dishonourable discharge. \"He's left without a criminal record... that's not safe for civilians as well, because it's not even on his record.\" 'They investigate themselves' Earlier this year, an inquest into the suicide of 19-year-old Royal Artillery Gunner Jaysley Beck found she had been failed by the army after reporting sexual assault and harassment. Since then, Sky News has reported claims of widespread abuse and growing calls for investigations into sexual offences to be removed from the RMP and instead carried out by civilian police.  The Labour chair of the influential House of Commons Defence Committee is now urging the government to act. Tan Dhesi told Sky News: \"The system needs to change... incidents of sexual violence and sexual assault should be dealt with not by the Royal Military Police but by civilian police and civilian courts. \"I hope that the government will be making that substantial change in the very, very near future; in fact, they should do it ASAP.\" Since Gunner Beck's death, a new tri-service complaints team has been announced by the Ministry of Defence (MoD). The change will see bullying, harassment, discrimination related service complaints dealt with by a team outside the commands of the Royal Navy, British Army and Royal Air Force. However, Amy believes investigations need to be done \"completely separately from the military\". \"Otherwise it doesn't work because friends will be investigating friends,\" she says. \"I think there's such a male-dominated space in the military still. Women have no chance... and it's not fair because people are getting away with stuff that they shouldn't be getting away with and allowed to continue doing it and ruining lives.\" She believes the entire system lacks accountability. \"They investigate themselves,\" she says, even down to how the RMP is regulated. \"The people that run that unit are RMP. They get posted in, do a few years and then get posted back out.\" 'I was told off for reporting it' Katie, also not her real name, served in the army for over 20 years. She saw active service in Afghanistan and rose to the rank of Captain. It was a distinguished career that was brought to a premature end by sexual abuse and whistleblowing. Having taken the difficult decision to leave the army she now leads a secluded life and suffers poor mental health. \"I still struggle,\" she says. \"I'm still very wary of men. My relationship is strained. \"Everything seems like black and white now, like I live my life in black and white rather than full colour... As a person, it has changed my life forever.\" To begin with, she was in the same unit that Gunner Beck would join years later. She too experienced harassment and abuse, and says her line manager \"laughed\" when she reported it. \"I just felt like dehumanised, I felt like property, I didn't feel like a person anymore,\" she says. \"And so I would avoid people... I would hide in the garages, behind the tanks, in between the guns, just praying that these people hadn't seen me and I might be able to escape them for that day.\" She moved to a different unit but says wherever she went, abuse was rife. After being groped by a higher-ranking colleague, she assumed her chain of command would escalate her report to the RMP. Instead, she says she was \"put in front of the Sergeant Major and told off\". \"I remember at the time saying I'd like to call the civilian police, and I was told that I wasn't allowed to do that and I'd be disciplined if I tried to do that,\" she said. \"So I was so frightened.\" She stayed in the army, hoping to make a difference. As an officer, she began reporting abusers on behalf of younger victims. \"I kept this goal in my head of reaching a position one day where I could help other women,\" she said. \"When I got there, I realised that it was way more toxic than I could have ever imagined. \"The officer corps were actually the worst perpetrators of all because they brushed it under the carpet. There was a will and a need more to protect themselves or their friends. Or the reputation of the unit first and foremost.\" She believes changes made by the MoD since the death of Gunner Beck to remove the chain of command from sexual abuse investigations will make \"little difference\", saying they'll still be carried out by \"the same people, but just under a new title\". Email: sky.today@sky.uk or WhatsApp 07583 000 853 'They should be held accountable' An MoD spokesperson told Sky News that \"unacceptable and criminal behaviour has absolutely no place in our Armed Forces\". They added: \"That is why this government is creating a new Tri-Service Complaints team to take the most serious complaints out of the chain of single service command for the first time, and has launched a new central taskforce on Violence Against Women and Girls to give this issue the attention it deserves. \"We are also establishing an independent Armed Forces Commissioner with the power to visit defence sites unannounced, and to investigate and report to parliament any welfare matters affecting service life.\" Amy believes the RMP is not fit for purpose. \"They have higher standards to uphold, yet they don't uphold them within their own regiment, within their own lives, and then they're expected to police and uphold those standards throughout the rest of the army,\" she says. \"At the end of the day, they know the law and they should be held accountable for what they do.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "MPs waver once again as 'emotive' assisted dying bill heads back to the Commons",
        "description": "Further moves to amend the controversial assisted dying bill are being made by MPs as it returns to the Commons for another day of emotionally charged debate.",
        "url": "https://news.sky.com/story/mps-waver-once-again-as-emotive-assisted-dying-bill-heads-back-to-the-commons-13368612",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-assisted-dying-westminister_6917878.jpg?20250516012630",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-05-15 19:33:00",
        "Headline": "After a marathon committee stage, when more than 500 amendments were debated, the bill returns to the Commons with 130 amendments tabled.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Further moves to amend the controversial assisted dying bill are being made by MPs as it returns to the Commons for another day of emotionally charged debate. After a marathon committee stage, when more than 500 amendments were debated, of which a third were agreed, the bill returns to the Commons with 130 amendments tabled. As a result, the final and decisive votes on whether the bill clears the Commons and heads to the House of Lords are not expected until a further debate on 13 June. The bill proposes allowing terminally ill adults with less than six months to live to receive medical assistance to die, with approval from two doctors and an expert panel. Why is assisted dying so controversial - and where is it already legal? In a historic vote last November, after impassioned arguments on both sides, MPs voted 330 to 275 in favour of Labour MP Kim Leadbeater's Terminally Ill Adults (End of Life) Bill. Sir Keir Starmer voted in favour, while Deputy PM Angela Rayner, Foreign Secretary David Lammy, Health Secretary Wes Streeting and Justice Secretary Shabana Mahmood voted against. \n                  Assisted dying law 'unworkable, unaffordable and naive', says partnership of UK's leading social care groups\n                 \n                  Royal College of Psychiatrists pulls support for assisted dying bill\n                 \n                  Plans to legalise assisted dying in Scotland pass first stage\n                 The Conservatives were also split, with leader Kemi Badenoch voting in favour and former PM Rishi Sunak against. Reform UK leader Nigel Farage also voted against the bill.  The PM, who is attending a summit in Albania, will be absent this time, but asked for his current opinion, told reporters: \"My views have been consistent throughout.\" No fewer than 44 of the new amendments have been tabled by Ms Leadbeater herself, with government backing, a move that has been criticised by opponents of the bill. Opponents also claim some wavering MPs are preparing to switch from voting in favour or abstaining to voting against and it only needs 28 supporters to change their mind to kill the bill. Confirmed switchers from voting in favour to against include Tory MPs George Freeman and Andrew Snowden, Reform UK chief whip Lee Anderson and ex-Reform MP Rupert Lowe. Labour MP Debbie Abrahams and Tory MP Charlie Dewhirst, who abstained previously, are now against and Labour's Karl Turner, who voted in favour at second reading, is now abstaining.  Mr Turner, a former barrister, told Sky News that an amendment to replace a high court judge with a panel of experts \"weakens the bill\" by removing judicial safeguards. But in a boost for the bill's supporters, Reform UK's Runcorn and Helsby by-election winner Sarah Pochin, a former magistrate, announced she would vote in favour. Her predecessor, Labour's Mike Amesbury, voted against. \"There are enough checks and balances in place within the legislation - with a panel of experts assessing each application to have an assisted death, made up of a senior lawyer, psychiatrist, and social worker,\" said Ms Pochin, who is now the only Reform UK MP supporting the bill. A Labour MP, Jack Abbott, who voted against in November, told Sky News he was now \"more than likely\" to vote for the bill, which was now in a much stronger position, he said. Ms Leadbeater's supporters strongly deny that the bill is at risk of collapse and are accusing its opponents of \"unsubstantiated claims\" and of \"scare stories\" that misrepresent what the bill proposes.  \"There is a pretty transparent attempt by opponents of the bill to try to convince MPs that there's a big shift away from support when that simply isn't true,\" an ally of Ms Leadbeater told Sky News. Speaking in an LBC radio phone-in on the eve of the debate on the amendments, Ms Leadbeater said she understood her bill was \"an emotive issue\" and there was \"a lot of passion about this subject\". But she said: \"I would be prepared to be involved in a compassionate end to someone's life if that was of their choosing. And it's always about choice. I have friends and family who are very clear that they would want this option for themselves. \"There is overwhelming public support for a change in the law and literally everywhere I go people will stop me and say thank you for putting this forward. I would want this choice.\" Read more:Ukrainian man charged over fires at properties and car linked to PMAn embarrassment for Starmer on migrant return hubs? Also ahead of the debate, health minister Stephen Kinnock and justice minister Sarah Sackman wrote to all MPs defending the government's involvement in Ms Leadbeater's amendments to her bill. \"The government remains neutral on the passage of the bill and on the principle of assisted dying, which we have always been clear is a decision for parliament,\" they wrote. \"Government has a responsibility to ensure any legislation that passes through parliament is workable, effective and enforceable. \"As such, we have provided technical, drafting support to enable the sponsor to table amendments throughout the bill's passage. We have advised the sponsor on amendments which we deem essential or highly likely to contribute to the workability of the bill.\""
    },
    {
        "title": "Thousands of Ukrainian civilians lost in hellish archipelago of Russian jails",
        "description": "In all the horrors of this war, the plight of thousands of civilians abducted by Russia is one of the worst, but is in danger of being overlooked.",
        "url": "https://news.sky.com/story/thousands-of-ukrainian-civilians-lost-in-hellish-archipelago-of-russian-jails-13368705",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ukraine-russia_6917834.png?20250515233045",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-05-15 22:17:00",
        "Headline": "Their plight is truly horrific. Ukraine has identified almost 16,000 names of people lost in a gulag of 180 prisons in Russian-held Ukraine and in Russia itself, as far away as Siberia.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  In all the horrors of this war, the plight of thousands of civilians abducted by Russia is one of the worst, but is in danger of being overlooked. Warning: This report contains details of torture and sexual abuse Their fate is not mentioned for instance in Donald Trump's peace plan currently being wrestled over, let alone any demands they are released by Russia. But their plight is truly horrific. Ukraine has identified almost 16,000 names of people lost in a gulag of 180 prisons in Russian-held Ukraine and in Russia itself, as far away as Siberia. It is a war crime to take civilians hostage during a conflict but that has not deterred Vladimir Putin's regime. Worse, there is abundant evidence they are being tortured, sexually abused and killed in custody. Oleksandra Matviichuk, a Nobel Prize-winning Ukrainian human rights lawyer, said: \"I interviewed hundreds of people who survived Russian captivity, men and women, mostly civilians, and they told me how they were beaten, raped, smashed into wooden boxes. \"Their fingers were cut, their nails were torn away, their nails were drilled. There were electrical shocks through their genitalia. One woman told me how her eye was dug out with a spoon.\" When the Russians took territory north of Kyiv at the start of their illegal invasion, they came for the men, among them Dmytro Khilyuk. Apart from a short letter sent from captivity a few months later, his elderly parents have not seen him since. Read more from Sky News:Ukrainian man charged over fires at properties linked to StarmerHamas confirms direct peace talks with US - exclusivePolice hunt for teens seen 'carrying dismembered kittens in bag' 'I just can't take it anymore' \"We're old and we're sick,\" his mother Halyna, bedridden after a stroke, told us. \"We've been without our only child for four years now, not knowing anything, where he is, how he is.\" She wept as she told us of the agony of living with the uncertainty about their son. \"I just can't take it anymore. Why is my child suffering like this? It's been four years. All we get are endless talks, talks, and more talks. And nothing changes. I could die any day… and never see my child again.\" Khilyuk has lost half his weight and most of his teeth A year ago a fellow prisoner who had shared a cell with Mr Khilyuk was released. He said Mr Khilyuk had lost half his weight and most of his teeth. Fellow journalist and friend of Mr Khilyuk, Stas Kozluk, told us he was worried about his state of mind. \"We just can't imagine what can happen with the mind of a human being that's captured and spends three years in that condition. To be honest, I don't know how to help him. And that's the most terrifying thing,\" he said. Russia releases no information Ukrainian authorities can only piece together information about the abducted civilians. Mr Kozluk told us those who've been detained learn the phone numbers and names of relatives of others they are held with. Those who are released pass on what information they can. Russia releases no information about those civilians it is holding illegally, against the rules of war. 'The world doesn't understand' Thousands of innocent civilians are lost in a hellish archipelago of Russian jails notorious for their evil regime of abuse. And the world, says Oleksandra Matviichuk, is in danger of forgetting about them. \"I think the world doesn't understand, first, the cruelty and unhuman conditions in which Ukrainians are held in Russian captivity,\" she says. \"Second, they don't understand that Russia detained not just military, but civilians. And according to the Geneva Convention, they have to be released immediately without any exchanges, without any conditions.\" Diplomatic efforts to end this war grind on fitfully. But there has been very little pressure on Russia to end its illegal abduction of thousands of innocents."
    },
    {
        "title": "US singer Chris Brown charged with GBH over alleged attack in London",
        "description": "US singer Chris Brown has been charged with grievous bodily harm with intent in connection with a 2023 incident in London.",
        "url": "https://news.sky.com/story/us-singer-chris-brown-charged-with-gbh-13368710",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-chris-brown_6917859.jpg?20250516000703",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-15 22:36:00",
        "Headline": "The 36-year-old was arrested at a hotel in Manchester in the early hours of Thursday by detectives from the Metropolitan Police.",
        "Content": "US singer Chris Brown has been charged with grievous bodily harm with intent in connection with a 2023 incident in London. He remains in custody and is due to appear at Manchester Magistrates' Court at 10am this morning, police said. The charge relates to an assault which reportedly took place at a venue in Hanover Square in Mayfair on Sunday 19 February 2023. The 36-year-old was arrested at a hotel in Manchester in the early hours of Thursday by detectives from the Metropolitan Police. The Sun has reported that the R&B singer flew into Manchester Airport on a private jet on Wednesday afternoon. Adele Kelly, the deputy chief crown prosecutor for CPS London North, said: \"We have authorised the Metropolitan Police to charge Chris Brown with one count of grievous bodily harm, contrary to section 18 of the Offences Against the Person Act 1861. \"The alleged incident occurred in London on 19 February 2023. \n                  Cassie challenged over Diddy 'freak off' allegations - as explicit messages read in court\n                 \n                  Smokey Robinson under criminal investigation over rape and sexual assault allegations\n                 \n                  Gary Lineker apologises for 'Zionism' re-post featuring image of rat\n                 \"He will have his first court appearance on Friday 16 May at Manchester Magistrates' Court. Read more from Sky News:Ukrainian charged over fires at homes linked to StarmerKing 'flabbergasted' by magician's money trickSiblings jailed over 'truly sickening' murder  \"The Crown Prosecution Service reminds all concerned that criminal proceedings against this defendant are active and that he has the right to a fair trial. \"It is extremely important that there should be no reporting, commentary or sharing of information online which could in any way prejudice these proceedings.\" The Go Crazy singer is set to tour the UK in June and July, with dates at Co-Op Live in Manchester and Principality Stadium in Cardiff. His representatives have been contacted for comment."
    },
    {
        "title": "US 'doesn't have high expectations' for Ukraine-Russia negotiations, Marco Rubio admits",
        "description": "The United States \"doesn't have high expectations\" for negotiations in Turkey between Russia and Ukraine to end the war, America's top diplomat has admitted.",
        "url": "https://news.sky.com/story/us-doesnt-have-high-expectations-for-ukraine-russia-negotiations-marco-rubio-admits-13368629",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-zelenskyy-putin_6886829.jpg?20250414211955",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-15 20:12:00",
        "Headline": "The US secretary of state said he did not think there would be a \"breakthrough\" in peace negotiations until Donald Trump and Vladimir Putin meet to discuss it directly.",
        "Content": " The United States \"doesn't have high expectations\" for negotiations in Turkey between Russia and Ukraine to end the war, America's top diplomat has admitted. US secretary of state Marco Rubio said he did not think there would be a \"breakthrough\" in discussions until Donald Trump and Vladimir Putin meet to discuss it directly. Russia and Ukraine are preparing to hold their first direct peace talks in three years, but the negotiations will take place in the aftermath of Mr Putin declining Volodymyr Zelenskyy's offer of an in-person meeting. It came after Mr Putin proposed direct negotiations with Ukraine over the war \"without any preconditions\" after the \"coalition of the willing\" countries threatened Russia with fresh sanctions if it failed to take part in a 30-day ceasefire beginning on Monday. In response Mr Zelenskyy had called on Mr Putin to meet him in Istanbul. Ukraine war latest: Trump teases 'destination unknown' The Ukrainian president said he was sending a team headed by his defence minister, from the Turkish capital Ankara to Istanbul, to meet the Ukrainian delegation, though he said Moscow's team did not include \"anyone who actually makes decisions\". Mr Zelenskyy accused Moscow of not taking efforts to end the conflict seriously by sending a low-level negotiating team he described as \"a theatre prop\". Russian presidential aide Vladimir Medinsky, who is heading Moscow's delegation, said: \"The task of these direct negotiations with Ukraine is to establish long-term peace sooner or later by eliminating the root causes of this conflict.\" He later said he expected Ukraine's representatives to turn up for the beginning of discussions on Friday morning. Mr Rubio said he will meet Ukraine's delegation on Friday, adding: \"It's my assessment that I don't think we're going to have a breakthrough here until the president [Mr Trump] and President Putin interact directly on this topic.\" The team sent by Russia \"does not indicate a breakthrough\", he said, before going on to say: \"I hope tomorrow the news says they've agreed a ceasefire. But it's not my assessment.\" He was echoing remarks made by Mr Trump earlier in the day, when he said: \"Nothing's going to happen until Putin and I get together.\" Asked if any plans were under way for a meeting between the US and Russian leaders, Mr Rubio said Mr Trump was going to make a decision once his trip to the Middle East finishes. Read more from Sky News:It's the Trump era and Putin knows how to exploit itWhat happened last time Putin and Zelenskyy met face to face? Tens of thousands of soldiers have been killed on both sides in the war since Russia invaded Ukraine in February 2022, along with more than 12,000 Ukrainian civilians, according to the UN. Russian forces are preparing for a fresh military offensive, Ukrainian government and Western military analysts have warned. 👉 Listen to Sky News Daily on your podcast app 👈 Sir Keir Starmer accused Mr Putin of \"standing in the way of peace\", with the prime minister saying: \"There was only one country that started this conflict - that was Russia. That was Putin. There's only one country now standing in the way of peace - that is Russia, that is Putin.\""
    },
    {
        "title": "Cassie challenged over Diddy 'freak off' allegations - as explicit messages read in court",
        "description": "Sexually explicit messages between RnB singer Cassie and her former boyfriend Sean \"Diddy\" Combs have been read in court, with some showing her expressing apparent enthusiasm about the \"freak off\" sex sessions with escorts she alleges she was forced into.",
        "url": "https://news.sky.com/story/cassie-challenged-over-diddy-freak-off-allegations-as-explicit-messages-read-in-court-13368701",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sean-combs-cassie-casandra-ventura_6917823.jpg?20250515230712",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-15 21:55:00",
        "Headline": "During the fourth day of the Sean \"Diddy\" Combs sex-trafficking trial in Manhattan, New York, defence lawyers pushed back on allegations of abuse by Cassie, focusing on texts and emails that were both romantic and sexually explicit at times.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Sexually explicit messages between RnB singer Cassie and her former boyfriend Sean \"Diddy\" Combs have been read in court, with some showing her expressing apparent enthusiasm about the \"freak off\" sex sessions with escorts she alleges she was forced into. The 38-year-old, whose full name is Casandra Ventura, faced a full day of cross-examination from the hip-hop mogul's defence lawyers, who are attempting to convince the jury she consented to a \"swingers lifestyle\". Combs, 55, has pleaded not guilty to charges of sex trafficking, racketeering conspiracy and transportation to engage in prostitution, in relation to Ms Ventura and other women. His lawyers have conceded he could be violent, but say nothing he did amounted to crimes of this nature. Ms Ventura alleges she was physically abused and degraded for years by the powerful hip-hop star and music executive, accusing him of violence, coercion, blackmail and rape. Prosecutors say he exploited and used his network of employees to facilitate illegal activities, which is a key part of the racketeering charge. Sean 'Diddy' Combs trial: Day 4 - As it happened But during the fourth day of the trial in Manhattan, New York, defence lawyers pushed back, focusing on texts and emails that were both romantic and sexually explicit. \"I'm always ready to freak off,\" the court heard Ms Ventura wrote in one message in August 2009. In another she told him, about a freak off: \"Can't wait.\" And in another, jurors were told, she described a video of one sex session with an escort as \"dope\". The pair were together, on and off, for about 11 years from 2007 to 2018. Combs, whose mother Janice has been in court all week to support him, along with some of his children, appeared relaxed as the messages were read aloud for jurors. Messages from 4 March 2016 - the day before an incident at the InterContinental Hotel in Century City, Los Angeles, in which Combs was filmed on CCTV seeming to attack Ms Ventura in a hallway, as he was wearing just a towel and socks - were also read in court. Footage from this incident, which was first made public in May 2024, has been a key piece of evidence during the trial. Ms Ventura has told the court it happened as she tried to leave a freak off session after being hit by Combs. Freak off 'felt dirty, grimy' During cross-examination, the court heard Ms Ventura sent a sexually explicit message the day before this. She also sent him a message saying, \"Baby I want to FO so bad but I dont want to f*** myself up\". Ms Ventura has told the court this was damage limitation and that she wanted to keep him happy, as she had a film premiere coming up a few days later. Jurors also heard details of an email she sent in 2009, in which she expressed conflicting feelings about taking part in these sex sessions with escorts. In the email, she told Combs she needed to trust him \"beyond it just being sexual\" - that in order to be more open sexually, \"I need to feel safe, like home\". She told him \"the last time was a mistake but since has made me feel a little dirty, and grimy as opposed to sexual and spontaneous\". This was the reason she was going \"back and forth in my mind with wanting and not wanting to do it\", she wrote. At first, when they were \"so in love... there were no questions asked, it felt right\". She told him: \"I get nervous that I'm just becoming the girlfriend that you get your fantasies off with.\" Ms Ventura has told the court that she fell in love with Combs very quickly when they got together, when she was 21 and he was 37. She has said she wanted to please him, but became fearful of him. At one point during cross-examination, she raised that she felt jurors were not hearing the full context of some of the messages being highlighted, saying: \"There's a lot we skipped over.\" Combs's lawyers are painting his sexual preferences as part of a \"swingers\" lifestyle that has been mentioned previously at trial, saying people might not agree with it but it does not make him guilty of sex trafficking. Questioned on this, Ms Ventura said they were \"very different\". She was also asked about drug use, her own and Combs's, and at one point told the court she believed he was addicted to opiates when they were together. She also said he was taken to hospital after overdosing on opiates at the Playboy Mansion in 2012 - something which was reported on by outlets including TMZ at the time, when it was said he had suffered a migraine.  Judge frustrated with Diddy's lawyers Away from the questioning, a notable moment in court came when Judge Arun Subramanian became frustrated with Diddy's lawyers over how long they will spend cross-examining Ms Ventura. He told them they should get a day and a half - the same time the prosecution had. \"In what universe did you not understand this is what was going to happen?\" he told them. The judge is keen to keep the trial on time and particularly Ms Ventura's evidence, as she is eight months pregnant with her third child with husband Alex Fine, who has been supporting her in court. Read more:The rise and fall of DiddyDiddy - a timeline of allegationsEverything you need to know about the trial She has now spent almost three days on the witness stand - tomorrow will be her fourth - and became emotional towards the end of her testimony on her second day. The criminal case against Combs comes after Ms Ventura sued him in 2023, accusing him of years of physical and sexual abuse. The suit was settled in 24 hours, for a figure that was undisclosed at the time. Ms Ventura has confirmed during the trial that this was $20m (about £15m). Combs, 55, has been jailed since September, and faces at least 15 years or possibly life in prison if convicted."
    },
    {
        "title": "Death of man on Benidorm holiday 'being treated as possible murder', family say",
        "description": "The death of a British man who was found at the bottom of a cliff in Spain is now being treated as a potential murder, according to his family.",
        "url": "https://news.sky.com/story/death-of-man-on-benidorm-holiday-being-treated-as-possible-murder-family-say-13368560",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-wales-pontypridd-benidorm_6704817.jpg?20250515222931",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-15 18:10:00",
        "Headline": "Nathan Osman's body was found at the bottom of a remote cliff soon after he arrived in the Spanish resort in September 2024.",
        "Content": "The death of a British man who was found at the bottom of a cliff in Spain is now being treated as a potential murder, according to his family. Nathan Osman, 30, from Pontypridd in South Wales, was on a long weekend break with friends in Benidorm last September. Less than 24 hours after he arrived, his body was found by an off-duty police officer at the bottom of a remote 650ft (200m) cliff on the outskirts of the resort. Lee Evans, Mr Osman's brother, told Sky News: \"The prosecutor in Benidorm told us that they 'strongly believe foul play is involved and we are treating it as a potential homicide'.\"  The father-of-four died from head and abdominal injuries after falling from height, a post-mortem examination found. Local police said it was \"a tragic accident\", but his family believe the investigation into his death has not been adequate. They have pointed to attempts that were made to use his bank cards the day after he died as evidence that others may have been involved. They carried out their own investigation, and built a timeline of events drawn from sources including CCTV and, after presenting their findings to Spanish prosecutors, the case has been reopened, they said. On Monday, the case was raised in the House of Commons by Pontypridd MP, Alex Davies-Jones, who has also met the family to hear their views. They want a law in Mr Osman's name to improve support for British people who lose loved-ones abroad. Mr Evans told Sky News: \"We're astonished there's nothing in place like this, no governing body to follow who has been help to us at all in Nathan's case. \"We've had to find out blind - to find everything ourselves and we're still learning and have no structural support in place. There's a massive cry for help for families like us.\" Read more on Sky News:Siblings jailed for 'ferocious' murderKing 'flabbergasted' by money trickTeenagers sought over kitten deaths  Jonathan Osman, Nathan's father, told The UK Tonight With Sarah-Jane Mee on Tuesday his son was \"a wonderful soul\" and \"the closest to perfect you could get\". He said his son was \"loving, faithful, you could depend on him, he would do anything for others\", adding that he was \"funny, he never moaned, he was a good worker, he had children to live for... everything was an adventure for him\"."
    },
    {
        "title": "Smokey Robinson under criminal investigation over rape and sexual assault allegations",
        "description": "Motown legend Smokey Robinson is under criminal investigation after four former housekeepers accused him of rape and sexual assault, the Los Angeles County Sheriff's Department said.",
        "url": "https://news.sky.com/story/smokey-robinson-under-criminal-investigation-over-rape-and-sexual-assault-allegations-13368724",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-smokey-robinson-new-york_6908686.jpg?20250507081924",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-15 23:40:00",
        "Headline": "The investigation comes just over a week after four former housekeepers filed a lawsuit seeking $50m (£37m) in damages over the alleged assaults.",
        "Content": "Motown legend Smokey Robinson is under criminal investigation after four former housekeepers accused him of rape and sexual assault, the Los Angeles County Sheriff's Department said. The investigation comes just over a week after the housekeepers filed a lawsuit seeking $50m (£37m) in damages in a civil case over the alleged assaults - which the women say took place between 2007 and 2024. The Los Angeles County Sheriff's Department said in a statement on Thursday that its special victims bureau is now \"actively investigating criminal allegations\" against the 85-year-old. It added that the investigation is in its early stages and that no other details will be provided. The four former housekeepers alleged in their civil lawsuit that the singer, whose real name is William Robinson Jr, carried out the rapes and sexual assaults while they worked for him. The claim further states that Robinson's wife, Frances Robinson, enabled his behaviour. It also says she was responsible for creating a hostile work environment and shouted at them and used ethnic insults. \n                  US singer Chris Brown charged with GBH over alleged attack in London\n                 \n                  Cassie challenged over Diddy 'freak off' allegations - as explicit messages read in court\n                 \n                  Gary Lineker apologises for 'Zionism' re-post featuring image of rat\n                 The Motown singer's lawyer Christopher Frost has said he welcomes the criminal investigation and feels \"confident that a determination will be made that Mr. Robinson did nothing wrong, and that this is a desperate attempt to prejudice public opinion and make even more of a media circus than the plaintiffs were previously able to create\", Sky's US partner network NBC News reports. \"The record will ultimately demonstrate that this is nothing more than a manufactured lawsuit intended to tarnish the good names of Smokey and Frances Robinson for no other reason than unadulterated avarice,\" Mr Frost added. Following the filing of the civil lawsuit, Mr Frost called the allegations \"vile\" and \"false \" and said the women's claims were \"simply an ugly method of trying to extract money from an 85-year-old American icon\". Read more from Sky News:US singer Chris Brown charged over alleged London attackCassie challenged over Diddy 'freak off' accusations John Harris and Herbert Hayden, the lawyers for the women, say they are pleased to learn that law enforcement is looking into the allegations against the singer. \"Our clients intend to fully co-operate with LASD's (Los Angeles County Sheriff's Department) ongoing investigation in the pursuit of seeking justice for themselves and others that may have been similarly assaulted by him,\" the lawyers said. Robinson, a member of both the Rock & Roll Hall of Fame and the Songwriters Hall of Fame, was among the biggest hitmakers of the 1960s - both with his group The Miracles and as a solo artist, with songs including The Tears Of A Clown and The Tracks Of My Tears. He was a central part of the Motown Records music machine in his hometown of Detroit as an artist, producer and songwriter for other artists."
    },
    {
        "title": "MPs on farming committee call on Rachel Reeves to delay family farm tax",
        "description": "The UK's food security and the future of farming lies in Rachel Reeves' hands, a leading MP has said as a committee called on the government to delay farm inheritance tax changes.",
        "url": "https://news.sky.com/story/mps-on-farming-committee-call-on-rachel-reeves-to-delay-family-farm-tax-13368410",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-inheritance-farmers_6824908.jpg?20250210160709",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-15 14:31:00",
        "Headline": "The chancellor announced at the October budget farms valued at more than £1 million will no longer be able to claim inheritance tax relief from 2026.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The UK's food security and the future of farming lies in Rachel Reeves' hands, a leading MP has said as a committee called on the government to delay farm inheritance tax changes. The environment, food and rural affairs (EFRA) committee has released a report calling on the government to delay the reforms for a year until April 2027. Chancellor Rachel Reeves announced in the October budget farmers would no longer be allowed to claim inheritance tax relief for farms worth more than £1m from April 2026. The move prompted multiple protests in Westminster by farmers who said it will threaten the future of thousands of multi-generational family farms. The EFRA committee, made up of seven Labour MPs and four Lib Dem and Tory MPs, said a pause in the implementation would \"allow for better formulation of tax policy and provide the government with an opportunity to convey a positive long-term vision for farming\". A delay would also protect vulnerable farmers who would have \"more time to seek appropriate professional advice\", the MPs said. The MPs raised concerns the change was announced \"without adequate consultation, impact assessment or affordability assessment\", leaving the impact on farms and food security \"disputed and unclear\". \n                  Farage says 100 Labour MPs will be 'getting scared' and putting pressure on No 10 over protests by farmers\n                 \n                  Farmers in 'catch-22' as investing in environment could push up inheritance tax\n                 \n                  Farmers' inheritance tax could affect five times more farms than Treasury said, analysis finds\n                 They said it risks producing \"unintended consequences\" and threaten to \"affect the most vulnerable\". The MPs have called on the government to consider alternative reforms. Read more:Food prices could rise due to inheritance tax riseTypical family farm 'would have to spend 159% of its profits for a decade to pay' tax Alistair Carmichael, the Lib Dem chair of the committee, told Sky News: \"There is a need for inheritance tax to be reformed. \"The use of land purchase by the super rich as a means of sheltering their wealth is something which is not in the public interest or farmers. \"But this is not the way to go about reform. \"The risk is you see farmers selling out, they will sell out to people who are not going to use land for food production then we risk losing food security - we've seen how foolish relying on exports is after Putin's invasion.\" He added \"as an outsider looking in\", the way in which the Treasury handled the inheritance tax announcement, after Labour said in opposition they would not change it, \"has created a real problem of political authority\" for Environment Secretary Steve Reed. \"It's a problem the Treasury themselves can solve,\" he said. \"Their own backbenchers increasingly think they should solve this and our report today gives them an opportunity to do that if they choose to take it. \"It really is up to the Chancellor of the Exchequer. It is over to her now.\" The committee report says before the autumn budget 70% of farmers felt optimistic about their futures, but that fell to 12% after the budget. The survey, by the Farmers Guardian in March, also found 84% of farmers felt their mental health has been affected by the announcement.  Farmers said the government announcing the closure of applications to this year's sustainable farming incentive with just hours to go, was also a cause. The committee said there are other ways to achieve reform, and called on the government to publish its evaluation and rationale for not following alternative policy measures. They also said the Department for the Environment, Food and Rural Affairs has a pattern of \"poor communication and last-minute decision-making following rumours and departmental leaks\"."
    },
    {
        "title": "Ukrainian man charged over fires at properties and car linked to Sir Keir Starmer",
        "description": "A 21-year-old man has been charged with three counts of arson with intent to endanger life after fires at two properties and a car linked to Prime Minister Sir Keir Starmer.",
        "url": "https://news.sky.com/story/man-charged-with-arson-over-fires-at-properties-and-car-linked-to-sir-keir-starmer-13367129",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-fire-starmer_6915167.jpg?20250513131932",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-15 18:45:00",
        "Headline": "Roman Lavrynovych, 21, a Ukrainian national from Sydenham, southeast London, is due to appear at Westminster Magistrates' Court on Friday, the Metropolitan Police say.",
        "Content": "A 21-year-old man has been charged with three counts of arson with intent to endanger life after fires at two properties and a car linked to Prime Minister Sir Keir Starmer. Roman Lavrynovych, a Ukrainian national from Sydenham, southeast London, is due to appear at Westminster Magistrates' Court on Friday, the Metropolitan Police said. The force said officers from the Met's Counter Terrorism Command led the investigation because of the connections to the prime minister. Emergency services were called to a fire in the early hours of Monday at a house in Kentish Town, north London, where Sir Keir lived with his family before becoming prime minister. Damage was caused to the property's entrance but nobody was hurt. A car was also set alight in the same street last Thursday. There was another blaze at the front door of a house converted into flats in Islington, also linked to the prime minister, on Sunday. One person was taken to safety via an internal staircase by crews wearing breathing apparatus, London Fire Brigade said. The head of the Crown Prosecution Service counter terrorism division, Bethan David, said: \"These charges relate to two fires at residential addresses in Islington on Sunday May 11 and in Kentish Town on Monday May 12, as well as a car fire in Kentish Town on Thursday May 8. \"The Crown Prosecution Service reminds all concerned that criminal proceedings against this defendant are now active and that he has the right to a fair trial.\""
    },
    {
        "title": "'Toxic' army unit charged with investigating sex crimes allowing abusers to 'get away with it' in own ranks, whistleblower says",
        "description": "More than a dozen women came forward to report a staff sergeant&#160;in the Royal Military Police (RMP) for sexual abuse, but he was allowed to resign from the army instead of face charges.",
        "url": "https://news.sky.com/story/toxic-army-unit-charged-with-investigating-sex-crimes-allowing-abusers-to-get-away-with-it-in-own-ranks-whistleblower-says-13368216",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-royal-military-police_6917105.png?20250515121926",
        "type": "UK",
        "Author": "Becky Johnson, social affairs correspondent, and Rebecca Spencer, specialist producer",
        "Date Published": "2025-05-15 10:15:00",
        "Headline": "A female veteran of the Royal Military Police tells Sky News she experienced sexual harassment and assault, and heard rape allegations against male colleagues.",
        "Content": "By Becky Johnson, social affairs correspondent, and Rebecca Spencer, specialist producer   More than a dozen women came forward to report a staff sergeant in the Royal Military Police (RMP) for sexual abuse, but he was allowed to resign from the army instead of face charges. Warning: This article contains material some readers may find distressing That's the claim of a whistleblower who served as a sergeant in the RMP for over a decade and says she was one of the man's victims. Amy, not her real name, says a \"toxic\" culture in the military police means sexual predators in the army are \"getting away with stuff that they shouldn't be getting away with\". It's a rare insight into life inside the Royal Military Police, the corps charged with investigating crime in the army. Amy described how the man who assaulted her would go into women's rooms and sit on their beds. She says he used to force her to go out driving with him at night and talk about sex. \"He preyed on the young, new females that were in the unit,\" she says. \n                  'Sensitive military documents' found in Newcastle street\n                 \n                  Jaysley Beck: Mother of soldier who took her own life says she has 'sleepless nights' knowing there are still abusers in the Army \n                 \n                  Army sexual harassment investigations to be removed from chain of command\n                 \"One day, I was out with my friends in town and he was on patrol... There were two of us that went over to speak to him and I had quite a low-cut top on. \"So he hooked his finger around my top and pulled my boob out\". She recalls as she tried to stop him, \"he grabbed my hand and put it on his penis\". She claims there are other men in the RMP who've been accused of sexual offences, recalling hearing of five separate allegations of rape against male colleagues by female colleagues. \"If all of this sexual assault and bullying and rapes are going on within the military police, how can they then go out and investigate the wider army for doing the same things?\" she says. \"It doesn't work.\" 'He got away with it' Looking back on her career in the army is difficult for Amy. After leaving, she tried to settle back into life as a civilian with a new job and a young family to look after, but says she worried about bumping into former colleagues in the street. \"It's taken me a long time to heal,\" she says. \"I was very bitter towards my military career when I left, but I've had to sort of learn, build myself up again and remember the good times because they were really good times as well... I think it was just so bad at points.\" When she joined the RMP, she believed she would be part of a unit \"representing how the rest of the soldiers should be conducting themselves\". The reality, she says, was that she had become part of \"one of the most toxic\" corps in the army. She recalls being told that the staff sergeant she had reported for sexual assault would be allowed to resign. \"They basically told me he's not going to be charged, but will be leaving the military... doing him a favour,\" she says. \"He got away with it all,\" she adds. \"He's not going to lose his pension and whatever else he would have lost with a dishonourable discharge. \"He's left without a criminal record... that's not safe for civilians as well, because it's not even on his record.\" 'They investigate themselves' Earlier this year, an inquest into the suicide of 19-year-old Royal Artillery Gunner Jaysley Beck found she had been failed by the army after reporting sexual assault and harassment. Since then, Sky News has reported claims of widespread abuse and growing calls for investigations into sexual offences to be removed from the RMP and instead carried out by civilian police.  The Labour chair of the influential House of Commons Defence Committee is now urging the government to act. Tan Dhesi told Sky News: \"The system needs to change... incidents of sexual violence and sexual assault should be dealt with not by the Royal Military Police but by civilian police and civilian courts. \"I hope that the government will be making that substantial change in the very, very near future; in fact, they should do it ASAP.\" Since Gunner Beck's death, a new tri-service complaints team has been announced by the Ministry of Defence (MoD). The change will see bullying, harassment, discrimination related service complaints dealt with by a team outside the commands of the Royal Navy, British Army and Royal Air Force. However, Amy believes investigations need to be done \"completely separately from the military\". \"Otherwise it doesn't work because friends will be investigating friends,\" she says. \"I think there's such a male-dominated space in the military still. Women have no chance... and it's not fair because people are getting away with stuff that they shouldn't be getting away with and allowed to continue doing it and ruining lives.\" She believes the entire system lacks accountability. \"They investigate themselves,\" she says, even down to how the RMP is regulated. \"The people that run that unit are RMP. They get posted in, do a few years and then get posted back out.\" 'I was told off for reporting it' Katie, also not her real name, served in the army for over 20 years. She saw active service in Afghanistan and rose to the rank of Captain. It was a distinguished career that was brought to a premature end by sexual abuse and whistleblowing. Having taken the difficult decision to leave the army she now leads a secluded life and suffers poor mental health. \"I still struggle,\" she says. \"I'm still very wary of men. My relationship is strained. \"Everything seems like black and white now, like I live my life in black and white rather than full colour... As a person, it has changed my life forever.\" To begin with, she was in the same unit that Gunner Beck would join years later. She too experienced harassment and abuse, and says her line manager \"laughed\" when she reported it. \"I just felt like dehumanised, I felt like property, I didn't feel like a person anymore,\" she says. \"And so I would avoid people... I would hide in the garages, behind the tanks, in between the guns, just praying that these people hadn't seen me and I might be able to escape them for that day.\" She moved to a different unit but says wherever she went, abuse was rife. After being groped by a higher-ranking colleague, she assumed her chain of command would escalate her report to the RMP. Instead, she says she was \"put in front of the Sergeant Major and told off\". \"I remember at the time saying I'd like to call the civilian police, and I was told that I wasn't allowed to do that and I'd be disciplined if I tried to do that,\" she said. \"So I was so frightened.\" She stayed in the army, hoping to make a difference. As an officer, she began reporting abusers on behalf of younger victims. \"I kept this goal in my head of reaching a position one day where I could help other women,\" she said. \"When I got there, I realised that it was way more toxic than I could have ever imagined. \"The officer corps were actually the worst perpetrators of all because they brushed it under the carpet. There was a will and a need more to protect themselves or their friends. Or the reputation of the unit first and foremost.\" She believes changes made by the MoD since the death of Gunner Beck to remove the chain of command from sexual abuse investigations will make \"little difference\", saying they'll still be carried out by \"the same people, but just under a new title\". Email: sky.today@sky.uk or WhatsApp 07583 000 853 'They should be held accountable' An MoD spokesperson told Sky News that \"unacceptable and criminal behaviour has absolutely no place in our Armed Forces\". They added: \"That is why this government is creating a new Tri-Service Complaints team to take the most serious complaints out of the chain of single service command for the first time, and has launched a new central taskforce on Violence Against Women and Girls to give this issue the attention it deserves. \"We are also establishing an independent Armed Forces Commissioner with the power to visit defence sites unannounced, and to investigate and report to parliament any welfare matters affecting service life.\" Amy believes the RMP is not fit for purpose. \"They have higher standards to uphold, yet they don't uphold them within their own regiment, within their own lives, and then they're expected to police and uphold those standards throughout the rest of the army,\" she says. \"At the end of the day, they know the law and they should be held accountable for what they do.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "MPs waver once again as 'emotive' assisted dying bill heads back to the Commons",
        "description": "Further moves to amend the controversial assisted dying bill are being made by MPs as it returns to the Commons for another day of emotionally charged debate.",
        "url": "https://news.sky.com/story/mps-waver-once-again-as-emotive-assisted-dying-bill-heads-back-to-the-commons-13368612",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-assisted-dying-westminister_6917878.jpg?20250516012630",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-05-15 19:33:00",
        "Headline": "After a marathon committee stage, when more than 500 amendments were debated, the bill returns to the Commons with 130 amendments tabled.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Further moves to amend the controversial assisted dying bill are being made by MPs as it returns to the Commons for another day of emotionally charged debate. After a marathon committee stage, when more than 500 amendments were debated, of which a third were agreed, the bill returns to the Commons with 130 amendments tabled. As a result, the final and decisive votes on whether the bill clears the Commons and heads to the House of Lords are not expected until a further debate on 13 June. The bill proposes allowing terminally ill adults with less than six months to live to receive medical assistance to die, with approval from two doctors and an expert panel. Why is assisted dying so controversial - and where is it already legal? In a historic vote last November, after impassioned arguments on both sides, MPs voted 330 to 275 in favour of Labour MP Kim Leadbeater's Terminally Ill Adults (End of Life) Bill. Sir Keir Starmer voted in favour, while Deputy PM Angela Rayner, Foreign Secretary David Lammy, Health Secretary Wes Streeting and Justice Secretary Shabana Mahmood voted against. \n                  Assisted dying law 'unworkable, unaffordable and naive', says partnership of UK's leading social care groups\n                 \n                  Royal College of Psychiatrists pulls support for assisted dying bill\n                 \n                  Plans to legalise assisted dying in Scotland pass first stage\n                 The Conservatives were also split, with leader Kemi Badenoch voting in favour and former PM Rishi Sunak against. Reform UK leader Nigel Farage also voted against the bill.  The PM, who is attending a summit in Albania, will be absent this time, but asked for his current opinion, told reporters: \"My views have been consistent throughout.\" No fewer than 44 of the new amendments have been tabled by Ms Leadbeater herself, with government backing, a move that has been criticised by opponents of the bill. Opponents also claim some wavering MPs are preparing to switch from voting in favour or abstaining to voting against and it only needs 28 supporters to change their mind to kill the bill. Confirmed switchers from voting in favour to against include Tory MPs George Freeman and Andrew Snowden, Reform UK chief whip Lee Anderson and ex-Reform MP Rupert Lowe. Labour MP Debbie Abrahams and Tory MP Charlie Dewhirst, who abstained previously, are now against and Labour's Karl Turner, who voted in favour at second reading, is now abstaining.  Mr Turner, a former barrister, told Sky News that an amendment to replace a high court judge with a panel of experts \"weakens the bill\" by removing judicial safeguards. But in a boost for the bill's supporters, Reform UK's Runcorn and Helsby by-election winner Sarah Pochin, a former magistrate, announced she would vote in favour. Her predecessor, Labour's Mike Amesbury, voted against. \"There are enough checks and balances in place within the legislation - with a panel of experts assessing each application to have an assisted death, made up of a senior lawyer, psychiatrist, and social worker,\" said Ms Pochin, who is now the only Reform UK MP supporting the bill. A Labour MP, Jack Abbott, who voted against in November, told Sky News he was now \"more than likely\" to vote for the bill, which was now in a much stronger position, he said. Ms Leadbeater's supporters strongly deny that the bill is at risk of collapse and are accusing its opponents of \"unsubstantiated claims\" and of \"scare stories\" that misrepresent what the bill proposes.  \"There is a pretty transparent attempt by opponents of the bill to try to convince MPs that there's a big shift away from support when that simply isn't true,\" an ally of Ms Leadbeater told Sky News. Speaking in an LBC radio phone-in on the eve of the debate on the amendments, Ms Leadbeater said she understood her bill was \"an emotive issue\" and there was \"a lot of passion about this subject\". But she said: \"I would be prepared to be involved in a compassionate end to someone's life if that was of their choosing. And it's always about choice. I have friends and family who are very clear that they would want this option for themselves. \"There is overwhelming public support for a change in the law and literally everywhere I go people will stop me and say thank you for putting this forward. I would want this choice.\" Read more:Ukrainian man charged over fires at properties and car linked to PMAn embarrassment for Starmer on migrant return hubs? Also ahead of the debate, health minister Stephen Kinnock and justice minister Sarah Sackman wrote to all MPs defending the government's involvement in Ms Leadbeater's amendments to her bill. \"The government remains neutral on the passage of the bill and on the principle of assisted dying, which we have always been clear is a decision for parliament,\" they wrote. \"Government has a responsibility to ensure any legislation that passes through parliament is workable, effective and enforceable. \"As such, we have provided technical, drafting support to enable the sponsor to table amendments throughout the bill's passage. We have advised the sponsor on amendments which we deem essential or highly likely to contribute to the workability of the bill.\""
    },
    {
        "title": "Ukrainian man charged over fires at properties and car linked to Sir Keir Starmer",
        "description": "A 21-year-old man has been charged with three counts of arson with intent to endanger life after fires at two properties and a car linked to Prime Minister Sir Keir Starmer.",
        "url": "https://news.sky.com/story/man-charged-with-arson-over-fires-at-properties-and-car-linked-to-sir-keir-starmer-13367129",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-fire-starmer_6915167.jpg?20250513131932",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-15 18:45:00",
        "Headline": "Roman Lavrynovych, 21, a Ukrainian national from Sydenham, southeast London, is due to appear at Westminster Magistrates' Court on Friday, the Metropolitan Police say.",
        "Content": "A 21-year-old man has been charged with three counts of arson with intent to endanger life after fires at two properties and a car linked to Prime Minister Sir Keir Starmer. Roman Lavrynovych, a Ukrainian national from Sydenham, southeast London, is due to appear at Westminster Magistrates' Court on Friday, the Metropolitan Police said. The force said officers from the Met's Counter Terrorism Command led the investigation because of the connections to the prime minister. Emergency services were called to a fire in the early hours of Monday at a house in Kentish Town, north London, where Sir Keir lived with his family before becoming prime minister. Damage was caused to the property's entrance but nobody was hurt. A car was also set alight in the same street last Thursday. There was another blaze at the front door of a house converted into flats in Islington, also linked to the prime minister, on Sunday. One person was taken to safety via an internal staircase by crews wearing breathing apparatus, London Fire Brigade said. The head of the Crown Prosecution Service counter terrorism division, Bethan David, said: \"These charges relate to two fires at residential addresses in Islington on Sunday May 11 and in Kentish Town on Monday May 12, as well as a car fire in Kentish Town on Thursday May 8. \"The Crown Prosecution Service reminds all concerned that criminal proceedings against this defendant are now active and that he has the right to a fair trial.\""
    },
    {
        "title": "US singer Chris Brown charged with GBH over alleged attack in London",
        "description": "US singer Chris Brown has been charged with grievous bodily harm with intent in connection with a 2023 incident in London.",
        "url": "https://news.sky.com/story/us-singer-chris-brown-charged-with-gbh-13368710",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-chris-brown_6917859.jpg?20250516000703",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-15 22:36:00",
        "Headline": "The 36-year-old was arrested at a hotel in Manchester in the early hours of Thursday by detectives from the Metropolitan Police.",
        "Content": "US singer Chris Brown has been charged with grievous bodily harm with intent in connection with a 2023 incident in London. He remains in custody and is due to appear at Manchester Magistrates' Court at 10am this morning, police said. The charge relates to an assault which reportedly took place at a venue in Hanover Square in Mayfair on Sunday 19 February 2023. The 36-year-old was arrested at a hotel in Manchester in the early hours of Thursday by detectives from the Metropolitan Police. The Sun has reported that the R&B singer flew into Manchester Airport on a private jet on Wednesday afternoon. Adele Kelly, the deputy chief crown prosecutor for CPS London North, said: \"We have authorised the Metropolitan Police to charge Chris Brown with one count of grievous bodily harm, contrary to section 18 of the Offences Against the Person Act 1861. \"The alleged incident occurred in London on 19 February 2023. \n                  Cassie challenged over Diddy 'freak off' allegations - as explicit messages read in court\n                 \n                  Smokey Robinson under criminal investigation over rape and sexual assault allegations\n                 \n                  Gary Lineker apologises for 'Zionism' re-post featuring image of rat\n                 \"He will have his first court appearance on Friday 16 May at Manchester Magistrates' Court. Read more from Sky News:Ukrainian charged over fires at homes linked to StarmerKing 'flabbergasted' by magician's money trickSiblings jailed over 'truly sickening' murder  \"The Crown Prosecution Service reminds all concerned that criminal proceedings against this defendant are active and that he has the right to a fair trial. \"It is extremely important that there should be no reporting, commentary or sharing of information online which could in any way prejudice these proceedings.\" The Go Crazy singer is set to tour the UK in June and July, with dates at Co-Op Live in Manchester and Principality Stadium in Cardiff. His representatives have been contacted for comment."
    },
    {
        "title": "MPs on farming committee call on Rachel Reeves to delay family farm tax",
        "description": "The UK's food security and the future of farming lies in Rachel Reeves' hands, a leading MP has said as a committee called on the government to delay farm inheritance tax changes.",
        "url": "https://news.sky.com/story/mps-on-farming-committee-call-on-rachel-reeves-to-delay-family-farm-tax-13368410",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-inheritance-farmers_6824908.jpg?20250210160709",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-15 14:31:00",
        "Headline": "The chancellor announced at the October budget farms valued at more than £1 million will no longer be able to claim inheritance tax relief from 2026.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The UK's food security and the future of farming lies in Rachel Reeves' hands, a leading MP has said as a committee called on the government to delay farm inheritance tax changes. The environment, food and rural affairs (EFRA) committee has released a report calling on the government to delay the reforms for a year until April 2027. Chancellor Rachel Reeves announced in the October budget farmers would no longer be allowed to claim inheritance tax relief for farms worth more than £1m from April 2026. The move prompted multiple protests in Westminster by farmers who said it will threaten the future of thousands of multi-generational family farms. The EFRA committee, made up of seven Labour MPs and four Lib Dem and Tory MPs, said a pause in the implementation would \"allow for better formulation of tax policy and provide the government with an opportunity to convey a positive long-term vision for farming\". A delay would also protect vulnerable farmers who would have \"more time to seek appropriate professional advice\", the MPs said. The MPs raised concerns the change was announced \"without adequate consultation, impact assessment or affordability assessment\", leaving the impact on farms and food security \"disputed and unclear\". \n                  Farage says 100 Labour MPs will be 'getting scared' and putting pressure on No 10 over protests by farmers\n                 \n                  Farmers in 'catch-22' as investing in environment could push up inheritance tax\n                 \n                  Farmers' inheritance tax could affect five times more farms than Treasury said, analysis finds\n                 They said it risks producing \"unintended consequences\" and threaten to \"affect the most vulnerable\". The MPs have called on the government to consider alternative reforms. Read more:Food prices could rise due to inheritance tax riseTypical family farm 'would have to spend 159% of its profits for a decade to pay' tax Alistair Carmichael, the Lib Dem chair of the committee, told Sky News: \"There is a need for inheritance tax to be reformed. \"The use of land purchase by the super rich as a means of sheltering their wealth is something which is not in the public interest or farmers. \"But this is not the way to go about reform. \"The risk is you see farmers selling out, they will sell out to people who are not going to use land for food production then we risk losing food security - we've seen how foolish relying on exports is after Putin's invasion.\" He added \"as an outsider looking in\", the way in which the Treasury handled the inheritance tax announcement, after Labour said in opposition they would not change it, \"has created a real problem of political authority\" for Environment Secretary Steve Reed. \"It's a problem the Treasury themselves can solve,\" he said. \"Their own backbenchers increasingly think they should solve this and our report today gives them an opportunity to do that if they choose to take it. \"It really is up to the Chancellor of the Exchequer. It is over to her now.\" The committee report says before the autumn budget 70% of farmers felt optimistic about their futures, but that fell to 12% after the budget. The survey, by the Farmers Guardian in March, also found 84% of farmers felt their mental health has been affected by the announcement.  Farmers said the government announcing the closure of applications to this year's sustainable farming incentive with just hours to go, was also a cause. The committee said there are other ways to achieve reform, and called on the government to publish its evaluation and rationale for not following alternative policy measures. They also said the Department for the Environment, Food and Rural Affairs has a pattern of \"poor communication and last-minute decision-making following rumours and departmental leaks\"."
    },
    {
        "title": "Bank worker and brother who murdered drug dealer in 'ferocious' knife attack are jailed",
        "description": "A brother and sister have been jailed for the murder of a drug dealer in a \"ferocious\" knife attack.",
        "url": "https://news.sky.com/story/bank-worker-and-brother-who-murdered-drug-dealer-in-ferocious-knife-attack-are-jailed-13368313",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-isaiah-marsh-mya-marsh_6917340.jpg?20250515152513",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-15 12:37:00",
        "Headline": "Mya Marsh, 23, and her 21-year-old brother Isaiah Marsh were sentenced to 20 years in prison for killing Minister Enfrence, 21, over a £200 cannabis debt.",
        "Content": "A brother and sister have been jailed for the murder of a drug dealer in a \"ferocious\" knife attack. Isaiah Marsh, 21, and his 23-year-old sibling Mya Marsh were sentenced to a minimum of 20 years in prison for killing Minister Enfrence, 21, in a row over a £200 cannabis debt. Bank worker Mya was trying to buy drugs from Mr Enfrence in Kings Norton, Birmingham, when she met him armed with a kitchen knife at about 10am on 5 November, the city's crown court heard. Judge Simon Drew KC said that Mya was the aggressor in an initial confrontation with Mr Enfrence over the debt as he sentenced the siblings on Thursday. Mya called her brother Isaiah to the scene, who \"launched a ferocious attack on Minister as he lay defenceless on his back on the floor\" and had intended to kill, the judge said. Mr Enfrence suffered at least 12 stab wounds to his body, arms, hands and head in the \"unprovoked\" attack. He did not die instantly and managed to escape before collapsing nearby. \n                  Driver who used car as weapon to murder e-bike rider in Birmingham is jailed\n                 \n                  Birmingham bin strike resolution 'could be in touching distance' - as conciliation service drafted in\n                 \n                  How long have Birmingham bin strikes been going on - and why is it taking so long to settle dispute?\n                 Judge Drew said footage of the attack, which was caught on CCTV, was \"truly sickening\" to watch as Mr Enfrence died a \"traumatic and painful death\". Siblings unanimously convicted of murder The footage shows Mya passing a knife to her brother during the stabbing. The judge told them: \"This was an attack by two people on one. That attack was unprovoked. Members of the public, including a child in a pushchair, passed very close by while the attack was taking place.\" After the killing, Mya went to work \"as if nothing had happened\" after taking the morning off work, citing mental health problems, the court was told. Isaiah later handed himself in to the police. A jury unanimously convicted the siblings of murder on Monday following a three-week trial. Both had denied murder and alternative charges of manslaughter. Read more from Sky News:Police fear mother might abandon fourth babyRemains of more than 30 dogs found in raid Isaiah claimed he acted in self-defence, while Mya claimed she did not believe her brother would use the knife to stab Mr Enfrence. Rachel Brand KC, representing Mya, said the attack was \"utterly out of character\" for her client and that Mya had shouted \"stop it\" and \"break it up\" during her brother and Mr Enfrence's struggle. Isaiah, meanwhile, would find it \"almost impossible to reconcile what he saw on the CCTV with who he is\", his barrister Michael Ivers KC told the court. \"He has told everyone who will listen when they have spoken to him that he is full of remorse about what happened,\" Mr Ivers said."
    },
    {
        "title": "Woman's testimony from beyond the grave helps to convict rapist Steven Connery",
        "description": "A \"despicable\" rapist has been brought to justice and jailed for 10 years in part thanks to a woman's testimony from beyond the grave.",
        "url": "https://news.sky.com/story/womans-testimony-from-beyond-the-grave-helps-to-convict-rapist-steven-connery-13368286",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-glasgow-glasgow-court_6917345.jpg?20250515152738",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-05-15 12:08:00",
        "Headline": "One of Steven Connery's victims was left \"so shocked that she couldn't speak\" following a painful attack, while a second woman was left in \"agony\" after a sex assault.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A \"despicable\" rapist has been brought to justice and jailed for 10 years in part thanks to a woman's testimony from beyond the grave. Steven Connery, 41, repeatedly raped and sexually assaulted two women in the Forth Valley and Tayside areas. Judge Douglas Brown said Connery's first victim was left \"so shocked that she couldn't speak\" following a painful attack in a bathroom while she was getting ready for a night out. A court heard how the second woman was also left in \"agony\" after a sex assault. Connery was arrested in 2022 after his past crimes were brought to the attention of Police Scotland. His second victim died before a trial was held at the High Court in Glasgow, but her evidence was read out in the form of a statement by one of the investigating officers. Connery denied any wrongdoing but was in March found guilty of four charges. \n                  Peter Sullivan who has spent 38 years in jail for murder has conviction quashed\n                 \n                  The online drug trade behind QR code stickers plastered on streets across the UK \n                 \n                  Man jailed for Diane Sindall murder in 1986 could have conviction quashed\n                 He returned to the dock on Wednesday and was handed a 13-year extended sentence, with 10 years in jail and three years on licence once released back into the community. Judge Brown said: \"It is almost inevitable that offences of this nature will cause substantial harm and in relation to the second complainer, who has since died, it is clear from a victim impact statement submitted by her sister that your behaviour had a massive impact not only on her but also on her family.\" Read more from Sky News:TikTok influencer shot dead during livestreamPolice fear mum might abandon fourth baby but close in on her location It was noted that Connery was \"still reasonably young\" at the time of some of his offending, but the judge added: \"Though there is little to indicate that a lack of maturity was a significant factor.\" Connery was additionally placed on the sex offenders' register indefinitely and banned from contacting the woman who is still alive. Detective Sergeant Khalid Abdulrahman said: \"Although one of Connery's victims passed away, it was right that her evidence was heard in court through the reading of statements. \"I hope this sentencing brings some comfort to both her family and the other victim in this case. \"Our thoughts remain with them, as without their information Connery wouldn't have been held accountable for his despicable actions.\""
    },
    {
        "title": "Jailed wife of former Tory councillor says she 'never' meant to incite violence ",
        "description": "The wife of a former Tory councillor has said she \"never\" meant to incite violence when she called for hotels to be burned down.",
        "url": "https://news.sky.com/story/jailed-wife-of-former-tory-councillor-says-she-never-meant-to-incite-violence-13368470",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-lucy-connolly-west-midlands-police_6718934.jpg?20241017163706",
        "type": "UK",
        "Author": "Will Charley",
        "Date Published": "2025-05-15 15:58:00",
        "Headline": "Lucy Connolly is appealing her sentence after she admitted posting an online rant that called for asylum hotels to be burned down.",
        "Content": "\n          Political reporter\n              @WillCharley1\n The wife of a former Tory councillor has said she \"never\" meant to incite violence when she called for hotels to be burned down. Lucy Connolly appeared from HMP Drake Hall in Eccleshall in Staffordshire, where she is currently serving a 31-month sentence for an online rant in which she called asylum seekers \"b******s\". She is challenging the sentence, which she was given last October, at the Court of Appeal after admitting making the post on X. Writing on the day of the Southport attacks, Connolly said: \"Mass deportation now, set fire to all the f****** hotels full of the b******* for all I care... if that makes me racist so be it.\" It followed three girls being stabbed to death at a holiday club in Southport sparking unrest around the country. Connolly told the three judges she never meant to incite violence, and that she later deleted the post. Lord Justice Holroyde, Mr Justice Goss and Mr Justice Sheldon heard that when she initially wrote it on 29 July last year, she was \"really angry, really upset\" and \"distressed that those children had died\". \n                  Southport riots review finds police have not kept up with social media risks\n                 \n                  Man who researched Southport killings jailed for 30 years for attempted murder of nine-year-old girl\n                 \n                  Meta 'too slow' during UK riots to deal with violent posts online, says independent review\n                 She added she knew how the parents felt. Connolly said: \"Those parents still have to live a life of grief. It sends me into a state of anxiety and I worry about my children.\" The court heard Connolly's own child died 14 years ago and that this had caused a resurgence of her anxiety. Connolly's lawyer, Adam King, asked her if she intended for anybody to set asylum hotels on fire or \"murder any politicians\", to which she replied: \"Absolutely not.\" When asked why she deleted the post three-and-a-half hours after putting it up, Connolly responded that she had \"calmed [herself] down\" and that she knew it \"wasn't an acceptable thing to say\". She continued: \"It wasn't the right thing to say, it wasn't what I wanted to happen.\" The court heard Connolly posted an apology on the same platform several days later, where she said she regretted her initial post and realised it was wrong in \"every way\". Connolly did not understand what she pleaded guilty to, court told When asked why she has apologised, Connolly told the court that it was because she was \"really upset\" her husband had been brought into it, and she did not want his name being \"dragged through the mud\". Connolly then told the court that during discussions with her barrister at Birmingham Crown Court, she had not understood that by pleading guilty she was accepting she had intended to incite violence. She said: \"When I wrote that Tweet, there had been no violence, and it was never my intention to cause any.\" Connolly was originally arrested several days later after the stabbings on 6 August, by which time she had deleted her social media account. However, other racists remarks in messages were discovered by officers who seized her phone. The former childminder is married to Raymond Connolly, who was a Conservative Northamptonshire county councillor, but lost his seat in May. He remains on the town council. Speaking outside the Royal Courts of Justice after the hearing, Mr Connolly said: \"Obviously I'm disappointed today. It didn't come to a conclusion and get a result. \"It's 279 days now my daughter's been without her mother. I'm hoping that within a week she'll be home and this will come to a positive conclusion. Can't really say no more than that. \"It's a shame I didn't get a result today but we'll soon know in the next few days. Got to get home now to my daughter.\" The hearing continues and is expected to end on Thursday afternoon."
    },
    {
        "title": "Police hunt for teenagers seen 'carrying dismembered kittens in duffel bag'",
        "description": "Police investigating the torture and killing of a pair of kittens in west London have published CCTV pictures of two teenagers they want to speak to.",
        "url": "https://news.sky.com/story/police-hunt-for-teenagers-seen-carrying-dismembered-kittens-in-duffel-bag-13368387",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ruislip-police-kittens_6917315.jpg?20250515170643",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-15 14:00:00",
        "Headline": "Officers have released footage of a boy and a girl seen walking down a street before running back the way they came.",
        "Content": "Police investigating the torture and killing of a pair of kittens in west London have published CCTV pictures of two teenagers they want to speak to. Warning: This article contains details some readers may find distressing The Metropolitan Police were tipped off on 3 May that two teenagers had allegedly dismembered the animals at Ickenham Road, Ruislip. No arrests have been made. Officers released footage of a boy and a girl on Thursday and asked people to help identify them. The boy is described by the Met as 5ft 6in (168cm) tall, with short dark hair. He was wearing a dark jacket with long sleeves, with blue jeans. Police sergeant Babs Rock said the boy \"was also seen carrying a black duffel bag, which sadly is thought to have contained the kittens\". \n                  CCTV footage shows Sex Education actor pepper sprayed by police - as watchdog finds use of force 'reasonable'\n                 \n                  Police fear mother might abandon fourth baby but close in on her location\n                 \n                  Police given more time to question suspect over 'arson attacks' on properties linked to Starmer\n                 More from Sky News:Police search for mother of abandoned babiesInfluencer shot dead during livestreamRemains of dozens of dogs found Sergeant Rock said the young girl was the same height as the boy, with long red hair. \"She was wearing a white top with black shorts. She was also carrying a purple jumper, which she later puts on to wear,\" she said. \"If you know these two individuals then please come forward to us, we would like to speak with them as soon as possible.\" In the video, the pair are seen walking down a street and then later running back the way they came. Sergeant Rock described it as \"an incredibly distressing incident which I know has caused concern in the local community\"."
    },
    {
        "title": "Death of man on Benidorm holiday 'being treated as possible murder', family say",
        "description": "The death of a British man who was found at the bottom of a cliff in Spain is now being treated as a potential murder, according to his family.",
        "url": "https://news.sky.com/story/death-of-man-on-benidorm-holiday-being-treated-as-possible-murder-family-say-13368560",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-wales-pontypridd-benidorm_6704817.jpg?20250515222931",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-15 18:10:00",
        "Headline": "Nathan Osman's body was found at the bottom of a remote cliff soon after he arrived in the Spanish resort in September 2024.",
        "Content": "The death of a British man who was found at the bottom of a cliff in Spain is now being treated as a potential murder, according to his family. Nathan Osman, 30, from Pontypridd in South Wales, was on a long weekend break with friends in Benidorm last September. Less than 24 hours after he arrived, his body was found by an off-duty police officer at the bottom of a remote 650ft (200m) cliff on the outskirts of the resort. Lee Evans, Mr Osman's brother, told Sky News: \"The prosecutor in Benidorm told us that they 'strongly believe foul play is involved and we are treating it as a potential homicide'.\"  The father-of-four died from head and abdominal injuries after falling from height, a post-mortem examination found. Local police said it was \"a tragic accident\", but his family believe the investigation into his death has not been adequate. They have pointed to attempts that were made to use his bank cards the day after he died as evidence that others may have been involved. They carried out their own investigation, and built a timeline of events drawn from sources including CCTV and, after presenting their findings to Spanish prosecutors, the case has been reopened, they said. On Monday, the case was raised in the House of Commons by Pontypridd MP, Alex Davies-Jones, who has also met the family to hear their views. They want a law in Mr Osman's name to improve support for British people who lose loved-ones abroad. Mr Evans told Sky News: \"We're astonished there's nothing in place like this, no governing body to follow who has been help to us at all in Nathan's case. \"We've had to find out blind - to find everything ourselves and we're still learning and have no structural support in place. There's a massive cry for help for families like us.\" Read more on Sky News:Siblings jailed for 'ferocious' murderKing 'flabbergasted' by money trickTeenagers sought over kitten deaths  Jonathan Osman, Nathan's father, told The UK Tonight With Sarah-Jane Mee on Tuesday his son was \"a wonderful soul\" and \"the closest to perfect you could get\". He said his son was \"loving, faithful, you could depend on him, he would do anything for others\", adding that he was \"funny, he never moaned, he was a good worker, he had children to live for... everything was an adventure for him\"."
    },
    {
        "title": "Thousands of Ukrainian civilians lost in hellish archipelago of Russian jails",
        "description": "In all the horrors of this war, the plight of thousands of civilians abducted by Russia is one of the worst, but is in danger of being overlooked.",
        "url": "https://news.sky.com/story/thousands-of-ukrainian-civilians-lost-in-hellish-archipelago-of-russian-jails-13368705",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ukraine-russia_6917834.png?20250515233045",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-05-15 22:17:00",
        "Headline": "Their plight is truly horrific. Ukraine has identified almost 16,000 names of people lost in a gulag of 180 prisons in Russian-held Ukraine and in Russia itself, as far away as Siberia.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  In all the horrors of this war, the plight of thousands of civilians abducted by Russia is one of the worst, but is in danger of being overlooked. Warning: This report contains details of torture and sexual abuse Their fate is not mentioned for instance in Donald Trump's peace plan currently being wrestled over, let alone any demands they are released by Russia. But their plight is truly horrific. Ukraine has identified almost 16,000 names of people lost in a gulag of 180 prisons in Russian-held Ukraine and in Russia itself, as far away as Siberia. It is a war crime to take civilians hostage during a conflict but that has not deterred Vladimir Putin's regime. Worse, there is abundant evidence they are being tortured, sexually abused and killed in custody. Oleksandra Matviichuk, a Nobel Prize-winning Ukrainian human rights lawyer, said: \"I interviewed hundreds of people who survived Russian captivity, men and women, mostly civilians, and they told me how they were beaten, raped, smashed into wooden boxes. \"Their fingers were cut, their nails were torn away, their nails were drilled. There were electrical shocks through their genitalia. One woman told me how her eye was dug out with a spoon.\" When the Russians took territory north of Kyiv at the start of their illegal invasion, they came for the men, among them Dmytro Khilyuk. Apart from a short letter sent from captivity a few months later, his elderly parents have not seen him since. Read more from Sky News:Ukrainian man charged over fires at properties linked to StarmerHamas confirms direct peace talks with US - exclusivePolice hunt for teens seen 'carrying dismembered kittens in bag' 'I just can't take it anymore' \"We're old and we're sick,\" his mother Halyna, bedridden after a stroke, told us. \"We've been without our only child for four years now, not knowing anything, where he is, how he is.\" She wept as she told us of the agony of living with the uncertainty about their son. \"I just can't take it anymore. Why is my child suffering like this? It's been four years. All we get are endless talks, talks, and more talks. And nothing changes. I could die any day… and never see my child again.\" Khilyuk has lost half his weight and most of his teeth A year ago a fellow prisoner who had shared a cell with Mr Khilyuk was released. He said Mr Khilyuk had lost half his weight and most of his teeth. Fellow journalist and friend of Mr Khilyuk, Stas Kozluk, told us he was worried about his state of mind. \"We just can't imagine what can happen with the mind of a human being that's captured and spends three years in that condition. To be honest, I don't know how to help him. And that's the most terrifying thing,\" he said. Russia releases no information Ukrainian authorities can only piece together information about the abducted civilians. Mr Kozluk told us those who've been detained learn the phone numbers and names of relatives of others they are held with. Those who are released pass on what information they can. Russia releases no information about those civilians it is holding illegally, against the rules of war. 'The world doesn't understand' Thousands of innocent civilians are lost in a hellish archipelago of Russian jails notorious for their evil regime of abuse. And the world, says Oleksandra Matviichuk, is in danger of forgetting about them. \"I think the world doesn't understand, first, the cruelty and unhuman conditions in which Ukrainians are held in Russian captivity,\" she says. \"Second, they don't understand that Russia detained not just military, but civilians. And according to the Geneva Convention, they have to be released immediately without any exchanges, without any conditions.\" Diplomatic efforts to end this war grind on fitfully. But there has been very little pressure on Russia to end its illegal abduction of thousands of innocents."
    },
    {
        "title": "US 'doesn't have high expectations' for Ukraine-Russia negotiations, Marco Rubio admits",
        "description": "The United States \"doesn't have high expectations\" for negotiations in Turkey between Russia and Ukraine to end the war, America's top diplomat has admitted.",
        "url": "https://news.sky.com/story/us-doesnt-have-high-expectations-for-ukraine-russia-negotiations-marco-rubio-admits-13368629",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-zelenskyy-putin_6886829.jpg?20250414211955",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-15 20:12:00",
        "Headline": "The US secretary of state said he did not think there would be a \"breakthrough\" in peace negotiations until Donald Trump and Vladimir Putin meet to discuss it directly.",
        "Content": " The United States \"doesn't have high expectations\" for negotiations in Turkey between Russia and Ukraine to end the war, America's top diplomat has admitted. US secretary of state Marco Rubio said he did not think there would be a \"breakthrough\" in discussions until Donald Trump and Vladimir Putin meet to discuss it directly. Russia and Ukraine are preparing to hold their first direct peace talks in three years, but the negotiations will take place in the aftermath of Mr Putin declining Volodymyr Zelenskyy's offer of an in-person meeting. It came after Mr Putin proposed direct negotiations with Ukraine over the war \"without any preconditions\" after the \"coalition of the willing\" countries threatened Russia with fresh sanctions if it failed to take part in a 30-day ceasefire beginning on Monday. In response Mr Zelenskyy had called on Mr Putin to meet him in Istanbul. Ukraine war latest: Trump teases 'destination unknown' The Ukrainian president said he was sending a team headed by his defence minister, from the Turkish capital Ankara to Istanbul, to meet the Ukrainian delegation, though he said Moscow's team did not include \"anyone who actually makes decisions\". Mr Zelenskyy accused Moscow of not taking efforts to end the conflict seriously by sending a low-level negotiating team he described as \"a theatre prop\". Russian presidential aide Vladimir Medinsky, who is heading Moscow's delegation, said: \"The task of these direct negotiations with Ukraine is to establish long-term peace sooner or later by eliminating the root causes of this conflict.\" He later said he expected Ukraine's representatives to turn up for the beginning of discussions on Friday morning. Mr Rubio said he will meet Ukraine's delegation on Friday, adding: \"It's my assessment that I don't think we're going to have a breakthrough here until the president [Mr Trump] and President Putin interact directly on this topic.\" The team sent by Russia \"does not indicate a breakthrough\", he said, before going on to say: \"I hope tomorrow the news says they've agreed a ceasefire. But it's not my assessment.\" He was echoing remarks made by Mr Trump earlier in the day, when he said: \"Nothing's going to happen until Putin and I get together.\" Asked if any plans were under way for a meeting between the US and Russian leaders, Mr Rubio said Mr Trump was going to make a decision once his trip to the Middle East finishes. Read more from Sky News:It's the Trump era and Putin knows how to exploit itWhat happened last time Putin and Zelenskyy met face to face? Tens of thousands of soldiers have been killed on both sides in the war since Russia invaded Ukraine in February 2022, along with more than 12,000 Ukrainian civilians, according to the UN. Russian forces are preparing for a fresh military offensive, Ukrainian government and Western military analysts have warned. 👉 Listen to Sky News Daily on your podcast app 👈 Sir Keir Starmer accused Mr Putin of \"standing in the way of peace\", with the prime minister saying: \"There was only one country that started this conflict - that was Russia. That was Putin. There's only one country now standing in the way of peace - that is Russia, that is Putin.\""
    },
    {
        "title": "Hamas confirms direct peace talks with US - as it calls on Trump to 'pressure' Israel",
        "description": "A senior Hamas official has confirmed the militant group is in direct talks with the United States over peace in Gaza, adding that it believes Donald Trump can help broker a deal. ",
        "url": "https://news.sky.com/story/hamas-confirms-direct-peace-talks-with-us-as-it-calls-on-trump-to-pressure-israel-13368330",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-hamas-basem-naim_6917251.jpg?20250515141321",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-15 12:58:00",
        "Headline": "A senior Hamas official also addresses whether Hamas - which has been in power since it won the 2006 Palestinian elections - could step down from government in order to secure peace in Gaza.",
        "Content": " A senior Hamas official has confirmed the militant group is in direct talks with the United States over peace in Gaza, adding that it believes Donald Trump can help broker a deal.  Speaking to Sky News' lead world news presenter Yalda Hakim, Dr Basem Naim said Hamas has shared its proposed agreement both through mediators and \"directly with some persons in the US administration\". They are calling for \"a prisoner exchange, total withdrawal of Israeli forces, allowing all the aid to get into Gaza and rebuilding of [the] Gaza Strip without forceful immigration,\" he said. Dr Naim also addressed whether Hamas - which has been in power since it won the 2006 Palestinian election - could step down from government in order to secure peace. \"We have also told the Americans, we are ready to, again, to hand over the government immediately if we reach an end of this war,\" he said. Dr Naim added Hamas has \"accepted\" an Egyptian peace proposal which \"is talking about forming a Palestinian, independent, politically unaffiliated body to run the Gaza Strip\". \"Before that, as long as we are still occupied people, we have all the right to continue defending our people and resisting the occupation with all means including under resistance,\" he said. Turning his attention directly to the US president, the senior Hamas official said he thinks Mr Trump \"has the capability and the will to reach this peaceful situation\". He said: \"Gaza and Gazans are deserving, like all other people everywhere, to live in peace and dignity. \"And I think President Trump can do it if he exercises enough pressure on the Israelis to end this war immediately. And we are ready to cooperate with him to achieve this goal of a more peaceful region.\" Responding to the interview with Hamas, White House National Security Council spokesman James Hewitt told Sky News that Hamas \"has not demonstrated they are serious about peace\" and that Mr Trump \"has been clear Hamas must lay down their arms\". \"Hamas continues to wrongfully hold hostages, including American bodies, in the dungeons of Gaza who could easily be freed and have shown no changes in behaviour to indicate they will cease to attack civilians,\" he added. Lead world news presenter Donald Trump's Middle East tour has been full of surprises.  But the revelation that officials in his administration are speaking directly to Hamas is one of the most significant.   As the US president addressed troops at the Al Udeid airbase in Qatar – the largest in the region – I sat down with a senior Hamas official who confirmed direct talks were ongoing.  In an exclusive interview, Dr Bassem Naim praised Trump and talked up chances of finding a peaceful resolution.  It's a remarkable statement from a senior figure within the group, which is considered by the US and UK to be a terrorist organisation.  Much has been made of Trump's 'transactional' approach here in the region.  His commitment to the 'art of the deal' can often achieve unexpected results but also anger his allies – which is almost certainly the case with Israel's embattled Prime Minister Benjamin Netanyahu.  When I asked Dr Naim about the demands from Israel and the United States for Hamas to disarm and accept that it can no longer be the governing force in Gaza, he set out conditions that Hamas says would have to be met.   However, President Trump's public stance on Hamas remains as stern as ever. The group \"needed to be dealt with\" he said earlier, adding he has \"concepts for Gaza,\" and that the US should \"take it\" and turn it into a \"freedom zone\".  Israel's war in Gaza has now entered its 20th month with more than 53,000 people believed to be dead, according to Gaza's Hamas-run health ministry.  Some 15,000 of them are children, according to UNICEF. There are still more than 50 Israeli hostages held by Hamas in the Strip. In a statement released on Thursday, Hamas highlighted the fact it recently released hostage Edan Alexander, an Israeli soldier with American citizenship. It continued: \"We expect, based on the understandings reached with the American side, and with the knowledge of the mediators, that humanitarian aid should have entered the Gaza Strip immediately, a call been made for a permanent ceasefire, and that comprehensive negotiations would have been held on all issues to achieve security and stability in the region, a goal we aspire to achieve. \"However, failure to achieve these steps, especially the entry of humanitarian aid to our people, will cast a negative effect over any efforts to complete negotiations on the prisoner exchange process.\" Read more:Analysis of Gaza hospital attack contradicts IsraelGaza aid ship bombed by drones  The US president has previously shared plans of his own for Gaza and in February, he posted a bizarre AI video showing the region transformed into a paradise complete with its own Trump tower and exotic beaches. The States could \"own that piece of land\" and develop it, he said - but the idea was swiftly condemned as the effective \"ethnic cleansing\" of Palestinians from Gaza.  Mr Trump is currently on a visit to the Middle East, which has included stops in the United Arab Emirates, Qatar and Saudi Arabia - but not Israel. There had been hopes his trip could lead to a ceasefire deal, but Israeli Prime Minister Benjamin Netanyahu has pushed ahead with an escalation of force on the Gaza Strip. Israel has this week launched airstrikes on two consecutive nights while continuing to block aid for the region, worsening the humanitarian crisis. Watch the full interview with Dr Basem Naim from 9pm this evening on The World With Yalda Hakim on Sky News"
    },
    {
        "title": "It's the Trump era and Putin knows how to exploit it",
        "description": "So is this the beginning of the end, the end of the beginning or just a bit of pointless pantomime? Or might it be all of them, depending on your point of view?",
        "url": "https://news.sky.com/story/it-is-the-trump-era-and-putin-knows-how-to-exploit-it-13368562",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-vladimir-putin-russia_6917713.jpg?20250515213905",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-05-15 18:25:00",
        "Headline": "Who benefits from this uncertainty and chaos? Possibly Volodymyr Zelenskyy, but perhaps also Vladimir Putin.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n  So is this the beginning of the end, the end of the beginning or just a bit of pointless pantomime? Or might it be all of them, depending on your point of view? On the one hand, Ukraine's leader has turned up for peace talks in Turkey with a strong backroom team and a desire to negotiate over the war. From his perspective, Volodymyr Zelenskyy has called the bluff of Vladimir Putin. \"You said you wanted to talk, so here I am,\" is the message.  But Mr Putin is, for the moment at least, nowhere to be seen, and neither are the members of his very top team. No Sergei Lavrov, for instance, the foreign minister who has sourly dismissed these negotiations as being blighted by \"Western puppeteers\" controlling Mr Zelenskyy, who he described as \"a pathetic person\". So is that bluster a sign of absolute genuine contempt, or a negotiating tactic? Probably both. \n                  Iran 'ready to make nuclear concessions' - as Trump asks for Qatar's help getting a deal\n                 \n                  Key moments that have shaped Trump and Zelenskyy's relationship\n                 \n                  Trump's deal with Syria - what does it mean?\n                 US says Trump and Putin needed for Ukraine talks breakthrough - follow latest Normally international diplomacy is rather beautifully choreographed. Leaders meet, talk and shake hands while their lieutenants and advisers circulate and advise. Planes are filmed landing and taking off; there's a grip and grin photo and press releases about useful conversations. But here, everything is mixed up. 👉 Listen to Sky News Daily on your podcast app 👈 We are, as former US defence secretary Donald Rumsfeld might have observed, awash in the world of both known unknowns and unknown unknowns. So Mr Zelenskyy was in Ankara, along with his host, Turkey's President Recep Tayyip Erdogan - a leader who somehow manages to be friends with both Mr Zelenskyy and Mr Putin. Read more:What happened the last (and only) time Putin and Zelenskyy met face to face? A five-hour drive away, there was a Russian delegation in Istanbul, twiddling their thumbs with nobody to talk to. Mr Zelenskyy said they were mere window-dressing; the delegation's leaders insisted they had the authority to negotiate on behalf of Russia. And then there is the spectre of the Americans - much talked-about here, but not so far seen. Steve Witkoff, the property mogul who has now been reborn as America's uber-diplomat, might be coming. Nobody is quite sure, though. So who benefits from this blend of uncertainty and chaos? Possibly Mr Zelenskyy, who looks like the grown-up leader who was prepared to take a risk. But perhaps also Mr Putin, who basically trolled Mr Zelenskyy by sending a B Team as an insult and has now pushed the Americans into stating, repeatedly, that a summit meeting between Donald Trump and Mr Putin is the only way forward. In other words, by not turning up for these talks, Mr Putin seems to have secured himself future negotiations that expressly exclude Mr Zelenskyy but do include an American president who seems happy to hand over Ukrainian territory to Moscow in order to end a war being conducted thousands of miles from his own country. It is the Trump era. And Mr Putin, more than most, doesn't just know that fact, but seems to know how to exploit it."
    },
    {
        "title": "FIFA president Gianni Infantino criticised by European football chiefs over decision to join Donald Trump tour",
        "description": "FIFA president Gianni Infantino's decision to join Donald Trump's Gulf tour has been criticised by European football's governing body after he arrived late for the biggest annual gathering of the global game.",
        "url": "https://news.sky.com/story/fifa-president-gianni-infantino-criticised-by-european-football-chiefs-over-decision-to-join-donald-trump-tour-13368661",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-gianni-infantino_6917765.jpg?20250515222309",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-05-15 20:56:00",
        "Headline": "In a statement to Sky News, UEFA criticised \"private political interests\" being prioritised, with Mr Infantino becoming one of Donald Trump's closest non-American allies.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n FIFA president Gianni Infantino's decision to join Donald Trump's Gulf tour has been criticised by European football's governing body after he arrived late for the biggest annual gathering of the global game. In a statement to Sky News, UEFA criticised \"private political interests\" being prioritised, with Mr Infantino becoming one of President Trump's closest non-American allies. Not only did Mr Infantino miss key FIFA events, including an official dinner in Paraguay, but the start of the FIFA Congress was delayed by hours on Thursday. Mr Infantino was late after flying in from Doha after attending a state dinner held by the emir of Qatar to mark Mr Trump's visit. The football boss had previously been in Saudi Arabia with Mr Trump and spent time with Crown Prince Mohammed bin Salman. After flying into Paraguay on a Qatar Airways private jet, Mr Infantino did open his delayed address to the FIFA Congress by \"presenting my apologies for the inconvenience for having to move the Congress kick-off time\". But that annoyed UEFA, who issued an unprecedented public rebuke after tensions with Mr Infantino had thawed in recent years. UEFA told Sky News: \"The last minute changes to the timings of the FIFA Congress are deeply regrettable. \"The FIFA Congress is one of the most important meetings in world football, where all the 211 nations in the world's game gather to discuss issues that affect the sport right across the world. \"Our hosts, the Paraguay FA and our partners at CONMEBOL, had gone to considerable effort to accommodate so many delegates and we thank them for their hospitality. \"But to have the timetable changed at the last minute for what appears to be simply to accommodate private political interests, does the game no service and appears to put its interests second. \"We are all in post to serve football; from the streets to the podium, and UEFA members of the FIFA Council felt the need on this occasion to make a point that the game comes first and to leave as originally scheduled.\" Read more from Sky News:Ukrainian man charged over fires at properties linked to StarmerHamas confirms direct peace talks with US - exclusivePolice hunt for teens seen 'carrying dismembered kittens in bag' Mr Infantino justified his trip by pointing to the US being the main host of the 2026 men's World Cup and Saudi Arabia staging the event in 2034. He told delegates at the FIFA Congress in Asuncion: \"Obviously some important discussions took place there with regards to the World Cup with some world leaders in politics and economy and I felt like I had to be there to represent all of you, to represent football, I thought I could make it on time but unfortunately we had a little issue with our flight, which caused this delay.\""
    },
    {
        "title": "Iran 'ready to make nuclear concessions' - as Trump asks for Qatar's help getting a deal",
        "description": "A top Iranian official has said the country is prepared to make a number of concessions related to its nuclear programme, in exchange for the lifting of economic sanctions.",
        "url": "https://news.sky.com/story/iran-ready-to-make-nuclear-concessions-as-trump-asks-for-qatars-help-getting-a-deal-13368034",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-ayatollah-ali-khamenei_6916794.jpg?20250515022701",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-15 01:11:00",
        "Headline": "US President Donald Trump this week is touring three countries across the Middle East in the first major outing of his second administration. Amid stops in Saudi Arabia, Qatar and the UAE he has spoken about Iran and its nuclear programme. ",
        "Content": "A top Iranian official has said the country is prepared to make a number of concessions related to its nuclear programme, in exchange for the lifting of economic sanctions. It comes as Donald Trump, during his tour of the Middle East, urged Qatar to wield its influence over Iran to persuade it to give up its nuclear programme. Ali Shamkhani, a top political, military and nuclear adviser to Iranian Supreme Leader Ayatollah Ali Khamenei, spoke to Sky News' US partner NBC News. He said Tehran was willing to commit to never making nuclear weapons again, getting rid of its stockpiles of highly enriched uranium, which can be weaponised, agree to only enrich uranium to the lower levels needed for civilian use and allow international inspectors to supervise the process. This was in exchange for the prospect of the immediate lifting of all economic sanctions on the country. Asked if Iran would sign an agreement today if those conditions were met, Mr Shamkhani told NBC: \"Yes.\" His comments are the clearest public indication of what Iran hopes to get out of a deal and their willingness to do one. \n                  It's the Trump era and Putin knows how to exploit it\n                 \n                  Key moments that have shaped Trump and Zelenskyy's relationship\n                 \n                  Trump's deal with Syria - what does it mean?\n                 \"It's still possible. If the Americans act as they say, for sure we can have better relations,\" Mr Shamkhani added. However, he expressed frustration at continued threats from the US president, describing them as \"all barbed wire\" and no olive branch. Similarly, he warned that Israeli Prime Minister Benjamin Netanyahu might try to derail the deal. Trump goes to the Middle East  Elsewhere, on the second of three stops on his tour of the Middle East, Mr Trump appealed to Qatar for help in the process. He urged the country to use its influence over Iran to persuade its leadership to reach a deal with the US and dial back its rapidly advancing nuclear programme. Mr Trump made the comments during a state dinner. He said: \"I hope you can help me with the Iran situation. \"It's a perilous situation, and we want to do the right thing.\" Over the years, Qatar has played the role of intermediary between the US and Iran and its proxies - including talks with Hamas as its 19-month war with Israel grinds on. This comes after Mr Trump told a Gulf Cooperation Council meeting in Riyadh, Saudi Arabia, this week that he wants \"to make a deal\". However, he said that as part of any agreement, Iran must end its support of proxy groups throughout the Middle East. A nuclear Iran Mr Trump has always said Iran could not be allowed to develop a nuclear weapon. While Iran has always denied doing so, the UN nuclear watchdog, the International Atomic Energy Agency, has warned that Tehran has enough enriched uranium close to weapons-grade quality for nearly six bombs. Read more:King 'piggy in the middle' in Canada-US stand-offTrump: 'It would be stupid not to accept Qatari plane'  The US and Iran reached a nuclear deal in 2015, under Barack Obama, in which Iran agreed to drastically reduce its stockpile of uranium and limit enriching up to 3.67%. But Mr Trump scrapped that deal in his first term. Today, Iran enriches up to 60%, a short, technical step from weapons-grade levels. Washington and Tehran have engaged in four rounds of talks since early April."
    },
    {
        "title": "The moon's very different sides explained in new NASA study",
        "description": "Scientists have discovered key differences under the moon's surface that may explain why its two hemispheres look so different.",
        "url": "https://news.sky.com/story/the-moons-very-different-sides-explained-in-new-nasa-study-13368471",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-moon-nasa_6917531.jpg?20250515180346",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-15 16:01:00",
        "Headline": "Scientists have long suspected the differences could be explained by what's inside the moon but until now, they couldn't prove it.",
        "Content": "Scientists have discovered key differences under the moon's surface that may explain why its two hemispheres look so different. The moon's near side, the side visible to Earth, is dark and covered in the remnants of ancient lava flows. Its far side, which we can't see from Earth, is rugged and rocky. Scientists have long suspected the differences could be explained by what's inside the moon but until now, couldn't prove it. \"We found that the moon's near side is flexing more than the far side, meaning there's something fundamentally different about the internal structure of the moon's near side compared to its far side,\" said Ryan Park, who led the team from NASA's Jet Propulsion Laboratory. \"When we first analysed the data, we were so surprised by the result we didn't believe it. So we ran the calculations many times to verify the findings. \"In all, this is a decade of work.\" \n                  Half-tonne piece of Soviet rocket may have crashed through atmosphere over south of England\n                 \n                  First moon rocks on Earth in half a century arrive in UK\n                 \n                  Half-tonne piece of Soviet rocket due to crash back down to Earth\n                 The team studied data gathered by the Gravity Recovery and Interior Laboratory (GRAIL) mission. Read more from climate, science and technology:M&S says customers' personal data taken by hackersAIs can make collective decisions and influence each otherWarning of heat impact on pregnant women and newborns For that mission, two spacecraft, Ebb and Flow, were sent to orbit the moon for a year between 2011 and 2012. They used that data to map how the moon responds to Earth's gravitational pull as it orbits. The moon's gravity slightly fluctuates as it circles the Earth which causes it to flex. That movement helped the scientists to understand the moon's deep internal structure and discovered that the moon's near side is internally warmer than its far side. Although this helps with crucial understanding of the moon, it may also help us understand other planets. In fact, the team have already used their technique to map the internal structures of planets like Jupiter and the Vesta asteroid. \"There are many opportunities in the future to apply our technique for studying the interiors of intriguing planetary bodies throughout the solar system,\" said Mr Park."
    },
    {
        "title": "Death of man on Benidorm holiday 'being treated as possible murder', family say",
        "description": "The death of a British man who was found at the bottom of a cliff in Spain is now being treated as a potential murder, according to his family.",
        "url": "https://news.sky.com/story/death-of-man-on-benidorm-holiday-being-treated-as-possible-murder-family-say-13368560",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-wales-pontypridd-benidorm_6704817.jpg?20250515222931",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-15 18:10:00",
        "Headline": "Nathan Osman's body was found at the bottom of a remote cliff soon after he arrived in the Spanish resort in September 2024.",
        "Content": "The death of a British man who was found at the bottom of a cliff in Spain is now being treated as a potential murder, according to his family. Nathan Osman, 30, from Pontypridd in South Wales, was on a long weekend break with friends in Benidorm last September. Less than 24 hours after he arrived, his body was found by an off-duty police officer at the bottom of a remote 650ft (200m) cliff on the outskirts of the resort. Lee Evans, Mr Osman's brother, told Sky News: \"The prosecutor in Benidorm told us that they 'strongly believe foul play is involved and we are treating it as a potential homicide'.\"  The father-of-four died from head and abdominal injuries after falling from height, a post-mortem examination found. Local police said it was \"a tragic accident\", but his family believe the investigation into his death has not been adequate. They have pointed to attempts that were made to use his bank cards the day after he died as evidence that others may have been involved. They carried out their own investigation, and built a timeline of events drawn from sources including CCTV and, after presenting their findings to Spanish prosecutors, the case has been reopened, they said. On Monday, the case was raised in the House of Commons by Pontypridd MP, Alex Davies-Jones, who has also met the family to hear their views. They want a law in Mr Osman's name to improve support for British people who lose loved-ones abroad. Mr Evans told Sky News: \"We're astonished there's nothing in place like this, no governing body to follow who has been help to us at all in Nathan's case. \"We've had to find out blind - to find everything ourselves and we're still learning and have no structural support in place. There's a massive cry for help for families like us.\" Read more on Sky News:Siblings jailed for 'ferocious' murderKing 'flabbergasted' by money trickTeenagers sought over kitten deaths  Jonathan Osman, Nathan's father, told The UK Tonight With Sarah-Jane Mee on Tuesday his son was \"a wonderful soul\" and \"the closest to perfect you could get\". He said his son was \"loving, faithful, you could depend on him, he would do anything for others\", adding that he was \"funny, he never moaned, he was a good worker, he had children to live for... everything was an adventure for him\"."
    },
    {
        "title": "Ben & Jerry's co-founder arrested after US Capitol Gaza protest",
        "description": "The co-founder of Ben & Jerry's has been arrested after disrupting a Senate hearing with a pro-Gaza protest.",
        "url": "https://news.sky.com/story/ben-jerrys-co-founder-arrested-after-us-capitol-gaza-protest-13368039",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ben-cohen-ben-and-jerrys_6916798.jpg?20250515041227",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-15 03:13:00",
        "Headline": "Ben Cohen, the Ben in the famous ice cream company Ben & Jerry's, was one of several people who disrupted a Senate committee hearing on Wednesday when US health secretary Robert F Kennedy Jr was speaking.",
        "Content": " The co-founder of Ben & Jerry's has been arrested after disrupting a Senate hearing with a pro-Gaza protest. Ben Cohen, Ben of the famous ice cream company Ben & Jerry's, was one of seven people arrested at a Senate Health, Education, Labor and Pensions Committee hearing on Wednesday, Sky News' US partner NBC News reported. Robert F Kennedy Jr was speaking to the committee when the protests started with someone shouting: \"RFK kills people with AIDs!\" \"When Bobby lies, children die,\" is also heard, as well as: \"Anti-vax, anti-science, anti-America\" in reference to Mr Kennedy's vaccine views. Police quickly flooded into the room and began dragging out protesters. Moments after, Mr Cohen got to his feet and accused the US government of playing a role in the deaths of children in Gaza. The ice cream boss can be seen in footage of the incident on his feet, gesturing as he shouted at the US health secretary. \n                  Cassie challenged over Diddy 'freak off' allegations - as explicit messages read in court\n                 \n                  Smokey Robinson under criminal investigation over rape and sexual assault allegations\n                 \n                  Hamas confirms direct peace talks with US - as it calls on Trump to 'pressure' Israel\n                 \"You're killing poor kids in Gaza and paying for it by cutting Medicaid for kids here,\" shouted Mr Cohen. He is one of the last protesters hauled out of the room. But even as he's removed, he can still be heard shouting. \"Congress and the senators need to ease the siege. They need to let food into Gaza. They need to let food to starving kids,\" he said. The other six protesters were charged with resisting arrest and assault on an officer, NBC News said. Earlier on Wednesday, Mr Cohen had attended a pro-Palestine event with Democratic Representative Rashida Tlaib. Afterwards, Mr Cohen tweeted out a video of the incident, saying: \"I told Congress they're killing poor kids in Gaza by buying bombs, and they're paying for it by kicking poor kids off Medicaid in the US. \"This was the authorities' response.\" Read more from Sky News:Menendez brothers' murder sentences reducedTrump: 'It would be stupid not to accept Qatari plane'Cassie breaks down in tears during 'Diddy' trial Mr Cohen is no stranger to protests or getting arrested. In July 2023, he was arrested after protesting about the US prosecution of Julian Assange. 'Poor kids in Gaza' Israel has killed around 53,000 Palestinians during its war with Hamas, many of them women and children, according to the Hamas-run health ministry. The Gaza health ministry does not distinguish between civilians and combatants in its count, but said that more than half of the fatalities are women and children. It is said the real death toll in Gaza is higher because thousands of bodies remain buried under the rubble or in areas that medics cannot access. The fighting began after the militant group led an attack across the border in October 2023, killing 1,200 people and taking around 250 hostage. Since Israel broke a ceasefire on 18 March, almost 3,000 people have been killed, the ministry said. The Israeli military has claimed, without evidence, to have killed 17,000 militants."
    },
    {
        "title": "Cassie challenged over Diddy 'freak off' allegations - as explicit messages read in court",
        "description": "Sexually explicit messages between RnB singer Cassie and her former boyfriend Sean \"Diddy\" Combs have been read in court, with some showing her expressing apparent enthusiasm about the \"freak off\" sex sessions with escorts she alleges she was forced into.",
        "url": "https://news.sky.com/story/cassie-challenged-over-diddy-freak-off-allegations-as-explicit-messages-read-in-court-13368701",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sean-combs-cassie-casandra-ventura_6917823.jpg?20250515230712",
        "type": "US",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-15 21:55:00",
        "Headline": "During the fourth day of the Sean \"Diddy\" Combs sex-trafficking trial in Manhattan, New York, defence lawyers pushed back on allegations of abuse by Cassie, focusing on texts and emails that were both romantic and sexually explicit at times.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Sexually explicit messages between RnB singer Cassie and her former boyfriend Sean \"Diddy\" Combs have been read in court, with some showing her expressing apparent enthusiasm about the \"freak off\" sex sessions with escorts she alleges she was forced into. The 38-year-old, whose full name is Casandra Ventura, faced a full day of cross-examination from the hip-hop mogul's defence lawyers, who are attempting to convince the jury she consented to a \"swingers lifestyle\". Combs, 55, has pleaded not guilty to charges of sex trafficking, racketeering conspiracy and transportation to engage in prostitution, in relation to Ms Ventura and other women. His lawyers have conceded he could be violent, but say nothing he did amounted to crimes of this nature. Ms Ventura alleges she was physically abused and degraded for years by the powerful hip-hop star and music executive, accusing him of violence, coercion, blackmail and rape. Prosecutors say he exploited and used his network of employees to facilitate illegal activities, which is a key part of the racketeering charge. Sean 'Diddy' Combs trial: Day 4 - As it happened But during the fourth day of the trial in Manhattan, New York, defence lawyers pushed back, focusing on texts and emails that were both romantic and sexually explicit. \"I'm always ready to freak off,\" the court heard Ms Ventura wrote in one message in August 2009. In another she told him, about a freak off: \"Can't wait.\" And in another, jurors were told, she described a video of one sex session with an escort as \"dope\". The pair were together, on and off, for about 11 years from 2007 to 2018. Combs, whose mother Janice has been in court all week to support him, along with some of his children, appeared relaxed as the messages were read aloud for jurors. Messages from 4 March 2016 - the day before an incident at the InterContinental Hotel in Century City, Los Angeles, in which Combs was filmed on CCTV seeming to attack Ms Ventura in a hallway, as he was wearing just a towel and socks - were also read in court. Footage from this incident, which was first made public in May 2024, has been a key piece of evidence during the trial. Ms Ventura has told the court it happened as she tried to leave a freak off session after being hit by Combs. Freak off 'felt dirty, grimy' During cross-examination, the court heard Ms Ventura sent a sexually explicit message the day before this. She also sent him a message saying, \"Baby I want to FO so bad but I dont want to f*** myself up\". Ms Ventura has told the court this was damage limitation and that she wanted to keep him happy, as she had a film premiere coming up a few days later. Jurors also heard details of an email she sent in 2009, in which she expressed conflicting feelings about taking part in these sex sessions with escorts. In the email, she told Combs she needed to trust him \"beyond it just being sexual\" - that in order to be more open sexually, \"I need to feel safe, like home\". She told him \"the last time was a mistake but since has made me feel a little dirty, and grimy as opposed to sexual and spontaneous\". This was the reason she was going \"back and forth in my mind with wanting and not wanting to do it\", she wrote. At first, when they were \"so in love... there were no questions asked, it felt right\". She told him: \"I get nervous that I'm just becoming the girlfriend that you get your fantasies off with.\" Ms Ventura has told the court that she fell in love with Combs very quickly when they got together, when she was 21 and he was 37. She has said she wanted to please him, but became fearful of him. At one point during cross-examination, she raised that she felt jurors were not hearing the full context of some of the messages being highlighted, saying: \"There's a lot we skipped over.\" Combs's lawyers are painting his sexual preferences as part of a \"swingers\" lifestyle that has been mentioned previously at trial, saying people might not agree with it but it does not make him guilty of sex trafficking. Questioned on this, Ms Ventura said they were \"very different\". She was also asked about drug use, her own and Combs's, and at one point told the court she believed he was addicted to opiates when they were together. She also said he was taken to hospital after overdosing on opiates at the Playboy Mansion in 2012 - something which was reported on by outlets including TMZ at the time, when it was said he had suffered a migraine.  Judge frustrated with Diddy's lawyers Away from the questioning, a notable moment in court came when Judge Arun Subramanian became frustrated with Diddy's lawyers over how long they will spend cross-examining Ms Ventura. He told them they should get a day and a half - the same time the prosecution had. \"In what universe did you not understand this is what was going to happen?\" he told them. The judge is keen to keep the trial on time and particularly Ms Ventura's evidence, as she is eight months pregnant with her third child with husband Alex Fine, who has been supporting her in court. Read more:The rise and fall of DiddyDiddy - a timeline of allegationsEverything you need to know about the trial She has now spent almost three days on the witness stand - tomorrow will be her fourth - and became emotional towards the end of her testimony on her second day. The criminal case against Combs comes after Ms Ventura sued him in 2023, accusing him of years of physical and sexual abuse. The suit was settled in 24 hours, for a figure that was undisclosed at the time. Ms Ventura has confirmed during the trial that this was $20m (about £15m). Combs, 55, has been jailed since September, and faces at least 15 years or possibly life in prison if convicted."
    },
    {
        "title": "Smokey Robinson under criminal investigation over rape and sexual assault allegations",
        "description": "Motown legend Smokey Robinson is under criminal investigation after four former housekeepers accused him of rape and sexual assault, the Los Angeles County Sheriff's Department said.",
        "url": "https://news.sky.com/story/smokey-robinson-under-criminal-investigation-over-rape-and-sexual-assault-allegations-13368724",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-smokey-robinson-new-york_6908686.jpg?20250507081924",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-15 23:40:00",
        "Headline": "The investigation comes just over a week after four former housekeepers filed a lawsuit seeking $50m (£37m) in damages over the alleged assaults.",
        "Content": "Motown legend Smokey Robinson is under criminal investigation after four former housekeepers accused him of rape and sexual assault, the Los Angeles County Sheriff's Department said. The investigation comes just over a week after the housekeepers filed a lawsuit seeking $50m (£37m) in damages in a civil case over the alleged assaults - which the women say took place between 2007 and 2024. The Los Angeles County Sheriff's Department said in a statement on Thursday that its special victims bureau is now \"actively investigating criminal allegations\" against the 85-year-old. It added that the investigation is in its early stages and that no other details will be provided. The four former housekeepers alleged in their civil lawsuit that the singer, whose real name is William Robinson Jr, carried out the rapes and sexual assaults while they worked for him. The claim further states that Robinson's wife, Frances Robinson, enabled his behaviour. It also says she was responsible for creating a hostile work environment and shouted at them and used ethnic insults. \n                  US singer Chris Brown charged with GBH over alleged attack in London\n                 \n                  Cassie challenged over Diddy 'freak off' allegations - as explicit messages read in court\n                 \n                  Gary Lineker apologises for 'Zionism' re-post featuring image of rat\n                 The Motown singer's lawyer Christopher Frost has said he welcomes the criminal investigation and feels \"confident that a determination will be made that Mr. Robinson did nothing wrong, and that this is a desperate attempt to prejudice public opinion and make even more of a media circus than the plaintiffs were previously able to create\", Sky's US partner network NBC News reports. \"The record will ultimately demonstrate that this is nothing more than a manufactured lawsuit intended to tarnish the good names of Smokey and Frances Robinson for no other reason than unadulterated avarice,\" Mr Frost added. Following the filing of the civil lawsuit, Mr Frost called the allegations \"vile\" and \"false \" and said the women's claims were \"simply an ugly method of trying to extract money from an 85-year-old American icon\". Read more from Sky News:US singer Chris Brown charged over alleged London attackCassie challenged over Diddy 'freak off' accusations John Harris and Herbert Hayden, the lawyers for the women, say they are pleased to learn that law enforcement is looking into the allegations against the singer. \"Our clients intend to fully co-operate with LASD's (Los Angeles County Sheriff's Department) ongoing investigation in the pursuit of seeking justice for themselves and others that may have been similarly assaulted by him,\" the lawyers said. Robinson, a member of both the Rock & Roll Hall of Fame and the Songwriters Hall of Fame, was among the biggest hitmakers of the 1960s - both with his group The Miracles and as a solo artist, with songs including The Tears Of A Clown and The Tracks Of My Tears. He was a central part of the Motown Records music machine in his hometown of Detroit as an artist, producer and songwriter for other artists."
    },
    {
        "title": "Hamas confirms direct peace talks with US - as it calls on Trump to 'pressure' Israel",
        "description": "A senior Hamas official has confirmed the militant group is in direct talks with the United States over peace in Gaza, adding that it believes Donald Trump can help broker a deal. ",
        "url": "https://news.sky.com/story/hamas-confirms-direct-peace-talks-with-us-as-it-calls-on-trump-to-pressure-israel-13368330",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-hamas-basem-naim_6917251.jpg?20250515141321",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-15 12:58:00",
        "Headline": "A senior Hamas official also addresses whether Hamas - which has been in power since it won the 2006 Palestinian elections - could step down from government in order to secure peace in Gaza.",
        "Content": " A senior Hamas official has confirmed the militant group is in direct talks with the United States over peace in Gaza, adding that it believes Donald Trump can help broker a deal.  Speaking to Sky News' lead world news presenter Yalda Hakim, Dr Basem Naim said Hamas has shared its proposed agreement both through mediators and \"directly with some persons in the US administration\". They are calling for \"a prisoner exchange, total withdrawal of Israeli forces, allowing all the aid to get into Gaza and rebuilding of [the] Gaza Strip without forceful immigration,\" he said. Dr Naim also addressed whether Hamas - which has been in power since it won the 2006 Palestinian election - could step down from government in order to secure peace. \"We have also told the Americans, we are ready to, again, to hand over the government immediately if we reach an end of this war,\" he said. Dr Naim added Hamas has \"accepted\" an Egyptian peace proposal which \"is talking about forming a Palestinian, independent, politically unaffiliated body to run the Gaza Strip\". \"Before that, as long as we are still occupied people, we have all the right to continue defending our people and resisting the occupation with all means including under resistance,\" he said. Turning his attention directly to the US president, the senior Hamas official said he thinks Mr Trump \"has the capability and the will to reach this peaceful situation\". He said: \"Gaza and Gazans are deserving, like all other people everywhere, to live in peace and dignity. \"And I think President Trump can do it if he exercises enough pressure on the Israelis to end this war immediately. And we are ready to cooperate with him to achieve this goal of a more peaceful region.\" Responding to the interview with Hamas, White House National Security Council spokesman James Hewitt told Sky News that Hamas \"has not demonstrated they are serious about peace\" and that Mr Trump \"has been clear Hamas must lay down their arms\". \"Hamas continues to wrongfully hold hostages, including American bodies, in the dungeons of Gaza who could easily be freed and have shown no changes in behaviour to indicate they will cease to attack civilians,\" he added. Lead world news presenter Donald Trump's Middle East tour has been full of surprises.  But the revelation that officials in his administration are speaking directly to Hamas is one of the most significant.   As the US president addressed troops at the Al Udeid airbase in Qatar – the largest in the region – I sat down with a senior Hamas official who confirmed direct talks were ongoing.  In an exclusive interview, Dr Bassem Naim praised Trump and talked up chances of finding a peaceful resolution.  It's a remarkable statement from a senior figure within the group, which is considered by the US and UK to be a terrorist organisation.  Much has been made of Trump's 'transactional' approach here in the region.  His commitment to the 'art of the deal' can often achieve unexpected results but also anger his allies – which is almost certainly the case with Israel's embattled Prime Minister Benjamin Netanyahu.  When I asked Dr Naim about the demands from Israel and the United States for Hamas to disarm and accept that it can no longer be the governing force in Gaza, he set out conditions that Hamas says would have to be met.   However, President Trump's public stance on Hamas remains as stern as ever. The group \"needed to be dealt with\" he said earlier, adding he has \"concepts for Gaza,\" and that the US should \"take it\" and turn it into a \"freedom zone\".  Israel's war in Gaza has now entered its 20th month with more than 53,000 people believed to be dead, according to Gaza's Hamas-run health ministry.  Some 15,000 of them are children, according to UNICEF. There are still more than 50 Israeli hostages held by Hamas in the Strip. In a statement released on Thursday, Hamas highlighted the fact it recently released hostage Edan Alexander, an Israeli soldier with American citizenship. It continued: \"We expect, based on the understandings reached with the American side, and with the knowledge of the mediators, that humanitarian aid should have entered the Gaza Strip immediately, a call been made for a permanent ceasefire, and that comprehensive negotiations would have been held on all issues to achieve security and stability in the region, a goal we aspire to achieve. \"However, failure to achieve these steps, especially the entry of humanitarian aid to our people, will cast a negative effect over any efforts to complete negotiations on the prisoner exchange process.\" Read more:Analysis of Gaza hospital attack contradicts IsraelGaza aid ship bombed by drones  The US president has previously shared plans of his own for Gaza and in February, he posted a bizarre AI video showing the region transformed into a paradise complete with its own Trump tower and exotic beaches. The States could \"own that piece of land\" and develop it, he said - but the idea was swiftly condemned as the effective \"ethnic cleansing\" of Palestinians from Gaza.  Mr Trump is currently on a visit to the Middle East, which has included stops in the United Arab Emirates, Qatar and Saudi Arabia - but not Israel. There had been hopes his trip could lead to a ceasefire deal, but Israeli Prime Minister Benjamin Netanyahu has pushed ahead with an escalation of force on the Gaza Strip. Israel has this week launched airstrikes on two consecutive nights while continuing to block aid for the region, worsening the humanitarian crisis. Watch the full interview with Dr Basem Naim from 9pm this evening on The World With Yalda Hakim on Sky News"
    },
    {
        "title": "Ben & Jerry's co-founder arrested after US Capitol Gaza protest",
        "description": "The co-founder of Ben & Jerry's has been arrested after disrupting a Senate hearing with a pro-Gaza protest.",
        "url": "https://news.sky.com/story/ben-jerrys-co-founder-arrested-after-us-capitol-gaza-protest-13368039",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ben-cohen-ben-and-jerrys_6916798.jpg?20250515041227",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-15 03:13:00",
        "Headline": "Ben Cohen, the Ben in the famous ice cream company Ben & Jerry's, was one of several people who disrupted a Senate committee hearing on Wednesday when US health secretary Robert F Kennedy Jr was speaking.",
        "Content": " The co-founder of Ben & Jerry's has been arrested after disrupting a Senate hearing with a pro-Gaza protest. Ben Cohen, Ben of the famous ice cream company Ben & Jerry's, was one of seven people arrested at a Senate Health, Education, Labor and Pensions Committee hearing on Wednesday, Sky News' US partner NBC News reported. Robert F Kennedy Jr was speaking to the committee when the protests started with someone shouting: \"RFK kills people with AIDs!\" \"When Bobby lies, children die,\" is also heard, as well as: \"Anti-vax, anti-science, anti-America\" in reference to Mr Kennedy's vaccine views. Police quickly flooded into the room and began dragging out protesters. Moments after, Mr Cohen got to his feet and accused the US government of playing a role in the deaths of children in Gaza. The ice cream boss can be seen in footage of the incident on his feet, gesturing as he shouted at the US health secretary. \n                  Cassie challenged over Diddy 'freak off' allegations - as explicit messages read in court\n                 \n                  Smokey Robinson under criminal investigation over rape and sexual assault allegations\n                 \n                  Hamas confirms direct peace talks with US - as it calls on Trump to 'pressure' Israel\n                 \"You're killing poor kids in Gaza and paying for it by cutting Medicaid for kids here,\" shouted Mr Cohen. He is one of the last protesters hauled out of the room. But even as he's removed, he can still be heard shouting. \"Congress and the senators need to ease the siege. They need to let food into Gaza. They need to let food to starving kids,\" he said. The other six protesters were charged with resisting arrest and assault on an officer, NBC News said. Earlier on Wednesday, Mr Cohen had attended a pro-Palestine event with Democratic Representative Rashida Tlaib. Afterwards, Mr Cohen tweeted out a video of the incident, saying: \"I told Congress they're killing poor kids in Gaza by buying bombs, and they're paying for it by kicking poor kids off Medicaid in the US. \"This was the authorities' response.\" Read more from Sky News:Menendez brothers' murder sentences reducedTrump: 'It would be stupid not to accept Qatari plane'Cassie breaks down in tears during 'Diddy' trial Mr Cohen is no stranger to protests or getting arrested. In July 2023, he was arrested after protesting about the US prosecution of Julian Assange. 'Poor kids in Gaza' Israel has killed around 53,000 Palestinians during its war with Hamas, many of them women and children, according to the Hamas-run health ministry. The Gaza health ministry does not distinguish between civilians and combatants in its count, but said that more than half of the fatalities are women and children. It is said the real death toll in Gaza is higher because thousands of bodies remain buried under the rubble or in areas that medics cannot access. The fighting began after the militant group led an attack across the border in October 2023, killing 1,200 people and taking around 250 hostage. Since Israel broke a ceasefire on 18 March, almost 3,000 people have been killed, the ministry said. The Israeli military has claimed, without evidence, to have killed 17,000 militants."
    },
    {
        "title": "Three climbers dead after 200ft fall - while one 'miraculously' survives",
        "description": "Three climbers have died after they fell hundreds of feet on to jagged rock, while the survival of one man in the group is being called \"miraculous\".  ",
        "url": "https://news.sky.com/story/three-climbers-dead-after-200ft-fall-while-one-miraculously-survives-13368147",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-washington-cascades_6916906.jpg?20250515075916",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-15 11:09:00",
        "Headline": "Vishnu Irigireddy, 48, Tim Nguyen, 63, Oleksander Martynenko, 36, died while climbing down a steep gulley on the 7,800ft Early Winters Spire peaks in Washington on Sunday.",
        "Content": "Three climbers have died after they fell hundreds of feet on to jagged rock, while the survival of one man in the group is being called \"miraculous\".   Vishnu Irigireddy, 48, Tim Nguyen, 63, Oleksander Martynenko, 36, died while climbing down a steep gully on the 7,800ft Early Winters Spire peaks in Washington state on Sunday. Their fall was likely caused by a \"weathered\" piton, which is a metal spike serving as an anchor used to slow the descent down a steep mountainside, tearing from the rock, the Okanogan County Sheriff's Office said. The fourth climber, Anton Tselykh, 38, from Seattle, miraculously survived, despite also plummeting 200ft on to jagged rock and tumbling another 200ft before coming to rest in a tangle of ropes and climbing equipment. He suffered internal bleeding and severe head trauma, which caused him to pass out until around 10pm, hours after the estimated time of the fall, police said. He managed to untangle himself before \"crawling and feeling around in nearly pitch darkness\" to find his way back to his car, Okanogan County Undersheriff David Yarnell told Sky News' US partner NBC News. Mr Tselykh drove west over the mountain range and collided with a guardrail on the way, falling unconscious, before finally reaching a pay phone to call for help. \n                  Iran 'ready to make nuclear concessions' - as Trump asks for Qatar's help getting a deal\n                 \n                  Trump's tariffs hit the West's busiest port - with traffic down by nearly a third\n                 \n                  Denmark's PM says 'you can't spy against an ally' after claims of US gathering intelligence on Greenland\n                 His survival \"is miraculous to say the least,\" Mr Yarnell said. Mr Tselykh is being treated in a Seattle hospital and is in \"satisfactory condition\", according to a hospital spokesperson. The bodies of the three climbers have since been recovered, locating them via a GPS device in their kit. Police said the three men had suffered massive leg and cranial traumas. Authorities believe the group had been ascending the north Early Winters Spire peak when they decided to reverse course due to an approaching storm. Read more from Sky News:Ben & Jerry's co-founder dragged out of SenateMenendez brothers' murder sentences reduced The Early Winters Spires in the Northern Cascades consist of two 7,800ft peaks, which are popular with climbers. The route the group was taking was of moderate difficulty and sees climbers moving between ice, snow and rock, according to a local guide, who cautioned that conditions can change rapidly depending on the weather."
    },
    {
        "title": "Treasury to kick off search for new boss of banking watchdog",
        "description": "The Treasury is preparing to kick off a search for a new boss of Britain's prudential financial watchdog - one of the world's key banking regulatory jobs.",
        "url": "https://news.sky.com/story/treasury-to-kick-off-search-for-new-boss-of-banking-watchdog-13368435",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-bank-of-england-london_6917423.jpg?20250515162728",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-15 15:10:00",
        "Headline": "Officials are drawing up plans for a process to identify a successor to Sam Woods, whose second term as chief executive of the PRA ends in June 2026, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Treasury is preparing to kick off a search for a new boss of Britain's prudential financial watchdog - one of the world's key banking regulatory jobs. Sky News has learnt that officials are drawing up plans to advertise for a chief executive to replace Sam Woods at the Prudential Regulation Authority (PRA) next year. A recruitment process is not expected to formally get under way until after the summer. It is likely to draw interest from senior regulatory figures from around the world, City sources said on Thursday. Mr Woods has served two terms in the post, and will step down at the end of his second term next June. A respected figure, he is seen as a plausible candidate to succeed Andrew Bailey as governor of the Bank of England in 2028. Prior to his current PRA role, Mr Woods served as its executive director of insurance. News of the impending recruitment process comes weeks after the chancellor, Rachel Reeves, appointed Nikhil Rathi to a second five-year term as boss of the Financial Conduct Authority. As CEO of the PRA, Mr Woods is also a deputy governor of the Bank of England, a member of the Bank's Court of Directors, and a director of the FCA. The Treasury declined to comment."
    },
    {
        "title": "UK economy grows more than expected, according to official figures",
        "description": "The UK economy showed strong growth in the first three months of the year, according to official figures.",
        "url": "https://news.sky.com/story/uk-economy-grows-more-than-expected-according-to-official-figures-13368115",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-rachel-reeves-derby_6916959.jpg?20250515091443",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-05-15 08:06:00",
        "Headline": "The UK economy has shown resilience as it entered into a global trade war.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The UK economy showed strong growth in the first three months of the year, according to official figures. Gross domestic product (GDP) - the standard measure of an economy's value - grew 0.7% in the first quarter of 2025, the Office for National Statistics said. The rise is better than expected. An increase of just 0.6% was anticipated by economists polled by the Reuters news agency. Money blog: Reaction as UK economy grows more than expected It's significantly better than the three months previous, in which a slight economic expansion of just 0.1% was reported for the final quarter of 2024. Read more:Burberry to cut 1,700 jobs after multi-million pound lossCo-op updates on recovery after cyber attack forced empty shelves The ONS also said there was a small amount of growth last month, as GDP expanded 0.2% in March, which similarly beat expectations. No growth at all had been forecast for the month. How did the economy grow? A large contribution to high GDP growth was an increase in output in the production sector, which rose 1.1%, driven by manufacturing and a 4% increase in water supply, the ONS said. Also working to push up the GDP figure was 0.7% growth in the biggest part of the UK economy - the services industry.  Wholesale, retail and computer programming services all performed well in the quarter, as did car leasing and advertising, the ONS said. It shows the economy was resilient, as the country headed into the global trade war sparked by President Trump's so-called 'liberation day' tariff announcement on 2 April. GDP per capita, which gives a better sense of how well off or not people are feeling, has tended to be lower than the headline GDP figure in recent years. But for the first three months of this year, GDP per capita rose 0.5%. Not for a year (the first quarter of 2024) has there been such large GDP growth per head.  Welcome political news, for now The data is welcome news for a government who have identified growing the economy as its number one priority. Chancellor Rachel Reeves is taking the figures as a political win, saying the UK economy has grown faster than the US, Canada, France, Italy and Germany. \"Today's growth figures show the strength and potential of the UK economy, \" she said. \"Up against a backdrop of global uncertainty, we are making the right choices now in the national interest.\" Such GDP numbers may not continue into April as businesses and consumers were hit with a raft of bill rises, and Mr Trump's tariffs fired the starting gun on a global trade war. Last month, water, energy and council tax bills rose across the country while employers faced higher wage costs from the rise in their national insurance contributions and the minimum wage. But above-inflation wage growth and fading consumer caution could continue to boost the economy."
    },
    {
        "title": "UK businesses gearing up for Trump tariffs boost economy",
        "description": "These are punchy gross domestic product (GDP) numbers and no mistake.",
        "url": "https://news.sky.com/story/uk-businesses-gearing-up-for-trump-tariffs-boost-economy-13368101",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-dollar-pound-bill-note_6828377.jpg?20250214082225",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-05-15 07:31:00",
        "Headline": "Those expecting the economy to grow or contract could both be wrong, as domestically and internationally, it's as unpredictable as it has ever been.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  These are punchy gross domestic product (GDP) numbers and no mistake. Growth of 0.7% in the first quarter is not just strong; it's stronger than the 0.6% most economists had expected. GDP per head, a better measure of living standards (since it divides the total amount of income generated across the economy by the population), was up 0.5%. And compare the UK to our other counterparts in the G7 group of industrialised economies, and the UK looks like it had the strongest growth of all in the first quarter. There is, in short, much for Rachel Reeves to celebrate in these figures. But there is a nagging doubt, too. The key bit of context here is the one you will be very aware of: Donald Trump's trade war. The US president's tariffs have caused such a roller coaster of economic activity in recent months that it would be surprising if it were not reflected in growth estimates. Read more:Burberry to cut 1,700 jobs after multi-million pound lossCo-op updates on recovery after cyber attack forced empty shelves In the case of the UK, that has resulted in an unusually sharp increase in exports and investment in the first quarter of the year - mostly spending on aircraft, IT equipment and machinery, all sectors targeted by the US in those early tariff announcements. In other words, it's quite likely that much of this quarter's GDP represents businesses front-running the tariffs, buying in machinery and sending out exports to the US ahead of the deadlines imposed by the White House. \n                  UK economy grows more than expected, according to official figures\n                 \n                  Job vacancies fall - as employers hit with higher costs\n                 \n                  UK's top statistician Sir Ian Diamond quits following row over economic data\n                 If this is indeed a one-off bump, then that suggests this quarter's numbers are unlikely to be repeated. And indeed that's the Bank of England's expectation - that underlying economic growth drops back to 0.1% in the coming quarters, far from \"going gangbusters\". Indeed, the Bank's figures look positively dreary. But this, too, could prove to be wrong. In short, the economy - both domestically and internationally - is about as unpredictable as it has ever been."
    },
    {
        "title": "MPs waver once again as 'emotive' assisted dying bill heads back to the Commons",
        "description": "Further moves to amend the controversial assisted dying bill are being made by MPs as it returns to the Commons for another day of emotionally charged debate.",
        "url": "https://news.sky.com/story/mps-waver-once-again-as-emotive-assisted-dying-bill-heads-back-to-the-commons-13368612",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-assisted-dying-westminister_6917878.jpg?20250516012630",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-05-15 19:33:00",
        "Headline": "After a marathon committee stage, when more than 500 amendments were debated, the bill returns to the Commons with 130 amendments tabled.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Further moves to amend the controversial assisted dying bill are being made by MPs as it returns to the Commons for another day of emotionally charged debate. After a marathon committee stage, when more than 500 amendments were debated, of which a third were agreed, the bill returns to the Commons with 130 amendments tabled. As a result, the final and decisive votes on whether the bill clears the Commons and heads to the House of Lords are not expected until a further debate on 13 June. The bill proposes allowing terminally ill adults with less than six months to live to receive medical assistance to die, with approval from two doctors and an expert panel. Why is assisted dying so controversial - and where is it already legal? In a historic vote last November, after impassioned arguments on both sides, MPs voted 330 to 275 in favour of Labour MP Kim Leadbeater's Terminally Ill Adults (End of Life) Bill. Sir Keir Starmer voted in favour, while Deputy PM Angela Rayner, Foreign Secretary David Lammy, Health Secretary Wes Streeting and Justice Secretary Shabana Mahmood voted against. \n                  Assisted dying law 'unworkable, unaffordable and naive', says partnership of UK's leading social care groups\n                 \n                  Royal College of Psychiatrists pulls support for assisted dying bill\n                 \n                  Plans to legalise assisted dying in Scotland pass first stage\n                 The Conservatives were also split, with leader Kemi Badenoch voting in favour and former PM Rishi Sunak against. Reform UK leader Nigel Farage also voted against the bill.  The PM, who is attending a summit in Albania, will be absent this time, but asked for his current opinion, told reporters: \"My views have been consistent throughout.\" No fewer than 44 of the new amendments have been tabled by Ms Leadbeater herself, with government backing, a move that has been criticised by opponents of the bill. Opponents also claim some wavering MPs are preparing to switch from voting in favour or abstaining to voting against and it only needs 28 supporters to change their mind to kill the bill. Confirmed switchers from voting in favour to against include Tory MPs George Freeman and Andrew Snowden, Reform UK chief whip Lee Anderson and ex-Reform MP Rupert Lowe. Labour MP Debbie Abrahams and Tory MP Charlie Dewhirst, who abstained previously, are now against and Labour's Karl Turner, who voted in favour at second reading, is now abstaining.  Mr Turner, a former barrister, told Sky News that an amendment to replace a high court judge with a panel of experts \"weakens the bill\" by removing judicial safeguards. But in a boost for the bill's supporters, Reform UK's Runcorn and Helsby by-election winner Sarah Pochin, a former magistrate, announced she would vote in favour. Her predecessor, Labour's Mike Amesbury, voted against. \"There are enough checks and balances in place within the legislation - with a panel of experts assessing each application to have an assisted death, made up of a senior lawyer, psychiatrist, and social worker,\" said Ms Pochin, who is now the only Reform UK MP supporting the bill. A Labour MP, Jack Abbott, who voted against in November, told Sky News he was now \"more than likely\" to vote for the bill, which was now in a much stronger position, he said. Ms Leadbeater's supporters strongly deny that the bill is at risk of collapse and are accusing its opponents of \"unsubstantiated claims\" and of \"scare stories\" that misrepresent what the bill proposes.  \"There is a pretty transparent attempt by opponents of the bill to try to convince MPs that there's a big shift away from support when that simply isn't true,\" an ally of Ms Leadbeater told Sky News. Speaking in an LBC radio phone-in on the eve of the debate on the amendments, Ms Leadbeater said she understood her bill was \"an emotive issue\" and there was \"a lot of passion about this subject\". But she said: \"I would be prepared to be involved in a compassionate end to someone's life if that was of their choosing. And it's always about choice. I have friends and family who are very clear that they would want this option for themselves. \"There is overwhelming public support for a change in the law and literally everywhere I go people will stop me and say thank you for putting this forward. I would want this choice.\" Read more:Ukrainian man charged over fires at properties and car linked to PMAn embarrassment for Starmer on migrant return hubs? Also ahead of the debate, health minister Stephen Kinnock and justice minister Sarah Sackman wrote to all MPs defending the government's involvement in Ms Leadbeater's amendments to her bill. \"The government remains neutral on the passage of the bill and on the principle of assisted dying, which we have always been clear is a decision for parliament,\" they wrote. \"Government has a responsibility to ensure any legislation that passes through parliament is workable, effective and enforceable. \"As such, we have provided technical, drafting support to enable the sponsor to table amendments throughout the bill's passage. We have advised the sponsor on amendments which we deem essential or highly likely to contribute to the workability of the bill.\""
    },
    {
        "title": "MPs on farming committee call on Rachel Reeves to delay family farm tax",
        "description": "The UK's food security and the future of farming lies in Rachel Reeves' hands, a leading MP has said as a committee called on the government to delay farm inheritance tax changes.",
        "url": "https://news.sky.com/story/mps-on-farming-committee-call-on-rachel-reeves-to-delay-family-farm-tax-13368410",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-inheritance-farmers_6824908.jpg?20250210160709",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-15 14:31:00",
        "Headline": "The chancellor announced at the October budget farms valued at more than £1 million will no longer be able to claim inheritance tax relief from 2026.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The UK's food security and the future of farming lies in Rachel Reeves' hands, a leading MP has said as a committee called on the government to delay farm inheritance tax changes. The environment, food and rural affairs (EFRA) committee has released a report calling on the government to delay the reforms for a year until April 2027. Chancellor Rachel Reeves announced in the October budget farmers would no longer be allowed to claim inheritance tax relief for farms worth more than £1m from April 2026. The move prompted multiple protests in Westminster by farmers who said it will threaten the future of thousands of multi-generational family farms. The EFRA committee, made up of seven Labour MPs and four Lib Dem and Tory MPs, said a pause in the implementation would \"allow for better formulation of tax policy and provide the government with an opportunity to convey a positive long-term vision for farming\". A delay would also protect vulnerable farmers who would have \"more time to seek appropriate professional advice\", the MPs said. The MPs raised concerns the change was announced \"without adequate consultation, impact assessment or affordability assessment\", leaving the impact on farms and food security \"disputed and unclear\". \n                  Farage says 100 Labour MPs will be 'getting scared' and putting pressure on No 10 over protests by farmers\n                 \n                  Farmers in 'catch-22' as investing in environment could push up inheritance tax\n                 \n                  Farmers' inheritance tax could affect five times more farms than Treasury said, analysis finds\n                 They said it risks producing \"unintended consequences\" and threaten to \"affect the most vulnerable\". The MPs have called on the government to consider alternative reforms. Read more:Food prices could rise due to inheritance tax riseTypical family farm 'would have to spend 159% of its profits for a decade to pay' tax Alistair Carmichael, the Lib Dem chair of the committee, told Sky News: \"There is a need for inheritance tax to be reformed. \"The use of land purchase by the super rich as a means of sheltering their wealth is something which is not in the public interest or farmers. \"But this is not the way to go about reform. \"The risk is you see farmers selling out, they will sell out to people who are not going to use land for food production then we risk losing food security - we've seen how foolish relying on exports is after Putin's invasion.\" He added \"as an outsider looking in\", the way in which the Treasury handled the inheritance tax announcement, after Labour said in opposition they would not change it, \"has created a real problem of political authority\" for Environment Secretary Steve Reed. \"It's a problem the Treasury themselves can solve,\" he said. \"Their own backbenchers increasingly think they should solve this and our report today gives them an opportunity to do that if they choose to take it. \"It really is up to the Chancellor of the Exchequer. It is over to her now.\" The committee report says before the autumn budget 70% of farmers felt optimistic about their futures, but that fell to 12% after the budget. The survey, by the Farmers Guardian in March, also found 84% of farmers felt their mental health has been affected by the announcement.  Farmers said the government announcing the closure of applications to this year's sustainable farming incentive with just hours to go, was also a cause. The committee said there are other ways to achieve reform, and called on the government to publish its evaluation and rationale for not following alternative policy measures. They also said the Department for the Environment, Food and Rural Affairs has a pattern of \"poor communication and last-minute decision-making following rumours and departmental leaks\"."
    },
    {
        "title": "Ukrainian man charged over fires at properties and car linked to Sir Keir Starmer",
        "description": "A 21-year-old man has been charged with three counts of arson with intent to endanger life after fires at two properties and a car linked to Prime Minister Sir Keir Starmer.",
        "url": "https://news.sky.com/story/man-charged-with-arson-over-fires-at-properties-and-car-linked-to-sir-keir-starmer-13367129",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-fire-starmer_6915167.jpg?20250513131932",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-15 18:45:00",
        "Headline": "Roman Lavrynovych, 21, a Ukrainian national from Sydenham, southeast London, is due to appear at Westminster Magistrates' Court on Friday, the Metropolitan Police say.",
        "Content": "A 21-year-old man has been charged with three counts of arson with intent to endanger life after fires at two properties and a car linked to Prime Minister Sir Keir Starmer. Roman Lavrynovych, a Ukrainian national from Sydenham, southeast London, is due to appear at Westminster Magistrates' Court on Friday, the Metropolitan Police said. The force said officers from the Met's Counter Terrorism Command led the investigation because of the connections to the prime minister. Emergency services were called to a fire in the early hours of Monday at a house in Kentish Town, north London, where Sir Keir lived with his family before becoming prime minister. Damage was caused to the property's entrance but nobody was hurt. A car was also set alight in the same street last Thursday. There was another blaze at the front door of a house converted into flats in Islington, also linked to the prime minister, on Sunday. One person was taken to safety via an internal staircase by crews wearing breathing apparatus, London Fire Brigade said. The head of the Crown Prosecution Service counter terrorism division, Bethan David, said: \"These charges relate to two fires at residential addresses in Islington on Sunday May 11 and in Kentish Town on Monday May 12, as well as a car fire in Kentish Town on Thursday May 8. \"The Crown Prosecution Service reminds all concerned that criminal proceedings against this defendant are now active and that he has the right to a fair trial.\""
    },
    {
        "title": "Sir Keir Starmer in talks with 'a number of countries' over return hubs for failed asylum seekers",
        "description": "The UK is in talks with \"a number of countries\" about sending failed asylum seekers to return hubs in third countries, Sir Keir Starmer has said.",
        "url": "https://news.sky.com/story/pm-in-talks-with-a-number-of-countries-over-return-hubs-for-failed-asylum-seekers-13368209",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-albania_6916972.jpg?20250515093730",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-05-15 10:10:00",
        "Headline": "The prime minister confirmed a plan to establish return hubs is in the works but would not say what countries he is talking to about hosting them. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  The UK is in talks with \"a number of countries\" about sending failed asylum seekers to return hubs in third countries, Sir Keir Starmer has said. The prime minister confirmed the plan at a press conference alongside his Albanian counterpart Edi Rama, in which the pair announced plans to strengthen cooperation on illegal migration. Politics Live: Britain's economy grew more than expected in first quarter of 2025  Sir Keir described the hubs as a \"really important innovation\" that complements other measures the government is taking to crack down on criminal smuggling gangs. \"We are in talks with a number of countries about return hubs,\" he said. \"At the appropriate time, I'll be able to give you further details in relation to it.\" Sir Keir did not say which countries he is in talks with, but the subject is understood not to be on the agenda for his meetings in Tirana on Thursday.  Mr Rama suggested he is not open to hosting UK detention centres, telling reporters: \"We have been asked by several countries if we were open to it, and we said no, because we are loyal to the marriage with Italy and the rest is just love.\" The Italian scheme was intended to provide offshore processing for migrants, but that plan has been held up by legal action. Following the press conference, Downing Street said the return hubs will target asylum seekers whose applications have been rejected and who are seeking to frustrate their deportation or have lost their paperwork. By removing them to another country, the government hopes to reduce their ability to find other reasons to prevent deportation, such as starting a family. The prime minister's official spokesman said: \"This will basically apply to people who have exhausted all legal routes to remain in the UK but are attempting to stall, using various tactics, whether it's losing their paperwork or using other tactics to frustrate their removal. \"It will ensure that they don't have the chance to make their removal harder by using tactics such as starting a family, et cetera, as we have seen from cases in the past. \"That obviously will reduce the cost to the taxpayer.\" Return hubs are a different concept from the Tories' Rwanda scheme, which Sir Keir scrapped almost immediately after winning the general election. The Rwanda plan involved deporting all people who arrived in the UK by unauthorised means to the east African country, where their asylum claims would be processed for them to settle there, not in Britain. It ultimately failed to get off the ground before the Tories lost the election, despite millions spent, after it was repeatedly challenged in the courts. Return hubs 'a con' Shadow home office minister Chris Philp insisted on Thursday that it would have acted as a deterrent, whereas the return hubs are a \"con on the British public\". He said: \"It's better than nothing but it won't work because most of the people crossing the Channel are of nationalities where they will get their asylum claims granted. \"It's a con on the British public for Keir Starmer to claim these return hubs will have any practical effect.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 Mr Philp also called it a \"slap in the face\" and \"humiliation\" for the prime minister that Albania has already rejected the idea. He said Sir Keir travelled all that way to \"announce a few tweaks\" to a cooperation deal on illegal immigration that was struck by the Conservatives in 2022. Read More:What are return hubs and how will they work? What are Sir Keir Starmer's new immigration rules? Boat crossings pass 12,000 In 2022, arrivals from Albania accounted for around a third of all small boat crossings - a higher number than from any other country. Over the past three years, those numbers have been cut by 95%. The number of Albanians returned to their home country has also more than doubled to 5,294 last year, from just over 2,000 two years earlier. Sir Keir is the first British prime minister to travel to Albania for bilateral talks. Other announcements he is due to make include expanding a programme to detect migrants attempting to travel using fake or stolen documents, with the UK donating new anti-forgery machines. The visit comes in the same week that the number of people crossing the Channel in small boats passed 12,000 for the year. The figure puts 2025 on course to be a record year for crossings - something which will cause unease for Labour as it was elected on a manifesto promise to \"smash the gangs\". The government is under pressure to act tough on immigration amid Reform UK's meteoric rise in the polls. Earlier this week, Sir Keir announced plans to crack down on legal migration, including banning care homes from hiring overseas."
    },
    {
        "title": "An embarrassment for Starmer on migrant return hubs?",
        "description": "Sir Keir Starmer used his first visit to Albania to announce the UK is keen to set up \"return hubs\" to deport migrants.",
        "url": "https://news.sky.com/story/an-embarrassment-for-starmer-on-migrant-return-hubs-13368424",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-rama-tamara_6917515.jpg?20250515174227",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-05-15 14:37:00",
        "Headline": "The Conservatives say the PM's trip to Albania is an embarrassment after the nation said it would not agree to return hubs for failed asylum seekers.",
        "Content": "\n          Political correspondent\n              @tamcohen\n  Sir Keir Starmer used his first visit to Albania to announce the UK is keen to set up \"return hubs\" to deport migrants. Formal discussions are under way, he said, with various countries. We don't know which these are, but we know which aren't keen - rather awkwardly, Albania. Their prime minister, Edi Rama, said he remained \"loyal\" to their \"marriage\" with Italy - relations with other countries are \"simply love\". The Conservatives say the trip is therefore an embarrassment for Sir Keir. His team say this was never on the agenda for this trip, which is about joint policing and intelligence sharing.  Politics latest: 'Moral imperative' to ensure aid gets to civilians in Gaza, say Tories First of all, what are return hubs? Essentially, return hubs are processing centres for people who have exhausted all their options to stay in the UK - including asylum applications, appeals and attempts to claim certain work or study visas. They will be sent back to their home country, and while that happens, they can go to these return hubs - to prevent them absconding. Officials said it would also prevent them starting a family, for example, and using that as part of their claim to stay in the UK. Italy has one already but it's not used Georgia Meloni's government has been keen on these for some time, and has built two in Albania - at the port of Shengjin, and the village of Gjader - big enough for 36,000 people a year. But both, which Sky News visited last year, are currently empty. The courts in Rome say they can't be used until the European Court of Justice rules them safe. A ruling is expected next month. Although, in a boost to the UK government's plans, the UN's refugee agency, has backed the principle of return hubs, if they meet human rights standards.  Is this like the Rwanda plan? Spending millions on housing for migrants that then lies empty may sound familiar- but this is different to the Rwanda plan. Agreed by the Conservatives, Rwanda was scrapped by Sir Keir when Labour won office - he said it was \"unethical, unworkable and extortionate\". The key difference is that under the Rwanda plan, asylum seekers would not be able to claim to stay in the UK - they would be deported and could only apply to stay in Rwanda. This was ruled unlawful by the Supreme Court. Why did Albania say no? The UK hasn't always endeared itself to Albania, with comments by former home secretary Suella Braverman about an \"invasion\" of \"Albanian criminals\" causing anger here. David Cameron cut short a much-anticipated visit, as foreign secretary, to just 89 minutes, when the 2024 general election was called - causing offence. And Mr Rama pointedly talked about the \"stigmatising\" of Albanians living legally in the UK. Read more:Top Tory caught admitting Brexit drawback in leaked clipNHS waiting list increases for first time in seven months Andi Hoxhaj, a Balkan expert at Kings' College London, told me: \"The UK just hasn't put in the work. It's the first visit by a UK prime minister 103 years after diplomatic relations were established. Starmer and Yvette Cooper understand this and want warmer relations. But it was wishful thinking that a return hub would be agreed.\" So who else might have one? The government has been concentrating their efforts to \"smash the gangs\" on the Western Balkans. The joint enforcement in Albania, has - according to the National Crime Agency - been a model which other countries could follow. There are likely to be discussions at the European Political Community summit on Friday with countries such as Serbia, North Macedonia and Montenegro to scope out their interest, and the UK is hosting a Western Balkans summit in London in autumn 2025. So, all is not lost - but there are big legal and logistical hurdles to overcome."
    },
    {
        "title": "Jailed wife of former Tory councillor says she 'never' meant to incite violence ",
        "description": "The wife of a former Tory councillor has said she \"never\" meant to incite violence when she called for hotels to be burned down.",
        "url": "https://news.sky.com/story/jailed-wife-of-former-tory-councillor-says-she-never-meant-to-incite-violence-13368470",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-lucy-connolly-west-midlands-police_6718934.jpg?20241017163706",
        "type": "Politics",
        "Author": "Will Charley",
        "Date Published": "2025-05-15 15:58:00",
        "Headline": "Lucy Connolly is appealing her sentence after she admitted posting an online rant that called for asylum hotels to be burned down.",
        "Content": "\n          Political reporter\n              @WillCharley1\n The wife of a former Tory councillor has said she \"never\" meant to incite violence when she called for hotels to be burned down. Lucy Connolly appeared from HMP Drake Hall in Eccleshall in Staffordshire, where she is currently serving a 31-month sentence for an online rant in which she called asylum seekers \"b******s\". She is challenging the sentence, which she was given last October, at the Court of Appeal after admitting making the post on X. Writing on the day of the Southport attacks, Connolly said: \"Mass deportation now, set fire to all the f****** hotels full of the b******* for all I care... if that makes me racist so be it.\" It followed three girls being stabbed to death at a holiday club in Southport sparking unrest around the country. Connolly told the three judges she never meant to incite violence, and that she later deleted the post. Lord Justice Holroyde, Mr Justice Goss and Mr Justice Sheldon heard that when she initially wrote it on 29 July last year, she was \"really angry, really upset\" and \"distressed that those children had died\". \n                  Southport riots review finds police have not kept up with social media risks\n                 \n                  Man who researched Southport killings jailed for 30 years for attempted murder of nine-year-old girl\n                 \n                  Meta 'too slow' during UK riots to deal with violent posts online, says independent review\n                 She added she knew how the parents felt. Connolly said: \"Those parents still have to live a life of grief. It sends me into a state of anxiety and I worry about my children.\" The court heard Connolly's own child died 14 years ago and that this had caused a resurgence of her anxiety. Connolly's lawyer, Adam King, asked her if she intended for anybody to set asylum hotels on fire or \"murder any politicians\", to which she replied: \"Absolutely not.\" When asked why she deleted the post three-and-a-half hours after putting it up, Connolly responded that she had \"calmed [herself] down\" and that she knew it \"wasn't an acceptable thing to say\". She continued: \"It wasn't the right thing to say, it wasn't what I wanted to happen.\" The court heard Connolly posted an apology on the same platform several days later, where she said she regretted her initial post and realised it was wrong in \"every way\". Connolly did not understand what she pleaded guilty to, court told When asked why she has apologised, Connolly told the court that it was because she was \"really upset\" her husband had been brought into it, and she did not want his name being \"dragged through the mud\". Connolly then told the court that during discussions with her barrister at Birmingham Crown Court, she had not understood that by pleading guilty she was accepting she had intended to incite violence. She said: \"When I wrote that Tweet, there had been no violence, and it was never my intention to cause any.\" Connolly was originally arrested several days later after the stabbings on 6 August, by which time she had deleted her social media account. However, other racists remarks in messages were discovered by officers who seized her phone. The former childminder is married to Raymond Connolly, who was a Conservative Northamptonshire county councillor, but lost his seat in May. He remains on the town council. Speaking outside the Royal Courts of Justice after the hearing, Mr Connolly said: \"Obviously I'm disappointed today. It didn't come to a conclusion and get a result. \"It's 279 days now my daughter's been without her mother. I'm hoping that within a week she'll be home and this will come to a positive conclusion. Can't really say no more than that. \"It's a shame I didn't get a result today but we'll soon know in the next few days. Got to get home now to my daughter.\" The hearing continues and is expected to end on Thursday afternoon."
    },
    {
        "title": "NHS waiting list increases for first time in seven months",
        "description": "The number of appointments for patients waiting for NHS treatments in England increased by nearly 19,000, to 7.42 million in March up from 7.4 million in February. ",
        "url": "https://news.sky.com/story/nhs-waiting-list-increases-for-first-time-in-seven-months-13368251",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nhs-waiting-list-data_6917134.jpg?20250515123625",
        "type": "Politics",
        "Author": "Joely Santa Cruz",
        "Date Published": "2025-05-15 11:25:00",
        "Headline": " An increase in the the number of people waiting for NHS treatments in England is a step backwards after six months of progress. Sky News analysis of NHS data shows the waiting list may continue to rise - unless historic trends of the backlog increasing in summer months can be overcome.",
        "Content": "\n          Data journalist\n              @joelysantacruz\n The number of appointments for patients waiting for NHS treatments in England increased by nearly 19,000, to 7.42 million in March up from 7.4 million in February.  While the increase has not undone all recent progress, the path to reducing the waiting list has been slow and any gains are fragile, as today's figures show. The waiting list had been showing gradual but steady decreases since last September but has now increased for the first time since then. Before COVID, the waiting list was at around 4.5 million appointments, and it peaked at 7.7 million in September 2023. Since then, the waiting list has decreased by around 300,000 from its peak, but remains well above pre-pandemic levels. Professor Sir Stephen Powis, NHS England's National Medical Director, said that the scale of demand on frontline NHS teams is \"enormous\" as they deal with the challenges of the backlog, while also keeping up with hundreds of thousands of new patients that need care:\"In March, we saw a particularly sharp rise in referrals - yet staff still managed to deliver more for patients with 100,000 more treatments delivered… \"It is a good thing that more people are coming forward for care - and I would urge anyone who has health concerns to come forward and get checked out as soon as they can,\" he said. While it's true that more appointments were delivered than in the same month last year, the 1.5 million taken off the waiting list is not a historically high figure and is in fact around 2,000 fewer than in the same month two years ago. Similarly, the 1.8 million new appointments added to the waiting list, while larger than the 1.75 million new appointments a year ago, is fewer than the 1.9 million added in March 2023, and not exceptional compared to other recent comparable months. Rising demand for services is a consistent trend and will continue to be a challenge for the NHS and Keir Starmer's government, who have pledged to bring the waiting list down. There are generally seasonal trends in the waiting list, which does typically tend to decrease over winter and increase into the spring and in to summer. According to NHS England, the reason that the waiting list increases every spring is that more people come forward for treatment after the winter. On average, it's gone up in March by an average of 68,000 treatments, based on the last ten years of data excluding those during COVID - so this year's increase of around 19,000 from February to March is below that average. NHS England say that the extra activity the government has delivered this year could be the reason underlying this smaller increase. It remains to be seen to whether the wait list will continue to increase into the summer as usual, and to what extent the overall impact of this seasonal rush will be mitigated. Commenting on the figures, Health and Social Care Secretary, Wes Streeting said:\"Since day one, we have been clear it will take time to reverse the disastrous waiting list we inherited. But since July, real progress has been made - including over winter. We have overseen a massive increase in appointments available to meet rising demand, reduced long waits and helped people get diagnosed quicker.\" The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done. "
    },
    {
        "title": "The moon's very different sides explained in new NASA study",
        "description": "Scientists have discovered key differences under the moon's surface that may explain why its two hemispheres look so different.",
        "url": "https://news.sky.com/story/the-moons-very-different-sides-explained-in-new-nasa-study-13368471",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-moon-nasa_6917531.jpg?20250515180346",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-15 16:01:00",
        "Headline": "Scientists have long suspected the differences could be explained by what's inside the moon but until now, they couldn't prove it.",
        "Content": "Scientists have discovered key differences under the moon's surface that may explain why its two hemispheres look so different. The moon's near side, the side visible to Earth, is dark and covered in the remnants of ancient lava flows. Its far side, which we can't see from Earth, is rugged and rocky. Scientists have long suspected the differences could be explained by what's inside the moon but until now, couldn't prove it. \"We found that the moon's near side is flexing more than the far side, meaning there's something fundamentally different about the internal structure of the moon's near side compared to its far side,\" said Ryan Park, who led the team from NASA's Jet Propulsion Laboratory. \"When we first analysed the data, we were so surprised by the result we didn't believe it. So we ran the calculations many times to verify the findings. \"In all, this is a decade of work.\" \n                  Half-tonne piece of Soviet rocket may have crashed through atmosphere over south of England\n                 \n                  First moon rocks on Earth in half a century arrive in UK\n                 \n                  Half-tonne piece of Soviet rocket due to crash back down to Earth\n                 The team studied data gathered by the Gravity Recovery and Interior Laboratory (GRAIL) mission. Read more from climate, science and technology:M&S says customers' personal data taken by hackersAIs can make collective decisions and influence each otherWarning of heat impact on pregnant women and newborns For that mission, two spacecraft, Ebb and Flow, were sent to orbit the moon for a year between 2011 and 2012. They used that data to map how the moon responds to Earth's gravitational pull as it orbits. The moon's gravity slightly fluctuates as it circles the Earth which causes it to flex. That movement helped the scientists to understand the moon's deep internal structure and discovered that the moon's near side is internally warmer than its far side. Although this helps with crucial understanding of the moon, it may also help us understand other planets. In fact, the team have already used their technique to map the internal structures of planets like Jupiter and the Vesta asteroid. \"There are many opportunities in the future to apply our technique for studying the interiors of intriguing planetary bodies throughout the solar system,\" said Mr Park."
    },
    {
        "title": "Thousands of UK companies 'could have M&S-style hackers waiting in their systems'",
        "description": "Tens of thousands of British businesses could have hackers waiting inside their systems - all because of a change in the business model of hacking.",
        "url": "https://news.sky.com/story/thousands-of-uk-companies-could-have-ms-style-hackers-waiting-in-their-systems-13368239",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-hacker-online-silhouette_6900898.jpg?20250429161837",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-05-15 12:14:00",
        "Headline": "\"They're sitting in your network, waiting to the point where they can attack,\" a cybersecurity expert tells Sky News.",
        "Content": "\n          Science and Technology reporter\n       Tens of thousands of British businesses could have hackers waiting inside their systems - all because of a change in the business model of hacking. Luxury fashion brand Dior is the latest retailer to announce that some of its customer data has been stolen by attackers, and M&S is still suffering the effects of an attack that started in April. On Tuesday, the British retailer revealed customer data had been stolen, although \"usable\" payment details and passwords were not taken. Online shopping remains unavailable at M&S and recruitment has been paused while the company tries to get the effects of the attack under control. Co-op appears to have narrowly avoided a full-blown crisis by spotting criminals in its network and shutting down its operations, and Harrods also revealed it recently fended off hackers trying to exploit its systems. Although the attacks have not been connected by investigators, the increasing number of high-profile incidents could be down to a change in the hacking market, according to Dr Harjinder Lallie. \"It's just frightening,\" said Dr Lallie, a university reader in cybersecurity at the University of Warwick, to Sky News. \n                  Co-op updates on recovery after cyber attack forced empty shelves\n                 \n                  'China-based' hack targets UK companies in 'critical national security threat', says analyst\n                 \n                  What should M&S customers do after criminals stole personal data in huge attack?\n                 \"I've been in cybersecurity for 26 years - I've never known a time like this.\" The criminals behind DragonForce, a powerful suite of tools that hold companies hostage until they pay a ransom, recently changed their business model. \"They moved to a model which we refer to as 'ransomware-as-a-service'. \"If I'm Dragon Force, I'll say to you: 'You can use my very, very powerful tools to conduct the attack, and you can keep 80% of everything you collect, as long as I get 20% of it.'\" explained Dr Lallie. That means wannabe-hackers \"no longer need the technical know-how\" to launch an attack, he said.  Instead, they can just buy the software on dark-web forums that operate like any online marketplace, complete with vendor ratings. Evidence of the DragonForce ransomware has reportedly been found in the M&S attack already. Read more from climate, science and technology:M&S says customers' personal data taken by hackersAIs can make collective decisions and influence each otherWarning of heat impact on pregnant women and newborns In attacks like M&S's, criminals enter a business's networks, usually after tricking someone into letting them in, and then spend some time learning everything they can, including potential vulnerabilities and how the network is configured. \"Tens of thousands of businesses up and down the UK probably have hackers inside their network already and just don't know about it, I'm afraid,\" said Dr Lallie. \"I don't want to scaremonger, but that is how it is working. They're sitting in your network, waiting to the point where they can attack.\" Adding to the problem is artificial intelligence, said Professor Manos Panaousis, professor of cybersecurity at the University of Greenwich. \"Most of cybersecurity attacks are social engineering attacks,\" he said. Social engineering attacks are when a criminal tricks a user into letting them into systems. \"With the use of generative AI, social engineering gets better.\" \"If you put ransomware-as-a-service and generative AI together, they lower the barrier to the barrier to entry [...] and you get more sophisticated attacks.\""
    },
    {
        "title": "Scots urged to take shorter showers and avoid using hoses after 'driest period in 60 years'",
        "description": "Scots are being urged to take shorter showers and avoid using hoses after the driest start to the year since 1964.",
        "url": "https://news.sky.com/story/scots-urged-to-take-shorter-showers-and-avoid-using-hoses-after-driest-period-in-60-years-13368200",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-hose-water-waterhose_6917152.jpg?20250515125312",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-15 10:01:00",
        "Headline": "Scottish Water said it has been the driest start to the year since 1964.",
        "Content": "Scots are being urged to take shorter showers and avoid using hoses after the driest start to the year since 1964. Scottish Water is appealing for residents north of the border to use supplies sparingly amid an increase in consumption over the past few weeks. The firm stopped short of calling for a full hosepipe ban, which was last implemented in Scotland in 1995. It comes as temperatures in parts of the nation rose above 25C on Tuesday, making it the hottest day of the year so far. Scottish Water said it has pumped an extra 150 million litres a day into the network across the country since mid-April. Scots are said to be using an average of 178 litres of water per person per day - higher than in England and Wales where it is estimated to be an average of 137 litres. Average reservoir levels across Scotland are said to be at 81%, which is 10% lower than normal for this time of year. Alex Plant, chief executive of Scottish Water, said: \"We're working hard to maintain normal supplies for all customers and would ask that they use water efficiently to protect this precious resource. \"We believe that a large part of the additional water use at the moment is in gardens so we would ask that customers are mindful of how much water they use there.\" Read more:Will there be a hosepipe ban in the UK?Check the latest weather forecast here Scottish Water said it has been the driest start to the year since 1964, with only 59% of long-term average rainfall between January and April. Rainfall this month has so far been even lower across most of the country, with little more expected until at least 22 May. With forecasts of more dry and warm weather to come, Scottish Water has issued guidance to ensure its supply systems can cope with demand. Top tips for water use in homes and gardens: • Take shorter showers• Turn the tap off when brushing teeth• Use washing machines and dishwashers only when fully loaded• Use a watering can instead of a garden hose and avoid using sprinklers• Use a bucket and sponge rather than a hose to wash any vehicles Scottish Water said tankers have been mobilised to supplement normal water supplies in some parts of the country, including Gullane and Aberlady in East Lothian; areas north of Aberdeen such as Potterton, Middleton Park, and Belhelvie; Maybole, Turnberry and Maidens in South Ayrshire; Kippen and Balfron in west Stirlingshire; and the Strathpeffer area in Ross-shire. In Moray, borehole supplies from the River Spey are being boosted by pumping water directly from the river to maintain normal levels. Mr Plant added: \"Scotland's climate is clearly changing and, as a country, we need to ensure we adapt both by investing appropriately in water infrastructure - which Scottish Water is doing - and ensuring we do what we can to use water more efficiently in our homes and businesses. \"Water is always worth saving and by taking simple steps to reduce the volume used around the home and garden we can make our country's water go even further and help maintain normal supplies.\""
    },
    {
        "title": "US singer Chris Brown charged with GBH over alleged attack in London",
        "description": "US singer Chris Brown has been charged with grievous bodily harm with intent in connection with a 2023 incident in London.",
        "url": "https://news.sky.com/story/us-singer-chris-brown-charged-with-gbh-13368710",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-chris-brown_6917859.jpg?20250516000703",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-15 22:36:00",
        "Headline": "The 36-year-old was arrested at a hotel in Manchester in the early hours of Thursday by detectives from the Metropolitan Police.",
        "Content": "US singer Chris Brown has been charged with grievous bodily harm with intent in connection with a 2023 incident in London. He remains in custody and is due to appear at Manchester Magistrates' Court at 10am this morning, police said. The charge relates to an assault which reportedly took place at a venue in Hanover Square in Mayfair on Sunday 19 February 2023. The 36-year-old was arrested at a hotel in Manchester in the early hours of Thursday by detectives from the Metropolitan Police. The Sun has reported that the R&B singer flew into Manchester Airport on a private jet on Wednesday afternoon. Adele Kelly, the deputy chief crown prosecutor for CPS London North, said: \"We have authorised the Metropolitan Police to charge Chris Brown with one count of grievous bodily harm, contrary to section 18 of the Offences Against the Person Act 1861. \"The alleged incident occurred in London on 19 February 2023. \n                  Cassie challenged over Diddy 'freak off' allegations - as explicit messages read in court\n                 \n                  Smokey Robinson under criminal investigation over rape and sexual assault allegations\n                 \n                  Gary Lineker apologises for 'Zionism' re-post featuring image of rat\n                 \"He will have his first court appearance on Friday 16 May at Manchester Magistrates' Court. Read more from Sky News:Ukrainian charged over fires at homes linked to StarmerKing 'flabbergasted' by magician's money trickSiblings jailed over 'truly sickening' murder  \"The Crown Prosecution Service reminds all concerned that criminal proceedings against this defendant are active and that he has the right to a fair trial. \"It is extremely important that there should be no reporting, commentary or sharing of information online which could in any way prejudice these proceedings.\" The Go Crazy singer is set to tour the UK in June and July, with dates at Co-Op Live in Manchester and Principality Stadium in Cardiff. His representatives have been contacted for comment."
    },
    {
        "title": "Cassie challenged over Diddy 'freak off' allegations - as explicit messages read in court",
        "description": "Sexually explicit messages between RnB singer Cassie and her former boyfriend Sean \"Diddy\" Combs have been read in court, with some showing her expressing apparent enthusiasm about the \"freak off\" sex sessions with escorts she alleges she was forced into.",
        "url": "https://news.sky.com/story/cassie-challenged-over-diddy-freak-off-allegations-as-explicit-messages-read-in-court-13368701",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sean-combs-cassie-casandra-ventura_6917823.jpg?20250515230712",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-15 21:55:00",
        "Headline": "During the fourth day of the Sean \"Diddy\" Combs sex-trafficking trial in Manhattan, New York, defence lawyers pushed back on allegations of abuse by Cassie, focusing on texts and emails that were both romantic and sexually explicit at times.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Sexually explicit messages between RnB singer Cassie and her former boyfriend Sean \"Diddy\" Combs have been read in court, with some showing her expressing apparent enthusiasm about the \"freak off\" sex sessions with escorts she alleges she was forced into. The 38-year-old, whose full name is Casandra Ventura, faced a full day of cross-examination from the hip-hop mogul's defence lawyers, who are attempting to convince the jury she consented to a \"swingers lifestyle\". Combs, 55, has pleaded not guilty to charges of sex trafficking, racketeering conspiracy and transportation to engage in prostitution, in relation to Ms Ventura and other women. His lawyers have conceded he could be violent, but say nothing he did amounted to crimes of this nature. Ms Ventura alleges she was physically abused and degraded for years by the powerful hip-hop star and music executive, accusing him of violence, coercion, blackmail and rape. Prosecutors say he exploited and used his network of employees to facilitate illegal activities, which is a key part of the racketeering charge. Sean 'Diddy' Combs trial: Day 4 - As it happened But during the fourth day of the trial in Manhattan, New York, defence lawyers pushed back, focusing on texts and emails that were both romantic and sexually explicit. \"I'm always ready to freak off,\" the court heard Ms Ventura wrote in one message in August 2009. In another she told him, about a freak off: \"Can't wait.\" And in another, jurors were told, she described a video of one sex session with an escort as \"dope\". The pair were together, on and off, for about 11 years from 2007 to 2018. Combs, whose mother Janice has been in court all week to support him, along with some of his children, appeared relaxed as the messages were read aloud for jurors. Messages from 4 March 2016 - the day before an incident at the InterContinental Hotel in Century City, Los Angeles, in which Combs was filmed on CCTV seeming to attack Ms Ventura in a hallway, as he was wearing just a towel and socks - were also read in court. Footage from this incident, which was first made public in May 2024, has been a key piece of evidence during the trial. Ms Ventura has told the court it happened as she tried to leave a freak off session after being hit by Combs. Freak off 'felt dirty, grimy' During cross-examination, the court heard Ms Ventura sent a sexually explicit message the day before this. She also sent him a message saying, \"Baby I want to FO so bad but I dont want to f*** myself up\". Ms Ventura has told the court this was damage limitation and that she wanted to keep him happy, as she had a film premiere coming up a few days later. Jurors also heard details of an email she sent in 2009, in which she expressed conflicting feelings about taking part in these sex sessions with escorts. In the email, she told Combs she needed to trust him \"beyond it just being sexual\" - that in order to be more open sexually, \"I need to feel safe, like home\". She told him \"the last time was a mistake but since has made me feel a little dirty, and grimy as opposed to sexual and spontaneous\". This was the reason she was going \"back and forth in my mind with wanting and not wanting to do it\", she wrote. At first, when they were \"so in love... there were no questions asked, it felt right\". She told him: \"I get nervous that I'm just becoming the girlfriend that you get your fantasies off with.\" Ms Ventura has told the court that she fell in love with Combs very quickly when they got together, when she was 21 and he was 37. She has said she wanted to please him, but became fearful of him. At one point during cross-examination, she raised that she felt jurors were not hearing the full context of some of the messages being highlighted, saying: \"There's a lot we skipped over.\" Combs's lawyers are painting his sexual preferences as part of a \"swingers\" lifestyle that has been mentioned previously at trial, saying people might not agree with it but it does not make him guilty of sex trafficking. Questioned on this, Ms Ventura said they were \"very different\". She was also asked about drug use, her own and Combs's, and at one point told the court she believed he was addicted to opiates when they were together. She also said he was taken to hospital after overdosing on opiates at the Playboy Mansion in 2012 - something which was reported on by outlets including TMZ at the time, when it was said he had suffered a migraine.  Judge frustrated with Diddy's lawyers Away from the questioning, a notable moment in court came when Judge Arun Subramanian became frustrated with Diddy's lawyers over how long they will spend cross-examining Ms Ventura. He told them they should get a day and a half - the same time the prosecution had. \"In what universe did you not understand this is what was going to happen?\" he told them. The judge is keen to keep the trial on time and particularly Ms Ventura's evidence, as she is eight months pregnant with her third child with husband Alex Fine, who has been supporting her in court. Read more:The rise and fall of DiddyDiddy - a timeline of allegationsEverything you need to know about the trial She has now spent almost three days on the witness stand - tomorrow will be her fourth - and became emotional towards the end of her testimony on her second day. The criminal case against Combs comes after Ms Ventura sued him in 2023, accusing him of years of physical and sexual abuse. The suit was settled in 24 hours, for a figure that was undisclosed at the time. Ms Ventura has confirmed during the trial that this was $20m (about £15m). Combs, 55, has been jailed since September, and faces at least 15 years or possibly life in prison if convicted."
    },
    {
        "title": "Smokey Robinson under criminal investigation over rape and sexual assault allegations",
        "description": "Motown legend Smokey Robinson is under criminal investigation after four former housekeepers accused him of rape and sexual assault, the Los Angeles County Sheriff's Department said.",
        "url": "https://news.sky.com/story/smokey-robinson-under-criminal-investigation-over-rape-and-sexual-assault-allegations-13368724",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-smokey-robinson-new-york_6908686.jpg?20250507081924",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-15 23:40:00",
        "Headline": "The investigation comes just over a week after four former housekeepers filed a lawsuit seeking $50m (£37m) in damages over the alleged assaults.",
        "Content": "Motown legend Smokey Robinson is under criminal investigation after four former housekeepers accused him of rape and sexual assault, the Los Angeles County Sheriff's Department said. The investigation comes just over a week after the housekeepers filed a lawsuit seeking $50m (£37m) in damages in a civil case over the alleged assaults - which the women say took place between 2007 and 2024. The Los Angeles County Sheriff's Department said in a statement on Thursday that its special victims bureau is now \"actively investigating criminal allegations\" against the 85-year-old. It added that the investigation is in its early stages and that no other details will be provided. The four former housekeepers alleged in their civil lawsuit that the singer, whose real name is William Robinson Jr, carried out the rapes and sexual assaults while they worked for him. The claim further states that Robinson's wife, Frances Robinson, enabled his behaviour. It also says she was responsible for creating a hostile work environment and shouted at them and used ethnic insults. \n                  US singer Chris Brown charged with GBH over alleged attack in London\n                 \n                  Cassie challenged over Diddy 'freak off' allegations - as explicit messages read in court\n                 \n                  Gary Lineker apologises for 'Zionism' re-post featuring image of rat\n                 The Motown singer's lawyer Christopher Frost has said he welcomes the criminal investigation and feels \"confident that a determination will be made that Mr. Robinson did nothing wrong, and that this is a desperate attempt to prejudice public opinion and make even more of a media circus than the plaintiffs were previously able to create\", Sky's US partner network NBC News reports. \"The record will ultimately demonstrate that this is nothing more than a manufactured lawsuit intended to tarnish the good names of Smokey and Frances Robinson for no other reason than unadulterated avarice,\" Mr Frost added. Following the filing of the civil lawsuit, Mr Frost called the allegations \"vile\" and \"false \" and said the women's claims were \"simply an ugly method of trying to extract money from an 85-year-old American icon\". Read more from Sky News:US singer Chris Brown charged over alleged London attackCassie challenged over Diddy 'freak off' accusations John Harris and Herbert Hayden, the lawyers for the women, say they are pleased to learn that law enforcement is looking into the allegations against the singer. \"Our clients intend to fully co-operate with LASD's (Los Angeles County Sheriff's Department) ongoing investigation in the pursuit of seeking justice for themselves and others that may have been similarly assaulted by him,\" the lawyers said. Robinson, a member of both the Rock & Roll Hall of Fame and the Songwriters Hall of Fame, was among the biggest hitmakers of the 1960s - both with his group The Miracles and as a solo artist, with songs including The Tears Of A Clown and The Tracks Of My Tears. He was a central part of the Motown Records music machine in his hometown of Detroit as an artist, producer and songwriter for other artists."
    },
    {
        "title": "Magna Carta 'copy' miscatalogued in 1940s found to be original",
        "description": "An issue of the Magna Carta, which was wrongly catalogued as a copy in the 1940s, has been identified as original.",
        "url": "https://news.sky.com/story/magna-carta-copy-miscatalogued-in-1940s-found-to-be-original-13368078",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-magna-carta-harvard-law_6916885.jpg?20250515073631",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-05-15 06:27:00",
        "Headline": "Harvard Law School Library bought what it thought was a stained and faded copy of the document from London book dealers Sweet & Maxwell in 1946 for 27 dollars and 50 cents.",
        "Content": "An issue of the Magna Carta, which was wrongly catalogued as a copy in the 1940s, has been identified as original. Harvard Law School Library bought what it thought was a stained and faded copy of the document from London book dealers Sweet & Maxwell in 1946 for 27 dollars and 50 cents. The book dealers had acquired it at a Sotheby's auction a month earlier from a First World War pilot for £42. It was wrongly dated as being made in 1327 under King Edward III. But two researchers have now found that the \"copy\" is a rare original from 1300 issued by King Edward I and is worth millions of dollars, although Harvard does not intend to sell it. David Carpenter, a professor of medieval history at King's College London, was studying online copies of the Magna Carta in December 2023 when he realised the version he was looking at on Harvard's website might be an original. A detailed comparison of text and other tests were carried out on the Harvard document, which confirmed that the \"copy\" was an original issue of the Magna Carta. The Magna Carta was originally established in 1215 under King John and outlined the rights of ordinary people under common law for the first time. \n                  Thousands of Ukrainian civilians lost in hellish archipelago of Russian jails\n                 \n                  US 'doesn't have high expectations' for Ukraine-Russia negotiations, Marco Rubio admits\n                 \n                  Hamas confirms direct peace talks with US - as it calls on Trump to 'pressure' Israel\n                 It has since formed the basis of constitutions worldwide. There are four copies of the 1215 issue and seven of the 1300 version, including Harvard's original. One version sold at auction in 2007 fetched more than $21.3m (£10m at the time) at Sotheby's in New York. \"My reaction was one of amazement and, in a way, awe that I should have managed to find a previously unknown Magna Carta,\" Mr Carpenter said about the \"fantastic discovery\". He said he was also astonished \"that Harvard had been sitting on it for all these years without realising what it was\". Mr Carpenter continued: \"Harvard's Magna Carta deserves celebration, not as some mere copy, stained and faded, but as an original of one of the most significant documents in world constitutional history, a cornerstone of freedoms past, present and yet to be won.\" Read more from Sky News:Iran 'ready to make nuclear concessions'Dozens killed in strikes on Gaza He teamed up with Nicholas Vincent, professor of medieval history at the University of East Anglia, to confirm the authenticity of the Harvard document. Mr Vincent said Harvard's Magna Carta is the 25th known surviving original: \"The 1300 issue is the last time it was issued as a single sheet document under the king's seal as an official endorsement of the settlement of Magna Carta.\""
    }
]