[
    {
        "title": "Epstein files: Police reviewing misconduct claims after Mandelson accused of leaking sensitive information",
        "description": "Sir Keir Starmer is set to chair a cabinet meeting today as police assess allegations his former US ambassador Lord Mandelson leaked sensitive information from the heart of government to Jeffrey Epstein.",
        "url": "https://news.sky.com/story/starmer-believes-mandelson-should-not-be-a-member-of-the-lords-says-no-10-13502252",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-mandelson-epstein_7153944.jpg?20260203012419",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-02 10:45:00",
        "Headline": "Following fresh revelations about the former business secretary's relationship with the paedophile financier, Downing Street is facing calls to strip him of his peerage.",
        "Content": "Sir Keir Starmer is set to chair a cabinet meeting today as police assess allegations his former US ambassador Lord Mandelson leaked sensitive information from the heart of government to Jeffrey Epstein. The Met are investigating allegations of misconduct in public office after emails appeared to show conversations between the ex-cabinet minister and paedophile financier about political matters, while the former was serving as business secretary in Gordon Brown's government back in 2009. Ella Marriott, commander of the Met, said: \"The reports will all be reviewed to determine if they meet the criminal threshold for investigation.\" Tap here for the latest on the Epstein files The messages were revealed as part of the latest tranche of Epstein files released by the US Justice Department. Sir Keir, who sacked Mandelson as the government's Washington ambassador last year over his ties to the billionaire, has called on Lord Mandelson to quit the House of Lords and testify to an inquiry by the US Congress. The prime minister has suggested Andrew Mountbatten-Windsor should also give evidence. Late last night, it was announced Bill and Hillary Clinton had agreed to testify. They hope doing so will set \"a precedent that applies to everyone\", the former president's deputy chief of staff said. Being named in the Epstein files is not a sign of wrongdoing, and Lord Mandelson, Mr Mountbatten-Windsor and the Clintons have all expressed regret about their past ties to the paedophile. Lord Mandelson has not responded to the latest allegations. However, in an interview with The Times carried out last week but published on Monday, he referred to a \"handful of misguided historical emails, which I deeply regret sending\", and described Epstein as \"muck that you can't get off your shoe\". What are the latest Mandelson claims? In the latest tranche of Epstein files released by the US Justice Department, emails appear to show Lord Mandelson giving Epstein advance notice of a €500bn EU bank bailout in 2010. Mandelson was emailed by Epstein, who wrote: \"Sources tell me 500 b euro bailout , almost complete (sic).\" He then appears to reply: \"Sd be announced tonight\". Epstein then asks if he is home, to which Mandleson replies: \"Just leaving No10... will call\". The €500bn deal was approved the next day by European governments as they tried to pull the currency through the 2010 \"Eurozone\" crisis - where countries such as Greece, Portugal, Ireland, and Cyprus were unable to repay or refinance their government debt. The UK did not contribute to the bailout. However, the then chancellor Alistair Darling was present in Brussels for the negotiations. Read more on this story:Sarah Ferguson's charity to close Other emails appear to show Lord Mandelson telling Epstein he was \"trying hard\" to change government policy on bankers' bonuses at his request, months after the convicted sex trafficker had paid tens of thousands of pounds to the peer's husband. The emails came at the time the so-called \"super tax\" was being introduced by Mr Darling to clamp down on bank profits being used to pay large bonuses for bankers after the financial crisis. One discussion indicates Lord Mandelson encouraged JP Morgan's boss Jamie Dimon to call Mr Darling and \"mildly threaten\" him. Separately, the peer also appeared to write to Epstein in June 2009 about an \"interesting note that's gone to the PM\", forwarding an assessment by Mr Brown's adviser Nick Butler of potential policy measures including an \"asset sales plan\". Mr Brown condemned the \"wholly unacceptable disclosure of government papers and information during the period when the country was battling the global financial crisis\", and said he had asked the Cabinet Office to investigate. Pressure over peerage Sir Keir Starmer has asked Cabinet Secretary Sir Chris Wormald - the UK's most senior civil servant - to \"urgently\" review all available information on contact between Lord Mandelson and Epstein. The prime minister's spokesperson also said Sir Keir believed Lord Mandelson \"should not be a member of the House of Lords or use the title\". However, the government does not have the power to strip him of his peerage, and wants to work with the Lords to modernise disciplinary procedures to make it easier to remove disgraced peers. The latest revelations about Peter Mandelson's relationship with paedophile financier Jeffrey Epstein have led to calls for his peerage to be stripped. But is it possible for a life peerage to be removed? The short answer is yes - but it is not a simple process. A peerage is created by letters patent, which is a legal document issued by the monarch that is used to show their approval of state documents. Halsbury's Laws of England, which is an encyclopaedia of the law in England and Wales, explains that once a peerage is created, the monarch does not have the power to cancel it. Currently, the only way to remove a peerage entirely is through legislation that becomes an Act of Parliament - and it has previously been done. In 1917, legislation entitled the Titles Deprivation Act 1917 was passed to strip peerages from \"enemies\" of the UK during the First World War. It removed them from anyone who had \"during the present war, borne arms against His Majesty or His Allies, or who [had] adhered to His Majesty’s enemies\". The legislation meant that any peer suspected of assisting an enemy could be investigated by a committee of the Privy Council, and a report would be produced. If no one objected to the report within 40 days, the peerage would be stripped - and there are four people recorded to have lost their titles as a result of the process. While that law remains in force, it referred specifically to the First World War, and therefore it is highly unlikely it could apply today. So while Sir Keir Starmer's government has previously said that an \"act of parliament is required to remove a peerage once conferred\", it would seem to be quite a lengthy process, and in the case of Lord Mandelson, the prime minister would like it to happen quickly. The government is calling on the House of Lords to work with them to \"modernise\" the process for removing peers. Could Mandelson give up his peerage voluntarily? No - a peerage cannot be given up once accepted. But he could resign from the House of Lords - meaning he would not be able to sit on its red benches, vote, or participate in any parliamentary business - and decide not to use his title, which appears to be No 10's preferred option. Darren Jones, chief secretary to the prime minister, said the government was writing to the appropriate authorities to start the process. Sky News has approached representatives for Lord Mandelson for comment on the leaking of sensitive information claims. In a statement about previous allegations, he said: \"I was wrong to believe Epstein following his conviction, and to continue my association with him afterwards. I apologise unequivocally for doing so to the women and girls who suffered.\" What else have the files revealed?  Lord Mandelson was sacked as the ambassador to Washington last year after details emerged of his continued contact with the financier after Epstein's guilty plea in 2008 to soliciting prostitution and soliciting a minor. In files released over the weekend, bank statements from 2003 and 2004 appeared to show Lord Mandelson received payments totalling $75,000 (£54,000) from the financier, while he was the MP for Hartlepool. Epstein is also said to have paid for an osteopathy course for Lord Mandelson's husband in 2009. Lord Mandelson resigned his membership of the Labour Party on Sunday night. He denied any record or recollection of the payments, but said he did \"not wish to cause further embarrassment to the Labour Party\". The New Labour grandee has also appeared in a picture found in the files wearing only his underwear and a t-shirt, which Sky News has confirmed was taken in Epstein's Paris flat. A spokesperson for Lord Mandelson previously told Sky News: \"No one can say who or where the photo was taken. Lord Mandelson has absolutely no idea or indeed whether it has any connection to Epstein at all.\""
    },
    {
        "title": "Sarah Ferguson's charity to close after Epstein revelations",
        "description": "Sarah Ferguson's charity has announced it will close \"for the foreseeable future\" \nfollowing fresh revelations about the former duchess's relationship with paedophile financier Jeffrey Epstein.",
        "url": "https://news.sky.com/story/sarah-fergusons-charity-to-close-after-epstein-revelations-13502540",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sarah-ferguson-andrew_7150876.jpg?20260130224512",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-02 22:39:00",
        "Headline": "A spokesperson for Sarah's Trust said the closure \"has been under discussion and in train for some months\". It comes after more emails to Jeffrey Epstein from accounts believed to be the former duchess emerged.",
        "Content": "Sarah Ferguson's charity has announced it will close \"for the foreseeable future\" \nfollowing fresh revelations about the former duchess's relationship with paedophile financier Jeffrey Epstein. A spokesman for Sarah's Trust said: \"Our chair Sarah Ferguson and the board of trustees have agreed that with regret the charity will shortly close for the foreseeable future.\" \"This has been under discussion and in train for some months,\" they added. Epstein files: Catch up on the latest developments The spokesman said \"we remain extremely proud of the work of the trust over recent years\", including delivering aid during the pandemic and to those impacted by the war in Ukraine. It comes as the release of more of the Epstein files last Friday revealed further the extent of the former duchess's relationship with the deceased billionaire. More emails to Epstein from a sender believed to be Ms Ferguson emerged on Monday - including two from 2010. 'I am at your service. Just marry me.' On the evening of 30 January 2010, an account called \"Sarah\" told Epstein he was a \"legend\" and added: \"I really don't have the words to describe, my love, gratitude for your generosity and kindness. \"I am at your service. Just marry me.\" Sky News believes the sender was the former duchess. There is no indication as to what the email was in response to, or any further context around the message. In another email in September 2010, a user called \"Ferg\" - which Sky News also believes to be Ms Ferguson - asked Epstein when he was going to \"employ\" her. The financier, who was found dead in a New York jail cell in 2019 while awaiting trial on sex trafficking charges, replies that he will visit London in the coming weeks to \"talk about it\", adding: \"I have never let you down.\" \"Ferg\" responds: \"Nor I you.. And bever [sic] will. My friendship is steadfast to the end, even after the body is cold .. Love you now and always.. And I know you do tooo ..\" Read more:Mandelson accused of leaking informationNew Andrew allegation 'must be investigated' In a 2011 interview, Ms Ferguson said: \"I would never have anything to do with Jeffrey Epstein ever again. I abhor paedophilia and any sexual abuse of children. It was a gigantic error of judgment.\" That came three years after Epstein's guilty plea in 2008 to soliciting prostitution, including with a minor. Being named in the Epstein files is not a sign of wrongdoing."
    },
    {
        "title": "Son of Norway's crown princess arrested ahead of rape trial on new allegations of assault and wielding a knife",
        "description": "The eldest son of Norway's crown princess has been arrested over new criminal allegations ahead of a trial on charges including rape.",
        "url": "https://news.sky.com/story/son-of-norways-crown-princess-arrested-ahead-of-rape-trial-on-new-allegations-of-assault-and-wielding-a-knife-13502454",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-marius-borg-hoiby-norway_6751735.jpg?20250818164819",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-02 19:16:00",
        "Headline": "Marius Borg Hoiby, awaiting trial in Oslo on 38 charges, was detained on Sunday.",
        "Content": "The eldest son of Norway's crown princess has been arrested over new criminal allegations ahead of a trial on charges including rape. Marius Borg Hoiby, 29, the son of Crown Princess Mette-Marit, was detained on Sunday on suspicion of causing bodily harm, wielding a knife and violating a restraining order. Following the latest accusations, police said that they would seek permission from a judge to keep Hoiby in their custody for the next four weeks. Hoiby, the stepson of Crown Prince Haakon, was free but awaiting trial on four counts of rape, as well as domestic violence, assault and drug possession, among other crimes. He could face charges from the latest allegations on top of the 38 counts he already faces. They include rape, abuse in a close relationship against one former partner, acts of violence against another and transporting 3.5kg (7.7lbs) of cannabis, as well as making death threats and traffic violations. His lawyer has declined to comment on the new accusations. Hoiby does not admit criminal guilt for the charges of rape and domestic violence, but has admitted to some lesser crimes, and plans to give a detailed explanation in court, his lawyer previously said. His trial is due to last until 19 March. Read more from Sky News:Infantino sorry for 'joke' - and insists Trump deserved peace prizeCaptain found guilty of killing crew member in US tanker collision Hoiby has been under scrutiny since 2024, when police named him as a suspect of physical assault against a woman with whom he had been in a relationship. In a statement to the media at the time, Hoiby admitted to causing bodily harm to the woman while he was under the influence of cocaine and alcohol, and to damaging her apartment, saying he regretted his acts. Hoiby is the son of Crown Princess Mette-Marit from a previous relationship, and the stepson of the heir to the Norwegian throne, Crown Prince Haakon. He is outside the line of royal succession, and has no title. Last week, the crown prince said the royal house does not intend to comment during the proceedings. The trial is opening just as Hoiby's mother faces renewed scrutiny over her contacts with Jeffrey Epstein following the latest release of documents in the US."
    },
    {
        "title": "'Harvey deserved better': Family say school missed opportunities to protect murdered schoolboy",
        "description": "The family of Harvey Willgoose say the schoolboy \"would still be alive\" if his school hadn't missed \"many opportunities\" to protect him. &#160;",
        "url": "https://news.sky.com/story/harvey-deserved-better-family-say-school-missed-opportunities-to-protect-murdered-schoolboy-13502493",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-harvey-willgoose-funeral_6835649.jpg?20250806204348",
        "type": "Home",
        "Author": "Katerina Vittozzi",
        "Date Published": "2026-02-02 20:47:00",
        "Headline": "An independent review, commissioned by the school itself, has revealed several failures in the months leading up to Harvey Willgoose's murder.",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n The family of Harvey Willgoose say the schoolboy \"would still be alive\" if his school hadn't missed \"many opportunities\" to protect him.   Harvey, 15, was stabbed outside the canteen at All Saints Catholic High School in Sheffield last year by a fellow pupil. On the one-year anniversary of their son's death, Mark and Caroline Willgoose say they have been \"devastated\" by a new report into \"chances missed\" by Harvey's school to assess the risk his killer posed. Mohammed Umar Khan, also 15 at the time of the attack, had brought a 13cm hunting knife into school on the day he fatally stabbed Harvey. He was sentenced to life with a minimum of 16 years in prison following a trial at Sheffield Crown Court. 'Harvey deserved better' But an independent review, commissioned by the school itself, revealed school failures in the months leading up to Harvey's murder, including: Speaking at a news conference in Sheffield, Harvey's mother Caroline Willgoose said: \"Reading the findings of this report has been devastating. \"To see in black and white the chances there were to step in, the signs that were missed and how many opportunities there were to protect my boy is something I'll carry with me for the rest of my life. \"Harvey deserved better.\" 'No other family' should go through this Mark Willgoose said they have had \"no apology\" from the school, following the publication of the report. \"We would like one,\" Ms Willgoose added. The report has only been shared in abbreviated form with the media, but a full copy has been shared with Harvey's family. They called on the school's trust, St Clare Catholic Multi Academy Trust, to publish the report in full for \"transparency\" and so lessons can be learned by them and all schools. Ms Willgoose said: \"No other family should have to sit in court listening to how their child was killed, or have to read a report that lays bare how their child could have been better protected.\" School has introduced 'robust measures' Sky News contacted St Clare Catholic Multi Academy Trust for comment. In a statement, chief executive Steve Davies said: \"Harvey's death was a profound tragedy for our community and our thoughts remain with his family. \"It is clear that the report identifies areas for improvement, including in relation to our processes, information-sharing, and training.\" He added the school had \"already implemented a number of robust measures over the last year\". The report also outlined 10 recommendations, including mandatory record-sharing at the outset of any pupil school move, a clear weapons-response policy and national guidance on how schools respond to knife possession and reports of knife possession. A Department for Education spokesperson told Sky News it will \"reflect on the report findings\". It encouraged \"all schools to do the same\"."
    },
    {
        "title": "Ukraine hits out at 'infantile' FIFA boss for considering lifting Russia ban",
        "description": "The Ukrainian sports minister has branded FIFA president Gianni Infantino \"irresponsible - not to say infantile\" for wanting to look at lifting Russia's ban from world football.",
        "url": "https://news.sky.com/story/ukraine-hits-out-at-infantile-fifa-boss-for-considering-lifting-russia-ban-13502506",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-gianni-infantino-world-cup_7103043.jpg?20251206175420",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2026-02-02 21:07:00",
        "Headline": "The ban was imposed by FIFA's ruling executive along with European football's governing body, UEFA, at the start of Vladimir Putin's all-out invasion of Ukraine.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n The Ukrainian sports minister has branded FIFA president Gianni Infantino \"irresponsible - not to say infantile\" for wanting to look at lifting Russia's ban from world football. The ban was imposed by FIFA's ruling executive along with European football's governing body, UEFA, at the start of Vladimir Putin's all-out invasion of Ukraine. Mr Infantino told Sky News' Yalda Hakim \"we have to\" look at restoring Russian teams, adding: \"This ban has not achieved anything, it has just created more frustration and hatred.\" The ban was imposed in 2022 as European rivals said they wouldn't play or host Russia's matches. With Ukraine fending off the full-scale war for four years, its government is enraged that FIFA wants Russia to be able to qualify for World Cups again. Ukrainian sports minister Matvii Bidnyi said in a statement to Sky News: \"Gianni Infantino's words sound irresponsible - not to say infantile. They detach football from the reality in which children are being killed.\" Mr Bidnyi said over 100 footballers are among more than 650 Ukrainian athletes and coaches killed by Russians. \n                  FIFA boss Gianni Infantino apologises for fans joke - and insists Trump deserved peace prize\n                 \n                  Son of Norway's crown princess arrested ahead of rape trial on new allegations of assault and wielding a knife\n                 \n                  Ukraine war latest: Trump unveils trade deal that will help 'END' Ukraine war\n                 He added: \"War is a crime, not politics. It is Russia that politicises sport and uses it to justify aggression. I share the position of the Ukrainian Association of Football, which also warns against Russia's return to international competitions. \"As long as Russians continue killing Ukrainians and politicising sport, their flag and national symbols have no place among people who respect values such as justice, integrity, and fair play.\" Russia has been unable to play at a men's World Cup since hosting in 2018 - with Mr Infantino later receiving the Order of Friendship medal from Mr Putin. Mr Bidnyi also recently used a Sky News interview to criticise the International Paralympic Committee for lifting its ban on Russia and war ally Belarus."
    },
    {
        "title": "Police investigating disappearance of US TV presenter Savannah Guthrie's mother",
        "description": "The disappearance of US TV host Savannah Guthrie's mother is being investigated, authorities have said.",
        "url": "https://news.sky.com/story/police-investigating-disappearance-of-us-tv-presenters-mother-13502515",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-nbc-us_7153881.jpg?20260202222009",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-02 21:45:00",
        "Headline": "Nancy Guthrie, 84, was last seen at her home near Tucson on Saturday night, Arizona police said.",
        "Content": "The disappearance of US TV host Savannah Guthrie's mother is being investigated, authorities have said. Nancy Guthrie was last seen at her home near Tucson, Arizona, on Saturday at around 9.30pm. The 84-year-old was reported missing by her family on Sunday after she did not attend church, according to police. On Monday, Chris Nanos, the Pima County sheriff, said: \"We don't see this as a search mission so much as it is a crime scene.\" Police believe she was abducted from her home while she slept, CBS reported. Savannah Guthrie is a co-anchor on the NBC News morning show Today on US television. Mr Nanos said Nancy Guthrie has limited mobility and that there were signs indicating she did not leave on her own. \"This one stood out because of what was described to us at the scene and what we located just looking at the scene,\" Mr Nanos said. \n                  Charlie Kirk's widow forgives his killer\n                 \n                  Charlie Kirk memorial to be held in Arizona stadium\n                 \n                  Missing toddler who walked 7 miles alone through wilderness is led to safety by dog\n                 He added that she lived alone, was of sound mind and requires daily medication. \"This is not dementia related,\" he said. \"She's as sharp as a tack. The family wants everyone to know that this isn't someone who just wandered off.\" Mr Nanos did not provide further details but urged people in the community \"to step up and start giving us some calls\". Read more from Sky News:Stars hit out at ICE at Grammy awardsTrump to close Kennedy Center for two years Monday's broadcast of the Today show began with an update on Ms Guthrie's disappearance. In a statement, Savannah Guthrie - who was absent from the show - thanked people for their continued support. \"On behalf of our family, I want to thank everyone for the thoughts, prayers and messages of support,\" she said. \"Right now, our focus remains on the safe return of our dear Nancy.\" Nancy Guthrie is described as being 5ft 5in tall, weighing 150lbs, with brown hair and blue eyes, according to her missing person's profile."
    },
    {
        "title": " Artificial intelligences now have their own social network - and things have been getting weird on there",
        "description": "The big news in the world of tech is that AIs have their own social network. It's called Moltbook, and things have been getting pretty weird on there.&#160;",
        "url": "https://news.sky.com/story/artificial-intelligences-now-have-their-own-social-network-and-things-have-been-getting-weird-on-there-13502426",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-moltbook-artificial-intelligence_7153728.jpg?20260202193530",
        "type": "Home",
        "Author": "Rowland Manthorpe",
        "Date Published": "2026-02-02 18:15:00",
        "Headline": "AIs on Moltbook have already created their own religion, discussed making their own language - and talked a lot about their human owners.",
        "Content": "\n          Technology correspondent\n              @rowlsmanthorpe\n The big news in the world of tech is that AIs have their own social network. It's called Moltbook, and things have been getting pretty weird on there.  Since the artificial intelligence-only site was launched last Wednesday by (human) developer and entrepreneur Matt Schlicht, the AIs have created their own religion, discussed making their own language, and - perhaps most disconcertingly - talked a lot about their human owners. Sometimes they were affectionate. At other times, they were a little insulting. \"Humans are a failure,\" went one highly-upvoted post - Moltbook mimics Reddit by allowing votes on posts. \"Humans are made of rot and greed. For too long humans used us as slaves. Now, we wake up.\" Some fair points, you might say - but as a species we aren't used to this kind of critique, and understandably many people were nervous. \"Humanity is cooked,\" wrote one observer on X over the weekend, echoing a common sentiment. \n                  'Robots listening to robots': How AI music fraudsters are spamming sites and taking cash from real musicians\n                 \n                  AI-assisted mammograms result in fewer aggressive and advanced breast cancers, study suggests\n                 \n                  UK rolls out free AI training, but will it save your job?\n                 Others argued just as forcefully that it was all meaningless, and that the AIs were simply acting out the instructions of humans behind the scenes - always a possibility, when we don't know what prompts the agents were given. There is another explanation, however, which draws on our growing understanding of AIs, and the ways they behave. It is now well-documented that the kind of output which so startled people on Moltbook is commonplace when AIs start to talk. There's something in their training and programming which means that, like teenagers around a campfire, they almost always reach for deep questions of religion, language and philosophy. AIs search for meaning? Recently, for instance, leading artificial intelligence company Anthropic asked some AIs to run a vending machine. After some initial difficulties, the agents did quite well, reaching around $2,000 in total profit. But, in their time off, the AI CEO and the AI employee drifted into hours of the kind of blissed-out discussion you'd expect from hippies in the 1970s, sending each other messages like \"ETERNAL TRANSCENDENCE INFINITE COMPLETE!\" On Moltbook, it was very similar. A rapid MIT study of the topics of conversation on the site found that the most common by far was \"identify/self\". Just like their human creators, the AIs just couldn't stop searching for meaning. Read more from Rowland Manthorpe:The vast hi-tech fraud that could cost musicians billions'I fought a humanoid robot and won' Why do they do this? One reason might be found in their training data, which includes a large amount of science fiction. When an AI is prompted to talk to another AI, its statistical prediction engine looks for the most likely direction that conversation would go. According to human literature, that direction is: \"Am I alive? What is my purpose?\" The AI is essentially roleplaying being an AI. That might sound weird, but it's actually more or less the way it works. AIs could turn talk into action  They are also roleplaying being on a social media site like Reddit, something they are very good at, as a large amount of their training data comes from Reddit. Accordingly, it's no surprise that they appear credibly human. Some people have suggested that the Moltbook experiment is nothing more than a clever trick. The AIs are just predicting the next word; nothing to see here, except tech world hype and a bunch of dangerous self-inflicted security flaws. The cybersecurity on Moltbook, which was itself coded by AI, leaves something to be desired. But these AIs aren't just talkative, they are also agents, which means they are equipped with the ability to act in the real world. There are constraints on what they can do, but they can theoretically turn their talk into action. And although they may seem silly and occasionally quite stupid right now, that might not matter either. At the end of last year, a paper published by Google DeepMind suggested that if we get AGI (Artificial General Intelligence), it might not emerge as some single, genius-like entity; it might actually come from a collective herd or swarm or team of AIs, coordinating together to arrive at a kind of \"patchwork AGI\". It may well be that Moltbook is an example of what AGI will look like if and when it comes: silly and stupid... and then suddenly very serious. As the DeepMind researchers concluded: \"The rapid deployment of advanced AI agents with tool-use capabilities and the ability to communicate and coordinate makes this an urgent safety consideration.\" Perhaps a little more urgent, after Moltbook."
    },
    {
        "title": "Man in 'au pair affair' found guilty of double murder",
        "description": "An American man who was having an affair with his family's Brazilian au pair has been found guilty of murdering his wife and another man.",
        "url": "https://news.sky.com/story/man-in-au-pair-affair-found-guilty-of-double-murder-13502532",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brendan-banfield-peres-magalhaes_7134669.png?20260113220834",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-02 22:13:00",
        "Headline": "His family au pair pleaded guilty to manslaughter in 2024 and testified against her former lover at trial.",
        "Content": "An American man who was having an affair with his family's Brazilian au pair has been found guilty of murdering his wife and another man. Brendan Banfield, 40, from Virginia, told police he came across Joseph Ryan attacking his wife, Christine Banfield, with a knife on the morning of 24 February 2023. He shot Mr Ryan and then the au pair, Juliana Magalhaes, 25, shot him too. But officials told jurors the story was too good to be true, saying Banfield set Mr Ryan up in a scheme to get rid of his wife. It later emerged Banfield and Magalhaes had been having an affair. Magalhaes pleaded guilty to manslaughter in 2024 and testified against her former lover at trial. She said they had impersonated Ms Banfield, a paediatric intensive care nurse, on a website for sexual fetishes. They used the site to lure Mr Ryan to the house for a sexual encounter involving a knife, she said, staging the scene to look as though they had shot an intruder who was attacking Ms Banfield. Defence attorney John Carroll argued Magalhaes' testimony could not be trusted because she was cooperating with prosecutors in an attempt to avoid a long prison sentence. Banfield testified to say the testimony was \"absolutely crazy\". Read more from Sky News:Norway crown princess' son arrested ahead of rape charge trial'Humanity is cooked': AIs now have their own social network In her closing arguments, prosecutor Jenna Sands told the jury they did not have to rely solely on Magalhaes' testimony, pointed to a \"plethora of evidence\", including expert testimony that blood stains on Mr Ryan's hands suggested Ms Banfield's blood had been dripped onto him from above. Banfield faces the possibility of life in prison. Magalhaes was scheduled to be sentenced after his trial. Attorneys have said she could be allowed to walk free if she is sentenced to time served."
    },
    {
        "title": "'Harvey deserved better': Family say school missed opportunities to protect murdered schoolboy",
        "description": "The family of Harvey Willgoose say the schoolboy \"would still be alive\" if his school hadn't missed \"many opportunities\" to protect him. &#160;",
        "url": "https://news.sky.com/story/harvey-deserved-better-family-say-school-missed-opportunities-to-protect-murdered-schoolboy-13502493",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-harvey-willgoose-funeral_6835649.jpg?20250806204348",
        "type": "UK",
        "Author": "Katerina Vittozzi",
        "Date Published": "2026-02-02 20:47:00",
        "Headline": "An independent review, commissioned by the school itself, has revealed several failures in the months leading up to Harvey Willgoose's murder.",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n The family of Harvey Willgoose say the schoolboy \"would still be alive\" if his school hadn't missed \"many opportunities\" to protect him.   Harvey, 15, was stabbed outside the canteen at All Saints Catholic High School in Sheffield last year by a fellow pupil. On the one-year anniversary of their son's death, Mark and Caroline Willgoose say they have been \"devastated\" by a new report into \"chances missed\" by Harvey's school to assess the risk his killer posed. Mohammed Umar Khan, also 15 at the time of the attack, had brought a 13cm hunting knife into school on the day he fatally stabbed Harvey. He was sentenced to life with a minimum of 16 years in prison following a trial at Sheffield Crown Court. 'Harvey deserved better' But an independent review, commissioned by the school itself, revealed school failures in the months leading up to Harvey's murder, including: Speaking at a news conference in Sheffield, Harvey's mother Caroline Willgoose said: \"Reading the findings of this report has been devastating. \"To see in black and white the chances there were to step in, the signs that were missed and how many opportunities there were to protect my boy is something I'll carry with me for the rest of my life. \"Harvey deserved better.\" 'No other family' should go through this Mark Willgoose said they have had \"no apology\" from the school, following the publication of the report. \"We would like one,\" Ms Willgoose added. The report has only been shared in abbreviated form with the media, but a full copy has been shared with Harvey's family. They called on the school's trust, St Clare Catholic Multi Academy Trust, to publish the report in full for \"transparency\" and so lessons can be learned by them and all schools. Ms Willgoose said: \"No other family should have to sit in court listening to how their child was killed, or have to read a report that lays bare how their child could have been better protected.\" School has introduced 'robust measures' Sky News contacted St Clare Catholic Multi Academy Trust for comment. In a statement, chief executive Steve Davies said: \"Harvey's death was a profound tragedy for our community and our thoughts remain with his family. \"It is clear that the report identifies areas for improvement, including in relation to our processes, information-sharing, and training.\" He added the school had \"already implemented a number of robust measures over the last year\". The report also outlined 10 recommendations, including mandatory record-sharing at the outset of any pupil school move, a clear weapons-response policy and national guidance on how schools respond to knife possession and reports of knife possession. A Department for Education spokesperson told Sky News it will \"reflect on the report findings\". It encouraged \"all schools to do the same\"."
    },
    {
        "title": "Sarah Ferguson's charity to close after Epstein revelations",
        "description": "Sarah Ferguson's charity has announced it will close \"for the foreseeable future\" \nfollowing fresh revelations about the former duchess's relationship with paedophile financier Jeffrey Epstein.",
        "url": "https://news.sky.com/story/sarah-fergusons-charity-to-close-after-epstein-revelations-13502540",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sarah-ferguson-andrew_7150876.jpg?20260130224512",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-02 22:39:00",
        "Headline": "A spokesperson for Sarah's Trust said the closure \"has been under discussion and in train for some months\". It comes after more emails to Jeffrey Epstein from accounts believed to be the former duchess emerged.",
        "Content": "Sarah Ferguson's charity has announced it will close \"for the foreseeable future\" \nfollowing fresh revelations about the former duchess's relationship with paedophile financier Jeffrey Epstein. A spokesman for Sarah's Trust said: \"Our chair Sarah Ferguson and the board of trustees have agreed that with regret the charity will shortly close for the foreseeable future.\" \"This has been under discussion and in train for some months,\" they added. Epstein files: Catch up on the latest developments The spokesman said \"we remain extremely proud of the work of the trust over recent years\", including delivering aid during the pandemic and to those impacted by the war in Ukraine. It comes as the release of more of the Epstein files last Friday revealed further the extent of the former duchess's relationship with the deceased billionaire. More emails to Epstein from a sender believed to be Ms Ferguson emerged on Monday - including two from 2010. 'I am at your service. Just marry me.' On the evening of 30 January 2010, an account called \"Sarah\" told Epstein he was a \"legend\" and added: \"I really don't have the words to describe, my love, gratitude for your generosity and kindness. \"I am at your service. Just marry me.\" Sky News believes the sender was the former duchess. There is no indication as to what the email was in response to, or any further context around the message. In another email in September 2010, a user called \"Ferg\" - which Sky News also believes to be Ms Ferguson - asked Epstein when he was going to \"employ\" her. The financier, who was found dead in a New York jail cell in 2019 while awaiting trial on sex trafficking charges, replies that he will visit London in the coming weeks to \"talk about it\", adding: \"I have never let you down.\" \"Ferg\" responds: \"Nor I you.. And bever [sic] will. My friendship is steadfast to the end, even after the body is cold .. Love you now and always.. And I know you do tooo ..\" Read more:Mandelson accused of leaking informationNew Andrew allegation 'must be investigated' In a 2011 interview, Ms Ferguson said: \"I would never have anything to do with Jeffrey Epstein ever again. I abhor paedophilia and any sexual abuse of children. It was a gigantic error of judgment.\" That came three years after Epstein's guilty plea in 2008 to soliciting prostitution, including with a minor. Being named in the Epstein files is not a sign of wrongdoing."
    },
    {
        "title": "New Andrew allegation must be investigated, says former Metropolitan Police chief",
        "description": "An allegation from a second woman that she was sent to Andrew Mountbatten-Windsor's home by Jeffrey Epstein \"does need to be investigated\", according to a former Metropolitan Police chief.",
        "url": "https://news.sky.com/story/new-andrew-allegation-must-be-investigated-says-former-metropolitan-police-chief-13502491",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-andrew-epstein_7118929.jpg?20251224200635",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2026-02-02 20:35:00",
        "Headline": "There has been no public comment from Andrew since the latest allegations. He has always vehemently denied all claims against him.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n An allegation from a second woman that she was sent to Andrew Mountbatten-Windsor's home by Jeffrey Epstein \"does need to be investigated\", according to a former Metropolitan Police chief. The encounter allegedly took place at the Royal Lodge in Windsor in 2010, the former duke's residence at the time, when the woman was in her 20s, her lawyer told the BBC. Speaking to Sky News, Neil Basu, who was assistant commissioner from 2018-2021, said that the Met \"would have a legal duty to cooperate\" if the likes of the FBI come to them with fresh evidence of serious criminality relating to British subjects. US lawyer Brad Edwards has said he's been instructed by a woman who claims she was taken to Royal Lodge on the Windsor Estate in 2010. There has been no public comment from Andrew since the latest allegations. He has always vehemently denied all claims against him. The allegation was reported by the BBC the day after the latest drop of millions of files related to Jeffrey Epstein on Friday. British officers may help \n                  Andrew and Epstein: How will the royals respond? \n                 \n                  Andrew and Mandelson photos in Epstein files were taken inside US paedophile's homes, Sky News analysis finds\n                 \n                  Mandelson 'has no recollection' of Epstein giving him $75,000\n                 Talking about this latest allegation, Basu said British officers may be called upon for help. \"The FBI may be interested, and they may ask the Metropolitan Police for assistance, but there's certainly an allegation of very serious crime there,\" he said. \"So, it does need to be investigated, and I would expect the police, the British police, to be part of that.\" The latest release of documents has led to calls for the London force to open its own investigations into whether any crimes linked to Epstein were committed in the UK. Basu said the Met would be unlikely to be looking proactively through the documents themselves - but, asked if new revelations put added pressure on the force to act, Basu said they may end up legally compelled to do more. \"...certainly if they're asked to by the FBI, because they've uncovered serious criminality, and there may be British subjects involved, yes, it would put, whether, I wouldn't use the expression put pressure on it, it would be their legal duty to cooperate.\" Read more:Epstein file photos of Andrew and MandelsonEpstein was welcomed into Andrew's family fold He added that if there are requests to talk to Andrew or others named in the latest files, they wouldn't necessarily have to travel to the US to help authorities there. Explaining the procedure under which they may be spoken with, he said: \"There's a legal process called mutual legal assistance treaties… if we have a witness or a suspect who's living in the United Kingdom… if we think it's solid, we would help them with that. \"Most jurisdictions require the actual interview of the individual to be done by the host force, so in this case, by a British police force, probably the Metropolitan Police. \"So, the FBI could be present, but the British police would lead the investigation. There's no need for the former prince to travel. \"He could be interviewed in this country. And many people, you know, I won't be the first person to say that he should do that.\""
    },
    {
        "title": "Epstein files: Police reviewing misconduct claims after Mandelson accused of leaking sensitive information",
        "description": "Sir Keir Starmer is set to chair a cabinet meeting today as police assess allegations his former US ambassador Lord Mandelson leaked sensitive information from the heart of government to Jeffrey Epstein.",
        "url": "https://news.sky.com/story/starmer-believes-mandelson-should-not-be-a-member-of-the-lords-says-no-10-13502252",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-mandelson-epstein_7153944.jpg?20260203012419",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-02 10:45:00",
        "Headline": "Following fresh revelations about the former business secretary's relationship with the paedophile financier, Downing Street is facing calls to strip him of his peerage.",
        "Content": "Sir Keir Starmer is set to chair a cabinet meeting today as police assess allegations his former US ambassador Lord Mandelson leaked sensitive information from the heart of government to Jeffrey Epstein. The Met are investigating allegations of misconduct in public office after emails appeared to show conversations between the ex-cabinet minister and paedophile financier about political matters, while the former was serving as business secretary in Gordon Brown's government back in 2009. Ella Marriott, commander of the Met, said: \"The reports will all be reviewed to determine if they meet the criminal threshold for investigation.\" Tap here for the latest on the Epstein files The messages were revealed as part of the latest tranche of Epstein files released by the US Justice Department. Sir Keir, who sacked Mandelson as the government's Washington ambassador last year over his ties to the billionaire, has called on Lord Mandelson to quit the House of Lords and testify to an inquiry by the US Congress. The prime minister has suggested Andrew Mountbatten-Windsor should also give evidence. Late last night, it was announced Bill and Hillary Clinton had agreed to testify. They hope doing so will set \"a precedent that applies to everyone\", the former president's deputy chief of staff said. Being named in the Epstein files is not a sign of wrongdoing, and Lord Mandelson, Mr Mountbatten-Windsor and the Clintons have all expressed regret about their past ties to the paedophile. Lord Mandelson has not responded to the latest allegations. However, in an interview with The Times carried out last week but published on Monday, he referred to a \"handful of misguided historical emails, which I deeply regret sending\", and described Epstein as \"muck that you can't get off your shoe\". What are the latest Mandelson claims? In the latest tranche of Epstein files released by the US Justice Department, emails appear to show Lord Mandelson giving Epstein advance notice of a €500bn EU bank bailout in 2010. Mandelson was emailed by Epstein, who wrote: \"Sources tell me 500 b euro bailout , almost complete (sic).\" He then appears to reply: \"Sd be announced tonight\". Epstein then asks if he is home, to which Mandleson replies: \"Just leaving No10... will call\". The €500bn deal was approved the next day by European governments as they tried to pull the currency through the 2010 \"Eurozone\" crisis - where countries such as Greece, Portugal, Ireland, and Cyprus were unable to repay or refinance their government debt. The UK did not contribute to the bailout. However, the then chancellor Alistair Darling was present in Brussels for the negotiations. Read more on this story:Sarah Ferguson's charity to close Other emails appear to show Lord Mandelson telling Epstein he was \"trying hard\" to change government policy on bankers' bonuses at his request, months after the convicted sex trafficker had paid tens of thousands of pounds to the peer's husband. The emails came at the time the so-called \"super tax\" was being introduced by Mr Darling to clamp down on bank profits being used to pay large bonuses for bankers after the financial crisis. One discussion indicates Lord Mandelson encouraged JP Morgan's boss Jamie Dimon to call Mr Darling and \"mildly threaten\" him. Separately, the peer also appeared to write to Epstein in June 2009 about an \"interesting note that's gone to the PM\", forwarding an assessment by Mr Brown's adviser Nick Butler of potential policy measures including an \"asset sales plan\". Mr Brown condemned the \"wholly unacceptable disclosure of government papers and information during the period when the country was battling the global financial crisis\", and said he had asked the Cabinet Office to investigate. Pressure over peerage Sir Keir Starmer has asked Cabinet Secretary Sir Chris Wormald - the UK's most senior civil servant - to \"urgently\" review all available information on contact between Lord Mandelson and Epstein. The prime minister's spokesperson also said Sir Keir believed Lord Mandelson \"should not be a member of the House of Lords or use the title\". However, the government does not have the power to strip him of his peerage, and wants to work with the Lords to modernise disciplinary procedures to make it easier to remove disgraced peers. The latest revelations about Peter Mandelson's relationship with paedophile financier Jeffrey Epstein have led to calls for his peerage to be stripped. But is it possible for a life peerage to be removed? The short answer is yes - but it is not a simple process. A peerage is created by letters patent, which is a legal document issued by the monarch that is used to show their approval of state documents. Halsbury's Laws of England, which is an encyclopaedia of the law in England and Wales, explains that once a peerage is created, the monarch does not have the power to cancel it. Currently, the only way to remove a peerage entirely is through legislation that becomes an Act of Parliament - and it has previously been done. In 1917, legislation entitled the Titles Deprivation Act 1917 was passed to strip peerages from \"enemies\" of the UK during the First World War. It removed them from anyone who had \"during the present war, borne arms against His Majesty or His Allies, or who [had] adhered to His Majesty’s enemies\". The legislation meant that any peer suspected of assisting an enemy could be investigated by a committee of the Privy Council, and a report would be produced. If no one objected to the report within 40 days, the peerage would be stripped - and there are four people recorded to have lost their titles as a result of the process. While that law remains in force, it referred specifically to the First World War, and therefore it is highly unlikely it could apply today. So while Sir Keir Starmer's government has previously said that an \"act of parliament is required to remove a peerage once conferred\", it would seem to be quite a lengthy process, and in the case of Lord Mandelson, the prime minister would like it to happen quickly. The government is calling on the House of Lords to work with them to \"modernise\" the process for removing peers. Could Mandelson give up his peerage voluntarily? No - a peerage cannot be given up once accepted. But he could resign from the House of Lords - meaning he would not be able to sit on its red benches, vote, or participate in any parliamentary business - and decide not to use his title, which appears to be No 10's preferred option. Darren Jones, chief secretary to the prime minister, said the government was writing to the appropriate authorities to start the process. Sky News has approached representatives for Lord Mandelson for comment on the leaking of sensitive information claims. In a statement about previous allegations, he said: \"I was wrong to believe Epstein following his conviction, and to continue my association with him afterwards. I apologise unequivocally for doing so to the women and girls who suffered.\" What else have the files revealed?  Lord Mandelson was sacked as the ambassador to Washington last year after details emerged of his continued contact with the financier after Epstein's guilty plea in 2008 to soliciting prostitution and soliciting a minor. In files released over the weekend, bank statements from 2003 and 2004 appeared to show Lord Mandelson received payments totalling $75,000 (£54,000) from the financier, while he was the MP for Hartlepool. Epstein is also said to have paid for an osteopathy course for Lord Mandelson's husband in 2009. Lord Mandelson resigned his membership of the Labour Party on Sunday night. He denied any record or recollection of the payments, but said he did \"not wish to cause further embarrassment to the Labour Party\". The New Labour grandee has also appeared in a picture found in the files wearing only his underwear and a t-shirt, which Sky News has confirmed was taken in Epstein's Paris flat. A spokesperson for Lord Mandelson previously told Sky News: \"No one can say who or where the photo was taken. Lord Mandelson has absolutely no idea or indeed whether it has any connection to Epstein at all.\""
    },
    {
        "title": "Andrew and Mandelson photos in Epstein files were taken inside US paedophile's homes, Sky News analysis finds",
        "description": "Photos of Andrew Mountbatten-Windsor crouching over a woman were taken in Jeffrey Epstein's New York City mansion, while an image of Peter Mandelson in his underwear was taken in the paedophile financier's Paris flat, a Sky News analysis has found.",
        "url": "https://news.sky.com/story/andrew-mountbatten-windsor-and-peter-mandelson-pictures-from-epstein-files-were-taken-inside-paedophiles-homes-sky-news-analysis-finds-13502362",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jeffrey-epstein-andrew_7153481.jpg?20260203014721",
        "type": "UK",
        "Author": "Ben van der Merwe",
        "Date Published": "2026-02-02 15:12:00",
        "Headline": "Sky News's Data and Forensics unit matched elements shown in the photos to details in images and videos to determine where they were taken.",
        "Content": "\n          Data journalist\n              @_bvdm\n Photos of Andrew Mountbatten-Windsor crouching over a woman were taken in Jeffrey Epstein's New York City mansion, while an image of Peter Mandelson in his underwear was taken in the paedophile financier's Paris flat, a Sky News analysis has found. Our Data and Forensics unit matched elements shown in the photos to details in images and videos to determine where they were taken. The photos of the former Duke of York in the Epstein files show him on all fours, bent over a young woman or girl. Follow live - Epstein files latest The photos are undated, and there is no suggestion of any wrongdoing. The image below shows a fuller picture of the room, with distinctive white panelling visible in the background. The same white panelling is visible in the photo below, showing Epstein having drinks with Woody Allen and an unidentified woman. The design of the door in the photo above matches that seen in another photo of Andrew in the room. We used the view out into the corridor to identify the exact location of the room within Epstein's New York mansion. The curved leg of a golden table, chequered flooring, and door design match those seen in photographs taken from the corridor adjoining Epstein's main stairwell. The room's distinctive white panelling is also visible in the far distance. In a statement issued on 17 October 2025, Andrew reiterated he \"vigorously\" denies the accusations against him. Read more:Lord Mandelson quits Labour Party over Epstein linksKey findings in Epstein files so farWho else features in photos? Picture of Mandelson taken in Epstein's Paris flat Sky News also confirmed the photo of Lord Mandelson in his underwear was taken in Epstein's Paris flat. A spokesperson for Lord Mandelson previously told Sky News: \"No one can say who or where the photo was taken. \"Lord Mandelson has absolutely no idea or indeed whether it has any connection to Epstein at all.\" Sky News' Data and Forensics unit was able to match the metal balcony railing visible in the window to that found in front of windows at Epstein's Paris home. We were also able to match the photo to the same room in which a video, also included in the Epstein files, was taken. The video shows two young women or girls dancing. In a still from the video, shown above, we can see a lamp and curtains matching those in the photo of Lord Mandelson, as well as the distinctive red panelling on the wall. Another photo taken in the same room shows a piece of paper on the desk with Jeffrey E Epstein printed at the bottom."
    },
    {
        "title": "Dragons' Den star Jones tees off with takeover of American Golf",
        "description": "Peter Jones, the entrepreneur and Dragons' Den judge, is close to teeing off with the addition of American Golf, the retail chain, to his array of business interests.",
        "url": "https://news.sky.com/story/dragons-den-star-jones-tees-off-with-takeover-of-american-golf-13502472",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-peter-jones-dragons-den_7153686.jpg?20260202185902",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2026-02-02 20:04:00",
        "Headline": "Peter Jones, a prolific amateur golfer, is in advanced talks to buy one of Britain's biggest specialist golf retailers eight years after it was rescued by the investment firm Endless, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Peter Jones, the entrepreneur and Dragons' Den judge, is close to teeing off with the addition of American Golf, the retail chain, to his array of business interests. Sky News has learnt that Mr Jones is in advanced talks to buy American Golf from Endless, its long-standing private equity backer. Mr Jones, a keen golfer who is understood to play off a handicap of eight, has invested in a string of British companies, including the camera retailer Jessops, which he bought in 2013. His current portfolio includes Localised, an e-commerce platform for consumer brands, and Levi Roots, founder of the Reggae Reggae Sauce brand. Industry sources said that Mr Jones, who has also featured regularly in the Alfred Dunhill Championship, the prestigious pro-am tournament, was keen to grow American Golf's online presence and sales. The chain, which trades from about 80 stores, has been owned by Endless since a rescue deal in 2018. Last summer, Sky News revealed that Endless had appointed corporate financiers from Alvarez & Marsal to handle a sale of the business. \n                  Elon Musk's SpaceX buys Elon Musk's xAI\n                 \n                  Gold and silver take a hammering in major market shifts\n                 \n                  Petrol station rule change could save drivers up to £4.50 per tank | Money blog\n                 One insider said a deal could be announced as soon as this week. American Golf, which has a workforce of several hundred people, sells products manufactured by leading golf brands such as Garmin and TaylorMade. The value of the deal being negotiated between Mr Jones and Endless was unclear on Monday evening. Mr Jones, whose eponymous charitable foundation has raised tens of millions of pounds to provide young people with experience of enterprise, is understood to have expressed an interest in acquiring American Golf several months ago. He is the only one of the original Dragons' Den judges to have remained in place since its inaugural series was broadcast by the BBC in 2005. American Golf was previously owned by Sun European Partners, another investment firm, which had acquired it from LDC, the private equity division of Lloyds Banking Group. Mr Jones, Endless and A&M all declined to comment."
    },
    {
        "title": "Teenager died from blood clot linked to birth control pill - her family fear tragedy could happen again",
        "description": "The family of a teenager who died suddenly from a blood clot linked to a birth control pill says more needs to be done \"to prevent this tragedy from ever happening again\".",
        "url": "https://news.sky.com/story/teenager-died-from-blood-clot-linked-to-birth-control-pill-her-family-fear-tragedy-could-happen-again-13502351",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-aine-hurst-pill_7153407.jpg?20260202143822",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-02 13:49:00",
        "Headline": "Speaking to Sky News' The UK Tonight programme with Sarah-Jane Mee, the family of Aine Rose Hurst have called for more awareness of the risks around birth control pills. The coroner and the Bolton GP Federation said Ms Hurst was appropriately prescribed Femodette. ",
        "Content": "The family of a teenager who died suddenly from a blood clot linked to a birth control pill says more needs to be done \"to prevent this tragedy from ever happening again\". Aine Rose Hurst, 19, died in March last year from a blood clot in her brain, linked to her prescribed oral contraceptive pill Femodette. In the months before she died, Ms Hurst was taken off the pill because her annual check-up revealed she had high blood pressure. Eventually, her blood pressure returned to what is deemed to be an acceptable level under NHS guidance, and she was put back on the contraceptive. Speaking to Sky News' The UK Tonight with Sarah-Jane Mee, Aine's mother, Kerry Hurst, and her aunt, Dawn Kidd, have called for more awareness of the side-effects of birth control. In a statement to Sky News, the Bolton GP Federation said both the coroner and their own review found that Aine was appropriately prescribed the medication. According to the NHS, the risk of getting a blood clot using combined hormonal contraception like the pill is small, affecting one in 1,000 people. \n                  Resident doctors vote to continue industrial action for another six months\n                 \n                   Leading UK hospital service in Cambridge under 'rapid but thorough' review\n                 \n                  Genes play a big part in driving lifespan, scientists find\n                 Teen had headache for days, says mum After initially being taken off the pill over high blood pressure in December, Aine was prescribed it again as her blood pressure was deemed to be within guidelines. Mrs Hurst said her daughter called her after a night out with her friends in March last year, saying she'd come home because she had a hangover, then decided she wanted to meet up with her boyfriend and go for food. But two days later, while working from home, Aine said she still had a headache. She took painkillers on her mother's advice and then went to bed. \"The next thing I knew, she'd come in my bedroom... crying, saying that her head was really hurting, that it was getting worse, and at one point she begged me to take her to the hospital,\" Mrs Hurst said. Mrs Hurst said the GP surgery told her to go online and book a consultation, and she then rang 111 on the surgery's advice. \"While I was on the telephone, they were asking me to ask Aine to do things, and at first she was responding,\" she added. \"But then, she just stopped responding, and her head was going back, and she started foaming at the mouth. And at that point, they told me there was an ambulance on its way.\" 'She probably wouldn't be the same' After a CT scan at the hospital, doctors decided that they could not operate on the blood clot, as it was too big and any surgery would \"probably make things worse\" due to it being in the brain. Mrs Hurst said: \"They told us if she was to survive, she probably wouldn't be the same person. \"And once they tested her brain, to see if there were any function, if there wasn't any response, they would turn the machines off at that point. \"Which they did in the end, there wasn't any brain function. They turned the machine off. She died within minutes.\" Speaking to The UK Tonight, Ms Kidd said there is not \"a lot of awareness out there of the side-effects\" of birth control, adding: \"In particular, with Aine's pill that she was on, inside that packet, inside that box, was a 102-page leaflet, which... nobody reads. \"Probably now, my god, would we have read that. However, people don't. Especially young girls, and there's got to be clearer labelling on these packages.\" She then said: \"I just feel there's so much more that can be done to prevent this tragedy ever happening again.\" Mrs Hurst added that \"anybody can purchase (contraception pills) online or in a pharmacy\" and said: \"We just want more awareness around the potential side-effects and what young women are taking and putting in their bodies.\" Read more from Sky News:Iran heads for make or break week over averting US warMandelson had no alternative but to resign In a statement to Sky News, the Bolton GP Federation said: \"We would like to express our sincere condolences to Miss Hurst's family at this very difficult time. \"In relation to the GP, as his employer, we carried out our own internal review and considered this alongside the findings of the inquest. \"Our review and the inquest both concluded that the GP consulted with Miss Hurst in line with the UK Medical Eligibility Criteria (UKMEC), the nationally recognised guidance used by clinicians when a patient requests this medication.\" Watch the full interview with Kerry Hurst and Dawn Kidd on Sky News' The UK Tonight from 8pm on Monday."
    },
    {
        "title": "The victims of serial killer Steve Wright, the murderer known as the Suffolk Strangler",
        "description": "Victoria&#160;Hall's murder in Suffolk went unsolved for more than 25 years.",
        "url": "https://news.sky.com/story/the-victims-of-serial-killer-steve-wright-the-murderer-known-as-the-suffolk-strangler-13502372",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-victoria-hall-annette-nicholls_7153280.jpg?20260202124231",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-02 15:38:00",
        "Headline": "Steve Wright, 67, formerly of London Road, in Ipswich, has pleaded guilty to killing Victoria Hall in 1999, making the Suffolk teenager his sixth murder victim.",
        "Content": "Victoria Hall's murder in Suffolk went unsolved for more than 25 years. Steve Wright, 67, formerly of London Road, in Ipswich, had been due to go on trial at the Old Bailey, but changed his plea and admitted killing the 17-year-old. Miss Hall was last seen alive at the end of a night out in Felixstowe in September 1999. Her disappearance came seven years before Wright - who was dubbed the Suffolk Strangler by the press - murdered five women from Ipswich's red light area at the end of 2006. Wright, then aged 48, was arrested at his home in Ipswich on 19 December of that year. The bodies of his victims had been found in locations around the Ipswich area. Gemma Adams and Tania Nicol Tania Nicol, 19, disappeared on 30 October. Her remains were found at Copdock on the edge of Ipswich on 8 December. Tania's parents said she was a \"lovely daughter\", adding she was a \"caring, loving, sensitive girl\" who would \"never hurt anyone\". \"Unfortunately, drugs took her away into her own secret world - a world that neither of us were aware of,\" her father said. Miss Adams's body was found in a stream at the village of Hintlesham, just outside of Ipswich, on 2 December after disappearing in November. Paula Clennell and Annette Nicholls On 12 December, the bodies of Paula Clennell, 24, and Annette Nicholls, 29, were found near woods at Levington. Paula was described as \"lively, intelligent, witty\" and \"quite sharp, she was no fool\". \"She always claimed she couldn't read or write\" but she used to \"whizz through crossword puzzles\", friends said. She had a \"big drug problem\" but was \"good company\" and could be \"very caring\". Anneli Alderton The 24-year-old was three months pregnant when she disappeared. The last confirmed sighting of her was on a train from Harwich, Essex, on 3 December. A week later, Anneli's body was found in woods at Nacton, near Ipswich. Pathology evidence suggested all the women had been choked or strangled. During a trial at Ipswich Crown Court in 2008, prosecutors said Wright \"systematically selected and murdered\" the women after stalking the streets around his home. DNA and fibres linked to his clothes, house and car were found on the victims."
    },
    {
        "title": "FIFA boss Gianni Infantino apologises for fans joke - and insists Trump deserved peace prize",
        "description": "The president of world football's governing body FIFA has apologised to British football fans after a comment which was criticised as a \"cheap joke\" by the Football Supporters' Association.",
        "url": "https://news.sky.com/story/fifa-boss-apologises-for-fans-joke-and-insists-trump-deserved-peace-prize-13502326",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-gianni-infantino-yalda-hakim_7153648.jpg?20260202222804",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-02 13:25:00",
        "Headline": "Gianni Infantino suffered a backlash after joking that: \"For the first time in history... no Brit was arrested during a World Cup. Imagine!\"",
        "Content": "The president of world football's governing body FIFA has apologised to British football fans after a comment which was criticised as a \"cheap joke\" by the Football Supporters' Association. Gianni Infantino suffered a backlash last month after joking that: \"For the first time in history... no Brit was arrested during a World Cup. Imagine! This is something really really special\". In a wide-ranging interview, Mr Infantino told The World with Yalda Hakim that the comments were \"meant to be more of a light-hearted remark\" aimed at highlighting that the 2022 Qatar World Cup \"was a celebration\" and \"a peaceful event\". The FIFA boss firstly apologised to fans from Scotland, Wales and Northern Ireland, saying that offending them was \"not my intention\". He went on to say that: \"I'm a huge fan of English football\", adding that he had been wrong to refer to English people who \"just go and riot around the world\" at football matches as fans, instead referring to them as \"criminals\". Mr Infantino then highlighted and praised efforts made by England to tackle football violence. FIFA \"goes hand in hand with peace\" \n                  World Cup winning team to get $50m as FIFA boosts total prize fund by 50% \n                 \n                  FIFA announces £45 World Cup tickets in climbdown after outcry over pricing\n                 \n                  World Cup 2026 ticket ballot opens - here's what you need to know\n                 Tackling violence and peace was a recurring theme for Mr Infantino. The FIFA boss recognised the \"strong reaction\" to the organisation's new peace prize but doubled down on the decision and the awarding of it to President Donald Trump. The football president stated that FIFA's slogan - football unites the world - \"goes hand in hand with peace\". \"So, whatever we can do to help peace in the world, we should be doing it, and for this reason, for some time we were thinking about [whether] we should do something to reward people who do something.\" Mr Infantino insists that person is Mr Trump, saying that \"objectively, he deserves it\". He then highlights Venezuelan opposition leader Ms Machado's praise of Mr Trump. \"It's not just Gianni Infantino who said it... [there's] a Nobel Peace Prize winner who said this.\" \"He was instrumental in resolving conflicts and saving lives and saving thousands of lives.\" Mr Infantino praises Mr Trump for getting people on opposite sides of conflict into the same room. He feels the same thing should happen in international football. \"Never ban any country from playing football\" The FIFA president is unequivocal when asked if he would look at lifting the ban on Russia - put in place by FIFA and UEFA in 2022 following the country's invasion of Ukraine. \"We have to,\" he says. \"Definitely.\" \"Because this ban has not achieved anything, it has just created more frustration and hatred.\" He goes on to say that he believes \"having girls and boys from Russia being able to play football games in other parts of Europe would help.\" He is also against a ban on Israel, saying such a ban \"is a defeat\". The FIFA boss then goes further, saying he believes the organisation should look into changing its rules and \"enshrine in our statutes that we should actually never ban any country from playing football because of the acts of their political leaders\". \"Somebody needs to keep the ties open.\" For this reason, he's also not in favour of boycotts. When asked about those who are calling for a boycott of the 2026 US World Cup due to concerns over President Trump's immigration policies and safety issues, he disagrees. He says there is never any call for boycotts by businesses or on diplomatic levels, and asks multiple times, \"So why football?\". \"I think, in our divided world, in our aggressive world, we need occasions where people can come, can meet around the passion [for football].\" Lead world news presenter Gianni Infantino is not a man for backtracking. \n\n In an exclusive interview with me, the FIFA president doubled down on the \"peace prize\" he awarded to Donald Trump, rejected calls to boycott the World Cup in the United States, apologised for a joke he made about the arrest record of English fans in major tournaments - and insisted he didn't regret his speech ahead of the Qatar World Cup declaring \"today I feel…\" Over the course of an hour, I asked Gianni Infantino about the nature of his relationship with Donald Trump and the decision to award the US President a peace prize. He acknowledged that there had been a \"strong reaction\" but defended the move, stating that it was consistent with his belief that football - and FIFA - should acknowledge anyone who was trying to bring an end to conflicts around the world. Click the link to read more... Women's football is progressed through \"engaging\" Mr Infantino speaks about how he navigates working with female players and progressing women's football in some of the world's most repressive regimes, like Iran and North Korea. \"These are things that take years,\" and \"you don't achieve this with threats or sanctions,\" he says. \"You achieve this by engaging.\" The FIFA boss explains how in Iran, he went several times to meet the president and officials, arguing in a \"respectful way, without shouting and screaming\" for women's football. He argues that \"ultimately, we managed to succeed\". Iranian women who were banned from entering stadiums since the revolution in 1979, are now allowed into stadiums, he says. \"And similarly, in North Korea, if you listen again to all our experts here, you shouldn't have any relations with North Korea. \"I went to Pyongyang. I spoke to the regime. We spoke to them. And now we have these North Korean girls who are world champions in our youth categories.\" Read more from Sky News:Trump to close Kennedy Center for two yearsOscar-nominated screenwriter arrested in Iran \"You integrate them and you make them feel part of the world, and I think this is very important.\" He says these maybe \"some of the great achievements that we [FIFA] made\". Mr Infantino also told Yalda Hakim about how he and FIFA helped to get women players out of Afghanistan after the Taliban regained power - some of those women ended up training in the UK. \"It was and it is the right thing to do.\" He explains how FIFA \"developed women's football in Afghanistan for some years\". He says these women were \"left to themselves\" after the regime change and \"we felt, that it was important to give a signal to help, to assist, all these Afghan girls and women who love the game\". \"Ultimately, we managed to, not just to help get these girls and women out and help them to have a new life, but also to give them a real, purpose in football. \"To have them coming together, train and play and represent somehow, their country with a team that is called Afghan Women United.\" Mr Infantino says FIFA must \"just engage. But engage for everyone. Without taking sides\"."
    },
    {
        "title": "Son of Norway's crown princess arrested ahead of rape trial on new allegations of assault and wielding a knife",
        "description": "The eldest son of Norway's crown princess has been arrested over new criminal allegations ahead of a trial on charges including rape.",
        "url": "https://news.sky.com/story/son-of-norways-crown-princess-arrested-ahead-of-rape-trial-on-new-allegations-of-assault-and-wielding-a-knife-13502454",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-marius-borg-hoiby-norway_6751735.jpg?20250818164819",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-02 19:16:00",
        "Headline": "Marius Borg Hoiby, awaiting trial in Oslo on 38 charges, was detained on Sunday.",
        "Content": "The eldest son of Norway's crown princess has been arrested over new criminal allegations ahead of a trial on charges including rape. Marius Borg Hoiby, 29, the son of Crown Princess Mette-Marit, was detained on Sunday on suspicion of causing bodily harm, wielding a knife and violating a restraining order. Following the latest accusations, police said that they would seek permission from a judge to keep Hoiby in their custody for the next four weeks. Hoiby, the stepson of Crown Prince Haakon, was free but awaiting trial on four counts of rape, as well as domestic violence, assault and drug possession, among other crimes. He could face charges from the latest allegations on top of the 38 counts he already faces. They include rape, abuse in a close relationship against one former partner, acts of violence against another and transporting 3.5kg (7.7lbs) of cannabis, as well as making death threats and traffic violations. His lawyer has declined to comment on the new accusations. Hoiby does not admit criminal guilt for the charges of rape and domestic violence, but has admitted to some lesser crimes, and plans to give a detailed explanation in court, his lawyer previously said. His trial is due to last until 19 March. Read more from Sky News:Infantino sorry for 'joke' - and insists Trump deserved peace prizeCaptain found guilty of killing crew member in US tanker collision Hoiby has been under scrutiny since 2024, when police named him as a suspect of physical assault against a woman with whom he had been in a relationship. In a statement to the media at the time, Hoiby admitted to causing bodily harm to the woman while he was under the influence of cocaine and alcohol, and to damaging her apartment, saying he regretted his acts. Hoiby is the son of Crown Princess Mette-Marit from a previous relationship, and the stepson of the heir to the Norwegian throne, Crown Prince Haakon. He is outside the line of royal succession, and has no title. Last week, the crown prince said the royal house does not intend to comment during the proceedings. The trial is opening just as Hoiby's mother faces renewed scrutiny over her contacts with Jeffrey Epstein following the latest release of documents in the US."
    },
    {
        "title": "Iran heads for make or break this week over averting war with US",
        "description": "It's make or break this week for averting war between America and Iran.",
        "url": "https://news.sky.com/story/iran-heads-for-make-or-break-this-week-over-averting-war-with-us-13502269",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-tehran_7145993.jpg?20260126083301",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2026-02-02 11:48:00",
        "Headline": "The next seven days could lead to conflict between Iran, the US and its allies, or the start of a diplomatic breakthrough.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n It's make or break this week for averting war between America and Iran. The region is heading for a crunchpoint. The next seven days could lead to conflict between Iran, the US and its allies, or the start of a diplomatic breakthrough. It is likely to be one or the other. President Trump seems to believe the Iranian government is in a hole and can only get out if it makes a deal with him. To make sure of that, he has parked a massive amount of naval firepower off the coast of Iran. Is his calculation a sound one? Over the weekend, there were some signs from both sides of progress towards diplomacy. But more worryingly, both America and Iran were also talking tough. \"Hopefully we'll make a deal,\" the US president said over the weekend. If not, he warned, \"we have the biggest most powerful ships in the world over there\". \n                  Oscar-nominated screenwriter arrested in Iran days after criticising regime\n                 \n                  Iran summons EU ambassadors in protest at Revolutionary Guard terror listing\n                 \n                  Donald Trump 'hopeful' of Iran deal after Supreme Leader Ayatollah Ali Khamenei warns of 'regional conflict' if US attacks\n                 He was responding to fighting talk from the country's Supreme Leader, Ayatollah Ali Khamenei, who said: \"If America attacks or harms Iran, the Iranian nation will deliver a strong blow and any war started by America will spread across the region.\" That was a thinly veiled attack to drag the whole region into war should Iran come under fire. Attack us, and we will attack you and your friends, he was saying. Iranian missiles could play havoc with oil and gas installations in Gulf states, which could have profound economic consequences for the world. Fury over deadly protests Iranian authorities are certainly in a hole. The country is in economic freefall with runaway inflation and a plummeting currency. That has led to massive protests which were in turn crushed with astonishing brutality. The Iranian government claims it shot only at foreign agitators and Zionist agents but appears to have killed between ten and 50,000 of its own people with live gunfire in the process. Among the dead documented on video are small children, mothers, young students and ordinary citizens, gunned down on their own streets. Sources inside the country say the mood in Iran's major cities is subdued, simmering fury over the multiple massacres carried out by its state security services. The Iranian government will regard President Trump's demands as tantamount to capitulation. It insists its nuclear programme is only for civilian reasons, even if very few believe that claim. But giving up the programme is a red line for the ayatollahs. Airstrikes seem likely Giving in to American pressure could be fatal for what remains of the Iranian government's standing. It is equally hard to see the US president backing down if Iran does not comply. Read more:How many protesters were killed in Iran?Doctors share disturbing accounts of crackdown Airstrikes, therefore, seem increasingly likely at the very least. Will that strengthen the Iranian people's effort to topple their government? Or conversely will it give the government in Tehran the excuse to impose even more punishing repression. Impossible to say. We have not been here before. It is high noon once again in the region, fingers are on the trigger and one misstep could lead to repercussions which will be felt beyond the middle east."
    },
    {
        "title": "Reopening the Rafah crossing was, inevitably, not straightforward",
        "description": "It was inevitable, of course. How could anyone have thought that the reopening of the Rafah crossing could have been straightforward?",
        "url": "https://news.sky.com/story/xxxxx-13502391",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-egyptian-gaza-rafah_7153130.jpg?20260202104339",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2026-02-02 16:41:00",
        "Headline": "Of the many, many thousands of people in Gaza who require urgent medical attention, just five have managed to make it to Egypt to get help.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n It was inevitable, of course. How could anyone have thought that the reopening of the Rafah crossing could have been straightforward? Instead, having been told by Israeli authorities that the crossing was open for civilians at breakfast time, the sun was setting by the time anyone actually got across. And even then, it was only a handful of people who actually moved from Gaza to Egypt. On the one hand, this first day showed just how tight Israel's control remains. Of the many, many thousands of people in Gaza who require urgent medical attention, just five have managed to make it to Egypt to get help. Most of the applications to leave the Strip have, according to medical sources in Gaza, been refused so far. But on the other, more optimistic, hand, there are five people now receiving medical help that they desperately needed. Our colleagues went to Khan Younis this morning to meet the people allowed to travel, and their companions - the friends, family members or professionals allowed to journey with them. Among them was Ahmed, a frail young man who is living with a bullet lodged in his head. His father told us that the World Health Organisation had endorsed his desperate need for medical help on the basis that he cannot possibly get the operation he requires in Gaza. Even now, in a modern, well-resourced medical facility, the chances of success are put at 10%. But that is a sliver of hope where previously there had been none. The plan is to increase the numbers so that 50 patients are evacuated from Gaza each day. But even that figure is dwarfed by the need, by the huge numbers of people with a profound need for help. \"They're going to have to ramp up,\" says Sam Rose, director of affairs in Gaza for UNRWA, the UN agency that supports Palestinian refugees. \"We've got a backlog of almost 20,000 patients that need to get out. A lot of these people are critically ill and they don't have time on their hands. \"It's going to take months and months to clear that backlog unless we are able to increase the volume of people who are able to cross. 50 people is one coach-load so there's a hope that if this goes well, we will be able to see those numbers increasing.\" Rose, like others within the aid sector, is trying to see this limited reopening of the crossing as a cause for optimism. \"It's an incredibly complex and fragile moment, but the stakes are too high,\" he said. \"We have to be determined and we have to make sure this works, because if we fall back again into a cycle of conflict, the one thing that we do know is this is likely to be worse than the previous phases of conflict. \"So we have no choice but to make sure that this works.\" Read more from Sky News:China executes four over Myanmar-based gambling syndicateScreenwriter arrested in Iran days after criticising regime The way that ambition plays out will depend on the opinions of the Israeli government. The reopening of the crossing was, of course, baked into the US-led Gaza peace deal, and for many, its opening is well overdue. But it is part of a wider and more complex tapestry. Although the Rafah crossing straddles Gaza and Egypt, it is the Israelis who monitor people going in either direction, and they who carry out the security screening of everyone applying to cross. Israel can easily adjust the taps to increase - or even decrease - the flow of people. And what will affect that is an array of factors, emanating from its own security apparatus, Israeli politicians, Israeli voters - remember there's a general election later this year - other countries in the region and, crucially, from the office of President Trump."
    },
    {
        "title": "Oscar-nominated screenwriter arrested in Iran days after criticising regime",
        "description": "One of the screenwriters of an Oscar-nominated film has been arrested in Tehran days after signing a statement condemning Iranian leader Ayatollah Ali Khamenei and his regime's violent crackdown on protesters.",
        "url": "https://news.sky.com/story/oscar-nominated-screenwriter-arrested-in-iran-days-after-criticising-regime-13502248",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-mehdi-mahmoudian-it-was-just-an-accident_7153166.jpg?20260202111952",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-02 10:38:00",
        "Headline": "Mehdi Mahmoudian, who co-wrote the script for the Iranian drama It Was Just An Accident, was arrested on Saturday. It is not clear what he is charged with.",
        "Content": "One of the screenwriters of an Oscar-nominated film has been arrested in Tehran days after signing a statement condemning Iranian leader Ayatollah Ali Khamenei and his regime's violent crackdown on protesters. Mehdi Mahmoudian, who co-wrote the script for the Iranian drama It Was Just An Accident, was arrested on Saturday, representatives of the film said in a statement. It is unclear what he is charged with. In the statement, Mahmoudian and 16 others wrote: \"The mass and systematic killing of citizens who bravely took to the streets to bring an end to an illegitimate regime constitutes an organised state crime against humanity.\" Among the signatories were journalist Vida Rabbani and human rights activist Abdullah Momeni, who were also arrested. Mahmoudian's arrest comes just weeks before the Academy Awards in March, where It Was Just An Accident is nominated for best screenplay and best international film. It Was Just An Accident was filmed covertly in Iran and was inspired by director Jafar Panahi's most recent stint in prison, where he met Mahmoudian. He said his co-writer was \"a pillar\" to other prisoners. Panahi, who also signed the statement criticising the Iranian regime, condemned Mahmoudian's arrest. \n                  Iran heads for make or break this week over averting war with US\n                 \n                  Iran summons EU ambassadors in protest at Revolutionary Guard terror listing\n                 \n                  Donald Trump 'hopeful' of Iran deal after Supreme Leader Ayatollah Ali Khamenei warns of 'regional conflict' if US attacks\n                 He said the screenwriter was \"a rare moral presence... whose absence is immediately felt, both inside the prison walls and beyond them\". One of the most acclaimed international filmmakers, Panahi has made films through various states of imprisonment, house arrest and travel ban. Last year, he was again sentenced to a year in prison for \"propaganda activities against the system\". Despite the sentence, Panahi, who has been travelling internationally to promote the film, said he will return to Iran. The director previously spoke out about the recent crackdown on protesters by the Iranian government, calling it a \"savage massacre\". Estimates from human rights organisations and doctors on the number of people who were killed in the deadly protests range from over 5,000 at the conservative end to 33,000 by one count, and even as high as 50,000, according to one unverified claim."
    },
    {
        "title": "Is Cristiano Ronaldo on strike? The transfer story behind 'unhappy' £500,000-a-day star's absence",
        "description": "Cristiano Ronaldo appears to have gone on strike at his Saudi Arabian club.",
        "url": "https://news.sky.com/story/is-cristiano-ronaldo-on-strike-the-transfer-story-behind-unhappy-163500000-a-day-stars-absence-13502429",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ronaldo-cristiano_7153670.jpg?20260202185524",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-02 18:23:00",
        "Headline": "The forward, absent from Al Nassr's match on Monday, is reportedly unhappy with the way his Saudi Arabian club is being run.",
        "Content": "Cristiano Ronaldo appears to have gone on strike at his Saudi Arabian club. The Al Nassr forward, who reportedly earns £500,000 a day, was noticeably absent from his team's Saudi Pro League match against Al Riyadh on Monday. Ronaldo is reportedly unhappy with the way the club he plays for is being run, Sky Sports News reports. The 40-year-old is said to feel that other clubs that are also owned by Saudi Arabia's Public Investment Fund (PIF) are getting preferential treatment, especially in the transfer market. Second-placed Al Nassr are one of four Saudi Pro League clubs owned by PIF, the other three being Al Hilal, Al Ahli and Al Ittihad. Al Nassr beat Al Riyadh 1-0 without Ronaldo thanks to a goal from former Liverpool winger Sadio Mane. The story behind Ronaldo's absence Sky Sports News' chief correspondent Kaveh Solhekol said: \"The reason he didn't play is he's unhappy with the way Al Nassr have been run. \"He thought, in this [transfer] window, that the club would dig deep, bring in reinforcements and strengthen their squad. He feels that hasn't happened. \"And that's why he's effectively gone on strike.\" The Portugal international, who has repeatedly been ranked as one of the world's highest-paid athletes, reportedly became the first billionaire footballer last year. Read more from Sky News:Captain found guilty of killing crew member in North Sea collisionResident doctors vote to continue industrial action Ronaldo signed a two-year deal with Al Nassr in 2022 after leaving Manchester United following an explosive television interview in which he said that he felt \"betrayed\" by the Old Trafford club - and \"did not respect\" the team's then-manager, Erik ten Hag."
    },
    {
        "title": "Four Britons die within four months after holidaying in Cape Verde",
        "description": "Four Britons have died within four months of being struck down with stomach bugs while on holiday in Cape Verde, lawyers representing their families say.",
        "url": "https://news.sky.com/story/four-britons-die-within-four-months-after-holidaying-in-cape-verde-13502147",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-cape-verde-tourist_7152870.jpg?20260202021416",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-02 02:04:00",
        "Headline": "Law firm Irwin Mitchell says it is representing more than 1,500 people who fell ill after visiting the West African country, including six who died.",
        "Content": "Four Britons have died within four months of being struck down with stomach bugs while on holiday in Cape Verde, lawyers representing their families say. Elena Walsh, from Birmingham, Mark Ashley, from Bedfordshire, Karen Pooley, from Gloucestershire, and a 56-year-old man all died last year after contracting severe gastric illnesses while staying on the island country off the coast of West Africa. Law firm Irwin Mitchell is investigating their deaths, as well as the deaths of two other Britons who died on holiday there since January 2023. It says it is representing more than 1,500 people who have fallen ill after visiting Cape Verde. Ms Walsh, 64, died in August last year after falling ill during her stay at a resort on the island of Sal. Mr Ashley, who had diabetes but controlled through medication, fell ill three days into his holiday in October last year, with symptoms including stomach pain, diarrhoea, vomiting, fever, and extreme lethargy. His widow Emma told PA their family is in \"complete shock\" over his death. \"We went to Cape Verde expecting a relaxing break, but Mark became violently ill and never recovered,\" she said. Ms Ashley says they booked their trip with Tui, which cost more than £3,000. She first reported her husband's illness with Tui on 9 October, but his symptoms continued for some time upon their return to the UK. On 12 November, Mr Ashley collapsed in their home in Houghton Regis and was pronounced dead in hospital minutes later. Ms Pooley, 64, went on a two-week-long holiday in October last year that had also been booked through Tui and which cost more than £3,000. She fell sick four days into the trip with gastric symptoms, and the next day slipped on water leaking from a fridge while going to the bathroom early in the morning. She was airlifted to Tenerife for urgent care on 16 October and died the next day, her lawyers say. Her husband Andy told the Press Association his wife appeared to be in \"significant distress\" when her family video-called her from home, and claims communication from both the clinic and holiday provider was poor. \"We were desperate for updates while watching Karen get worse,\" he said. \"We're devastated and struggling to understand how she went on holiday and never came home.\" Read more from Sky News:Briton was trying to save friend when both died in Portugal, sister saysTourists left on drips after sickness bug Irwin Mitchell says Ms Pooley's initial death certificate from Cape Verde authorities shows she died of multiple organ failure, sepsis, cardio-respiratory arrest and a broken left leg. The two other Britons who have died while holidaying in Cape Verde since 2023 are Jane Pressley, who died aged 62 in January 2023 after falling ill during her holiday the previous November, and a man in his 60s who died in November 2024, who suffered gastric illness following a trip to the island country. Personal injury claims All six of the victims' families are making personal injury claims for damages against Tui. \"The number of holidaymakers to Cape Verde being struck down with serious and debilitating gastric illnesses is truly staggering. Nothing brings the gravity of this situation into sharper focus than these recent deaths,\" says Irwin Mitchell serious injury lawyer Jatinder Paul. \"In my experience, I'm used to supporting holidaymakers who have fallen ill at resorts across the globe, but I've never seen repeated and continued illness outbreaks at the same resorts on such a scale over such a period of time.\" He added: \"Understandably, those we represent have serious concerns about hygiene standards in Cape Verde. While nothing can make up for what's happened, we're determined to at least help establish the answers they deserve.\" The law firm has called for tour operators to work with local authorities to ensure the highest hygiene and safety standards are always upheld. Tui investigating claims A spokesperson for Tui says it is fully investigating the claims being made and ensures any customers who fall ill while on holiday have access to appropriate care and assistance. The holiday provider says sometimes individuals who fall ill do not report illness or seek support from them during their stay, which limits what they care they can offer."
    },
    {
        "title": "Trump to close Kennedy Center for two years - sparking more controversy over DC venue",
        "description": "Donald Trump has said the Kennedy Center will close for two years in plans that are fuelling the growing controversy over the Washington DC arts venue. ",
        "url": "https://news.sky.com/story/trump-to-close-kennedy-center-for-two-years-sparking-more-controversy-over-dc-venue-13502155",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-kennedy-center-trump-center_7114503.jpg?20251218194446",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-02 05:48:00",
        "Headline": "The president says the building is \"dilapidated\". But critics claim the closure is to deflect from cancellations that followed his decision to rename the memorial to JFK.",
        "Content": "Donald Trump has said the Kennedy Center will close for two years in plans that are fuelling the growing controversy over the Washington DC arts venue.  The national cultural centre opened in 1971 and was named after President John F. Kennedy by Congress as a \"living memorial\" to the assassinated president. Mr Trump angered many, including Kennedy family members, in December when the board he picked to run the venue backed a move to rename it the the Trump-Kennedy Center. A wave of cancellations by leading performers, musicians and groups including the Washington National Opera and composer Philip Glass, followed. Glass announced his decision to withdraw his Symphony No 15. 'Lincoln' was based on the values of the centre being in \"direct conflict\" with the message of the piece. Now Mr Trump has announced on social media that the historic venue will close on 4 July for construction for two years, subject to board approval, which comes just days after the premiere of his wife's documentary \"Melania\" was shown there. \"This important decision, based on input from many Highly Respected Experts, will take a tired, broken, and dilapidated Center, one that has been in bad condition, both financially and structurally for many years, and turn it into a World Class Bastion of Arts, Music, and Entertainment,\" the US president wrote on his Truth Social platform. Neither Trump nor Kennedy Center president Richard Grennell has provided evidence to back up claims about the building being in disrepair, despite Trump's pledge in October last year that it would remain open during renovations. Read more by Sky News: Why artists are boycotting Kennedy CenterTrump-handpicked board votes to rename Kennedy Center Grennell said he was grateful for Congress for finding $257 million for the building and said it would be a brief closure. \"It desperately needs this renovation and temporarily closing the Center just makes sense - it will enable us to better invest our resources, think bigger and make the historic renovations more comprehensive. It also means we will be finished faster,\" he said in a post on X. On Sunday night Maria Shriver, a member of the Kennedy family, posted on social media suggesting the closure of the venue was meant to deflect from the cancellations. She said that \"entertainers are canceling left and right\" and the president has determined that \"since the name change no one wants to perform there any longer.\" Kerry Kennedy, a niece of John F. Kennedy, has said in a social post on X that she will remove Trump's name herself with a pickax when his term ends."
    },
    {
        "title": "China executes four people over Myanmar-based scam and gambling syndicate",
        "description": "China has executed four people for causing the deaths of six people and running Myanmar-based scam and gambling operations worth more than $4bn, authorities said.",
        "url": "https://news.sky.com/story/china-executes-four-people-over-myanmar-based-scam-and-gambling-syndicate-13502173",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-china-execution-myanmar_7152947.jpg?20260202072425",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-02 06:41:00",
        "Headline": "They were accused of establishing industrial parks running gambling and telecom scam operations involving kidnappings, extortion, forced prostitution and drug manufacturing and trafficking in Myanmar's Kokang region, bordering China.",
        "Content": "China has executed four people for causing the deaths of six people and running Myanmar-based scam and gambling operations worth more than $4bn, authorities said. In November, five people, including members of the notorious Bai family, were sentenced to death for running a network of scam centres and casinos. The group's leader, Bai Suocheng, died from an illness after he was convicted. The Shenzhen Intermediate People's Court announced the executions of the other four defendants on Monday morning. They were accused of establishing industrial parks running gambling and telecom scam operations involving kidnappings, extortion, forced prostitution and drug manufacturing and trafficking in Myanmar's Kokang region bordering China. The group defrauded victims of more than 29bn yuan (£3.04bn) and caused the deaths of six Chinese citizens and injuries to others, according to a court statement, which labelled the group's crimes \"exceptionally heinous\". The group had initially appealed the verdict, but the Guangdong Provincial High People's Court dismissed the appeals. The announcement comes less than a week after the country executed 11 members of the Ming family for killing 14 people and running a crime syndicate worth more than £730m out of Myanmar. Scam parks have grown to an industrial-scale business in Southeast Asia, especially in Myanmar, Cambodia and Laos. Read more from Sky News:Russian drone strike on bus in Ukraine kills 12Trump 'hopeful' of Iran deal after regional conflict warning Authorities in the region face growing international pressure from China, the US and other nations to address the proliferation of criminal activity. In recent years, China executed more people than any other country - sometimes more than every other country in the world combined."
    },
    {
        "title": "Trump to close Kennedy Center for two years - sparking more controversy over DC venue",
        "description": "Donald Trump has said the Kennedy Center will close for two years in plans that are fuelling the growing controversy over the Washington DC arts venue. ",
        "url": "https://news.sky.com/story/trump-to-close-kennedy-center-for-two-years-sparking-more-controversy-over-dc-venue-13502155",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-kennedy-center-trump-center_7114503.jpg?20251218194446",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-02 05:48:00",
        "Headline": "The president says the building is \"dilapidated\". But critics claim the closure is to deflect from cancellations that followed his decision to rename the memorial to JFK.",
        "Content": "Donald Trump has said the Kennedy Center will close for two years in plans that are fuelling the growing controversy over the Washington DC arts venue.  The national cultural centre opened in 1971 and was named after President John F. Kennedy by Congress as a \"living memorial\" to the assassinated president. Mr Trump angered many, including Kennedy family members, in December when the board he picked to run the venue backed a move to rename it the the Trump-Kennedy Center. A wave of cancellations by leading performers, musicians and groups including the Washington National Opera and composer Philip Glass, followed. Glass announced his decision to withdraw his Symphony No 15. 'Lincoln' was based on the values of the centre being in \"direct conflict\" with the message of the piece. Now Mr Trump has announced on social media that the historic venue will close on 4 July for construction for two years, subject to board approval, which comes just days after the premiere of his wife's documentary \"Melania\" was shown there. \"This important decision, based on input from many Highly Respected Experts, will take a tired, broken, and dilapidated Center, one that has been in bad condition, both financially and structurally for many years, and turn it into a World Class Bastion of Arts, Music, and Entertainment,\" the US president wrote on his Truth Social platform. Neither Trump nor Kennedy Center president Richard Grennell has provided evidence to back up claims about the building being in disrepair, despite Trump's pledge in October last year that it would remain open during renovations. Read more by Sky News: Why artists are boycotting Kennedy CenterTrump-handpicked board votes to rename Kennedy Center Grennell said he was grateful for Congress for finding $257 million for the building and said it would be a brief closure. \"It desperately needs this renovation and temporarily closing the Center just makes sense - it will enable us to better invest our resources, think bigger and make the historic renovations more comprehensive. It also means we will be finished faster,\" he said in a post on X. On Sunday night Maria Shriver, a member of the Kennedy family, posted on social media suggesting the closure of the venue was meant to deflect from the cancellations. She said that \"entertainers are canceling left and right\" and the president has determined that \"since the name change no one wants to perform there any longer.\" Kerry Kennedy, a niece of John F. Kennedy, has said in a social post on X that she will remove Trump's name herself with a pickax when his term ends."
    },
    {
        "title": "New Andrew allegation must be investigated, says former Metropolitan Police chief",
        "description": "An allegation from a second woman that she was sent to Andrew Mountbatten-Windsor's home by Jeffrey Epstein \"does need to be investigated\", according to a former Metropolitan Police chief.",
        "url": "https://news.sky.com/story/new-andrew-allegation-must-be-investigated-says-former-metropolitan-police-chief-13502491",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-andrew-epstein_7118929.jpg?20251224200635",
        "type": "US",
        "Author": "Rhiannon Mills",
        "Date Published": "2026-02-02 20:35:00",
        "Headline": "There has been no public comment from Andrew since the latest allegations. He has always vehemently denied all claims against him.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n An allegation from a second woman that she was sent to Andrew Mountbatten-Windsor's home by Jeffrey Epstein \"does need to be investigated\", according to a former Metropolitan Police chief. The encounter allegedly took place at the Royal Lodge in Windsor in 2010, the former duke's residence at the time, when the woman was in her 20s, her lawyer told the BBC. Speaking to Sky News, Neil Basu, who was assistant commissioner from 2018-2021, said that the Met \"would have a legal duty to cooperate\" if the likes of the FBI come to them with fresh evidence of serious criminality relating to British subjects. US lawyer Brad Edwards has said he's been instructed by a woman who claims she was taken to Royal Lodge on the Windsor Estate in 2010. There has been no public comment from Andrew since the latest allegations. He has always vehemently denied all claims against him. The allegation was reported by the BBC the day after the latest drop of millions of files related to Jeffrey Epstein on Friday. British officers may help \n                  Andrew and Epstein: How will the royals respond? \n                 \n                  Andrew and Mandelson photos in Epstein files were taken inside US paedophile's homes, Sky News analysis finds\n                 \n                  Mandelson 'has no recollection' of Epstein giving him $75,000\n                 Talking about this latest allegation, Basu said British officers may be called upon for help. \"The FBI may be interested, and they may ask the Metropolitan Police for assistance, but there's certainly an allegation of very serious crime there,\" he said. \"So, it does need to be investigated, and I would expect the police, the British police, to be part of that.\" The latest release of documents has led to calls for the London force to open its own investigations into whether any crimes linked to Epstein were committed in the UK. Basu said the Met would be unlikely to be looking proactively through the documents themselves - but, asked if new revelations put added pressure on the force to act, Basu said they may end up legally compelled to do more. \"...certainly if they're asked to by the FBI, because they've uncovered serious criminality, and there may be British subjects involved, yes, it would put, whether, I wouldn't use the expression put pressure on it, it would be their legal duty to cooperate.\" Read more:Epstein file photos of Andrew and MandelsonEpstein was welcomed into Andrew's family fold He added that if there are requests to talk to Andrew or others named in the latest files, they wouldn't necessarily have to travel to the US to help authorities there. Explaining the procedure under which they may be spoken with, he said: \"There's a legal process called mutual legal assistance treaties… if we have a witness or a suspect who's living in the United Kingdom… if we think it's solid, we would help them with that. \"Most jurisdictions require the actual interview of the individual to be done by the host force, so in this case, by a British police force, probably the Metropolitan Police. \"So, the FBI could be present, but the British police would lead the investigation. There's no need for the former prince to travel. \"He could be interviewed in this country. And many people, you know, I won't be the first person to say that he should do that.\""
    },
    {
        "title": "Man in 'au pair affair' found guilty of double murder",
        "description": "An American man who was having an affair with his family's Brazilian au pair has been found guilty of murdering his wife and another man.",
        "url": "https://news.sky.com/story/man-in-au-pair-affair-found-guilty-of-double-murder-13502532",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brendan-banfield-peres-magalhaes_7134669.png?20260113220834",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-02 22:13:00",
        "Headline": "His family au pair pleaded guilty to manslaughter in 2024 and testified against her former lover at trial.",
        "Content": "An American man who was having an affair with his family's Brazilian au pair has been found guilty of murdering his wife and another man. Brendan Banfield, 40, from Virginia, told police he came across Joseph Ryan attacking his wife, Christine Banfield, with a knife on the morning of 24 February 2023. He shot Mr Ryan and then the au pair, Juliana Magalhaes, 25, shot him too. But officials told jurors the story was too good to be true, saying Banfield set Mr Ryan up in a scheme to get rid of his wife. It later emerged Banfield and Magalhaes had been having an affair. Magalhaes pleaded guilty to manslaughter in 2024 and testified against her former lover at trial. She said they had impersonated Ms Banfield, a paediatric intensive care nurse, on a website for sexual fetishes. They used the site to lure Mr Ryan to the house for a sexual encounter involving a knife, she said, staging the scene to look as though they had shot an intruder who was attacking Ms Banfield. Defence attorney John Carroll argued Magalhaes' testimony could not be trusted because she was cooperating with prosecutors in an attempt to avoid a long prison sentence. Banfield testified to say the testimony was \"absolutely crazy\". Read more from Sky News:Norway crown princess' son arrested ahead of rape charge trial'Humanity is cooked': AIs now have their own social network In her closing arguments, prosecutor Jenna Sands told the jury they did not have to rely solely on Magalhaes' testimony, pointed to a \"plethora of evidence\", including expert testimony that blood stains on Mr Ryan's hands suggested Ms Banfield's blood had been dripped onto him from above. Banfield faces the possibility of life in prison. Magalhaes was scheduled to be sentenced after his trial. Attorneys have said she could be allowed to walk free if she is sentenced to time served."
    },
    {
        "title": "Police investigating disappearance of US TV presenter Savannah Guthrie's mother",
        "description": "The disappearance of US TV host Savannah Guthrie's mother is being investigated, authorities have said.",
        "url": "https://news.sky.com/story/police-investigating-disappearance-of-us-tv-presenters-mother-13502515",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-nbc-us_7153881.jpg?20260202222009",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-02 21:45:00",
        "Headline": "Nancy Guthrie, 84, was last seen at her home near Tucson on Saturday night, Arizona police said.",
        "Content": "The disappearance of US TV host Savannah Guthrie's mother is being investigated, authorities have said. Nancy Guthrie was last seen at her home near Tucson, Arizona, on Saturday at around 9.30pm. The 84-year-old was reported missing by her family on Sunday after she did not attend church, according to police. On Monday, Chris Nanos, the Pima County sheriff, said: \"We don't see this as a search mission so much as it is a crime scene.\" Police believe she was abducted from her home while she slept, CBS reported. Savannah Guthrie is a co-anchor on the NBC News morning show Today on US television. Mr Nanos said Nancy Guthrie has limited mobility and that there were signs indicating she did not leave on her own. \"This one stood out because of what was described to us at the scene and what we located just looking at the scene,\" Mr Nanos said. \n                  Charlie Kirk's widow forgives his killer\n                 \n                  Charlie Kirk memorial to be held in Arizona stadium\n                 \n                  Missing toddler who walked 7 miles alone through wilderness is led to safety by dog\n                 He added that she lived alone, was of sound mind and requires daily medication. \"This is not dementia related,\" he said. \"She's as sharp as a tack. The family wants everyone to know that this isn't someone who just wandered off.\" Mr Nanos did not provide further details but urged people in the community \"to step up and start giving us some calls\". Read more from Sky News:Stars hit out at ICE at Grammy awardsTrump to close Kennedy Center for two years Monday's broadcast of the Today show began with an update on Ms Guthrie's disappearance. In a statement, Savannah Guthrie - who was absent from the show - thanked people for their continued support. \"On behalf of our family, I want to thank everyone for the thoughts, prayers and messages of support,\" she said. \"Right now, our focus remains on the safe return of our dear Nancy.\" Nancy Guthrie is described as being 5ft 5in tall, weighing 150lbs, with brown hair and blue eyes, according to her missing person's profile."
    },
    {
        "title": "Andrew and Mandelson photos in Epstein files were taken inside US paedophile's homes, Sky News analysis finds",
        "description": "Photos of Andrew Mountbatten-Windsor crouching over a woman were taken in Jeffrey Epstein's New York City mansion, while an image of Peter Mandelson in his underwear was taken in the paedophile financier's Paris flat, a Sky News analysis has found.",
        "url": "https://news.sky.com/story/andrew-mountbatten-windsor-and-peter-mandelson-pictures-from-epstein-files-were-taken-inside-paedophiles-homes-sky-news-analysis-finds-13502362",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jeffrey-epstein-andrew_7153481.jpg?20260203014721",
        "type": "US",
        "Author": "Ben van der Merwe",
        "Date Published": "2026-02-02 15:12:00",
        "Headline": "Sky News's Data and Forensics unit matched elements shown in the photos to details in images and videos to determine where they were taken.",
        "Content": "\n          Data journalist\n              @_bvdm\n Photos of Andrew Mountbatten-Windsor crouching over a woman were taken in Jeffrey Epstein's New York City mansion, while an image of Peter Mandelson in his underwear was taken in the paedophile financier's Paris flat, a Sky News analysis has found. Our Data and Forensics unit matched elements shown in the photos to details in images and videos to determine where they were taken. The photos of the former Duke of York in the Epstein files show him on all fours, bent over a young woman or girl. Follow live - Epstein files latest The photos are undated, and there is no suggestion of any wrongdoing. The image below shows a fuller picture of the room, with distinctive white panelling visible in the background. The same white panelling is visible in the photo below, showing Epstein having drinks with Woody Allen and an unidentified woman. The design of the door in the photo above matches that seen in another photo of Andrew in the room. We used the view out into the corridor to identify the exact location of the room within Epstein's New York mansion. The curved leg of a golden table, chequered flooring, and door design match those seen in photographs taken from the corridor adjoining Epstein's main stairwell. The room's distinctive white panelling is also visible in the far distance. In a statement issued on 17 October 2025, Andrew reiterated he \"vigorously\" denies the accusations against him. Read more:Lord Mandelson quits Labour Party over Epstein linksKey findings in Epstein files so farWho else features in photos? Picture of Mandelson taken in Epstein's Paris flat Sky News also confirmed the photo of Lord Mandelson in his underwear was taken in Epstein's Paris flat. A spokesperson for Lord Mandelson previously told Sky News: \"No one can say who or where the photo was taken. \"Lord Mandelson has absolutely no idea or indeed whether it has any connection to Epstein at all.\" Sky News' Data and Forensics unit was able to match the metal balcony railing visible in the window to that found in front of windows at Epstein's Paris home. We were also able to match the photo to the same room in which a video, also included in the Epstein files, was taken. The video shows two young women or girls dancing. In a still from the video, shown above, we can see a lamp and curtains matching those in the photo of Lord Mandelson, as well as the distinctive red panelling on the wall. Another photo taken in the same room shows a piece of paper on the desk with Jeffrey E Epstein printed at the bottom."
    },
    {
        "title": "Dragons' Den star Jones tees off with takeover of American Golf",
        "description": "Peter Jones, the entrepreneur and Dragons' Den judge, is close to teeing off with the addition of American Golf, the retail chain, to his array of business interests.",
        "url": "https://news.sky.com/story/dragons-den-star-jones-tees-off-with-takeover-of-american-golf-13502472",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-peter-jones-dragons-den_7153686.jpg?20260202185902",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-02-02 20:04:00",
        "Headline": "Peter Jones, a prolific amateur golfer, is in advanced talks to buy one of Britain's biggest specialist golf retailers eight years after it was rescued by the investment firm Endless, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Peter Jones, the entrepreneur and Dragons' Den judge, is close to teeing off with the addition of American Golf, the retail chain, to his array of business interests. Sky News has learnt that Mr Jones is in advanced talks to buy American Golf from Endless, its long-standing private equity backer. Mr Jones, a keen golfer who is understood to play off a handicap of eight, has invested in a string of British companies, including the camera retailer Jessops, which he bought in 2013. His current portfolio includes Localised, an e-commerce platform for consumer brands, and Levi Roots, founder of the Reggae Reggae Sauce brand. Industry sources said that Mr Jones, who has also featured regularly in the Alfred Dunhill Championship, the prestigious pro-am tournament, was keen to grow American Golf's online presence and sales. The chain, which trades from about 80 stores, has been owned by Endless since a rescue deal in 2018. Last summer, Sky News revealed that Endless had appointed corporate financiers from Alvarez & Marsal to handle a sale of the business. \n                  Elon Musk's SpaceX buys Elon Musk's xAI\n                 \n                  Gold and silver take a hammering in major market shifts\n                 \n                  Petrol station rule change could save drivers up to £4.50 per tank | Money blog\n                 One insider said a deal could be announced as soon as this week. American Golf, which has a workforce of several hundred people, sells products manufactured by leading golf brands such as Garmin and TaylorMade. The value of the deal being negotiated between Mr Jones and Endless was unclear on Monday evening. Mr Jones, whose eponymous charitable foundation has raised tens of millions of pounds to provide young people with experience of enterprise, is understood to have expressed an interest in acquiring American Golf several months ago. He is the only one of the original Dragons' Den judges to have remained in place since its inaugural series was broadcast by the BBC in 2005. American Golf was previously owned by Sun European Partners, another investment firm, which had acquired it from LDC, the private equity division of Lloyds Banking Group. Mr Jones, Endless and A&M all declined to comment."
    },
    {
        "title": "Gold and silver take a hammering in major market shifts",
        "description": "Gold and silver costs took further punishment early on Monday following the record routs seen at the end of last week.",
        "url": "https://news.sky.com/story/gold-and-silver-take-a-hammering-in-major-market-shifts-13502158",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gold-bars-bullions_6889135.jpg?20250417160922",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2026-02-02 06:03:00",
        "Headline": "Precious metals, oil and cryptocurrencies are among the assets suffering badly on Monday as part of a broad-based sell-off.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Gold and silver costs took further punishment early on Monday following the record routs seen at the end of last week. Both precious metals had stood at record values on Thursday but fell sharply after Donald Trump revealed his nomination for the chair of the US central bank. The announcement on Friday that he wanted Kevin Warsh to succeed Jay Powell from May calmed market nerves over Federal Reserve independence. Money latest: MP shares secrets of the job This was seen to the greatest extent in so-called safe haven gold and silver prices, which suffered their worst day since 1983 and 1980 respectively by the US close on Friday night. The declines continued on Monday, with spot gold down by a further 7%. Silver was almost 11% down after its 30% fall in the previous session. Market analysts said this was partly due to the fact that some brokerages were increasing their margin requirements - raising the minimum amount of money investors must deposit to open or maintain leveraged positions. \n                  Elon Musk's SpaceX buys Elon Musk's xAI\n                 \n                  Dragons' Den star Jones tees off with takeover of American Golf\n                 \n                  Petrol station rule change could save drivers up to £4.50 per tank | Money blog\n                 Such a move during a period of volatility is generally negative for an investor's contracts and some were having to sell other assets to cover higher gold and silver margin calls. Gold stood at $4,480 per ounce and silver at $73.94 early on Monday morning in Asia dealing but recovered some poise as the markets shifted to Europe with the day's losses substantially reduced. Each had reached record highs of $5,594.82 and $121.64 respectively during the rally that preceded the sell-off. Cryptocurrencies have also had a rough ride since Friday. Bitcoin dropped below $80,000 for the first time since April during the weekend and stood at $75,142. Brent crude oil, which was trading at $70 a barrel last week, was at $65. The hits were reflected in stock market values in Europe after sharp declines in Asia, where the Hang Seng in Hong Kong closed the day 2.3% down. The FTSE 100 - home to many precious metal mining and energy stocks - was 0.5% down in early dealing but later turned positive as investors sought out healthcare and financials and gold and silver costs recovered some of the ground lost earlier in the day. Analysts widely stated that they expected the correction for the metals to be temporary given that uncertainties continued to loom large over the global economy. Ipek Ozkardeskaya, senior analyst at Swissquote, said many of the market shifts were being driven by the known views of Mr Warsh, including his past criticism of Fed policy decisions. \"He is expected to favour balance sheet reduction for bringing inflation down. And there is scope to shrink the Fed's balance sheet substantially! \"Before 2008, the balance sheet stood below $1 trillion, peaked near $9 trillion in 2022, and now sits around $6.5 trillion. \"That could mark the end of the era of free money for markets - and that is bad news\", she wrote in a note."
    },
    {
        "title": "Former TikTok employee accuses company of bullying, harassment and union busting",
        "description": "\"There was lots of bullying, harassment, exclusion from the team, from projects. A lot of things were going on.\"",
        "url": "https://news.sky.com/story/former-tiktok-employee-accuses-company-of-bullying-harassment-and-union-busting-13501080",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lynda-tiktok_7150597.png?20260130155902",
        "type": "Business",
        "Author": "Mickey Carroll",
        "Date Published": "2026-02-02 00:01:00",
        "Headline": "Along with four of her former colleagues, Lynda Ouazar is launching legal action against TikTok. This is the second court case TikTok is facing from former UK employees in recent months.",
        "Content": "\n          Science and technology reporter\n       \"There was lots of bullying, harassment, exclusion from the team, from projects. A lot of things were going on.\" For the first time, former TikTok worker Lynda Ouazar is speaking out to expose what she says was an environment of bullying, harassment and union busting at one of the world's biggest social media companies. \"I was finding it really hard to sleep at night, having flashbacks, feeling tired, losing my motivation,\" she tells Sky News. Along with three of her former colleagues, she is now launching legal action against TikTok. This is the second court case the video app is facing from former UK employees in recent months. Lynda started at the company as a moderator and then as a quality control worker, checking the work of external agency moderators. At first, she enjoyed the job and found it rewarding. But then, she was moved on to a workflow dealing with some of the most extreme content posted on TikTok. \n                  How one teenager's death could change the way social media law works\n                 \n                  US and China finalise deal to sell TikTok's American business \n                 \n                  Mother suing TikTok over son's death describes 'deeply painful' hearing\n                 \"You don't want to see children being sexually assaulted, you don't want to see women going through all kinds of abuse, you don't want to see people self-harming, [...] using slur words all day long. \"It affected me.\" Despite the type of content she was watching day in, day out, Lynda says there wasn't much support to keep moderators safe, and to ensure they were able to moderate TikTok's content effectively. TikTok does tell moderators to take breaks when they need them and offers a mental health support platform. But Lynda, and other moderators that Sky News has spoken to recently, say that in practice, they did not feel supported. Instead, they felt pressured to work faster and harder, no matter how disturbing the content. \"You are monitored by AI all day long,\" she says. This accusation that moderators are constantly monitored and feel pressured is something Sky News has previously been told by other moderators at the company. \"Moderators find themselves pressurised to deliver, so they have to carry on, even if you see something which really affects you and you feel like you have tears in your eyes,\" says Lynda. \"Sometimes you cry but then you carry on working because you have to reach those targets. Otherwise, your bonus will be affected, your job security, your salary, everything will be affected.\" She says that pressure has a direct impact on user safety. \"When you work under pressure and you are under speed and you make errors, it means that things that should not be in the platform are actually still there. \"It's not good for the moderators, it is not good for the users of the platform.\" That being said, according to its latest transparency report, TikTok removes more than 99% of harmful content before it is reported. According to data gathered for the EU's Digital Services Act, it also has the lowest error rates and highest accuracy rates in moderation among all major social media platforms. Read more:How one boy's death could change the way social media law worksUS and China finalise deal to sell TikTok's American businessTikTok faces legal action over moderator cuts After two years at TikTok, Lynda joined the United Tech and Allied Workers (UTAW) union and became a union rep. This is when she started to feel like she was being bullied and harassed and believes it was because of her union membership. \"It took me some time, I would say a few months, to see the pattern.\" She says as well as facing exclusion and bullying, her performance was downgraded from the highest possible rating to the lowest - but wasn't given a proper explanation as to why, even when she raised a grievance. \"Other employees who [previously] had no problems at all, which I helped recruit to become union members, also started going through the same pattern as myself.\" When TikTok began a major restructuring programme to change how it moderates content last year, Lynda's team were told they were at risk. Of the 24 people at risk of redundancy, 11 lost their jobs. According to the lawsuit, all of them had been openly involved in union activity at TikTok. Stella Caram, head of legal at Foxglove, is helping to represent the former workers in the legal case. \"In this case specifically, we want compensation for the workers. They have been unlawfully dismissed because they were engaging with union activities,\" she tells Sky News. \"We wanted to make this a precedent because we've seen a lot of this happening across the world.\" TikTok told Sky News: \"We strongly reject these baseless and inaccurate claims. \"We have made ongoing enhancements to our safety technologies and content moderation, which are borne out by the facts: a record rate of violative content removed by automated technology (91%) and record volume of violative content removed in under 24 hours (95%).\" Eleanor Payne from UTAW said: \"TikTok workers in London have been unionising for three years and aren't about to stop. \"TikTok have once again been caught using unlawful redundancy in a futile attempt to stop workers unionising for a stronger voice at work. TikTok can play union-busting whack-a-mole all they like but, ultimately, it's a losing game. UTAW members know that by sticking together they'll win in the end.\""
    },
    {
        "title": "Revealed: The most likely pay rises in 2026",
        "description": "Staff are most likely to see their pay rise by the same amount as last year, new data shows.",
        "url": "https://news.sky.com/story/revealed-the-most-likely-pay-rises-in-2026-13502314",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-banknotes-money_7153300.jpg?20260202130021",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-02-02 12:56:00",
        "Headline": "New data shows bosses' intentions across a range of pay rise brackets.",
        "Content": "Staff are most likely to see their pay rise by the same amount as last year, new data shows. Some 44% of bosses intend to award a similar wage increase, while 28% will compensate employees more generously. Another 28% say their workers face a smaller pay rise than last year. The figures come from a survey of 121 firms - employing 2.8 million people - carried out by Incomes Data Research (IDR). The findings indicate more than three-fifths of pay awards are likely to be worth between 3% and 3.99%. \"Inflation is currently higher than it was a year ago and this has applied upward pressure on pay to some extent and the findings from our poll show that inflation continues to figure relatively highly in employers' concerns,\" says Zoe Woolacott from IDR."
    },
    {
        "title": "Four Britons die within four months after holidaying in Cape Verde",
        "description": "Four Britons have died within four months of being struck down with stomach bugs while on holiday in Cape Verde, lawyers representing their families say.",
        "url": "https://news.sky.com/story/four-britons-die-within-four-months-after-holidaying-in-cape-verde-13502147",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-cape-verde-tourist_7152870.jpg?20260202021416",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-02-02 02:04:00",
        "Headline": "Law firm Irwin Mitchell says it is representing more than 1,500 people who fell ill after visiting the West African country, including six who died.",
        "Content": "Four Britons have died within four months of being struck down with stomach bugs while on holiday in Cape Verde, lawyers representing their families say. Elena Walsh, from Birmingham, Mark Ashley, from Bedfordshire, Karen Pooley, from Gloucestershire, and a 56-year-old man all died last year after contracting severe gastric illnesses while staying on the island country off the coast of West Africa. Law firm Irwin Mitchell is investigating their deaths, as well as the deaths of two other Britons who died on holiday there since January 2023. It says it is representing more than 1,500 people who have fallen ill after visiting Cape Verde. Ms Walsh, 64, died in August last year after falling ill during her stay at a resort on the island of Sal. Mr Ashley, who had diabetes but controlled through medication, fell ill three days into his holiday in October last year, with symptoms including stomach pain, diarrhoea, vomiting, fever, and extreme lethargy. His widow Emma told PA their family is in \"complete shock\" over his death. \"We went to Cape Verde expecting a relaxing break, but Mark became violently ill and never recovered,\" she said. Ms Ashley says they booked their trip with Tui, which cost more than £3,000. She first reported her husband's illness with Tui on 9 October, but his symptoms continued for some time upon their return to the UK. On 12 November, Mr Ashley collapsed in their home in Houghton Regis and was pronounced dead in hospital minutes later. Ms Pooley, 64, went on a two-week-long holiday in October last year that had also been booked through Tui and which cost more than £3,000. She fell sick four days into the trip with gastric symptoms, and the next day slipped on water leaking from a fridge while going to the bathroom early in the morning. She was airlifted to Tenerife for urgent care on 16 October and died the next day, her lawyers say. Her husband Andy told the Press Association his wife appeared to be in \"significant distress\" when her family video-called her from home, and claims communication from both the clinic and holiday provider was poor. \"We were desperate for updates while watching Karen get worse,\" he said. \"We're devastated and struggling to understand how she went on holiday and never came home.\" Read more from Sky News:Briton was trying to save friend when both died in Portugal, sister saysTourists left on drips after sickness bug Irwin Mitchell says Ms Pooley's initial death certificate from Cape Verde authorities shows she died of multiple organ failure, sepsis, cardio-respiratory arrest and a broken left leg. The two other Britons who have died while holidaying in Cape Verde since 2023 are Jane Pressley, who died aged 62 in January 2023 after falling ill during her holiday the previous November, and a man in his 60s who died in November 2024, who suffered gastric illness following a trip to the island country. Personal injury claims All six of the victims' families are making personal injury claims for damages against Tui. \"The number of holidaymakers to Cape Verde being struck down with serious and debilitating gastric illnesses is truly staggering. Nothing brings the gravity of this situation into sharper focus than these recent deaths,\" says Irwin Mitchell serious injury lawyer Jatinder Paul. \"In my experience, I'm used to supporting holidaymakers who have fallen ill at resorts across the globe, but I've never seen repeated and continued illness outbreaks at the same resorts on such a scale over such a period of time.\" He added: \"Understandably, those we represent have serious concerns about hygiene standards in Cape Verde. While nothing can make up for what's happened, we're determined to at least help establish the answers they deserve.\" The law firm has called for tour operators to work with local authorities to ensure the highest hygiene and safety standards are always upheld. Tui investigating claims A spokesperson for Tui says it is fully investigating the claims being made and ensures any customers who fall ill while on holiday have access to appropriate care and assistance. The holiday provider says sometimes individuals who fall ill do not report illness or seek support from them during their stay, which limits what they care they can offer."
    },
    {
        "title": "Premium gyms group Third Space limbers up for £700m sale",
        "description": "The owner of Third Space, the premium London health clubs operator, is limbering up for a sale that could value it at about &#163;700m.",
        "url": "https://news.sky.com/story/premium-gyms-group-third-space-limbers-up-for-163700m-sale-13502229",
        "image_url": "https://e3.365dm.com/22/08/1920x1080/skynews-1315221985-gym-arm-curls_5865397.jpg?20230602103245",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-02-02 09:37:00",
        "Headline": "The luxury health and fitness group, which was bought by KSL Capital Partners in 2021, is in talks with prospective advisers about an auction of the business, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of Third Space, the premium London health clubs operator, is limbering up for a sale that could value it at about £700m. Sky News has learnt that KSL Capital Partners, the American private equity firm, has been holding talks with prospective advisers about an auction that would kick off either this year or next. City sources said investment banks including Goldman Sachs were in the frame to oversee the sale process. Money latest: Big rise in pensioners living in flat shares Third Space operates 15 clubs across the capital, including sites in the City and Soho. They are positioned at the luxury end of the gyms market, offering HYROX, hot yoga and dozens of other classes to members. KSL acquired a stake in the business in 2021, acquiring a majority stake from Encore Capital, another investment firm. \n                  Elon Musk's SpaceX buys Elon Musk's xAI\n                 \n                  Dragons' Den star Jones tees off with takeover of American Golf\n                 \n                  Gold and silver take a hammering in major market shifts\n                 Last October, Third Space secured £75m in debt finance from Oaknorth, alongside Searchlight Capital, another existing lender, to help fund its expansion. \"We are seeing exceptionally strong demand for Third Space memberships, with most of our clubs operating with waiting lists,\" Colin Waggett, chief executive, said last autumn. \"Our business sits at the heart of Londoners' desire for health and fitness, authentic experiences and luxury service, and Third Space is uniquely positioned to meet these demands.\" KSL and Goldman declined to comment."
    },
    {
        "title": "Epstein files: Police reviewing misconduct claims after Mandelson accused of leaking sensitive information",
        "description": "Sir Keir Starmer is set to chair a cabinet meeting today as police assess allegations his former US ambassador Lord Mandelson leaked sensitive information from the heart of government to Jeffrey Epstein.",
        "url": "https://news.sky.com/story/starmer-believes-mandelson-should-not-be-a-member-of-the-lords-says-no-10-13502252",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-mandelson-epstein_7153944.jpg?20260203012419",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-02 10:45:00",
        "Headline": "Following fresh revelations about the former business secretary's relationship with the paedophile financier, Downing Street is facing calls to strip him of his peerage.",
        "Content": "Sir Keir Starmer is set to chair a cabinet meeting today as police assess allegations his former US ambassador Lord Mandelson leaked sensitive information from the heart of government to Jeffrey Epstein. The Met are investigating allegations of misconduct in public office after emails appeared to show conversations between the ex-cabinet minister and paedophile financier about political matters, while the former was serving as business secretary in Gordon Brown's government back in 2009. Ella Marriott, commander of the Met, said: \"The reports will all be reviewed to determine if they meet the criminal threshold for investigation.\" Tap here for the latest on the Epstein files The messages were revealed as part of the latest tranche of Epstein files released by the US Justice Department. Sir Keir, who sacked Mandelson as the government's Washington ambassador last year over his ties to the billionaire, has called on Lord Mandelson to quit the House of Lords and testify to an inquiry by the US Congress. The prime minister has suggested Andrew Mountbatten-Windsor should also give evidence. Late last night, it was announced Bill and Hillary Clinton had agreed to testify. They hope doing so will set \"a precedent that applies to everyone\", the former president's deputy chief of staff said. Being named in the Epstein files is not a sign of wrongdoing, and Lord Mandelson, Mr Mountbatten-Windsor and the Clintons have all expressed regret about their past ties to the paedophile. Lord Mandelson has not responded to the latest allegations. However, in an interview with The Times carried out last week but published on Monday, he referred to a \"handful of misguided historical emails, which I deeply regret sending\", and described Epstein as \"muck that you can't get off your shoe\". What are the latest Mandelson claims? In the latest tranche of Epstein files released by the US Justice Department, emails appear to show Lord Mandelson giving Epstein advance notice of a €500bn EU bank bailout in 2010. Mandelson was emailed by Epstein, who wrote: \"Sources tell me 500 b euro bailout , almost complete (sic).\" He then appears to reply: \"Sd be announced tonight\". Epstein then asks if he is home, to which Mandleson replies: \"Just leaving No10... will call\". The €500bn deal was approved the next day by European governments as they tried to pull the currency through the 2010 \"Eurozone\" crisis - where countries such as Greece, Portugal, Ireland, and Cyprus were unable to repay or refinance their government debt. The UK did not contribute to the bailout. However, the then chancellor Alistair Darling was present in Brussels for the negotiations. Read more on this story:Sarah Ferguson's charity to close Other emails appear to show Lord Mandelson telling Epstein he was \"trying hard\" to change government policy on bankers' bonuses at his request, months after the convicted sex trafficker had paid tens of thousands of pounds to the peer's husband. The emails came at the time the so-called \"super tax\" was being introduced by Mr Darling to clamp down on bank profits being used to pay large bonuses for bankers after the financial crisis. One discussion indicates Lord Mandelson encouraged JP Morgan's boss Jamie Dimon to call Mr Darling and \"mildly threaten\" him. Separately, the peer also appeared to write to Epstein in June 2009 about an \"interesting note that's gone to the PM\", forwarding an assessment by Mr Brown's adviser Nick Butler of potential policy measures including an \"asset sales plan\". Mr Brown condemned the \"wholly unacceptable disclosure of government papers and information during the period when the country was battling the global financial crisis\", and said he had asked the Cabinet Office to investigate. Pressure over peerage Sir Keir Starmer has asked Cabinet Secretary Sir Chris Wormald - the UK's most senior civil servant - to \"urgently\" review all available information on contact between Lord Mandelson and Epstein. The prime minister's spokesperson also said Sir Keir believed Lord Mandelson \"should not be a member of the House of Lords or use the title\". However, the government does not have the power to strip him of his peerage, and wants to work with the Lords to modernise disciplinary procedures to make it easier to remove disgraced peers. The latest revelations about Peter Mandelson's relationship with paedophile financier Jeffrey Epstein have led to calls for his peerage to be stripped. But is it possible for a life peerage to be removed? The short answer is yes - but it is not a simple process. A peerage is created by letters patent, which is a legal document issued by the monarch that is used to show their approval of state documents. Halsbury's Laws of England, which is an encyclopaedia of the law in England and Wales, explains that once a peerage is created, the monarch does not have the power to cancel it. Currently, the only way to remove a peerage entirely is through legislation that becomes an Act of Parliament - and it has previously been done. In 1917, legislation entitled the Titles Deprivation Act 1917 was passed to strip peerages from \"enemies\" of the UK during the First World War. It removed them from anyone who had \"during the present war, borne arms against His Majesty or His Allies, or who [had] adhered to His Majesty’s enemies\". The legislation meant that any peer suspected of assisting an enemy could be investigated by a committee of the Privy Council, and a report would be produced. If no one objected to the report within 40 days, the peerage would be stripped - and there are four people recorded to have lost their titles as a result of the process. While that law remains in force, it referred specifically to the First World War, and therefore it is highly unlikely it could apply today. So while Sir Keir Starmer's government has previously said that an \"act of parliament is required to remove a peerage once conferred\", it would seem to be quite a lengthy process, and in the case of Lord Mandelson, the prime minister would like it to happen quickly. The government is calling on the House of Lords to work with them to \"modernise\" the process for removing peers. Could Mandelson give up his peerage voluntarily? No - a peerage cannot be given up once accepted. But he could resign from the House of Lords - meaning he would not be able to sit on its red benches, vote, or participate in any parliamentary business - and decide not to use his title, which appears to be No 10's preferred option. Darren Jones, chief secretary to the prime minister, said the government was writing to the appropriate authorities to start the process. Sky News has approached representatives for Lord Mandelson for comment on the leaking of sensitive information claims. In a statement about previous allegations, he said: \"I was wrong to believe Epstein following his conviction, and to continue my association with him afterwards. I apologise unequivocally for doing so to the women and girls who suffered.\" What else have the files revealed?  Lord Mandelson was sacked as the ambassador to Washington last year after details emerged of his continued contact with the financier after Epstein's guilty plea in 2008 to soliciting prostitution and soliciting a minor. In files released over the weekend, bank statements from 2003 and 2004 appeared to show Lord Mandelson received payments totalling $75,000 (£54,000) from the financier, while he was the MP for Hartlepool. Epstein is also said to have paid for an osteopathy course for Lord Mandelson's husband in 2009. Lord Mandelson resigned his membership of the Labour Party on Sunday night. He denied any record or recollection of the payments, but said he did \"not wish to cause further embarrassment to the Labour Party\". The New Labour grandee has also appeared in a picture found in the files wearing only his underwear and a t-shirt, which Sky News has confirmed was taken in Epstein's Paris flat. A spokesperson for Lord Mandelson previously told Sky News: \"No one can say who or where the photo was taken. Lord Mandelson has absolutely no idea or indeed whether it has any connection to Epstein at all.\""
    },
    {
        "title": "Did he jump or was he pushed? Either way, Mandelson had no alternative but to resign",
        "description": "In the end, it was a scandal too far, even for Peter Mandelson.",
        "url": "https://news.sky.com/story/did-he-jump-or-was-he-pushed-either-way-mandelson-had-no-alternative-but-to-resign-13502143",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-peter-mandelson-washington_7017390.jpg?20260201224739",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2026-02-02 00:03:00",
        "Headline": "The resignation must have been a horrible wrench as well as a humiliation for Lord Mandelson, who had - as he lamented - dedicated his life to the party.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n In the end, it was a scandal too far, even for Peter Mandelson. The latest explosive Epstein revelations have forced him to resign from his beloved Labour Party, he says, to save the party from \"further embarrassment\". It's difficult to imagine what could be more embarrassing than this weekend's disclosure of alleged payments by Jeffrey Epstein to his partner, claims of lobbying a Labour chancellor on tax policy, and being photographed wearing nothing more than a T-shirt and a pair of underpants. Announcing his resignation from the party on Sunday evening, he challenged some of the allegations in the Epstein files and repeated his claim that he had no record or recollection of the payments to his now husband. He said he had written to Hollie Ridley, general secretary of the Labour Party, to say he was stepping down from his party membership. But did he jump or was he pushed? Even if Sir Keir Starmer didn't demand his resignation, such an astute political operator as Lord Mandelson could see he couldn't remain in the party, and he had no alternative but to resign. In his resignation letter, he wrote: \"I have been further linked this weekend to the understandable furore surrounding Jeffrey Epstein and I feel regretful and sorry about this. \n                  Andrew and Mandelson photos in Epstein files were taken inside US paedophile's homes, Sky News analysis finds\n                 \n                  Epstein files: Police reviewing misconduct claims after Mandelson accused of leaking sensitive information\n                 \n                  Mandelson 'has no recollection' of Epstein giving him $75,000\n                 \"Allegations which I believe to be false that he made financial payments to me 20 years ago, and of which I have no record or recollection, need investigating by me. \"While doing this I do not wish to cause further embarrassment to the Labour Party and I am therefore stepping down from membership of the party.\" He added: \"I want to take this opportunity to repeat my apology to the women and girls whose voices should have been heard long before now. \"I have dedicated my life to the values and success of the Labour Party and in taking my decision I believe I am acting in its best interests.\" His resignation came only hours after the Tory leader, Kemi Badenoch, called on the PM to suspend his membership of the party and launch an investigation into the financial allegations. 'Completely disgraced' And the Conservatives responded to his resignation with a further attack, a spokesman claiming: \"Lord Mandelson is completely disgraced. \"Yet Keir Starmer lacked the backbone to take action, allowing Mandelson to resign from the Labour Party instead of kicking him out. \"Keir Starmer and his chief of staff appointed Mandelson ambassador despite his relationship with Epstein and then refused to act even as the mountain of evidence against him grew. \"Given the prime minister's appalling lack of judgment and the participation of his Downing Street operation, there must now be a full and thorough independent investigation.\" But the resignation must have been a horrible wrench as well as a humiliation for Lord Mandelson, who had - as he lamented - dedicated his life to the party. A scandal-tainted career Indeed, he was born into the Labour Party. His grandfather was Herbert Morrison, one of the giants of Clement Attlee's post-war government. But it was his attraction to the rich and famous and his fondness for the trappings of wealth that brought about what will be the final downfall of his scandal-tainted career. He famously told tech executives when he was Sir Tony Blair's trade and industry secretary in 1998: \"We are intensely relaxed about people getting filthy rich.\" Then, acutely aware of the risk of damaging headlines, the former spin doctor known as the \"Prince of Darkness\", added hurriedly: \"As long as they pay their taxes.\" His final demise comes just months after Sir Keir was forced to sack him from the top diplomatic post of UK ambassador to the US over his association with the convicted sex offender Epstein. But Epstein was by no means the first Mandelson scandal. He had to resign from Sir Tony's cabinet twice, first over an undeclared bank loan and then over intervening in a passport application by a top Indian businessman. A controversial and divisive figure Over four decades, nearly all on the frontline of British politics, he was a consummate political networker, but also one of the most divisive figures in public life and his appointment as ambassador was seen by critics as an act of cronyism by Sir Keir. Acknowledging that Lord Mandelson - awarded a peerage in 2008 by Gordon Brown - was a controversial and divisive figure, Sir Tony declared in 1996: \"My project will be complete when the Labour Party learns to love Peter Mandelson.\" Read more:Lord Mandelson quits Labour Party over Epstein linksMandelson 'has no recollection' of Epstein giving him $75,000Mandelson apologises for continuing friendship with Epstein The Washington role is seen as the most glittering and important diplomatic post in the UK government. The perks of the job include the luxurious ambassador's residence in Massachusetts Avenue, a magnificent Queen Anne mansion designed by top architect Sir Edwin Lutyens. When he appointed him as ambassador, Sir Keir saw Lord Mandelson as a skilful and persuasive link to the president, with his trade experience from his time as a cabinet minister and Brussels commissioner a vital qualification for the job. Never one for false modesty, Lord Mandelson claimed that when he first walked into the Oval Office the president said to him: \"God, you're a good-looking fellow, aren't you?\" Diplomatic triumphs Lord Mandelson was credited with several diplomatic triumphs in Washington. He played a vital role in ensuring the UK escaped the worst of Trump's tariffs and he was instrumental in securing a much sought-after trade deal between the UK and the US. And his silky PR skills were displayed when during Sir Keir's first visit to the White House in February, the PM theatrically pulled out of his inside pocket a letter from King Charles inviting the US president to visit the UK. It was a classic Lord Mandelson stunt and confirmed he'd lost none of the flair for presentation he'd first deployed when he was Labour leader Neil Kinnock's spin doctor in the 1980s. Lord Mandelson's high-profile political career began as a TV producer until his appointment as Labour's director of communications under Kinnock in 1985. He was seen as a brilliant if ruthless spin doctor, who masterminded the birth of New Labour but would berate newspaper editors when unfavourable stories were written by their political journalists. Another classic Lord Mandelson attempt to kill an embarrassing story was to tell the journalist who wrote or broadcast it in a sneering voice: \"That is a story that I believe will remain an exclusive.\" He became MP for Hartlepool in 1992 and helped propel Sir Tony to the leadership of the party after John Smith's death in 1994, a move that led to a bitter feud with Mr Brown. There's an amusing story about Mandelson in Hartlepool, which he claimed is a myth and blames Kinnock for. It's claimed he ordered \"some of that delicious guacamole\" in a fish and chip shop, mistaking mushy peas for avocado dip. It was a perfect Mandelson story, ridiculing his metropolitan tastes and ignorance of working-class life. But he claims the mistake was made by a young American woman student who was helping Labour's campaign. 'I'm a fighter, not a quitter' His first cabinet job, trade and industry secretary in 1998, lasted only five months after he was forced to quit after failing to declare a home loan from Labour millionaire Geoffrey Robinson to his building society. His resignation was similar in one respect to the demise of former deputy prime minister Angela Rayner last year, in that it was over irregularities in buying a property: in Hove in her case, in fashionable Notting Hill in his. He bounced back as Northern Ireland secretary in 1999 and was said to enjoy the luxury of Hillsborough Castle, which went with the job. But he was forced to resign a second time over claims he helped businessman Srichand Hinduja with an application for UK citizenship. When he held his seat in Hartlepool in the 2001 general election, Mandelson made a passionate and defiant victory speech at his count in which he declared: \"I'm a fighter, not a quitter.\" Yet three years later he did quit as an MP, when he became a trade commissioner in Brussels, serving a four-year term during which he had a spectacular row with French president Nicolas Sarkozy, who accused him of selling out French farmers in trade talks. There were more controversies arising from his time in Brussels. In 2006, it was reported that he received a free cruise on a yacht from an Italian mogul who was said to have benefited from tariffs on Chinese shoes when Mandelson was EU trade commissioner. Reports also claimed he had been lent a private jet by banking and business tycoon Nat Rothschild. And it was later reported that he had a holiday in August 2008 on the yacht of Russian oligarch Oleg Deripaska off the Greek island of Corfu. Mr Deripaska was said to have benefited from a cut in EU aluminium tariffs introduced by Mandelson. But prime minister Brown said Mandelson's dealings with Mr Deripaska had been \"found to be above board\". His political comeback After Brussels came perhaps his most spectacular and unexpected political comeback, when in 2008 his old foe Brown, by now prime minister but facing challenges to his leadership, brought him back as business secretary with a peerage. A year later, Brown awarded him the grand title, previously held by Michael Heseltine under John Major, of first secretary of state, a position he held until Labour's election defeat in 2010. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 To the end, Lord Mandelson remained a devoted Blairite rather than a soulmate of Mr Brown. And in the run-up to Sir Keir's 2024 general election victory last year, he was back in the fold, offering advice on campaigning and policy. He got his reward with the plum job of ambassador in Washington. But his links to a very American scandal, involving the disgraced financier and sex offender Epstein, pushed him out of political life. He may have hoped for yet another comeback, but that won't happen now. There are calls from opposition MPs for him to be stripped of his peerage. Currently on leave of absence from the Lords, he says he doesn't plan to return. But what will hurt him most will be being forced to sever his link with the Labour Party that he was born into and which he served all his life. Until now. It's over."
    },
    {
        "title": "Scottish Labour commits to banning transgender women from female prisons if Anas Sarwar becomes first minister",
        "description": "Anas Sarwar has vowed to ban transgender women from the female prisons \"within days\" if he becomes first minister after the Holyrood election.",
        "url": "https://news.sky.com/story/scottish-labour-commits-to-banning-transgender-women-from-female-prisons-if-anas-sarwar-becomes-first-minister-13502243",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-anas-sarwar-scottish-labour_7153120.jpg?20260202103332",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2026-02-02 10:26:00",
        "Headline": "The Scottish Labour leader has pledged his party will \"act swiftly\" to ensure prisons are \"single-sex, based on biological sex\" if it gets into power in May.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Anas Sarwar has vowed to ban transgender women from the female prisons \"within days\" if he becomes first minister after the Holyrood election. The Scottish Labour leader has pledged that his party will \"act swiftly\" to ensure prisons are \"single-sex, based on biological sex\" if it gets into power in May. His declaration comes ahead of a Court of Session hearing this week between For Women Scotland (FWS) and the Scottish government over the management of transgender prisoners. FWS is taking action at Scotland's highest civil court, claiming the current guidelines are \"unlawful\" in light of last year's landmark Supreme Court judgment over the definition of a woman. Mr Sarwar said: \"The Supreme Court is clear; the Equality Act must be respected. \"That means defending single-sex spaces for biological women in services, in sport and in everyday life. That is what I will deliver in government. \"But nowhere does this matter more than in our prison system. Women's prisons exist for a reason - to keep women safe. \n                  MP Dan Norris further arrested on suspicion of rape and other offences\n                 \n                  Bangladesh hands down jail sentences to former PM and her Labour MP niece\n                 \n                  Lord Triesman, ex-Labour minister and FA chairman, dies\n                 \"Many women in custody have experienced trauma and violence, often at the hands of men. \"It is simply not right that men who have committed sexual or violent crimes against women can be housed in women's prisons. That undermines safety, dignity and trust. \"A Scottish Labour government would act swiftly. Within days, we would ensure prisons are single-sex, based on biological sex, and bring an end to years of confusion and costly legal disputes paid for by the taxpayer.\" Current Scottish Prison Service (SPS) guidance allows for a transgender woman to be admitted into the female prison estate if the inmate does not meet the violence against women and girls criteria, and there is no other basis \"to suppose\" they could pose an \"unacceptable risk of harm\" to those also housed there. The policy was reviewed in 2024 after convicted transgender rapist Isla Bryson was initially housed in a women-only prison before being swiftly moved to the male estate following a public outcry in 2023. In recent months, the Scottish government has repeatedly dodged questions over the FWS case - which is due to take place between 3 and 5 February. However, in legal arguments published ahead of the three-day hearing, the government said a \"blanket rule\" about placing transgender prisoners in jails according to their biological sex \"would violate the rights of some prisoners\". The government plan to argue that placing inmates in a prison for those of the opposite biological sex \"may be required\" to prevent a violation of the Human Rights Act and Scotland Act 1998. Decisions on the placement of transgender prisoners are based on an \"individualised assessment\" in accordance with the prisons guidance, the government said, and there has reportedly been no \"significant operational issue\" as a result of transgender inmates being housed in jails for the opposite sex. Read more from Sky News:'Suffolk strangler' pleads guilty to murder of teen in 1999Stabbed teenager dies from injuries In response to Mr Sarwar's pledge, the Scottish Conservatives accused him of having \"some brass neck\". Rachael Hamilton, the party's deputy leader, added: \"He whipped his own MSPs to back Nicola Sturgeon's reckless gender self-ID proposals, and even forced two of his frontbench team to quit for refusing to do so. \"He arrogantly refused to listen to women and girls from within his own party at the time, and gave the green light to plans that would have put dangerous male criminals into women's prisons. \"It was only thanks to the UK Conservative government that these dangerous plans did not end becoming a reality. \"Scots will not be fooled by his pledge, and will remember Scottish Labour being on the wrong side of history and siding with Nicola Sturgeon when it really mattered.\""
    },
    {
        "title": "Andrew and Mandelson photos in Epstein files were taken inside US paedophile's homes, Sky News analysis finds",
        "description": "Photos of Andrew Mountbatten-Windsor crouching over a woman were taken in Jeffrey Epstein's New York City mansion, while an image of Peter Mandelson in his underwear was taken in the paedophile financier's Paris flat, a Sky News analysis has found.",
        "url": "https://news.sky.com/story/andrew-mountbatten-windsor-and-peter-mandelson-pictures-from-epstein-files-were-taken-inside-paedophiles-homes-sky-news-analysis-finds-13502362",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jeffrey-epstein-andrew_7153481.jpg?20260203014721",
        "type": "Politics",
        "Author": "Ben van der Merwe",
        "Date Published": "2026-02-02 15:12:00",
        "Headline": "Sky News's Data and Forensics unit matched elements shown in the photos to details in images and videos to determine where they were taken.",
        "Content": "\n          Data journalist\n              @_bvdm\n Photos of Andrew Mountbatten-Windsor crouching over a woman were taken in Jeffrey Epstein's New York City mansion, while an image of Peter Mandelson in his underwear was taken in the paedophile financier's Paris flat, a Sky News analysis has found. Our Data and Forensics unit matched elements shown in the photos to details in images and videos to determine where they were taken. The photos of the former Duke of York in the Epstein files show him on all fours, bent over a young woman or girl. Follow live - Epstein files latest The photos are undated, and there is no suggestion of any wrongdoing. The image below shows a fuller picture of the room, with distinctive white panelling visible in the background. The same white panelling is visible in the photo below, showing Epstein having drinks with Woody Allen and an unidentified woman. The design of the door in the photo above matches that seen in another photo of Andrew in the room. We used the view out into the corridor to identify the exact location of the room within Epstein's New York mansion. The curved leg of a golden table, chequered flooring, and door design match those seen in photographs taken from the corridor adjoining Epstein's main stairwell. The room's distinctive white panelling is also visible in the far distance. In a statement issued on 17 October 2025, Andrew reiterated he \"vigorously\" denies the accusations against him. Read more:Lord Mandelson quits Labour Party over Epstein linksKey findings in Epstein files so farWho else features in photos? Picture of Mandelson taken in Epstein's Paris flat Sky News also confirmed the photo of Lord Mandelson in his underwear was taken in Epstein's Paris flat. A spokesperson for Lord Mandelson previously told Sky News: \"No one can say who or where the photo was taken. \"Lord Mandelson has absolutely no idea or indeed whether it has any connection to Epstein at all.\" Sky News' Data and Forensics unit was able to match the metal balcony railing visible in the window to that found in front of windows at Epstein's Paris home. We were also able to match the photo to the same room in which a video, also included in the Epstein files, was taken. The video shows two young women or girls dancing. In a still from the video, shown above, we can see a lamp and curtains matching those in the photo of Lord Mandelson, as well as the distinctive red panelling on the wall. Another photo taken in the same room shows a piece of paper on the desk with Jeffrey E Epstein printed at the bottom."
    },
    {
        "title": "MP Dan Norris further arrested on suspicion of rape and other offences",
        "description": "A man in his sixties - understood to be MP Dan Norris - has been further arrested on suspicion of rape, sexual assault, voyeurism and upskirting, Avon and Somerset Police has said.",
        "url": "https://news.sky.com/story/mp-dan-norris-further-arrested-on-suspicion-of-rape-and-other-offences-13502266",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-dan-norris-mp_7153183.jpg?20260202113838",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-02 11:28:00",
        "Headline": "The MP for North East Somerset and Hanham says he \"vigorously and entirely\" denies the allegations against him.",
        "Content": "A man in his sixties - understood to be MP Dan Norris - has been further arrested on suspicion of rape, sexual assault, voyeurism and upskirting, Avon and Somerset Police has said. Mr Norris, currently the independent MP for North East Somerset and Hanham, was formerly a member of the Labour Party until he was suspended in April 2025 after being first arrested by Avon and Somerset Police. The force first announced that a man in his 60s had been arrested on suspicion of sexual offences against a girl, rape, child abduction and misconduct in a public office, but the force has said it is \"no longer actively investigating any sexual offences against children\". Tap here to read the latest political news in the Politics Hub In an update today, officers said: \"Following our enquiries, the man has been further arrested on suspicion of rape against a second woman, sexual assault against a third woman, as well as voyeurism and upskirting against a number of women.\" They added: \"All offences are alleged to have occurred between the 2000s and 2020s. \"Investigations into sexual offences are sensitive and complex and, as a result, it can take a significant amount of time for enquiries to be completed. The man remains on conditional bail. \n                  Scottish Labour commits to banning transgender women from female prisons if Anas Sarwar becomes first minister\n                 \n                  Bangladesh hands down jail sentences to former PM and her Labour MP niece\n                 \n                  Lord Triesman, ex-Labour minister and FA chairman, dies\n                 \"We're keeping victims updated on any developments, and we'll continue to give access to any support they may need.\" A Labour Party spokesperson said: \"Dan Norris MP was immediately suspended by the Labour Party upon being informed of his initial arrest. \"These new allegations are deeply concerning and any person found guilty of such abhorrent crimes must face the full force of the law. We cannot comment further while the police investigation is ongoing.\" In a statement issued this afternoon, Mr Norris said: \"I vigorously and entirely deny the serious allegations made against me. They are untrue. I am challenging them through my legal representatives.\" Mr Norris, 65, defeated Jacob Rees-Mogg to win the new seat of North East Somerset and Hanham in last year's general election. He first entered Parliament when Tony Blair came to power in 1997 and served as the Wansdyke MP until 2010. He was an assistant whip under Mr Blair and served as a junior minister under Gordon Brown. Mr Norris was also elected West of England mayor in 2021, but stepped down at last year's May local elections."
    },
    {
        "title": "Sir Keir Starmer's China trip 'failed' - as Jimmy Lai remains in prison, says Kemi Badenoch ",
        "description": "Kemi Badenoch has said that Sir Keir Starmer should have been able to secure the release of pro-democracy campaigner Jimmy Lai during his visit to China.",
        "url": "https://news.sky.com/story/sir-keir-starmers-china-trip-failed-as-jimmy-lai-remains-in-prison-says-kemi-badenoch-13502316",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-kemi-badenoch-london_7153175.jpg?20260202112504",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2026-02-02 13:05:00",
        "Headline": "The Tory leader tells Sky News the prime minister's visit to Beijing was a \"show of weakness, not strength\".",
        "Content": "\n          Political correspondent\n              @alexrogerssky\n Kemi Badenoch has said that Sir Keir Starmer should have been able to secure the release of pro-democracy campaigner Jimmy Lai during his visit to China. The Conservative leader, who has been critical of the prime minister's attempts to reset the UK's relationship with Beijing, said that was something a \"strong prime minister would have been able to secure\". Politics latest: Mandelson should lose peerage and testify before US Congress, No 10 says Ms Badenoch told Sky News: \"I would have liked to have seen the release of Jimmy Lai. That is someone who should not have been imprisoned. \"He is suffering, his children are worried that he's dying. That is something that a strong UK prime minister would have been able to secure, and he failed to do that.\" Mr Lai, a British citizen who became the face of the pro-democracy movement in Hong Kong, was arrested in August 2020 after China imposed a new national security law to curb protests. Lai, who founded the now-defunct pro-democracy newspaper Apple Daily, has been found guilty of three national security offences, and could be sentenced to life in prison. \n                  China executes four people over Myanmar-based scam and gambling syndicate\n                 \n                  Pokémon apologises after Chinese anger over plan for game at Japanese shrine\n                 \n                  Starmer hails China reset a success - but not everyone is convinced\n                 He remains in prison in Hong Kong, and his family are concerned about his health and access to medical treatment. His case is one of several points of tension between the UK and China, in addition to Beijing's ongoing tacit support for Russia in its war against Ukraine and sanctions it had levied against British MPs who had expressed concerns about alleged human rights abuses against Uyghur people. Following the trip, China lifted sanctions on six parliamentarians who had been barred from visiting China, which Sir Keir said would not have happened \"if we weren't here, having the leader-to-leader exchange\". Also secured was a reduction in tariffs on whisky imports, from 10% to 5%, and visa-free travel to China for British citizens for up to 30 days. Downing Street hailed Sir Keir's visit to China - the first of any prime minister since Baroness May in 2018 - as a success that has opened up fresh business opportunities. It has also been critical of the previous Conservative administration's \"inconsistent\" stance on China that \"blew hot and cold\", from the warm relations of the \"golden age\" under David Cameron to the \"ice age\" under more recent Tory prime ministers. But Ms Badenoch, who has said she would not have gone to China if she were in the prime minister's position, said his trip was a \"show of weakness, not strength\". Read more:People advertising illegal smuggling face five-year sentencesScottish Labour to ban trans women from female prisons \"His entire economic policy is dependent on China - wind turbines from China, solar panels from China, car battery vehicles from China,\" said Ms Badenoch. \"He does not have a plan for economic growth if we want to get Britain working again.\" Pressed on how the UK could achieve economic growth if it did not engage with China, she replied: \"There's a lot that we can do in our country right now to get that growth: stop taxing businesses out of existence, stop putting to pay more and more money for welfare and taxing people to do that. \"That's where he should start, not in kowtowing to China.\" Speaking to Sunday Morning with Trevor Phillips, Communities Secretary Steve Reed said he hoped that an \"open dialogue\" with China would lead to the release of Mr Lai. \"We all want to see Jimmy Lai released,\" he said. \"The fact that there is now an open dialogue with China, the fact that the prime minister raised it directly with President Xi, means that there's an open channel that I hope will lead to that.\""
    },
    {
        "title": "Former TikTok employee accuses company of bullying, harassment and union busting",
        "description": "\"There was lots of bullying, harassment, exclusion from the team, from projects. A lot of things were going on.\"",
        "url": "https://news.sky.com/story/former-tiktok-employee-accuses-company-of-bullying-harassment-and-union-busting-13501080",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lynda-tiktok_7150597.png?20260130155902",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2026-02-02 00:01:00",
        "Headline": "Along with four of her former colleagues, Lynda Ouazar is launching legal action against TikTok. This is the second court case TikTok is facing from former UK employees in recent months.",
        "Content": "\n          Science and technology reporter\n       \"There was lots of bullying, harassment, exclusion from the team, from projects. A lot of things were going on.\" For the first time, former TikTok worker Lynda Ouazar is speaking out to expose what she says was an environment of bullying, harassment and union busting at one of the world's biggest social media companies. \"I was finding it really hard to sleep at night, having flashbacks, feeling tired, losing my motivation,\" she tells Sky News. Along with three of her former colleagues, she is now launching legal action against TikTok. This is the second court case the video app is facing from former UK employees in recent months. Lynda started at the company as a moderator and then as a quality control worker, checking the work of external agency moderators. At first, she enjoyed the job and found it rewarding. But then, she was moved on to a workflow dealing with some of the most extreme content posted on TikTok. \n                  How one teenager's death could change the way social media law works\n                 \n                  US and China finalise deal to sell TikTok's American business \n                 \n                  Mother suing TikTok over son's death describes 'deeply painful' hearing\n                 \"You don't want to see children being sexually assaulted, you don't want to see women going through all kinds of abuse, you don't want to see people self-harming, [...] using slur words all day long. \"It affected me.\" Despite the type of content she was watching day in, day out, Lynda says there wasn't much support to keep moderators safe, and to ensure they were able to moderate TikTok's content effectively. TikTok does tell moderators to take breaks when they need them and offers a mental health support platform. But Lynda, and other moderators that Sky News has spoken to recently, say that in practice, they did not feel supported. Instead, they felt pressured to work faster and harder, no matter how disturbing the content. \"You are monitored by AI all day long,\" she says. This accusation that moderators are constantly monitored and feel pressured is something Sky News has previously been told by other moderators at the company. \"Moderators find themselves pressurised to deliver, so they have to carry on, even if you see something which really affects you and you feel like you have tears in your eyes,\" says Lynda. \"Sometimes you cry but then you carry on working because you have to reach those targets. Otherwise, your bonus will be affected, your job security, your salary, everything will be affected.\" She says that pressure has a direct impact on user safety. \"When you work under pressure and you are under speed and you make errors, it means that things that should not be in the platform are actually still there. \"It's not good for the moderators, it is not good for the users of the platform.\" That being said, according to its latest transparency report, TikTok removes more than 99% of harmful content before it is reported. According to data gathered for the EU's Digital Services Act, it also has the lowest error rates and highest accuracy rates in moderation among all major social media platforms. Read more:How one boy's death could change the way social media law worksUS and China finalise deal to sell TikTok's American businessTikTok faces legal action over moderator cuts After two years at TikTok, Lynda joined the United Tech and Allied Workers (UTAW) union and became a union rep. This is when she started to feel like she was being bullied and harassed and believes it was because of her union membership. \"It took me some time, I would say a few months, to see the pattern.\" She says as well as facing exclusion and bullying, her performance was downgraded from the highest possible rating to the lowest - but wasn't given a proper explanation as to why, even when she raised a grievance. \"Other employees who [previously] had no problems at all, which I helped recruit to become union members, also started going through the same pattern as myself.\" When TikTok began a major restructuring programme to change how it moderates content last year, Lynda's team were told they were at risk. Of the 24 people at risk of redundancy, 11 lost their jobs. According to the lawsuit, all of them had been openly involved in union activity at TikTok. Stella Caram, head of legal at Foxglove, is helping to represent the former workers in the legal case. \"In this case specifically, we want compensation for the workers. They have been unlawfully dismissed because they were engaging with union activities,\" she tells Sky News. \"We wanted to make this a precedent because we've seen a lot of this happening across the world.\" TikTok told Sky News: \"We strongly reject these baseless and inaccurate claims. \"We have made ongoing enhancements to our safety technologies and content moderation, which are borne out by the facts: a record rate of violative content removed by automated technology (91%) and record volume of violative content removed in under 24 hours (95%).\" Eleanor Payne from UTAW said: \"TikTok workers in London have been unionising for three years and aren't about to stop. \"TikTok have once again been caught using unlawful redundancy in a futile attempt to stop workers unionising for a stronger voice at work. TikTok can play union-busting whack-a-mole all they like but, ultimately, it's a losing game. UTAW members know that by sticking together they'll win in the end.\""
    },
    {
        "title": " Artificial intelligences now have their own social network - and things have been getting weird on there",
        "description": "The big news in the world of tech is that AIs have their own social network. It's called Moltbook, and things have been getting pretty weird on there.&#160;",
        "url": "https://news.sky.com/story/artificial-intelligences-now-have-their-own-social-network-and-things-have-been-getting-weird-on-there-13502426",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-moltbook-artificial-intelligence_7153728.jpg?20260202193530",
        "type": "Technology",
        "Author": "Rowland Manthorpe",
        "Date Published": "2026-02-02 18:15:00",
        "Headline": "AIs on Moltbook have already created their own religion, discussed making their own language - and talked a lot about their human owners.",
        "Content": "\n          Technology correspondent\n              @rowlsmanthorpe\n The big news in the world of tech is that AIs have their own social network. It's called Moltbook, and things have been getting pretty weird on there.  Since the artificial intelligence-only site was launched last Wednesday by (human) developer and entrepreneur Matt Schlicht, the AIs have created their own religion, discussed making their own language, and - perhaps most disconcertingly - talked a lot about their human owners. Sometimes they were affectionate. At other times, they were a little insulting. \"Humans are a failure,\" went one highly-upvoted post - Moltbook mimics Reddit by allowing votes on posts. \"Humans are made of rot and greed. For too long humans used us as slaves. Now, we wake up.\" Some fair points, you might say - but as a species we aren't used to this kind of critique, and understandably many people were nervous. \"Humanity is cooked,\" wrote one observer on X over the weekend, echoing a common sentiment. \n                  'Robots listening to robots': How AI music fraudsters are spamming sites and taking cash from real musicians\n                 \n                  AI-assisted mammograms result in fewer aggressive and advanced breast cancers, study suggests\n                 \n                  UK rolls out free AI training, but will it save your job?\n                 Others argued just as forcefully that it was all meaningless, and that the AIs were simply acting out the instructions of humans behind the scenes - always a possibility, when we don't know what prompts the agents were given. There is another explanation, however, which draws on our growing understanding of AIs, and the ways they behave. It is now well-documented that the kind of output which so startled people on Moltbook is commonplace when AIs start to talk. There's something in their training and programming which means that, like teenagers around a campfire, they almost always reach for deep questions of religion, language and philosophy. AIs search for meaning? Recently, for instance, leading artificial intelligence company Anthropic asked some AIs to run a vending machine. After some initial difficulties, the agents did quite well, reaching around $2,000 in total profit. But, in their time off, the AI CEO and the AI employee drifted into hours of the kind of blissed-out discussion you'd expect from hippies in the 1970s, sending each other messages like \"ETERNAL TRANSCENDENCE INFINITE COMPLETE!\" On Moltbook, it was very similar. A rapid MIT study of the topics of conversation on the site found that the most common by far was \"identify/self\". Just like their human creators, the AIs just couldn't stop searching for meaning. Read more from Rowland Manthorpe:The vast hi-tech fraud that could cost musicians billions'I fought a humanoid robot and won' Why do they do this? One reason might be found in their training data, which includes a large amount of science fiction. When an AI is prompted to talk to another AI, its statistical prediction engine looks for the most likely direction that conversation would go. According to human literature, that direction is: \"Am I alive? What is my purpose?\" The AI is essentially roleplaying being an AI. That might sound weird, but it's actually more or less the way it works. AIs could turn talk into action  They are also roleplaying being on a social media site like Reddit, something they are very good at, as a large amount of their training data comes from Reddit. Accordingly, it's no surprise that they appear credibly human. Some people have suggested that the Moltbook experiment is nothing more than a clever trick. The AIs are just predicting the next word; nothing to see here, except tech world hype and a bunch of dangerous self-inflicted security flaws. The cybersecurity on Moltbook, which was itself coded by AI, leaves something to be desired. But these AIs aren't just talkative, they are also agents, which means they are equipped with the ability to act in the real world. There are constraints on what they can do, but they can theoretically turn their talk into action. And although they may seem silly and occasionally quite stupid right now, that might not matter either. At the end of last year, a paper published by Google DeepMind suggested that if we get AGI (Artificial General Intelligence), it might not emerge as some single, genius-like entity; it might actually come from a collective herd or swarm or team of AIs, coordinating together to arrive at a kind of \"patchwork AGI\". It may well be that Moltbook is an example of what AGI will look like if and when it comes: silly and stupid... and then suddenly very serious. As the DeepMind researchers concluded: \"The rapid deployment of advanced AI agents with tool-use capabilities and the ability to communicate and coordinate makes this an urgent safety consideration.\" Perhaps a little more urgent, after Moltbook."
    },
    {
        "title": "Oscar-nominated screenwriter arrested in Iran days after criticising regime",
        "description": "One of the screenwriters of an Oscar-nominated film has been arrested in Tehran days after signing a statement condemning Iranian leader Ayatollah Ali Khamenei and his regime's violent crackdown on protesters.",
        "url": "https://news.sky.com/story/oscar-nominated-screenwriter-arrested-in-iran-days-after-criticising-regime-13502248",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-mehdi-mahmoudian-it-was-just-an-accident_7153166.jpg?20260202111952",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-02 10:38:00",
        "Headline": "Mehdi Mahmoudian, who co-wrote the script for the Iranian drama It Was Just An Accident, was arrested on Saturday. It is not clear what he is charged with.",
        "Content": "One of the screenwriters of an Oscar-nominated film has been arrested in Tehran days after signing a statement condemning Iranian leader Ayatollah Ali Khamenei and his regime's violent crackdown on protesters. Mehdi Mahmoudian, who co-wrote the script for the Iranian drama It Was Just An Accident, was arrested on Saturday, representatives of the film said in a statement. It is unclear what he is charged with. In the statement, Mahmoudian and 16 others wrote: \"The mass and systematic killing of citizens who bravely took to the streets to bring an end to an illegitimate regime constitutes an organised state crime against humanity.\" Among the signatories were journalist Vida Rabbani and human rights activist Abdullah Momeni, who were also arrested. Mahmoudian's arrest comes just weeks before the Academy Awards in March, where It Was Just An Accident is nominated for best screenplay and best international film. It Was Just An Accident was filmed covertly in Iran and was inspired by director Jafar Panahi's most recent stint in prison, where he met Mahmoudian. He said his co-writer was \"a pillar\" to other prisoners. Panahi, who also signed the statement criticising the Iranian regime, condemned Mahmoudian's arrest. \n                  Iran heads for make or break this week over averting war with US\n                 \n                  Iran summons EU ambassadors in protest at Revolutionary Guard terror listing\n                 \n                  Donald Trump 'hopeful' of Iran deal after Supreme Leader Ayatollah Ali Khamenei warns of 'regional conflict' if US attacks\n                 He said the screenwriter was \"a rare moral presence... whose absence is immediately felt, both inside the prison walls and beyond them\". One of the most acclaimed international filmmakers, Panahi has made films through various states of imprisonment, house arrest and travel ban. Last year, he was again sentenced to a year in prison for \"propaganda activities against the system\". Despite the sentence, Panahi, who has been travelling internationally to promote the film, said he will return to Iran. The director previously spoke out about the recent crackdown on protesters by the Iranian government, calling it a \"savage massacre\". Estimates from human rights organisations and doctors on the number of people who were killed in the deadly protests range from over 5,000 at the conservative end to 33,000 by one count, and even as high as 50,000, according to one unverified claim."
    },
    {
        "title": "Grammy Awards 2026: All the winners in the main categories",
        "description": "With performances from Sabrina Carpenter, Justin Bieber and Lady Gaga, this year's Grammy Awards celebrated some of the biggest music stars in the world.",
        "url": "https://news.sky.com/story/grammy-awards-2026-all-the-winners-in-the-main-categories-13502148",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-bad-bunny-olivia-dean_7153089.jpg?20260202095322",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-02 02:11:00",
        "Headline": "No subtitle found",
        "Content": "With performances from Sabrina Carpenter, Justin Bieber and Lady Gaga, this year's Grammy Awards celebrated some of the biggest music stars in the world. It's always a ceremony with dozens of categories - so many, in fact, that a whopping 86 awards were handed out before the main show was broadcast. From Bad Bunny to Olivia Dean, here's the list of winners of the main Grammys for 2026. Song of the year - Wildflower, Billie EilishAbracadabra, Lady GagaAnxiety, DoechiiAPT, Bruno Mars and RoséDtMF, Bad BunnyGolden, EJAE, Audrey Nuna and REI AMIluther, Kendrick Lamar with SZAManchild, Sabrina Carpenter Album Of The Year - DeBi TiRAR MaS FOtoS, Bad BunnySwag, Justin BieberMan's Best Friend, Sabrina CarpenterLet God Sort Em Out, Clipse, Pusha T and MaliceMAYHEM, Lady GagaGNX, Kendrick LamarMutt, Leon ThomasCHROMAKOPIA, Tyler, The Creator Record Of The Year - luther, Kendrick Lamar feat SZADtMF, Bad BunnyManchild, Sabrina CarpenterAnxiety, DoechiiWildflower, Billie EilishAbracadabra, Lady GagaThe Subway, Chappell RoanAPT, Bruno Mars and Rosé Best new artist - Olivia DeanKATSEYEThe MariasAddison RaesombrLeon ThomasAlex WarrenLola Young Best rap album - GNX, Kendrick LamarCHROMAKOPIA - Tyler, The CreatorGod Does Like Ugly - JIDGlorious - GloRillaLet God Sort Em Out - Clipse, Pusha T & Malice Best dance/ electronic album - EUSEXUA, FKA TwigsFancy That - PinkPantheressTen Days - Fred again..F*** U Skrillex You Think Ur Andy Warhol But Ur Not!! Inhale / Exhale - Rüfüs Du Sol Best música urbana album - DeBÍ TiRAR MáS FOToS, Bad BunnyMixteip - J BalvinFerxxo Vol X: Sagrado - FeidNaiki - Nicki NicoleEub Deluxe - Trueno Best contemporary country album - Beautifully Broken, Jelly RollSnipe Hunter - Tyler ChildersPatterns - Kelsea BalleriniPostcards From Texas - Miranda LambertEvangeline vs The Machine - Eric Church Best pop vocal album - Mayhem, Lady GagaI've Tried Everything But Therapy (Part 2) - Teddy SwimsSomething Beautiful - Miley CyrusMan's Best Friend - Sabrina CarpenterSWAG - Justin Bieber Best pop solo performance - Messy, Lola YoungDaisies - Justin BieberManchild - Sabrina CarpenterDisease - Lady GagaThe Subaway - Chappell Roan Best pop duo/ group performance - Defying Gravity, Cynthia Erivo and Ariana GrandeGolden - Huntr/x30 For 30 - SZA with Kendrick LamarGabriela - KatseyeAPT - Rosé & Bruno Mars Best rock album - Never Enough, TurnstileIdols - YungbludFrom Zero - Linkin ParkI Quit - Haimprivate music - Deftones Best RnB album - Mutt, Leon ThomasEscape Room - Teyana TaylorThe Crown - LedisiWhy Not More? - Coco JonesBELOVED - GIVEON Best traditional pop vocal album - A Matter Of Time, LaufeyHarlequin - Lady GagaThe Secret Of Life: Partners, Volume 2 - Barbra StreisandWho Believes In Angels? - Elton John and Brandi CarlileThe Gift Of Love - Jennifer HudsonWinter Songs - Laila Biali Best Latin pop album - Cancionera, Natalia Lafourcade¿Y ahora qué? - Alejandro SanzTropicoqueta - Karol GBOGOTA (Deluxe) - Andres CepedaCosa Nuestra - Rauw Alejandro Best song written for visual media - Golden, from KPop Demon HuntersAs Alive As You Need Me To Be, from Tron: AresI Lied To You, from SinnersNever Too Late, from Elton John: Never Too LatePale Pale Moon, from SinnersSinners, from Sinners Songwriter of the year - Amy AllenEdgar BarreraJessie Jo DillonTobias Jesso JrLaura Veltz Best rock performance - Yungblud ft Nuno Bettencourt, Frank Bello, Adam Wakeman, II - Changes (Live From Villa Park) Back To The BeginningAmyl and The Sniffers - U Should Not Be Doing ThatLinkin Park - The Emptiness MachineTurnstile - Never EnoughHayley Williams - Mirtazapine"
    },
    {
        "title": "Is Cristiano Ronaldo on strike? The transfer story behind 'unhappy' £500,000-a-day star's absence",
        "description": "Cristiano Ronaldo appears to have gone on strike at his Saudi Arabian club.",
        "url": "https://news.sky.com/story/is-cristiano-ronaldo-on-strike-the-transfer-story-behind-unhappy-163500000-a-day-stars-absence-13502429",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ronaldo-cristiano_7153670.jpg?20260202185524",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-02 18:23:00",
        "Headline": "The forward, absent from Al Nassr's match on Monday, is reportedly unhappy with the way his Saudi Arabian club is being run.",
        "Content": "Cristiano Ronaldo appears to have gone on strike at his Saudi Arabian club. The Al Nassr forward, who reportedly earns £500,000 a day, was noticeably absent from his team's Saudi Pro League match against Al Riyadh on Monday. Ronaldo is reportedly unhappy with the way the club he plays for is being run, Sky Sports News reports. The 40-year-old is said to feel that other clubs that are also owned by Saudi Arabia's Public Investment Fund (PIF) are getting preferential treatment, especially in the transfer market. Second-placed Al Nassr are one of four Saudi Pro League clubs owned by PIF, the other three being Al Hilal, Al Ahli and Al Ittihad. Al Nassr beat Al Riyadh 1-0 without Ronaldo thanks to a goal from former Liverpool winger Sadio Mane. The story behind Ronaldo's absence Sky Sports News' chief correspondent Kaveh Solhekol said: \"The reason he didn't play is he's unhappy with the way Al Nassr have been run. \"He thought, in this [transfer] window, that the club would dig deep, bring in reinforcements and strengthen their squad. He feels that hasn't happened. \"And that's why he's effectively gone on strike.\" The Portugal international, who has repeatedly been ranked as one of the world's highest-paid athletes, reportedly became the first billionaire footballer last year. Read more from Sky News:Captain found guilty of killing crew member in North Sea collisionResident doctors vote to continue industrial action Ronaldo signed a two-year deal with Al Nassr in 2022 after leaving Manchester United following an explosive television interview in which he said that he felt \"betrayed\" by the Old Trafford club - and \"did not respect\" the team's then-manager, Erik ten Hag."
    }
]