[
    {
        "title": "US 'stands ready to help' Iranian protesters, Trump says, as demonstrations against regime last two weeks",
        "description": "The US 'stands ready to help' Iranian protesters, Donald Trump has said, as demonstrations across the country enter their third week.",
        "url": "https://news.sky.com/story/iranian-protesters-to-be-charged-as-enemies-of-god-prosecutor-general-threatens-with-around-100-reportedly-arrested-13492803",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-tehran-protest_7132057.jpg?20260110165036",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-10 16:11:00",
        "Headline": "The number of those killed in the protests - arguably the biggest seen in the country since the 1979 Revolution - has risen from 62 to 65, according to the US-based Human Rights Activists News Agency",
        "Content": "The US 'stands ready to help' Iranian protesters, Donald Trump has said, as demonstrations across the country enter their third week. As demonstrations across Iran's 31 provinces in the country continue, officials have imposed a communications blackout, while state media is blaming the protests on \"terrorist agents\" from the US and Israel. The number of those killed in the protests - arguably the biggest seen in the country since the 1979 revolution - has risen from 62 to 65, according to the US-based Human Rights Activists News Agency. As it happened: Tehran blames US president for escalation Saturday also saw US President Donald Trump say Washington \"stands ready to help,\" while a Republican senator said the Iranian people's \"long nightmare is soon coming to a close\". The US president, who bombed Iran last summer, posted his support for the protesters on Truth Social. \"Iran is looking at FREEDOM, perhaps like never before,\" he said. \"The USA stands ready to help!!!\" \n                  Iran's regime is more vulnerable than it has ever been, but Khamenei shows no sign of relenting\n                 \n                  Reza Pahlavi: Who is the exiled crown prince positioning himself as a key figure in Iran's future after decades away?\n                 \n                  Iran's leaders facing most serious threat since 1979 revolution\n                 It's unclear what kind of support Mr Trump is referring to, and it comes a day after he said the US would hit Tehran \"very hard\" if the government \"start[s] killing people\" at the White House. Senator Lindsey Graham, a longtime critic of Iran's regime, also said on X: \"To the Iranian people: your long nightmare is soon coming to a close. \"Your bravery and determination to end your oppression has been noticed by [Trump] and all who love freedom. \"When President Trump says Make Iran Great Again, it means the protesters in Iran must prevail over the ayatollah.\" 'Enemies of god' death threat warning Earlier, Iran's prosecutor-general Mohammad Movahedi Azad reiterated threats to protesters that they would face charges of moharebeh, and be tried as \"enemies of god\". Moharebeh is punishable by the death penalty. The prosecutor-general added that the charge would apply to \"rioters and terrorists\" who damaged property and undermined security, and those who helped them. Tehran prosecutor Ali Salehi made the same threat to protesters on Friday, after Supreme Leader Ayatollah Ali Khamenei accused protesters of acting on behalf of Mr Trump. State news agency: 100 arrested in Baharestan It comes as the semi-official news agency Tasnim reports that 100 people have been arrested in a county in Tehran Province. The local governor told the agency, which is associated with Iran's Revolutionary Guards, that the detainees allegedly \"disrupted public order\" and \"used firearms and cold weapons against the people and security and law enforcement forces\" in the county of Baharestan. In the language of Iran's supreme leader, the anti-government protesters are referred to as \"vandals and rioters\". Protests in Iran began on 28 December over a sharp slide in the value of the rial currency, and have since transformed into the most significant challenge to the regime for several years. Protester climbs on London embassy balcony Meanwhile, protests in support of Iranian demonstrators have been held outside the country's embassy in London, as well as across Europe. Social media footage showed that a protester had climbed onto the balcony and removed an Iranian flag, replacing it with the former imperial flag. The Metropolitan Police said it was aware of the incident and added: \"Officers are on site and additional officers are being deployed to prevent any disorder.\" It added before 5.30pm that it had arrested two people: One for aggravated trespass and assault on an emergency worker, and one for aggravated trespass. Read more from Sky News:New footage of Minneapolis shooting filmed by ICE agentMoney blog: Is it time to give up the green belt?Man dies after tree falls on to caravan during Storm Goretti The force said it was seeking a third person on suspicion of trespass, but that it saw \"no serious disorder\". The pre-Islamic revolution lion and sun flag is often used by opposition groups in Iran, and was seen in footage of demonstrations in London."
    },
    {
        "title": "Iran's regime is more vulnerable than it has ever been, but Khamenei shows no sign of relenting",
        "description": "Mass protest is a long way from revolution.",
        "url": "https://news.sky.com/story/irans-regime-more-vulnerable-than-it-has-ever-been-but-khamenei-shows-no-sign-of-relenting-13492900",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-tehran-iran-protest_7132055.jpg?20260110164927",
        "type": "Home",
        "Author": "Diana Magnay",
        "Date Published": "2026-01-10 18:28:00",
        "Headline": "The people of Iran have been here before with mass protests, and the Iranian authorities have honed their playbook. There is a long way to go in terms of how much they could crack down, and they have shown no sign of relenting.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n Mass protest is a long way from revolution. The people of Iran have been here before. In 2009, over perceived electoral fraud; in 2019, over fuel prices; in 2022, over the abuses of the morality police. The authorities have honed their playbook, through the thuggery of the revolutionary guard and the Basij militias, the killing of protesters, mass detentions, public executions and the shutting down of the internet. That last point is hugely significant. It means that people don't know if anyone else is going out. They can't connect. They won't know whether it's worth continuing to stick their heads above the parapet after the last two nights of protest, which had been signposted and communicated in advance. The videos they'll see are those on state TV where they'll hear the threats to use the death penalty on protesters dubbed 'vandals' or 'terrorists' and see pro-government crowds, and tempered but still sinister crackdowns. It is hard to keep momentum going across Iran's 31 provinces, especially a protest with no apparent leader (at least within Iran itself), if people are left in an information black hole. Reza Pahlavi, son of the former shah, clearly has some support on the streets, but he is in the US, and his calls for strikes and further protest may have problems filtering through. And of course, the shutdown allows the authorities to crack down as they choose, without the visibility that connectivity would confer on them. That's what happened in 2019 when at least 1,500 protesters were killed. We are still a long way from those kinds of numbers, although given the scarcity of information, it is hard to tell. The one barrier to the regime extending that blackout indefinitely is the economic toll it will take on an already gasping economy. But there is a long way to go in terms of how much they could crack down, and they have shown no sign of relenting. Revolutions would require elite buy-in - for elements of the security apparatus to decide that continuing to defer to the 86-year-old supreme leader no longer makes sense. That doesn't look like it's happening either. Read more:Who is Iran's exiled crown prince?Most serious threat since 1979 revolution The wild card is Donald Trump. He has promised to hit Iran hard if the regime opens fire on protesters. And then there is Israel, too, which might take the opportunity for another strike. Iran's Islamic theocracy is more vulnerable than it has ever been. But it was born of a revolution itself, and the Supreme Leader Ayatollah Ali Khamenei is not about to show weakness."
    },
    {
        "title": "UK weather: End of cold spell in sight as parts of country expected to have milder temperatures than Madrid",
        "description": "The weather in the UK is expected to turn milder in the coming days, with temperatures set to reach double digits Celsius in some parts from Sunday.",
        "url": "https://news.sky.com/story/uk-weather-end-of-cold-spell-in-sight-as-parts-of-country-expected-to-have-milder-temperatures-than-madrid-13492893",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-uk-weather-porthleven_7132183.jpg?20260110183805",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-10 18:17:00",
        "Headline": "Plymouth is predicted to reach 13C on Sunday and 12C on Monday, while London is expected to be 8C on Sunday and 11C on Monday. In contrast, Madrid is expected to be 8C on Sunday and Monday, according to the Met Office.",
        "Content": "The weather in the UK is expected to turn milder in the coming days, with temperatures set to reach double digits Celsius in some parts from Sunday. That would make it slightly warmer than Spain's capital Madrid. But warnings for snow, ice, wind and rain remain in force in some areas of the UK for the weekend as they brace for further wintry conditions following Storm Goretti. Plymouth is predicted to be 13C on Sunday, 12C on Monday and 11C on Tuesday, London is expected to reach 8C on Sunday and 11C on Monday and Tuesday, while Greater Manchester could be 10C on Sunday and Monday and 8C on Tuesday. In contrast, Madrid is set to be 8C on Sunday and Monday, rising to 9C on Tuesday, according to the Met Office. Check the weather forecast in your area When the snow begins to melt amid the rising temperatures, and with rain expected, there will be a risk of localised flooding, mostly over Scotland. \n                  Man dies after tree falls on to caravan during Storm Goretti\n                 \n                  'It made me feel so small' says man turned away from hotel for being homeless\n                 \n                  More warnings for snow and ice - as tens of thousands without power\n                 On Thursday and Friday, Storm Goretti hit the UK, bringing winds of nearly 100mph, as a rare red warning for \"dangerous, stormy\" winds in the South West was issued. Police said a man in his 50s was found dead on Thursday evening after a tree fell on to a caravan in the Mawgan area of Helston, Cornwall. What are some of the latest warnings? A new amber warning for snow has been issued by the Met Office for central and northeastern Scotland on Sunday. The Met Office said \"heavy and persistent snowfall will lead to further snow accumulations and disruption\" during the day. The warning is from 3am to 2pm and covers regions including Central, Tayside and Fife, Grampian, and Highlands and Eilean Siar, with up to 300mm of snow possible. The north and northeast of Scotland have already seen several days of snowfall, ice and sub-zero temperatures, which have led to school closures and travel disruption. Wider yellow warnings for challenging weather conditions - including snow, rain, and ice - are still in place in large parts of the country for the remainder of the weekend into Monday. A yellow warning for snow and ice will be in force for much of Scotland, the East and West Midlands, north-east and north-west England and Yorkshire from 2am until 3pm on Sunday. Among the other warnings is one for wind across the north of the UK on Sunday from midnight until 9pm. It covers the regions of Central, Tayside and Fife, Grampian, Highlands and Eilean Siar, North East England, North West England, Northern Ireland, Orkney and Shetland, South West Scotland and Lothian Borders, and Strathclyde, as well as Northern Ireland. There is also a yellow warning for rain from 2am on Sunday to 10am on Monday covering northwest Scotland. Read more: What are weather warnings and how do they work? 'Warmer conditions' ahead Sky News weather producer Dr Chris England said: \"Southerly winds associated with bands of rain spreading from the southwest will make it much milder over the next day to two, ending the current cold spell, with the warmer conditions moving into western parts first. \"There'll be a spell of snow in the north and east as the wet weather moves in.\" He added that the snow will become largely confined to northern Scottish mountains by midday, before turning to rain almost everywhere. That rain, heavy at times, combined with snow melt due to the rising temperatures, will bring a risk of localised flooding, mainly over Scotland."
    },
    {
        "title": "Non-league Macclesfield knock holders Crystal Palace out of FA Cup in third round",
        "description": "Non-league Macclesfield FC, of the National League North, have knocked holders Crystal Palace out of the FA Cup, beating them 2-1 in the third round in the competition's biggest ever upset.",
        "url": "https://news.sky.com/story/non-league-macclesfield-knock-holders-crystal-palace-out-of-fa-cup-13492768",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-macclesfield-fa-cup_7131969.jpg?20260110144405",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-10 14:06:00",
        "Headline": "Saturday's result is the biggest shock in history in terms of league places between victors and the defeated - 117 places between the two. The previous biggest gap was 108.",
        "Content": "Non-league Macclesfield FC, of the National League North, have knocked holders Crystal Palace out of the FA Cup, beating them 2-1 in the third round in the competition's biggest ever upset. Paul Dawson and Isaac Buckley-Ricketts got the goals for the Silkmen at Moss Rose, before Yeremy Pino pulled one back for Palace late on. Macclesfield fans poured on to the pitch to celebrate the famous victory over their Premier League opponents, who won the trophy by beating Manchester City 1-0 at Wembley in May. Saturday's result is the biggest shock in history in terms of league places between victors and the defeated - 117 places between the two. The previous biggest gap was 108. It was the first time the holders had lost to non-league opposition since Palace themselves beat Wolves back in 1909 while in the Southern League. Macclesfield's captain Paul Dawson headed his side in front two minutes before half-time, and when asked about his header by BBC Sport, said \"I do get in quite a few every week\". In an illustration of their lowly status, he revealed he had helped clear snow from the pitch before Tuesday's league game against Radcliffe FC. \n                  UK weather: End of cold spell in sight as parts of country expected to have milder temperatures than Madrid\n                 \n                  Palestine Action activist on hunger strike for nearly 70 days 'deteriorating'\n                 \n                  Screen time linked to poor speech development in under-fives, say ministers as parents offered new guidance\n                 Dawson and his manager, John Rooney, dedicated the stunning win to Macclesfield's 21-year-old forward Ethan McLeod, who was killed in a car accident as he returned from last month's game at Bedford Town. Of the result, Rooney said: \"I can't believe it. Or get my head around it. I'm lost for words at the minute.\" Indicating the celebrating players and fans, he added: \"You can see the joy in them out there. \"I didn't think it was possible but there is that little bit of hope that anything can happen on the day.\" His side's shock win was watched by his brother, the former England and Manchester United striker, Wayne, who fought back tears, as he told the BBC he was \"so proud\". Praising his sibling's calmness, he said: \"I know he wanted the referee to blow his whistle but, at the end, he just turned round and did a little fist pump to the bench. He looked calm. I don't know how. \"But, you know, it's such an achievement. What he's achieved today, absolutely superb.\" North of England correspondent The bar at the Leasing.com Stadium is bouncing as fans, and their chairman, celebrate the biggest giant killing in FA Cup history. There are no shortage of takers for the karaoke microphone, and the goodwill, and the beer, is freely flowing. When Macclesfield Town went bust five years ago, few football fans in the town thought they'd ever enjoy something like this. Tonight they're singing the praises of the club, and its chairman Rob Smethurst. He bought the ground off Rightmove and allowed the phoenix of Macclesfield FC to fly. Three promotions in four years to reach the sixth tier of the football pyramid is an amazing start to his tenure. But today's win, over opposition 117 places above them, will eclipse everything that's gone before, and secure a place in football history for the club that so very nearly wasn't. Palace manager Oliver Glasner congratulated the winners, admitting his team \"deserved to lose\", adding he had \"no explanation\" for the result. \"You don't need tactics in these kinds of games. You just have to show what you're capable of, and show a little bit of pride and you'll perform in a different way. But today we lacked everything.\" Glasner had made six changes to his team but still picked England internationals Marc Guehi and Adam Wharton. Read more on Sky News:The cost of sacking Man Utd's managersFormer PL referee avoids jailTree falls on caravan, killing man Formerly known as Macclesfield Town, the Cheshire club was wound up in 2020 with debts of more than £500,000 and reformed as Macclesfield FC the same year, playing in the North West Counties Football League (NWCFL) Premier Division. The shock scoreline has echoes of other famous upsets by non-league teams in the world-famous tournament, such as Hereford's 2-1 win over Newcastle in 1972 and Blyth Spartans' 3-2 victory over Stoke City six years later."
    },
    {
        "title": "Thousands march against Renee Good's killing in Minneapolis as hundreds of protests planned across US",
        "description": "Thousands of people have marched in Minneapolis to protest against the killing of US mother-of-three Renee Good.",
        "url": "https://news.sky.com/story/thousands-march-against-renee-goods-killing-as-hundreds-of-protests-planned-across-us-13492955",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-minneapolis-protest_7132313.jpg?20260110230249",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-10 22:46:00",
        "Headline": "The demonstration in Minneapolis was one of hundreds of protests planned in towns and cities across the US over the weekend, demanding an end to large-scale deployments of ICE agents.",
        "Content": "Thousands of people have marched in Minneapolis to protest against the killing of US mother-of-three Renee Good. The 37-year-old driver was shot dead in her car in the Minnesotan city on Wednesday by an Immigration and Customs Enforcement (ICE) officer. The Trump administration said the shooting was an act of self-defence by the agent, suggesting Ms Good used her vehicle as a weapon to attack him. But state and local officials, as well as protesters, have rejected that characterisation, with her supporters saying they believe she steered away from the officer. On Friday, mobile phone footage showed the moments around her death, filmed by the agent who shot her, named in US media as Jonathan Ross. The video, which was reshared by the US vice president JD Vance on X, shows another ICE agent saying to Ms Good: \"Get out of the f***ing car.\" Ross is at the front driver side of the SUV. Ms Good reverses briefly, then turns the steering wheel towards the passenger side as she drives ahead and Ross opens fire. It is unclear if the car hits the officer or narrowly misses him. \n                  New footage shows Minneapolis shooting, filmed by ICE agent who fired gun\n                 \n                  Wife of woman shot dead by ICE officer says 'we had whistles, they had guns' as she pays tribute\n                 \n                  Fatal ICE shooting in Minneapolis: What we know \n                 Another video was released on Saturday by Homeland Security, which said on X: \"New evidence shows that the anti-ICE agitator was STALKING and IMPEDING a law enforcement operation over the course of the morning.\" The shooting happened on the second day of the Trump administration's immigration crackdown on the cities of Minneapolis and St Paul. The demonstration was one of hundreds of protests planned in towns and cities across the US over the weekend, demanding an end to large-scale deployments of ICE agents. Federal-state tensions escalated further on Thursday when a US Border Patrol agent in Portland, Oregon, shot and wounded a man and woman in their car after an attempted vehicle stop. The Department of Homeland Security said the driver had tried to \"weaponise\" his vehicle and run over agents. Minneapolis mayor Jacob Frey has urged demonstrators to remain peaceful, saying any unlawful action would play into Donald Trump's hands. On Friday night, about 1,000 people protested outside a hotel in the city that was believed to house ICE agents. The demonstration turned violent as protesters threw ice, snow and rocks at officers, said police chief Brian O'Hara. He added a police officer was injured when a chunk of ice was hurled at them, and 29 people were arrested during the unrest. Read more:Renee Good's wife pays tribute to herWhy are ICE agents in Minneapolis? Mr Frey, who ​has been critical of immigration agents and the shooting, said anyone damaging property or engaging in other unlawful activity would be detained. \"We will not counter Donald Trump's chaos with our own brand of chaos,\" the mayor said at a news conference. \"He wants us to take the bait.\" Minnesota governor Tim Walz echoed the call for peaceful demonstrations. \"Trump sent thousands of armed federal officers into our state, and it took just one day for them to kill someone,\" Mr Walz posted on social media. \"Now he wants nothing more than to see chaos distract from that horrific action. Don't give him what he wants.\""
    },
    {
        "title": "Screen time linked to poor speech development in under-fives, say ministers as parents offered new guidance",
        "description": "Parents will be offered government guidance on screen time for under-fives as research links prolonged viewing to poor speech development.",
        "url": "https://news.sky.com/story/screen-time-linked-to-poor-speech-development-in-under-fives-say-ministers-as-parents-offered-new-guidance-13492957",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-baby-screen-time_7049062.jpg?20260110233149",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-10 23:01:00",
        "Headline": "It is reported that the advice is likely to suggest using screens as part of an activity like storytime or with educational games.",
        "Content": "Parents will be offered government guidance on screen time for under-fives as research links prolonged viewing to poor speech development. Education Secretary Bridget Phillipson is to announce on Monday that the advice will be developed with input from parents, children and early years practitioners. Writing in the Sunday Times, Ms Phillipson said: \"Research shows that by age two, almost all children - around 98% - are watching screens such as mobiles, tablets, and TV every day, during a critical period for language development.\" Government research, released to coincide with the announcement, suggests that the use of screens, including mobile devices and televisions, is linked to poorer language development in the under-twos. The survey of 4,758 parents showed that children with the highest screen time - around five hours a day - could say significantly fewer words than those at the other end of the scale, who watched for around 44 minutes. \"Parents, teachers and nursery workers talk about children arriving at nursery and school and finding it harder to hold conversations, focus, or engage in learning,\" Ms Phillipson added. It is reported that the guidance is likely to suggest using screens as part of an activity like storytime or with educational games. \n                  Will the fight for deputy Labour leader save the PM - or undermine his leadership even more?\n                 \n                  Starmer's national security adviser played no role in collapse of China spy trial, cabinet minister says\n                 \n                  UK played 'vital role' in Gaza peace deal, says Trump aide, after minister branded 'delusional'\n                 The guidance is also expected to be accompanied by lessons for parents on early years development, including speech and language. The topic of whether screentime - the amount of time spent daily using screen-based technology - is actually harmful for children is controversial. In October, the Princess of Wales warned that smartphones and computer screens were creating \"an epidemic of disconnection\" within families. And Peter Kyle, the then technology secretary, told Sky News in July he was considering a two-hour daily limit per social media platform for children to tackle \"compulsive\" screen time, although the policy was never implemented. In Australia, a law came into force in December to ban under-16s from having social media accounts. Although Sky News has shown that some young people are getting around the restrictions. It is an attempt to stamp out cyberbullying and online addiction, and several MPs have suggested the UK should copy the policy. Read more from Sky News:End of cold spell in sightPothole map of EnglandMacclesfield's FA Cup shock Data from the children's commissioner for England, released in April, revealed that 90% of secondary schools and 99.8% of primary schools already have policies in place that stop the use of mobile phones during the day. The terms of reference for the national working group to examine guidance on screen time will be published on Monday. The group will be led by children's commissioner for England Dame Rachel de Souza and scientific adviser Professor Russell Viner, who are expected to release the first guidance on the issue in April. Ms Phillipson said: \"I want this to be shaped with parents, not dictated to them, and we'll be using our engagement sessions over the next few weeks to understand exactly what they want the guidance to include. \"This is about offering clear, practical advice on how screens fit alongside the everyday activities that matter most in the early years, including talking, playing and reading together.\""
    },
    {
        "title": "Six dead, including child, after shooting in Mississippi near Alabama border",
        "description": "Six people, including a child, have died after a mass shooting in Mississippi, authorities said at a news conference.",
        "url": "https://news.sky.com/story/six-dead-including-child-after-shooting-in-mississippi-near-alabama-border-13492912",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-mississippi-clay-county_7132267.png?20260110204509",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-10 19:35:00",
        "Headline": "Clay County Sheriff Eddie Scott said the victims - four of whom were family members related to the suspect - were shot at three separate locations late on Friday.",
        "Content": "Six people, including a child, have died after a mass shooting in Mississippi, authorities said at a news conference. The shootings took place in the rural community of Cedarbluff, west of the county seat of West Point, near the Alabama border, on Friday night. Daricka M Moore, 24, has been charged with first-degree murder, authorities said on Saturday, adding that the charge could be upgraded to capital murder and that the suspect may face additional murder charges. Clay County Sheriff Eddie Scott said the victims - four of whom were family members related to the suspect - were shot at three separate locations. The child victim was the suspect's second cousin. The sheriff added: \"I don't know what kind of motive you could have to kill a seven-year-old.\" Mr Scott also said that investigators believe Moore placed a gun to the head of a younger child at the home where the seven-year-old died. Investigators are not sure whether the gun misfired, and officials said a third child and their mother were present in that house as well. Moore is set to appear in court on Monday, the sheriff said."
    },
    {
        "title": "UK weather: End of cold spell in sight as parts of country expected to have milder temperatures than Madrid",
        "description": "The weather in the UK is expected to turn milder in the coming days, with temperatures set to reach double digits Celsius in some parts from Sunday.",
        "url": "https://news.sky.com/story/uk-weather-end-of-cold-spell-in-sight-as-parts-of-country-expected-to-have-milder-temperatures-than-madrid-13492893",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-uk-weather-porthleven_7132183.jpg?20260110183805",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-10 18:17:00",
        "Headline": "Plymouth is predicted to reach 13C on Sunday and 12C on Monday, while London is expected to be 8C on Sunday and 11C on Monday. In contrast, Madrid is expected to be 8C on Sunday and Monday, according to the Met Office.",
        "Content": "The weather in the UK is expected to turn milder in the coming days, with temperatures set to reach double digits Celsius in some parts from Sunday. That would make it slightly warmer than Spain's capital Madrid. But warnings for snow, ice, wind and rain remain in force in some areas of the UK for the weekend as they brace for further wintry conditions following Storm Goretti. Plymouth is predicted to be 13C on Sunday, 12C on Monday and 11C on Tuesday, London is expected to reach 8C on Sunday and 11C on Monday and Tuesday, while Greater Manchester could be 10C on Sunday and Monday and 8C on Tuesday. In contrast, Madrid is set to be 8C on Sunday and Monday, rising to 9C on Tuesday, according to the Met Office. Check the weather forecast in your area When the snow begins to melt amid the rising temperatures, and with rain expected, there will be a risk of localised flooding, mostly over Scotland. \n                  Man dies after tree falls on to caravan during Storm Goretti\n                 \n                  'It made me feel so small' says man turned away from hotel for being homeless\n                 \n                  More warnings for snow and ice - as tens of thousands without power\n                 On Thursday and Friday, Storm Goretti hit the UK, bringing winds of nearly 100mph, as a rare red warning for \"dangerous, stormy\" winds in the South West was issued. Police said a man in his 50s was found dead on Thursday evening after a tree fell on to a caravan in the Mawgan area of Helston, Cornwall. What are some of the latest warnings? A new amber warning for snow has been issued by the Met Office for central and northeastern Scotland on Sunday. The Met Office said \"heavy and persistent snowfall will lead to further snow accumulations and disruption\" during the day. The warning is from 3am to 2pm and covers regions including Central, Tayside and Fife, Grampian, and Highlands and Eilean Siar, with up to 300mm of snow possible. The north and northeast of Scotland have already seen several days of snowfall, ice and sub-zero temperatures, which have led to school closures and travel disruption. Wider yellow warnings for challenging weather conditions - including snow, rain, and ice - are still in place in large parts of the country for the remainder of the weekend into Monday. A yellow warning for snow and ice will be in force for much of Scotland, the East and West Midlands, north-east and north-west England and Yorkshire from 2am until 3pm on Sunday. Among the other warnings is one for wind across the north of the UK on Sunday from midnight until 9pm. It covers the regions of Central, Tayside and Fife, Grampian, Highlands and Eilean Siar, North East England, North West England, Northern Ireland, Orkney and Shetland, South West Scotland and Lothian Borders, and Strathclyde, as well as Northern Ireland. There is also a yellow warning for rain from 2am on Sunday to 10am on Monday covering northwest Scotland. Read more: What are weather warnings and how do they work? 'Warmer conditions' ahead Sky News weather producer Dr Chris England said: \"Southerly winds associated with bands of rain spreading from the southwest will make it much milder over the next day to two, ending the current cold spell, with the warmer conditions moving into western parts first. \"There'll be a spell of snow in the north and east as the wet weather moves in.\" He added that the snow will become largely confined to northern Scottish mountains by midday, before turning to rain almost everywhere. That rain, heavy at times, combined with snow melt due to the rising temperatures, will bring a risk of localised flooding, mainly over Scotland."
    },
    {
        "title": "Palestine Action activist on hunger strike for nearly 70 days 'deteriorating'",
        "description": "Palestine Action hunger strikers could be at risk of death, the group and a leading doctor have warned, as one of them enters 69 days without food.",
        "url": "https://news.sky.com/story/palestine-action-activist-on-hunger-strike-for-nearly-70-days-deteriorating-13492488",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-heba-muraisi-hunger-strikes_7131371.jpg?20260109144654",
        "type": "UK",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2026-01-10 00:01:00",
        "Headline": "Heba Muraisi is aware \"her body could fail her at any moment\" and is \"frightened\", her friend tells Sky News.",
        "Content": "\n          News correspondent\n              @esadiya\n Palestine Action hunger strikers could be at risk of death, the group and a leading doctor have warned, as one of them enters 69 days without food. Three prisoners on remand are taking part in the action over demands including immediate bail - with one reportedly admitted to hospital for a fifth time. Their lawyers say that by the time of their trial, they will have spent more than a year in custody - long past the standard six-month custody time limit set out in UK law. Prisons minister Lord Timpson has said the prisoners are charged with serious offences and remand decisions are for independent judges. At nearly 70 days, 31-year-old Heba Muraisi has spent the longest on hunger strike and her friends say her health is slowly deteriorating. Speaking to Sky News after visiting Muraisi on Tuesday, her friend Amareen Afzal said: \"I think she's lost over 10kg now. She looks very different to the photographs that you'll see of her. \"Her face is very gaunt, cheekbones are very prominent. She's physically exhausted, very tired. \"She is constantly suffering with headaches and lightheadedness. Sometimes she gets so lightheaded she feels nauseous and that's quite common.\" Ms Afzal said Muraisi \"struggles to sleep on one side of her body because it's too painful\". \"So she's aware that she's deteriorating and physically dying, you know, that her body could fail her at any moment,\" Ms Afzal added. \"I am obviously frightened for her and her life, I want her to be OK, but I'm incredibly proud of her and like completely in awe of her resilience and her. \"I think that word can be a little bit overused but I think there is something about her strength that comes from her commitment to her values. It is awe-inspiring to me.\" Hunger striker taken to hospital On Tuesday, Kamran Ahmed, 28, was admitted to hospital for a heart complication on day 58 of his hunger strike, his sister told Sky News. A letter signed by 50 MPs called on the government to \"respond positively and with humanity\" to the hunger strikers, warning of \"considerable alarm\" over Muraisi and Ahmed's deteriorating health. It said: \"Independent physicians have advised that they are into a critical phase stage, in which their condition is likely to decline very quickly and irreversibly.\" Birmingham-based neurologist Dr David Nicholl, who has studied prison hunger strikes for two decades, says the Palestine Action prisoners on hunger strike could be at serious risk of permanent harm and death. \"The biggest risk immediately is what's called refeeding syndrome,\" he said. \"If you picture yourself having not eaten for a number of days, you need to gradually - very gradually - increase your calorie intake. \"Because your body's not used to suddenly eating, there's a risk of getting very sick and actually people have died having stopped the hunger strike, but having developed refeeding syndrome.\" Dr Nicholl explained that even without death, months-long hunger strikes can leave lasting health implications, including neurological and cognitive disorders, dementia, vertigo, sight loss and extreme weakness. Ex-hunger striker describes health impact In 1981, Pat Sheehan was among a group of Republican prisoners who went on hunger strike in Northern Ireland. A total of 10 people died, including Bobby Sands, whose death is thought to have been a turning point in the Troubles. Mr Sheehan went without food for 55 days before the strike was called off. \"I was the longest on hunger strike when it ended. And in theory, I would have been the next person to die,\" he told Sky News. \"At that stage, I weighed about between 7 and 7.5 stone. I was completely yellow with jaundice. My eyesight had nearly gone completely. \"I could make out shapes coming into the room, but I wouldn't have been able to identify anyone.\" He added: \"I have always said that as I became weaker physically, there is absolutely no doubt that I became stronger psychologically.\" He said he knew he would not give up the hunger strike unless he was \"ordered to or we achieved all our demands\". One of those on hunger strike - Lewie Chiaramello, who is type 1 diabetic - has been fasting every other day. They all deny charges related to alleged break-ins or criminal damage at the UK subsidiary of the Israeli defence firm Elbit Systems in Bristol and a Royal Air Force base in Oxfordshire, carried out in the name of Palestine Action, before the group was banned under terrorism legislation. The trio say they will starve until Palestine Action is de-proscribed and until the UK ends support for companies that send weapons to Israel. They are also demanding immediate bail or transfers to prisons closer to home so family members can visit. Lord Timpson said: \"Prison healthcare teams provide NHS care and continuously monitor the situation. His Majesty's Prison and Probation Service is clear that claims that hospital care is being refused are entirely misleading - they will always be taken when needed and a number of these prisoners have already been treated in hospital. \"These prisoners are charged with serious offences including aggravated burglary and criminal damage. Remand decisions are for independent judges, and lawyers can make representations to the court on behalf of their clients. \"Ministers will not meet with them - we have a justice system that is based on the separation of powers, and the independent judiciary is the cornerstone of our system. It would be entirely unconstitutional and inappropriate for ministers to intervene in ongoing legal cases.\"  "
    },
    {
        "title": "Screen time linked to poor speech development in under-fives, say ministers as parents offered new guidance",
        "description": "Parents will be offered government guidance on screen time for under-fives as research links prolonged viewing to poor speech development.",
        "url": "https://news.sky.com/story/screen-time-linked-to-poor-speech-development-in-under-fives-say-ministers-as-parents-offered-new-guidance-13492957",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-baby-screen-time_7049062.jpg?20260110233149",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-10 23:01:00",
        "Headline": "It is reported that the advice is likely to suggest using screens as part of an activity like storytime or with educational games.",
        "Content": "Parents will be offered government guidance on screen time for under-fives as research links prolonged viewing to poor speech development. Education Secretary Bridget Phillipson is to announce on Monday that the advice will be developed with input from parents, children and early years practitioners. Writing in the Sunday Times, Ms Phillipson said: \"Research shows that by age two, almost all children - around 98% - are watching screens such as mobiles, tablets, and TV every day, during a critical period for language development.\" Government research, released to coincide with the announcement, suggests that the use of screens, including mobile devices and televisions, is linked to poorer language development in the under-twos. The survey of 4,758 parents showed that children with the highest screen time - around five hours a day - could say significantly fewer words than those at the other end of the scale, who watched for around 44 minutes. \"Parents, teachers and nursery workers talk about children arriving at nursery and school and finding it harder to hold conversations, focus, or engage in learning,\" Ms Phillipson added. It is reported that the guidance is likely to suggest using screens as part of an activity like storytime or with educational games. \n                  Will the fight for deputy Labour leader save the PM - or undermine his leadership even more?\n                 \n                  Starmer's national security adviser played no role in collapse of China spy trial, cabinet minister says\n                 \n                  UK played 'vital role' in Gaza peace deal, says Trump aide, after minister branded 'delusional'\n                 The guidance is also expected to be accompanied by lessons for parents on early years development, including speech and language. The topic of whether screentime - the amount of time spent daily using screen-based technology - is actually harmful for children is controversial. In October, the Princess of Wales warned that smartphones and computer screens were creating \"an epidemic of disconnection\" within families. And Peter Kyle, the then technology secretary, told Sky News in July he was considering a two-hour daily limit per social media platform for children to tackle \"compulsive\" screen time, although the policy was never implemented. In Australia, a law came into force in December to ban under-16s from having social media accounts. Although Sky News has shown that some young people are getting around the restrictions. It is an attempt to stamp out cyberbullying and online addiction, and several MPs have suggested the UK should copy the policy. Read more from Sky News:End of cold spell in sightPothole map of EnglandMacclesfield's FA Cup shock Data from the children's commissioner for England, released in April, revealed that 90% of secondary schools and 99.8% of primary schools already have policies in place that stop the use of mobile phones during the day. The terms of reference for the national working group to examine guidance on screen time will be published on Monday. The group will be led by children's commissioner for England Dame Rachel de Souza and scientific adviser Professor Russell Viner, who are expected to release the first guidance on the issue in April. Ms Phillipson said: \"I want this to be shaped with parents, not dictated to them, and we'll be using our engagement sessions over the next few weeks to understand exactly what they want the guidance to include. \"This is about offering clear, practical advice on how screens fit alongside the everyday activities that matter most in the early years, including talking, playing and reading together.\""
    },
    {
        "title": "Man dies after tree falls on to caravan during Storm Goretti",
        "description": "A man has died after a tree fell on to a caravan during Storm Goretti. ",
        "url": "https://news.sky.com/story/man-dies-after-tree-falls-on-to-caravan-during-storm-goretti-13492686",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-cornwall-falmouth-storm-goretti_7131815.jpg?20260110091455",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-10 08:40:00",
        "Headline": "Police said the body of a man in his 50s was found in a caravan in the Mawgan area of Helston, Cornwall.",
        "Content": "A man has died after a tree fell on to a caravan during Storm Goretti.  Emergency services were called at around 7.35pm to the Mawgan area of Helston, Cornwall, on Thursday, Devon and Cornwall Police said, and work took place on Friday to remove the tree. \"Tragically, a man aged in his 50s was located deceased within the caravan,\" the force said. \"His next of kin have been informed and are being supported by officers.\" The death is not being treated as suspicious. Gale force winds brought trees down across Cornwall, in areas including Penryn, Falmouth, St Stephen and Porthleven, after forecasters issued a rare red warning for the area earlier this week. Storm Goretti caused chaos across the South West and other parts of the UK, with about 27,000 properties still without power in the South West as of 9am on Saturday - along with almost 2,300 in the West Midlands and about 300 in the East Midlands, according to the National Grid's website. Downing Street said support was being offered to homes left without power. Following cuts in Wales, power across the country has since been restored. Yellow warnings for snow and ice continue remain in force until Sunday - raised to amber for parts of Scotland - and National Rail has warned that disruption may be seen through the weekend across England, Wales and Scotland. The storm brought heavy rain, snow and strong winds to much of the UK on Friday, with a low temperature of -12.3C (10F) recorded in Braemar in Scotland, the Met Office said. Some flights were cancelled because of the storm, and footage of Heathrow Airport showed a passenger plane swaying in strong winds as it came in to land. In Norfolk, residents of 14 clifftop homes in Hemsby were warned to leave as the storm left them in danger of \"imminent collapse\" on to the beach below. Forecasters have said melting snow and rain will increase the risk of flooding in the coming days. At Lake Vyrnwy in Powys, Wales, some 15cm of snow was recorded, while 7cm fell in Preston Montford in Shropshire and Nottingham. In Scotland, some 27cm of snow fell at Altnaharra in Sutherland, 26cm at Loch Glascarnoch and 22cm at Durris in Kincardineshire. Weather warnings still in place Yellow warnings for snow and ice are in place until 3pm, with further snowfall possible across parts of northern England and much of Scotland. A separate yellow warning for ice covers large parts of England and Wales until midday on Saturday as partially thawed snow refreezes, accompanied by wintry showers and freezing fog. On Sunday, a yellow warning for snow and ice will be in force fot the East and West Midlands, the North East and North West and Yorkshire from 2am until 3pm, the Met Office has said. An amber warning is in place for parts of Scotland from 3am to 2pm. There are three types of warnings based on the severity of the weather: yellow, amber or red. The Met says it chooses between the three by assessing both the impact the weather may have and the likelihood of those impacts occurring. Read more: What are weather warnings and how do they work? Despite the storm being over, there are still a few days of wintry hazards to come, said Sky News meteorologist Chris England, with up to 30cm of snow predicted for higher ground in Scotland. \"Looking at the more general forecast, today will be much calmer than recently but temperatures won't get much above freezing for many, and will stay below in places,\" he said. \"Sleet and snow showers will affect eastern England for a time, and northern and western Scotland into the evening. Ireland and Northern Ireland meanwhile will cloud over with patchy rain moving into the west later. \"Britain will see an extensive early frost tonight, bringing a risk of icy stretches, but cloud and rain, preceded by sleet, snow and perhaps freezing rain in the north, will spread to northern and western parts, lifting temperatures later. It'll turn windy too, with coastal gales developing. \"Tomorrow will bring rain to most, and potentially disruptive snow to the North East for a time, although that'll become increasingly confined to the hills as temperatures rise. It will stay very windy, with locally severe coastal gales, but it will turn much milder for most.\""
    },
    {
        "title": "Non-league Macclesfield knock holders Crystal Palace out of FA Cup in third round",
        "description": "Non-league Macclesfield FC, of the National League North, have knocked holders Crystal Palace out of the FA Cup, beating them 2-1 in the third round in the competition's biggest ever upset.",
        "url": "https://news.sky.com/story/non-league-macclesfield-knock-holders-crystal-palace-out-of-fa-cup-13492768",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-macclesfield-fa-cup_7131969.jpg?20260110144405",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-10 14:06:00",
        "Headline": "Saturday's result is the biggest shock in history in terms of league places between victors and the defeated - 117 places between the two. The previous biggest gap was 108.",
        "Content": "Non-league Macclesfield FC, of the National League North, have knocked holders Crystal Palace out of the FA Cup, beating them 2-1 in the third round in the competition's biggest ever upset. Paul Dawson and Isaac Buckley-Ricketts got the goals for the Silkmen at Moss Rose, before Yeremy Pino pulled one back for Palace late on. Macclesfield fans poured on to the pitch to celebrate the famous victory over their Premier League opponents, who won the trophy by beating Manchester City 1-0 at Wembley in May. Saturday's result is the biggest shock in history in terms of league places between victors and the defeated - 117 places between the two. The previous biggest gap was 108. It was the first time the holders had lost to non-league opposition since Palace themselves beat Wolves back in 1909 while in the Southern League. Macclesfield's captain Paul Dawson headed his side in front two minutes before half-time, and when asked about his header by BBC Sport, said \"I do get in quite a few every week\". In an illustration of their lowly status, he revealed he had helped clear snow from the pitch before Tuesday's league game against Radcliffe FC. \n                  UK weather: End of cold spell in sight as parts of country expected to have milder temperatures than Madrid\n                 \n                  Palestine Action activist on hunger strike for nearly 70 days 'deteriorating'\n                 \n                  Screen time linked to poor speech development in under-fives, say ministers as parents offered new guidance\n                 Dawson and his manager, John Rooney, dedicated the stunning win to Macclesfield's 21-year-old forward Ethan McLeod, who was killed in a car accident as he returned from last month's game at Bedford Town. Of the result, Rooney said: \"I can't believe it. Or get my head around it. I'm lost for words at the minute.\" Indicating the celebrating players and fans, he added: \"You can see the joy in them out there. \"I didn't think it was possible but there is that little bit of hope that anything can happen on the day.\" His side's shock win was watched by his brother, the former England and Manchester United striker, Wayne, who fought back tears, as he told the BBC he was \"so proud\". Praising his sibling's calmness, he said: \"I know he wanted the referee to blow his whistle but, at the end, he just turned round and did a little fist pump to the bench. He looked calm. I don't know how. \"But, you know, it's such an achievement. What he's achieved today, absolutely superb.\" North of England correspondent The bar at the Leasing.com Stadium is bouncing as fans, and their chairman, celebrate the biggest giant killing in FA Cup history. There are no shortage of takers for the karaoke microphone, and the goodwill, and the beer, is freely flowing. When Macclesfield Town went bust five years ago, few football fans in the town thought they'd ever enjoy something like this. Tonight they're singing the praises of the club, and its chairman Rob Smethurst. He bought the ground off Rightmove and allowed the phoenix of Macclesfield FC to fly. Three promotions in four years to reach the sixth tier of the football pyramid is an amazing start to his tenure. But today's win, over opposition 117 places above them, will eclipse everything that's gone before, and secure a place in football history for the club that so very nearly wasn't. Palace manager Oliver Glasner congratulated the winners, admitting his team \"deserved to lose\", adding he had \"no explanation\" for the result. \"You don't need tactics in these kinds of games. You just have to show what you're capable of, and show a little bit of pride and you'll perform in a different way. But today we lacked everything.\" Glasner had made six changes to his team but still picked England internationals Marc Guehi and Adam Wharton. Read more on Sky News:The cost of sacking Man Utd's managersFormer PL referee avoids jailTree falls on caravan, killing man Formerly known as Macclesfield Town, the Cheshire club was wound up in 2020 with debts of more than £500,000 and reformed as Macclesfield FC the same year, playing in the North West Counties Football League (NWCFL) Premier Division. The shock scoreline has echoes of other famous upsets by non-league teams in the world-famous tournament, such as Hereford's 2-1 win over Newcastle in 1972 and Blyth Spartans' 3-2 victory over Stoke City six years later."
    },
    {
        "title": "Elon Musk says backlash to AI chatbot deepfake images is 'excuse for censorship'",
        "description": "The UK government \"wants any excuse for censorship\", Elon Musk has said, amid a growing backlash over deepfake sexual images produced by his social media site X's artificial intelligence tool.",
        "url": "https://news.sky.com/story/elon-musk-says-backlash-to-ai-chatbot-deepfake-images-is-excuse-for-censorship-13492705",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-elon-musk-x-artificial-intelligence_7131790.jpg?20260110083527",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-10 09:49:00",
        "Headline": "Sir Keir Starmer has said X needs \"to get a grip of\" AI chatbot Grok, and he has asked Ofcom for \"all options to be on the table\".",
        "Content": "The UK government \"wants any excuse for censorship\", Elon Musk has said, amid a growing backlash over deepfake sexual images produced by his social media site X's artificial intelligence tool. Earlier this week, Prime Minister Keir Starmer said X needed \"to get a grip of\" its AI chatbot Grok, and he had asked media regulator Ofcom for \"all options to be on the table\". Indonesia temporarily blocked the chatbot on Saturday, becoming the ​first country to deny access to the AI tool. It comes after criticism from governments and regulators in Europe and Asia, with some opening inquiries into sexualised content. Earlier this week, the Internet Watch Foundation reported that criminals have been using Grok to create child sexual abuse imagery. On Friday, X appeared to have changed Grok's settings, with a message displayed by the chatbot saying image editing had been limited to paid subscribers - changes described as \"insulting\" by Downing Street. Appearing defiant, Musk later shared one X user's post criticising the Labour government for apparently focusing on his platform, pointing to claims of other AI programmes creating non-sexualised images of women in bikinis. \"They want any excuse for censorship,\" the tech billionaire said. Responding to further posts on Saturday, he shared one which asked: \"So what if Grok can put people in bikinis?\" and stated that \"millions\" of other apps can also do this. \"This isn't a new problem, it's a new tool,\" the post said. Musk has previously said on X that anyone using Grok ⁠to make illegal content would suffer ‌the same consequences as if they ‍had uploaded it. Criticism of X has focused on manipulation of photographs of real women to remove their clothes, and the reports of Grok's production of images of child abuse. Technology Secretary Liz Kendall has said she would back regulator Ofcom should X be blocked if it fails to comply with UK laws, saying: \"Sexually manipulating images of women and children is despicable and abhorrent.\" Ms Kendall said it was \"totally unacceptable for Grok to allow this if you're willing to pay for it\" and she expects an update on Ofcom's next steps \"in days, not weeks\". Ofcom is now undertaking an \"expedited assessment\" of the situation after making \"urgent contact\" with X over the reports. Read more:'I fought a robot and won'Cyber flashing made a priority offence The media watchdog has powers under the Online Safety Act to fine businesses up to £18m, or 10% of global revenue, as well as to take criminal action. It can also order payment providers, advertisers and internet service providers to stop working with a site, effectively banning them, though this would require agreement from the courts. Meanwhile, after the temporary block in Indonesia, communications and digital minister Meutya Hafid said the government \"views the practice of non-consensual ​sexual deepfakes as a serious violation of human rights, dignity, and the security of citizens in ‍the digital space\". The country has strict rules that ban the sharing of online content deemed obscene."
    },
    {
        "title": "'My daughter was diagnosed with childhood dementia before she turned four - what we were told is criminal'",
        "description": "The day before Sophia Scott celebrated her fourth birthday, her parents were summoned to a Glasgow hospital room.&#160;Five doctors stood waiting.",
        "url": "https://news.sky.com/story/my-daughter-was-diagnosed-with-childhood-dementia-before-she-turned-four-what-we-were-told-is-criminal-13492437",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sophia-dementia_7131252.jpg?20260109131500",
        "type": "UK",
        "Author": "Connor Gillies",
        "Date Published": "2026-01-10 00:01:00",
        "Headline": "Darren Scott says the diagnosis of his daughter's rare condition was \"delivered like a complete thunderbolt\" in a moment that \"shattered our lives\".",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n The day before Sophia Scott celebrated her fourth birthday, her parents were summoned to a Glasgow hospital room. Five doctors stood waiting. Within moments, they were given the worst possible news they could have heard: their daughter had childhood dementia and was unlikely to live beyond the age of 16. \"It was delivered like a complete thunderbolt,\" Darren Scott told Sky News. \"We were told... there was nothing they could do. It was a moment that broke us, shattered our lives. We have never recovered.\" The family, who live in Glasgow, were given an information sheet and phone number if they wanted advice - and then sent home. Very little was, and is, known about Sanfilippo syndrome, which is what Sophia is living with. It is one of more than 140 genetic, rare neurodegenerative, metabolic conditions. \"We were left on the street, vomiting outside the hospital, collapsing, being told our daughter was going to die,\" the 46-year-old dad said, in a highly emotional interview. What made this even more distressing was that, just moments before, life had been completely normal. How was Sophia diagnosed? Sophia's nursery had raised concerns about her reading abilities regressing. Her mum and dad ordered glasses and arranged some tests. The results left a once-bubbly, horse-obsessed, outdoor-loving girl now unable to speak or eat and walk by herself. There is no official data on exactly how many youngsters are living with childhood dementia, but campaigners at Alzheimer Scotland estimate there are at least 400 young people in Scotland alone. It is now almost a decade since Sophia's life-altering diagnosis was delivered. The Taylor Swift fan turns 15 years old in February. Darren said: \"Life has been robbed and stolen from Sophia. My little girl, who was all singing, all dancing, ballet, swimming, skiing... is having her life slowly and surely drained from her every day. I have to sit and watch that.\" Since her diagnosis a decade ago, Sophia has lost most of her abilities. Her family say she progressed like an average child up until the age of six, when her decline slowly began. \"Throughout that period, she has lost her speech, which is incredibly difficult,\" Darren said. \"Those last words begin to fade and you try to hold on to them.\" \"There is no support, there is no funding, there is no research, there are no trials,\" Darren added, as he drew comparisons with the vastly different approach for adults and elderly people suffering from dementia. Read more:'Breakthrough' test to spot Alzheimer's signsEx-Man Utd star said heading ball 'contributed to dementia' 'Race against time that we're losing' A recent report concluded parents and children dealing with dementia are being \"catastrophically failed\" due to a lack of knowledge and understanding of the condition. Alzheimer Scotland's Jim Pearson, who is the chair of Childhood Dementia Scotland, told Sky News: \"Children and families are often isolated. I think misdiagnosis is often the case. \"Getting a diagnosis is really difficult because actually what does happen is that it is sometimes misunderstood and mischaracterised. \"Children are often diagnosed with conditions like ADHD or potentially autism. Parents often have to fight... that journey for families can sometimes take two or three years.\" Darren has travelled the world meeting medical experts in a frantic attempt to find a cure that would help his daughter and many others. \"We were told she wouldn't live long, with an average life expectancy of 16,\" he said. \"Sophia will be 15 in February. It's criminal that we were given that timeline as it's forever embedded in our heads in this race against time that we're losing.\" The Scott family say clinical trials may finally be on the horizon. But for Sophia, whose condition is now advanced, they fear it could be too late."
    },
    {
        "title": "US 'stands ready to help' Iranian protesters, Trump says, as demonstrations against regime last two weeks",
        "description": "The US 'stands ready to help' Iranian protesters, Donald Trump has said, as demonstrations across the country enter their third week.",
        "url": "https://news.sky.com/story/iranian-protesters-to-be-charged-as-enemies-of-god-prosecutor-general-threatens-with-around-100-reportedly-arrested-13492803",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-tehran-protest_7132057.jpg?20260110165036",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-10 16:11:00",
        "Headline": "The number of those killed in the protests - arguably the biggest seen in the country since the 1979 Revolution - has risen from 62 to 65, according to the US-based Human Rights Activists News Agency",
        "Content": "The US 'stands ready to help' Iranian protesters, Donald Trump has said, as demonstrations across the country enter their third week. As demonstrations across Iran's 31 provinces in the country continue, officials have imposed a communications blackout, while state media is blaming the protests on \"terrorist agents\" from the US and Israel. The number of those killed in the protests - arguably the biggest seen in the country since the 1979 revolution - has risen from 62 to 65, according to the US-based Human Rights Activists News Agency. As it happened: Tehran blames US president for escalation Saturday also saw US President Donald Trump say Washington \"stands ready to help,\" while a Republican senator said the Iranian people's \"long nightmare is soon coming to a close\". The US president, who bombed Iran last summer, posted his support for the protesters on Truth Social. \"Iran is looking at FREEDOM, perhaps like never before,\" he said. \"The USA stands ready to help!!!\" \n                  Iran's regime is more vulnerable than it has ever been, but Khamenei shows no sign of relenting\n                 \n                  Reza Pahlavi: Who is the exiled crown prince positioning himself as a key figure in Iran's future after decades away?\n                 \n                  Iran's leaders facing most serious threat since 1979 revolution\n                 It's unclear what kind of support Mr Trump is referring to, and it comes a day after he said the US would hit Tehran \"very hard\" if the government \"start[s] killing people\" at the White House. Senator Lindsey Graham, a longtime critic of Iran's regime, also said on X: \"To the Iranian people: your long nightmare is soon coming to a close. \"Your bravery and determination to end your oppression has been noticed by [Trump] and all who love freedom. \"When President Trump says Make Iran Great Again, it means the protesters in Iran must prevail over the ayatollah.\" 'Enemies of god' death threat warning Earlier, Iran's prosecutor-general Mohammad Movahedi Azad reiterated threats to protesters that they would face charges of moharebeh, and be tried as \"enemies of god\". Moharebeh is punishable by the death penalty. The prosecutor-general added that the charge would apply to \"rioters and terrorists\" who damaged property and undermined security, and those who helped them. Tehran prosecutor Ali Salehi made the same threat to protesters on Friday, after Supreme Leader Ayatollah Ali Khamenei accused protesters of acting on behalf of Mr Trump. State news agency: 100 arrested in Baharestan It comes as the semi-official news agency Tasnim reports that 100 people have been arrested in a county in Tehran Province. The local governor told the agency, which is associated with Iran's Revolutionary Guards, that the detainees allegedly \"disrupted public order\" and \"used firearms and cold weapons against the people and security and law enforcement forces\" in the county of Baharestan. In the language of Iran's supreme leader, the anti-government protesters are referred to as \"vandals and rioters\". Protests in Iran began on 28 December over a sharp slide in the value of the rial currency, and have since transformed into the most significant challenge to the regime for several years. Protester climbs on London embassy balcony Meanwhile, protests in support of Iranian demonstrators have been held outside the country's embassy in London, as well as across Europe. Social media footage showed that a protester had climbed onto the balcony and removed an Iranian flag, replacing it with the former imperial flag. The Metropolitan Police said it was aware of the incident and added: \"Officers are on site and additional officers are being deployed to prevent any disorder.\" It added before 5.30pm that it had arrested two people: One for aggravated trespass and assault on an emergency worker, and one for aggravated trespass. Read more from Sky News:New footage of Minneapolis shooting filmed by ICE agentMoney blog: Is it time to give up the green belt?Man dies after tree falls on to caravan during Storm Goretti The force said it was seeking a third person on suspicion of trespass, but that it saw \"no serious disorder\". The pre-Islamic revolution lion and sun flag is often used by opposition groups in Iran, and was seen in footage of demonstrations in London."
    },
    {
        "title": "Iran's regime is more vulnerable than it has ever been, but Khamenei shows no sign of relenting",
        "description": "Mass protest is a long way from revolution.",
        "url": "https://news.sky.com/story/irans-regime-more-vulnerable-than-it-has-ever-been-but-khamenei-shows-no-sign-of-relenting-13492900",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-tehran-iran-protest_7132055.jpg?20260110164927",
        "type": "World",
        "Author": "Diana Magnay",
        "Date Published": "2026-01-10 18:28:00",
        "Headline": "The people of Iran have been here before with mass protests, and the Iranian authorities have honed their playbook. There is a long way to go in terms of how much they could crack down, and they have shown no sign of relenting.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n Mass protest is a long way from revolution. The people of Iran have been here before. In 2009, over perceived electoral fraud; in 2019, over fuel prices; in 2022, over the abuses of the morality police. The authorities have honed their playbook, through the thuggery of the revolutionary guard and the Basij militias, the killing of protesters, mass detentions, public executions and the shutting down of the internet. That last point is hugely significant. It means that people don't know if anyone else is going out. They can't connect. They won't know whether it's worth continuing to stick their heads above the parapet after the last two nights of protest, which had been signposted and communicated in advance. The videos they'll see are those on state TV where they'll hear the threats to use the death penalty on protesters dubbed 'vandals' or 'terrorists' and see pro-government crowds, and tempered but still sinister crackdowns. It is hard to keep momentum going across Iran's 31 provinces, especially a protest with no apparent leader (at least within Iran itself), if people are left in an information black hole. Reza Pahlavi, son of the former shah, clearly has some support on the streets, but he is in the US, and his calls for strikes and further protest may have problems filtering through. And of course, the shutdown allows the authorities to crack down as they choose, without the visibility that connectivity would confer on them. That's what happened in 2019 when at least 1,500 protesters were killed. We are still a long way from those kinds of numbers, although given the scarcity of information, it is hard to tell. The one barrier to the regime extending that blackout indefinitely is the economic toll it will take on an already gasping economy. But there is a long way to go in terms of how much they could crack down, and they have shown no sign of relenting. Revolutions would require elite buy-in - for elements of the security apparatus to decide that continuing to defer to the 86-year-old supreme leader no longer makes sense. That doesn't look like it's happening either. Read more:Who is Iran's exiled crown prince?Most serious threat since 1979 revolution The wild card is Donald Trump. He has promised to hit Iran hard if the regime opens fire on protesters. And then there is Israel, too, which might take the opportunity for another strike. Iran's Islamic theocracy is more vulnerable than it has ever been. But it was born of a revolution itself, and the Supreme Leader Ayatollah Ali Khamenei is not about to show weakness."
    },
    {
        "title": "Reza Pahlavi: Who is the exiled crown prince positioning himself as a key figure in Iran's future after decades away?",
        "description": "As Iran's leaders confront a serious challenge to their authority in the form of nationwide anti-government protests, the country's exiled crown prince is trying to position himself as a key figure in his homeland's future.",
        "url": "https://news.sky.com/story/reza-pahlavi-who-is-the-exiled-crown-prince-positioning-himself-as-a-key-figure-in-irans-future-after-decades-away-13492713",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-reza-pahlavi-iran_7131884.jpg?20260110114041",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-10 08:43:00",
        "Headline": "Reza Pahlavi has galvanised protests in Iran, helping to transform what started as grievances over the Islamic Republic's weakened economy into a serious threat to the country's theocracy.",
        "Content": "As Iran's leaders confront a serious challenge to their authority in the form of nationwide anti-government protests, the country's exiled crown prince is trying to position himself as a key figure in his homeland's future. Reza Pahlavi, 65, galvanised protesters on Thursday night, helping to transform what started as grievances over the Islamic Republic's weakened economy into a legitimate threat to the country's theocracy. But who is Mr Pahlavi, why has he lived outside of Iran for nearly 50 years and what are his chances of leading the country in the future? Iran latest: Marco Rubio throws weight behind Iran protests Who is Crown Prince Reza Pahlavi? Mr Pahlavi was born on 31 October 1960 and grew up in luxury as the crown prince of his father, Shah Mohammad Reza Pahlavi, after he inherited the throne from his own father, an army officer who seized power with support from the UK. Mr Pahlavi's father's power was shored up by a CIA-backed coup in 1953, and he went on to work closely with the US. The young crown prince once played rock music in the Niavaran Palace during then-US president Jimmy Carter's visit to Tehran on New Year's Eve, according to a biographer of his father. But problems lay ahead for the Peacock Throne. The Islamic Revolution Despite benefiting from rising oil prices in the 1970s, the shah's rule was beset by economic inequality and fears surrounding his SAVAK intelligence agency, which became notorious for repressing and torturing political dissidents. Millions protested against the shah, who was hampered by his inability to act and the poor decisions he made while secretly fighting terminal cancer. A year after Crown Prince Reza left Iran for flight school at a US air base in Texas in 1978, his father fled the country during the beginning of the Islamic Revolution, which saw Shia clerics establish Iran's theocratic government. After the death of his father, an exiled royal court announced Mr Pahlavi had assumed the role of shah on 31 October 1980 - the day of his 20th birthday. Read more:Iran's leaders facing most serious threat since 1979 revolution Attempts to gain influence during nearly five decades in exile Mr Pahlavi has attempted to gain influence in Iran during nearly five decades in exile, where he has mainly lived in the US, in Los Angeles and Washington, DC. In 1986, The Washington Post reported the CIA had supplied the prince's allies with \"a miniaturised television transmitter for an 11-minute clandestine broadcast\" from Mr Pahlavi, which pirated the signal of two stations in the Iranian Republic. During the broadcast, he reportedly said: \"I will return and together we will pave the way for the nation's happiness and prosperity through freedom.\" Mr Pahlavi has maintained his voice in discussions about Iran's future through social media videos, while Farsi-language news channels have highlighted his calls for further protests. What are his ideas for the future of Iran? In recent years, Mr Pahlavi has raised the idea that Iran could become a constitutional monarchy, perhaps with an elected ruler rather than a hereditary one, but has said it would be up to Iranians to choose. However, while exiled Iranian monarchists have dreamed of a return of Mr Pahlavi's dynasty, his attempts to garner a wider appeal have been stunted by several reasons, including unhappy memories of life under his father's rule, concerns he and his family are out of touch with modern-day Iran, and younger generations in the country having been born decades after the end of the shah's rule. He has also been criticised for his support of Israel, especially after the 12-day war between Israel and Iran in June last year. In 2023, he met Prime Minister Benjamin Netanyahu in Israel, and the country has supported him in turn. US President Donald Trump has indicated he is not currently inclined to meet Mr Pahlavi, suggesting he is waiting to see the result of the protests before he backs an opposition leader. While the outcome of the protests across Iran remains to be seen, it is unclear whether demonstrators shouting messages of support for the shah are backing Mr Pahlavi or voicing their desire to return to a time before the country's Islamic Revolution."
    },
    {
        "title": "JD Vance agrees sexualised AI deepfakes 'entirely unacceptable,' Lammy says",
        "description": "David Lammy has said that US vice president JD Vance agrees that sexualised AI-generated deepfakes - such as those made using Elon Musk's Grok - are \"entirely unacceptable\".",
        "url": "https://news.sky.com/story/jd-vance-agrees-sexualised-ai-deepfakes-entirely-unacceptable-lammy-says-13492879",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-jd-vance-white-house_7132164.jpg?20260110181813",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-10 17:46:00",
        "Headline": "The Internet Watch Foundation reported that criminals have been using Grok to create child sexual abuse imagery. JD Vance - who has been a proponent of AI technology - has not commented publicly on the reports. ",
        "Content": "David Lammy has said that US vice president JD Vance agrees that sexualised AI-generated deepfakes - such as those made using Elon Musk's Grok - are \"entirely unacceptable\". The deputy prime minister told The Guardian that Mr Vance expressed concern about how artificial intelligence was being used to create \"hyper-pornographied slop\" online when they met in Washington on Thursday. After discussing Greenland, Mr Lammy said: \"I also raised with him the Grok issue and the horrendous, horrific situation in which this new technology is allowing deepfakes and the manipulation of images of women and children, which is just absolutely abhorrent. \"He agreed with me that it was entirely unacceptable.\" Since the start of the new year, X users - mainly women - have reported that accounts have used Grok to generate images of them without clothing. And earlier this week, the Internet Watch Foundation reported that criminals have been using Grok to create child sexual abuse imagery. X appeared to have changed Grok's settings in response, with a message displayed by the tool saying image editing and generation had been limited to paid subscribers. \n                  No 10 hits out at 'insulting' changes to Musk's Grok chatbot after deepfake warning\n                 \n                  'Get a grip' on Grok, Starmer tells X after AI tool is used for child sex images\n                 \n                  Illegal child abuse material generated by X's artificial intelligence Grok, says UK watchdog\n                 But these changes were described as \"insulting\" by Downing Street, while Prime Minister Sir Keir Starmer said that X needed \"to get a grip of\" Grok, and he had asked media regulator Ofcom for \"all options to be on the table\". Appearing defiant, Musk later shared one X user's post criticising the Labour government for apparently focusing on his platform, pointing to claims of other AI programmes creating non-sexualised images of women in bikinis. \"They want any excuse for censorship,\" the tech billionaire said. Musk had also previously said on X that anyone using Grok ⁠to make illegal content would suffer ‌the same consequences as if they ‍had uploaded it. In the interview with The Guardian, Mr Lammy said that he felt Mr Vance \"recognised the very seriousness with which images of women and children could be manipulated in this way\". The deputy prime minister then added: \"He recognised how despicable, unacceptable, that is and I found him sympathetic to that position. And in fact, we've been in touch again, today, about this very serious issue.\" \"He confirmed with me that he had seen that there had been some changes announced by X as of this morning.\" Read more from Sky News:New footage of Minneapolis shooting filmed by ICE agentMan dies after tree falls on to caravan during Storm Goretti Sources at the meeting in Washington also told the outlet that Mr Vance raised concerns about the use of AI and how it was fuelling \"hyper-pornographied slop\". As of writing, Mr Vance - who has been a long-standing proponent of AI technology - has not commented publicly on Grok."
    },
    {
        "title": "Philippines: Signs of life detected from rubbish avalanche which killed four in Cebu City ",
        "description": "Signs of life have been detected by rescuers searching for more than 30 people missing after an avalanche of rubbish that left four workers dead at a landfill site in the central Philippines.",
        "url": "https://news.sky.com/story/philippines-signs-of-life-detected-from-rubbish-avalanche-which-killed-four-in-cebu-city-13492752",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-philippines-landfill_7131893.jpg?20260110120532",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-10 15:01:00",
        "Headline": "Twelve injured staff have been pulled out of the debris after a huge mound of refuse collapsed at a waste management facility on Friday and, with dozens missing, rescue efforts will now be increased.",
        "Content": "Signs of life have been detected by rescuers searching for more than 30 people missing after an avalanche of rubbish that left four workers dead at a landfill site in the central Philippines. Twelve injured staff have been pulled out of the debris after a huge mound of refuse collapsed at a waste management facility in the village of Binaliw in Cebu City on Thursday, authorities said, and rescue efforts will now be increased. Dozens of rescuers, including police, firefighters and disaster responders have braved dangerous conditions to scour the rubble of twisted tin roofs, iron bars, and combustible heaps of debris in their hunt for 36 people who are still unaccounted for. Minneapolis latest - new footage of ICE shooting Cebu City mayor Nestor Archival said detected signs of life had been confirmed \"in specific areas, requiring continued careful excavation\". A more advanced 50-tonne crane is being brought to the site, he said. The safety of rescue teams \"remains paramount\", he said, pointing to dangers posed by \"unstable debris and acetylene risks, prompting adjustments to the security perimeter and controlled access\". \n                  Philippines: Two dead and 35 missing after landfill collapse sends avalanche of rubbish into village\n                 \n                  This 56-year conflict still pauses for Christmas\n                 \n                  Bondi Beach shooting: Inside hotel where alleged gunmen stayed during trip being investigated by police\n                 An engineer and a female office worker were among the four who died, who were all employees of the landfill and waste management facility whose staff numbered 110, according to the mayor and police. Initially, it was reported that two people had died, with 36 missing, but on Saturday, Mr Archival increased the number of dead to four, but did not provide an updated number of people missing. It's not clear what caused the collapse of the rubbish mountain, but the Associated Press, quoting a survivor, said it happened in an instant without any warning despite fairly good weather at the time. Local media outlet Philstar pointed to heavy rainfall brought by Typhoon Tino and an earthquake last year, which left the ground unstable. Jaylord Antigua, a 31-year-old office worker at the landfill, said the wall of refuse destroyed the administrative office he was in. He suffered bruises on his face and arms after crawling in darkness through rubble and debris to escape. \"I saw a light and crawled toward it in a hurry, because I feared there will be more landslides,\" Mr Antigua said. \"It was traumatic. I feared that it was my end, so this is my second life.\" Mr Archival said preparations are being made to \"manage the looming garbage collection issue\" in Cebu, a bustling port city of nearly a million people that serves as a regional hub for trade, commerce and tourism. Such landfills and open dump sites have long been a source of safety and health concerns throughout the Philippines, especially in areas close to poor communities where many residents scavenge for junk and leftover food in the garbage heaps. More than 200 people died and many more were declared missing after a huge rubbish mound in a shantytown in Quezon City near the capital, Manila, collapsed in 2000."
    },
    {
        "title": "Russia's use of hypersonic missile brings fresh threat to Europe and NATO",
        "description": "Russia's inclusion of the Oreshnik intermediate-range ballistic missile (IRBM) in its latest missile and drone strikes on Ukraine has drawn attention well beyond the immediate battlefield - raising urgent questions about the wider security implications for Europe and NATO alike.",
        "url": "https://news.sky.com/story/russias-use-of-hypersonic-missile-brings-fresh-threat-to-europe-and-nato-13492571",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-oreshnik-missile_7131520.jpg?20260109175835",
        "type": "World",
        "Author": "Victoria Taylor, defence analyst",
        "Date Published": "2026-01-10 00:01:00",
        "Headline": "With a reported range of up to 5,500 kilometres, the Oreshnik ballistic missile theoretically puts much of Europe within reach.",
        "Content": "By Victoria Taylor, defence analyst  Russia's inclusion of the Oreshnik intermediate-range ballistic missile (IRBM) in its latest missile and drone strikes on Ukraine has drawn attention well beyond the immediate battlefield - raising urgent questions about the wider security implications for Europe and NATO alike. The nuclear-capable, hypersonic missile was launched against Lviv on 8 January as part of an intensive overnight attack on western, central and southeastern Ukraine, comprising 278 Russian missiles and drones. While the physical damage caused specifically by the Oreshnik strike in Lviv was largely contained to the workshop of a state enterprise, the significance of this attack lies in what it signals rather than what it destroyed. With a reported range of up to 5,500 kilometres, it theoretically puts much of Europe within reach. Its immense speed of Mach 10-11, too, is integral to its danger: the faster a missile travels, the less time missile defence systems have to detect, track and intercept it. The Royal United Services Institute has previously assessed that an IRBM travelling at Mach 10 could reach Britain within 10 minutes if launched from western Russia. While Ukraine has hit successful missile interception rates of 80% in the past, this dropped to a new low of 54% shot down or suppressed by the last quarter of 2025; hypersonic ballistic missile systems are designed to reduce those interception rates even further. \n                  Russia fires hypersonic missile at target in Ukraine near NATO border\n                 \n                  Military action in Greenland 'always an option' says White House\n                 \n                  Could Trump go for Greenland or Cuba next?\n                 Some defence analysts have questioned whether Oreshnik is as groundbreaking as Vladimir Putin has often claimed, suggesting it may be a modified version of the existing RS-26 Rubezh IRBM missile. Read more:Russia fires hypersonic missile at Ukraine near NATO borderWhat we know about the hypersonic Oreshnik missile Nevertheless, Ukraine's foreign minister Andrii Sybiha described Oreshnik as a \"grave threat\" to European security. It is easy to see why: the missile struck infrastructure in the western Ukrainian city of Lviv, around 40 miles from the Polish border. Poland, of course, has already had its nerves tested by the Kremlin on numerous occasions, most notably experiencing an incursion of its airspace by Russian drones in September 2025. This brings the use of such a system ever closer to NATO territory than its previous use in November 2024, which struck at the central Ukrainian city of Dnipro. Initial assessments suggest that the latest Oreshnik strike, as with the last one, may have carried inert, non-explosive warheads, limiting the immediate destruction caused by the missile itself. However, defence experts stress that showcasing the missile's capabilities - speed, range and survivability - is the real message from the Russians. The timing of the launch is especially pointed given Russia's recent changes to its nuclear deterrence doctrine and lowering of its threshold for a nuclear response. Even more concernedly, it comes just after Moscow's heated warning that any British and French military \"units and facilities\" deployed to Ukraine under any future peace deal would be considered legitimate targets. Given Oreshnik's reputation as a missile that can \"pulverise\" underground bunkers, the wider security implications for Ukrainian and NATO infrastructure, like military and storage facilities (not to mention their personnel), cannot be ignored. With Putin having expressed his intentions to employ the missile with more conventional payloads as well, a more frequent appearance of Oreshnik in the war with Ukraine cannot be ruled out entirely. For now, though, its rare appearances have added to both its menace and mystique. Oreshnik, then, is more than just a military weapon deployed against Ukraine: it can also be read as a warning shot from the Kremlin against what it calls \"foreign interference\" from Ukraine's Western allies and partners. While the most recent Oreshnik strike may not represent an imminent military threat to NATO, it does raise the strategic temperature, exposes vulnerabilities in Western missile defences, and forces NATO leaders to consider worst-case scenarios - underlining just how closely the war in Ukraine is tied to European security more broadly."
    },
    {
        "title": "Patagonia: Wildfires sweep across parts of southern Argentina, forcing thousands to flee",
        "description": "Wildfires have swept across a popular tourist destination in the Argentine Patagonia, destroying a large area of forest, destroying properties, and forcing at least 3,000 people to flee.",
        "url": "https://news.sky.com/story/patagonia-wildfires-sweep-across-parts-of-southern-argentina-forcing-thousands-to-flee-13492731",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-patagonia-argentina_7131843.jpg?20260110095635",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-10 12:00:00",
        "Headline": "Around 3,000 hectares (30 square km) of forest in parts of southern Argentina have been burned since Monday, fuelled by drought conditions and strong winds.",
        "Content": "Wildfires have swept across a popular tourist destination in the Argentine Patagonia, destroying a large area of forest, destroying properties, and forcing at least 3,000 people to flee. Around 3,000 hectares (30 square km) of forest in parts of southern Argentina have burned since Monday, fuelled by drought conditions and strong winds. A vast area of the Comarca Andina, one of the top tourist destinations in the heart of the Andes Mountains, has been damaged. Minneapolis latest - new footage of ICE shooting Officials in Chubut province said helicopters, amphibious planes, and air tankers have been helping workers to extinguish the flames, their efforts hampered by massive columns of smoke, which have reduced visibility for ground crews. The province's governor, Ignacio Torres, warned on Instagram on Saturday that \"the next 48 hours are vital\" as he urged the entire community to remain alert. Mr Torres, who said on Wednesday that \"more than 3,000 tourists\" had been moved away from the Puerto Patriada lake resort along with a few dozen locals, said \"eight aircraft are operating in different sectors of the [Puerto Patriada] fire\" along with \"additional aircraft and support firefighters from Chile and Córdoba\". His post gave different details on the firefighting effort and the spread of the fires, saying nearly 500 people, including firefighters, rescuers, security forces, and support personnel, are fighting the blazes, which have consumed \"more than 5,500 hectares (55 square km) of fields and native forest\". Their efforts in the most critical sectors include \"reinforcing firebreaks, cooling hotspots, and opening and widening roads,\" he said. The affected area includes the Argentine Patagonia towns of El Bolson, Lago Puelo, and El Hoyo, known for their mountains, lakes, and forests popular with walkers. Forest fires are common during the Argentine summer, from December and March, thanks to high temperatures, strong winds, and drought. Argentina's National Fire Management Service has issued a red alert for fire danger in eight central and southern provinces. The first large-scale fire recorded in 2026 comes one year after the worst forest fires in decades razed tens of thousands of hectares in Patagonia, destroyed dozens of homes, and left one person dead."
    },
    {
        "title": "Video shows masked Israeli settlers beating 67-year-old deaf Palestinian man in West Bank",
        "description": "Footage has shown dozens of masked Israeli settlers armed with sticks beating an elderly Palestinian man in the occupied West Bank.",
        "url": "https://news.sky.com/story/video-shows-masked-israeli-settlers-beating-palestinian-man-in-west-bank-13492758",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-west-bank-security-camera-footage_7131955.jpg?20260110141522",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-10 12:39:00",
        "Headline": "Workers at the plant nursery fled after seeing the settlers approaching, but 67-year-old Basim Saleh Yassin is deaf and couldn't hear the warnings to leave, two people who witnessed the attack told the Associated Press.",
        "Content": "Footage has shown dozens of masked Israeli settlers armed with sticks beating an elderly Palestinian man in the occupied West Bank. Security footage published by the Associated Press showed the men, who are dressed mostly in black, hitting and kicking the man after he falls to the ground during an attack on a plant nursery in the village of Deir Sharaf. Workers at the nursery fled after seeing the settlers approaching on Thursday, but 67-year-old Basim Saleh Yassin is deaf and couldn't hear the warnings to leave, two people who witnessed the attack and are members of the family that owns the facility told the news agency. The video shows Mr Yassin attempting to run away from the group before falling to the floor. One man kicks him as he kneels on the ground, while another repeatedly beats him with what appears to be a stick. Mr Yassin then places his hands on the ground, on all fours. As the men leave, two run past and kick him before another kicks him in the head. Two then approach and beat him with what appear to be sticks until he falls back to the ground. The witnesses said Mr Yassin was in hospital with broken bones in his hand and other injuries to his face, chest and back. They said four cars were burned and destroyed at the nursery. Read more:How attacks by settlers on Palestinians in West Bank increased during Gaza conflict Rising Israeli settler violence It is the latest attack amid rising Israeli settler violence in the West Bank. Attacks increased during the Palestinian olive harvest season in October and early November and have continued since then. Israeli Prime Minister Benjamin Netanyahu has called the perpetrators \"a handful of extremists\" and urged law enforcement to pursue them for \"the attempt to take the law into their own hands\". However, rights groups and Palestinians have argued the problem is much wider and attacks have become daily events across the territory. Security forces condemn violence Israel's army said it dispatched soldiers to the Shavei Shomron junction near to the area of the attack after reports of dozens of masked Israelis vandalising property. It said the Israelis set fire to Palestinian vehicles and assaulted a Palestinian in one of the vehicles. Two Palestinians were evacuated for medical treatment. The army said it apprehended three suspects, who were transferred to a police station for questioning. It said: \"Security forces condemn violence of any kind\"."
    },
    {
        "title": "Russian oil depot fire after Ukrainian drone strike - as UN to meet over hypersonic missile attack",
        "description": "A drone strike by Ukraine has caused a fire at an oil depot in Russia's southern Volgograd region, according to regional authorities.",
        "url": "https://news.sky.com/story/russian-oil-depot-fire-after-ukrainian-drone-strike-as-un-to-meet-over-hypersonic-missile-attack-13492804",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-ukraine-drone-long-range_7132040.jpg?20260110162850",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-10 16:03:00",
        "Headline": "For only the second time in the full-scale invasion, Russia used an Oreshnik hypersonic missile that struck western Ukraine on Friday, in a warning to Kyiv's NATO allies.",
        "Content": "A drone strike by Ukraine has caused a fire at an oil depot in Russia's southern Volgograd region, according to regional authorities. In a post on Telegram, the local governor ‍Andrei Bocharov said there ‌had been no casualties reported so far. He did not specify damage, but said ​people living nearby may have to be evacuated. The Ukrainian military said it had struck the Zhutovskaya oil depot overnight, which was reportedly supplying fuel to Russian forces. The strike came a day after Russia attacked Ukraine using hundreds of drones and dozens of missiles overnight into Friday, killing at least four people in the capital Kyiv, according to Ukrainian officials. For only the second time in the full-scale invasion which began in February 2022, Russia used an Oreshnik hypersonic missile that struck western Ukraine on Friday, in a warning to Kyiv's NATO allies. Europe's leaders condemned the Russian strike as \"escalatory and unacceptable,\" and Ukraine's foreign minister Andrii Sybiha said the UN ​Security ​Council would hold ‍an emergency meeting on 12 January ‌to discuss ‌the attack. \n                  Russia's use of hypersonic missile brings fresh threat to Europe and NATO\n                 \n                  Russia fires hypersonic missile at target in Ukraine near NATO border\n                 \n                  What we know about 'ghost fleet' oil tankers seized by US - as Russia responds\n                 Ukraine's military has reported the missile reaching speeds of more than 8,000mph. A senior Ukrainian official said the missile, which can carry nuclear as well as conventional warheads, struck a state enterprise in the western city of Lviv, about 40 miles from the border with NATO member Poland. They added it was likely to have been carrying a \"dummy\" warhead - as in 2024 when Russia first fired it to test the weapon in war. Moscow claimed the use of the weapon was in retaliation for the alleged targeting of one of Russian President Vladimir Putin's residences by Ukraine, a claim that has been dismissed by US President Donald Trump, and Ukraine. Russia is seeking to cripple the Ukrainian power grid, as it tries to deny civilians access to heat, light and running water in what Kyiv officials say is an attempt to \"weaponise winter\". Read more:What we know about Oreshnik missileTwo Russian citizens aboard captured oil tanker released Ukraine has been targeting Russia's energy ‌infrastructure in recent months, ⁠trying to cut off ‌Moscow's ability to finance ‍its military campaign against Kyiv with its oil export revenue. The attacks came amid reports of significant progress in talks between Ukraine and its allies on how to defend the country from further Moscow aggression if a US-led peace deal is struck. Earlier this week, the UK and France signed a joint declaration pledging to deploy troops to Ukraine in the event of such an agreement, to guarantee the nation's security. The agreement states that a \"multinational force for Ukraine\" would be deployed to the eastern European country to deter further attacks from Russia and bolster security guarantees. This would also allow the Ukrainian armed forces to rebuild strength, Prime Minister Sir Keir Starmer announced."
    },
    {
        "title": "Thousands march against Renee Good's killing in Minneapolis as hundreds of protests planned across US",
        "description": "Thousands of people have marched in Minneapolis to protest against the killing of US mother-of-three Renee Good.",
        "url": "https://news.sky.com/story/thousands-march-against-renee-goods-killing-as-hundreds-of-protests-planned-across-us-13492955",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-minneapolis-protest_7132313.jpg?20260110230249",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-10 22:46:00",
        "Headline": "The demonstration in Minneapolis was one of hundreds of protests planned in towns and cities across the US over the weekend, demanding an end to large-scale deployments of ICE agents.",
        "Content": "Thousands of people have marched in Minneapolis to protest against the killing of US mother-of-three Renee Good. The 37-year-old driver was shot dead in her car in the Minnesotan city on Wednesday by an Immigration and Customs Enforcement (ICE) officer. The Trump administration said the shooting was an act of self-defence by the agent, suggesting Ms Good used her vehicle as a weapon to attack him. But state and local officials, as well as protesters, have rejected that characterisation, with her supporters saying they believe she steered away from the officer. On Friday, mobile phone footage showed the moments around her death, filmed by the agent who shot her, named in US media as Jonathan Ross. The video, which was reshared by the US vice president JD Vance on X, shows another ICE agent saying to Ms Good: \"Get out of the f***ing car.\" Ross is at the front driver side of the SUV. Ms Good reverses briefly, then turns the steering wheel towards the passenger side as she drives ahead and Ross opens fire. It is unclear if the car hits the officer or narrowly misses him. \n                  New footage shows Minneapolis shooting, filmed by ICE agent who fired gun\n                 \n                  Wife of woman shot dead by ICE officer says 'we had whistles, they had guns' as she pays tribute\n                 \n                  Fatal ICE shooting in Minneapolis: What we know \n                 Another video was released on Saturday by Homeland Security, which said on X: \"New evidence shows that the anti-ICE agitator was STALKING and IMPEDING a law enforcement operation over the course of the morning.\" The shooting happened on the second day of the Trump administration's immigration crackdown on the cities of Minneapolis and St Paul. The demonstration was one of hundreds of protests planned in towns and cities across the US over the weekend, demanding an end to large-scale deployments of ICE agents. Federal-state tensions escalated further on Thursday when a US Border Patrol agent in Portland, Oregon, shot and wounded a man and woman in their car after an attempted vehicle stop. The Department of Homeland Security said the driver had tried to \"weaponise\" his vehicle and run over agents. Minneapolis mayor Jacob Frey has urged demonstrators to remain peaceful, saying any unlawful action would play into Donald Trump's hands. On Friday night, about 1,000 people protested outside a hotel in the city that was believed to house ICE agents. The demonstration turned violent as protesters threw ice, snow and rocks at officers, said police chief Brian O'Hara. He added a police officer was injured when a chunk of ice was hurled at them, and 29 people were arrested during the unrest. Read more:Renee Good's wife pays tribute to herWhy are ICE agents in Minneapolis? Mr Frey, who ​has been critical of immigration agents and the shooting, said anyone damaging property or engaging in other unlawful activity would be detained. \"We will not counter Donald Trump's chaos with our own brand of chaos,\" the mayor said at a news conference. \"He wants us to take the bait.\" Minnesota governor Tim Walz echoed the call for peaceful demonstrations. \"Trump sent thousands of armed federal officers into our state, and it took just one day for them to kill someone,\" Mr Walz posted on social media. \"Now he wants nothing more than to see chaos distract from that horrific action. Don't give him what he wants.\""
    },
    {
        "title": "Six dead, including child, after shooting in Mississippi near Alabama border",
        "description": "Six people, including a child, have died after a mass shooting in Mississippi, authorities said at a news conference.",
        "url": "https://news.sky.com/story/six-dead-including-child-after-shooting-in-mississippi-near-alabama-border-13492912",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-mississippi-clay-county_7132267.png?20260110204509",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-10 19:35:00",
        "Headline": "Clay County Sheriff Eddie Scott said the victims - four of whom were family members related to the suspect - were shot at three separate locations late on Friday.",
        "Content": "Six people, including a child, have died after a mass shooting in Mississippi, authorities said at a news conference. The shootings took place in the rural community of Cedarbluff, west of the county seat of West Point, near the Alabama border, on Friday night. Daricka M Moore, 24, has been charged with first-degree murder, authorities said on Saturday, adding that the charge could be upgraded to capital murder and that the suspect may face additional murder charges. Clay County Sheriff Eddie Scott said the victims - four of whom were family members related to the suspect - were shot at three separate locations. The child victim was the suspect's second cousin. The sheriff added: \"I don't know what kind of motive you could have to kill a seven-year-old.\" Mr Scott also said that investigators believe Moore placed a gun to the head of a younger child at the home where the seven-year-old died. Investigators are not sure whether the gun misfired, and officials said a third child and their mother were present in that house as well. Moore is set to appear in court on Monday, the sheriff said."
    },
    {
        "title": "JD Vance agrees sexualised AI deepfakes 'entirely unacceptable,' Lammy says",
        "description": "David Lammy has said that US vice president JD Vance agrees that sexualised AI-generated deepfakes - such as those made using Elon Musk's Grok - are \"entirely unacceptable\".",
        "url": "https://news.sky.com/story/jd-vance-agrees-sexualised-ai-deepfakes-entirely-unacceptable-lammy-says-13492879",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-jd-vance-white-house_7132164.jpg?20260110181813",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-10 17:46:00",
        "Headline": "The Internet Watch Foundation reported that criminals have been using Grok to create child sexual abuse imagery. JD Vance - who has been a proponent of AI technology - has not commented publicly on the reports. ",
        "Content": "David Lammy has said that US vice president JD Vance agrees that sexualised AI-generated deepfakes - such as those made using Elon Musk's Grok - are \"entirely unacceptable\". The deputy prime minister told The Guardian that Mr Vance expressed concern about how artificial intelligence was being used to create \"hyper-pornographied slop\" online when they met in Washington on Thursday. After discussing Greenland, Mr Lammy said: \"I also raised with him the Grok issue and the horrendous, horrific situation in which this new technology is allowing deepfakes and the manipulation of images of women and children, which is just absolutely abhorrent. \"He agreed with me that it was entirely unacceptable.\" Since the start of the new year, X users - mainly women - have reported that accounts have used Grok to generate images of them without clothing. And earlier this week, the Internet Watch Foundation reported that criminals have been using Grok to create child sexual abuse imagery. X appeared to have changed Grok's settings in response, with a message displayed by the tool saying image editing and generation had been limited to paid subscribers. \n                  No 10 hits out at 'insulting' changes to Musk's Grok chatbot after deepfake warning\n                 \n                  'Get a grip' on Grok, Starmer tells X after AI tool is used for child sex images\n                 \n                  Illegal child abuse material generated by X's artificial intelligence Grok, says UK watchdog\n                 But these changes were described as \"insulting\" by Downing Street, while Prime Minister Sir Keir Starmer said that X needed \"to get a grip of\" Grok, and he had asked media regulator Ofcom for \"all options to be on the table\". Appearing defiant, Musk later shared one X user's post criticising the Labour government for apparently focusing on his platform, pointing to claims of other AI programmes creating non-sexualised images of women in bikinis. \"They want any excuse for censorship,\" the tech billionaire said. Musk had also previously said on X that anyone using Grok ⁠to make illegal content would suffer ‌the same consequences as if they ‍had uploaded it. In the interview with The Guardian, Mr Lammy said that he felt Mr Vance \"recognised the very seriousness with which images of women and children could be manipulated in this way\". The deputy prime minister then added: \"He recognised how despicable, unacceptable, that is and I found him sympathetic to that position. And in fact, we've been in touch again, today, about this very serious issue.\" \"He confirmed with me that he had seen that there had been some changes announced by X as of this morning.\" Read more from Sky News:New footage of Minneapolis shooting filmed by ICE agentMan dies after tree falls on to caravan during Storm Goretti Sources at the meeting in Washington also told the outlet that Mr Vance raised concerns about the use of AI and how it was fuelling \"hyper-pornographied slop\". As of writing, Mr Vance - who has been a long-standing proponent of AI technology - has not commented publicly on Grok."
    },
    {
        "title": "Abu Dhabi steel group eyes takeover of Gupta's UK empire",
        "description": "A UAE-based steel company has made an approach to buy Britain's third-biggest steel producer, months after it was declared \"hopelessly insolvent\" and fell into the hands of the Official Receiver.",
        "url": "https://news.sky.com/story/abu-dhabi-steel-group-eyes-takeover-of-guptas-uk-empire-13492700",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-liberty-steel-sanjeev-gupta_6996353.jpg?20250820171224",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-10 07:44:00",
        "Headline": "Arabian Gulf Steel Industries is among a small number of parties which have approached the Official Receiver about buying the UK's third-biggest steelmaker out of insolvency, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A UAE-based steel company has made an approach to buy Britain's third-biggest steel producer, months after it was declared \"hopelessly insolvent\" and fell into the hands of the Official Receiver. Sky News has learnt that Arabian Gulf Steel Industries (AGSI), which is headquartered in Abu Dhabi, is among a small number of parties which have lodged proposals to take control of the Speciality Steels UK (SSUK) business which until last summer was owned by the metals tycoon Sanjeev Gupta's Liberty Steel empire. The business collapsed into compulsory liquidation in August, sparking a scramble in Whitehall to find a buyer for it as part of efforts to preserve the UK's steelmaking capabilities. The SSUK business operates sites at Rotherham and Stocksbridge in South Yorkshire, and across its operations employed close to 1,500 people when it collapsed last summer. This weekend, it was unclear how advanced any discussions were between AGSI and the Official Receiver, while the terms of any proposal were also unclear. One source suggested that AGSI might be keen to secure financial backing from Britain's National Wealth Fund to support a takeover of SSUK and fund a resumption of steelmaking at its sites in Yorkshire. AGSI describes itself on its website as \"the epitome of Net Zero steel\", and has pledged to produce five million tons of steel by 2030, while reducing carbon dioxide emissions by more than 95% compared to traditional steelmaking processes. The company is privately owned and run by its founder and chief executive, Asam Hussain. AGSI did not respond to an emailed request for comment, but one source expressed scepticism that it would ultimately acquire the Liberty Speciality Steels business. A number of other parties have also expressed interest in buying the operations in recent months. Mr Gupta himself had secured backing from third parties including Blackrock, the world's biggest asset manager, although the prospect of him being chosen to repurchase the business appears to be extremely remote. An Insolvency Service spokesperson said: \"We can confirm that the Official Receiver continues to progress bids for the sale of Speciality Steel UK. \"The sales process is ongoing, with the aim to complete a sale at the earliest opportunity.\" In response to an enquiry from Sky News, a government spokesperson said: \"We remain committed to a bright and sustainable future for steelmaking and steelmaking jobs in the UK. \"The independent Official Receiver is carrying out his duties as liquidator, while we also make sure staff and local communities are supported.\" The National Wealth Fund failed to respond to an enquiry from Sky News. The sale process for SSUK comes during a period of broader uncertainty for the British steel sector, against the backdrop of US President Donald Trump's tariffs regime and a continued global glut of the metal. In November, Sky News revealed that ministers were drafting in bankers at Evercore to conduct a review of options for the industry. Peter Kyle, the business secretary, and UK Government Investments (UKGI), the Whitehall agency which manages taxpayers' interests in a range of companies, including the Post Office and Channel 4, are expected to consider whether to merge some of the remaining companies in the sector. These would include British Steel, the Scunthorpe-based producer which is legally owned by China's Jingye Group but which was seized by the government last April amid a threat to close its remaining blast furnaces. So far, the government has spent hundreds of millions of pounds on running British Steel. The government's move prevented the immediate loss of more than 3,000 jobs, although there remain questions about the company's viability as a standalone entity. \"We continue to work with Jingye to find a pragmatic, realistic solution for the future of British Steel,\" Chris McDonald, the industry minister, said in a statement to parliament in November. \"Our long-term aspiration for the company will require co-investment with the private sector to enable modernisation and decarbonisation, safeguard taxpayers' money and retain steelmaking in Scunthorpe.\" In 2024, ministers agreed to provide £500m in grant funding to Tata Steel, the Indian company, to install an electric arc furnace at its Port Talbot steelworks in Wales. The new facility is expected to be operational in 2027, but has been bitterly opposed by trade unions infuriated that the new funding was effectively used to drive through thousands of redundancies at the plant."
    },
    {
        "title": "JD Vance agrees sexualised AI deepfakes 'entirely unacceptable,' Lammy says",
        "description": "David Lammy has said that US vice president JD Vance agrees that sexualised AI-generated deepfakes - such as those made using Elon Musk's Grok - are \"entirely unacceptable\".",
        "url": "https://news.sky.com/story/jd-vance-agrees-sexualised-ai-deepfakes-entirely-unacceptable-lammy-says-13492879",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-jd-vance-white-house_7132164.jpg?20260110181813",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-10 17:46:00",
        "Headline": "The Internet Watch Foundation reported that criminals have been using Grok to create child sexual abuse imagery. JD Vance - who has been a proponent of AI technology - has not commented publicly on the reports. ",
        "Content": "David Lammy has said that US vice president JD Vance agrees that sexualised AI-generated deepfakes - such as those made using Elon Musk's Grok - are \"entirely unacceptable\". The deputy prime minister told The Guardian that Mr Vance expressed concern about how artificial intelligence was being used to create \"hyper-pornographied slop\" online when they met in Washington on Thursday. After discussing Greenland, Mr Lammy said: \"I also raised with him the Grok issue and the horrendous, horrific situation in which this new technology is allowing deepfakes and the manipulation of images of women and children, which is just absolutely abhorrent. \"He agreed with me that it was entirely unacceptable.\" Since the start of the new year, X users - mainly women - have reported that accounts have used Grok to generate images of them without clothing. And earlier this week, the Internet Watch Foundation reported that criminals have been using Grok to create child sexual abuse imagery. X appeared to have changed Grok's settings in response, with a message displayed by the tool saying image editing and generation had been limited to paid subscribers. \n                  No 10 hits out at 'insulting' changes to Musk's Grok chatbot after deepfake warning\n                 \n                  'Get a grip' on Grok, Starmer tells X after AI tool is used for child sex images\n                 \n                  Illegal child abuse material generated by X's artificial intelligence Grok, says UK watchdog\n                 But these changes were described as \"insulting\" by Downing Street, while Prime Minister Sir Keir Starmer said that X needed \"to get a grip of\" Grok, and he had asked media regulator Ofcom for \"all options to be on the table\". Appearing defiant, Musk later shared one X user's post criticising the Labour government for apparently focusing on his platform, pointing to claims of other AI programmes creating non-sexualised images of women in bikinis. \"They want any excuse for censorship,\" the tech billionaire said. Musk had also previously said on X that anyone using Grok ⁠to make illegal content would suffer ‌the same consequences as if they ‍had uploaded it. In the interview with The Guardian, Mr Lammy said that he felt Mr Vance \"recognised the very seriousness with which images of women and children could be manipulated in this way\". The deputy prime minister then added: \"He recognised how despicable, unacceptable, that is and I found him sympathetic to that position. And in fact, we've been in touch again, today, about this very serious issue.\" \"He confirmed with me that he had seen that there had been some changes announced by X as of this morning.\" Read more from Sky News:New footage of Minneapolis shooting filmed by ICE agentMan dies after tree falls on to caravan during Storm Goretti Sources at the meeting in Washington also told the outlet that Mr Vance raised concerns about the use of AI and how it was fuelling \"hyper-pornographied slop\". As of writing, Mr Vance - who has been a long-standing proponent of AI technology - has not commented publicly on Grok."
    },
    {
        "title": "NASA mega-rocket for moon mission could launch in weeks",
        "description": "The NASA rocket that will fly astronauts around the moon for the first time since 1972 could be rolled out to its launchpad at Kennedy Space Centre in Florida within days.",
        "url": "https://news.sky.com/story/nasa-mega-rocket-for-moon-mission-could-launch-in-weeks-13492742",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-artemis-ii-moon-nasa_7131868.jpg?20260110111053",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-10 12:21:00",
        "Headline": "The Artemis mission will take four astronauts on a 10-day flight around the moon.",
        "Content": "The NASA rocket that will fly astronauts around the moon for the first time since 1972 could be rolled out to its launchpad at Kennedy Space Centre in Florida within days. The US space agency said the 98m mega-rocket will be slowly moved from its assembly hangar to launch pad 39B on 17 January - weather and technical issues permitting. It will take up to 12 hours for the \"crawler transporter\" vehicle carrying the Space Launch System rocket and Orion crew capsule to make the four-mile journey. NASA will then run through final testing and launch rehearsals before giving the green light for lift-off, for what will be the second test flight in the Artemis moon return programme and the first to carry a crew. Lori Glaze, acting associate administrator for NASA's Exploration Systems Development Mission Directorat, said: \"We are moving closer to Artemis 2, with rollout just around the corner. \"We have important steps remaining on our path to launch and crew safety will remain our top priority at every turn, as we near humanity's return to the moon.\" The mission will take four astronauts - NASA's Reid Wiseman, Victor Glover and Christina Koch and Jeremy Hansen of the Canadian Space Agency - on a 10-day flight around the moon. The mission is a huge step forward in America's space race with China to land near the south pole of the moon. In December, Donald Trump signed an executive order titled \"ENSURING AMERICAN SPACE SUPERIORITY\", which set a target of planting the US flag on the surface before the end of his second term - most likely 2028. The Artemis 2 launch is already more than a year behind schedule. A test flight in 2022, without humans on board, identified significant problems with the Orion crew capsule's life support system and heat shield, which required design modifications to fix. Even now, engineers are troubleshooting last-minute glitches. A critical cable in the rocket's emergency abort system was found to be bent out of position and is being replaced. Once the rocket reaches the launch pad, engineers need to connect up ground support systems and run through a long list of checks. At the end of January, NASA will conduct a \"wet\" dress rehearsal, the prelaunch test to fuel the rocket with 3.2m litres of propellant and run through the countdown sequence. Read more:'I fought a humanoid robot and won'NASA will bring astronauts home early from ISS Only when it is satisfied that the rocket and spacecraft are ready for launch will NASA confirm a target date for lift-off. Currently, the launch is scheduled sometime between 6 February and April. But there are only five days a month the rocket can launch because of the moon's position in relation to Earth: 6-11 February, 6-11 March and 1-6 April. Launch could be \"scrubbed\" or cancelled on the day because of unfavourable weather, technical issues, or boats or aircraft straying into the no-go zone downrange of the space centre."
    },
    {
        "title": "Elon Musk says backlash to AI chatbot deepfake images is 'excuse for censorship'",
        "description": "The UK government \"wants any excuse for censorship\", Elon Musk has said, amid a growing backlash over deepfake sexual images produced by his social media site X's artificial intelligence tool.",
        "url": "https://news.sky.com/story/elon-musk-says-backlash-to-ai-chatbot-deepfake-images-is-excuse-for-censorship-13492705",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-elon-musk-x-artificial-intelligence_7131790.jpg?20260110083527",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-10 09:49:00",
        "Headline": "Sir Keir Starmer has said X needs \"to get a grip of\" AI chatbot Grok, and he has asked Ofcom for \"all options to be on the table\".",
        "Content": "The UK government \"wants any excuse for censorship\", Elon Musk has said, amid a growing backlash over deepfake sexual images produced by his social media site X's artificial intelligence tool. Earlier this week, Prime Minister Keir Starmer said X needed \"to get a grip of\" its AI chatbot Grok, and he had asked media regulator Ofcom for \"all options to be on the table\". Indonesia temporarily blocked the chatbot on Saturday, becoming the ​first country to deny access to the AI tool. It comes after criticism from governments and regulators in Europe and Asia, with some opening inquiries into sexualised content. Earlier this week, the Internet Watch Foundation reported that criminals have been using Grok to create child sexual abuse imagery. On Friday, X appeared to have changed Grok's settings, with a message displayed by the chatbot saying image editing had been limited to paid subscribers - changes described as \"insulting\" by Downing Street. Appearing defiant, Musk later shared one X user's post criticising the Labour government for apparently focusing on his platform, pointing to claims of other AI programmes creating non-sexualised images of women in bikinis. \"They want any excuse for censorship,\" the tech billionaire said. Responding to further posts on Saturday, he shared one which asked: \"So what if Grok can put people in bikinis?\" and stated that \"millions\" of other apps can also do this. \"This isn't a new problem, it's a new tool,\" the post said. Musk has previously said on X that anyone using Grok ⁠to make illegal content would suffer ‌the same consequences as if they ‍had uploaded it. Criticism of X has focused on manipulation of photographs of real women to remove their clothes, and the reports of Grok's production of images of child abuse. Technology Secretary Liz Kendall has said she would back regulator Ofcom should X be blocked if it fails to comply with UK laws, saying: \"Sexually manipulating images of women and children is despicable and abhorrent.\" Ms Kendall said it was \"totally unacceptable for Grok to allow this if you're willing to pay for it\" and she expects an update on Ofcom's next steps \"in days, not weeks\". Ofcom is now undertaking an \"expedited assessment\" of the situation after making \"urgent contact\" with X over the reports. Read more:'I fought a robot and won'Cyber flashing made a priority offence The media watchdog has powers under the Online Safety Act to fine businesses up to £18m, or 10% of global revenue, as well as to take criminal action. It can also order payment providers, advertisers and internet service providers to stop working with a site, effectively banning them, though this would require agreement from the courts. Meanwhile, after the temporary block in Indonesia, communications and digital minister Meutya Hafid said the government \"views the practice of non-consensual ​sexual deepfakes as a serious violation of human rights, dignity, and the security of citizens in ‍the digital space\". The country has strict rules that ban the sharing of online content deemed obscene."
    },
    {
        "title": "Most anticipated video games coming out in 2026",
        "description": "Grand Theft Auto VI is unquestionably the single most anticipated video game of 2026.",
        "url": "https://news.sky.com/story/most-anticipated-video-games-coming-out-in-2026-13477841",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-video-game-gta-resident-evil_7110595.jpg?20251215091436",
        "type": "Technology",
        "Author": "Jenness Mitchell",
        "Date Published": "2026-01-10 00:01:00",
        "Headline": "The 2026 games line-up includes major sequels, reboots and new releases. Here are some of the most anticipated.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Grand Theft Auto VI is unquestionably the single most anticipated video game of 2026. The long-awaited sequel by developer Rockstar Games is expected to drop in November - 13 years on from the record-breaking GTA V. The game was due to be released in autumn 2025 but was pushed back to May 2026 before once again being delayed. Rockstar said the extra time would allow the team to \"finish the game with the level of polish you have come to expect and deserve\". Once launched, players will be returning to the Miami-flavoured metropolis of Vice City in the fictional state of Leonida. The Bonnie and Clyde-style story will follow criminal couple Jason Duval and Lucia Caminos - the first playable female character in the series' history. GTA has always poked fun at American culture, with, arguably, some aspects of the nation's past decade of politics like something out of the game. \n                  Why Grand Theft Auto VI has been delayed again and how it'll affect other games\n                 \n                  Minecraft users targeted by criminals posing as game coders\n                 \n                  Video game actor strike ends in US - but AI described as 'direct threat' to UK industry\n                 GTA VI looks certain to continue the series' tradition of satire, and from the footage released so far it appears no expense has been spared in regards to bringing the sun-soaked streets of Vice City to life. The GTA series - which was created in Dundee, Scotland - is one of the biggest franchises in the industry. GTA V became the fastest entertainment product in history to make $1bn (in its first three days) and has since sold more than 220 million copies worldwide - making it the second best-selling video game of all time after Minecraft. GTA VI is similarly expected to be snapped up across the globe and achieve colossal sales. If history repeats itself, GTA Online will be the moneymaker. The persistent online world offers endless monetisation opportunities - with gamers enticed to splash out on new vehicles, weapons, properties, businesses and cosmetic upgrades. Expert research analyst Michael Pachter previously told Sky News he believes Rockstar and parent company Take-Two Interactive Software will be able to charge $100 (about £75) for the base game alone with little complaint. However, the GTA series boasts two winning ingredients that some other games do not have - brand power and fan loyalty. If other AAA (Triple-A) game publishers attempt to follow suit and raise their own starting prices, they may find that any accepted GTA increase is the exception rather than the rule. As career criminal and former bank robber Trevor Philips (GTA V character) nicely put it: \"I said something nice, not expensive.\" Fable The long-awaited Fable reboot is expected to drop sometime in 2026 following a delay from its initial 2025 release window. It will be the first new instalment in the action-RPG franchise since Fable: The Journey in 2012. The series has been on a hiatus since Microsoft's cancellation of Fable Legends and the subsequent closure of original developers Lionhead Studios in 2016. Playground Games, behind the successful Forza Horizon series, is developing the reboot for parent company Xbox Game Studios. Still set in the fictional world of Albion, the series will be updated with contemporary gameplay mechanics and visuals in a bid to attract a new generation of players. From the footage released so far, fans can expect a classic fantasy adventure filled with \"life and death stuff\". The storybook-styled world features scenic horseback riding, magical creatures, playful dialogue, and player-driven choices. As well as action-heavy combat, Fable's signature chicken-kicking option appears to be alive and well. While not much is known about our hero, British comedians Richard Ayoade and Matt King will be playing a giant and a once-great champion turned mentor respectively. The game will release on Xbox Series X/S as well as Xbox on PC and will be playable from day one via Games Pass. Given the IP (intellectual property) is owned by Microsoft, it's unlikely the game will make its way to PS5 any time soon after its initial release. 007 First Light 007 First Light is a James Bond origin story and will follow the resourceful recruit during his time within the MI6 training programme ahead of becoming the world-famous spy we know and love. The action-adventure game is due to be released in May - having been pushed back from March - and is inspired by Ian Fleming's novels and short stories. The original narrative is expected to follow Bond as he embarks on a mission that will earn him his licence to kill. This is the first Bond game since 007 Legends in 2012. The franchise went on an extended hiatus after previous publisher Activision had its non-exclusive licence to produce James Bond video games revoked by Eon Productions and Metro-Goldwyn-Mayer in 2013. IO Interactive, best known for developing the Hitman and Kane & Lynch franchises, is behind 007 First Light. Expect a heart-pumping blend of close-quarters combat, car chases, stealth kills, glamorous locations, gadgets galore, and appearances from the likes of M, Q and Miss Moneypenny. At The Game Awards 2025, famed musician Lenny Kravitz was unveiled as Bond villain Bawma. The \"unpredictable and charismatic\" antagonist has been described as someone who \"rose from nothing, broke free, and built his own Kingdom of Aleph\". The game should whet fans' appetite ahead of Bond 26 - which Denis Villeneuve is set to direct and will mark a new era of 007 films following the conclusion of Daniel Craig's run. Resident Evil Requiem Capcom takes us back to Raccoon City with Resident Evil Requiem. The survival horror game is scheduled to be released in February, with the developers promising a \"heart-stopping experience that will chill you to your core\". Fans will be introduced to a new leading lady - FBI intelligence analyst Grace Ashcroft, who is the daughter of Alyssa Ashcroft from the Resident Evil Outbreak games. Grace's nightmare begins after she is dispatched to investigate a mysterious death at an abandoned hotel where her mother was murdered eight years prior. As Grace investigates the team's person of interest - Victor Gideon - her path converges with that of veteran agent Leon S. Kennedy. The fan favourite returns to the series as a playable character, with both Grace and Leon forced to face their pasts in a bid to uncover the truth behind the Raccoon City incident that changed the world forever. The game follows on from Resident Evil Village, with players once again expected to go head-to-head with the horrors that await through combat, puzzle-solving and resource management. Previous antagonist Lady Dimitrescu proved to be a social media hit, so the next relentless stalker monster has big boots to fill."
    },
    {
        "title": "Most anticipated video games coming out in 2026",
        "description": "Grand Theft Auto VI is unquestionably the single most anticipated video game of 2026.",
        "url": "https://news.sky.com/story/most-anticipated-video-games-coming-out-in-2026-13477841",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-video-game-gta-resident-evil_7110595.jpg?20251215091436",
        "type": "Entertainment",
        "Author": "Jenness Mitchell",
        "Date Published": "2026-01-10 00:01:00",
        "Headline": "The 2026 games line-up includes major sequels, reboots and new releases. Here are some of the most anticipated.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Grand Theft Auto VI is unquestionably the single most anticipated video game of 2026. The long-awaited sequel by developer Rockstar Games is expected to drop in November - 13 years on from the record-breaking GTA V. The game was due to be released in autumn 2025 but was pushed back to May 2026 before once again being delayed. Rockstar said the extra time would allow the team to \"finish the game with the level of polish you have come to expect and deserve\". Once launched, players will be returning to the Miami-flavoured metropolis of Vice City in the fictional state of Leonida. The Bonnie and Clyde-style story will follow criminal couple Jason Duval and Lucia Caminos - the first playable female character in the series' history. GTA has always poked fun at American culture, with, arguably, some aspects of the nation's past decade of politics like something out of the game. \n                  Why Grand Theft Auto VI has been delayed again and how it'll affect other games\n                 \n                  Minecraft users targeted by criminals posing as game coders\n                 \n                  Video game actor strike ends in US - but AI described as 'direct threat' to UK industry\n                 GTA VI looks certain to continue the series' tradition of satire, and from the footage released so far it appears no expense has been spared in regards to bringing the sun-soaked streets of Vice City to life. The GTA series - which was created in Dundee, Scotland - is one of the biggest franchises in the industry. GTA V became the fastest entertainment product in history to make $1bn (in its first three days) and has since sold more than 220 million copies worldwide - making it the second best-selling video game of all time after Minecraft. GTA VI is similarly expected to be snapped up across the globe and achieve colossal sales. If history repeats itself, GTA Online will be the moneymaker. The persistent online world offers endless monetisation opportunities - with gamers enticed to splash out on new vehicles, weapons, properties, businesses and cosmetic upgrades. Expert research analyst Michael Pachter previously told Sky News he believes Rockstar and parent company Take-Two Interactive Software will be able to charge $100 (about £75) for the base game alone with little complaint. However, the GTA series boasts two winning ingredients that some other games do not have - brand power and fan loyalty. If other AAA (Triple-A) game publishers attempt to follow suit and raise their own starting prices, they may find that any accepted GTA increase is the exception rather than the rule. As career criminal and former bank robber Trevor Philips (GTA V character) nicely put it: \"I said something nice, not expensive.\" Fable The long-awaited Fable reboot is expected to drop sometime in 2026 following a delay from its initial 2025 release window. It will be the first new instalment in the action-RPG franchise since Fable: The Journey in 2012. The series has been on a hiatus since Microsoft's cancellation of Fable Legends and the subsequent closure of original developers Lionhead Studios in 2016. Playground Games, behind the successful Forza Horizon series, is developing the reboot for parent company Xbox Game Studios. Still set in the fictional world of Albion, the series will be updated with contemporary gameplay mechanics and visuals in a bid to attract a new generation of players. From the footage released so far, fans can expect a classic fantasy adventure filled with \"life and death stuff\". The storybook-styled world features scenic horseback riding, magical creatures, playful dialogue, and player-driven choices. As well as action-heavy combat, Fable's signature chicken-kicking option appears to be alive and well. While not much is known about our hero, British comedians Richard Ayoade and Matt King will be playing a giant and a once-great champion turned mentor respectively. The game will release on Xbox Series X/S as well as Xbox on PC and will be playable from day one via Games Pass. Given the IP (intellectual property) is owned by Microsoft, it's unlikely the game will make its way to PS5 any time soon after its initial release. 007 First Light 007 First Light is a James Bond origin story and will follow the resourceful recruit during his time within the MI6 training programme ahead of becoming the world-famous spy we know and love. The action-adventure game is due to be released in May - having been pushed back from March - and is inspired by Ian Fleming's novels and short stories. The original narrative is expected to follow Bond as he embarks on a mission that will earn him his licence to kill. This is the first Bond game since 007 Legends in 2012. The franchise went on an extended hiatus after previous publisher Activision had its non-exclusive licence to produce James Bond video games revoked by Eon Productions and Metro-Goldwyn-Mayer in 2013. IO Interactive, best known for developing the Hitman and Kane & Lynch franchises, is behind 007 First Light. Expect a heart-pumping blend of close-quarters combat, car chases, stealth kills, glamorous locations, gadgets galore, and appearances from the likes of M, Q and Miss Moneypenny. At The Game Awards 2025, famed musician Lenny Kravitz was unveiled as Bond villain Bawma. The \"unpredictable and charismatic\" antagonist has been described as someone who \"rose from nothing, broke free, and built his own Kingdom of Aleph\". The game should whet fans' appetite ahead of Bond 26 - which Denis Villeneuve is set to direct and will mark a new era of 007 films following the conclusion of Daniel Craig's run. Resident Evil Requiem Capcom takes us back to Raccoon City with Resident Evil Requiem. The survival horror game is scheduled to be released in February, with the developers promising a \"heart-stopping experience that will chill you to your core\". Fans will be introduced to a new leading lady - FBI intelligence analyst Grace Ashcroft, who is the daughter of Alyssa Ashcroft from the Resident Evil Outbreak games. Grace's nightmare begins after she is dispatched to investigate a mysterious death at an abandoned hotel where her mother was murdered eight years prior. As Grace investigates the team's person of interest - Victor Gideon - her path converges with that of veteran agent Leon S. Kennedy. The fan favourite returns to the series as a playable character, with both Grace and Leon forced to face their pasts in a bid to uncover the truth behind the Raccoon City incident that changed the world forever. The game follows on from Resident Evil Village, with players once again expected to go head-to-head with the horrors that await through combat, puzzle-solving and resource management. Previous antagonist Lady Dimitrescu proved to be a social media hit, so the next relentless stalker monster has big boots to fill."
    }
]