[
    {
        "title": "Donald Trump unveils plan for 'Trump Class' battleships",
        "description": "Donald Trump has announced a plan for the US Navy to build two new \"Trump Class\" battleships.",
        "url": "https://news.sky.com/story/donald-trump-unveils-plan-for-trump-class-battleships-13486913",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-trump-battleship-us_7118051.jpg?20251223005425",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-22 23:41:00",
        "Headline": "Made of steel and complete with missiles, guns, lasers and hypersonic weapons, the vessels will be the \"centrepiece\" of the US Navy's Golden Fleet initiative, the president said.",
        "Content": "Donald Trump has announced a plan for the US Navy to build two new \"Trump Class\" battleships. Aimed at cementing US naval dominance, the president said the vessels will be \"the fastest, the biggest and 100 times more powerful than any battleship ever built\". Constructed in America, made of steel and complete with missiles, guns, lasers and hypersonic weapons, the vessels will be the \"centrepiece\" of the US Navy's Golden Fleet initiative, he said. Starting with two vessels, Mr Trump said the project would eventually expand to include 20 to 25 new ships. The first will ‍be christened the USS Defiant, with the US leader personally involved in how it looks. It comes as the US continues to build a large naval military presence near the coast of Venezuela. Since early September, it has struck more than 20 vessels in the Pacific Ocean and Caribbean Sea, which Mr Trump says is to crack down on drug cartels. The US Navy has also seized two oil tankers and is believed to be in \"active pursuit\" of a third, according to officials. \"There's never been anything like these ships. These have been under design consideration for a long time,\" he said. \"Each one of these will be the largest battleship in the history of our country. The largest battleship in the history of the world. \"We haven't built a battleship ​since 1994. These cutting-edge vessels will be some of the most lethal surface warfare ships... other than our submarines.\" Mr Trump made the announcement at his Mar-a-Lago estate in Florida. During the briefing, he stood next to mock-up pictures of the new vessels which had \"Trump Class\" written in the corner - what a senior administration official said the new class of vessel will be known as. In addition to the new ‍battleship class, the project aims to increase the number of other types of war vessels, including a smaller, more nimble frigate class. The term battleship has historically referred to a large, heavily armoured vessel armed with guns designed to bombard other ships or targets ashore. This type of ship reached peak prominence during the Second World War. The largest of the US battleships was the Iowa-class. The Trump administration has been complaining about the slow and expensive state of the current defence industry. Just a month ago, the Navy scrapped its plans to build a new, small warship, citing growing delays and overrunning costs. It has also failed to build its other newly designed ships, like the new Ford-class aircraft carrier and Columbia-class submarines, on time and on budget. Read more from Sky News:US in 'active pursuit' of third vessel off Venezuelan coastHow Trump has supercharged the new world dis-order But Mr Trump said the naval expansion would also be paired with renewed pressure on defence contractors to speed up ‌production and rein in costs. He said he plans to meet with ⁠major firms next week to address problems."
    },
    {
        "title": "Man charged with 56 sexual offences against ex-wife - as five other men also charged",
        "description": "A man has been charged - alongside five other men - with carrying out sexual offences against his now former wife over a 13-year period.",
        "url": "https://news.sky.com/story/ex-husband-charged-with-56-sexual-offences-against-wife-as-five-other-men-also-charged-13486792",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-police-crime_7117805.jpg?20251222181526",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-22 17:11:00",
        "Headline": "Philip Young, 49, formerly of Swindon, has been charged with multiple offences against his ex-wife Joanne Young, 48, with five other men also charged.",
        "Content": "A man has been charged - alongside five other men - with carrying out sexual offences against his now former wife over a 13-year period. Philip Young, 49, formerly of Swindon, has been charged with 56 sexual offences, including multiple counts of rape, against Joanne Young, 48, Wiltshire Police said. He is also charged with administering a substance with the intent to stupefy or overpower to allow sexual activity, as well as voyeurism, possession of indecent images of children and possession of extreme images. Five other men have also been charged with sexual offences against Ms Young, who police say has waived her automatic legal right to anonymity. All six men will appear at Swindon Magistrates Court tomorrow, Wiltshire Police said. The other men are Norman Macksoni, 47, of Sharnbrook, Bedfordshire. He is a black British national and has been charged with one count of rape and possession of extreme images. Dean Hamilton, 47, of no fixed abode. He is a white British national and has been charged with one count of rape and sexual assault by penetration and two counts of sexual touching. Conner Sanderson Doyle, 31, of Swindon. He is a white British national and has been charged with sexual assault by penetration and sexual touching Richard Wilkins, 61, of Swindon. He is a white British national and has been charged with one count of rape and sexual touching Mohammed Hassan, 37, of Swindon. He is a British Asian male and has been charged with sexual touching. Police say the offences took place between 2010 and 2023. Geoff Smith, detective superintendent for Wiltshire Police, said: \"This is a significant update in what is a complex and extensive investigation. \"The victim in this case, Joanne, has taken the decision to waive her automatic legal right to anonymity. \"She has been supported by specially trained officers from the beginning of the process and she has made the decision following multiple discussions with officers and support services.\" People who allege they are victims of rape have been automatically entitled to lifelong anonymity since the Sexual Offences (Amendment) Act was passed in 1976. This has since been extended to certain other sexual offences, though victims can waive the protection if they wish."
    },
    {
        "title": "Call Of Duty co-creator Vince Zampella dies aged 55",
        "description": "Vince Zambella, one of the creators behind best-selling video game series Call Of Duty, has died.",
        "url": "https://news.sky.com/story/call-of-duty-co-creator-vince-zampella-dies-aged-55-13486915",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-vince-zampella-call-of-duty_7118038.jpg?20251222233409",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-22 23:47:00",
        "Headline": "Zampella, who reportedly died in a car crash in California, was hailed as a \"visionary creator\" by video game maker Electronic Arts.",
        "Content": "Vince Zambella, one of the creators behind best-selling video game series Call Of Duty, has died. Video game maker Electronic Arts (EA) said the 55-year-old died on Sunday but did not disclose a cause of death. It was reported he died in a car crash in Southern California. The single-vehicle collision involving a Ferrari happened in the San Gabriel Mountains at about 12.45pm local time, according to NBC Los Angeles. Zampella founded Respawn Entertainment, a subsidiary of EA, in 2010 and he was the former chief executive of video game developer Infinity Ward, the studio behind the Call of Duty franchise.An EA spokesperson said Zampella's influence on the video game industry was \"profound and far-reaching\". \"A friend, colleague, leader and visionary creator, his work helped shape modern interactive entertainment and inspired millions of players and developers around the world,\" the spokesperson added. \"His legacy will continue to shape how games are made and how players connect for generations to come.\" Read more from Sky News:Is the AI bubble about to burst?'Our daughter vanished 20 years ago - but AI may finally solve case' One of Zampella's crowning achievements was the creation of the Call of Duty franchise, which has sold more than half a billion games worldwide. The first-person shooter game debuted in 2003 as a Second World War simulation, while subsequent versions have delved into modern warfare. There is a live-action movie based on the game in production with Paramount Pictures. Zampella was also at the helm of the creation of action adventure video games Star Wars Jedi: Fallen Order and Star Wars Jedi: Survivor."
    },
    {
        "title": "Trump: US has to have Greenland",
        "description": "Donald Trump has said the US \"has to have\" Greenland, claiming it needs the territory for national security.",
        "url": "https://news.sky.com/story/trump-us-has-to-have-greenland-13486627",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-greenland-landry_7117379.jpg?20251222105115",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-22 10:31:00",
        "Headline": "The president has appointed Jeff Landry as special envoy to the territory, saying he \"understands how essential Greenland is\" to US national security.",
        "Content": "Donald Trump has said the US \"has to have\" Greenland, claiming it needs the territory for national security. It comes after the US president appointed Louisiana's governor Jeff Landry as special envoy to Greenland, saying he would \"lead the charge\" in advocating the semi-autonomous part of Denmark to become part of the United States. \"Jeff understands how essential Greenland is to our national security,\" Mr Trump said. \"We need Greenland for national security, not for minerals... If you take a look ​at Greenland, you look up and down the coast, you have Russian and Chinese ships all over the place. \"We need it for national security. We have to ‍have it... Greenland is a big deal.\" Why does Trump want Greenland? Danish Prime Minister Mette Frederiksen and Greenland's Prime Minister Jens-Frederik Nielsen said in a joint statement that Greenland belongs to Greenlanders, stressing the US will not take it over. \"You cannot annex another country. Not even ‌with an argument about international security,\" they said. The country has already summoned the US ambassador in protest, with its foreign minister saying the move shows the US is still interested in the vast Danish territory. Mr Trump has repeatedly called for the US to take over the mineral rich and strategically located Arctic island, since winning his second term, and has not ruled out using military force to achieve it. Denmark's foreign minister Lars Løkke Rasmussen said everyone - including the US - must show respect for Denmark's territorial integrity. How did we get here? In March, US Vice President JD Vance visited a remote American military base in Greenland and accused Denmark - a NATO ally of the US - of underinvesting there. The issue then gradually drifted out of the headlines but, in August, Danish officials again summoned the US ambassador - following a report that at least three people with connections to Mr Trump had carried out covert influence operations in Greenland. The territory's strategic position between Europe and North America makes it a key site for the US ballistic missile defence system, while its mineral wealth has heightened US interest in reducing reliance on Chinese exports. Earlier this month, the Danish Defence Intelligence Service said in an annual report that the US was using its economic power to \"assert its will\" and threaten military force against friend and foe alike. Read more:Head of US Greenland base sacked after criticising JD VanceDenmark's PM says 'you can't spy against an ally' The report also highlighted the rising strategic importance of the Arctic to great power countries as \"conflict between Russia and the West intensifies. It went on to say that the growing security and strategic focus on the Arctic by the US would \"further accelerate these developments\". Russian President Vladimir Putin has said Russia is worried about NATO's activities in the Arctic and will respond by strengthening its military capability in the polar region."
    },
    {
        "title": "Major incident declared as sinkhole drains canal and swallows narrowboats in Shropshire",
        "description": "A major incident had been declared in Shropshire after a sinkhole breached a canal in the Chemistry area of Whitchurch.",
        "url": "https://news.sky.com/story/major-incident-declared-as-sinkhole-drains-canal-and-swallows-narrowboats-13486587",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sinkhole-shropshire_7117474.jpg?20251222122625",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-22 08:43:00",
        "Headline": "Shropshire Fire and Rescue Service asked people to stay away from the area, including Whitchurch Marina, while they respond to the incident.",
        "Content": "A major incident had been declared in Shropshire after a sinkhole breached a canal in the Chemistry area of Whitchurch. Fire Control received reports at 4.22am that a canal bank had collapsed with large volumes of water escaping into the surrounding land. Firefighters had to use barge boards and water gates to mitigate water flow to establish upstream and downstream safety sectors. Three narrowboats have been affected by the incident, with at least two swallowed by the sinkhole, which is approximately 50m by 50m in size. There are currently no reports of any casualties, but around a dozen residents have been evacuated from nearby moored boats and are being relocated to a welfare centre at the former Whitchurch Police Station. An area of land next to the canal has been flooded as a result of the breach. Emergency services are currently on the scene, and a multi-agency response has been set up, co-ordinated through the Shropshire Tactical Co-ordination Group (TCG). \n                  Lizard gives birth without mating in 'one of rarest events in animal kingdom'\n                 \n                  Man arrested on suspicion of murder after inmate found dead in prison cell\n                 \n                  Second teenager dies after car crash in West Midlands - as two others suffer serious injuries\n                 Shropshire Fire and Rescue Service said on X: \"Shropshire FRS is responding to a landslip affecting the canal in the Whitchurch area. \"For everyone's safety, members of the public are kindly asked to remain away from the affected area, including Whitchurch Marina, while crews and partners manage the incident.\""
    },
    {
        "title": "Timing of Russian general's assassination appears significant",
        "description": "A Russian general being blown up on his own doorstep isn't a good look for Moscow, and it seems it's becoming increasingly common.",
        "url": "https://news.sky.com/story/timing-of-russian-generals-assassination-appears-significant-13486701",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-general-russian-fanil-sarvarov_7117306.jpg?20251222094820",
        "type": "Home",
        "Author": "Ivor Bennett",
        "Date Published": "2025-12-22 13:32:00",
        "Headline": "Ukraine has been trying to convince the US it's still full of fight - and taking out Russian generals in their own backyard is one way of doing that.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n A Russian general being blown up on his own doorstep isn't a good look for Moscow, and it seems it's becoming increasingly common. The latest high-profile figure to be assassinated since Russia's invasion of Ukraine is Lieutenant General Fanil Sarvarov. He was killed by a car bomb that detonated outside a residential complex, little more than 10 miles from the Kremlin. Ukraine war latest: Kremlin denies Putin plans to invade European countries He was a senior figure. Head of the operational training directorate of the general staff, Sarvarov prepared forces for future deployment, having previously served in Chechnya and Syria. There was no immediate claim of responsibility but Moscow believes Kyiv may have been behind it. No wonder - they've carried out similar attacks many times before. This time last year, Ukraine took credit for the assassination of Lieutenant General Igor Kirillov, who Kyiv alleged had ordered chemical weapons to be used against its troops on the battlefield. \n                  Russian general killed by car bomb and Moscow blames Ukraine\n                 \n                  How Trump has supercharged the new world dis-order\n                 \n                  Vladimir Putin didn't sound like he will alter his course anytime soon in annual TV address\n                 He was killed by a bomb hidden in a scooter outside his apartment block, which Vladimir Putin referred to as a \"major blunder\" by the security services. But the attacks didn't stop there. In April, Lieutenant General Yaroslav Moskalik was killed after a car exploded in a town just outside Moscow. And two months ago another car bomb in Siberia killed a Russian commander accused of committing war crimes. It's unclear why Sarvarov was targeted - perhaps simply because his rank and apparent vulnerability. The timing appears significant. It follows the latest peace talks between US and Russian officials in Miami over the weekend, where Kremlin envoy Kirill Dmitriev met with Steve Witkoff and Jared Kushner. In the past, Ukraine has used these kinds of attacks to embarrass Moscow and to bring the war closer to home for Russians. This time could be Kyiv's way of undermining Moscow's narrative in the negotiations. Read more from Sky News:Bondi suspect trained with father before attack, police sayTrump's Greenland envoy intends to make territory 'a part of US' The Kremlin has been trying to persuade the White House that a Russian victory is inevitable, and that it's futile to support Ukraine, in the hope of securing a more preferential settlement. Ukraine has been trying to convince the Trump administration of the opposite - that it's still full of fight - and taking out Russian generals in their own backyard is one way of doing that. It shows Washington that the Kremlin is clearly not in total control."
    },
    {
        "title": "Singer Chris Rea - famous for Driving Home For Christmas - dies aged 74",
        "description": "Chris Rea, known for hits including Driving Home For Christmas and The Road To Hell, has died after a short illness, according to a family spokesperson.",
        "url": "https://news.sky.com/story/singer-chris-rea-famous-for-driving-home-for-christmas-has-died-13486734",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-chris-rea_7117669.jpg?20251222160234",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-22 14:55:00",
        "Headline": "The singer passed away peacefully in hospital earlier today surrounded by his family following a short illness.",
        "Content": "Chris Rea, known for hits including Driving Home For Christmas and The Road To Hell, has died after a short illness, according to a family spokesperson. A statement on behalf of his wife and two children stated: \"It is with immense sadness that we announce the death of our beloved Chris. \"He passed away peacefully in hospital earlier today following a short illness, surrounded by his family.\" The Middlesbrough-born musician was diagnosed with pancreatic cancer and had his pancreas removed in 2001, and in 2016 he suffered a stroke. Follow our blog for the latest reactions to Chris Rea's death Rea found fame in the late seventies and eighties with hits such as Fool (If You Think It's Over), Let's Dance and The Road To Hell. Known for his gravelly voice and latterly for his slide guitar playing, he was nominated for a slew of top awards, including Brit Awards, at the height of his success and sold millions of records. \n                  2025 on track to be UK's warmest year on record, says Met Office\n                 \n                  Man charged with 56 sexual offences against ex-wife - as five other men also charged\n                 \n                  Major incident declared as sinkhole drains canal and swallows narrowboats in Shropshire\n                 Rea's debut album, titled Whatever Happened To Benny Santini?, a reference to the stage name his record label wanted him to adopt, was released in 1978. His track Fool (If You Think It's Over), from the album, went on to be nominated for a Grammy. He did not find such success again for a few years, but by the time his eighth album On The Beach was released, he was a star in the UK and around Europe, with sporadic hits in the US. When Road To Hell was released in 1989, he became one of the biggest solo stars in the UK. Two of his studio albums - The Road To Hell (1989) and Auberge (1991) - went to number one in the country. Read more from Sky News:Trump's new Greenland envoy intends to make territory \"a part of the US\"Puppy farming and trail hunting to be banned His famous song Driving Home For Christmas, first released in 1986, features in this year's M&S Food Christmas advert - which sees comedian Dawn French sing along to the single in her car. Speaking about the song during the 2020 Mortimer And Whitehouse Gone Fishing Christmas special, he told comedian Bob Mortimer: \"I was on the dole when I wrote that. \"My manager had just left me. I'd just been banned from driving, right. My now wife, Joan, she had to drive down to London, picked me up in the Mini, and take me home, and that's when I wrote it.\" The singer returned to his blues roots after a string of health problems. \"I wasn't frightened of dying,\" he once said in an interview. \"It did look like the end, but what got me through was the thought of leaving a record that my two teenage daughters could say, 'That's what Papa did - not the pop stuff, but the blues music. That's what he was about'.\" "
    },
    {
        "title": "Man charged with 56 sexual offences against ex-wife - as five other men also charged",
        "description": "A man has been charged - alongside five other men - with carrying out sexual offences against his now former wife over a 13-year period.",
        "url": "https://news.sky.com/story/ex-husband-charged-with-56-sexual-offences-against-wife-as-five-other-men-also-charged-13486792",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-police-crime_7117805.jpg?20251222181526",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-22 17:11:00",
        "Headline": "Philip Young, 49, formerly of Swindon, has been charged with multiple offences against his ex-wife Joanne Young, 48, with five other men also charged.",
        "Content": "A man has been charged - alongside five other men - with carrying out sexual offences against his now former wife over a 13-year period. Philip Young, 49, formerly of Swindon, has been charged with 56 sexual offences, including multiple counts of rape, against Joanne Young, 48, Wiltshire Police said. He is also charged with administering a substance with the intent to stupefy or overpower to allow sexual activity, as well as voyeurism, possession of indecent images of children and possession of extreme images. Five other men have also been charged with sexual offences against Ms Young, who police say has waived her automatic legal right to anonymity. All six men will appear at Swindon Magistrates Court tomorrow, Wiltshire Police said. The other men are Norman Macksoni, 47, of Sharnbrook, Bedfordshire. He is a black British national and has been charged with one count of rape and possession of extreme images. Dean Hamilton, 47, of no fixed abode. He is a white British national and has been charged with one count of rape and sexual assault by penetration and two counts of sexual touching. Conner Sanderson Doyle, 31, of Swindon. He is a white British national and has been charged with sexual assault by penetration and sexual touching Richard Wilkins, 61, of Swindon. He is a white British national and has been charged with one count of rape and sexual touching Mohammed Hassan, 37, of Swindon. He is a British Asian male and has been charged with sexual touching. Police say the offences took place between 2010 and 2023. Geoff Smith, detective superintendent for Wiltshire Police, said: \"This is a significant update in what is a complex and extensive investigation. \"The victim in this case, Joanne, has taken the decision to waive her automatic legal right to anonymity. \"She has been supported by specially trained officers from the beginning of the process and she has made the decision following multiple discussions with officers and support services.\" People who allege they are victims of rape have been automatically entitled to lifelong anonymity since the Sexual Offences (Amendment) Act was passed in 1976. This has since been extended to certain other sexual offences, though victims can waive the protection if they wish."
    },
    {
        "title": "Major incident declared as sinkhole drains canal and swallows narrowboats in Shropshire",
        "description": "A major incident had been declared in Shropshire after a sinkhole breached a canal in the Chemistry area of Whitchurch.",
        "url": "https://news.sky.com/story/major-incident-declared-as-sinkhole-drains-canal-and-swallows-narrowboats-13486587",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sinkhole-shropshire_7117474.jpg?20251222122625",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-22 08:43:00",
        "Headline": "Shropshire Fire and Rescue Service asked people to stay away from the area, including Whitchurch Marina, while they respond to the incident.",
        "Content": "A major incident had been declared in Shropshire after a sinkhole breached a canal in the Chemistry area of Whitchurch. Fire Control received reports at 4.22am that a canal bank had collapsed with large volumes of water escaping into the surrounding land. Firefighters had to use barge boards and water gates to mitigate water flow to establish upstream and downstream safety sectors. Three narrowboats have been affected by the incident, with at least two swallowed by the sinkhole, which is approximately 50m by 50m in size. There are currently no reports of any casualties, but around a dozen residents have been evacuated from nearby moored boats and are being relocated to a welfare centre at the former Whitchurch Police Station. An area of land next to the canal has been flooded as a result of the breach. Emergency services are currently on the scene, and a multi-agency response has been set up, co-ordinated through the Shropshire Tactical Co-ordination Group (TCG). \n                  Lizard gives birth without mating in 'one of rarest events in animal kingdom'\n                 \n                  Man arrested on suspicion of murder after inmate found dead in prison cell\n                 \n                  Second teenager dies after car crash in West Midlands - as two others suffer serious injuries\n                 Shropshire Fire and Rescue Service said on X: \"Shropshire FRS is responding to a landslip affecting the canal in the Whitchurch area. \"For everyone's safety, members of the public are kindly asked to remain away from the affected area, including Whitchurch Marina, while crews and partners manage the incident.\""
    },
    {
        "title": "Singer Chris Rea - famous for Driving Home For Christmas - dies aged 74",
        "description": "Chris Rea, known for hits including Driving Home For Christmas and The Road To Hell, has died after a short illness, according to a family spokesperson.",
        "url": "https://news.sky.com/story/singer-chris-rea-famous-for-driving-home-for-christmas-has-died-13486734",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-chris-rea_7117669.jpg?20251222160234",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-22 14:55:00",
        "Headline": "The singer passed away peacefully in hospital earlier today surrounded by his family following a short illness.",
        "Content": "Chris Rea, known for hits including Driving Home For Christmas and The Road To Hell, has died after a short illness, according to a family spokesperson. A statement on behalf of his wife and two children stated: \"It is with immense sadness that we announce the death of our beloved Chris. \"He passed away peacefully in hospital earlier today following a short illness, surrounded by his family.\" The Middlesbrough-born musician was diagnosed with pancreatic cancer and had his pancreas removed in 2001, and in 2016 he suffered a stroke. Follow our blog for the latest reactions to Chris Rea's death Rea found fame in the late seventies and eighties with hits such as Fool (If You Think It's Over), Let's Dance and The Road To Hell. Known for his gravelly voice and latterly for his slide guitar playing, he was nominated for a slew of top awards, including Brit Awards, at the height of his success and sold millions of records. \n                  2025 on track to be UK's warmest year on record, says Met Office\n                 \n                  Man charged with 56 sexual offences against ex-wife - as five other men also charged\n                 \n                  Major incident declared as sinkhole drains canal and swallows narrowboats in Shropshire\n                 Rea's debut album, titled Whatever Happened To Benny Santini?, a reference to the stage name his record label wanted him to adopt, was released in 1978. His track Fool (If You Think It's Over), from the album, went on to be nominated for a Grammy. He did not find such success again for a few years, but by the time his eighth album On The Beach was released, he was a star in the UK and around Europe, with sporadic hits in the US. When Road To Hell was released in 1989, he became one of the biggest solo stars in the UK. Two of his studio albums - The Road To Hell (1989) and Auberge (1991) - went to number one in the country. Read more from Sky News:Trump's new Greenland envoy intends to make territory \"a part of the US\"Puppy farming and trail hunting to be banned His famous song Driving Home For Christmas, first released in 1986, features in this year's M&S Food Christmas advert - which sees comedian Dawn French sing along to the single in her car. Speaking about the song during the 2020 Mortimer And Whitehouse Gone Fishing Christmas special, he told comedian Bob Mortimer: \"I was on the dole when I wrote that. \"My manager had just left me. I'd just been banned from driving, right. My now wife, Joan, she had to drive down to London, picked me up in the Mini, and take me home, and that's when I wrote it.\" The singer returned to his blues roots after a string of health problems. \"I wasn't frightened of dying,\" he once said in an interview. \"It did look like the end, but what got me through was the thought of leaving a record that my two teenage daughters could say, 'That's what Papa did - not the pop stuff, but the blues music. That's what he was about'.\" "
    },
    {
        "title": "Two men jailed for raping teenage girl in Rotherham",
        "description": "Two men have been jailed for raping a teenage girl in Rotherham more than two decades ago.",
        "url": "https://news.sky.com/story/two-men-jailed-for-raping-teenage-girl-in-rotherham-13486624",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rotherham-kessur-ajaib_7117388.jpg?20251222105914",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-22 10:24:00",
        "Headline": "Detectives investigated the men as part of Operation Stovewood, the investigation into grooming and child sexual abuse in Rotherham between 1997 and 2013.",
        "Content": "Two men have been jailed for raping a teenage girl in Rotherham more than two decades ago. Kessur Ajaib, 44, received eight-and-a-half years for one count of rape and one count of indecent assault. Mohammed Makhmood, 43, got a seven-year sentence for one count of rape. Their convictions relate to the same victim, who was aged between 14 to 16 at the time. Sheffield Crown Court heard in July that after Makhmood raped the girl, he called her demeaning names, spat at her and laughed at her. The pair were sentenced at the same court on Monday after being found guilty alongside another man, Sageer Hussain, in the summer. Hussain was convicted of raping a different victim, who the National Crime Agency (NCA) said was aged \"about 14\" at the time. Last month he received a three year jail sentence at Sheffield Crown Court for the crime, committed when he was also 14. The NCA investigated the men as part of Operation Stovewood, the investigation into grooming and child sexual abuse in Rotherham between 1997 and 2013. \n                  2025 on track to be UK's warmest year on record, says Met Office\n                 \n                  Man charged with 56 sexual offences against ex-wife - as five other men also charged\n                 \n                  Major incident declared as sinkhole drains canal and swallows narrowboats in Shropshire\n                 Read more from Sky News:Scarlett was groomed to be raped by dozens of men from age of 14 - here's how she finally broke freePolice name 55-year-old man shot dead in LondonLinks between Epstein and the UK revealed in new files Sky News north of England correspondent, Fraser Maude, was at court to report on the case. He said: \"The victim was in court today to see these men sentenced for the crimes against her. \"A statement was read out by the prosecution barrister, in it she spoke of how for years I didn't know I was being abused because it was happening to so many other girls around me. \"She said she spent years in denial, blaming herself, blaming her family. \"She spoke of her fear, embarrassment, shame and heartache that she suffered as a result of her abuse, and she described herself as a brainwashed and vulnerable girl who was treated like a sex commodity. \"The judge referred to that victim witness statement as he gave his sentencing remarks. \"He said that they could only be described as tragic. He said that the pair had abused the vulnerability of this young girl.\""
    },
    {
        "title": "Britons are less well off than they were in 2019 - and these figures show it",
        "description": "The average person now has &#163;38 less to spend each month after tax than they did at the end of 2024, following three consecutive quarters of falling UK living standards.",
        "url": "https://news.sky.com/story/britons-poorer-than-they-were-in-2019-as-living-standards-continue-to-fall-13486693",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-cost-of-living-data-x-forensics_7117594.jpg?20251222144826",
        "type": "UK",
        "Author": "Daniel Dunford",
        "Date Published": "2025-12-22 13:15:00",
        "Headline": "Disposable income is now more than £20 a month lower than it was six years ago after adjusting for inflation, according to new official figures.",
        "Content": "\n          Senior data journalist\n              @danieljdunford\n The average person now has £38 less to spend each month after tax than they did at the end of 2024, following three consecutive quarters of falling UK living standards. The government made \"improving living standards across all every part of the UK\" one of their most high profile targets to achieve before the next election. The previous parliament, between December 2019 and July 2024, was the first in recorded British history to oversee a fall in disposable income in real terms. But disposable income is now £1 lower per month than it was in summer 2019 after adjusting for inflation, according to Monday's updated figures from the Office for National Statistics, and more than £20 lower than in December 2019. Disposable income is the money people have left over after paying taxes and receiving benefits (including pensions). Essential expenses like rent or mortgage payments, council tax, food and energy bills all need to be paid from disposable income. Before 2022 there had been only one five-year period where living standards fell. That was between 2008 and 2013, following the financial crisis and austerity policies that followed. There have been just five other occasions since the 1950s where disposable income fell for three consecutive quarters. Three of those were in the 2010s, with the others during the early 1960s and late 1970s. The longest sustained fall was five consecutive quarters between December 2015 and March 2017, coinciding with the UK voting to leave the EU. Simon Pittaway, Senior Economist at living standards think tank the Resolution Foundation, told Sky News: \"Today's ONS data confirms that Britain's mini living standards bounce in 2024 is well and truly over. Growth has been poor this year and prospects for 2026 aren't looking great either. \"Stepping back, Britain's big problem is that the country experienced three once-in-a-generation economic shocks in less than two decades [the 2008 financial crash, Brexit, and the cost of living crisis/COVID], with people in their mid-late 30s having spent their entire working lives lurching from one national crisis to another. \"We need to avoid further shocks so that we can focus instead on boosting economic growth and lifting living standards.\" Sky News has been tracking the government's performance against some of their key economic targets, including living standards, inflation and growth. Despite the now three quarters of decline, living standards are up overall since Labour took office, after rapid growth in their first six months continued the trend of the final few months of the outgoing government. Inflation has risen however, and Britain is now the fourth-fastest growing G7 country behind the US, Japan and Canada. Use our tool to explore the country's performance on other important metrics: Responding to today's figures, a spokesperson for the prime minister told reporters: \"Living standards dropped last parliament, but we're working to improve them. Real wages have risen more in the last year than in the first 10 years of the previous government. This budget included help with energy bills, prescription fees, fuel duty and rail fares. It's expected to help lower inflation next year, inflation fell to 3.2% in November. \"Lower interest rates, six of them so far since the election, will help people and businesses borrow and spend. And we've also raised the national living wage, giving full-time low earners £900 more a year, and those on the national minimum wage at £1,500 more a year. \"We are, of course, always seeking to do more on growth, the economy has grown faster than expected this year, and most forecasts have been upgraded.\" Following the budget in November, anti-poverty think tank the Joseph Rowntree Foundation projected that living standards would fall by £850 a year over the course of this parliament. They also said that some actions at the budget, for example lifting the two-child benefit cap, would make the decline in living standards \"less painful\" for low-income households. Frozen tax thresholds mean that many people will be paying thousands of pounds a year more tax in real terms by the end of this parliament than they do currently, however, including low earners. Read more:Budget tax threshold freeze: Use our calculator to see how much more you will pay Sky News has also been tracking Labour's performance against their key policy targets, like small boat Channel crossings, housebuilding and renewable energy. Explore their performance towards those below: Click here to read more information about why we picked these targets and how we're measuring them. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "David Walliams removed from children's book festival line-up",
        "description": "David Walliams has been removed from the line-up for a children's book event.",
        "url": "https://news.sky.com/story/david-walliams-removed-from-childrens-book-festival-line-up-13486765",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/walliams-comedian-author_7115525.jpg?20251220003143",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-22 15:56:00",
        "Headline": "Decision comes after the author was dropped by his publisher over allegations of inappropriate behaviour. He \"strongly denies\" the claims.",
        "Content": "David Walliams has been removed from the line-up for a children's book event. Book retailer Waterstones has confirmed the author will no longer appear at its Children's Book Festival. It comes after the TV star was dropped by his publisher HarperCollins UK following allegations of inappropriate behaviour towards women. Walliams strongly denies allegations of inappropriate behaviour. A statement from Waterstones said: \"HarperCollins have confirmed that David Walliams will no longer be appearing at our festival in Dundee.\" The festival will span across three locations, also including Lincoln and Taunton. The Dundee event will take place on 6 and 7 February. Walliams has been removed from the listed speakers list on the festival website. \n                  David Walliams dropped by publisher HarperCollins UK after allegations of inappropriate behaviour\n                 \n                  David Walliams and Fremantle agree settlement over leaked Britain's Got Talent conversations\n                 \n                  Little Britain sketch 'explicitly racist and outdated', Ofcom research says\n                 The 54-year-old comedian, who shot to fame with the BBC sketch show Little Britain, is one of the country's best-selling children's writers. He has written more than 40 books, which have sold more than 60 million copies worldwide and been translated into 55 languages, according to his website. A spokesperson for HarperCollins UK said it had decided not to release any new titles by Walliams \"after careful consideration, and under the leadership of its new CEO\". \"HarperCollins takes employee well-being extremely seriously and has processes in place for reporting and investigating concerns,\" they added. \"To respect the privacy of individuals, we do not comment on internal matters.\" In a statement later on Friday, a spokesperson for the comedian and children's author said: \"David has never been informed of any allegations raised against him by HarperCollins. \"He was not party to any investigation or given any opportunity to answer questions. David strongly denies that he has behaved inappropriately and is taking legal advice.\" The news followed a report from The Daily Telegraph that Walliams was dropped after an investigation into allegations of inappropriate behaviour towards young women."
    },
    {
        "title": "Rachel Reeves's spring budget date is revealed",
        "description": "The chancellor's spring budget will take place in March, the Treasury has announced.",
        "url": "https://news.sky.com/story/rachel-reeves-spring-budget-date-is-revealed-13486767",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-budget_7092412.jpg?20251126115927",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-22 15:58:00",
        "Headline": "The chancellor faces another big political moment, due to continuing concern over the  economy and the controversy surrounding November's budget.",
        "Content": "The chancellor's spring budget will take place in March, the Treasury has announced. Rachel Reeves will deliver the budget, known as the \"spring forecast\", on 3 March 2026. She has asked the independent budget watchdog, the Office for Budget Responsibility (OBR), to \"prepare an economic and fiscal forecast\" for publication on the same day. The Treasury said the government has committed to delivering only one major fiscal event a year, at the autumn budget. As a result, it said the spring forecast will \"not make an assessment of the government's performance against the fiscal mandate and will instead provide an interim update on the economy and public finances\". However, the last spring statement saw the chancellor announce a series of welfare cuts, extra money for construction training and defence, and a crackdown on tax avoidance. The 2026 spring statement is set to be another big political event, due to continuing concern over the state of the economy and the controversy in the build up to November's budget, when Ms Reeves announced tax hikes. \n                  As GDP shrinks, it is not clear where the economic jump-start will come from\n                 \n                  UK economy shrank by 0.1% in October, official figures show\n                 \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 Her extension to the freeze on tax thresholds last month prompted accusations of breaking Labour's manifesto pledge not to raise taxes for working people. She was also accused of not revealing the true state of the nation's finances in the run-up to the budget after she repeatedly warned about a downgrade to the UK's economic productivity forecasts. On the day of the budget, it emerged the OBR told her in mid-September the public finances were in better shape than widely believed. However, Ms Reeves denied misleading the public. Read more:Budget 2025 key pointsPost-budget polling makes grim reading for Labour She said she had been \"upfront\" about her decision-making, and the OBR figures were clear there had been \"less fiscal space than there was\". All eyes will also be on the OBR during the spring forecast, after it accidentally published details of Ms Reeves' November budget nearly an hour before the chancellor stood up to deliver it. The head of the OBR, Richard Hughes, quit over the early release. An investigation found it was due to \"leadership failings\" over security measures rather than a malicious cyberattack."
    },
    {
        "title": "Trump: US has to have Greenland",
        "description": "Donald Trump has said the US \"has to have\" Greenland, claiming it needs the territory for national security.",
        "url": "https://news.sky.com/story/trump-us-has-to-have-greenland-13486627",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-greenland-landry_7117379.jpg?20251222105115",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-22 10:31:00",
        "Headline": "The president has appointed Jeff Landry as special envoy to the territory, saying he \"understands how essential Greenland is\" to US national security.",
        "Content": "Donald Trump has said the US \"has to have\" Greenland, claiming it needs the territory for national security. It comes after the US president appointed Louisiana's governor Jeff Landry as special envoy to Greenland, saying he would \"lead the charge\" in advocating the semi-autonomous part of Denmark to become part of the United States. \"Jeff understands how essential Greenland is to our national security,\" Mr Trump said. \"We need Greenland for national security, not for minerals... If you take a look ​at Greenland, you look up and down the coast, you have Russian and Chinese ships all over the place. \"We need it for national security. We have to ‍have it... Greenland is a big deal.\" Why does Trump want Greenland? Danish Prime Minister Mette Frederiksen and Greenland's Prime Minister Jens-Frederik Nielsen said in a joint statement that Greenland belongs to Greenlanders, stressing the US will not take it over. \"You cannot annex another country. Not even ‌with an argument about international security,\" they said. The country has already summoned the US ambassador in protest, with its foreign minister saying the move shows the US is still interested in the vast Danish territory. Mr Trump has repeatedly called for the US to take over the mineral rich and strategically located Arctic island, since winning his second term, and has not ruled out using military force to achieve it. Denmark's foreign minister Lars Løkke Rasmussen said everyone - including the US - must show respect for Denmark's territorial integrity. How did we get here? In March, US Vice President JD Vance visited a remote American military base in Greenland and accused Denmark - a NATO ally of the US - of underinvesting there. The issue then gradually drifted out of the headlines but, in August, Danish officials again summoned the US ambassador - following a report that at least three people with connections to Mr Trump had carried out covert influence operations in Greenland. The territory's strategic position between Europe and North America makes it a key site for the US ballistic missile defence system, while its mineral wealth has heightened US interest in reducing reliance on Chinese exports. Earlier this month, the Danish Defence Intelligence Service said in an annual report that the US was using its economic power to \"assert its will\" and threaten military force against friend and foe alike. Read more:Head of US Greenland base sacked after criticising JD VanceDenmark's PM says 'you can't spy against an ally' The report also highlighted the rising strategic importance of the Arctic to great power countries as \"conflict between Russia and the West intensifies. It went on to say that the growing security and strategic focus on the Arctic by the US would \"further accelerate these developments\". Russian President Vladimir Putin has said Russia is worried about NATO's activities in the Arctic and will respond by strengthening its military capability in the polar region."
    },
    {
        "title": "Timing of Russian general's assassination appears significant",
        "description": "A Russian general being blown up on his own doorstep isn't a good look for Moscow, and it seems it's becoming increasingly common.",
        "url": "https://news.sky.com/story/timing-of-russian-generals-assassination-appears-significant-13486701",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-general-russian-fanil-sarvarov_7117306.jpg?20251222094820",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-12-22 13:32:00",
        "Headline": "Ukraine has been trying to convince the US it's still full of fight - and taking out Russian generals in their own backyard is one way of doing that.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n A Russian general being blown up on his own doorstep isn't a good look for Moscow, and it seems it's becoming increasingly common. The latest high-profile figure to be assassinated since Russia's invasion of Ukraine is Lieutenant General Fanil Sarvarov. He was killed by a car bomb that detonated outside a residential complex, little more than 10 miles from the Kremlin. Ukraine war latest: Kremlin denies Putin plans to invade European countries He was a senior figure. Head of the operational training directorate of the general staff, Sarvarov prepared forces for future deployment, having previously served in Chechnya and Syria. There was no immediate claim of responsibility but Moscow believes Kyiv may have been behind it. No wonder - they've carried out similar attacks many times before. This time last year, Ukraine took credit for the assassination of Lieutenant General Igor Kirillov, who Kyiv alleged had ordered chemical weapons to be used against its troops on the battlefield. \n                  Russian general killed by car bomb and Moscow blames Ukraine\n                 \n                  How Trump has supercharged the new world dis-order\n                 \n                  Vladimir Putin didn't sound like he will alter his course anytime soon in annual TV address\n                 He was killed by a bomb hidden in a scooter outside his apartment block, which Vladimir Putin referred to as a \"major blunder\" by the security services. But the attacks didn't stop there. In April, Lieutenant General Yaroslav Moskalik was killed after a car exploded in a town just outside Moscow. And two months ago another car bomb in Siberia killed a Russian commander accused of committing war crimes. It's unclear why Sarvarov was targeted - perhaps simply because his rank and apparent vulnerability. The timing appears significant. It follows the latest peace talks between US and Russian officials in Miami over the weekend, where Kremlin envoy Kirill Dmitriev met with Steve Witkoff and Jared Kushner. In the past, Ukraine has used these kinds of attacks to embarrass Moscow and to bring the war closer to home for Russians. This time could be Kyiv's way of undermining Moscow's narrative in the negotiations. Read more from Sky News:Bondi suspect trained with father before attack, police sayTrump's Greenland envoy intends to make territory 'a part of US' The Kremlin has been trying to persuade the White House that a Russian victory is inevitable, and that it's futile to support Ukraine, in the hope of securing a more preferential settlement. Ukraine has been trying to convince the Trump administration of the opposite - that it's still full of fight - and taking out Russian generals in their own backyard is one way of doing that. It shows Washington that the Kremlin is clearly not in total control."
    },
    {
        "title": "Ecuador: Soldiers jailed for 34 years over disappearance of four murdered boys",
        "description": "Eleven soldiers have been jailed for more than 34 years over the disappearance of four murdered boys in Ecuador.",
        "url": "https://news.sky.com/story/ecuador-soldiers-jailed-for-34-years-over-disappearance-of-four-murdered-boys-13486836",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ecuador-soldiers_7117860.jpg?20251222194632",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-22 19:23:00",
        "Headline": "Their families say the boys had left home to play football on the day they disappeared in the Las Malvinas neighbourhood of Ecuador's largest city.",
        "Content": "Eleven soldiers have been jailed for more than 34 years over the disappearance of four murdered boys in Ecuador. The children, aged between 11 and 15, went missing in December last year in the city of Guayaquil. Their disappearance happened during a military offensive against organised crime launched by the country's president, who has ‌decreed various states of emergency and ordered soldiers to patrol the streets. Their families say the boys had left home to play football on the day they disappeared in the Las Malvinas neighbourhood of Ecuador's largest city. Protesters in Guayaquil held signs saying \"we are still waiting for justice\" and \"never forgive, never forget\" on Monday as the sentences were handed down. Five other soldiers who assisted prosecutors were sentenced to two-and-a-half ​years behind bars, while a lieutenant colonel accused of being complicit, but who was not part of the patrol, ‍was declared innocent. Soldiers allegedly detained the boys during a night patrol, after which they beat them and forced them to remove their clothes. They were allegedly abandoned naked in Taura, a desolate and dangerous rural area around 19 miles south of the city. One of the children called his father from Taura, but when he arrived to pick them up, he ‍could not find them, according to witness testimonies. Days later, four charred bodies were identified as the missing children. Lawyers for the boy's families said autopsies found injuries and bruises ​that were sustained prior to their deaths. \"The patrol abandoned the minors in that area, knowing it was dangerous, desolate, and abandoned,\" Judge Jovanny Suarez said in the ruling ‌that ended a weeks-long criminal trial. Read more from Sky News:In Caracas as US threatens military actionRussian general killed by car bomb Lawyers for the soldiers had argued ⁠the prosecution's evidence was not conclusive. They claimed the soldiers were ‌sent on patrol without prior training and that they had left the ‍minors alive in Taura. Ecuador's authorities continue to struggle with powerful drug cartels that hold huge amounts of influence. President Daniel Noboa has ‌decreed various states of emergency and ordered soldiers to patrol the streets."
    },
    {
        "title": "Bondi Beach shooting suspect trained with father before attack, police say",
        "description": "A man suspected of killing 15 people during a shooting in Bondi Beach \"conducted firearms training\" with his father before the attack on a Jewish event, Australian police have said.",
        "url": "https://news.sky.com/story/bondi-beach-shooting-suspect-trained-with-father-before-attack-police-say-13486555",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-naveed-akram-bondi-beach_7117237.jpg?20251222072149",
        "type": "World",
        "Author": "Miriam Kuepper, news reporter",
        "Date Published": "2025-12-22 04:30:00",
        "Headline": "Naveed Akram, 24, and his father, Sajid Akram, allegedly attacked people at a Hanukkah event at Bondi Beach on 14 December, killing victims aged 10 to 87 and injuring 40 others.",
        "Content": "By Miriam Kuepper, news reporter  A man suspected of killing 15 people during a shooting in Bondi Beach \"conducted firearms training\" with his father before the attack on a Jewish event, Australian police have said. Naveed Akram, 24, and his father, Sajid Akram, allegedly attacked people at a Hanukkah event at Bondi Beach on 14 December, killing victims aged 10 to 87 and injuring 40 others. Fifty-year-old Sajid Akram was killed by police at the scene, while Naveed was injured and treated in hospital. He has been charged with 59 offences and was transferred to a prison on Monday. New South Wales Police have released pictures of Naveed Akram and his father holding guns, as they \"conducted firearms training in a countryside location, suspected to be NSW\" in late October, according to a fact sheet seen by Sky News. \"The accused and his father are seen throughout the video firing shotguns and moving in a tactical manner,\" police said. 'Homemade bombs' On the day of the attack, the pair allegedly threw homemade bombs and improvised explosive devices (IEDs) at the gathering, but these did not detonate. \n                  Australian PM booed at Bondi Beach vigil a week after deadly terror attack\n                 \n                  'What they've seen, few people have ever seen': Lifeguards honour Bondi Beach victims\n                 \n                  Australia plans gun buyback scheme in response to Bondi Beach killings \n                 An analysis indicates that both were \"viable\" IEDs, according to the police file. The fact sheet was released after a suppression order was lifted by an NSW court. Police allege the men had stored the explosives - three pipe bombs, one \"tennis ball bomb\" and one large IED - in a silver Hyundai car, alongside two single-barrel shotguns, a Beretta rifle and two Islamic State flags. The Hyundai was parked near the scene of the shooting, with the Islamic State flags allegedly displayed in the front and rear windows. 'Justification' video found A phone belonging to Naveed Akram was also found in the car, on which officers identified several videos, including the alleged firearms training video. Another video shows Naveed Akram and his father sitting in front of an image of an Islamic State flag, with four long-arm guns with rounds attached seen in the background, police said. The men \"appear to summarise their justification for the Bondi terrorist attack\" in the footage, according to the fact sheet. Their Hyundai was previously seen on CCTV entering the car park at Bondi Beach before Naveed Akram and his father walked around the area at around 10pm on 12 December - two days before the shooting. Police said this was reconnaissance and planning for the attack. On the day of the shooting, CCTV showed the pair carrying bulky items wrapped in blankets to their car in the early hours of the morning. Police allege these hidden items were the rifles and homemade bombs. They went back inside the AirBnB rental property, in the suburb of Campsie, before leaving in the afternoon to head to Bondi. Police said a search of the property discovered a firearm scope, ammunition, a suspected IED, 3D-printed parts for a shotgun speed loader, a rifle, a shotgun, numerous firearms parts, bomb-making equipment and two copies of the Koran. Naveed Akram's mother said she believed her husband and son were on a fishing trip when they allegedly launched the attack, according to police. She said Naveed had been calling her every day from a public phone at around 10.30am. New gun laws Meanwhile, the NSW government announced new draft gun laws on Monday, which the state's premier, Chris Minns, promised would be the toughest in Australia. The new restrictions would include making Australian citizenship a condition of qualifying for a firearms licence. But a law like this would have excluded Sajid Akram, who was an Indian citizen with a permanent resident visa for Australia. Read more from Sky News:On the ground in Venezuela as US threatens military interventionNHS reported to police after 'butcher surgeon' evidence destroyed He also legally owned six rifles and shotguns, which would be limited to a maximum of four guns under the new legal limit for recreational shooters. This comes as Australia's Prime Minister Anthony Albanese said on Monday that his government would introduce a new offence of adults trying to influence and radicalise children after already introducing legislation to criminalise hate speech and doxing."
    },
    {
        "title": "Donald Trump unveils plan for 'Trump Class' battleships",
        "description": "Donald Trump has announced a plan for the US Navy to build two new \"Trump Class\" battleships.",
        "url": "https://news.sky.com/story/donald-trump-unveils-plan-for-trump-class-battleships-13486913",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-trump-battleship-us_7118051.jpg?20251223005425",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-22 23:41:00",
        "Headline": "Made of steel and complete with missiles, guns, lasers and hypersonic weapons, the vessels will be the \"centrepiece\" of the US Navy's Golden Fleet initiative, the president said.",
        "Content": "Donald Trump has announced a plan for the US Navy to build two new \"Trump Class\" battleships. Aimed at cementing US naval dominance, the president said the vessels will be \"the fastest, the biggest and 100 times more powerful than any battleship ever built\". Constructed in America, made of steel and complete with missiles, guns, lasers and hypersonic weapons, the vessels will be the \"centrepiece\" of the US Navy's Golden Fleet initiative, he said. Starting with two vessels, Mr Trump said the project would eventually expand to include 20 to 25 new ships. The first will ‍be christened the USS Defiant, with the US leader personally involved in how it looks. It comes as the US continues to build a large naval military presence near the coast of Venezuela. Since early September, it has struck more than 20 vessels in the Pacific Ocean and Caribbean Sea, which Mr Trump says is to crack down on drug cartels. The US Navy has also seized two oil tankers and is believed to be in \"active pursuit\" of a third, according to officials. \"There's never been anything like these ships. These have been under design consideration for a long time,\" he said. \"Each one of these will be the largest battleship in the history of our country. The largest battleship in the history of the world. \"We haven't built a battleship ​since 1994. These cutting-edge vessels will be some of the most lethal surface warfare ships... other than our submarines.\" Mr Trump made the announcement at his Mar-a-Lago estate in Florida. During the briefing, he stood next to mock-up pictures of the new vessels which had \"Trump Class\" written in the corner - what a senior administration official said the new class of vessel will be known as. In addition to the new ‍battleship class, the project aims to increase the number of other types of war vessels, including a smaller, more nimble frigate class. The term battleship has historically referred to a large, heavily armoured vessel armed with guns designed to bombard other ships or targets ashore. This type of ship reached peak prominence during the Second World War. The largest of the US battleships was the Iowa-class. The Trump administration has been complaining about the slow and expensive state of the current defence industry. Just a month ago, the Navy scrapped its plans to build a new, small warship, citing growing delays and overrunning costs. It has also failed to build its other newly designed ships, like the new Ford-class aircraft carrier and Columbia-class submarines, on time and on budget. Read more from Sky News:US in 'active pursuit' of third vessel off Venezuelan coastHow Trump has supercharged the new world dis-order But Mr Trump said the naval expansion would also be paired with renewed pressure on defence contractors to speed up ‌production and rein in costs. He said he plans to meet with ⁠major firms next week to address problems."
    },
    {
        "title": "Barry Manilow needs surgery for lung cancer, singer reveals",
        "description": "Barry Manilow is being treated for lung cancer and has been forced to reschedule live shows, the 82 year-old has revealed.",
        "url": "https://news.sky.com/story/barry-manilow-needs-surgery-for-lung-cancer-singer-reveals-13486763",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-barry-manilow-music_7117667.jpg?20251222155901",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-22 15:50:00",
        "Headline": "The 82 year-old Copacabana star is rescheduling US shows after a cancerous spot was discovered on his left lung.",
        "Content": "Barry Manilow is being treated for lung cancer and has been forced to reschedule live shows, the 82 year-old has revealed. The Copacabana popstar announced on Instagram that a cancerous spot had been discovered on his left lung. \"As many of you know I recently went through six weeks of bronchitis followed by a relapse of another five weeks,\" he wrote. \"Even though I was over the bronchitis and back on stage at the Westgate Las Vegas, my wonderful doctor ordered an MRI just to make sure that everything was OK. \"The MRI discovered a cancerous spot on my left lung that needs to be removed.\" Manilow, 82, added that the cancer had been found early thanks to \"pure luck\" and a \"great doctor\". And while he would not require chemotherapy or radiation treatment, he wrote, he would have to undergo surgery, forcing him to reschedule his January shows. \n                  Sir Cliff Richard says he has been treated for prostate cancer\n                 \n                  King reveals 'good news' in his battle with cancer and urges people to get checked\n                 \n                  Prostate cancer treatment with potential for fewer side effects to be trialled in UK\n                 He had been due to embark on a string of arena concerts in US cities including Orlando, Tampa, Charleston, Greensboro and Columbus. He wrote: \"I'm going into surgery to have the spot removed. The doctors do not believe it has spread and I'm taking tests to confirm their diagnosis. \"The only follow-up is a month to recover and that means we have to reschedule the January arena concerts. \"I'm very sorry that you have to change your plans. \"Just like you, we were all looking forward to the January shows and hate having to move everything around.\" Read more:King 'deeply touched' by reaction to cancer 'good news'NHS to offer same-day prostate cancer diagnosis The Grammy Award-winning singer has released a string of hits over the course of more than 50 years recording music. They include Could It Be Magic, Looks Like We Made It, Mandy, and Can't Smile Without You. His announcement comes after Cliff Richard revealed he had been treated for prostate cancer."
    },
    {
        "title": "Trump: US has to have Greenland",
        "description": "Donald Trump has said the US \"has to have\" Greenland, claiming it needs the territory for national security.",
        "url": "https://news.sky.com/story/trump-us-has-to-have-greenland-13486627",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-greenland-landry_7117379.jpg?20251222105115",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-22 10:31:00",
        "Headline": "The president has appointed Jeff Landry as special envoy to the territory, saying he \"understands how essential Greenland is\" to US national security.",
        "Content": "Donald Trump has said the US \"has to have\" Greenland, claiming it needs the territory for national security. It comes after the US president appointed Louisiana's governor Jeff Landry as special envoy to Greenland, saying he would \"lead the charge\" in advocating the semi-autonomous part of Denmark to become part of the United States. \"Jeff understands how essential Greenland is to our national security,\" Mr Trump said. \"We need Greenland for national security, not for minerals... If you take a look ​at Greenland, you look up and down the coast, you have Russian and Chinese ships all over the place. \"We need it for national security. We have to ‍have it... Greenland is a big deal.\" Why does Trump want Greenland? Danish Prime Minister Mette Frederiksen and Greenland's Prime Minister Jens-Frederik Nielsen said in a joint statement that Greenland belongs to Greenlanders, stressing the US will not take it over. \"You cannot annex another country. Not even ‌with an argument about international security,\" they said. The country has already summoned the US ambassador in protest, with its foreign minister saying the move shows the US is still interested in the vast Danish territory. Mr Trump has repeatedly called for the US to take over the mineral rich and strategically located Arctic island, since winning his second term, and has not ruled out using military force to achieve it. Denmark's foreign minister Lars Løkke Rasmussen said everyone - including the US - must show respect for Denmark's territorial integrity. How did we get here? In March, US Vice President JD Vance visited a remote American military base in Greenland and accused Denmark - a NATO ally of the US - of underinvesting there. The issue then gradually drifted out of the headlines but, in August, Danish officials again summoned the US ambassador - following a report that at least three people with connections to Mr Trump had carried out covert influence operations in Greenland. The territory's strategic position between Europe and North America makes it a key site for the US ballistic missile defence system, while its mineral wealth has heightened US interest in reducing reliance on Chinese exports. Earlier this month, the Danish Defence Intelligence Service said in an annual report that the US was using its economic power to \"assert its will\" and threaten military force against friend and foe alike. Read more:Head of US Greenland base sacked after criticising JD VanceDenmark's PM says 'you can't spy against an ally' The report also highlighted the rising strategic importance of the Arctic to great power countries as \"conflict between Russia and the West intensifies. It went on to say that the growing security and strategic focus on the Arctic by the US would \"further accelerate these developments\". Russian President Vladimir Putin has said Russia is worried about NATO's activities in the Arctic and will respond by strengthening its military capability in the polar region."
    },
    {
        "title": "Call Of Duty co-creator Vince Zampella dies aged 55",
        "description": "Vince Zambella, one of the creators behind best-selling video game series Call Of Duty, has died.",
        "url": "https://news.sky.com/story/call-of-duty-co-creator-vince-zampella-dies-aged-55-13486915",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-vince-zampella-call-of-duty_7118038.jpg?20251222233409",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-22 23:47:00",
        "Headline": "Zampella, who reportedly died in a car crash in California, was hailed as a \"visionary creator\" by video game maker Electronic Arts.",
        "Content": "Vince Zambella, one of the creators behind best-selling video game series Call Of Duty, has died. Video game maker Electronic Arts (EA) said the 55-year-old died on Sunday but did not disclose a cause of death. It was reported he died in a car crash in Southern California. The single-vehicle collision involving a Ferrari happened in the San Gabriel Mountains at about 12.45pm local time, according to NBC Los Angeles. Zampella founded Respawn Entertainment, a subsidiary of EA, in 2010 and he was the former chief executive of video game developer Infinity Ward, the studio behind the Call of Duty franchise.An EA spokesperson said Zampella's influence on the video game industry was \"profound and far-reaching\". \"A friend, colleague, leader and visionary creator, his work helped shape modern interactive entertainment and inspired millions of players and developers around the world,\" the spokesperson added. \"His legacy will continue to shape how games are made and how players connect for generations to come.\" Read more from Sky News:Is the AI bubble about to burst?'Our daughter vanished 20 years ago - but AI may finally solve case' One of Zampella's crowning achievements was the creation of the Call of Duty franchise, which has sold more than half a billion games worldwide. The first-person shooter game debuted in 2003 as a Second World War simulation, while subsequent versions have delved into modern warfare. There is a live-action movie based on the game in production with Paramount Pictures. Zampella was also at the helm of the creation of action adventure video games Star Wars Jedi: Fallen Order and Star Wars Jedi: Survivor."
    },
    {
        "title": "FTSE-100 events group Informa kicks off hunt for new chairman",
        "description": "Informa, the FTSE-100 events group behind the Fort Lauderdale International Boat Show and World of Concrete, is kicking off a search for its next chairman.",
        "url": "https://news.sky.com/story/ftse-100-events-group-informa-kicks-off-hunt-for-new-chairman-13486650",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-informa-ceo_7117435.jpg?20251222115244",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-22 21:20:00",
        "Headline": "The former owner of the historic maritime news service Lloyd’s List is working with headhunters to identify a successor to John Rishton, its chairman since 2021, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Informa, the FTSE-100 events group behind the Fort Lauderdale International Boat Show and World of Concrete, is kicking off a search for its next chairman. Sky News has learnt that Informa, which has a market capitalisation of about £11.3bn, is working with headhunters to find a successor to John Rishton. City sources said on Monday that Russell Reynolds Associates was handling the search. A former chief executive of Rolls Royce Group, Mr Rishton joined the Informa board in September 2016 before taking over as chairman nearly five years later. People close to the process said he was likely to step down in 2027, by which time he will have served for nearly 11 years as a director. Informa has a large data division, which has been responsible for a significant proportion of its recent growth. Its assets previously included the historic maritime news and analysis service Lloyd's List, which claims to be the world's longest published business newspaper. Read more from Sky News:Britons poorer than they were in 2019Reeves's spring budget date is revealed Earlier this year, it emerged that Lord Carter, the company's chief executive, had moved his residency to Dubai to reflect its rapid growth prospects in the Gulf region. The launch of a hunt for a new chairman and Lord Carter's recent relocation makes it increasingly likely that he will extend his current 12-year tenure by at least another two years. Shares in Informa, which declined to comment on the search for Mr Rishton's successor, closed on Monday at 885.2p."
    },
    {
        "title": "Britons are less well off than they were in 2019 - and these figures show it",
        "description": "The average person now has &#163;38 less to spend each month after tax than they did at the end of 2024, following three consecutive quarters of falling UK living standards.",
        "url": "https://news.sky.com/story/britons-poorer-than-they-were-in-2019-as-living-standards-continue-to-fall-13486693",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-cost-of-living-data-x-forensics_7117594.jpg?20251222144826",
        "type": "Business",
        "Author": "Daniel Dunford",
        "Date Published": "2025-12-22 13:15:00",
        "Headline": "Disposable income is now more than £20 a month lower than it was six years ago after adjusting for inflation, according to new official figures.",
        "Content": "\n          Senior data journalist\n              @danieljdunford\n The average person now has £38 less to spend each month after tax than they did at the end of 2024, following three consecutive quarters of falling UK living standards. The government made \"improving living standards across all every part of the UK\" one of their most high profile targets to achieve before the next election. The previous parliament, between December 2019 and July 2024, was the first in recorded British history to oversee a fall in disposable income in real terms. But disposable income is now £1 lower per month than it was in summer 2019 after adjusting for inflation, according to Monday's updated figures from the Office for National Statistics, and more than £20 lower than in December 2019. Disposable income is the money people have left over after paying taxes and receiving benefits (including pensions). Essential expenses like rent or mortgage payments, council tax, food and energy bills all need to be paid from disposable income. Before 2022 there had been only one five-year period where living standards fell. That was between 2008 and 2013, following the financial crisis and austerity policies that followed. There have been just five other occasions since the 1950s where disposable income fell for three consecutive quarters. Three of those were in the 2010s, with the others during the early 1960s and late 1970s. The longest sustained fall was five consecutive quarters between December 2015 and March 2017, coinciding with the UK voting to leave the EU. Simon Pittaway, Senior Economist at living standards think tank the Resolution Foundation, told Sky News: \"Today's ONS data confirms that Britain's mini living standards bounce in 2024 is well and truly over. Growth has been poor this year and prospects for 2026 aren't looking great either. \"Stepping back, Britain's big problem is that the country experienced three once-in-a-generation economic shocks in less than two decades [the 2008 financial crash, Brexit, and the cost of living crisis/COVID], with people in their mid-late 30s having spent their entire working lives lurching from one national crisis to another. \"We need to avoid further shocks so that we can focus instead on boosting economic growth and lifting living standards.\" Sky News has been tracking the government's performance against some of their key economic targets, including living standards, inflation and growth. Despite the now three quarters of decline, living standards are up overall since Labour took office, after rapid growth in their first six months continued the trend of the final few months of the outgoing government. Inflation has risen however, and Britain is now the fourth-fastest growing G7 country behind the US, Japan and Canada. Use our tool to explore the country's performance on other important metrics: Responding to today's figures, a spokesperson for the prime minister told reporters: \"Living standards dropped last parliament, but we're working to improve them. Real wages have risen more in the last year than in the first 10 years of the previous government. This budget included help with energy bills, prescription fees, fuel duty and rail fares. It's expected to help lower inflation next year, inflation fell to 3.2% in November. \"Lower interest rates, six of them so far since the election, will help people and businesses borrow and spend. And we've also raised the national living wage, giving full-time low earners £900 more a year, and those on the national minimum wage at £1,500 more a year. \"We are, of course, always seeking to do more on growth, the economy has grown faster than expected this year, and most forecasts have been upgraded.\" Following the budget in November, anti-poverty think tank the Joseph Rowntree Foundation projected that living standards would fall by £850 a year over the course of this parliament. They also said that some actions at the budget, for example lifting the two-child benefit cap, would make the decline in living standards \"less painful\" for low-income households. Frozen tax thresholds mean that many people will be paying thousands of pounds a year more tax in real terms by the end of this parliament than they do currently, however, including low earners. Read more:Budget tax threshold freeze: Use our calculator to see how much more you will pay Sky News has also been tracking Labour's performance against their key policy targets, like small boat Channel crossings, housebuilding and renewable energy. Explore their performance towards those below: Click here to read more information about why we picked these targets and how we're measuring them. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Rachel Reeves's spring budget date is revealed",
        "description": "The chancellor's spring budget will take place in March, the Treasury has announced.",
        "url": "https://news.sky.com/story/rachel-reeves-spring-budget-date-is-revealed-13486767",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-budget_7092412.jpg?20251126115927",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-22 15:58:00",
        "Headline": "The chancellor faces another big political moment, due to continuing concern over the  economy and the controversy surrounding November's budget.",
        "Content": "The chancellor's spring budget will take place in March, the Treasury has announced. Rachel Reeves will deliver the budget, known as the \"spring forecast\", on 3 March 2026. She has asked the independent budget watchdog, the Office for Budget Responsibility (OBR), to \"prepare an economic and fiscal forecast\" for publication on the same day. The Treasury said the government has committed to delivering only one major fiscal event a year, at the autumn budget. As a result, it said the spring forecast will \"not make an assessment of the government's performance against the fiscal mandate and will instead provide an interim update on the economy and public finances\". However, the last spring statement saw the chancellor announce a series of welfare cuts, extra money for construction training and defence, and a crackdown on tax avoidance. The 2026 spring statement is set to be another big political event, due to continuing concern over the state of the economy and the controversy in the build up to November's budget, when Ms Reeves announced tax hikes. \n                  As GDP shrinks, it is not clear where the economic jump-start will come from\n                 \n                  UK economy shrank by 0.1% in October, official figures show\n                 \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 Her extension to the freeze on tax thresholds last month prompted accusations of breaking Labour's manifesto pledge not to raise taxes for working people. She was also accused of not revealing the true state of the nation's finances in the run-up to the budget after she repeatedly warned about a downgrade to the UK's economic productivity forecasts. On the day of the budget, it emerged the OBR told her in mid-September the public finances were in better shape than widely believed. However, Ms Reeves denied misleading the public. Read more:Budget 2025 key pointsPost-budget polling makes grim reading for Labour She said she had been \"upfront\" about her decision-making, and the OBR figures were clear there had been \"less fiscal space than there was\". All eyes will also be on the OBR during the spring forecast, after it accidentally published details of Ms Reeves' November budget nearly an hour before the chancellor stood up to deliver it. The head of the OBR, Richard Hughes, quit over the early release. An investigation found it was due to \"leadership failings\" over security measures rather than a malicious cyberattack."
    },
    {
        "title": "UK economic slowdown is confirmed by new official figures",
        "description": "The UK economy grew by just 0.1% in the third quarter of this year, weaker than the 0.2% growth in GDP for the previous three months, new official figures reveal.",
        "url": "https://news.sky.com/story/uk-economic-slowdown-is-confirmed-by-new-official-figures-13486680",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jaguar-land-rover_7009369.jpg?20250902155229",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-22 12:41:00",
        "Headline": "ONS reveals GDP grew by just 0.1% between July and September; down from 0.2%  the previous quarter. The Jaguar Land Rover cyberattack is thought to be a  factor. ",
        "Content": "The UK economy grew by just 0.1% in the third quarter of this year, weaker than the 0.2% growth in GDP for the previous three months, new official figures reveal. The 0.2% figure, for April to June, was itself revised down by the Office for National Statistics (ONS), from its earlier estimate for the period of 0.3 per cent. The cyberattack on Jaguar Land Rover, which halted production for weeks, appears to have played a part in the July to September slowdown. \"Today's updated figures paint the same picture as our initial estimate, with growth continuing to slow in the third quarter,\" said Liz McKeown, ONS director of economic statistics. \"Growth in services were partially offset by falls in production, with a marked drop in car manufacturing.\" In an indicator of the pressure on people's finances, Britons also saved less between July and September. The household saving ratio fell 0.7 percentage points to 9.5% - the lowest in a year; and there was also an 0.8% dip in household disposable income per head, following no change in the previous quarter. \n                  FTSE-100 events group Informa kicks off hunt for new chairman\n                 \n                  Britons are less well off than they were in 2019 - and these figures show it\n                 \n                  Rachel Reeves's spring budget date is revealed\n                 The Bank of England trimmed interest rates to 3.75% last week in a bid to help boost the economy. It said it expected zero GDP growth in the current October-to-December period but that the underlying pace of economic growth was around 0.2% per quarter. GDP is an important indicator for the economy as it measures the total value of all goods made and services provided. Rising GDP means the economy is growing. Read more:How a roundabout could decide the UK's next PMStarmer will absolutely be PM next Christmas Britain had had the best growth figures among the ​Group of Seven large advanced economies in the first half of this year, alongside Japan. However, the growth has slowed significantly since then. Critics have put this down in part to long-running uncertainty about tax increases in the run up to the chancellor's budget last month. The ONS revised its 2024 fourth-quarter estimate up 0.1 percentage points to 0.3%. Revisions are often made when more detailed information and data become available. The ONS said GDP in the third quarter (July to September) was estimated to be 1.3% higher than the same period last year. Meanwhile, GDP for 2024 as a whole increased by 1.1%."
    },
    {
        "title": "Rachel Reeves's spring budget date is revealed",
        "description": "The chancellor's spring budget will take place in March, the Treasury has announced.",
        "url": "https://news.sky.com/story/rachel-reeves-spring-budget-date-is-revealed-13486767",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-budget_7092412.jpg?20251126115927",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-22 15:58:00",
        "Headline": "The chancellor faces another big political moment, due to continuing concern over the  economy and the controversy surrounding November's budget.",
        "Content": "The chancellor's spring budget will take place in March, the Treasury has announced. Rachel Reeves will deliver the budget, known as the \"spring forecast\", on 3 March 2026. She has asked the independent budget watchdog, the Office for Budget Responsibility (OBR), to \"prepare an economic and fiscal forecast\" for publication on the same day. The Treasury said the government has committed to delivering only one major fiscal event a year, at the autumn budget. As a result, it said the spring forecast will \"not make an assessment of the government's performance against the fiscal mandate and will instead provide an interim update on the economy and public finances\". However, the last spring statement saw the chancellor announce a series of welfare cuts, extra money for construction training and defence, and a crackdown on tax avoidance. The 2026 spring statement is set to be another big political event, due to continuing concern over the state of the economy and the controversy in the build up to November's budget, when Ms Reeves announced tax hikes. \n                  As GDP shrinks, it is not clear where the economic jump-start will come from\n                 \n                  UK economy shrank by 0.1% in October, official figures show\n                 \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 Her extension to the freeze on tax thresholds last month prompted accusations of breaking Labour's manifesto pledge not to raise taxes for working people. She was also accused of not revealing the true state of the nation's finances in the run-up to the budget after she repeatedly warned about a downgrade to the UK's economic productivity forecasts. On the day of the budget, it emerged the OBR told her in mid-September the public finances were in better shape than widely believed. However, Ms Reeves denied misleading the public. Read more:Budget 2025 key pointsPost-budget polling makes grim reading for Labour She said she had been \"upfront\" about her decision-making, and the OBR figures were clear there had been \"less fiscal space than there was\". All eyes will also be on the OBR during the spring forecast, after it accidentally published details of Ms Reeves' November budget nearly an hour before the chancellor stood up to deliver it. The head of the OBR, Richard Hughes, quit over the early release. An investigation found it was due to \"leadership failings\" over security measures rather than a malicious cyberattack."
    },
    {
        "title": "Britons are less well off than they were in 2019 - and these figures show it",
        "description": "The average person now has &#163;38 less to spend each month after tax than they did at the end of 2024, following three consecutive quarters of falling UK living standards.",
        "url": "https://news.sky.com/story/britons-poorer-than-they-were-in-2019-as-living-standards-continue-to-fall-13486693",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-cost-of-living-data-x-forensics_7117594.jpg?20251222144826",
        "type": "Politics",
        "Author": "Daniel Dunford",
        "Date Published": "2025-12-22 13:15:00",
        "Headline": "Disposable income is now more than £20 a month lower than it was six years ago after adjusting for inflation, according to new official figures.",
        "Content": "\n          Senior data journalist\n              @danieljdunford\n The average person now has £38 less to spend each month after tax than they did at the end of 2024, following three consecutive quarters of falling UK living standards. The government made \"improving living standards across all every part of the UK\" one of their most high profile targets to achieve before the next election. The previous parliament, between December 2019 and July 2024, was the first in recorded British history to oversee a fall in disposable income in real terms. But disposable income is now £1 lower per month than it was in summer 2019 after adjusting for inflation, according to Monday's updated figures from the Office for National Statistics, and more than £20 lower than in December 2019. Disposable income is the money people have left over after paying taxes and receiving benefits (including pensions). Essential expenses like rent or mortgage payments, council tax, food and energy bills all need to be paid from disposable income. Before 2022 there had been only one five-year period where living standards fell. That was between 2008 and 2013, following the financial crisis and austerity policies that followed. There have been just five other occasions since the 1950s where disposable income fell for three consecutive quarters. Three of those were in the 2010s, with the others during the early 1960s and late 1970s. The longest sustained fall was five consecutive quarters between December 2015 and March 2017, coinciding with the UK voting to leave the EU. Simon Pittaway, Senior Economist at living standards think tank the Resolution Foundation, told Sky News: \"Today's ONS data confirms that Britain's mini living standards bounce in 2024 is well and truly over. Growth has been poor this year and prospects for 2026 aren't looking great either. \"Stepping back, Britain's big problem is that the country experienced three once-in-a-generation economic shocks in less than two decades [the 2008 financial crash, Brexit, and the cost of living crisis/COVID], with people in their mid-late 30s having spent their entire working lives lurching from one national crisis to another. \"We need to avoid further shocks so that we can focus instead on boosting economic growth and lifting living standards.\" Sky News has been tracking the government's performance against some of their key economic targets, including living standards, inflation and growth. Despite the now three quarters of decline, living standards are up overall since Labour took office, after rapid growth in their first six months continued the trend of the final few months of the outgoing government. Inflation has risen however, and Britain is now the fourth-fastest growing G7 country behind the US, Japan and Canada. Use our tool to explore the country's performance on other important metrics: Responding to today's figures, a spokesperson for the prime minister told reporters: \"Living standards dropped last parliament, but we're working to improve them. Real wages have risen more in the last year than in the first 10 years of the previous government. This budget included help with energy bills, prescription fees, fuel duty and rail fares. It's expected to help lower inflation next year, inflation fell to 3.2% in November. \"Lower interest rates, six of them so far since the election, will help people and businesses borrow and spend. And we've also raised the national living wage, giving full-time low earners £900 more a year, and those on the national minimum wage at £1,500 more a year. \"We are, of course, always seeking to do more on growth, the economy has grown faster than expected this year, and most forecasts have been upgraded.\" Following the budget in November, anti-poverty think tank the Joseph Rowntree Foundation projected that living standards would fall by £850 a year over the course of this parliament. They also said that some actions at the budget, for example lifting the two-child benefit cap, would make the decline in living standards \"less painful\" for low-income households. Frozen tax thresholds mean that many people will be paying thousands of pounds a year more tax in real terms by the end of this parliament than they do currently, however, including low earners. Read more:Budget tax threshold freeze: Use our calculator to see how much more you will pay Sky News has also been tracking Labour's performance against their key policy targets, like small boat Channel crossings, housebuilding and renewable energy. Explore their performance towards those below: Click here to read more information about why we picked these targets and how we're measuring them. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "No 10 'sticking to red lines' on UK-EU customs union after Streeting comments",
        "description": "Downing Street has insisted the government is committed to \"sticking to our red lines\", after Wes Streeting appeared to endorse calls for a bespoke UK-EU customs union.",
        "url": "https://news.sky.com/story/no-10-sticking-to-red-lines-on-uk-eu-customs-union-after-streeting-comments-13486691",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-wes-streeting-doctors-strike_7112713.jpg?20251217092049",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-22 13:04:00",
        "Headline": "The health secretary appeared to leave the door open to joining a customs union - in what is being seen as a challenge to the PM.",
        "Content": "Downing Street has insisted the government is committed to \"sticking to our red lines\", after Wes Streeting appeared to endorse calls for a bespoke UK-EU customs union. The health secretary seemed to break ranks with the prime minister in an interview, where he called for a \"deeper trading relationship with the EU\", and suggested this would boost economic growth. Under such an arrangement, the UK would get access to tariff-free trade with the bloc, while having to accept common standards for traded goods. Speaking to The Observer on Sunday, Mr Streeting ruled out a return to the single market, and thereby freedom of movement. But he appeared to leave the door open to the UK joining a customs union. Read more:Puppy farming and trail hunting to be bannedHow a roundabout could decide the UK's next PM He told the newspaper: \"The best way for us to get more growth into our economy is a deeper trading relationship with the EU. \"The reason why leaving the EU hit us so hard as a country is because of the enormous economic benefits that came with being in the single market and the customs union. This is a country and a government that wants a closer trading relationship with Europe. \"The challenge is any economic partnership we have can't lead to a return to freedom of movement.\" Labour's 2024 general election manifesto set out three so-called \"red lines\" regarding the EU. It stated: \"There will be no return to the single market, the customs union, or freedom of movement.\" Downing Street has insisted that this position remains, despite the calls for closer relations from Mr Streeting. Speaking to journalists on Monday morning, a spokesperson for the PM said: \"We all have been very open about the need to reset our relationship with the EU, and strengthen that relationship while sticking to our red lines for the long term.\" Mr Streeting remarks have been seized on by the Conservatives, who accused him of \"political pitch-making\". A Tory spokesperson said: \"Instead of focusing on running the health service, Wes Streeting is busy courting left-wing, pro-EU Labour Party members - now even floating the idea of dragging Britain back into the EU's customs union.\" Meanwhile, Reform UK deputy leader Richard Tice said: \"Starmer's so-called 'reset' deal was already a shameful betrayal of what people voted for in 2016. \"Now we've heard it straight from the horse's mouth, Labour Remoaners like Wes Streeting will not be satisfied until every valuable Brexit freedom is surrendered directly to Brussels.\" The health secretary's remarks follow growing calls within Labour for the UK to enter into a customs union with the bloc, which is Britain's biggest trading partner. Earlier this month, Deputy Prime Minister David Lammy appeared to back suggestions that this should happen."
    },
    {
        "title": "Puppy farming and trail hunting to be banned - but critics warn of 'war on the countryside'",
        "description": "Puppy farms, trail hunting and snare traps are all set to be banned under animal welfare reforms being introduced by the government.",
        "url": "https://news.sky.com/story/puppy-farming-and-trail-hunting-to-be-banned-but-critics-warn-of-war-on-the-countryside-13486579",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-puppies-puppy-farming_7117252.jpg?20251222075843",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-22 07:57:00",
        "Headline": "Ministers are introducing a series of new measures to better protect pets and wild animals - but critics warn Labour \"simply don't care about rural Britain\".",
        "Content": "Puppy farms, trail hunting and snare traps are all set to be banned under animal welfare reforms being introduced by the government. Ministers have today unveiled the government's Animal Welfare Strategy, which also takes aim at other measures seen as cruel, such as shock collars, as well as cages and crates for farm animals. But while proposals to improve animals' lives have been welcomed, Labour have been accused of acting like \"authoritarian control freaks\" for plans to ban trail hunting by 2029. This is the practice that sees an animal scent laid through the countryside, which then allows riders and dogs to 'hunt' the smell. Labour banned fox hunting outright in 2004, but Sir Keir Starmer's government has suggested trail hunting is now \"being used as a smokescreen for hunting\" foxes. Announcing the reforms, Environment Secretary Emma Reynolds said: \"This government is delivering the most ambitious animal welfare strategy in a generation. \"Our strategy will raise welfare standards for animals in the home, on the farm and in the wild.\" \n                  Man arrested after frozen pangolins, rats and porcupines seized in London\n                 \n                  Scottish wildlife park defends decision to allow convicted animal abuser to volunteer at visitor attraction\n                 \n                  Natalie Herron: Scottish woman jailed for sharing monkey torture videos\n                 Under the proposals, puppy farms - large-scale sites where dogs are bred intensively - will be banned. This is because these farms can see breeding dogs kept in \"appalling conditions\" and \"denied proper care\", resulting in \"long-term health issues\", according to the Department for the Environment, Food and Rural Affairs (DEFRA). The strategy has also launched a consultation on banning shock collars, which use electricity to sting pets and prevent them from escaping. Other proposals include introducing new licences for rescue and rehoming organisations, promoting \"responsible\" dog ownership and bringing in new restrictions for farms to improve animal welfare. Read more:How a roundabout could decide the UK's next PMStarmer will absolutely be PM next Christmas These will see bans on \"confinement systems\" such as colony cages for hens and pig-farrowing crates, while requirements will be brought in to spare farmed fish \"avoidable pain\". The use of carbon dioxide to stun pigs will also be addressed, while farmers will be encouraged to choose to rear slower-growing meat chicken breeds. In order to protect wild animals, snare traps will be banned alongside trail hunting, while restrictions on when hares can be shot will be introduced. The reforms have been publicly welcomed by multiple animal charities, including the RSPCA, Dogs Trust, Battersea Dogs and Cats Home, and World Farming UK, as well as by the supermarket Waitrose. Thomas Schultz-Jagow, from the RSPCA, called the proposals a \"significant step forward\" and said they have the potential to improve millions of lives. He added: \"People in the UK love animals, and they want to see governments leading the way to outlaw cruel practices which cause suffering. This strategy leads the way by showing a strong commitment to animal welfare.\" Meanwhile, the Greens have also welcomed it but warned the strategy must have \"real teeth\", \"clear timescales\" and \"properly support farmers through the transition and not allow imports that don't meet UK standards\". Adrian Ramsay said: \"Puppy legislation must end breeding for extreme, unhealthy traits in dogs. The strategy could go further for animals, particularly by ending greyhound racing, as the Welsh Government is doing.\" But the Conservatives have hit out at the strategy, saying it shows Labour \"simply doesn't care about rural Britain\". Victoria Atkins, the shadow environment secretary, said: \"While it is good to see the government taking forward Conservative policies to tackle puppy smuggling and livestock worrying, Labour is yet again favouring foreign farmers over British farmers by allowing substandard foreign imports to undercut our already-high welfare standards.\" She also accused Labour of announcing the strategy on the Monday before Christmas \"to avoid scrutiny\" as \"they know that this will be another hammer blow to farming profitability\". Challenged on whether the government will make meat import standards the same as those for UK farmers, a spokesperson for the PM said: \"We will always consider whether overseas products have an unfair advantage, and we are prepared to use the full range of powers of disposal to ensure produce made here in the UK by our farmers is always the most viable option. \"The farming road map due in 2026 will set out our long-term vision.\" They pointed to the 57 recommendations put forward by former NFU boss Baroness Minette Batters last week, following the completion of the Farm Profitability Review. The spokesperson said that ministers are \"considering them carefully\". But responding to the strategy, Nigel Farage said: \"So now Labour wants to ban trail hunting. You might as well ban walking dogs in the countryside as they chase rabbits, hares, deer and foxes. Labour are authoritarian control freaks.\" Meanwhile, the Countryside Alliance, an organisation that promotes rural sport, said: \"Why does the government want a war with the countryside? \"Trail hunting supports hundreds of jobs and is central to many rural communities. After its attack on family farms, the government should be focusing on addressing issues that actually help rural communities thrive, rather than pursuing divisive policies that hinder them.\""
    },
    {
        "title": "Sir Ed Davey writes to human rights watchdog over local election delays",
        "description": "Liberal Democrat leader Sir Ed Davey has written to the UK's human rights watchdog asking for an investigation into the government's plan to postpone some local elections next year.",
        "url": "https://news.sky.com/story/sir-ed-davey-writes-to-human-rights-watchdog-over-local-election-delays-13486715",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-polling-election_7113951.jpg?20251218130027",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-22 13:53:00",
        "Headline": "The Liberal Democrat leader said in his letter to the Equalities and Human Rights Commission that nearly ten million people could see their democratic rights \"ripped away\".",
        "Content": "Liberal Democrat leader Sir Ed Davey has written to the UK's human rights watchdog asking for an investigation into the government's plan to postpone some local elections next year. In a letter to the Equalities and Human Rights Commission, Sir Ed said that nearly ten million people could see their democratic rights \"ripped away\". It comes after the government indicated it would postpone elections if local authorities undergoing reorganisation requested it. In his letter, Sir Ed said: \"Article 3 of the first protocol of the Human Rights Act spells out in black and white the right to free elections. \"Removing elections altogether, entirely unnecessarily, is in clear breach of this principle. Can you therefore confirm your plans to investigate the government's cavalier approach to our elections?\" In a big shake-up of local government, Labour ministers want to scrap the two-tier system of district and county councils, replacing them with new unitary authorities that will deliver all local services from 2028. Many of these are expected to be headed by local mayors, with the plan aimed at widening devolution by giving local leaders more sway over decisions in their areas. On Thursday, the government revealed it had asked all 63 councils impacted by the shake-up and that are due to hold elections in May to say whether they require a delay, with a deadline of 15 January to respond. In a Written Ministerial Statement (WMS), local government minister Alison McGovern said some authorities were concerned about their capacity to run the polls alongside the planned overhaul, as well as the cost to the taxpayer of holding elections for councils that will soon be abolished. \"Should a council say they have no reason for postponement, then we will listen to them,\" she said. \"But if a council voices genuine concerns about its capacity, then we will take these concerns seriously,\" she added. \"To that end, the secretary of state is only minded to make an order to postpone elections for one year for those councils that raise capacity concerns.\" The decision has been criticised by the electoral commission, which has said that capacity constraints aren't a \"legitimate reason for delaying long planned elections\", and the plan risks \"damaging public confidence\". There has been a furious reaction from opposition parties too. Reform UK has threatened legal action against ministers, accusing Labour and the Tories of \"colluding\" to postpone elections in order to lock other parties out of power - a sentiment previously echoed by Sir Ed. But shadow local government secretary Sir James Cleverly told Sky News last week that the Conservative Party \"wants these elections to go ahead\". Following the government's announcement last week, Sky News contacted the 63 councils that have been sent the letter about potentially delaying their elections. At the time, five replied saying they would request a postponement: • Blackburn with Darwen Council (Labour); • Chorley Borough Council (Labour); • East Sussex County Council (Conservative minority); • Hastings Borough Council (Green minority); • West Sussex County Council (Conservative). Elections originally scheduled for May 2025 in nine areas - including Essex, Suffolk, East Sussex and West Sussex - have already been postponed once. Responding to the electoral commission's statement, a spokesperson for the Ministry of Housing, Communities, and Local Government said it was taking a \"locally-led approach\" and emphasised that \"councils are in the best position to judge the impact of postponements on their area\". They added: \"These are exceptional circumstances where councils have told us they're struggling to prepare for resource-intensive elections to councils that will shortly be abolished, while also reorganising into more efficient authorities that can better serve local residents. \"There is a clear precedent for postponing local elections where local government reorganisation is in progress, as happened in 2019 and 2022.\""
    },
    {
        "title": "Call Of Duty co-creator Vince Zampella dies aged 55",
        "description": "Vince Zambella, one of the creators behind best-selling video game series Call Of Duty, has died.",
        "url": "https://news.sky.com/story/call-of-duty-co-creator-vince-zampella-dies-aged-55-13486915",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-vince-zampella-call-of-duty_7118038.jpg?20251222233409",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-22 23:47:00",
        "Headline": "Zampella, who reportedly died in a car crash in California, was hailed as a \"visionary creator\" by video game maker Electronic Arts.",
        "Content": "Vince Zambella, one of the creators behind best-selling video game series Call Of Duty, has died. Video game maker Electronic Arts (EA) said the 55-year-old died on Sunday but did not disclose a cause of death. It was reported he died in a car crash in Southern California. The single-vehicle collision involving a Ferrari happened in the San Gabriel Mountains at about 12.45pm local time, according to NBC Los Angeles. Zampella founded Respawn Entertainment, a subsidiary of EA, in 2010 and he was the former chief executive of video game developer Infinity Ward, the studio behind the Call of Duty franchise.An EA spokesperson said Zampella's influence on the video game industry was \"profound and far-reaching\". \"A friend, colleague, leader and visionary creator, his work helped shape modern interactive entertainment and inspired millions of players and developers around the world,\" the spokesperson added. \"His legacy will continue to shape how games are made and how players connect for generations to come.\" Read more from Sky News:Is the AI bubble about to burst?'Our daughter vanished 20 years ago - but AI may finally solve case' One of Zampella's crowning achievements was the creation of the Call of Duty franchise, which has sold more than half a billion games worldwide. The first-person shooter game debuted in 2003 as a Second World War simulation, while subsequent versions have delved into modern warfare. There is a live-action movie based on the game in production with Paramount Pictures. Zampella was also at the helm of the creation of action adventure video games Star Wars Jedi: Fallen Order and Star Wars Jedi: Survivor."
    },
    {
        "title": "New Uber-backed driverless taxis to hit UK streets in 2026",
        "description": "Uber and Lyft &#8204;are both planning to launch driverless taxi trials in London in 2026, in separate partnerships with Chinese tech giant Baidu.",
        "url": "https://news.sky.com/story/new-uber-backed-driverless-taxis-to-hit-uk-streets-in-2026-13486706",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-uber-taxi_7085887.jpg?20251119121439",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-22 13:33:00",
        "Headline": "The plan sets the scene for simultaneous trials by US and Chinese autonomous taxi giants in London, as the capital becomes the European centre of a self-driving revolution.",
        "Content": "Uber and Lyft ‌are both planning to launch driverless taxi trials in London in 2026, in separate partnerships with Chinese tech giant Baidu. The move reinforces the UK's role as Europe's leading testbed for commercialising robotaxis, fuelled by the Automated Vehicles Act 2024 which provides a legal framework for driverless car ‌liability. It also sets the scene for the competing trials between US and Chinese autonomous giants for the first time in a European capital, following Alphabet-owned Waymo's recent start of supervised tests in ‍London. David Risher, Lyft's boss, revealed the company's trials would use Apollo Go RT6 vehicles that are \"purpose-built for rideshare\". \"We expect to start testing our initial fleet with dozens of vehicles next year - pending regulatory approval,\" Risher said. The company \"plans to scale to hundreds from there,\" he added. Baidu is racing against rivals like Waymo, owned by Google parent Alphabet, whose cars have already been seen on London's streets. \n                  Driverless taxis to operate on London's roads from next year\n                 \n                  'Dizzy' driverless taxi passenger nearly misses flight after cab gets stuck driving in circles\n                 \n                  Pilotless passenger drones and driverless taxis as China pushes boundaries of how we travel\n                 Fully autonomous UK trials are contingent on the government finalising driverless car regulations and giving companies the go-ahead to operate. London-based start-up Wayve is also preparing ​to launch driverless trials in 2026, using investment of about $1bn (£750m) led by SoftBank Group and Uber, as it tests its \"mapless\" AI technology on ‍London's complex streets. London's new driverless car boom mirrors a broader global surge as Baidu and WeRide expand operations in the US, Middle East and Switzerland. For Lyft, the UK trial serves as a cornerstone of its international expansion following its $200m (£148m) acquisition of the European taxi app FreeNow ‍this year. Driverless cars on the streets of London London, often associated with the famous black cab, should see simultaneous tests of self-driving cars next year. The UK's 2024 automated vehicles act shifted legal responsibility for ‌incidents from the person in the car to the \"authorised self-driving entity.\" Self-driving taxis have become a regular feature on San Francisco's roads and recently launched in Tokyo. Steve McNamara, general secretary of the Licensed Taxi Driver's Association told Sky News in October that he wasn't currently concerned about competition with driverless taxis. \"It's a novelty, it is a gimmick. It is the solution that we don't need. Who needs a driverless cab?\" he said. He did not think Londoners would trust the taxis, let alone \"put their kids in one to go to school\". Read more from Sky News:Trump's new Greenland envoy intends to make territory 'a part of the US'Major incident declared as sinkhole drains canal and swallows narrowboats In response, Waymo told Sky News it \"provides hundreds of thousands of rides every week in the US and shared in May of this year that we've provided over 10,000,000 fully autonomous rides to the public\". But releasing self-driving taxis hasn't come without bumps in the road. In December 2024, a \"dizzy\" robotaxi passenger nearly missed his flight after his cab started driving around in circles. A 2024 study also found that while self-driving cars are safer than those driven by humans most of the time, this wasn't the case when it is dawn, dusk, or the vehicle is turning.  During low-light conditions at dawn or dusk, they were more than five times more likely to have an accident than a car driven by a human."
    },
    {
        "title": "Singer Chris Rea - famous for Driving Home For Christmas - dies aged 74",
        "description": "Chris Rea, known for hits including Driving Home For Christmas and The Road To Hell, has died after a short illness, according to a family spokesperson.",
        "url": "https://news.sky.com/story/singer-chris-rea-famous-for-driving-home-for-christmas-has-died-13486734",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-chris-rea_7117669.jpg?20251222160234",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-22 14:55:00",
        "Headline": "The singer passed away peacefully in hospital earlier today surrounded by his family following a short illness.",
        "Content": "Chris Rea, known for hits including Driving Home For Christmas and The Road To Hell, has died after a short illness, according to a family spokesperson. A statement on behalf of his wife and two children stated: \"It is with immense sadness that we announce the death of our beloved Chris. \"He passed away peacefully in hospital earlier today following a short illness, surrounded by his family.\" The Middlesbrough-born musician was diagnosed with pancreatic cancer and had his pancreas removed in 2001, and in 2016 he suffered a stroke. Follow our blog for the latest reactions to Chris Rea's death Rea found fame in the late seventies and eighties with hits such as Fool (If You Think It's Over), Let's Dance and The Road To Hell. Known for his gravelly voice and latterly for his slide guitar playing, he was nominated for a slew of top awards, including Brit Awards, at the height of his success and sold millions of records. \n                  2025 on track to be UK's warmest year on record, says Met Office\n                 \n                  Man charged with 56 sexual offences against ex-wife - as five other men also charged\n                 \n                  Major incident declared as sinkhole drains canal and swallows narrowboats in Shropshire\n                 Rea's debut album, titled Whatever Happened To Benny Santini?, a reference to the stage name his record label wanted him to adopt, was released in 1978. His track Fool (If You Think It's Over), from the album, went on to be nominated for a Grammy. He did not find such success again for a few years, but by the time his eighth album On The Beach was released, he was a star in the UK and around Europe, with sporadic hits in the US. When Road To Hell was released in 1989, he became one of the biggest solo stars in the UK. Two of his studio albums - The Road To Hell (1989) and Auberge (1991) - went to number one in the country. Read more from Sky News:Trump's new Greenland envoy intends to make territory \"a part of the US\"Puppy farming and trail hunting to be banned His famous song Driving Home For Christmas, first released in 1986, features in this year's M&S Food Christmas advert - which sees comedian Dawn French sing along to the single in her car. Speaking about the song during the 2020 Mortimer And Whitehouse Gone Fishing Christmas special, he told comedian Bob Mortimer: \"I was on the dole when I wrote that. \"My manager had just left me. I'd just been banned from driving, right. My now wife, Joan, she had to drive down to London, picked me up in the Mini, and take me home, and that's when I wrote it.\" The singer returned to his blues roots after a string of health problems. \"I wasn't frightened of dying,\" he once said in an interview. \"It did look like the end, but what got me through was the thought of leaving a record that my two teenage daughters could say, 'That's what Papa did - not the pop stuff, but the blues music. That's what he was about'.\" "
    },
    {
        "title": "Banksy gives Britain at least one new mural for Christmas",
        "description": "Banksy, the world's most famous street artist, appears to have confirmed he is responsible for a new mural that appeared in London on Monday. ",
        "url": "https://news.sky.com/story/banksy-gives-britain-at-least-one-new-mural-for-christmas-13486832",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-banksy-art_7117837.jpg?20251222192154",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-22 19:15:00",
        "Headline": "The piece, depicting two children lying down and pointing at the sky, appeared in Bayswater, west London, and was shared by the artist on Instagram.",
        "Content": "Banksy, the world's most famous street artist, appears to have confirmed he is responsible for a new mural that appeared in London on Monday.  The piece, depicting two children lying down and pointing up at the sky, appeared on the side of a building in Bayswater, in the west of the capital. Now the artist has shared it on his Instagram page, hours after its appearance, seemingly taking credit for the mural amid growing speculation that it was a new Banksy mural. An identical image appeared at the foot of the Centre Point tower in Tottenham Court Road, central London. Reports have suggested this is also the work of Banksy, but his representatives have not confirmed he is responsible. The artist's work is often political in nature, and critical of government policy on migration and war. The new mural doesn't appear to have an overt message, though some have suggested it addresses the topic of child homelessness. A Banksy unveiled in September depicted a judge armed with a gavel looming over an unarmed protester with a blood-splattered placard. \n                  Banksy art theft lands burglar with 13-month prison sentence\n                 \n                  New Banksy artwork being removed from Royal Courts of Justice wall in London\n                 \n                  New Banksy artwork to be removed from Royal Courts of Justice after report of criminal damage\n                 Daubed on an external wall of the Queen's Building, in the Royal Courts of Justice complex, it came at a time when hundreds of protesters were being arrested for backing Palestine Action. Read more:Network forging Banksy and Picasso artworks uncovered'Art for sixth formers': Is the public falling out of love with Banksy? Palestine Action was banned by the government as a terrorist group in July, and the mural was swiftly covered up and guarded by security staff, before work began to remove it. Banksy, whose works now sell for millions of dollars at auction, began his career spray painting buildings in Bristol."
    },
    {
        "title": "Call Of Duty co-creator Vince Zampella dies aged 55",
        "description": "Vince Zambella, one of the creators behind best-selling video game series Call Of Duty, has died.",
        "url": "https://news.sky.com/story/call-of-duty-co-creator-vince-zampella-dies-aged-55-13486915",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-vince-zampella-call-of-duty_7118038.jpg?20251222233409",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-22 23:47:00",
        "Headline": "Zampella, who reportedly died in a car crash in California, was hailed as a \"visionary creator\" by video game maker Electronic Arts.",
        "Content": "Vince Zambella, one of the creators behind best-selling video game series Call Of Duty, has died. Video game maker Electronic Arts (EA) said the 55-year-old died on Sunday but did not disclose a cause of death. It was reported he died in a car crash in Southern California. The single-vehicle collision involving a Ferrari happened in the San Gabriel Mountains at about 12.45pm local time, according to NBC Los Angeles. Zampella founded Respawn Entertainment, a subsidiary of EA, in 2010 and he was the former chief executive of video game developer Infinity Ward, the studio behind the Call of Duty franchise.An EA spokesperson said Zampella's influence on the video game industry was \"profound and far-reaching\". \"A friend, colleague, leader and visionary creator, his work helped shape modern interactive entertainment and inspired millions of players and developers around the world,\" the spokesperson added. \"His legacy will continue to shape how games are made and how players connect for generations to come.\" Read more from Sky News:Is the AI bubble about to burst?'Our daughter vanished 20 years ago - but AI may finally solve case' One of Zampella's crowning achievements was the creation of the Call of Duty franchise, which has sold more than half a billion games worldwide. The first-person shooter game debuted in 2003 as a Second World War simulation, while subsequent versions have delved into modern warfare. There is a live-action movie based on the game in production with Paramount Pictures. Zampella was also at the helm of the creation of action adventure video games Star Wars Jedi: Fallen Order and Star Wars Jedi: Survivor."
    },
    {
        "title": "Barry Manilow needs surgery for lung cancer, singer reveals",
        "description": "Barry Manilow is being treated for lung cancer and has been forced to reschedule live shows, the 82 year-old has revealed.",
        "url": "https://news.sky.com/story/barry-manilow-needs-surgery-for-lung-cancer-singer-reveals-13486763",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-barry-manilow-music_7117667.jpg?20251222155901",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-22 15:50:00",
        "Headline": "The 82 year-old Copacabana star is rescheduling US shows after a cancerous spot was discovered on his left lung.",
        "Content": "Barry Manilow is being treated for lung cancer and has been forced to reschedule live shows, the 82 year-old has revealed. The Copacabana popstar announced on Instagram that a cancerous spot had been discovered on his left lung. \"As many of you know I recently went through six weeks of bronchitis followed by a relapse of another five weeks,\" he wrote. \"Even though I was over the bronchitis and back on stage at the Westgate Las Vegas, my wonderful doctor ordered an MRI just to make sure that everything was OK. \"The MRI discovered a cancerous spot on my left lung that needs to be removed.\" Manilow, 82, added that the cancer had been found early thanks to \"pure luck\" and a \"great doctor\". And while he would not require chemotherapy or radiation treatment, he wrote, he would have to undergo surgery, forcing him to reschedule his January shows. \n                  Sir Cliff Richard says he has been treated for prostate cancer\n                 \n                  King reveals 'good news' in his battle with cancer and urges people to get checked\n                 \n                  Prostate cancer treatment with potential for fewer side effects to be trialled in UK\n                 He had been due to embark on a string of arena concerts in US cities including Orlando, Tampa, Charleston, Greensboro and Columbus. He wrote: \"I'm going into surgery to have the spot removed. The doctors do not believe it has spread and I'm taking tests to confirm their diagnosis. \"The only follow-up is a month to recover and that means we have to reschedule the January arena concerts. \"I'm very sorry that you have to change your plans. \"Just like you, we were all looking forward to the January shows and hate having to move everything around.\" Read more:King 'deeply touched' by reaction to cancer 'good news'NHS to offer same-day prostate cancer diagnosis The Grammy Award-winning singer has released a string of hits over the course of more than 50 years recording music. They include Could It Be Magic, Looks Like We Made It, Mandy, and Can't Smile Without You. His announcement comes after Cliff Richard revealed he had been treated for prostate cancer."
    },
    {
        "title": "David Walliams removed from children's book festival line-up",
        "description": "David Walliams has been removed from the line-up for a children's book event.",
        "url": "https://news.sky.com/story/david-walliams-removed-from-childrens-book-festival-line-up-13486765",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/walliams-comedian-author_7115525.jpg?20251220003143",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-22 15:56:00",
        "Headline": "Decision comes after the author was dropped by his publisher over allegations of inappropriate behaviour. He \"strongly denies\" the claims.",
        "Content": "David Walliams has been removed from the line-up for a children's book event. Book retailer Waterstones has confirmed the author will no longer appear at its Children's Book Festival. It comes after the TV star was dropped by his publisher HarperCollins UK following allegations of inappropriate behaviour towards women. Walliams strongly denies allegations of inappropriate behaviour. A statement from Waterstones said: \"HarperCollins have confirmed that David Walliams will no longer be appearing at our festival in Dundee.\" The festival will span across three locations, also including Lincoln and Taunton. The Dundee event will take place on 6 and 7 February. Walliams has been removed from the listed speakers list on the festival website. \n                  David Walliams dropped by publisher HarperCollins UK after allegations of inappropriate behaviour\n                 \n                  David Walliams and Fremantle agree settlement over leaked Britain's Got Talent conversations\n                 \n                  Little Britain sketch 'explicitly racist and outdated', Ofcom research says\n                 The 54-year-old comedian, who shot to fame with the BBC sketch show Little Britain, is one of the country's best-selling children's writers. He has written more than 40 books, which have sold more than 60 million copies worldwide and been translated into 55 languages, according to his website. A spokesperson for HarperCollins UK said it had decided not to release any new titles by Walliams \"after careful consideration, and under the leadership of its new CEO\". \"HarperCollins takes employee well-being extremely seriously and has processes in place for reporting and investigating concerns,\" they added. \"To respect the privacy of individuals, we do not comment on internal matters.\" In a statement later on Friday, a spokesperson for the comedian and children's author said: \"David has never been informed of any allegations raised against him by HarperCollins. \"He was not party to any investigation or given any opportunity to answer questions. David strongly denies that he has behaved inappropriately and is taking legal advice.\" The news followed a report from The Daily Telegraph that Walliams was dropped after an investigation into allegations of inappropriate behaviour towards young women."
    },
    {
        "title": "Stars and fans including Liam Gallagher, Paul Weller and David Beckham gather for Gary 'Mani' Mounfield's funeral",
        "description": "Stars including Liam Gallagher, David Beckham and Paul Weller have gathered to pay tribute to The Stone Roses star Gary \"Mani\" Mounfield.",
        "url": "https://news.sky.com/story/stars-and-fans-including-liam-gallagher-paul-weller-and-david-beckham-gather-for-gary-mani-mounfields-funeral-13486689",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-mani-funeral-stone-roses_7117394.jpg?20251222110424",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-12-22 12:53:00",
        "Headline": "Some of the biggest names of British 90s music were at the ceremony, including Liam Gallagher, Paul Weller, Bobbie Gillespie and Bez, from the Happy Mondays.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Stars including Liam Gallagher, David Beckham and Paul Weller have gathered to pay tribute to The Stone Roses star Gary \"Mani\" Mounfield. The Stone Roses and Primal Scream bassist died last month at the age of 63. His death came two years after that of his wife, Imelda Mounfield, who was diagnosed with stage 4 bowel cancer in November 2020. The couple welcomed twin boys in 2012. He had been due to travel the UK later this year for an in-conversation tour sharing memories of his rock experiences. Liveblog: Famous faces say final goodbye to Stone Roses bass player The funeral, which was held at Manchester Cathedral, drew hundreds of fans, including a guard of scooter riders with black bands and a photo of Mani on their bikes. Arriving at the service, The Stone Roses frontman Ian Brown said Mani was \"a brother to me\", calling him a \"beautiful human being\". \n                  Manchester Arena bombing survivors to get almost £20m in payouts\n                 \n                  Man charged over allegedly assisting Manchester synagogue attacker with reconnaissance of defence facility\n                 \n                  Police given more time to question man arrested over Heaton Park synagogue attack\n                 Some of the biggest names of British 1990s music were at the ceremony, including Oasis star Liam Gallagher, singer-songwriter Paul Weller, Primal Scream frontman Bobbie Gillespie and Bez, from the Happy Mondays. Tim Burgess, lead singer of The Charlatans, Elbow frontman Guy Garvey, Ian McCulloch of Echo & The Bunnymen, Mike Joyce, drummer from The Smiths, Inspiral Carpets keyboardist Clint Boon, and former Joy Division and New Order bassist Peter Hook also came to pay tribute. Former Manchester United players David Beckham and Gary Neville were also among hundreds of mourners arriving for the service. Manchester mayor Andy Burnham and Coronation Street star Sally Lindsay were also in attendance. Hundreds more fans gathered outside the cathedral and applauded as the cortege arrived, and as I Wanna Be Adored - one of The Stone Roses' biggest hits - blared from the speakers. The coffin, which was decorated with artwork from the cover of The Stone Roses - the band's self-titled debut album - had travelled around eight miles from Heaton Moor in Stockport to the cathedral. Gallagher, along with The Stone Roses drummer Alan Wren - also known as Reni - and bandmate John Squire carried the coffin from the ceremony after the service. Mani was part of the Stone Roses' classic line-up alongside Brown, Squire and Wren. Pausing briefly as he went into church, Brown said he was there to celebrate \"what a beautiful human being that he was\". Asked what his bandmate meant to him, the singer said: \"Everything. He's a brother to me.\" Forming in 1983, Mani was part of The Stone Roses until they split in 1996, playing on both the eponymous debut album, released in 1989, and their 1995 follow-up, Second Coming. The \"Madchester\" band was known for blending indie with acid house, psychedelia and pop. Mani went on to play with Scottish band Primal Scream for 15 years, leaving in 2011 to rejoin the reuniting Roses."
    }
]