[
    {
        "title": "Care whistleblower 'who saw elderly resident being punched' could face removal from Britain",
        "description": "A care worker who reported the alleged abuse of an elderly care home resident, which triggered&#160;a criminal investigation, is facing destitution and potential removal from Britain after speaking up.",
        "url": "https://news.sky.com/story/care-whistleblower-who-saw-elderly-resident-being-punched-could-face-removal-from-britain-13395523",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-migrant-care-home_6962901.png?20250711180005",
        "type": "Home",
        "Author": "Becky Johnson, social affairs correspondent, and Emily Jennings, social affairs producer",
        "Date Published": "2025-07-11 23:01:00",
        "Headline": "A migrant care worker who reported serious concerns to her bosses says she was called to a meeting with a manager and told to \"change your statement, otherwise we will dismiss you\". She refused. The following month, she was sacked.",
        "Content": "By Becky Johnson, social affairs correspondent, and Emily Jennings, social affairs producer    A care worker who reported the alleged abuse of an elderly care home resident, which triggered a criminal investigation, is facing destitution and potential removal from Britain after speaking up. \"Meera\", whose name we have changed to protect her identity, said she witnessed an elderly male resident being punched several times in the back by a carer at the home where she worked. Sky News is unable to name the care home for legal reasons because of the ongoing police investigation. \"I was [a] whistleblower there,\" said Meera, who came to the UK from India last year to work at the home. \"Instead of addressing things, they fired me... I told them everything and they made me feel like I am criminal. I am not criminal, I am saving lives,\" she added. Like thousands of foreign care workers, Meera's employer sponsored her visa. Unless she can find another sponsor, she now faces the prospect of removal from the country. \"I am in trouble right now and no one is trying to help me,\" she said. \n                  Migrants deal a win for Starmer - and could help with fight against Reform\n                 \n                  Nigel Farage hits back at Emmanuel Macron after French president sparks fresh Brexit row\n                 \n                  King Charles asks RNLI crew whether they 'get a lot?' while discussing small boat crossings\n                 Meera said she reported the alleged abuse to her bosses, but was called to a meeting with a manager and told to \"change your statement, otherwise we will dismiss you\". She refused. The following month, she was sacked. The care home claimed she failed to perform to the required standard in the job. She went to the police to report the alleged abuse and since then, a number of people from the care home have been arrested. They remain under investigation. 'Migrants recruited because many are too afraid to speak out' The home has capacity for over 60 residents. It is unclear if the care home residents or their relatives know about the police investigation or claim of physical abuse. Since the arrests, the regulator, the Care Quality Commission (CQC), carried out an investigation at the home triggered by the concerns - but the home retained its 'good' rating. Meera has had no reassurance from the authorities that she will be allowed to remain in Britain. In order to stay, she'll need to find another care home to sponsor her which she believes will be impossible without references from her previous employer. She warned families: \"I just want to know people in care homes like these... your person, your father, your parents, is not safe.\" She claimed some care homes have preferred to recruit migrants because many are too afraid to speak out. \"You hire local staff, they know the legal rights,\" she said. \"They can complain, they can work anywhere... they can raise [their] voice,\" she said. Sky News has reported widespread exploitation of care visas and migrant care workers. Read more:More than 100 migrants face being in UK illegallyImmigration crackdown will fuel 'exodus' of nursesNew English language and UK citizenship requirements for migrants Currently migrants make up around a third of the adult social care workforce, with the majority here on visas that are sponsored by their employers. As part of measures announced in April in the government's immigration white paper, the care visa route will be closed, meaning care homes will no longer be able to recruit abroad. 'Whole system is based on power imbalance' But the chief executive of the Work Rights Centre, a charity that helps migrants with employment issues, is warning that little will change for the tens of thousands of foreign care workers already here. \"The whole system is based on power imbalance and the government announcement doesn't change that,\" Dr Dora-Olivia Vicol told Sky News. She linked the conditions for workers to poor care for residents. \"I think the power that employers have over migrant workers' visas really makes a terrible contribution to the quality of care,\" she said. Imran agrees. He came to the UK from Bangladesh, sponsored by a care company unrelated to the one Meera worked for. He says he frequently had to work 14-hour shifts with no break because there weren't enough staff. He too believes vulnerable people are being put at risk by the working conditions of their carers. Migrant workers 'threatened' over visas \"For four clients, there is [a] minimum requirement for two or three staff. I was doing [it] alone,\" he said, in broken English. \"When I try to speak, they just directly threaten me about my visa,\" he said. \"I knew two or three of my colleagues, they are facing the same issue like me. But they're still afraid to speak up because of the visa.\" A government spokesperson called what happened to Imran and Meera \"shocking\". \"No one should go to work in fear of their employer, and all employees have a right to speak up if they witness poor practice and care.\" James Bullion, from the CQC, told Sky News it acts on intelligence passed to it to ensure people stay safe in care settings. Additional research by Leah Adin"
    },
    {
        "title": "Fuel to engines of Air India plane that crashed cut off moments after take-off, report finds",
        "description": "Fuel to the engines of the Air India plane that crashed last month appears to have cut off shortly after take-off, a preliminary report has found.",
        "url": "https://news.sky.com/story/fuel-to-engines-of-air-india-plane-cut-off-moments-before-crash-preliminary-report-finds-13395620",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ahmedabad-plane-crash_6944966.jpg?20250618101311",
        "type": "Home",
        "Author": "Samuel Osborne",
        "Date Published": "2025-07-11 19:57:00",
        "Headline": "There was also confusion in the cockpit. In the voice recording, one of the pilots is heard asking the other why he \"cut off\". The other pilot responds that he did not do so.",
        "Content": "\n          News reporter\n              @samuelosborne93\n Fuel to the engines of the Air India plane that crashed last month appears to have cut off shortly after take-off, a preliminary report has found. According to the report by India's Aircraft Accident Investigation Bureau (AAIB), switches in the Boeing 787 Dreamliner's cockpit that controlled fuel moved to a \"CUTOFF\" position. It said: \"Engine 1 and Engine 2 fuel cutoff switches transitioned from RUN to CUTOFF position one after another with a time gap of one second. \"The Engine N1 and N2 began to decrease from their take-off values as the fuel supply to the engines was cut off.\" There was then confusion in the cockpit. In the voice recording, one of the pilots is heard asking the other why he \"cut off\". The other pilot responds that he did not do so. The 15-page report did not identify which comments were made by the flight's captain and which were made by the first officer. One of the pilots made a \"mayday, mayday, mayday\" call just before the crash. Both pilots were experienced, with around 19,000 flying hours between them, including more than 9,000 on the 787. Flipping to cutoff almost immediately cuts the engines, and is most often used to turn the engines off once a plane has arrived at its airport gate and in certain emergency situations, such as an engine fire - though both switches together are rarely used simultaneously. The report does not indicate there was any emergency requiring an engine cutoff. It also does not give a conclusion as to how the switches moved. However, aviation expert David Learmount told Sky News \"it sounds deliberate\", but also noted \"there are cases of pilots carrying out an incorrect action instead of what they should be doing\". Mr Learmount said the only action the pilots needed to conduct at the time was retracting the plane's undercarriage, but this was not done. He added: \"Was that it? These switches are nowhere near the undercarriage lever and look totally different. The fuel switches cannot be turned on or off by mistake. They have to be pulled out before selecting up (run) or down (cut off).\" Similarly, Tim Atkinson, a pilot and aviation consultant, told Sky News' Gillian Joseph \"there are very few situations or circumstances which would explain this\". He explained: \"One would be an utterly extraordinary human error, an unintentional act, and the other - I'm very sorry to say - would be an intentional act. And that's not a suggestion or allegation, it's simply an analysis of the small amount of information that we have at hand at this moment.\" One of the engines was able to be restarted, but could not reverse the plane's deceleration, the report found. India's AAIB said in its report: \"At this stage of investigation, there are no recommended actions to Boeing 787-8 and/or GE GEnx-1B engine operators and manufacturers.\" No significant bird activity was observed in the vicinity of the plane's flight path, the report said. The aircraft started to lose altitude before crossing the airport perimeter wall, it added. The plane plummeted into a busy area, killing 241 passengers and 19 others on the ground while incinerating everything around it. The plane's two black boxes, which combined cockpit voice recorders and flight data recorders, were recovered in the days after the crash. They provide vital data such as altitude, airspeed and final pilot conversations, which can help narrow down the possible causes behind a crash. The AAIB's report is based on the initial findings of the probe, marking 30 days since the crash. It said the investigation is continuing. A final report is expected within a year."
    },
    {
        "title": "Donald Trump may be denied privilege of addressing parliament on UK state visit",
        "description": "Donald Trump may be denied the honour of addressing parliament on his state visit to the UK later this year, with no formal request yet submitted for him to be given that privilege.",
        "url": "https://news.sky.com/story/donald-trump-may-be-denied-privilege-of-addressing-parliament-on-uk-state-visit-13395516",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-donald_6962871.jpg?20250711173611",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-07-11 18:00:00",
        "Headline": "The fact that that parliament isn't sitting for much of September could help resolve a potentially awkward issue.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  Donald Trump may be denied the honour of addressing parliament on his state visit to the UK later this year, with no formal request yet submitted for him to be given that privilege. It comes after President Macron's successful state visit this week, in which he was invited to speak in front of both Houses of Parliament. Sky News has been told the Speaker of the House of Commons, Sir Lindsay Hoyle, hasn't so far received a request to invite the US president to speak in parliament when he is expected to visit in September. It was confirmed to MPs who have raised concerns about the US president being allowed to address both houses. Kate Osborne, Labour MP for Jarrow and Gateshead East, wrote to the speaker in April asking him to stop Mr Trump from addressing parliament, and tabled an early-day motion outlining her concerns. \"I was happy to see Macron here but feel very differently about Trump,\" she said. \"Trump has made some very uncomfortable and worrying comments around the UK government, democracy, the Middle East, particularly around equalities and, of course, Ukraine. \"So, I think there are many reasons why, when we're looking at a state visit, we should be looking at why they're being afforded that privilege. Because, of course, it is a privilege for somebody to come and address both of the houses.\" But the timing of the visit may mean that any diplomatic sensitivities, or perceptions of a snub, could be avoided. Lord Ricketts, a former UK ambassador to France, pointed out that parliament isn't sitting for much of September, and that could help resolve the issue. In 2017, he wrote a public letter questioning the decision to give Donald Trump his first state visit, saying it put Queen Elizabeth II in a \"very difficult position\". Parliament rises from 16 September until 13 October due to party conferences. The dates for the state visit haven't yet been confirmed by Buckingham Palace or the government. However, they have not denied that it will take place in September, after Mr Trump appeared to confirm they were planning to hold the state visit that month. The palace confirmed this week that the formal planning for his arrival had begun. With the King likely to still be in Scotland in early September for events such as the Braemar Gathering, and the anniversary of his accession and the death of Queen Elizabeth on the 8th September, it may be expected that the visit would take place sometime from mid to the end of September, also taking into consideration the dates of the Labour Party conference starting on the 28th September and possibly the Lib Dem's conference from the 20th-23rd. When asked about parliamentary recess potentially solving the issue, Ms Osborne said: \"It may be a way of dealing with it in a very diplomatic way... I don't know how much control we have over Trump's diary. \"But if we can manoeuvre it in a way that means that the House isn't sitting, then that seems like a good solution, maybe not perfect, because I'd actually like him to know that he's not welcome.\" A message from the speaker's office, seen by Sky News, says: \"Formal addresses to both Houses of Parliament are not automatically included in the itinerary of such a state visit. \"Whether a foreign head of state addresses parliament, during a state visit or otherwise, is part of the planning decisions.\" It's understood that if the government agrees to a joint address to parliament, the Lord Chamberlain's office writes to the two speakers, on behalf of the King, to ask them to host this. It will be Mr Trump's second state visit. During his first, in 2019, he didn't address parliament, despite the fact that his predecessor, Barack Obama, was asked to do so. It was unclear if this was due to the fact John Bercow, the speaker at the time, made it clear he wasn't welcome to do so. However, it didn't appear to dampen Mr Trump's excitement about his time with the Royal Family. Read more from Sky News:Two women killed as BMW crashes into care home Officers who confronted Southport killer win bravery award Speaking earlier this year, he described his state visit as \"a fest\" adding \"it's an honour… I'm a friend of Charles, I have great respect for King Charles and the family, William; we have really just a great respect for the family. And I think they're setting a date for September.\" It is expected that, like Mr Macron, the pageantry for his trip this time will revolve around Windsor, with refurbishment taking place at Buckingham Palace."
    },
    {
        "title": "Fear and mistrust in Chinese town where more than 200 children poisoned by lead in their food",
        "description": "Taped doors and quiet rooms tell a story about what happened at Heshi Peixin kindergarten. ",
        "url": "https://news.sky.com/story/fear-and-mistrust-in-chinese-town-where-more-than-200-children-poisoned-by-lead-in-their-food-13395630",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-china-lead-kindergarten_6963085.jpg?20250711221900",
        "type": "Home",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-07-11 20:41:00",
        "Headline": "Most families are seeking treatment in major cities after tests at a local hospital returned tests at much lower levels than at other facilities.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n  Taped doors and quiet rooms tell a story about what happened at Heshi Peixin kindergarten.  A huge scandal in a tiny town, a barely believable failing, in a place where children should have been safe. As soon as we arrive in the northwestern Chinese town of Maiji, it is clear that almost everyone knows someone who has been impacted. After multiple children were found to have high levels of lead in their blood, police say staff at the private kindergarten had been adding paint powder to food in an apparent bid to make it look more appealing. A total of 233 of the 251 children had unhealthy levels and 201 needed to be hospitalised, say local authorities. Two food samples were seized and both had lead levels 2000 times the legal safe limit. Eight people have been arrested, including the principal and the kindergarten's financial backer. On one street in this town, a series of shops sell clothes and goods for babies and toddlers. The women who work there all knew the principal and many of the families affected. One even used to work there. They tell us how distressing it's been for the community. One lady whispers with tears in her eyes about how a neighbour's child was found to have lead in her blood at 38 times the normal level. Lead poisoning at this level could cause long term injuries for the brain and the central nervous system. What surprises us is how the kindergarten and its staff are by far the sole focus of their anger. In fact more than one person speaks fondly of the principal, citing her extensive charity work and dedication to children. There might have been huge failings at Heshi Peixin, but here they clearly feel there are failings in the system too. Indeed, most affected families have chosen to leave here to seek treatment in major cities, mainly in Xi'an, the closest major city, which is a four-hour drive away. We are told multiple times that the local hospital returned tests for lead showing much lower levels than at the bigger hospitals. 'This is a cover up' On the street corners, it's all they are discussing, tapping into veins of distrust. \"I don't know much, but I think this is a cover up,\" says one woman who we meet at the side of the road. \"I just think local government is too dark, they suppress the news.\" Another young mother talks about how she lived just around the corner from the kindergarten. \"Who will be willing to have children? Who dares to send the children to kindergarten?\" she asks. \"Now if people send children to primary school, the first thing they ask is are you safe? Is the school safe? Can it guarantee the personal safety of our children in the future, right?\" There is no clear evidence of a cover-up, but it's telling that it's what people expect. There is clear anxiety about the fact we are here. The police intercept us and hold us up for over an hour. And perhaps that is no surprise because in China a history of food safety scandals is a sore point. Read more from Sky News:Air India crash preliminary report released'At least 798 killed' at Gaza aid points Cooking oil was last year found to be being transported in containers used for fuel without proper cleaning in between. And most famously, in 2008, milk powder laced with the chemical melamine, left six children dead and hundreds of thousands unwell. Food scandals here are a source of real rage and resentment, dangerous things for a government that people cannot choose. Cases like this are just a glimpse into how deep that frustration can run."
    },
    {
        "title": "Two men charged after two women die following  care home car crash in Sunderland",
        "description": "Two men have been charged after a car crashed into a care home in Sunderland during a police chase.",
        "url": "https://news.sky.com/story/two-women-die-after-bmw-crashes-into-care-home-during-police-chase-in-sunderland-13395390",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-police-chase-highcliffe_6961902.jpg?20250710143049",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-11 11:16:00",
        "Headline": "Northumbria Police said a woman in her 90s and another in her 80s died after a BMW that was reported stolen crashed into Highcliffe Care Home in Witherwack.",
        "Content": " Two men have been charged after a car crashed into a care home in Sunderland during a police chase. Northumbria Police said a woman in her 90s and another in her 80s died after a BMW that was reported stolen crashed into Highcliffe Care Home in Witherwack. The home had to be evacuated after the crash occurred around 9.40pm on Wednesday evening. Eight other residents were taken to hospital with injuries not believed to be life-threatening. All but one of them have since been discharged. The force said two men, both aged 21, had been charged with a number of offences in connection with the reports, as it continues to investigate the deaths. Sam Asgari-Tabar, of Stratford Road, Sunderland, has been charged with robbery and kidnap. He was also charged with causing serious injury by dangerous driving in relation to one of the care home residents who remains in hospital. Reece Parish, of Fordham Road, Sunderland, has been charged with robbery and kidnap. \n                  Layton Carr: Family pay tribute to 'caring and loving' boy killed in Gateshead fire\n                 \n                  Fourteen children arrested on suspicion of manslaughter over Gateshead fire released on bail\n                 \n                  Pictured: Boy killed in Gateshead industrial estate fire - 14 children arrested on suspicion of manslaughter\n                 Both men are due to appear at Newcastle Magistrates' Court on Saturday. The blue BMW involved in the collision had been reported stolen from the Fenham area of Newcastle at around 9.20pm on Wednesday. It was then seen in the Sunderland area at around 9.35pm and police were authorised to pursue the vehicle. It crashed into the care home around five minutes later. Police say it is alleged a woman involved in a proposed sale was inside the vehicle when it was driven off before being forcibly removed a short time later. She was left shaken but uninjured by the incident, the force added. Read more from Sky News:Amber heat health alert issuedOfficers describe confronting Southport killer Following the pursuit, a mandatory referral was made to the Independent Office for Police Conduct, Northumbria Police said. A force spokesman said: \"With two men now charged, we would remind people to avoid speculation both online and in our communities as this could impact the ongoing court case. \"Our investigation into the deaths of two care home residents continues.\" A spokesperson for the care home's management Avery Healthcare said: \"We are deeply saddened by the incident at our home in Sunderland and our thoughts are with all those affected. \"We are committed to supporting our residents, their families, and our dedicated staff during this incredibly difficult time.\""
    },
    {
        "title": "Liverpool retires number 20 shirt at all levels in honour of Diogo Jota",
        "description": "Liverpool have retired the number 20 shirt in honour of Diogo Jota - the first time it has made such a gesture.",
        "url": "https://news.sky.com/story/liverpool-to-retire-number-20-shirt-at-all-levels-in-honour-of-diogo-jota-13395596",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jota-liverpool-jota_6963010.jpg?20250711202245",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-11 19:20:00",
        "Headline": "Jota's teammates joined members of his family, including his wife Rute, to view the huge memorial site outside Anfield on Friday.",
        "Content": "Liverpool have retired the number 20 shirt in honour of Diogo Jota - the first time it has made such a gesture. The club said it was a \"unique tribute to a uniquely wonderful person\" and the decision was made in consultation with his wife and family. The number 20 will be retired at all levels, including the men's and women's first teams and academy squads. A statement said: \"It was the number he wore with pride and distinction, leading us to countless victories in the process - and Diogo Jota will forever be Liverpool Football Club's number 20.\" The club called it a \"recognition of not only the immeasurable contribution our lad from Portugal made to the Reds' on-pitch successes over the last five years, but also the profound personal impact he had on his teammates, colleagues and supporters and the everlasting connections he built with them\". Newly-married Jota died alongside his brother when his Lamborghini crashed in northern Spain on 3 July. Police said this week that all the evidence so far suggests Jota was the one driving the vehicle. Liverpool teammates joined members of Jota's family, including his wife Rute, at a huge memorial site outside Anfield on Friday. Read more from Sky News:Mystery in space is most likely 'oldest comet ever seen'Trump may be denied privilege of addressing parliament The star's funeral took place last weekend, with Liverpool colleagues and members of the Portuguese national team in attendance. Reds captain Virgil van Dijk carried a shirt bearing the number 20 made from flowers. Liverpool players returned to the club's training ground for the start of pre-season on Tuesday. Their first game since Jota's death will be on Sunday when they play a friendly away against Preston North End."
    },
    {
        "title": "Blue Stevens: Man, 24, stabbed to death in central London named by police ",
        "description": "Police have named a 24-year-old man who was stabbed in central London earlier this week as Blue Stevens.",
        "url": "https://news.sky.com/story/blue-stevens-man-24-stabbed-to-death-in-central-london-named-by-police-13395485",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-blue-stevens-knightsbridge_6962719.jpg?20250711144457",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-11 14:50:00",
        "Headline": "Cards, bouquets of flowers and a blue candle have been laid at the scene, near a luxury hotel in London's Knightsbridge area.",
        "Content": "Police have named a 24-year-old man who was stabbed in central London earlier this week as Blue Stevens. Emergency services and the air ambulance responded to reports of a stabbing in Seville Street, Knightsbridge, at around 9.24pm on Wednesday. Mr Stevens was found with stab wounds and died at the scene. Cards, bouquets of flowers and a blue candle have been laid on the street for the 24-year-old, who was from Yateley, Hampshire. One note reads: \"We are all absolutely devastated without you. You took a piece of my heart with you.\" The incident happened near a luxury hotel, The Park Tower Knightsbridge, but did not involve any guests or staff, a Marriott spokesperson previously said. Police have launched a murder investigation and have said they are investigating reports that the incident was an attempted robbery. No arrests have been made and more officers - both uniformed and plain-clothed - will be on patrol in the area, the Metropolitan Police has said. Read more:Two women dead after car crashed into care homeAmber heat health alert issued  The force's Commander Christina Jessah said: \"Our thoughts remain with Blue's loved ones following this tragic incident and they continue to be supported by specialist officers. \"They have asked for their privacy as they come to terms with Blue's death. \"We understand the impact this incident has had on the local community and local businesses. \"That is why we have increased the number of police on patrol in the area and I encourage the public to speak to them if they have any questions or concerns.\""
    },
    {
        "title": "Starmer aims to break cabinet away day curse",
        "description": "Sir Keir Starmer was hoping to break the curse of the cabinet away day as he summoned his ministers to Chequers for the launch of a summer \"refresh\" of his troubled government.",
        "url": "https://news.sky.com/story/starmer-aims-to-break-cabinet-away-day-curse-13395660",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-chequers_6963103.jpg?20250712011901",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-07-11 22:30:00",
        "Headline": "Based on the experience of previous cabinet away days, from Sir Tony Blair and Gordon Brown to Theresa May, Boris Johnson and Rishi Sunak, the omens were not good. Away days may seem like a good idea at the time, but most end badly.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Sir Keir Starmer was hoping to break the curse of the cabinet away day as he summoned his ministers to Chequers for the launch of a summer \"refresh\" of his troubled government. The aim: to plot a course for a recovery during Labour's second year in power after a first 12 months blighted by economic woes, rows over freebies, humiliating U-turns and rebellions. In the past, the away day rules from the No 10 high command have included no woolly jumpers and no sandwiches. This time, the rule to ministers was: \"Don't call it a reset.\" Politics latest: Unite union votes to suspend Angela Rayner The curse of this away day could turn out to be the threat of a looming ministerial reshuffle, which some MPs predict could come as early as next week. Could some of those present face the axe? According to the official readout of Sir Keir's away day, the prime minister chaired a session on how the government will use AI \"to turbocharge its Plan for Change\". But that was just a small part of the discussions. Top of the agenda for a \"political cabinet\", without civil servants, were the storm clouds over the economy and the options for Chancellor Rachel Reeves in her make-or-break autumn budget. And based on the experience of previous cabinet away days, from Sir Tony Blair and Gordon Brown to Theresa May, Boris Johnson and Rishi Sunak, the omens were not good. Away days may seem like a good idea at the time, but most end badly. The idea of Chequers away days has been to hold a brainstorming session in the privacy of the Buckinghamshire countryside without distractions or prying photographers, reporters or TV crews. But over the years, like most family get-togethers, there have been personality clashes, squabbles about what to eat and what to wear, disputes about who takes centre stage, and even backstabbing and walkouts. Read more:Government to announce new AI schemeWhat is the UK-France migrant returns deal, how many will be returned? The last Chequers cabinet away day, held by Mr Sunak in January 2023, took place with two senior figures facing official investigations. Tory chair Nadhim Zahawi was engulfed in a tax scandal and deputy prime minister Dominic Raab was facing bullying allegations. Mr Zahawi was out within a week after this away day and Mr Rabb within three months. Without doubt, the most disastrous cabinet awayday at Chequers was in July 2018, when Ms May thought she'd persuaded her cabinet to back her Brexit deal. Then, as now, the heat was sweltering. But two days later, David Davis quit as Brexit secretary and Mr Johnson - who was said to have proposed a champagne toast to the prime minister at Chequers - resigned as foreign secretary the following day. Ms May thought she had a deal that would keep the UK closely tied to the EU's customs union and single market. But it was doomed even during that away day. It was reported that ministers were warned that anyone who resigned would have to walk a mile down the drive and get a lift home with the local taxi firm, whose cards had been left in the foyer. When he resigned, Mr Davis was said to have been livid about hostile briefing from senior figures in Downing Street about how the Brexiters would be treated at Chequers, including the taxi threat. And Mr Johnson not only launched a \"Chuck Chequers\" campaign opposing Ms May's deal, but also a campaign to chuck her out of Downing Street and seize her job for himself. As prime minister, he also held a cabinet awayday, not at Chequers, but at a pottery in the heart of the \"red wall\" in Stoke-on-Trent, in 2022. The venue might have been different, but that was cursed too. Just weeks later Mr Johnson's cabinet shattered like broken Wedgwood china following the resignations of Mr Sunak and Sajid Javid. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 The modern trend for cabinet away days was started by Sir Tony - who else? - in 1998. The rules for ministers were laid down by his chief of staff Jonathan Powell, now Sir Keir's national security adviser. In a memo to cabinet ministers attending, he wrote: \"TV will film people arriving and going, so there can be no woolly jumpers.\" Mr Powell was rebuffed by Sir Tony, however, when he suggested in a memo to the prime minister that Mr Brown should start the meeting with a discussion on the economy. \"No,\" Sir Tony replied bluntly in a handwritten note. Peter Mandelson, now Britain's ambassador in Washington, demanded \"something nicer than sandwiches\" for lunch and got his wish when a buffet was laid on. Sir Keir's Chequers away day also began with lunch, then the short formal cabinet meeting with the discussion about AI, then the political cabinet, which was the real reason for the away day. No need for woolly jumpers in the 32C heat. Just don't call it a \"refresh\"."
    },
    {
        "title": "Oasis fans queue from 8am for the Gallaghers' homecoming gig in Manchester",
        "description": "The first fan started queuing before 8am.",
        "url": "https://news.sky.com/story/oasis-fans-queue-from-8am-for-the-gallaghers-homecoming-gig-in-manchester-13395495",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-oasis-fans_6962800.jpg?20250711155801",
        "type": "Home",
        "Author": "Katerina Vittozzi",
        "Date Published": "2025-07-11 15:24:00",
        "Headline": "While some fans have flown thousands of miles to see the Gallaghers' homecoming tonight, another tells Sky News how he was lucky enough to pick up a last-minute ticket.",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n  The first fan started queuing before 8am. Heaton Park, just north of Manchester City centre, is tonight hosting 80,000 fans who've come to see the Gallaghers' homecoming. \"I would honestly say it's a real cultural moment of the 21st century,\" says Sam, who's from Manchester and has come here with a group of friends - including one who has travelled from Australia for the gig. This will be the fourth time Sam has seen Oasis play, although obviously not for many years, and he says he can't wait for the moment the band comes on to the stage. \"The reaction from the fans, that's going to be really special,\" he says. \"This band means so much to the North West.\" Like many people attending tonight's concert, Sam is wearing a bucket hat. Liam Gallagher's iconic headgear has become a part of the band's cultural legacy and they are certainly on display here, with street vendors popping up all around the park's perimeter. \n                  The Salt Path author Raynor Winn's fourth book delayed\n                 \n                  Chris Brown: R&B singer denies further charges following alleged bottle attack in London club\n                 \n                  Salt Path author Raynor Winn responds to claims she lied about 'true' story\n                 Another fan, Dean, tells me he feels incredibly lucky to have got a ticket at all. \"I had seven devices out when the tickets were released and I didn't get one,\" he says. \"And then about three days ago, a friend of mine messaged to say she couldn't make it. \"So I made it. £120 with coach travel there and back - perfect.\" Dom is another fan who has come from Australia for the gig. \"We're frothing to be here, like so stoked,\" he says, \"The atmosphere is going to be electric.\" Read more:Review - Oasis reunite for first gig in 16 yearsA timeline of Britpop's most successful band One young couple are here on their honeymoon. From Italy, they met at a Liam Gallagher concert several years ago. \"It's where we fell in love,\" Claudia says. \"And we got married last month so we wanted to be here to celebrate.\" Amanda, from Manchester, is also here with a loved one - well, sort of. She's wearing a paper cut-out mask of her 30-year-old son Harry's face. \"He's in Melbourne and got a ticket but then couldn't come,\" Amanda explains. \"And so Harry doesn't feel left out,\" she says pulling the mask down over her face, \"we've brought him with us!\""
    },
    {
        "title": "Former Metropolitan Police commissioner Lord Ian Blair has died",
        "description": "Former Metropolitan Police commissioner Lord Ian Blair has died aged 72.",
        "url": "https://news.sky.com/story/former-met-police-commissioner-lord-ian-blair-has-died-sky-news-understands-13395532",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ian-blair-met-police_6962894.jpg?20250711190045",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-11 16:48:00",
        "Headline": "The catastrophic mistake of shooting dead an innocent man in the febrile weeks after 7/7 will forever be associated with his time in charge of London's police.",
        "Content": "Former Metropolitan Police commissioner Lord Ian Blair has died aged 72. Lord Blair led the force for three years between 2005 and 2008 and was in charge during the 7/7 London bombings. The 20th anniversary of the 2005 attack, which killed 52 people, was on Monday. The Met's response notoriously included the shooting dead of an innocent man, Jean Charles de Menezes, at Stockwell Tube station two weeks later. He was killed under the mistaken belief he was a suicide bomber. False details about how he acted were put out by the Met, insinuating the Brazilian was in some way responsible for what happened. Lord Blair repeated those details and was later accused of a cover-up and obstructing inquiries into the incident. Sky News crime correspondent Martin Brunt said \"it effectively blighted his time as commissioner\" and that \"history will probably judge him quite harshly\". \"But there were good things,\" he added. \"[Lord Blair] took hold of the Met and forged a much better relationship with MI5 in the wake of the 7/7 bombings. \"Some of his big things were diversity and he reformed the way the Met recruited - people from ethnic communities. \"He was a big supporter of neighbourhood policing. Although that, over the years, dwindled due to a lack of funding. But it's more or less the model police forces across Britain are reintroducing.\" Read more from Sky News:Salt Path author's fourth book delayedMan, 24, stabbed to death in Knightsbridge named by police Lord Blair quit his role in 2008 after saying he didn't have the confidence of then-mayor Boris Johnson. Viewed as a liberal figure, he was sometimes jokingly referred to as \"PC Blair\" by other officers. He joined the police in the 1970s and served with other forces before joining the Met. His early work as a detective in London included investigating the fatal 1987 King's Cross fire. Senior positions for the Thames Valley and Surrey forces followed before he returned to the capital as deputy commissioner - and then the top job. Lord Blair was a crossbench peer and was active in the House of Lords right up until his death."
    },
    {
        "title": "Care whistleblower 'who saw elderly resident being punched' could face removal from Britain",
        "description": "A care worker who reported the alleged abuse of an elderly care home resident, which triggered&#160;a criminal investigation, is facing destitution and potential removal from Britain after speaking up.",
        "url": "https://news.sky.com/story/care-whistleblower-who-saw-elderly-resident-being-punched-could-face-removal-from-britain-13395523",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-migrant-care-home_6962901.png?20250711180005",
        "type": "UK",
        "Author": "Becky Johnson, social affairs correspondent, and Emily Jennings, social affairs producer",
        "Date Published": "2025-07-11 23:01:00",
        "Headline": "A migrant care worker who reported serious concerns to her bosses says she was called to a meeting with a manager and told to \"change your statement, otherwise we will dismiss you\". She refused. The following month, she was sacked.",
        "Content": "By Becky Johnson, social affairs correspondent, and Emily Jennings, social affairs producer    A care worker who reported the alleged abuse of an elderly care home resident, which triggered a criminal investigation, is facing destitution and potential removal from Britain after speaking up. \"Meera\", whose name we have changed to protect her identity, said she witnessed an elderly male resident being punched several times in the back by a carer at the home where she worked. Sky News is unable to name the care home for legal reasons because of the ongoing police investigation. \"I was [a] whistleblower there,\" said Meera, who came to the UK from India last year to work at the home. \"Instead of addressing things, they fired me... I told them everything and they made me feel like I am criminal. I am not criminal, I am saving lives,\" she added. Like thousands of foreign care workers, Meera's employer sponsored her visa. Unless she can find another sponsor, she now faces the prospect of removal from the country. \"I am in trouble right now and no one is trying to help me,\" she said. \n                  Migrants deal a win for Starmer - and could help with fight against Reform\n                 \n                  Nigel Farage hits back at Emmanuel Macron after French president sparks fresh Brexit row\n                 \n                  King Charles asks RNLI crew whether they 'get a lot?' while discussing small boat crossings\n                 Meera said she reported the alleged abuse to her bosses, but was called to a meeting with a manager and told to \"change your statement, otherwise we will dismiss you\". She refused. The following month, she was sacked. The care home claimed she failed to perform to the required standard in the job. She went to the police to report the alleged abuse and since then, a number of people from the care home have been arrested. They remain under investigation. 'Migrants recruited because many are too afraid to speak out' The home has capacity for over 60 residents. It is unclear if the care home residents or their relatives know about the police investigation or claim of physical abuse. Since the arrests, the regulator, the Care Quality Commission (CQC), carried out an investigation at the home triggered by the concerns - but the home retained its 'good' rating. Meera has had no reassurance from the authorities that she will be allowed to remain in Britain. In order to stay, she'll need to find another care home to sponsor her which she believes will be impossible without references from her previous employer. She warned families: \"I just want to know people in care homes like these... your person, your father, your parents, is not safe.\" She claimed some care homes have preferred to recruit migrants because many are too afraid to speak out. \"You hire local staff, they know the legal rights,\" she said. \"They can complain, they can work anywhere... they can raise [their] voice,\" she said. Sky News has reported widespread exploitation of care visas and migrant care workers. Read more:More than 100 migrants face being in UK illegallyImmigration crackdown will fuel 'exodus' of nursesNew English language and UK citizenship requirements for migrants Currently migrants make up around a third of the adult social care workforce, with the majority here on visas that are sponsored by their employers. As part of measures announced in April in the government's immigration white paper, the care visa route will be closed, meaning care homes will no longer be able to recruit abroad. 'Whole system is based on power imbalance' But the chief executive of the Work Rights Centre, a charity that helps migrants with employment issues, is warning that little will change for the tens of thousands of foreign care workers already here. \"The whole system is based on power imbalance and the government announcement doesn't change that,\" Dr Dora-Olivia Vicol told Sky News. She linked the conditions for workers to poor care for residents. \"I think the power that employers have over migrant workers' visas really makes a terrible contribution to the quality of care,\" she said. Imran agrees. He came to the UK from Bangladesh, sponsored by a care company unrelated to the one Meera worked for. He says he frequently had to work 14-hour shifts with no break because there weren't enough staff. He too believes vulnerable people are being put at risk by the working conditions of their carers. Migrant workers 'threatened' over visas \"For four clients, there is [a] minimum requirement for two or three staff. I was doing [it] alone,\" he said, in broken English. \"When I try to speak, they just directly threaten me about my visa,\" he said. \"I knew two or three of my colleagues, they are facing the same issue like me. But they're still afraid to speak up because of the visa.\" A government spokesperson called what happened to Imran and Meera \"shocking\". \"No one should go to work in fear of their employer, and all employees have a right to speak up if they witness poor practice and care.\" James Bullion, from the CQC, told Sky News it acts on intelligence passed to it to ensure people stay safe in care settings. Additional research by Leah Adin"
    },
    {
        "title": "Donald Trump may be denied privilege of addressing parliament on UK state visit",
        "description": "Donald Trump may be denied the honour of addressing parliament on his state visit to the UK later this year, with no formal request yet submitted for him to be given that privilege.",
        "url": "https://news.sky.com/story/donald-trump-may-be-denied-privilege-of-addressing-parliament-on-uk-state-visit-13395516",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-donald_6962871.jpg?20250711173611",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-07-11 18:00:00",
        "Headline": "The fact that that parliament isn't sitting for much of September could help resolve a potentially awkward issue.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  Donald Trump may be denied the honour of addressing parliament on his state visit to the UK later this year, with no formal request yet submitted for him to be given that privilege. It comes after President Macron's successful state visit this week, in which he was invited to speak in front of both Houses of Parliament. Sky News has been told the Speaker of the House of Commons, Sir Lindsay Hoyle, hasn't so far received a request to invite the US president to speak in parliament when he is expected to visit in September. It was confirmed to MPs who have raised concerns about the US president being allowed to address both houses. Kate Osborne, Labour MP for Jarrow and Gateshead East, wrote to the speaker in April asking him to stop Mr Trump from addressing parliament, and tabled an early-day motion outlining her concerns. \"I was happy to see Macron here but feel very differently about Trump,\" she said. \"Trump has made some very uncomfortable and worrying comments around the UK government, democracy, the Middle East, particularly around equalities and, of course, Ukraine. \"So, I think there are many reasons why, when we're looking at a state visit, we should be looking at why they're being afforded that privilege. Because, of course, it is a privilege for somebody to come and address both of the houses.\" But the timing of the visit may mean that any diplomatic sensitivities, or perceptions of a snub, could be avoided. Lord Ricketts, a former UK ambassador to France, pointed out that parliament isn't sitting for much of September, and that could help resolve the issue. In 2017, he wrote a public letter questioning the decision to give Donald Trump his first state visit, saying it put Queen Elizabeth II in a \"very difficult position\". Parliament rises from 16 September until 13 October due to party conferences. The dates for the state visit haven't yet been confirmed by Buckingham Palace or the government. However, they have not denied that it will take place in September, after Mr Trump appeared to confirm they were planning to hold the state visit that month. The palace confirmed this week that the formal planning for his arrival had begun. With the King likely to still be in Scotland in early September for events such as the Braemar Gathering, and the anniversary of his accession and the death of Queen Elizabeth on the 8th September, it may be expected that the visit would take place sometime from mid to the end of September, also taking into consideration the dates of the Labour Party conference starting on the 28th September and possibly the Lib Dem's conference from the 20th-23rd. When asked about parliamentary recess potentially solving the issue, Ms Osborne said: \"It may be a way of dealing with it in a very diplomatic way... I don't know how much control we have over Trump's diary. \"But if we can manoeuvre it in a way that means that the House isn't sitting, then that seems like a good solution, maybe not perfect, because I'd actually like him to know that he's not welcome.\" A message from the speaker's office, seen by Sky News, says: \"Formal addresses to both Houses of Parliament are not automatically included in the itinerary of such a state visit. \"Whether a foreign head of state addresses parliament, during a state visit or otherwise, is part of the planning decisions.\" It's understood that if the government agrees to a joint address to parliament, the Lord Chamberlain's office writes to the two speakers, on behalf of the King, to ask them to host this. It will be Mr Trump's second state visit. During his first, in 2019, he didn't address parliament, despite the fact that his predecessor, Barack Obama, was asked to do so. It was unclear if this was due to the fact John Bercow, the speaker at the time, made it clear he wasn't welcome to do so. However, it didn't appear to dampen Mr Trump's excitement about his time with the Royal Family. Read more from Sky News:Two women killed as BMW crashes into care home Officers who confronted Southport killer win bravery award Speaking earlier this year, he described his state visit as \"a fest\" adding \"it's an honour… I'm a friend of Charles, I have great respect for King Charles and the family, William; we have really just a great respect for the family. And I think they're setting a date for September.\" It is expected that, like Mr Macron, the pageantry for his trip this time will revolve around Windsor, with refurbishment taking place at Buckingham Palace."
    },
    {
        "title": "Liverpool retires number 20 shirt at all levels in honour of Diogo Jota",
        "description": "Liverpool have retired the number 20 shirt in honour of Diogo Jota - the first time it has made such a gesture.",
        "url": "https://news.sky.com/story/liverpool-to-retire-number-20-shirt-at-all-levels-in-honour-of-diogo-jota-13395596",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jota-liverpool-jota_6963010.jpg?20250711202245",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-11 19:20:00",
        "Headline": "Jota's teammates joined members of his family, including his wife Rute, to view the huge memorial site outside Anfield on Friday.",
        "Content": "Liverpool have retired the number 20 shirt in honour of Diogo Jota - the first time it has made such a gesture. The club said it was a \"unique tribute to a uniquely wonderful person\" and the decision was made in consultation with his wife and family. The number 20 will be retired at all levels, including the men's and women's first teams and academy squads. A statement said: \"It was the number he wore with pride and distinction, leading us to countless victories in the process - and Diogo Jota will forever be Liverpool Football Club's number 20.\" The club called it a \"recognition of not only the immeasurable contribution our lad from Portugal made to the Reds' on-pitch successes over the last five years, but also the profound personal impact he had on his teammates, colleagues and supporters and the everlasting connections he built with them\". Newly-married Jota died alongside his brother when his Lamborghini crashed in northern Spain on 3 July. Police said this week that all the evidence so far suggests Jota was the one driving the vehicle. Liverpool teammates joined members of Jota's family, including his wife Rute, at a huge memorial site outside Anfield on Friday. Read more from Sky News:Mystery in space is most likely 'oldest comet ever seen'Trump may be denied privilege of addressing parliament The star's funeral took place last weekend, with Liverpool colleagues and members of the Portuguese national team in attendance. Reds captain Virgil van Dijk carried a shirt bearing the number 20 made from flowers. Liverpool players returned to the club's training ground for the start of pre-season on Tuesday. Their first game since Jota's death will be on Sunday when they play a friendly away against Preston North End."
    },
    {
        "title": "Two men charged after two women die following  care home car crash in Sunderland",
        "description": "Two men have been charged after a car crashed into a care home in Sunderland during a police chase.",
        "url": "https://news.sky.com/story/two-women-die-after-bmw-crashes-into-care-home-during-police-chase-in-sunderland-13395390",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-police-chase-highcliffe_6961902.jpg?20250710143049",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-11 11:16:00",
        "Headline": "Northumbria Police said a woman in her 90s and another in her 80s died after a BMW that was reported stolen crashed into Highcliffe Care Home in Witherwack.",
        "Content": " Two men have been charged after a car crashed into a care home in Sunderland during a police chase. Northumbria Police said a woman in her 90s and another in her 80s died after a BMW that was reported stolen crashed into Highcliffe Care Home in Witherwack. The home had to be evacuated after the crash occurred around 9.40pm on Wednesday evening. Eight other residents were taken to hospital with injuries not believed to be life-threatening. All but one of them have since been discharged. The force said two men, both aged 21, had been charged with a number of offences in connection with the reports, as it continues to investigate the deaths. Sam Asgari-Tabar, of Stratford Road, Sunderland, has been charged with robbery and kidnap. He was also charged with causing serious injury by dangerous driving in relation to one of the care home residents who remains in hospital. Reece Parish, of Fordham Road, Sunderland, has been charged with robbery and kidnap. \n                  Layton Carr: Family pay tribute to 'caring and loving' boy killed in Gateshead fire\n                 \n                  Fourteen children arrested on suspicion of manslaughter over Gateshead fire released on bail\n                 \n                  Pictured: Boy killed in Gateshead industrial estate fire - 14 children arrested on suspicion of manslaughter\n                 Both men are due to appear at Newcastle Magistrates' Court on Saturday. The blue BMW involved in the collision had been reported stolen from the Fenham area of Newcastle at around 9.20pm on Wednesday. It was then seen in the Sunderland area at around 9.35pm and police were authorised to pursue the vehicle. It crashed into the care home around five minutes later. Police say it is alleged a woman involved in a proposed sale was inside the vehicle when it was driven off before being forcibly removed a short time later. She was left shaken but uninjured by the incident, the force added. Read more from Sky News:Amber heat health alert issuedOfficers describe confronting Southport killer Following the pursuit, a mandatory referral was made to the Independent Office for Police Conduct, Northumbria Police said. A force spokesman said: \"With two men now charged, we would remind people to avoid speculation both online and in our communities as this could impact the ongoing court case. \"Our investigation into the deaths of two care home residents continues.\" A spokesperson for the care home's management Avery Healthcare said: \"We are deeply saddened by the incident at our home in Sunderland and our thoughts are with all those affected. \"We are committed to supporting our residents, their families, and our dedicated staff during this incredibly difficult time.\""
    },
    {
        "title": "Former Metropolitan Police commissioner Lord Ian Blair has died",
        "description": "Former Metropolitan Police commissioner Lord Ian Blair has died aged 72.",
        "url": "https://news.sky.com/story/former-met-police-commissioner-lord-ian-blair-has-died-sky-news-understands-13395532",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ian-blair-met-police_6962894.jpg?20250711190045",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-11 16:48:00",
        "Headline": "The catastrophic mistake of shooting dead an innocent man in the febrile weeks after 7/7 will forever be associated with his time in charge of London's police.",
        "Content": "Former Metropolitan Police commissioner Lord Ian Blair has died aged 72. Lord Blair led the force for three years between 2005 and 2008 and was in charge during the 7/7 London bombings. The 20th anniversary of the 2005 attack, which killed 52 people, was on Monday. The Met's response notoriously included the shooting dead of an innocent man, Jean Charles de Menezes, at Stockwell Tube station two weeks later. He was killed under the mistaken belief he was a suicide bomber. False details about how he acted were put out by the Met, insinuating the Brazilian was in some way responsible for what happened. Lord Blair repeated those details and was later accused of a cover-up and obstructing inquiries into the incident. Sky News crime correspondent Martin Brunt said \"it effectively blighted his time as commissioner\" and that \"history will probably judge him quite harshly\". \"But there were good things,\" he added. \"[Lord Blair] took hold of the Met and forged a much better relationship with MI5 in the wake of the 7/7 bombings. \"Some of his big things were diversity and he reformed the way the Met recruited - people from ethnic communities. \"He was a big supporter of neighbourhood policing. Although that, over the years, dwindled due to a lack of funding. But it's more or less the model police forces across Britain are reintroducing.\" Read more from Sky News:Salt Path author's fourth book delayedMan, 24, stabbed to death in Knightsbridge named by police Lord Blair quit his role in 2008 after saying he didn't have the confidence of then-mayor Boris Johnson. Viewed as a liberal figure, he was sometimes jokingly referred to as \"PC Blair\" by other officers. He joined the police in the 1970s and served with other forces before joining the Met. His early work as a detective in London included investigating the fatal 1987 King's Cross fire. Senior positions for the Thames Valley and Surrey forces followed before he returned to the capital as deputy commissioner - and then the top job. Lord Blair was a crossbench peer and was active in the House of Lords right up until his death."
    },
    {
        "title": "Coastguard responded to 'multiple incidents' involving small boats in Channel",
        "description": "The UK coastguard has said it responded to \"multiple incidents\" involving small boats in the Channel on Friday.",
        "url": "https://news.sky.com/story/coastguard-responding-to-multiple-incidents-involving-small-boats-in-the-channel-13395301",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rnli-lifeboat_6962511.jpg?20250711115637",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-11 08:34:00",
        "Headline": "At least 21,000 people have crossed the Channel in small boats since January, putting 2025 on course to be a record year. Many of those crossing are fleeing war, extreme poverty and persecution in their home countries.",
        "Content": " The UK coastguard has said it responded to \"multiple incidents\" involving small boats in the Channel on Friday. HM Coastguard said Border Force and RNLI vessels had been deployed as part of the response. It came hours after Sir Keir Starmer and French President Emmanuel Macron announced a deal they said was designed to crack down on small boats. The number of crossings tends to be higher when the weather in the Channel is calm, as it was on Friday morning.  At least 21,000 people have already made the journey since January, putting 2025 on course to be a record year for crossings. The latest Home Office figures show 573 people made the crossing in 10 boats on Thursday. \n                  Migrants deal a win for Starmer - and could help with fight against Reform\n                 \n                  Nigel Farage hits back at Emmanuel Macron after French president sparks fresh Brexit row\n                 \n                  King Charles asks RNLI crew whether they 'get a lot?' while discussing small boat crossings\n                 According to the Red Cross, many people cross the English Channel in the hopes of finding and joining family who have already made it to the UK. It says people are often separated from their loved ones as they flee their homes or on their journey in search of safety, which can take many years. Read moreWhy do so many from around the world try to cross the English Channel?Channel crossings rise 50% in first six months of 2025 News correspondent Today is an example of what the Home Office calls a \"red day\". It's 22C at the port of Dover, the wave level is low and visibility is good. The government says these conditions increase the likelihood of small boat crossings.\n Within an hour of us arriving, a Border Force vessel docks and a stream of people wearing bright lifejackets walk off and up the jetty to an asylum processing tent. Someone is carrying what looks like a small child - 81 people have arrived on this boat. It's deceiving standing on this cliff top, looking out at the blue-green English Channel glistening in the sunshine. This is not the calm body of water it appears to be. One of the busiest shipping lanes in the world, the journey across from France is treacherous, and as full of risks as it may be of hope and ambition.  Judging by the numbers Sky News teams have counted today (296 arrivals so far), those making the journey have not been deterred by the prime minister's deal with the French. The UK hosts less than 1% of the world's refugees, with 71% seeking safety in neighbouring countries to their own. For example, the Red Cross says Jordan currently hosts 1.3 million refugees from neighbouring Syria. Many of those seeking refuge in the UK rather than other European countries do so because they can speak English. Under the terms of the \"one in, one out\" scheme agreed between the UK and France, people who cross the Channel will be returned to France each week in exchange for the same number of asylum seekers who have been accepted to come to the UK. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Speaking next to France's President Emmanuel Macron at a news conference in north west London, UK Prime Minister Sir Keir Starmer said it would come into force in a matter of \"weeks\". \"Migrants arriving via small boat will be detained and returned to France in short order,\" he said. \"In exchange for every return, a different individual will be allowed to come here via a safe route - controlled and legal - subject to strict security checks, and only open to those who have not tried to enter the UK illegally.\" The prime minister said the arrangement would begin as a \"pilot\", with reports suggesting that just 50 people per week will be sent to France back across the Channel. However, neither Mr Macron nor Sir Keir mentioned any figures in the news conference."
    },
    {
        "title": "Starmer aims to break cabinet away day curse",
        "description": "Sir Keir Starmer was hoping to break the curse of the cabinet away day as he summoned his ministers to Chequers for the launch of a summer \"refresh\" of his troubled government.",
        "url": "https://news.sky.com/story/starmer-aims-to-break-cabinet-away-day-curse-13395660",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-chequers_6963103.jpg?20250712011901",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-07-11 22:30:00",
        "Headline": "Based on the experience of previous cabinet away days, from Sir Tony Blair and Gordon Brown to Theresa May, Boris Johnson and Rishi Sunak, the omens were not good. Away days may seem like a good idea at the time, but most end badly.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Sir Keir Starmer was hoping to break the curse of the cabinet away day as he summoned his ministers to Chequers for the launch of a summer \"refresh\" of his troubled government. The aim: to plot a course for a recovery during Labour's second year in power after a first 12 months blighted by economic woes, rows over freebies, humiliating U-turns and rebellions. In the past, the away day rules from the No 10 high command have included no woolly jumpers and no sandwiches. This time, the rule to ministers was: \"Don't call it a reset.\" Politics latest: Unite union votes to suspend Angela Rayner The curse of this away day could turn out to be the threat of a looming ministerial reshuffle, which some MPs predict could come as early as next week. Could some of those present face the axe? According to the official readout of Sir Keir's away day, the prime minister chaired a session on how the government will use AI \"to turbocharge its Plan for Change\". But that was just a small part of the discussions. Top of the agenda for a \"political cabinet\", without civil servants, were the storm clouds over the economy and the options for Chancellor Rachel Reeves in her make-or-break autumn budget. And based on the experience of previous cabinet away days, from Sir Tony Blair and Gordon Brown to Theresa May, Boris Johnson and Rishi Sunak, the omens were not good. Away days may seem like a good idea at the time, but most end badly. The idea of Chequers away days has been to hold a brainstorming session in the privacy of the Buckinghamshire countryside without distractions or prying photographers, reporters or TV crews. But over the years, like most family get-togethers, there have been personality clashes, squabbles about what to eat and what to wear, disputes about who takes centre stage, and even backstabbing and walkouts. Read more:Government to announce new AI schemeWhat is the UK-France migrant returns deal, how many will be returned? The last Chequers cabinet away day, held by Mr Sunak in January 2023, took place with two senior figures facing official investigations. Tory chair Nadhim Zahawi was engulfed in a tax scandal and deputy prime minister Dominic Raab was facing bullying allegations. Mr Zahawi was out within a week after this away day and Mr Rabb within three months. Without doubt, the most disastrous cabinet awayday at Chequers was in July 2018, when Ms May thought she'd persuaded her cabinet to back her Brexit deal. Then, as now, the heat was sweltering. But two days later, David Davis quit as Brexit secretary and Mr Johnson - who was said to have proposed a champagne toast to the prime minister at Chequers - resigned as foreign secretary the following day. Ms May thought she had a deal that would keep the UK closely tied to the EU's customs union and single market. But it was doomed even during that away day. It was reported that ministers were warned that anyone who resigned would have to walk a mile down the drive and get a lift home with the local taxi firm, whose cards had been left in the foyer. When he resigned, Mr Davis was said to have been livid about hostile briefing from senior figures in Downing Street about how the Brexiters would be treated at Chequers, including the taxi threat. And Mr Johnson not only launched a \"Chuck Chequers\" campaign opposing Ms May's deal, but also a campaign to chuck her out of Downing Street and seize her job for himself. As prime minister, he also held a cabinet awayday, not at Chequers, but at a pottery in the heart of the \"red wall\" in Stoke-on-Trent, in 2022. The venue might have been different, but that was cursed too. Just weeks later Mr Johnson's cabinet shattered like broken Wedgwood china following the resignations of Mr Sunak and Sajid Javid. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 The modern trend for cabinet away days was started by Sir Tony - who else? - in 1998. The rules for ministers were laid down by his chief of staff Jonathan Powell, now Sir Keir's national security adviser. In a memo to cabinet ministers attending, he wrote: \"TV will film people arriving and going, so there can be no woolly jumpers.\" Mr Powell was rebuffed by Sir Tony, however, when he suggested in a memo to the prime minister that Mr Brown should start the meeting with a discussion on the economy. \"No,\" Sir Tony replied bluntly in a handwritten note. Peter Mandelson, now Britain's ambassador in Washington, demanded \"something nicer than sandwiches\" for lunch and got his wish when a buffet was laid on. Sir Keir's Chequers away day also began with lunch, then the short formal cabinet meeting with the discussion about AI, then the political cabinet, which was the real reason for the away day. No need for woolly jumpers in the 32C heat. Just don't call it a \"refresh\"."
    },
    {
        "title": "Victims of three medical products that caused 'avoidable harm' still awaiting redress",
        "description": "The dark granite block in a children's cemetery in Bristol tells an incomplete story: \"Trelissa Whitbread, born 3rd of Feb 1988. She lived 2 hours.\"",
        "url": "https://news.sky.com/story/victims-of-three-medical-products-that-caused-avoidable-harm-still-awaiting-redress-13395225",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-deborah-mann-branwen_6962291.jpg?20250711021300",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-07-11 02:50:00",
        "Headline": "Five years ago, sodium valproate was among three medical products including the pregnancy test drug Primodos and medical device pelvic mesh, that were found to have caused \"avoidable harm\" to patients.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  The dark granite block in a children's cemetery in Bristol tells an incomplete story: \"Trelissa Whitbread, born 3rd of Feb 1988. She lived 2 hours.\" Deborah Mann has not returned to the grave of her firstborn for 30 years but today has come with her daughter, Branwen, to tell her the story. \"It shouldn't have happened,\" she says quietly. Ms Mann had four pregnancies. Her first two children, Trelissa and Kaverne, died shortly after birth. Ms Mann believes their deaths were caused by an epilepsy drug she was taking called sodium valproate, prescribed by her GP. After a long gap she would go on to have two more children, both girls, who were diagnosed with what is now recognised as foetal valproate syndrome, which has left them with life-long physical and neurological problems. Ms Mann tells Sky News: \"I asked so many questions and was told 'this is just the way things are.' It can't be the way things are when you lose two babies. How can it be the way things are?\" Five years ago, valproate was among three medical products including the pregnancy test drug Primodos and medical device pelvic mesh, that were found to have caused \"avoidable harm\" to patients. The report was clear that valproate could cause lifelong disabilities to the children of mothers taking the drug when pregnant. The independent review, chaired by Baroness Julia Cumberlege, strongly criticised the industry and regulators and made a series of recommendations, including the creation of a redress scheme for victims in all three groups. On valproate, it stated: \"Nothing can undo the harm that has been done to these individuals, but steps can be taken to make their lives easier.\" Read more from Sky News:Starmer and Macron agree 'one in, one out' migrants return dealOfficers who confronted 'coward' killer win bravery award 20,000 children exposed to drug while in womb Five years on there is still no such scheme for any of the campaign groups. In the week of developments in the Post Office scandal and infected blood, here is another scandal no less significant. An estimated 20,000 children were exposed to sodium valproate while in the womb. UK regulator the MHRA says an increased risk of neonatal loss is not currently a recognised adverse reaction, but it does warn of a range of congenital problems caused by the drug that are increasingly likely the higher the dose. Sky News has also seen a study from 1972 which shows high doses of sodium valproate could be embryo-lethal in rats. At times Ms Mann was being prescribed 5,000mg, which is double the highest recommended dose. Ms Mann worries about the future of her surviving children. She says of the government: \"It's financially better to pretend they don't even exist. So many children are harmed, so many children that will not have their needs addressed as they grow older.\" At the time of birth her eldest daughter Rhonwen's medical records state \"valproate levels caused foetal and patient damage,\" which included deafness. Daughter worries about being a mother as she can pass condition on Ms Mann wasn't initially told about the cause of her daughter's problems, even when she was pregnant with her next child Branwen. The 29-year-old told Sky News: \"I have tight ankles, tight legs, tight hips and I have a weak lower back. I have to wear splints every day to be sure I can keep walking, and I have to do exercises every day. I have autism, Asperger's syndrome.\" She goes on to list a series of brain problems that must be scanned every two years, \"to make sure nothing's grown or moved.\" She was bullied at school for her appearance, and she worries about being a mother as she can pass the condition on to her children. She said: \"I feel very let down by the government. I feel let down by the people who promised they would help us, that they will help ensure that we have a better quality of life.\" 'Somebody at last had listened' Others the Cumberlege review wanted to get redress for \"avoidable harm\" were children born with malformations after their mothers used the drug Primodos. These hormone-packed pills were prescribed as a pregnancy test to thousands of women in the 1960s and 70s and are alleged to have caused a range of malformations to babies, from shortened limbs to heart defects, which the manufacturer denies. Lead campaigner for the Association for Children Damaged by Hormone Pregnancy Tests (ACDHPT), Marie Lyon, told Sky News: \"Our families were utterly overjoyed that somebody at last had listened, and Julia Cumberlege did a thorough review. Our expectations were wow! This is it now. An apology from the health secretary, all these years and we've finally got there, and then nothing. \"Five years and may I say, five years and 31 deaths. That's how many of our members have died since that report was published in 2020 and we've still not received justice. It's a disgrace.\" Baroness Cumberlege also recommended the government create a redress scheme for women left debilitated by pelvic mesh implants. 'The government are dragging their feet' Kath Sansom, founder of the Sling The Mesh campaign group, told Sky News: \"There are women in there who can't walk any more, who need a stick or a mobility scooter - they've lost jobs, marriages, pensions. Some have had to sell their homes, and it feels really unfair that we are still waiting for a reply on redress. \"The government are dragging their feet. We keep being told that they are working on it at pace - but the phrase within the group is - a snail's pace.\" The Department of Health and Social Care said: \"The harm caused by pelvic mesh continues to be felt today\" and \"we are fully focused on how best to support patients and prevent future harm.\" \"Health Minister Baroness Gillian Merron met patients affected and has committed to providing a further update.\" Government considering recommendations The government says it is considering the recommendations by the patient safety commissioner last year for a redress scheme, but it's notable there is no timescale and no reference to the harm caused by valproate or Primodos in their statement. Dr Alison Cave, chief safety officer at the Medicines and Healthcare products Regulatory Agency (MHRA), said: \"Patient safety is our highest priority and no one should stop taking valproate without seeking advice from their healthcare professional. \"Valproate is a highly teratogenic medicine and there is evolving evidence for harms in males, which is why the Commission on Human Medicines (CHM) recommended new regulatory measures to reduce the known harms from valproate, including the significant risk of serious harm to the baby if taken during pregnancy and the risk of impaired fertility in male.\" Sanofi, manufacturers of sodium valproate, told us: \"We have always worked closely with the MHRA and fully met all our legal and regulatory obligations in relation to valproate which is an essential medicine used to treat a serious and potentially life-threatening condition. \"Sanofi has at all times provided information regarding valproate that reflects current knowledge as approved by MHRA. \"We are committed to working with all concerned stakeholders to continue educating about the risks and precautions for the appropriate use of valproate.\""
    },
    {
        "title": "Amber heat health alert issued - with more hosepipe bans on the way",
        "description": "Heat health alerts across huge swathes of England have been upgraded to amber as the UK experiences its third heatwave of the summer.",
        "url": "https://news.sky.com/story/amber-heat-health-alert-issued-with-more-hosepipe-bans-on-the-way-13395321",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-yorkshire-reservoir_6962464.jpg?20250711101720",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-11 09:03:00",
        "Headline": "The alert comes as a hosepipe ban comes into force in Yorkshire, with further bans for parts of Kent and Sussex on the way.",
        "Content": " Heat health alerts across huge swathes of England have been upgraded to amber as the UK experiences its third heatwave of the summer. A yellow heat health alert - indicating people with pre-existing health conditions, and those aged over 65, could be at higher risk - had been issued for the whole of England by the UK Health Security Agency (UKHSA). But the alerts for the West and East Midlands, the South West, South East, the East of England and London have now been upgraded. It comes as a hosepipe ban comes into force in Yorkshire, with further bans for parts of Kent and Sussex on the way. An amber alert means services such as transport and health services could be impacted by the heat, and that there may be increased demand for power. Check the latest weather forecast here Temperatures could reach 32C in parts of central and southern England on Friday, with the heatwave expected to continue through the weekend. \n                  Third heatwave within a month could hit parts of UK, Met Office says\n                 \n                  UK weather: Forecast for July revealed - after England's warmest June on record\n                 \n                  Sunburn isn't just red skin - here's what's happening underneath the burn\n                 The alerts are in place until 9am on Monday. The Environment Agency has said England is experiencing its driest start to a year since 1976. Reservoir levels fell at nearly three-quarters of sites during June and are below average in all regions. Water storage at four sites is classed as \"exceptionally low\". These are Blagdon in Somerset (62%), Blithfield in Staffordshire (59%), Derwent Valley in Derbyshire (58%) and the Yorkshire Supply Group (55%). The agency added that rainfall in almost a third of the areas it monitors was classed as below normal in June, while one region - covering Leicester and its surrounding towns - saw \"notably low\" rainfall for the time of year. For England as a whole, June marked the fifth consecutive month of below average rainfall. North of England correspondent It's day one of a county-wide hosepipe ban in Yorkshire and customers at a garden centre in Bradford are furious.  Incredulity at not just the inconvenience the restrictions cause them, but the infrastructure they feel failed to prevent the situation.  \"Don't get me going,\" says one man wheeling compost through the greenhouse.  \"I think it's a bit crazy. I grow a lot of bonsai trees; it's hard watering them. It takes me a good couple of hours to water them, whereas before it'd be about 15 minutes.\" He then had a word for the nation's water companies.  \"It's the shareholders. They ought to nationalise water again.\" Another couple, also shopping for plants, make a comparison with Europe.  \"You go abroad and they're never short of water… never,\" she says, before he added: \"We've just been to Greece and it was 32, 33 [degrees] everyday.  \"They water the lawns, they water the flowers, is there a shortage of water there?\" In a play centre on the other side of a greenhouse, we spoke to grandparents looking after little ones as they darted in and out of ball pits and playpens. For one woman we spoke to, three heatwaves so far this summer and repeated droughts have prompted not fury, but some thoughts on the future.  \"We need to be aware of climate change and the changes we have to make in terms of how we live our lives she said.  \"How it affects your children, how it affects yourselves, and just how we take care of ourselves.\" Hosepipe ban starts The first hosepipe ban of the year has come into force in Yorkshire today - and more have been announced for other regions. Yorkshire Water has put restrictions in place across the region in a bid to protect dwindling water levels. They cover activities such as watering the garden, cleaning cars and filling paddling pools. Read more:What July's weather has in storeWhat you need to know about the hosepipe bans South East Water has also announced a hosepipe ban for the parts of Kent and Sussex it supplies. It said demand for drinking water has reached \"record levels since May\", adding: \"This situation has left us with no choice but to restrict the use of hose pipes and sprinklers, so we can help our reservoirs and underground water storage recover.\" \"If we don't put a hosepipe ban in place now, there's a really high risk of customers experiencing widespread issues such as low pressure or no water,\" it said. The ban will come into force on Monday 18 July. Customers who ignore the bans could face fines of up to £1,000."
    },
    {
        "title": "'My son died from a milk allergy at school - I want to make sure it never happens again'",
        "description": "The mother of a five-year-old boy who died after he was accidentally exposed to the wrong milk at school is calling for a new law to keep other children with allergies safe.",
        "url": "https://news.sky.com/story/my-son-died-from-a-milk-allergy-at-school-i-want-to-make-sure-it-never-happens-again-13395431",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-benedict-blythe_6962688.jpg?20250711140744",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-11 12:46:00",
        "Headline": "Benedict Blythe, a reception pupil, suffered fatal anaphylaxis after he was accidentally exposed to cow's milk protein during break time. Now his mother is campaigning to protect other children and families from suffering similar tragedies. ",
        "Content": "The mother of a five-year-old boy who died after he was accidentally exposed to the wrong milk at school is calling for a new law to keep other children with allergies safe. Benedict Blythe, a reception pupil at Barnack Primary School in Stamford, Lincolnshire, suffered fatal anaphylaxis after he was accidentally exposed to cow's milk protein, probably from his own cup during break time. An inquest into his death found the school's delay in giving him his EpiPen, a failure to share his allergy plan, and a failure to learn from a previous allergic reaction, all likely contributed to his death. Benedict died in December 2021, and the family have now waited more than three years for answers, with the inquest concluding this week. He had a number of allergies, including cow's milk protein, eggs, nuts and kiwi fruit. Benedict, who joined the high-IQ society Mensa at the age of four, loved school, his mother Helen told Sky News. \"He was ferociously intelligent,\" she said. \"He was doing Year Five maths when he had just started school.\" \n                  Robot performs realistic gallbladder surgery 'with 100% accuracy'\n                 \n                  Infected blood victims are 'waiting to die in limbo' - with hundreds still waiting for compensation\n                 \n                  Dates doctors will strike this summer announced\n                 He was also \"kind and considerate\", she said, describing how her son once spent his entire lunchtime helping a friend find a lost scooter. \"We walked into school one day and he noticed a child that looked a bit nervous, and said, I'll take you in, took his hand and walked him into school.\" She continued: \"That kind of calm, positive energy, that is always missing and we will never come across it again. It's a really hard thing to have lost.\" During break time, Benedict was to be served oat milk, which was stored in the staff fridge with his name on. The usual process was to take this into the classroom and pour it into his cup, handing it to him directly. But on the day of his death, his milk was poured in the staffroom and then taken into the classroom. It is not clear how the cross-contamination or mix-up of milk could have happened, but the foreperson of the jury at the inquest said: \"We deem the probable source of the allergen that caused the fatal anaphylaxis is the ingestion of cow's milk protein, most probably from his own receptacle during break time.\" Benedict vomited twice and lost consciousness before his adrenaline pen was administered. By the time he reached hospital, it was too late. Benedict was five years old when he died. Helen said the school had been told vomiting was \"always\" the first sign of an allergic reaction, but the pen was given too late to be effective. \"The advice is, if in doubt, don't delay,\" she said. \"The worst that will happen with giving adrenaline is that they will feel a bit ropey, but the risk of delaying it... probably even a minute earlier could have had an impact.\" A previous reaction This was the second time Benedict had an allergic reaction at school, having previously been sick while eating a pizza. And while she was keen to stress she did not blame individual staff members, the inquest found no allergy plan was created by the school, and there was no specific allergy policy when he started school. Staff responsible were also not privy to key information about Benedict's allergy. \"Benedict’s death was preventable and was caused by a cascade of failures - individual, institutional, and systemic,\" Helen said, shortly after the inquest returned its verdict. In a statement, Benedict's former school said: \"The only comment that Barnack Primary School wishes to make at this point in time, is to offer its sincere and heartfelt condolences to Benedict's family at the tragic loss of Benedict.\" Benedict's Law There is currently no legislation that exists to protect children with allergies, and so Helen is working to ensure no other children die at school from an allergy. \"Schools are left to interpret patchy, vague guidance and to carry life-or-death responsibility alone. This is unforgivable,\" she said. Following a campaign by the Benedict Blythe Foundation, set up in his memory, Redditch MP Chris Bloor presented the Schools (Allergy Safety) Bill, also known as Benedict's Law to parliament on 9 July. \"With an ever-growing number of children requiring allergy care, it has never been more vital that the place we entrust with the care of our children - the school where we drop them off every day - is a safe and secure environment, but too often it is not,\" he told the House of Commons. The law would require an allergy policy in every school, training for staff on how to identify reactions and deal with them, and spare adrenaline pens in every school. It is backed by more than 50 MPs, a petition signed by more than 10,000 members of the public. \"We've done a huge amount of research and kind of built a really strong evidence base for this, including kind of a way of delivering Benedict's Law so that it means it doesn't cost the government any money,\" Helen told Sky News. Most children with undiagnosed allergies have a reaction for the first time at school, she said. \"Humans will always make mistakes, but there has to be a system in the background that allows for that because at the moment it is left up to chance when things go wrong.\" A Department for Education spokesperson said what happened to Benedict was a tragedy. \"Our thoughts remain with all of those who loved him,\" they said. \"We recognise that allergies can be a barrier to children feeling safe and included at school, and are planning to consult on strengthened guidance for schools later this year.\""
    },
    {
        "title": "Fuel to engines of Air India plane that crashed cut off moments after take-off, report finds",
        "description": "Fuel to the engines of the Air India plane that crashed last month appears to have cut off shortly after take-off, a preliminary report has found.",
        "url": "https://news.sky.com/story/fuel-to-engines-of-air-india-plane-cut-off-moments-before-crash-preliminary-report-finds-13395620",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ahmedabad-plane-crash_6944966.jpg?20250618101311",
        "type": "World",
        "Author": "Samuel Osborne",
        "Date Published": "2025-07-11 19:57:00",
        "Headline": "There was also confusion in the cockpit. In the voice recording, one of the pilots is heard asking the other why he \"cut off\". The other pilot responds that he did not do so.",
        "Content": "\n          News reporter\n              @samuelosborne93\n Fuel to the engines of the Air India plane that crashed last month appears to have cut off shortly after take-off, a preliminary report has found. According to the report by India's Aircraft Accident Investigation Bureau (AAIB), switches in the Boeing 787 Dreamliner's cockpit that controlled fuel moved to a \"CUTOFF\" position. It said: \"Engine 1 and Engine 2 fuel cutoff switches transitioned from RUN to CUTOFF position one after another with a time gap of one second. \"The Engine N1 and N2 began to decrease from their take-off values as the fuel supply to the engines was cut off.\" There was then confusion in the cockpit. In the voice recording, one of the pilots is heard asking the other why he \"cut off\". The other pilot responds that he did not do so. The 15-page report did not identify which comments were made by the flight's captain and which were made by the first officer. One of the pilots made a \"mayday, mayday, mayday\" call just before the crash. Both pilots were experienced, with around 19,000 flying hours between them, including more than 9,000 on the 787. Flipping to cutoff almost immediately cuts the engines, and is most often used to turn the engines off once a plane has arrived at its airport gate and in certain emergency situations, such as an engine fire - though both switches together are rarely used simultaneously. The report does not indicate there was any emergency requiring an engine cutoff. It also does not give a conclusion as to how the switches moved. However, aviation expert David Learmount told Sky News \"it sounds deliberate\", but also noted \"there are cases of pilots carrying out an incorrect action instead of what they should be doing\". Mr Learmount said the only action the pilots needed to conduct at the time was retracting the plane's undercarriage, but this was not done. He added: \"Was that it? These switches are nowhere near the undercarriage lever and look totally different. The fuel switches cannot be turned on or off by mistake. They have to be pulled out before selecting up (run) or down (cut off).\" Similarly, Tim Atkinson, a pilot and aviation consultant, told Sky News' Gillian Joseph \"there are very few situations or circumstances which would explain this\". He explained: \"One would be an utterly extraordinary human error, an unintentional act, and the other - I'm very sorry to say - would be an intentional act. And that's not a suggestion or allegation, it's simply an analysis of the small amount of information that we have at hand at this moment.\" One of the engines was able to be restarted, but could not reverse the plane's deceleration, the report found. India's AAIB said in its report: \"At this stage of investigation, there are no recommended actions to Boeing 787-8 and/or GE GEnx-1B engine operators and manufacturers.\" No significant bird activity was observed in the vicinity of the plane's flight path, the report said. The aircraft started to lose altitude before crossing the airport perimeter wall, it added. The plane plummeted into a busy area, killing 241 passengers and 19 others on the ground while incinerating everything around it. The plane's two black boxes, which combined cockpit voice recorders and flight data recorders, were recovered in the days after the crash. They provide vital data such as altitude, airspeed and final pilot conversations, which can help narrow down the possible causes behind a crash. The AAIB's report is based on the initial findings of the probe, marking 30 days since the crash. It said the investigation is continuing. A final report is expected within a year."
    },
    {
        "title": "'At least 798 killed' at Gaza aid points - as medical charity warns acute malnutrition at all-time high",
        "description": "At least 798 people in Gaza have reportedly been killed while receiving aid in the past six weeks - while acute malnutrition is said to have reached an all-time high.",
        "url": "https://news.sky.com/story/at-least-798-killed-at-gaza-aid-points-as-medical-charity-says-malnutrition-at-new-high-13395360",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-aid_6957523.jpg?20250705015000",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-11 10:07:00",
        "Headline": "The UN human rights office says the majority of the deaths took place near aid distribution centres run by the Israel and US-backed Gaza Humanitarian Foundation.",
        "Content": "At least 798 people in Gaza have reportedly been killed while receiving aid in the past six weeks - while acute malnutrition is said to have reached an all-time high. The UN human rights office said 615 of the deaths - between 27 May and 7 July - were \"in the vicinity\" of sites run by the controversial US and Israel-backed Gaza Humanitarian Foundation (GHF). A further 183 people killed were \"presumably on the route of aid convoys,\" said Ravina Shamdasani, from the Office of the UN High Commissioner for Human Rights. Its figures are based on a range of sources, including hospitals, cemeteries, and families in the Gaza Strip, as well as non-governmental organisations (NGOs), its partners on the ground, and Hamas-run health authorities. Aid agency Project Hope said on Thursday that 10 children were among at least 15 people killed as they waited for its clinic in Deir al Balah to open. The GHF has claimed the UN figures are \"false and misleading\" and has repeatedly denied any violence at or around its sites. Meanwhile, Medecins Sans Frontieres (MSF) - also known as Doctors Without Borders - said two of its sites were seeing their worst-ever levels of severe malnutrition. Cases at its Gaza City clinic are said to have tripled from 293 in May to 983 in early July. \"Over 700 pregnant or breastfeeding women and nearly 500 children are now receiving emergency nutritional care,\" MSF said. The humanitarian medical charity said food prices were at extreme levels, with sugar at $766 (£567) per kilo and flour $30 (£22) per kilo, and many families surviving on one meal of rice or lentils a day. It's a major concern for the estimated 55,000 pregnant women in Gaza, who risk miscarriage, stillbirth and malnourished infants because of the shortages. The GHF began distributing food packages in Gaza at the end of May, after Israel eased its 11-week blockade of aid into the coastal territory.  It has four distribution centres, three of which are in the southern Gaza Strip. The sites, kept off-limits to independent media, are guarded by private security contractors and located in zones where the Israeli military operates. Palestinian witnesses say Israeli forces have repeatedly opened fire towards crowds of people going to receive aid. The Israeli military says it has fired warning shots at people who have behaved in what it says is a suspicious manner. It says its forces operate near the aid sites to stop supplies from falling into the hands of militants. Read more:GHF aid distribution linked to increased deathsGaza situation 'apocalyptic', says UN expert  After the deaths of hundreds of Palestinians trying to reach the aid hubs, the United Nations has called the GHF's aid model \"inherently unsafe\" and a violation of humanitarian impartiality standards. In response, a GHF spokesperson said: \"The fact is the most deadly attacks on aid sites have been linked to UN convoys.\" The GHF says it has delivered more than 70 million meals to Gazans in five weeks and claims other humanitarian groups had \"nearly all of their aid looted\" by Hamas or criminal gangs."
    },
    {
        "title": "Liverpool retires number 20 shirt at all levels in honour of Diogo Jota",
        "description": "Liverpool have retired the number 20 shirt in honour of Diogo Jota - the first time it has made such a gesture.",
        "url": "https://news.sky.com/story/liverpool-to-retire-number-20-shirt-at-all-levels-in-honour-of-diogo-jota-13395596",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jota-liverpool-jota_6963010.jpg?20250711202245",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-11 19:20:00",
        "Headline": "Jota's teammates joined members of his family, including his wife Rute, to view the huge memorial site outside Anfield on Friday.",
        "Content": "Liverpool have retired the number 20 shirt in honour of Diogo Jota - the first time it has made such a gesture. The club said it was a \"unique tribute to a uniquely wonderful person\" and the decision was made in consultation with his wife and family. The number 20 will be retired at all levels, including the men's and women's first teams and academy squads. A statement said: \"It was the number he wore with pride and distinction, leading us to countless victories in the process - and Diogo Jota will forever be Liverpool Football Club's number 20.\" The club called it a \"recognition of not only the immeasurable contribution our lad from Portugal made to the Reds' on-pitch successes over the last five years, but also the profound personal impact he had on his teammates, colleagues and supporters and the everlasting connections he built with them\". Newly-married Jota died alongside his brother when his Lamborghini crashed in northern Spain on 3 July. Police said this week that all the evidence so far suggests Jota was the one driving the vehicle. Liverpool teammates joined members of Jota's family, including his wife Rute, at a huge memorial site outside Anfield on Friday. Read more from Sky News:Mystery in space is most likely 'oldest comet ever seen'Trump may be denied privilege of addressing parliament The star's funeral took place last weekend, with Liverpool colleagues and members of the Portuguese national team in attendance. Reds captain Virgil van Dijk carried a shirt bearing the number 20 made from flowers. Liverpool players returned to the club's training ground for the start of pre-season on Tuesday. Their first game since Jota's death will be on Sunday when they play a friendly away against Preston North End."
    },
    {
        "title": "Fear and mistrust in Chinese town where more than 200 children poisoned by lead in their food",
        "description": "Taped doors and quiet rooms tell a story about what happened at Heshi Peixin kindergarten. ",
        "url": "https://news.sky.com/story/fear-and-mistrust-in-chinese-town-where-more-than-200-children-poisoned-by-lead-in-their-food-13395630",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-china-lead-kindergarten_6963085.jpg?20250711221900",
        "type": "World",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-07-11 20:41:00",
        "Headline": "Most families are seeking treatment in major cities after tests at a local hospital returned tests at much lower levels than at other facilities.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n  Taped doors and quiet rooms tell a story about what happened at Heshi Peixin kindergarten.  A huge scandal in a tiny town, a barely believable failing, in a place where children should have been safe. As soon as we arrive in the northwestern Chinese town of Maiji, it is clear that almost everyone knows someone who has been impacted. After multiple children were found to have high levels of lead in their blood, police say staff at the private kindergarten had been adding paint powder to food in an apparent bid to make it look more appealing. A total of 233 of the 251 children had unhealthy levels and 201 needed to be hospitalised, say local authorities. Two food samples were seized and both had lead levels 2000 times the legal safe limit. Eight people have been arrested, including the principal and the kindergarten's financial backer. On one street in this town, a series of shops sell clothes and goods for babies and toddlers. The women who work there all knew the principal and many of the families affected. One even used to work there. They tell us how distressing it's been for the community. One lady whispers with tears in her eyes about how a neighbour's child was found to have lead in her blood at 38 times the normal level. Lead poisoning at this level could cause long term injuries for the brain and the central nervous system. What surprises us is how the kindergarten and its staff are by far the sole focus of their anger. In fact more than one person speaks fondly of the principal, citing her extensive charity work and dedication to children. There might have been huge failings at Heshi Peixin, but here they clearly feel there are failings in the system too. Indeed, most affected families have chosen to leave here to seek treatment in major cities, mainly in Xi'an, the closest major city, which is a four-hour drive away. We are told multiple times that the local hospital returned tests for lead showing much lower levels than at the bigger hospitals. 'This is a cover up' On the street corners, it's all they are discussing, tapping into veins of distrust. \"I don't know much, but I think this is a cover up,\" says one woman who we meet at the side of the road. \"I just think local government is too dark, they suppress the news.\" Another young mother talks about how she lived just around the corner from the kindergarten. \"Who will be willing to have children? Who dares to send the children to kindergarten?\" she asks. \"Now if people send children to primary school, the first thing they ask is are you safe? Is the school safe? Can it guarantee the personal safety of our children in the future, right?\" There is no clear evidence of a cover-up, but it's telling that it's what people expect. There is clear anxiety about the fact we are here. The police intercept us and hold us up for over an hour. And perhaps that is no surprise because in China a history of food safety scandals is a sore point. Read more from Sky News:Air India crash preliminary report released'At least 798 killed' at Gaza aid points Cooking oil was last year found to be being transported in containers used for fuel without proper cleaning in between. And most famously, in 2008, milk powder laced with the chemical melamine, left six children dead and hundreds of thousands unwell. Food scandals here are a source of real rage and resentment, dangerous things for a government that people cannot choose. Cases like this are just a glimpse into how deep that frustration can run."
    },
    {
        "title": "Backpacker missing in Australian Outback for almost two weeks found alive",
        "description": "Missing German backpacker Carolina Wilga has been found alive almost two weeks after disappearing in the Australian Outback.",
        "url": "https://news.sky.com/story/carolina-wilga-fears-for-backpacker-missing-in-outback-as-aircraft-joins-search-13395285",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-carolina-wilga_6962401.png?20250711092345",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-11 07:43:00",
        "Headline": "Ms Wilga has been travelling in Australia for two years and working at Western Australian mine sites.",
        "Content": "Missing German backpacker Carolina Wilga has been found alive almost two weeks after disappearing in the Australian Outback. Police confirmed Ms Wilga had been found \"safe and well\" on Friday, according to Sky News Australia. It comes after a major search was launched for the 26-year-old. On Thursday, Ms Wilga's van was discovered in wilderness in the Karroun Hill Nature Reserve around 100km (60 miles) north of Beacon - the town where the backpacker was last seen at a general store on 29 June. Police believed the backpacker became lost in the 300,000-hectare reserve after her van broke down. Beacon, a wheat farming town 320km (200 miles) northeast of the Western Australia (WA) state capital Perth, is in the remote Wheatbelt region and had a population of 123 at the time of the 2021 census. Western Australia Police Force Acting Inspector Jessica Securo said: \"The terrain is outback country and there's large rocky outcrops. Although there's a number of tracks, you can see how it would be easy to become lost or disorientated in that area if you didn't know it well.\" \n                  Fuel to engines of Air India plane that crashed cut off moments after take-off, report finds\n                 \n                  'At least 798 killed' at Gaza aid points - as medical charity warns acute malnutrition at all-time high\n                 \n                  Liverpool retires number 20 shirt at all levels in honour of Diogo Jota\n                 Read more from Sky News:Ten children 'killed waiting for Gaza health clinic to open'Four killed after Houthi rebels sink ship Ms Wilga's van, a 1995 Mitsubishi Delica Star Wagon, was 35 kilometres (22 miles) from any major tracks, the police inspector added. Ms Wilga has been travelling in Australia for two years and working at Western Australian mine sites. Her mother Katja Will, who lives in the city of Castrop-Rauxel in the German state of North Rhine-Westphalia, had appealed for public help to find her daughter."
    },
    {
        "title": "Kurdish fighters burn weapons in significant step towards peace with Turkey",
        "description": "Fighters from the Kurdish Workers' Party (PKK) have burned their weapons at a cave entrance as part of a peace process to end its decades-long insurgency in Turkey.",
        "url": "https://news.sky.com/story/kurdish-fighters-burn-weapons-in-significant-step-towards-peace-with-turkey-13395400",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sulaimaniya-iraq-weapons_6962611.jpg?20250711125412",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-11 11:38:00",
        "Headline": "The move comes after the leader of the Kurdistan Workers' Party (PKK) urged his group to formally disband and disarm.",
        "Content": "Fighters from the Kurdish Workers' Party (PKK) have burned their weapons at a cave entrance as part of a peace process to end its decades-long insurgency in Turkey. The symbolic ceremony in northern Iraq was a significant step in the disarmament of the PKK which is due to be completed by September. It comes after PKK leader Abdullah Ocalan, who has been imprisoned on an island near Istanbul since 1999, urged his group in February to convene a congress and formally disband and disarm. Mr Ocalan renewed his call in a video message broadcast on Wednesday, saying: \"I believe in the power of politics and social peace, not weapons.\" Turkish nationalist politician Devlet Bahceli, an ally of the country's president Recep Tayyip Erdogan, surprised everyone in October when he suggested in parliament that Mr Ocalan could be granted parole if he renounced violence and disbanded the PKK. The separatist group launched its insurgency in southeastern Turkey in 1984 with the initial aim of creating an independent Kurdish state. The four-decade conflict has left more than 40,000 people dead, imposed a huge economic burden and fuelled social tensions. \n                  Wildfires break out in Turkey, Syria and Greece - with towns near Athens evacuated\n                 \n                  Ex-lawyer fighting extradition 'over Tottenham Turks gang boss murder fears revenge attack'\n                 \n                  Kurdish militant group PKK announces it is disbanding - after four decades of armed conflict\n                 Footage from the disarming ceremony showed 30 PKK fighters, half of them women, queuing to place AK-47 assault rifles, bandoliers and other guns into a large grey cauldron. Flames later engulfed the weapons that were pointing into the air. The fighters, in beige military fatigues, were flanked by four commanders including senior PKK figure Bese Hozat, who read a statement in Turkish declaring the group's decision to disarm. \"We voluntarily destroy our weapons, in your presence, as a step of goodwill and determination,\" she said, before another commander read the same statement in Kurdish. It is unclear when the PKK will lay down further weapons. The ceremony was held at the entrance of the Jasana cave in the town of Dukan, more than 30 miles northwest of Sulaymaniyah in the semiautonomous Kurdistan region of Iraq's north. It was attended by Turkish and Iraqi intelligence figures, officials of Iraq's Kurdistan regional government, and senior members of Turkey's pro-Kurdish DEM party - which has also played a key role in facilitating the PKK's disarmament decision. Read more:PKK announces it is disbandingSyria signs breakthrough deal with Kurdish-led forces By Fazel Hawramy, Sky News producer who was at the ceremony A helicopter flew overhead as 15 male and 15 female fighters in their Kurdish baggy military fatigue descended from Jasana cave and laid down their arms in front of around 300 guests. One female Kurdish commander described the event as \"a step of goodwill and determination\", adding that the group has heeded the call from Abdullah Ocalan to disarm voluntarily. Then guns - including AK-47s and Russian sniper rifles - were placed on a cauldron and a female fighter set them on fire. The flames burnt in the gorge and the fighters shouted \"long live Abdullah Ocalan\" as they retreated into the cave. Despite being a historic turning point, it was a bittersweet experience for many present in the audience. Former Kurdish parliamentarian Leyla Zana watched the event and sobbed as she chain-smoked a pack of cigarettes. Ms Zana had called for peace in 1994 between Kurds and Turks from the pulpit of the Turkish parliament when she took her oath as the first Kurdish female MP. Instead of heeding her call for peace, the state decided to imprison her for 10 years. \"We have done our part, now the Turkish government needs to deliver on its promises,\" said a former PKK fighter who attended the ceremony. Another attendee said he was positive about the process, adding the ceremony was a testament to the progress made. The peace process in Turkey has coincided with monumental changes in the wider Middle East, where Turkey has become an increasingly assertive player, particularly in neighbouring Syria where there is increasing pressure on Kurdish groups there to disarm. Turkey's military has carried out regular strikes on PKK bases in northern Iraq as part of its efforts to end the insurgency. However, it's the new initiative that could pave the way for peace. A senior Turkish official said the disarming ceremony marked an \"irreversible turning point\" in the peace process, while another government source said the next steps would include the legal reintegration of PKK members into society in Turkey and efforts to heal communities and promote reconciliation. The PKK, DEM and Mr Ocalan have all called on President Erdogan's government to address Kurdish demands for more rights in regions where Kurds form a majority, particularly Turkey's southeast where the insurgency was concentrated. The Turkish state has historically restricted Kurdish language use and cultural expression, pursuing policies aimed at assimilating Kurds into a singular Turkish identity, according to the Council on Foreign Relations thinktank. In a rare online video published on Wednesday, Mr Ocalan - whose large image was shown at the weapons ceremony - urged Turkey's parliament to set up a commission to oversee disarmament and manage the broader peace process. Turkey has taken steps towards forming the commission, while the DEM and Mr Ocalan have said that legal assurances and certain mechanisms were needed to smooth the PKK's transition into democratic politics. Omer Celik, spokesman for Mr Erdogan's AK Party, said the ceremony marked a first step toward full disarmament and a \"terror-free Turkey\", adding this must be completed \"in a short time\". President Erdogan has said the disarmament will enable the rebuilding of Turkey's southeast. Turkey spent nearly $1.8trn over the past five decades combating terrorism, finance minister Mehmet Simsek has said."
    },
    {
        "title": "Mystery discovery in space is most likely the 'oldest comet ever seen', say researchers",
        "description": "A mystery interstellar object discovered by British astronomers is most likely the oldest comet ever seen.",
        "url": "https://news.sky.com/story/mystery-discovery-in-space-is-most-likely-the-oldest-comet-ever-seen-say-researchers-13395445",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-comet-stars_6962732.png?20250711145006",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-11 13:33:00",
        "Headline": "The object seems to be travelling on a steep path - suggesting it came from the Milky Way's \"thick disk\", an area of ancient stars that orbits above and below the thin plane where most stars reside.",
        "Content": "A mystery interstellar object discovered by British astronomers is most likely the oldest comet ever seen. The \"water ice-rich\" visitor, which has been given the name 3I/ATLAS, is the first object to reach us from a completely different region of our galaxy, researchers have said. Just two other objects have entered our solar system from elsewhere. Unlike its predecessors, 3I/ATLAS seems to be travelling on a steep path that suggests it came from the Milky Way's \"thick disk\", an area of ancient stars that orbits above and below the thin plane where most stars reside. University of Oxford astronomer Matthew Hopkins explained: \"All non-interstellar comets such as Halley's Comet formed with our solar system, so are up to 4.5 billion years old. \"But interstellar visitors have the potential to be far older, and of those known about so far our statistical method suggests that 3I/ATLAS is very likely to be the oldest comet we have ever seen.\" 3I/ATLAS could be about three billion years older than our solar system. \n                  Stunning first images from powerful space telescope show new 'peek of cosmos'\n                 \n                  Artificial solar eclipse created by 'driverless' spacecraft in world first\n                 \n                  Europe's first rover to land on moon - and it's carrying a tiny red house\n                 It was first spotted on 1 July 2025 by the ATLAS survey telescope in Chile, when it was roughly 670 million kilometres from the sun. Earth is 149 million km away from the sun. Professor Chris Lintott, the co-author of the study, said: \"This is an object from a part of the galaxy we've never seen up close before. \"We think there's a two-thirds chance this comet is older than the solar system, and that it's been drifting through interstellar space ever since.\" Read more from Sky News:Bacteria with 'unique ability' found on space stationWhy do the moons two sides look so different? As 3I/ATLAS gets closer to the sun, sunlight will heat its surface and trigger the outgassing of vapour dust that creates a comet's glowing tail. Members of the public could be able to catch a glimpse of 3I/ATLAS in the coming months, as researchers say it should be visible through reasonably-sized amateur telescopes in late 2025 and early 2026."
    },
    {
        "title": "Sudan: War crimes and crimes against humanity taking place, International Criminal Court believes",
        "description": "The International Criminal Court (ICC) believes war crimes and crimes against humanity are taking place in Sudan, where civil war has raged for more than two years.",
        "url": "https://news.sky.com/story/sudan-war-crimes-and-crimes-against-humanity-taking-place-international-criminal-court-believes-13395279",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-darfur-rsf_6962383.jpg?20250711090508",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-11 07:38:00",
        "Headline": "The ICC has said the situation in Darfur, where some 40,000 people have been killed and almost 13 million displaced,  \"has reached an intolerable state\".",
        "Content": "The International Criminal Court (ICC) believes war crimes and crimes against humanity are taking place in Sudan, where civil war has raged for more than two years. The tribunal's deputy prosecutor has told the UN Security Council that the humanitarian crisis and depth of suffering in the country's western Darfur region \"has reached an intolerable state\". Nazhat Shameem Khan said: \"People are being deprived of water and food. \"Rape and sexual violence are being weaponised. Abductions for ransom or to bolster the ranks of armed groups have become common practice.\" \"And yet we should not be under any illusion,\" she told the UN's most powerful body. \"Things can still get worse.\" The war in Sudan began in April 2023, when long-simmering tensions between the Sudanese army and paramilitary forces broke out in the capital, Khartoum. The conflict soon spread to other regions, including Darfur, and some 40,000 people have been killed and almost 13 million displaced, according to UN agencies. \n                  Five killed and several injured after attack on UN aid convoy in Sudan\n                 \n                  Sudan's war is in a dangerous new phase - can its new prime minister provide a steer for civilians?\n                 \n                  Sudan's paramilitary launches drone attacks on wartime capital\n                 Ms Khan said the ICC has been closely tracking the dire situation in North Darfur in recent weeks. The region's capital, El Fasher, has been besieged by the paramilitary Rapid Support Forces (RSF) and affiliated groups. The RSF, which controls the capitals of all other states in Darfur, has also attacked famine-hit Zamzam and other camps for displaced Sudanese in North Darfur. Ms Khan said: \"On the basis of our independent investigations, the position of our office is clear, we have reasonable grounds to believe that war crimes and crimes against humanity have been and are continuing to be committed in Darfur.\" Read more:Sudanese man reunites with family after two yearsFive killed in attack on UN aid convoy  The conclusion is based on documentary, testimonial and digital evidence collected by ICC investigations over the last six months and over 7,000 items of evidence collected to date, she added. Ms Khan emphasised that the ICC considers the situation in Darfur \"of the utmost importance\" and said it will not be deterred until justice is delivered to the perpetrators.  Darfur became synonymous with genocide and war crimes two decades ago, particularly by the notorious Janjaweed Arab militias. Up to 300,000 people were killed and 2.7 million were driven out of their homes. Ms Khan said those now \"inflicting unimaginable atrocities on [Darfur's] population\" should know Janjaweed leader Ali Kushayb is currently on trial and the ICC hopes it will be the first of many."
    },
    {
        "title": "Preliminary report into Air India crash submitted to authorities - but may not be made public",
        "description": "A preliminary report into the doomed Air India Flight 171 that crashed moments after take off has been submitted to Indian authorities - but there is currently no obligation to make it public.",
        "url": "https://news.sky.com/story/preliminary-report-into-air-india-crash-submitted-to-authorities-but-may-not-be-made-public-13395327",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ahmedabad-plane-crash_6944966.jpg?20250618101311",
        "type": "World",
        "Author": "Neville Lazarus",
        "Date Published": "2025-07-11 09:18:00",
        "Headline": "The flight plummeted into a busy area, killing 241 passengers and 19 others on the ground while incinerating everything around it.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n A preliminary report into the doomed Air India Flight 171 that crashed moments after take off has been submitted to Indian authorities - but there is currently no obligation to make it public. The report has been filed by the Aircraft Accident Investigation Bureau (AAIB) and is based on the initial findings of the probe, marking 30 days since the crash. Aviation experts stress the preliminary report would unlikely go into the causes of the crash but would indicate steps investigators are following, notable findings, the sequence of events and available evidence. Video footage of the flight from Ahmedabad to London Gatwick showed the aircraft unable to maintain thrust soon after take-off and could not climb over 625 feet in altitude. It plummeted into a busy area, killing 241 passengers and 19 others on the ground while incinerating everything around it. Of the 53 British nationals on board only one passenger - Vishwas Kumar Prakash, seated on 11A - miraculously escaped when the aircraft broke up after it slammed into a building. According to guidelines from the International Civil Aviation Organisation (ICAO), investigators should release a preliminary report within a month of the accident. \n                  Fuel to engines of Air India plane that crashed cut off moments after take-off, report finds\n                 \n                  'At least 798 killed' at Gaza aid points - as medical charity warns acute malnutrition at all-time high\n                 \n                  Liverpool retires number 20 shirt at all levels in honour of Diogo Jota\n                 But there is currently no obligation for India's Civil Aviation Authority to make the report public. In the 2020 Calicut Air India Express crash that killed 21 people Indian Authorities did not release the preliminary report. Given the nature of the tragedy involving dozens of foreign citizens and the global spotlight of the accident there will be pressure and expectations to release it. Read more:How are investigators looking into the Air India crash - and how long could they take? Because an aircraft accident investigation is solely carried out to learn lessons and prevent a repeat incident, it does not apportion blame or trace culprits, so most countries release their preliminary findings. Indonesia released its report on its Lion Air Boeing 737 MAX crash in 2018, that killed all 189 on board, within a month. Aviation investigations are often exceptionally complex, painstaking, time-consuming and the final report could take many months or a year to conclude. 👉 Listen to Sky News Daily on your podcast app 👈 Captain Amit Singh, founder of Safety Matters Foundation, an NGO dedicated to aviation safety, told Sky News accidents in aviation are \"rarely isolated events\". \"They are the result of a chain of overlooked warnings, normalised deviance, and systemic complacency,\" he said. India's aviation sector is one of the fastest growing in the world, clocking over 10% growth a year since 2011, excluding the COVID years. It's the third-largest air transport market behind the United States and China. Data from India's Civil Aviation Ministry show there are around 6,900 domestic and international flights that carry more than a million passengers daily. In 2023 the industry generated US $53.6bn (£39.6bn), contributing 1.5% of the country's GDP and employing almost eight million people.  While the number of reported near misses is decreasing every year, the industry faces challenges in maintaining safety standards. Within 36 hours of the AI171 crash, four other separate in-flight emergencies were reported. India lacks an autonomous body or an ombudsman like the UK Civil Aviation Authority that can look into safety measures, maintenance practices, improved air traffic management and regulatory oversight into systemic issues. AI171 was 'inevitable' Air India was bought in 2022 by the Tata Group - one of the most respected Indian conglomerates that makes everything from salt to software to Jaguar and Land Rover.  But the crash has dealt a serious blow to its image amid the group's efforts to modernise the airlines. Read more:What is Air India's safety record? Captain Singh said: \"the Tata Group, inherited a legacy riddled with systemic issues, ranging from outdated procedures to an entrenched bureaucratic safety culture\"."
    },
    {
        "title": "Donald Trump plans to hit Canada with new tariff - while warning of blanket hike for other countries",
        "description": "Donald Trump has said he plans to hit Canada with a 35% tariff on imported goods, as he warned of a blanket 15 or 20% hike for most other countries.",
        "url": "https://news.sky.com/story/donald-trump-plans-to-hit-canada-with-new-tariff-while-warning-of-blanket-hike-for-other-countries-13395231",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-tariffs_6962294.jpg?20250711045308",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-11 03:16:00",
        "Headline": "The US president also teased a \"major statement\" he will make on Russia over its war with Ukraine.",
        "Content": "Donald Trump has said he plans to hit Canada with a 35% tariff on imported goods, as he warned of a blanket 15 or 20% hike for most other countries. In a letter to Canadian Prime Minister Mark Carney, the US president wrote: \"I must mention that the flow of Fentanyl is hardly the only challenge we have with Canada, which has many Tariff, and Non-Tariff, Policies and Trade Barriers.\" Mr Trump's tariffs were allegedly an effort to get Canada to crack down on fentanyl smuggling, and the US president has expressed frustration with Canada's trade deficit with the US. In a statement Mr Carney said: \"Throughout the current trade negotiations with the United States, the Canadian government has steadfastly defended our workers and businesses. We will continue to do so as we work towards the revised deadline of August 1.\" He added: \"Canada has made vital progress to stop the scourge of fentanyl in North America. We are committed to continuing to work with the United States to save lives and protect communities in both our countries.\" Mr Trump has sent a series of tariff letters to 23 countries so far, including one putting a 50% tariff on Brazil in part for the ongoing trial of its former president Jair Bolsonaro for trying to stay in office after he lost the election in 2022. Mr Trump was similarly indicted for his efforts to overturn his election loss in 2020. The higher rates would go into effect on 1 August. Shortly after Mr Trump unveiled his \"Liberation Day\" tariffs on 2 April, there was a huge sell-off on the financial markets. The US president later announced a 90-day negotiating period, during which a 10% baseline tariff would be charged on most imported goods. 👉 Follow Trump100 on your podcast app 👈 But in an interview with Sky News's partner network NBC News, Mr Trump said he plans to impose higher blanket tariffs on most US trade partners. \"We're just going to say all of the remaining countries are going to pay, whether it's 20% or 15%. We'll work that out now,\" he said. He added: \"I think the tariffs have been very well-received. The stock market hit a new high today.\" The US and UK signed a trade deal in June, with the US president calling it \"a fair deal for both\" and saying it will \"produce a lot of jobs, a lot of income\". Sir Keir Starmer said the document \"implements\" the deal to cut tariffs on cars and aerospace, adding: \"So this is a very good day for both of our countries - a real sign of strength.\" Read more:Trump fires tariff threats at more nations as EU 'ready'Palestinian activist detained by ICE suing Trump administration The US president also teased a \"major statement\" he will make on Russia over its war with Ukraine. \"I'm disappointed in Russia, but we'll see what happens over the next couple of weeks,\" he said. \"I think I'll have a major statement to make on Russia on Monday.\" It comes as Russia's deputy foreign minister, Sergei Ryabkov, said a new round of talks between Moscow and Washington on bilateral problems could take place before the end of the summer."
    },
    {
        "title": "Trump's trade war gets personal",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈 </a>",
        "url": "https://news.sky.com/story/trumps-trade-war-gets-personal-13395217",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump100-podcasts_6901216.png?20250430053042",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-11 03:55:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈  Benjamin Netanyahu has left Donald Trump in Washington with no Gaza ceasefire deal agreed. Was the visit a failure in efforts for peace in the Middle East? And Trump teases a major announcement on Russia after his secretary of state Marco Rubio and Russia's foreign minister Sergei Lavrov meet on the sidelines of a conference in Malaysia. If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk. You can also watch all episodes on our YouTube channel."
    },
    {
        "title": "Chris Brown: R&B singer denies further charges following alleged bottle attack in London club",
        "description": "R&B singer Chris Brown has denied further charges following an alleged bottle attack in a London nightclub.",
        "url": "https://news.sky.com/story/chris-brown-appears-in-court-following-alleged-bottle-attack-13395246",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-chris-brown-court_6962370.jpg?20250711084257",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-11 05:46:00",
        "Headline": "During a hearing at Southwark Crown Court, the US musician denied assault occasioning actual bodily harm to Abraham Diaw. Brown also denied one count of having an offensive weapon - a bottle - in a public place.",
        "Content": " R&B singer Chris Brown has denied further charges following an alleged bottle attack in a London nightclub. The 36-year-old pleaded not guilty to assault occasioning actual bodily harm (ABH) to music producer Abraham Diaw, during a hearing at Southwark Crown Court on Friday. Brown also denied one count of having an offensive weapon - a bottle - in a public place. The Grammy-winning US musician last month pleaded not guilty to a more serious charge of attempting to cause grievous bodily harm (GBH) with intent to Mr Diaw. The attack allegedly happened at the Tape venue, a private members' club in Hanover Square, Mayfair, on 19 February 2023. The plea hearing is part of preparations for his five to seven-day trial, which is due to take place from 26 October 2026. Brown's co-defendant, US national Omololu Akinlolu, 39, on Friday pleaded not guilty to a charge of assaulting Mr Diaw occasioning him actual bodily harm. \n                  Chris Brown released on bail - but must pay £5m security fee\n                 \n                  Rapper charged with GBH - after singer Chris Brown remanded in custody over 'bottle attack'\n                 \n                  Chris Brown arrested over alleged bottle attack\n                 Akinlolu, a rapper who goes by the name Hoody Baby, has previously pleaded not guilty to attempting to cause grievous bodily harm. The defendants sat side-by-side in the dock, looking straight ahead during the hearing in London. Around 20 fans sat in the public gallery behind the dock for Friday's hearing, with several gasping as Brown walked into the courtroom. The Go Crazy singer was able to continue with his scheduled international tour after he was freed on conditional bail in May. He had to pay a £5m security fee to the court as part of the bail agreement, which is a financial guarantee to ensure a defendant returns to court and may be forfeited if they breach bail conditions. Read more:Chris Brown posts message after being released on bail Mr Diaw was standing at the bar of the Tape nightclub when he was struck several times with a bottle, and then pursued to a separate area of the venue where he was punched and kicked repeatedly, Manchester Magistrates' Court previously heard. Brown was arrested at Manchester's Lowry Hotel at 2am on 15 May by detectives from the Metropolitan Police. He is said to have flown into Manchester Airport on a private jet in preparation for the UK tour dates. Brown was released from HMP Forest Bank in Salford, Greater Manchester, on 21 May. The singer, who rose to stardom as a teenager in 2005, won his first Grammy award for best R&B album in 2011 for F.A.M.E.. He earned his second in the same category for 11:11 (Deluxe) earlier this year."
    },
    {
        "title": "UK economy figures not as bad as they look despite GDP fall, analysts say",
        "description": "The UK economy unexpectedly shrank in May, even after the worst of Donald Trump's tariffs were paused, official figures showed.",
        "url": "https://news.sky.com/story/uk-economy-shrinks-for-second-month-in-a-row-13395239",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ill-calculator-cost-of-living_6872523.png?20250331211936",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-11 05:00:00",
        "Headline": "The data is a blow to the chancellor and government, as they made growing the economy a number one priority. However, there was a bright spot.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The UK economy unexpectedly shrank in May, even after the worst of Donald Trump's tariffs were paused, official figures showed. A standard measure of economic growth, gross domestic product (GDP), contracted 0.1% in May, according to the Office for National Statistics (ONS). Rather than a fall being anticipated, growth of 0.1% was forecast by economists polled by Reuters as big falls in production and construction were seen. It followed a 0.3% contraction in April, when Mr Trump announced his country-specific tariffs and sparked a global trade war. A 90-day pause on these import taxes, which has been extended, allowed more normality to resume. This was borne out by other figures released by the ONS on Friday. Exports to the United States rose £300m but \"remained relatively low\" following a \"substantial decrease\" in April, the data said.  \n                  Greater risk to UK economy following Trump's tariffs, says Bank of England\n                 \n                  Public finances in 'relatively vulnerable position', OBR warns\n                 \n                  Government declines to rule out wealth tax after ex-Labour leader Lord Kinnock calls for one\n                 Overall, there was a \"large rise in goods imports and a fall in goods exports\".  A 'disappointing' but mixed picture It's \"disappointing\" news, Chancellor Rachel Reeves said. She and the government as a whole have repeatedly said growing the economy was their number one priority. \"I am determined to kickstart economic growth and deliver on that promise\", she added. But the picture was not all bad. Growth recorded in March was revised upwards, further indicating that companies invested to prepare for tariffs. Rather than GDP of 0.2%, the ONS said on Friday the figure was actually 0.4%. It showed businesses moved forward activity to be ready for the extra taxes. Businesses were hit with higher employer national insurance contributions in April. Read more:Trump plans to hit Canada with 35% tariff - warning of blanket hike for other countriesWoman and three teenagers arrested over M&S, Co-op and Harrods cyber attacks  The expansion in March means the economy still grew when the three months are looked at together. While an interest rate cut in August had already been expected, investors upped their bets of a 0.25 percentage point fall in the Bank of England's base interest rate. Such a cut would bring down the rate to 4% and make borrowing cheaper.  Analysts from economic research firm Pantheon Macro said the data was not as bad as it looked. \"The size of the manufacturing drop looks erratic to us and should partly unwind... There are signs that GDP growth can rebound in June\", said Pantheon's chief UK economist, Rob Wood.  Why did the economy shrink? The drops in manufacturing came mostly due to slowed car-making, less oil and gas extraction and the pharmaceutical industry. The fall was not larger because the services industry - the largest part of the economy - expanded, with law firms and computer programmers having a good month. It made up for a \"very weak\" month for retailers, the ONS said."
    },
    {
        "title": "Owner of Cote restaurant chain cooks up sale plan",
        "description": "The private equity firm which took control of Cote, the French restaurant chain, at the height of the pandemic is kicking off an auction of the business",
        "url": "https://news.sky.com/story/owner-of-cote-restaurant-chain-cooks-up-sale-plan-13395388",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-cote-brasserie_6962602.jpg?20250711124302",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-11 11:14:00",
        "Headline": "Partners Group, which bought the French-themed hospitality business five years ago, is working with Interpath on a process which could trigger further closures, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity firm which took control of Cote, the French restaurant chain, at the height of the pandemic is kicking off an auction of the business Sky News has learnt that Partners Group is working with Interpath Advisory on a search for new investors in Cote. Cote was bought out of administration by Partners Group in the autumn of 2020 in a deal reportedly worth £55m. Sources close to the sale process said that Interpath was marketing the company based on last year's turnover of over £150m. Read more from Sky News:Trump to hit Canada with 35% tariffUK economy figures not as bad as they look, analysts say The chain trades from more than 70 sites across the UK, down from close to 100 shortly before it collapsed into insolvency five years ago. Roughly 60 of the sites are said to be profitable, implying there could be scope for further closures. \n                  A pub a day to close this year, industry body warns as it calls for cut to tax burden\n                 \n                  'We will see closures': The industries hit hardest by national insurance hike\n                 \n                  Boost for London nightlife as mayor Sir Sadiq Khan given new powers to overturn council licensing decisions\n                 The sale comes at a time when hospitality venue operators continue to face severe financial pressures, with the industry's leading trade body warning of a further jobs bloodbath in the months ahead. \"If we carry on with these trends and the situation doesn't improve -- and clearly Rachel Reeves's statements are giving a signal to consumers that it is not going to get better any time soon - then I would see this accelerating,\" said Kate Nicholls, chair of UK Hospitality. \"Unless there is a change of tack by the government, we are looking at 150,000-200,000 fewer workers in hospitality during the first full year of [employer national insurance contribution] changes.\" Partners Group declined to comment, while Interpath could not be reached for comment."
    },
    {
        "title": "UK economy remains fragile - and there are risks and traps lurking around the corner",
        "description": "Monthly Gross Domestic Product (GDP) figures are volatile and, on their own, don't tell us much.",
        "url": "https://news.sky.com/story/uk-economy-remains-fragile-and-there-are-risks-and-traps-lurking-around-the-corner-13395309",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-businesspeople-city_6962552.jpg?20250711114918",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-07-11 08:49:00",
        "Headline": "Concerns that the chancellor, Rachel Reeves, is considering tax hikes could weigh on consumer confidence, at a time when businesses are already scaling back hiring because of national insurance tax hikes.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Monthly Gross Domestic Product (GDP) figures are volatile and, on their own, don't tell us much. However, the picture emerging a year since the election of the Labour government is not hugely comforting. This is a government that promised to turbocharge economic growth, the key to improving livelihoods and the public finances. Instead, the economy is mainly flatlining. Output shrank in May by 0.1%. That followed a 0.3% drop in April. Ministers were celebrating a few months ago as data showed the economy grew by 0.7% in the first quarter. Hangover from artificial growth However, the subsequent data has shown us that much of that growth was artificial, with businesses racing to get orders out of the door to beat the possible introduction of tariffs. Property transactions were also brought forward to beat stamp duty changes. \n                  Money blog: Would you pay almost £13 for Pret's new salad? Here's what thousands of you told us\n                 \n                  UK economy figures not as bad as they look despite GDP fall, analysts say\n                 \n                  Owner of Cote restaurant chain cooks up sale plan\n                 Read more:Trump to hit Canada with 35% tariffWoman and three teens arrested over cyber attacks In April, we experienced the hangover as orders and industrial output dropped. Services also struggled as demand for legal and conveyancing services dropped after the stamp duty changes. Many of those distortions have now been smoothed out, but the manufacturing sector still struggled in May. Signs of recovery Manufacturing output fell by 1% in May, but more up-to-date data suggests the sector is recovering. \"We expect both cars and pharma output to improve as the UK-US trade deal comes into force and the volatility unwinds,\" economists at Pantheon Macroeconomics said. Meanwhile, the services sector eked out growth of 0.1%. A 2.7% month-to-month fall in retail sales suppressed growth in the sector, but that should improve with hot weather likely to boost demand at restaurants and pubs. Struggles ahead It is unlikely, however, to massively shift the dial for the economy, the kind of shift the Labour government has promised and needs in order to give it some breathing room against its fiscal rules. The economy remains fragile, and there are risks and traps lurking around the corner.  Concerns that the chancellor, Rachel Reeves, is considering tax hikes could weigh on consumer confidence, at a time when businesses are already scaling back hiring because of national insurance tax hikes. Inflation is also expected to climb in the second half of the year, further weighing on consumers and businesses."
    },
    {
        "title": "Donald Trump plans to hit Canada with new tariff - while warning of blanket hike for other countries",
        "description": "Donald Trump has said he plans to hit Canada with a 35% tariff on imported goods, as he warned of a blanket 15 or 20% hike for most other countries.",
        "url": "https://news.sky.com/story/donald-trump-plans-to-hit-canada-with-new-tariff-while-warning-of-blanket-hike-for-other-countries-13395231",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-tariffs_6962294.jpg?20250711045308",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-11 03:16:00",
        "Headline": "The US president also teased a \"major statement\" he will make on Russia over its war with Ukraine.",
        "Content": "Donald Trump has said he plans to hit Canada with a 35% tariff on imported goods, as he warned of a blanket 15 or 20% hike for most other countries. In a letter to Canadian Prime Minister Mark Carney, the US president wrote: \"I must mention that the flow of Fentanyl is hardly the only challenge we have with Canada, which has many Tariff, and Non-Tariff, Policies and Trade Barriers.\" Mr Trump's tariffs were allegedly an effort to get Canada to crack down on fentanyl smuggling, and the US president has expressed frustration with Canada's trade deficit with the US. In a statement Mr Carney said: \"Throughout the current trade negotiations with the United States, the Canadian government has steadfastly defended our workers and businesses. We will continue to do so as we work towards the revised deadline of August 1.\" He added: \"Canada has made vital progress to stop the scourge of fentanyl in North America. We are committed to continuing to work with the United States to save lives and protect communities in both our countries.\" Mr Trump has sent a series of tariff letters to 23 countries so far, including one putting a 50% tariff on Brazil in part for the ongoing trial of its former president Jair Bolsonaro for trying to stay in office after he lost the election in 2022. Mr Trump was similarly indicted for his efforts to overturn his election loss in 2020. The higher rates would go into effect on 1 August. Shortly after Mr Trump unveiled his \"Liberation Day\" tariffs on 2 April, there was a huge sell-off on the financial markets. The US president later announced a 90-day negotiating period, during which a 10% baseline tariff would be charged on most imported goods. 👉 Follow Trump100 on your podcast app 👈 But in an interview with Sky News's partner network NBC News, Mr Trump said he plans to impose higher blanket tariffs on most US trade partners. \"We're just going to say all of the remaining countries are going to pay, whether it's 20% or 15%. We'll work that out now,\" he said. He added: \"I think the tariffs have been very well-received. The stock market hit a new high today.\" The US and UK signed a trade deal in June, with the US president calling it \"a fair deal for both\" and saying it will \"produce a lot of jobs, a lot of income\". Sir Keir Starmer said the document \"implements\" the deal to cut tariffs on cars and aerospace, adding: \"So this is a very good day for both of our countries - a real sign of strength.\" Read more:Trump fires tariff threats at more nations as EU 'ready'Palestinian activist detained by ICE suing Trump administration The US president also teased a \"major statement\" he will make on Russia over its war with Ukraine. \"I'm disappointed in Russia, but we'll see what happens over the next couple of weeks,\" he said. \"I think I'll have a major statement to make on Russia on Monday.\" It comes as Russia's deputy foreign minister, Sergei Ryabkov, said a new round of talks between Moscow and Washington on bilateral problems could take place before the end of the summer."
    },
    {
        "title": "Starmer aims to break cabinet away day curse",
        "description": "Sir Keir Starmer was hoping to break the curse of the cabinet away day as he summoned his ministers to Chequers for the launch of a summer \"refresh\" of his troubled government.",
        "url": "https://news.sky.com/story/starmer-aims-to-break-cabinet-away-day-curse-13395660",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-chequers_6963103.jpg?20250712011901",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-07-11 22:30:00",
        "Headline": "Based on the experience of previous cabinet away days, from Sir Tony Blair and Gordon Brown to Theresa May, Boris Johnson and Rishi Sunak, the omens were not good. Away days may seem like a good idea at the time, but most end badly.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Sir Keir Starmer was hoping to break the curse of the cabinet away day as he summoned his ministers to Chequers for the launch of a summer \"refresh\" of his troubled government. The aim: to plot a course for a recovery during Labour's second year in power after a first 12 months blighted by economic woes, rows over freebies, humiliating U-turns and rebellions. In the past, the away day rules from the No 10 high command have included no woolly jumpers and no sandwiches. This time, the rule to ministers was: \"Don't call it a reset.\" Politics latest: Unite union votes to suspend Angela Rayner The curse of this away day could turn out to be the threat of a looming ministerial reshuffle, which some MPs predict could come as early as next week. Could some of those present face the axe? According to the official readout of Sir Keir's away day, the prime minister chaired a session on how the government will use AI \"to turbocharge its Plan for Change\". But that was just a small part of the discussions. Top of the agenda for a \"political cabinet\", without civil servants, were the storm clouds over the economy and the options for Chancellor Rachel Reeves in her make-or-break autumn budget. And based on the experience of previous cabinet away days, from Sir Tony Blair and Gordon Brown to Theresa May, Boris Johnson and Rishi Sunak, the omens were not good. Away days may seem like a good idea at the time, but most end badly. The idea of Chequers away days has been to hold a brainstorming session in the privacy of the Buckinghamshire countryside without distractions or prying photographers, reporters or TV crews. But over the years, like most family get-togethers, there have been personality clashes, squabbles about what to eat and what to wear, disputes about who takes centre stage, and even backstabbing and walkouts. Read more:Government to announce new AI schemeWhat is the UK-France migrant returns deal, how many will be returned? The last Chequers cabinet away day, held by Mr Sunak in January 2023, took place with two senior figures facing official investigations. Tory chair Nadhim Zahawi was engulfed in a tax scandal and deputy prime minister Dominic Raab was facing bullying allegations. Mr Zahawi was out within a week after this away day and Mr Rabb within three months. Without doubt, the most disastrous cabinet awayday at Chequers was in July 2018, when Ms May thought she'd persuaded her cabinet to back her Brexit deal. Then, as now, the heat was sweltering. But two days later, David Davis quit as Brexit secretary and Mr Johnson - who was said to have proposed a champagne toast to the prime minister at Chequers - resigned as foreign secretary the following day. Ms May thought she had a deal that would keep the UK closely tied to the EU's customs union and single market. But it was doomed even during that away day. It was reported that ministers were warned that anyone who resigned would have to walk a mile down the drive and get a lift home with the local taxi firm, whose cards had been left in the foyer. When he resigned, Mr Davis was said to have been livid about hostile briefing from senior figures in Downing Street about how the Brexiters would be treated at Chequers, including the taxi threat. And Mr Johnson not only launched a \"Chuck Chequers\" campaign opposing Ms May's deal, but also a campaign to chuck her out of Downing Street and seize her job for himself. As prime minister, he also held a cabinet awayday, not at Chequers, but at a pottery in the heart of the \"red wall\" in Stoke-on-Trent, in 2022. The venue might have been different, but that was cursed too. Just weeks later Mr Johnson's cabinet shattered like broken Wedgwood china following the resignations of Mr Sunak and Sajid Javid. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 The modern trend for cabinet away days was started by Sir Tony - who else? - in 1998. The rules for ministers were laid down by his chief of staff Jonathan Powell, now Sir Keir's national security adviser. In a memo to cabinet ministers attending, he wrote: \"TV will film people arriving and going, so there can be no woolly jumpers.\" Mr Powell was rebuffed by Sir Tony, however, when he suggested in a memo to the prime minister that Mr Brown should start the meeting with a discussion on the economy. \"No,\" Sir Tony replied bluntly in a handwritten note. Peter Mandelson, now Britain's ambassador in Washington, demanded \"something nicer than sandwiches\" for lunch and got his wish when a buffet was laid on. Sir Keir's Chequers away day also began with lunch, then the short formal cabinet meeting with the discussion about AI, then the political cabinet, which was the real reason for the away day. No need for woolly jumpers in the 32C heat. Just don't call it a \"refresh\"."
    },
    {
        "title": "France yet to agree how many migrant returns it will accept, says Yvette Cooper",
        "description": "The UK has \"not fixed the numbers yet\" on how many migrants will be returned to France as part of a new \"one in, one out\" deal, the home secretary has said.",
        "url": "https://news.sky.com/story/uk-has-not-fixed-numbers-yet-on-how-many-migrants-to-be-returned-to-france-under-deal-home-sec-reveals-13395258",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-yvette-cooper-sds_6962321.jpg?20250711073202",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-11 06:39:00",
        "Headline": "The UK and France agreed a deal to send migrants arriving on small boats to the UK, in return for legal asylum seekers.",
        "Content": "The UK has \"not fixed the numbers yet\" on how many migrants will be returned to France as part of a new \"one in, one out\" deal, the home secretary has said. Prime Minister Sir Keir Starmer and French President Emmanuel Macron announced the \"one in, one out\" deal on Thursday to return migrants crossing the Channel to the UK on small boats. In exchange for every migrant returned to France as part of the agreement, an asylum seeker who wants to come to the UK via a safe, legal route will be allowed entry to the UK - if they have not already tried to enter illegally. Politics latest: Border Force in Channel as small boats spotted But Home Secretary Yvette Cooper said they had not agreed on how many migrants would be returned, after reports said 50 would be sent back to France each week. She told Sky News: \"We haven't fixed the ultimate numbers yet or the progress that we'll make as it's a pilot, because it's right we do this in a step-by-step way, and we trial this and develop it. \"We'll provide updates throughout, we need to get this going, we need to make sure we get this one-for-one agreement that we made with France.\" \n                  Politics latest: Unite union votes to suspend Angela Rayner and could ditch link with Labour\n                 \n                  Migrants deal a win for Starmer - and could help with fight against Reform\n                 \n                  Starmer aims to break cabinet away day curse\n                  Sir Keir and Mr Macron confirmed the pilot will start in a few weeks, but Ms Cooper insisted not setting a number of how many will be sent back to France is \"the right approach because we're going to make sure that this works\". She added: \"We're going to make sure that we can increase it.\" Just hours before the two leaders announced the deal, dozens of people arrived in the UK on a dinghy, while more arrived on Friday morning as the UK hit its third heatwave of the year. So far, more than 21,000 people have arrived in the UK on small boats this year - a nearly 50% increase on the same time last year. Tories: 'It's a gimmick' Conservative shadow home secretary Chris Philp told Sky News the deal is \"not groundbreaking, it is a gimmick\". Referring to reports only 50 people a week could be sent back to France, Mr Philp added: \"Quite clearly, if 94% of illegal immigrants arriving get to stay here, there's going to be no deterrent effect whatsoever, so it's not going to work. \"And unfortunately, these record-ever numbers of illegal immigrants entering the UK, unfortunately, are set to continue.\" Read more:Migrant deal a win for Starmer - and could help fight against ReformFarage hits back at Macron as French president sparks Brexit row  'Robust position for legal challenges' Ms Cooper said she had been discussing and developing the deal with the French interior minister since October last year. They have also been talking to EU commissioners, representing each of the EU's 27 members, who she said had been \"very supportive and helpful\". The home secretary added: \"We've done a lot of legal work on this...so that we have a robust position to be able to respond to any legal challenges that are made.\"  Macron: 'British people sold a Brexit lie' While announcing the deal on Thursday alongside Sir Keir, Mr Macron said Brexit was the reason for the rise in small boats crossing the Channel, because he said the UK had no migration deal with the EU after it left, creating an \"incentive to make the crossing\". He said the British people had been sold a lie. Ms Cooper avoided voicing agreement with that statement, but said the criminal smuggler gangs charging high amounts for people to cross the Channel \"will weaponise anything that is happening\". She said in the run-up to the UK leaving the EU in January 2020, criminal gangs said people had to pay money quickly so they could cross before Brexit, but after that, they continued by saying people could not be returned because the Dublin Agreement was not in place. The Dublin Agreement is an EU law based on the principle that only one country is responsible for an asylum claim, generally the one where the asylum seeker first entered the EU. After Brexit, that was no longer in place, so the UK could not automatically return asylum seekers to the EU country they had first entered."
    },
    {
        "title": "What is the UK-France migrant returns deal, who will be returned and how many?",
        "description": "Sir Keir Starmer and Emmanuel Macron have agreed a returns deal in an attempt to reduce the number of migrants crossing the Channel in small boats.",
        "url": "https://news.sky.com/story/what-is-the-uk-france-migrant-returns-deal-who-will-be-returned-and-how-many-13395335",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-small-boat-migrants_6962503.jpg?20250711110447",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-07-11 09:30:00",
        "Headline": "The agreement comes as the number of migrants arriving in small boats reaches a record high.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Sir Keir Starmer and Emmanuel Macron have agreed a returns deal in an attempt to reduce the number of migrants crossing the Channel in small boats. The UK and French leaders announced the \"one in, one out\" agreement on 10 July after months of talks. This is what we know about the deal: What is the basic agreement? The UK will be able to send migrants who enter the UK on small boats back to France. For each one returned, the UK will allow an asylum seeker to enter through a safe and legal route - as long as they have not previously tried to enter illegally. The two leaders, and Home Secretary Yvette Cooper, were clear it is a pilot, for now. \n                  Politics latest: Unite union votes to suspend Angela Rayner and could ditch link with Labour\n                 \n                  Migrants deal a win for Starmer - and could help with fight against Reform\n                 \n                  Starmer aims to break cabinet away day curse\n                  When will it begin? Sir Keir said it will start \"in the coming weeks\", but did not give a specific date. Who will be returned? There have been no details released on how the government will select who is returned, but the initial focus will be on adults and they will not split up families. They will be held in removal centres before being sent back to France. It is not clear how long the process will take, but it is understood migrants will be returned weekly. Read more:What difference will 'one in, one out' small boats deal make?  How many will be returned? Sir Keir and Mr Macron mentioned no numbers, but it is understood around 50 people a week will be returned to France. Home Secretary Yvette Cooper told Sky News: \"We haven't fixed the ultimate numbers yet.\" She said that was because it is just a pilot at this stage, but that there was a plan to increase the numbers returned. Since the start of March, an average of more than 1,000 people have arrived in small boats every week. Sending 50 of them back would represent less than 5% of that total. Is the deal set in stone? For now, it is just a pilot, so the final details will not be set until later. The government has not said how long it will run as a pilot. The deal also needs approval from the EU, with France saying it needed to be legally ratified before being put into action. The home secretary said she thought the European Commission would sign it off, despite some Mediterranean countries' concerns about returned asylum seekers travelling back to southern Europe. She told Sky News she had been talking to France's interior minister since October about the deal, and had also been talking to EU commissioners, who represent all 27 member states and she said had been \"very supportive\". What else is being done to tackle illegal migration in the UK? Mr Macron has repeatedly said the UK needs to address \"pull factors\". The Home Office has said authorities will soon undertake \"a major nationwide blitz targeting illegal working hotspots, focusing on the gig economy and migrants working as delivery riders\". Uber Eats, Deliveroo and Just Eat have already committed to ramp up facial verification and fraud checks in the coming months after ministers called them in for talks.  The government has also introduced eVisas for people in the UK on a visa to make it easy to identify those who are in the UK legally. For the first time, France has also agreed to allow police officers to enter the water from the beaches in northern France to try to stop the boats from leaving. Over the past two weeks, they have been filmed slashing the rigid inflatable boats (RIBs) the people smugglers load up with migrants. The British government, which is helping fund the French police's efforts, is pushing France to go further and let officers intervene against boats in deeper waters."
    },
    {
        "title": "Unite votes to suspend Angela Rayner over Birmingham bin strike",
        "description": "Labour's largest union donor, Unite, has voted to suspend Deputy Prime Minister Angela Rayner over her role in the Birmingham bin strike row.",
        "url": "https://news.sky.com/story/unite-suspends-deputy-pm-angela-rayner-over-birmingham-bin-strike-13395393",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-angela-rayner-deputy-prime-minister_6954959.jpg?20250702003526",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-11 11:22:00",
        "Headline": "But there is a dispute over whether the deputy prime minister is actually still a member of the union.",
        "Content": "Labour's largest union donor, Unite, has voted to suspend Deputy Prime Minister Angela Rayner over her role in the Birmingham bin strike row. Members of the trade union, one of the UK's largest, also \"overwhelmingly\" voted to \"re-examine its relationship\" with Labour over the issue. They said Ms Rayner, who is also housing, communities and local government secretary, Birmingham Council's leader, John Cotton, and other Labour councillors had been suspended for \"bringing the union into disrepute\". There was confusion over Ms Rayner's membership of Unite, with her office having said she was no longer a member and resigned months ago and therefore could not be suspended. But Unite said she was registered as a member. Parliament's latest register of interests had her down as a member in May. Politics latest: Italy and other EU countries have 'huge doubts' about legality of UK migrant deal The union said an emergency motion was put to members at its policy conference in Brighton on Friday. \n                  Reeves's tax turmoil deepens\n                 \n                  Sir Keir Starmer should use Angela Rayner more effectively as she is popular with public, Harriet Harman says\n                 \n                  Crunching the numbers behind Labour's pledge to build 180,000 new social homes\n                 Unite is one of the Labour Party's largest union donors, donating £414,610 in the first quarter of 2025 - the highest amount in that period by a union, company or individual. The union condemned Birmingham's Labour council and the government for \"attacking the bin workers\". Mountains of rubbish have been piling up in the city since January after workers first went on strike over changes to their pay, with all-out strike action starting in March. An agreement has still not been made.  Ms Rayner and the councillors had their membership suspended for \"effectively firing and rehiring the workers, who are striking over pay cuts of up to £8,000\", the union added. General secretary Sharon Graham said: \"Unite is crystal clear, it will call out bad employers regardless of the colour of their rosette. \"Angela Rayner has had every opportunity to intervene and resolve this dispute but has instead backed a rogue council that has peddled lies and smeared its workers fighting huge pay cuts. \"The disgraceful actions of the government and a so-called Labour council, is essentially fire and rehire and makes a joke of the Employment Relations Act promises. \"People up and down the country are asking whose side is the Labour government on and coming up with the answer not workers.\"  Sir Keir Starmer's spokesman said the government's \"priority is and always has been the residents of Birmingham\". He said the decision by Unite workers to go on strike had \"caused disruption\" to the city. \"We've worked to clean up streets and remain in close contact with the council [...] as we support its recovery,\" he added. A total of 800 Unite delegates voted on the motion."
    },
    {
        "title": "UK economy figures not as bad as they look despite GDP fall, analysts say",
        "description": "The UK economy unexpectedly shrank in May, even after the worst of Donald Trump's tariffs were paused, official figures showed.",
        "url": "https://news.sky.com/story/uk-economy-shrinks-for-second-month-in-a-row-13395239",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ill-calculator-cost-of-living_6872523.png?20250331211936",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-11 05:00:00",
        "Headline": "The data is a blow to the chancellor and government, as they made growing the economy a number one priority. However, there was a bright spot.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The UK economy unexpectedly shrank in May, even after the worst of Donald Trump's tariffs were paused, official figures showed. A standard measure of economic growth, gross domestic product (GDP), contracted 0.1% in May, according to the Office for National Statistics (ONS). Rather than a fall being anticipated, growth of 0.1% was forecast by economists polled by Reuters as big falls in production and construction were seen. It followed a 0.3% contraction in April, when Mr Trump announced his country-specific tariffs and sparked a global trade war. A 90-day pause on these import taxes, which has been extended, allowed more normality to resume. This was borne out by other figures released by the ONS on Friday. Exports to the United States rose £300m but \"remained relatively low\" following a \"substantial decrease\" in April, the data said.  \n                  Greater risk to UK economy following Trump's tariffs, says Bank of England\n                 \n                  Public finances in 'relatively vulnerable position', OBR warns\n                 \n                  Government declines to rule out wealth tax after ex-Labour leader Lord Kinnock calls for one\n                 Overall, there was a \"large rise in goods imports and a fall in goods exports\".  A 'disappointing' but mixed picture It's \"disappointing\" news, Chancellor Rachel Reeves said. She and the government as a whole have repeatedly said growing the economy was their number one priority. \"I am determined to kickstart economic growth and deliver on that promise\", she added. But the picture was not all bad. Growth recorded in March was revised upwards, further indicating that companies invested to prepare for tariffs. Rather than GDP of 0.2%, the ONS said on Friday the figure was actually 0.4%. It showed businesses moved forward activity to be ready for the extra taxes. Businesses were hit with higher employer national insurance contributions in April. Read more:Trump plans to hit Canada with 35% tariff - warning of blanket hike for other countriesWoman and three teenagers arrested over M&S, Co-op and Harrods cyber attacks  The expansion in March means the economy still grew when the three months are looked at together. While an interest rate cut in August had already been expected, investors upped their bets of a 0.25 percentage point fall in the Bank of England's base interest rate. Such a cut would bring down the rate to 4% and make borrowing cheaper.  Analysts from economic research firm Pantheon Macro said the data was not as bad as it looked. \"The size of the manufacturing drop looks erratic to us and should partly unwind... There are signs that GDP growth can rebound in June\", said Pantheon's chief UK economist, Rob Wood.  Why did the economy shrink? The drops in manufacturing came mostly due to slowed car-making, less oil and gas extraction and the pharmaceutical industry. The fall was not larger because the services industry - the largest part of the economy - expanded, with law firms and computer programmers having a good month. It made up for a \"very weak\" month for retailers, the ONS said."
    },
    {
        "title": "Mystery discovery in space is most likely the 'oldest comet ever seen', say researchers",
        "description": "A mystery interstellar object discovered by British astronomers is most likely the oldest comet ever seen.",
        "url": "https://news.sky.com/story/mystery-discovery-in-space-is-most-likely-the-oldest-comet-ever-seen-say-researchers-13395445",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-comet-stars_6962732.png?20250711145006",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-07-11 13:33:00",
        "Headline": "The object seems to be travelling on a steep path - suggesting it came from the Milky Way's \"thick disk\", an area of ancient stars that orbits above and below the thin plane where most stars reside.",
        "Content": "A mystery interstellar object discovered by British astronomers is most likely the oldest comet ever seen. The \"water ice-rich\" visitor, which has been given the name 3I/ATLAS, is the first object to reach us from a completely different region of our galaxy, researchers have said. Just two other objects have entered our solar system from elsewhere. Unlike its predecessors, 3I/ATLAS seems to be travelling on a steep path that suggests it came from the Milky Way's \"thick disk\", an area of ancient stars that orbits above and below the thin plane where most stars reside. University of Oxford astronomer Matthew Hopkins explained: \"All non-interstellar comets such as Halley's Comet formed with our solar system, so are up to 4.5 billion years old. \"But interstellar visitors have the potential to be far older, and of those known about so far our statistical method suggests that 3I/ATLAS is very likely to be the oldest comet we have ever seen.\" 3I/ATLAS could be about three billion years older than our solar system. \n                  Stunning first images from powerful space telescope show new 'peek of cosmos'\n                 \n                  Artificial solar eclipse created by 'driverless' spacecraft in world first\n                 \n                  Europe's first rover to land on moon - and it's carrying a tiny red house\n                 It was first spotted on 1 July 2025 by the ATLAS survey telescope in Chile, when it was roughly 670 million kilometres from the sun. Earth is 149 million km away from the sun. Professor Chris Lintott, the co-author of the study, said: \"This is an object from a part of the galaxy we've never seen up close before. \"We think there's a two-thirds chance this comet is older than the solar system, and that it's been drifting through interstellar space ever since.\" Read more from Sky News:Bacteria with 'unique ability' found on space stationWhy do the moons two sides look so different? As 3I/ATLAS gets closer to the sun, sunlight will heat its surface and trigger the outgassing of vapour dust that creates a comet's glowing tail. Members of the public could be able to catch a glimpse of 3I/ATLAS in the coming months, as researchers say it should be visible through reasonably-sized amateur telescopes in late 2025 and early 2026."
    },
    {
        "title": "TV doctor and IVF pioneer quits British Medical Association over 'damaging' planned strikes",
        "description": "One of the UK's best-known doctors says he has resigned from the British Medical Association (BMA) because it has \"effectively encouraged young doctors to strike\".",
        "url": "https://news.sky.com/story/tv-doctor-and-ivf-pioneer-quits-british-medical-association-over-damaging-planned-strikes-13395337",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-robert-winston_6962530.jpg?20250711112609",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-07-11 09:15:00",
        "Headline": "Professor Robert Winston, a Labour peer, has said the planned five-day walkout could lead to the death of a patient.",
        "Content": " One of the UK's best-known doctors says he has resigned from the British Medical Association (BMA) because it has \"effectively encouraged young doctors to strike\". Professor Robert Winston, a TV doctor and IVF pioneer, also said a planned five-day walkout by resident doctors, formerly junior doctors, in England at the end of July could lead to the death of a patient. The Labour peer's decision to leave the BMA on Thursday was first reported by The Times. Asked about his decision on Sky News Breakfast on Friday morning, Professor Winston, 84, said: \"I've got very serious concerns about the way the British Medical Association is behaving and the way it's run... they have effectively encouraged young doctors to strike.\" Turnout for the vote was 55%, which means just under half of eligible doctors voted for strike action. Professor Winston, who had been a member of the BMA for 60 years, continued: \"It's hardly a democratic decision, but in any case, it's thoroughly damaging. \"It's damaging to the doctors. It's damaging to the profession. Most importantly, it's damaging to patients and the risk of taking one's work out means, inevitably, that somebody, at least somebody, will die.\" \n                  Care whistleblower 'who saw elderly resident being punched' could face removal from Britain\n                 \n                  Donald Trump may be denied privilege of addressing parliament on UK state visit\n                 \n                  Liverpool retires number 20 shirt at all levels in honour of Diogo Jota\n                 Professor Winston, 84, agreed with resident doctors that their working conditions had become worse over the years - saying many have to share a bed with someone else who is on call and that sometimes they don't get a \"decent meal\" at the end of their shift. However, he said: \"The government have done their very best to meet the doctors and what I have to say is that it's very clear that most of us entered medicine because of the altruism involved. \"Threats of strike action have been there ever since I came in 60 years ago as a member of the BMA. But actually, like most doctors, I've never been on strike and would not countenance it because I do not think it's in the best interests of anybody.\" Read more from Sky NewsDates doctors will strike this summer announced  Professor Winston, who became a household name through his documentaries on child development, told The Times the \"highly dangerous\" walkout could harm people's trust in the profession. Earlier this week, the BMA announced that resident doctors would walk out for five consecutive days from 7am on Friday 25 July until 7am on Wednesday 30 July. Doctors in England and Wales were awarded a 5.4% pay increase by the government, but the BMA threatened strike action following the announcement, claiming the increases did not account for historical pay freezes. The BMA is calling for a salary increase of 29.2% to bring salaries back to \"full pay restoration\". The union argues this is the level at which pay has declined in real terms since 2008, when adjusting for inflation. Health Secretary Wes Streeting called for resident doctors to \"abandon their unreasonable rush to strike\" and said that NHS recovery is \"fragile\". Mr Streeting told the Commons on Thursday: \"We have put the NHS on the road to recovery, but we all know that the NHS is still hanging by a thread, and that the BMA is threatening to pull it.\" Sky News has contacted the BMA for comment. Professor Winston is based at Imperial College London and is known for pioneering treatments to improve in vitro fertilisation (IVF) - where eggs are fertilised by sperm in a laboratory setting. His work involving IVF includes the development of pre-implantation diagnosis - which allows embryos to be screened for genetic diseases and means parents carrying faulty genes can potentially have children free of illnesses such as cystic fibrosis."
    },
    {
        "title": "Oasis fans queue from 8am for the Gallaghers' homecoming gig in Manchester",
        "description": "The first fan started queuing before 8am.",
        "url": "https://news.sky.com/story/oasis-fans-queue-from-8am-for-the-gallaghers-homecoming-gig-in-manchester-13395495",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-oasis-fans_6962800.jpg?20250711155801",
        "type": "Entertainment",
        "Author": "Katerina Vittozzi",
        "Date Published": "2025-07-11 15:24:00",
        "Headline": "While some fans have flown thousands of miles to see the Gallaghers' homecoming tonight, another tells Sky News how he was lucky enough to pick up a last-minute ticket.",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n  The first fan started queuing before 8am. Heaton Park, just north of Manchester City centre, is tonight hosting 80,000 fans who've come to see the Gallaghers' homecoming. \"I would honestly say it's a real cultural moment of the 21st century,\" says Sam, who's from Manchester and has come here with a group of friends - including one who has travelled from Australia for the gig. This will be the fourth time Sam has seen Oasis play, although obviously not for many years, and he says he can't wait for the moment the band comes on to the stage. \"The reaction from the fans, that's going to be really special,\" he says. \"This band means so much to the North West.\" Like many people attending tonight's concert, Sam is wearing a bucket hat. Liam Gallagher's iconic headgear has become a part of the band's cultural legacy and they are certainly on display here, with street vendors popping up all around the park's perimeter. \n                  The Salt Path author Raynor Winn's fourth book delayed\n                 \n                  Chris Brown: R&B singer denies further charges following alleged bottle attack in London club\n                 \n                  Salt Path author Raynor Winn responds to claims she lied about 'true' story\n                 Another fan, Dean, tells me he feels incredibly lucky to have got a ticket at all. \"I had seven devices out when the tickets were released and I didn't get one,\" he says. \"And then about three days ago, a friend of mine messaged to say she couldn't make it. \"So I made it. £120 with coach travel there and back - perfect.\" Dom is another fan who has come from Australia for the gig. \"We're frothing to be here, like so stoked,\" he says, \"The atmosphere is going to be electric.\" Read more:Review - Oasis reunite for first gig in 16 yearsA timeline of Britpop's most successful band One young couple are here on their honeymoon. From Italy, they met at a Liam Gallagher concert several years ago. \"It's where we fell in love,\" Claudia says. \"And we got married last month so we wanted to be here to celebrate.\" Amanda, from Manchester, is also here with a loved one - well, sort of. She's wearing a paper cut-out mask of her 30-year-old son Harry's face. \"He's in Melbourne and got a ticket but then couldn't come,\" Amanda explains. \"And so Harry doesn't feel left out,\" she says pulling the mask down over her face, \"we've brought him with us!\""
    },
    {
        "title": "The Salt Path author Raynor Winn's fourth book delayed",
        "description": "The Salt Path author Raynor Winn's fourth book has been delayed by her publisher.",
        "url": "https://news.sky.com/story/the-salt-path-author-raynor-winns-fourth-book-delayed-13395448",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-raynor-winn-the-salt-path_6960154.jpg?20250708141838",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-11 13:36:00",
        "Headline": "Publisher Penguin Michael Joseph said it had delayed the publication of Raynor Winn's latest book On Winter Hill - which had been set for release 23 October.",
        "Content": "The Salt Path author Raynor Winn's fourth book has been delayed by her publisher. It comes amid claims that the author lied about her story in her hit first book. Winn previously described the claims as \"highly misleading\" and called suggestions that her husband had Moth made up his illness \"utterly vile\". In a statement, Penguin Michael Joseph, said it had delayed the publication of Winn's latest book On Winter Hill - which had been set for release 23 October. The publisher said the decision had been made in light of \"recent events, in particular intrusive conjecture around Moth's health\", which it said had caused \"considerable distress\" to the author and her family. \"It is our priority to support the author at this time,\" the publisher said. \"With this in mind, Penguin Michael Joseph, together with the author, has made the decision to delay the publication of On Winter Hill from this October.\" A new release date will be announced in due course, the publisher added. 👉 Listen to Sky News Daily on your podcast app 👈 Winn's first book, released in 2018, detailed the journey she and husband took along the South West Coast Path - familiarly known as The Salt Path - after they lost their family farm and Moth received a terminal health diagnosis of Corticobasal Degeneration (CBD). But a report in The Observer disputed key aspects of the 2018 \"true\" story - which was recently turned into a film starring Jason Isaacs and Gillian Anderson. Experts 'sceptical of health claims' As part of the article, published last weekend, The Observer claimed to have spoken to experts who were \"sceptical\" about elements of Moth's terminal diagnosis, such as a \"lack of acute symptoms and his apparent ability to reverse them\". In the ensuing controversy, PSPA, a charity that supports people with CBD, cut ties with the couple. The Observer article also claimed the portrayal of a failed investment in a friend's business wasn't true, but said the couple - whose names are Sally and Tim Walker - lost their home after Raynor Winn embezzled money from her employer and had to borrow to pay it back and avoid police action. Read more from Sky News:Amber heat health alert issuedTwo women die after BMW crashes into care home It also said that, rather than being homeless, the couple had owned a house in France since 2007. Winn's statement said the dispute with her employer wasn't the reason the couple lost their home - but admitted she may have made \"mistakes\" while in the job. \"For me it was a pressured time,\" she wrote. \"It was also a time when mistakes were being made in the business. Any mistakes I made during the years in that office, I deeply regret, and I am truly sorry.\" She admitted being questioned by police but said she wasn't charged. The author also said accusations that Moth lied about having CBD/CBS were false and had \"emotionally devastated\" him. \"I have charted Moth's condition with such a level of honesty, that this is the most unbearable of the allegations,\" Winn wrote on her website."
    },
    {
        "title": "Chris Brown: R&B singer denies further charges following alleged bottle attack in London club",
        "description": "R&B singer Chris Brown has denied further charges following an alleged bottle attack in a London nightclub.",
        "url": "https://news.sky.com/story/chris-brown-appears-in-court-following-alleged-bottle-attack-13395246",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-chris-brown-court_6962370.jpg?20250711084257",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-11 05:46:00",
        "Headline": "During a hearing at Southwark Crown Court, the US musician denied assault occasioning actual bodily harm to Abraham Diaw. Brown also denied one count of having an offensive weapon - a bottle - in a public place.",
        "Content": " R&B singer Chris Brown has denied further charges following an alleged bottle attack in a London nightclub. The 36-year-old pleaded not guilty to assault occasioning actual bodily harm (ABH) to music producer Abraham Diaw, during a hearing at Southwark Crown Court on Friday. Brown also denied one count of having an offensive weapon - a bottle - in a public place. The Grammy-winning US musician last month pleaded not guilty to a more serious charge of attempting to cause grievous bodily harm (GBH) with intent to Mr Diaw. The attack allegedly happened at the Tape venue, a private members' club in Hanover Square, Mayfair, on 19 February 2023. The plea hearing is part of preparations for his five to seven-day trial, which is due to take place from 26 October 2026. Brown's co-defendant, US national Omololu Akinlolu, 39, on Friday pleaded not guilty to a charge of assaulting Mr Diaw occasioning him actual bodily harm. \n                  Chris Brown released on bail - but must pay £5m security fee\n                 \n                  Rapper charged with GBH - after singer Chris Brown remanded in custody over 'bottle attack'\n                 \n                  Chris Brown arrested over alleged bottle attack\n                 Akinlolu, a rapper who goes by the name Hoody Baby, has previously pleaded not guilty to attempting to cause grievous bodily harm. The defendants sat side-by-side in the dock, looking straight ahead during the hearing in London. Around 20 fans sat in the public gallery behind the dock for Friday's hearing, with several gasping as Brown walked into the courtroom. The Go Crazy singer was able to continue with his scheduled international tour after he was freed on conditional bail in May. He had to pay a £5m security fee to the court as part of the bail agreement, which is a financial guarantee to ensure a defendant returns to court and may be forfeited if they breach bail conditions. Read more:Chris Brown posts message after being released on bail Mr Diaw was standing at the bar of the Tape nightclub when he was struck several times with a bottle, and then pursued to a separate area of the venue where he was punched and kicked repeatedly, Manchester Magistrates' Court previously heard. Brown was arrested at Manchester's Lowry Hotel at 2am on 15 May by detectives from the Metropolitan Police. He is said to have flown into Manchester Airport on a private jet in preparation for the UK tour dates. Brown was released from HMP Forest Bank in Salford, Greater Manchester, on 21 May. The singer, who rose to stardom as a teenager in 2005, won his first Grammy award for best R&B album in 2011 for F.A.M.E.. He earned his second in the same category for 11:11 (Deluxe) earlier this year."
    },
    {
        "title": "'Covert' and 'accelerating campaign' to return Elgin Marbles to Greece, say campaigners",
        "description": "Former prime minister Liz Truss, historian Dr David Starkey and Sir John Redwood are among 34 signatories to a letter alleging the British Museum is part of a \"covert\" and \"accelerating campaign\" to return the Elgin Marbles to Greece.",
        "url": "https://news.sky.com/story/british-museum-part-of-covert-campaign-to-return-elgin-marbles-to-greece-say-campaigners-13395092",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-british-museum-elgin-marbles_6765486.jpg?20241203162458",
        "type": "Entertainment",
        "Author": "Jayson Mansaray",
        "Date Published": "2025-07-11 02:00:00",
        "Headline": "A letter, exclusively obtained by Sky News, suggests legal action could be taken to prevent the UK government and British Museum from future negotiations for the return of the Elgin Marbles, also known as the Parthenon Sculptures.",
        "Content": "\n          Arts and entertainment producer\n       Former prime minister Liz Truss, historian Dr David Starkey and Sir John Redwood are among 34 signatories to a letter alleging the British Museum is part of a \"covert\" and \"accelerating campaign\" to return the Elgin Marbles to Greece. The letter, seen exclusively by Sky News, which was sent to Sir Keir Starmer, Culture Secretary Lisa Nandy and trustees of British Museum, says \"reform will be necessary\". It says that some British Museum \"trustees may need to consider their position\" and calls for an end to any negotiations to return the Elgin Marbles, also known as the Parthenon Sculptures, or risk legal challenges. In the letter, campaigners call out what they see as \"covert negotiation\", citing an \"accelerating campaign to remove the Elgin Marbles from the British Museum\". They warn that they \"reserve the right to seek legal advice on how best to protect the interests of the British public\" including \"pursuing an injunction to halt any ongoing or future negotiations until the beneficiaries [the British public] have been fully informed\". The letter has been organised by the right-wing campaign group Great British PAC, led by Conservative activist Claire Bullivant and former Reform deputy co-leader Ben Habib. The British Museum Act 1963 prevents treasures like the Marbles from being legally given away by the museum. \n                  Elgin Marbles 'matter for British Museum', No 10 says - as Starmer and Greek PM meet\n                 \n                  Elgin Marbles: High level 'private meetings' ahead of Greek PM visit, source says \n                 \n                  'Belittling': Fashion show held next to Elgin Marbles in British Museum angers Greece\n                 A government spokesperson said there are \"no plans to change the law that would permit a permanent move of the Parthenon Sculptures\". The spokesperson added that decisions relating to the care and management of the museum's collections, including loaning objects, \"are a matter for the trustees of the British Museum\". It is understood the government has not been asked to consider a request related to the loan of the Elgin Marbles. Speaking at a Westminster Hall debate on the return of the artefacts in May, culture minister Chris Bryant said: \"We have no intention to change the law.\" He added: \"Under existing law, it would be impossible for there to be a permanent or indefinite loan.\" Back in December, British Museum chair and former chancellor George Osborne told the Political Currency podcast that a deal to return the Parthenon Sculptures to Greece is \"still some distance\" away. Mr Osborne has been contacted for a comment. A spokesperson for the British Museum said: \"Discussions with Greece about a Parthenon Partnership are on-going and constructive. \"We believe that this kind of long-term partnership would strike the right balance between sharing our greatest objects with audiences around the world, and maintaining the integrity of the incredible collection we hold at the museum.\" The Parthenon Project, which includes supporters such as Stephen Fry and Lord Ed Vaizey on its board, campaigns for the reunification of the Parthenon Sculptures and was cited in the letter as \"lavishly funded by a foreign industrialist\". The lobbying group's website lists Greek plastics magnate John Lefas and family as the leaders and key financiers of the organisation, and that it aims for a \"win-win solution\" for both Greece and Britain. Read more from Sky News:How did Elgin Marbles end up in UK?Marbles are 'matter for British Museum' British diplomat Lord Elgin removed the sculptures in the early 19th century while he was the ambassador to the Ottoman Empire, which then ruled Greece. Lord Elgin claimed he had been given permission by the Ottoman Empire for the transfer of the sculptures and sold them to the UK government in 1816, before the marbles were passed into the trusteeship of the British Museum. Turkey disputes that permission was ever given, and representative Dr Zeynep Boz supported Greece publicly in 2024 at the United Nations Return & Restitution Intergovernmental Committee (ICPRCP). UK agrees deal on Bayeux Tapestry The latest outburst over the Elgin Marbles comes as the Bayeux Tapestry loan deal with France has been agreed. The historic depiction of the Battle of Hastings and the killing of King Harold will be back in Britain for the first time in 900 years from September 2026 to July 2027. This diplomatic triumph could signal that the reunification of the Parthenon Sculptures is possible and that there could be reasons for the signatories to seek legal action yet."
    }
]