[
    {
        "title": "Battle of the wind farms: Can the 'blockers' beat the government?",
        "description": "\"An ineffective form of renewable energy&#8230; carpet-bombing the countryside&#8230; irreversible damage.\"",
        "url": "https://news.sky.com/story/battle-of-the-wind-farms-can-the-blockers-beat-the-government-13509640",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-wind-farm-teaser-image_7169853.jpg?20260219233616",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-02-19 16:37:00",
        "Headline": "Some admit they're NIMBYs. Others say that word doesn’t mean what you think it means…",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n \"An ineffective form of renewable energy… carpet-bombing the countryside… irreversible damage.\" These are the noisy, angry and organised campaigners against onshore wind in Wales. Dozens of new projects are set to sweep across the rolling hills of Cymru as the government races to hit its clean power targets. It says it is willing to take on the \"blockers\" to build hundreds of these soaring steel giants, aiming to make energy cheaper, cleaner and more secure. But in Wales, these \"blockers\" see themselves as environmentalists too: nature lovers who fear the plans will mar their countryside and culture forever. They are convinced there are better ways for Wales to go green. So who is really saving Wales? \"No more pylons\" chant a few hundred protesters outside the Welsh parliament on a cold - not to mention windy - February lunchtime. Many at the protest distance themselves from Reform UK politicians, who have vocally opposed onshore wind because they question the extent to which the climate is changing at all. \"Very few of us are climate deniers,\" one protester says in Cardiff. \"We all realise there is a problem… the question is: how do we resolve it?\" The answer, they say, is with a mixture of offshore wind, community projects and rooftop solar, arguing these can meet Wales's needs without building turbines that will also send power to England. For they are irked by a sense that history is repeating itself: another Welsh resource - following water and coal - harvested to keep England's lights on. But with electricity demand due to at least double in Wales by 2050, and 60% of it still coming from gas, Labour say doing without onshore wind is a luxury it cannot afford. Welsh Labour told Sky News it would be \"challenging to deliver the scale of electricity required at the pace needed for a climate emergency, if we were to rely wholly on community owned generation\". The ghost of Hendy wind farm The shadow of the Hendy wind farm looms large over the debate. Seven \"ghost turbines\" in Powys built despite the council's objection, which were never connected to the grid. While the industry calls Hendy an anomaly, locals see it as a cautionary tale of broken promises and reckless haste. It's why they are digging in against the proposed Nant Mithil energy park. The project would plant turbines 220m high - twice the height of Big Ben - on the peaceful hilltop of Radnor Forest. While the site could power 130,000 homes, campaigner Nigel Dodman sees only \"ecological disaster.\" \"Because of the industrialisation, the 27 kilometres of roadways they'd have to build, all the construction work that goes on,\" he says. \"Do we ruin this landscape and its ecology,\" he asks, \"or do we preserve it for generations to come?\" What does the majority say? While the protest is loud, the data suggests they are swimming against the tide. Nearly 80% of Welsh citizens are comfortable seeing turbines, versus 22% who aren't, according to polling by thinktank More In Common. A UK government survey finds more people in Britain would be happy to host onshore wind in their area, than those who would not. But support waivers at a hyper-local level, with widespread local opposition to Nant Mithil and another planned for Powys called Garreg Fawr. And these vocal minority know net zero policy is on the line at the Welsh elections in May. They have also won the support of the Campaign to Protect Rural Wales (CPRW). Its trustee Jonathan Dean says: \"Onshore wind is quicker and easier to build, but we do have time to do this properly.\" He says Labour cannot take public support for its clean power push for granted. \"If public displeasure continues to increase, and a political party intent on 'cancelling net zero' gains any power, we get the worst possible outcome. Net zero needs to maintain its 'social licence'.\" Meanwhile, the industry itself is attempting to sweeten the deal, offering above-average, though voluntary, funding for local communities hosting energy infrastructure, on top of jobs and training. Jess Hooper from trade body RenewableUK Cymru said: \"For the areas around the wind farms themselves, there's community benefit funds, in excess of £6m being realised annually. \"There's then the economic opportunity from jobs and economic growth that comes with it and investment into our rural heartlands that haven't seen such investment in many, many years.\" 'Next, it might be you' Wherever the energy comes from, an explosion of new projects are in the pipeline to meet soaring demand. This fact, combined with the upcoming elections, ups the stakes for the government to persuade people that the trade-offs are worth it. As for the NIMBYs, one protester in Cardiff says: \"Yes, we are NIMBYs, but also we don't understand why when there are so many alternatives they have to start destroying, basically un-messed with areas of countryside.\" Nigel Dodman tells me: \"I say that there's a new definition of NIMBY which is… 'Next, it might be you'.\""
    },
    {
        "title": "Hillsborough Law will 'criminalise lying' by senior ministers, say campaigners",
        "description": "Hillsborough Law will make it a criminal offence for prime ministers and cabinet ministers to deliberately mislead the public &#8211; but not backbench MPs. ",
        "url": "https://news.sky.com/story/hillsborough-law-will-criminalise-lying-by-senior-ministers-say-campaigners-13509580",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-hillsborough-law-liverpool_7022734.jpg?20250917095229",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2026-02-19 14:07:00",
        "Headline": "It's via a new standalone offence - which will apply to the prime minister - of \"misleading the public\", punishable by up to two years in jail.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Hillsborough Law will make it a criminal offence for prime ministers and cabinet ministers to deliberately mislead the public – but not backbench MPs.  Democracy campaigners say a \"historic\" measure within the flagship legislation has gone under the radar, which is a move to \"criminalise lying\" by senior politicians. That is through a new standalone offence of \"misleading the public\", punishable by up to two years in jail. This will apply to heads of government departments, civil servants and public officials such as police and NHS staff, if they intentionally mislead the public in a way that is \"seriously improper\". MPs and peers are currently exempt - but dozens of backbenchers argue that should not be the case. Labour MP Neil Duncan-Jordan told Sky News: \"MPs shouldn't be above the law. Politicians have such a low standing with the public and that's got to change.\" Mr Duncan-Jordan is one of over 30 MPs who have backed an amendment by Labour MP Luke Myer, calling for the remit to be extended to all members of both houses of parliament. Mr Myer is understood to have held discussions with ministers and backbench colleagues to ramp up support for his plan ahead of the bill returning to the Commons for its report stage. 'No-brainer' One Labour source described it as \"turkeys voting for Christmas\", but independent MP Rosie Duffield, who resigned from the party in 2024, said backing the amendment should be a \"no-brainer\". The Canterbury MP said trust is at an \"all-time low\" and the new offence could stop ministers lying or withholding information about connections to certain people or companies. She said that level of transparency should also apply to \"ordinary backbenchers\" to restore trust, as \"when a few at the top are embroiled in scandal, it besmirches us all\". Bill's delayed journey through parliament Hillsborough Law's passage through parliament was pulled last month following a row between the government and Hillsborough families over how it would apply to the security services. Liverpool MP Ian Byrne, who has led work on Hillsborough Law and supports Mr Myer's amendment, this week urged the prime minister to apply it in full to all public officials \"without further delay\", saying the Peter Mandelson scandal shows exactly why it is necessary. The bill - officially known as the Public Office Accountability Bill - follows a decades-long campaign by families bereaved by the 1989 football stadium disaster, which claimed 97 lives and led to a cover-up of police failings. Much of its focus has been on the duty of candour, which establishes new requirements for public officials to act with honesty during investigations and inquiries into the state. This duty is under pinned by the misleading the public offence, but the offence itself is not limited to inquiries. Campaigner Marcus Ball, who tried to prosecute Boris Johnson over claims on Vote Leave's \"Brexit Bus\", described this as a \"historic\" move which would \"criminalise lying in politics\" for the first time. However, he called for the offence's remit to be extended, saying it is \"completely illogical that this same law does not extend to backbench MPs or Lords\". Free speech concerns The government argues MPs and peers should be exempt as they do not make decisions on behalf of the state. Experts said this is still a significant step towards a better culture of accountability, though not as straightforward as punishing ministers for \"telling fibs\". The government has added a clause which requires proof of harm or potential harm in order to be charged with misleading the public, which some MPs argue could weaken its effectiveness. However, other MPs have expressed concern about free speech. Conservative MP Mike Wood argued in the Commons that the new offence may subject ministers to \"politically motivated lawfare\", and disagreements \"must be a matter for the ballot box rather than the courtroom\". Read more from Sky News:Andrew released after arrestSky News gains rare access to Bank's gold vaults Officials stress the offence is intended for serious cases, such as public officials spreading false narratives about events - as happened with Hillsborough. It won't apply to words said in parliament as that is covered by privilege, a long-standing convention that allows politicians to debate freely. A government spokesperson said: \"We are committed to delivering this vital piece of legislation, changing the balance of power, so the state must always act for the people it serves. The Hillsborough disaster will remain in our national consciousness for its tragedy and disgraceful injustice. \"The bill will lead to a public service that truly acts in the public interest. But for those who don't, there will be criminal sanctions for the most serious breaches, including for misleading the public in a way which is seriously improper.\""
    },
    {
        "title": "Drones armed with lasers to tackle illegal rubbish dumps",
        "description": "More than 30 \"drone squads\" equipped with laser mapping technology are being deployed by the Environment Agency (EA) to tackle the increasing number of illegal waste dumps across the country.",
        "url": "https://news.sky.com/story/drones-armed-with-lasers-to-tackle-illegal-rubbish-dumps-13509658",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-environment-agency_7169564.jpg?20260219182833",
        "type": "Home",
        "Author": "Dan Whitehead",
        "Date Published": "2026-02-19 17:13:00",
        "Headline": "Chief executive of River Action, James Wallace, welcomed the new measures from the Environment Agency, but argues they do not go far enough and said \"ministers have known for years about large-scale illegal dumping\".",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n More than 30 \"drone squads\" equipped with laser mapping technology are being deployed by the Environment Agency (EA) to tackle the increasing number of illegal waste dumps across the country. The EA is facing mounting criticism over its ability to catch gangs behind the sites - which see criminals avoid millions of pounds in landfill tax. Despite new measures announced today, environmental organisations say technology alone won't fix the issue. It comes after Sky News obtained photos of tonnes of rubbish being dumped at a site in Epping, Essex, just two weeks ago - despite an EA investigation beginning 12 months earlier. The site near Epping was blockaded by the EA on Wednesday following the arrests of two men at the site, who were spotted by a member of the public when their lorry got stuck in mud. The EA has revealed the deployment of new so-called \"drone squads\" with 33 trained pilots and drones equipped with laser technology to create detailed maps of suspected illegal waste sites. New software is also being rolled out to check whether waste lorries carrying waste have the correct permits. Environment Secretary Emma Reynolds insists the government is \"aggressively\" pursuing waste criminals and bringing them to justice, with the EA's enforcement budget boosted to £15.6m. But meanwhile, the number of large-scale illegal waste sites is continuing to grow, with many critical over how long it takes authorities to react. Sky News has been investigating how, across the country, waste crime is a growing scourge and a booming business being exploited by criminal gangs.  Being paid to remove rubbish only to dump it illegally without sorting it or paying tax is an easy way of making huge amounts of money, with poorly enforced legal repercussions and a huge cost to the environment.  It's something the previous head of the Environment Agency called \"the new narcotics\". It's thought a fifth of all waste in England is being illegally managed. That's around 34 million tonnes a year, enough to fill about four million skips. It costs the economy around a billion pounds a year, with legitimate operators thought to be losing a further £3bn from missed business. Last July,  we tracked down a group of suspected organised fly-tippers who waved wads of cash on TikTok after dumping waste in the countryside.\n 'Tech alone won't fix this' Chief executive of River Action, James Wallace, welcomed the measures, but argues they do not go far enough. \"Technology alone won't fix this,\" he said. \"The EA remains chronically underfunded and understaffed, with too few officers to identify offenders and prosecute polluters under existing laws.\" \"Ministers have known for years about large-scale illegal dumping, including sites run by organised criminal gangs, yet enforcement has failed to keep pace,\" he added. 'Something has gone badly wrong' Last Sunday, the local MP covering the Epping site, Alex Burghart, was critical of the EA's handling of the dump, telling Sky News the agency has \"very serious questions to answer\" as to why action wasn't taken earlier. \"It's completely disgraceful that this site should ever have been allowed to get into this condition,\" the senior Tory said. \"Something has clearly gone badly wrong in this case.\" Read more:What it's like to live next to a 25,000-tonne illegal dump'Prolific waste criminal' ordered to pay £1.4m  The EA has also announced an increase in the size of the multi-agency body the Joint Unit for Waste Crime (JUWC) from 13 to 20 specialists. The taskforce is made up of police, the National Crime Agency and various environmental bodies. If you have been affected by fly-tipping, email news@skynews.com or send us a message on Whatsapp Its head, Phil Davies, said: \"Illegal waste dumping is appalling, and we are determined to turn the tide on this heinous crime. \"With organised criminals becoming ever more sophisticated, we are adopting new technologies to find and, importantly, stop them. \"Through the greater use of drones, stronger partnerships and more officers on the ground, we will build on our action so far and send a clear message to those committing waste crimes - we will stop you.\""
    },
    {
        "title": "UK has not agreed to let US strike Iran from British bases, Sky News understands",
        "description": "The UK has not agreed to allow the US to launch air strikes against Iran from a British base on Diego Garcia and another in Gloucestershire, it is understood.",
        "url": "https://news.sky.com/story/uk-has-not-agreed-to-let-us-strike-iran-from-british-bases-sky-news-understands-13509668",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-f-35-raf_7169608.jpg?20260219191355",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2026-02-19 17:41:00",
        "Headline": "The UK is not thought to be preparing to support the US in any military offensive against Iran, but has deployed six F-35 warplanes to Cyprus, and sent four Typhoon jets to Qatar, as part of efforts to bolster its own defences should an attack occur.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n The UK has not agreed to allow the US to launch air strikes against Iran from a British base on Diego Garcia and another in Gloucestershire, it is understood. The Times first reported the lack of permission. The newspaper said, as a result of the UK's reticence, Donald Trump had withdrawn his support for a deal struck by Sir Keir Starmer to hand the Chagos Islands, which include Diego Garcia, over to Mauritius. US military plans to strike Iran involve the use of a British and American military base on Diego Garcia as well as RAF Fairford in Gloucestershire, which hosts a US fleet of heavy bombers. Under long-standing agreements between London and Washington, the Pentagon is only able to launch operations from the two sites, as well as other air bases in the UK that are home to US warplanes and personnel, with advance approval from the British government. This has not yet been given in relation to any potential strike against Iran because of concern that such a mission would be a breach of international law, according to The Times. President Trump on Thursday said the world would find out \"over the next, probably, 10 days\" whether the US would reach a deal with Iran to end its nuclear ambitions - or take military action. He has been surging forces to the Middle East - including two giant aircraft carriers and supporting warships and jets - to increase his options for launching a significant military operation against the Islamic Republic should talks fail. Mr Trump spoke on Tuesday evening by phone with the British prime minister. The topics covered included the Iran crisis, but not the Chagos Islands. However, the following day, the president launched a new attack on Mr Starmer over the Chagos Islands deal, even after his own State Department had said it supported the UK's decision to give the territory to Mauritius and lease back Diego Garcia. In a post on social media, Mr Trump explicitly mentioned the utility of Diego Garcia and Fairford for US military operations against Iran, and appeared to suggest why it would be within international law for the UK to grant such deployments, given that it too could be under threat. \"Should Iran decide not to make a Deal, it may be necessary for the United States to use Diego Garcia, and the Airfield located in Fairford, in order to eradicate a potential attack by a highly unstable and dangerous Regime\" Mr Trump wrote on his Truth Social site. \"An attack that would potentially be made on the United Kingdom, as well as other friendly countries.\" He then said: \"We will always be ready, willing, and able to fight for the UK, but they have to remain strong in the face of Wokeism, and other problems put before them.\" Read more:Why is the Chagos Islands deal controversial?Trump to PM: 'Do not give away Diego Garcia' The UK is not thought to be preparing to support the US in any military offensive against Iran. However, the Royal Air Force has deployed six F-35 warplanes to RAF Akrotiri on Cyprus, and sent four Typhoon jets to Qatar, as part of efforts to bolster its own defences in the event of any Iranian counterattack in response to American strikes. On the Chagos Islands deal, the government has repeatedly defended its decision to hand over the territory to Mauritius, saying it would avoid a costly legal battle while securing access to Diego Garcia for 100 years."
    },
    {
        "title": "Universal vaccine for cold, flu, COVID and allergies moves a step closer, scientists say",
        "description": "A universal vaccine for humans against cold, flu, COVID and allergies has moved a significant step closer following a study using mice, scientists say.",
        "url": "https://news.sky.com/story/universal-vaccine-for-cold-flu-covid-and-allergies-moves-a-step-closer-scientists-say-13509462",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-c-cold-flu_7169386.jpg?20260219151714",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-19 11:11:00",
        "Headline": "It is hoped that in the next few years, the vaccine could replace multiple jabs for winter respiratory infections.",
        "Content": "A universal vaccine for humans against cold, flu, COVID and allergies has moved a significant step closer following a study using mice, scientists say. The vaccine, which could be given as a nasal spray, has been developed by experts at Stanford Medicine in the US. It may protect against a wide range of respiratory viruses, bacteria and allergy triggers, they claimed. Scientists said the vaccine offered broad protection in the lungs of mice for several months. Vaccinated animals were protected against COVID and other coronaviruses, Staph (which can infect the skin and cause sepsis), Acinetobacter baumannii (which can cause infections in the blood, urinary tract, lungs or wounds), and house dust mites. This form of vaccine, if translated into humans, could replace multiple jabs every year for winter respiratory infections. It also has the potential to work against new pandemic bugs. Lead author Dr Bali Pulendran, from Stanford Medicine, said: \"I think what we have is a universal vaccine against diverse respiratory threats. \"Imagine getting a nasal spray in the fall months that protects you from all respiratory viruses including COVID-19, influenza, respiratory syncytial virus and the common cold, as well as bacterial pneumonia and early spring allergens. \"That would transform medical practice.\" The researchers are now hoping to trial the vaccine on humans. A safety trial would be followed by a larger trial in which patients are exposed to infections. Dr Pulendran thinks two doses of the nasal spray would be sufficient to provide protection in people. He estimates the vaccine might be available in five to seven years, if there is enough funding. Read more from Sky News:Who is Dame Antonia Romeo?Retail warns of more job losses In the study, a drop of the vaccine was administered to mice through their noses. The vaccine offered protection for several months against various forms of viral infections, bacterial respiratory infections and house dust mites - a common trigger for allergic asthma. Researchers were able to demonstrate protection in mice and showed that helpful T cells in the lungs, which are working against pathogens, could send signals to the body's innate immune cells to keep them active. Instead of trying to mimic part of a pathogen, the vaccine mimics the signals that immune cells use to communicate with each other during an infection. Professor Brendan Wren, from the London School of Hygiene and Tropical Medicine, said it was a \"potentially promising approach that could have wide applications and implications\" but he cautioned it was \"early days\". He added there was \"a long road to go before we'll know if this approach produces a safe and effective vaccine for humans\". The new vaccine, known for now as GLA-3M-052-LS+OVA, mimics the T cell signals that directly stimulate innate immune cells in the lungs. It also contains a harmless antigen that recruits T cells into the lungs to help the body fend off pathogens for weeks or months. The study was published in the journal Science."
    },
    {
        "title": "Donald Trump's Board of Peace pledges billions of dollars to rebuild Gaza",
        "description": "Donald Trump's Board of Peace has offered $7bn (&#163;5.2bn) in funds to rebuild war-torn Gaza at the group's first meeting, the US president has said.",
        "url": "https://news.sky.com/story/donald-trumps-board-of-peace-pledges-billions-of-dollars-and-thousands-of-troops-to-gaza-13509741",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-donald-trump-board-of-peace_7169709.jpg?20260219204154",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-19 20:30:00",
        "Headline": "The money is \"an investment in stability\", according to the US president, but is only a 10th of the total needed to rebuild the territory destroyed by the two-year war between Israel and Hamas.",
        "Content": "Donald Trump's Board of Peace has offered $7bn (£5.2bn) in funds to rebuild war-torn Gaza at the group's first meeting, the US president has said. The money was pledged by nine of the board's member countries, while five nations agreed to send troops for an international stabilisation force for the territory, Mr Trump said after Thursday's gathering in Washington DC. Kazakhstan, Azerbaijan, the United Arab Emirates, Morocco, Bahrain, Qatar, Saudi Arabia, Uzbekistan and Kuwait have promised funds. Indonesia, Morocco, Kazakhstan, Kosovo and Albania pledged to send soldiers, who will initially be deployed to Rafah. The city in southern Gaza is a major population centre where Washington hopes to base its first efforts at reconstruction. Egypt and Jordan committed to train police. As he thanked the donors, Mr Trump said that \"every dollar spent is an investment in stability, and the hope of new and harmonious [region]\". The board, he said, \"is showing how a better future can be built right here in this room\". An estimated $70bn (£52bn) is needed to rebuild the Palestinian territory decimated after two years of war between Israel and Hamas. Mr Trump also announced the US was pledging $10bn (£7.4bn) for the board, but did not say where the money was coming from or what it will be used for. Major General Jasper Jeffers, head of the newly-created International Stabilisation Force, said the plan calls for 12,000 police and 20,000 soldiers to \"help bring the security that Gaza needs for a future of prosperity and enduring peace\". The board was founded as part of Mr Trump's 20-point peace plan to end the conflict in the enclave, where the fragile ceasefire, agreed in October, is holding. Photographs published on Thursday showed Muslims sitting down to the Ramadan fast-breaking iftar meal surrounded by rubble. Since its launch in August, Mr Trump's vision for the board has switched from bringing lasting peace between Israel and Hamas to helping solve conflicts across the globe, prompting accusations that he sees it as a potential rival to the UN. Mr Trump dismissed such concerns, claiming instead that \"it [the UN] is going to be much stronger, and the Board of Peace is going to almost be looking over the United Nations and making sure it runs properly\". Around 50 countries attended the meeting, including the UK, which has not joined the board, but whose officials went as observers, along with those of Germany, Italy, Norway and Switzerland. Read more on Sky News:What eight wars has Trump claimed to have ended?Airstrikes kill 11 amid claims of ceasefire violation Mr Trump said: \"Almost everybody's accepted, and the ones that haven't, will be. \"Some are playing a little cute - it doesn't work. You can't play cute with me.\" The US president, who is sending a second aircraft carrier group to the Middle East, warned Iran that \"we have to make a meaningful deal. Otherwise bad things happen\"."
    },
    {
        "title": "Two teenagers found dead at holiday park in Yorkshire",
        "description": "A man has been arrested after two teenagers were found dead at a holiday park in east Yorkshire.&#160;",
        "url": "https://news.sky.com/story/two-teenagers-found-dead-at-holiday-park-in-yorkshire-13509621",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-police-yorkshire_7169455.jpg?20260219160011",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-19 16:30:00",
        "Headline": "A 33-year-old man was arrested on Thursday on suspicion of gross negligence manslaughter and remains in custody, police said.",
        "Content": "A man has been arrested after two teenagers were found dead at a holiday park in east Yorkshire.  Police were called to Little Eden Holiday Park in Bridlington on Wednesday, where a 15-year-old girl and a 17-year-old boy were found dead inside one of the rental properties. A 33-year-old man was arrested on Thursday on suspicion of gross negligence manslaughter and remains in custody, police said. Chief Superintendent Matt Peach of Humberside Police said: \"Whilst we are in the very early stages and the deaths at this time remain unexplained, we are exploring the possibility that they may be connected to carbon monoxide poisoning, with further enquiries continuing with our partner agencies.\" Read more from Sky News:Driver who killed child after 'ramming' car cleared of murderPolice launch manhunt after woman stabbed several times Mr Peach said a cordon remains in place, adding police are \"working closely with Humberside Fire & Rescue, the Health and Safety Executive, and East Riding of Yorkshire Council to establish the full circumstances surrounding the incident\". He said: \"This is incredibly distressing and heartbreaking for the families of the teenagers involved, and they are at the forefront of our minds and actions. \"Specially trained officers have been supporting the families over the last 24 hours, and I would please ask people to refrain from any form of speculation and to respect their privacy. \"We have a dedicated team conducting extensive enquiries, some of which have been complex and required additional time to complete.\""
    },
    {
        "title": "Hillsborough Law will 'criminalise lying' by senior ministers, say campaigners",
        "description": "Hillsborough Law will make it a criminal offence for prime ministers and cabinet ministers to deliberately mislead the public &#8211; but not backbench MPs. ",
        "url": "https://news.sky.com/story/hillsborough-law-will-criminalise-lying-by-senior-ministers-say-campaigners-13509580",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-hillsborough-law-liverpool_7022734.jpg?20250917095229",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2026-02-19 14:07:00",
        "Headline": "It's via a new standalone offence - which will apply to the prime minister - of \"misleading the public\", punishable by up to two years in jail.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Hillsborough Law will make it a criminal offence for prime ministers and cabinet ministers to deliberately mislead the public – but not backbench MPs.  Democracy campaigners say a \"historic\" measure within the flagship legislation has gone under the radar, which is a move to \"criminalise lying\" by senior politicians. That is through a new standalone offence of \"misleading the public\", punishable by up to two years in jail. This will apply to heads of government departments, civil servants and public officials such as police and NHS staff, if they intentionally mislead the public in a way that is \"seriously improper\". MPs and peers are currently exempt - but dozens of backbenchers argue that should not be the case. Labour MP Neil Duncan-Jordan told Sky News: \"MPs shouldn't be above the law. Politicians have such a low standing with the public and that's got to change.\" Mr Duncan-Jordan is one of over 30 MPs who have backed an amendment by Labour MP Luke Myer, calling for the remit to be extended to all members of both houses of parliament. Mr Myer is understood to have held discussions with ministers and backbench colleagues to ramp up support for his plan ahead of the bill returning to the Commons for its report stage. 'No-brainer' One Labour source described it as \"turkeys voting for Christmas\", but independent MP Rosie Duffield, who resigned from the party in 2024, said backing the amendment should be a \"no-brainer\". The Canterbury MP said trust is at an \"all-time low\" and the new offence could stop ministers lying or withholding information about connections to certain people or companies. She said that level of transparency should also apply to \"ordinary backbenchers\" to restore trust, as \"when a few at the top are embroiled in scandal, it besmirches us all\". Bill's delayed journey through parliament Hillsborough Law's passage through parliament was pulled last month following a row between the government and Hillsborough families over how it would apply to the security services. Liverpool MP Ian Byrne, who has led work on Hillsborough Law and supports Mr Myer's amendment, this week urged the prime minister to apply it in full to all public officials \"without further delay\", saying the Peter Mandelson scandal shows exactly why it is necessary. The bill - officially known as the Public Office Accountability Bill - follows a decades-long campaign by families bereaved by the 1989 football stadium disaster, which claimed 97 lives and led to a cover-up of police failings. Much of its focus has been on the duty of candour, which establishes new requirements for public officials to act with honesty during investigations and inquiries into the state. This duty is under pinned by the misleading the public offence, but the offence itself is not limited to inquiries. Campaigner Marcus Ball, who tried to prosecute Boris Johnson over claims on Vote Leave's \"Brexit Bus\", described this as a \"historic\" move which would \"criminalise lying in politics\" for the first time. However, he called for the offence's remit to be extended, saying it is \"completely illogical that this same law does not extend to backbench MPs or Lords\". Free speech concerns The government argues MPs and peers should be exempt as they do not make decisions on behalf of the state. Experts said this is still a significant step towards a better culture of accountability, though not as straightforward as punishing ministers for \"telling fibs\". The government has added a clause which requires proof of harm or potential harm in order to be charged with misleading the public, which some MPs argue could weaken its effectiveness. However, other MPs have expressed concern about free speech. Conservative MP Mike Wood argued in the Commons that the new offence may subject ministers to \"politically motivated lawfare\", and disagreements \"must be a matter for the ballot box rather than the courtroom\". Read more from Sky News:Andrew released after arrestSky News gains rare access to Bank's gold vaults Officials stress the offence is intended for serious cases, such as public officials spreading false narratives about events - as happened with Hillsborough. It won't apply to words said in parliament as that is covered by privilege, a long-standing convention that allows politicians to debate freely. A government spokesperson said: \"We are committed to delivering this vital piece of legislation, changing the balance of power, so the state must always act for the people it serves. The Hillsborough disaster will remain in our national consciousness for its tragedy and disgraceful injustice. \"The bill will lead to a public service that truly acts in the public interest. But for those who don't, there will be criminal sanctions for the most serious breaches, including for misleading the public in a way which is seriously improper.\""
    },
    {
        "title": "Battle of the wind farms: Can the 'blockers' beat the government?",
        "description": "\"An ineffective form of renewable energy&#8230; carpet-bombing the countryside&#8230; irreversible damage.\"",
        "url": "https://news.sky.com/story/battle-of-the-wind-farms-can-the-blockers-beat-the-government-13509640",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-wind-farm-teaser-image_7169853.jpg?20260219233616",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-02-19 16:37:00",
        "Headline": "Some admit they're NIMBYs. Others say that word doesn’t mean what you think it means…",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n \"An ineffective form of renewable energy… carpet-bombing the countryside… irreversible damage.\" These are the noisy, angry and organised campaigners against onshore wind in Wales. Dozens of new projects are set to sweep across the rolling hills of Cymru as the government races to hit its clean power targets. It says it is willing to take on the \"blockers\" to build hundreds of these soaring steel giants, aiming to make energy cheaper, cleaner and more secure. But in Wales, these \"blockers\" see themselves as environmentalists too: nature lovers who fear the plans will mar their countryside and culture forever. They are convinced there are better ways for Wales to go green. So who is really saving Wales? \"No more pylons\" chant a few hundred protesters outside the Welsh parliament on a cold - not to mention windy - February lunchtime. Many at the protest distance themselves from Reform UK politicians, who have vocally opposed onshore wind because they question the extent to which the climate is changing at all. \"Very few of us are climate deniers,\" one protester says in Cardiff. \"We all realise there is a problem… the question is: how do we resolve it?\" The answer, they say, is with a mixture of offshore wind, community projects and rooftop solar, arguing these can meet Wales's needs without building turbines that will also send power to England. For they are irked by a sense that history is repeating itself: another Welsh resource - following water and coal - harvested to keep England's lights on. But with electricity demand due to at least double in Wales by 2050, and 60% of it still coming from gas, Labour say doing without onshore wind is a luxury it cannot afford. Welsh Labour told Sky News it would be \"challenging to deliver the scale of electricity required at the pace needed for a climate emergency, if we were to rely wholly on community owned generation\". The ghost of Hendy wind farm The shadow of the Hendy wind farm looms large over the debate. Seven \"ghost turbines\" in Powys built despite the council's objection, which were never connected to the grid. While the industry calls Hendy an anomaly, locals see it as a cautionary tale of broken promises and reckless haste. It's why they are digging in against the proposed Nant Mithil energy park. The project would plant turbines 220m high - twice the height of Big Ben - on the peaceful hilltop of Radnor Forest. While the site could power 130,000 homes, campaigner Nigel Dodman sees only \"ecological disaster.\" \"Because of the industrialisation, the 27 kilometres of roadways they'd have to build, all the construction work that goes on,\" he says. \"Do we ruin this landscape and its ecology,\" he asks, \"or do we preserve it for generations to come?\" What does the majority say? While the protest is loud, the data suggests they are swimming against the tide. Nearly 80% of Welsh citizens are comfortable seeing turbines, versus 22% who aren't, according to polling by thinktank More In Common. A UK government survey finds more people in Britain would be happy to host onshore wind in their area, than those who would not. But support waivers at a hyper-local level, with widespread local opposition to Nant Mithil and another planned for Powys called Garreg Fawr. And these vocal minority know net zero policy is on the line at the Welsh elections in May. They have also won the support of the Campaign to Protect Rural Wales (CPRW). Its trustee Jonathan Dean says: \"Onshore wind is quicker and easier to build, but we do have time to do this properly.\" He says Labour cannot take public support for its clean power push for granted. \"If public displeasure continues to increase, and a political party intent on 'cancelling net zero' gains any power, we get the worst possible outcome. Net zero needs to maintain its 'social licence'.\" Meanwhile, the industry itself is attempting to sweeten the deal, offering above-average, though voluntary, funding for local communities hosting energy infrastructure, on top of jobs and training. Jess Hooper from trade body RenewableUK Cymru said: \"For the areas around the wind farms themselves, there's community benefit funds, in excess of £6m being realised annually. \"There's then the economic opportunity from jobs and economic growth that comes with it and investment into our rural heartlands that haven't seen such investment in many, many years.\" 'Next, it might be you' Wherever the energy comes from, an explosion of new projects are in the pipeline to meet soaring demand. This fact, combined with the upcoming elections, ups the stakes for the government to persuade people that the trade-offs are worth it. As for the NIMBYs, one protester in Cardiff says: \"Yes, we are NIMBYs, but also we don't understand why when there are so many alternatives they have to start destroying, basically un-messed with areas of countryside.\" Nigel Dodman tells me: \"I say that there's a new definition of NIMBY which is… 'Next, it might be you'.\""
    },
    {
        "title": "Drones armed with lasers to tackle illegal rubbish dumps",
        "description": "More than 30 \"drone squads\" equipped with laser mapping technology are being deployed by the Environment Agency (EA) to tackle the increasing number of illegal waste dumps across the country.",
        "url": "https://news.sky.com/story/drones-armed-with-lasers-to-tackle-illegal-rubbish-dumps-13509658",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-environment-agency_7169564.jpg?20260219182833",
        "type": "UK",
        "Author": "Dan Whitehead",
        "Date Published": "2026-02-19 17:13:00",
        "Headline": "Chief executive of River Action, James Wallace, welcomed the new measures from the Environment Agency, but argues they do not go far enough and said \"ministers have known for years about large-scale illegal dumping\".",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n More than 30 \"drone squads\" equipped with laser mapping technology are being deployed by the Environment Agency (EA) to tackle the increasing number of illegal waste dumps across the country. The EA is facing mounting criticism over its ability to catch gangs behind the sites - which see criminals avoid millions of pounds in landfill tax. Despite new measures announced today, environmental organisations say technology alone won't fix the issue. It comes after Sky News obtained photos of tonnes of rubbish being dumped at a site in Epping, Essex, just two weeks ago - despite an EA investigation beginning 12 months earlier. The site near Epping was blockaded by the EA on Wednesday following the arrests of two men at the site, who were spotted by a member of the public when their lorry got stuck in mud. The EA has revealed the deployment of new so-called \"drone squads\" with 33 trained pilots and drones equipped with laser technology to create detailed maps of suspected illegal waste sites. New software is also being rolled out to check whether waste lorries carrying waste have the correct permits. Environment Secretary Emma Reynolds insists the government is \"aggressively\" pursuing waste criminals and bringing them to justice, with the EA's enforcement budget boosted to £15.6m. But meanwhile, the number of large-scale illegal waste sites is continuing to grow, with many critical over how long it takes authorities to react. Sky News has been investigating how, across the country, waste crime is a growing scourge and a booming business being exploited by criminal gangs.  Being paid to remove rubbish only to dump it illegally without sorting it or paying tax is an easy way of making huge amounts of money, with poorly enforced legal repercussions and a huge cost to the environment.  It's something the previous head of the Environment Agency called \"the new narcotics\". It's thought a fifth of all waste in England is being illegally managed. That's around 34 million tonnes a year, enough to fill about four million skips. It costs the economy around a billion pounds a year, with legitimate operators thought to be losing a further £3bn from missed business. Last July,  we tracked down a group of suspected organised fly-tippers who waved wads of cash on TikTok after dumping waste in the countryside.\n 'Tech alone won't fix this' Chief executive of River Action, James Wallace, welcomed the measures, but argues they do not go far enough. \"Technology alone won't fix this,\" he said. \"The EA remains chronically underfunded and understaffed, with too few officers to identify offenders and prosecute polluters under existing laws.\" \"Ministers have known for years about large-scale illegal dumping, including sites run by organised criminal gangs, yet enforcement has failed to keep pace,\" he added. 'Something has gone badly wrong' Last Sunday, the local MP covering the Epping site, Alex Burghart, was critical of the EA's handling of the dump, telling Sky News the agency has \"very serious questions to answer\" as to why action wasn't taken earlier. \"It's completely disgraceful that this site should ever have been allowed to get into this condition,\" the senior Tory said. \"Something has clearly gone badly wrong in this case.\" Read more:What it's like to live next to a 25,000-tonne illegal dump'Prolific waste criminal' ordered to pay £1.4m  The EA has also announced an increase in the size of the multi-agency body the Joint Unit for Waste Crime (JUWC) from 13 to 20 specialists. The taskforce is made up of police, the National Crime Agency and various environmental bodies. If you have been affected by fly-tipping, email news@skynews.com or send us a message on Whatsapp Its head, Phil Davies, said: \"Illegal waste dumping is appalling, and we are determined to turn the tide on this heinous crime. \"With organised criminals becoming ever more sophisticated, we are adopting new technologies to find and, importantly, stop them. \"Through the greater use of drones, stronger partnerships and more officers on the ground, we will build on our action so far and send a clear message to those committing waste crimes - we will stop you.\""
    },
    {
        "title": "UK has not agreed to let US strike Iran from British bases, Sky News understands",
        "description": "The UK has not agreed to allow the US to launch air strikes against Iran from a British base on Diego Garcia and another in Gloucestershire, it is understood.",
        "url": "https://news.sky.com/story/uk-has-not-agreed-to-let-us-strike-iran-from-british-bases-sky-news-understands-13509668",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-f-35-raf_7169608.jpg?20260219191355",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2026-02-19 17:41:00",
        "Headline": "The UK is not thought to be preparing to support the US in any military offensive against Iran, but has deployed six F-35 warplanes to Cyprus, and sent four Typhoon jets to Qatar, as part of efforts to bolster its own defences should an attack occur.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n The UK has not agreed to allow the US to launch air strikes against Iran from a British base on Diego Garcia and another in Gloucestershire, it is understood. The Times first reported the lack of permission. The newspaper said, as a result of the UK's reticence, Donald Trump had withdrawn his support for a deal struck by Sir Keir Starmer to hand the Chagos Islands, which include Diego Garcia, over to Mauritius. US military plans to strike Iran involve the use of a British and American military base on Diego Garcia as well as RAF Fairford in Gloucestershire, which hosts a US fleet of heavy bombers. Under long-standing agreements between London and Washington, the Pentagon is only able to launch operations from the two sites, as well as other air bases in the UK that are home to US warplanes and personnel, with advance approval from the British government. This has not yet been given in relation to any potential strike against Iran because of concern that such a mission would be a breach of international law, according to The Times. President Trump on Thursday said the world would find out \"over the next, probably, 10 days\" whether the US would reach a deal with Iran to end its nuclear ambitions - or take military action. He has been surging forces to the Middle East - including two giant aircraft carriers and supporting warships and jets - to increase his options for launching a significant military operation against the Islamic Republic should talks fail. Mr Trump spoke on Tuesday evening by phone with the British prime minister. The topics covered included the Iran crisis, but not the Chagos Islands. However, the following day, the president launched a new attack on Mr Starmer over the Chagos Islands deal, even after his own State Department had said it supported the UK's decision to give the territory to Mauritius and lease back Diego Garcia. In a post on social media, Mr Trump explicitly mentioned the utility of Diego Garcia and Fairford for US military operations against Iran, and appeared to suggest why it would be within international law for the UK to grant such deployments, given that it too could be under threat. \"Should Iran decide not to make a Deal, it may be necessary for the United States to use Diego Garcia, and the Airfield located in Fairford, in order to eradicate a potential attack by a highly unstable and dangerous Regime\" Mr Trump wrote on his Truth Social site. \"An attack that would potentially be made on the United Kingdom, as well as other friendly countries.\" He then said: \"We will always be ready, willing, and able to fight for the UK, but they have to remain strong in the face of Wokeism, and other problems put before them.\" Read more:Why is the Chagos Islands deal controversial?Trump to PM: 'Do not give away Diego Garcia' The UK is not thought to be preparing to support the US in any military offensive against Iran. However, the Royal Air Force has deployed six F-35 warplanes to RAF Akrotiri on Cyprus, and sent four Typhoon jets to Qatar, as part of efforts to bolster its own defences in the event of any Iranian counterattack in response to American strikes. On the Chagos Islands deal, the government has repeatedly defended its decision to hand over the territory to Mauritius, saying it would avoid a costly legal battle while securing access to Diego Garcia for 100 years."
    },
    {
        "title": "Two teenagers found dead at holiday park in Yorkshire",
        "description": "A man has been arrested after two teenagers were found dead at a holiday park in east Yorkshire.&#160;",
        "url": "https://news.sky.com/story/two-teenagers-found-dead-at-holiday-park-in-yorkshire-13509621",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-police-yorkshire_7169455.jpg?20260219160011",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-19 16:30:00",
        "Headline": "A 33-year-old man was arrested on Thursday on suspicion of gross negligence manslaughter and remains in custody, police said.",
        "Content": "A man has been arrested after two teenagers were found dead at a holiday park in east Yorkshire.  Police were called to Little Eden Holiday Park in Bridlington on Wednesday, where a 15-year-old girl and a 17-year-old boy were found dead inside one of the rental properties. A 33-year-old man was arrested on Thursday on suspicion of gross negligence manslaughter and remains in custody, police said. Chief Superintendent Matt Peach of Humberside Police said: \"Whilst we are in the very early stages and the deaths at this time remain unexplained, we are exploring the possibility that they may be connected to carbon monoxide poisoning, with further enquiries continuing with our partner agencies.\" Read more from Sky News:Driver who killed child after 'ramming' car cleared of murderPolice launch manhunt after woman stabbed several times Mr Peach said a cordon remains in place, adding police are \"working closely with Humberside Fire & Rescue, the Health and Safety Executive, and East Riding of Yorkshire Council to establish the full circumstances surrounding the incident\". He said: \"This is incredibly distressing and heartbreaking for the families of the teenagers involved, and they are at the forefront of our minds and actions. \"Specially trained officers have been supporting the families over the last 24 hours, and I would please ask people to refrain from any form of speculation and to respect their privacy. \"We have a dedicated team conducting extensive enquiries, some of which have been complex and required additional time to complete.\""
    },
    {
        "title": "Measles cases continue to rise in England - and this is where outbreak could spread next",
        "description": "Measles cases are continuing to spread across England,&#160;with most infections among unvaccinated young children.",
        "url": "https://news.sky.com/story/measles-cases-continue-to-rise-in-england-and-this-is-where-outbreak-could-spread-next-13509662",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-measles-spots-rash_7165384.jpg?20260215024234",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-19 17:02:00",
        "Headline": "UK Health Security Agency figures show that between 1 January and 16 February, there were 130 confirmed measles cases, many of them in Enfield, but the real figure could be much higher.",
        "Content": "Measles cases are continuing to spread across England, with most infections among unvaccinated young children. By Monday, there had been 130 confirmed cases across the country this year, according to the UK Health Security Agency (UKHSA). Of those, 34 were identified between 12 and 16 February. Enfield has been the centre of the outbreak, with 50 confirmed cases coming from within the boundaries of the north London borough. It has prompted one nearby council to warn that they expect the outbreak to spread to their area next. And health bosses warn that the actual figure could be much higher due to a lag on lab testing. Dr Vanessa Saliba, consultant epidemiologist at UKHSA, said: \"The outbreak is still mostly affecting unvaccinated children under 10 in schools and nurseries. \"With the time lag involved with confirming cases through laboratory testing, we expect the actual number of cases to be higher. \"The outbreak has led to some children having to be hospitalised. \"Measles is a nasty illness for any child, but for some it can lead to serious long term complications, and, tragically, death, but is so easily preventable with two doses of the MMRV vaccine. \"All parents want what is best for their child. If they have missed any of their doses, or you're unsure, get in touch with your GP surgery. It's never too late to catch up. \"The MMRV vaccine will give them the vital protection they need against this highly contagious disease, but also help protect more vulnerable children around them who are too young or unable to have the vaccine due to a weakened immune system.\" Measles is highly infectious among people who are not vaccinated, and can lead to serious complications such as pneumonia, brain inflammation and, in rare cases, long-term disability or death. Read more from Sky News:Driver who killed child after 'ramming' car cleared of murderMan guilty over XL bully attack that killed woman in his home Southend City Council said rising cases in Enfield mean that they are \"likely to reach Essex, Southend and Thurrock\", and urged parents to check if their children are protected. The outbreak comes after the World Health Organization said that the UK is no longer considered to have eliminated measles."
    },
    {
        "title": "Former soldier honoured for 'exceptional bravery' after stopping car that drove into fans at Liverpool's Premier League title parade",
        "description": "A former soldier who stopped a car that had been driven into crowds of celebrating football supporters has been honoured for his \"exceptional bravery\".",
        "url": "https://news.sky.com/story/former-soldier-honoured-for-exceptional-bravery-after-stopping-car-that-drove-into-fans-at-liverpools-premier-league-title-parade-13509666",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-dan-barr-liverpool-parade_7110950.jpg?20251215132819",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-19 20:10:00",
        "Headline": "Dan Barr climbed into the back seat of Paul Doyle's Ford Galaxy and put it in park mode after the father-of-three had injured 134 fans at Liverpool's Premier League title parade.",
        "Content": "A former soldier who stopped a car that had been driven into crowds of celebrating football supporters has been honoured for his \"exceptional bravery\". Dan Barr, 41, climbed into the back seat of a Ford Galaxy, which Paul Doyle had driven at Liverpool fans at the club's Premier League celebration parade in May last year. Mr Barr, who spent eight years in the Royal Engineers, moved the gear stick to park mode to stop Doyle, 54, who injured 134 people when he \"lost his temper\". On Thursday, the builder's labourer from Birkenhead was presented with the High Sheriff's Award for Bravery in a ceremony at Liverpool Crown Court. Recorder of Liverpool Andrew Menary KC, who jailed Doyle for 21 years and six months in December, told Mr Barr that what he did that day \"mattered\". Mr Menary said his actions mattered \"to those who were injured. It mattered to their families. It mattered to the emergency services working desperately to regain control of a chaotic scene. And it mattered to this city\". He added the award also recognised \"the resilience and solidarity of the people of Liverpool and the enduring truth that even in moments of darkness, courage and humanity prevail\". Mr Menary said: \"On behalf of the court and the community it serves, I offer you our profound respect, our gratitude and our congratulations.\" Mr Barr, who was there with his mother Honora Barr, said he felt \"very privileged\", adding, \"I'm really proud of this\". High Sheriff of Merseyside Billy Hui handed Mr Barr a framed certificate which read: \"This certificate is awarded to Daniel Barr in recognition of his exceptional bravery and presence of mind during the events of May 26 2025 in the city of Liverpool. \"In circumstances of real and immediate danger arising during a large public celebration, he acted selflessly to assist those at risk and to reduce the likelihood of further serious harm. \"His calm courage, concern for others, and willingness to place himself in danger to help those around him reflect the very best of civic responsibility and merit the court's highest commendation.\" He also received £250. Read more:Liverpool parade victim tells of 'carnage'How 'red mist' descended on Paul Doyle Mr Barr said last year that he did not think he did \"anything special\". Doyle, a father-of-three from Croxteth, pleaded guilty to dangerous driving, affray, 17 charges of attempting to cause grievous bodily harm with intent, nine counts of causing GBH with intent and three counts of wounding with intent."
    },
    {
        "title": "Former South Korean president Yoon Suk Yeol handed life sentence after declaring martial law in 2024",
        "description": "A South Korean court has sentenced former president&#160;Yoon Suk Yeol to life in prison after he imposed martial law in the country in 2024.",
        "url": "https://news.sky.com/story/former-south-korean-president-yoon-suk-yeol-handed-life-sentence-after-declaring-martial-law-in-2024-13509369",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-south-korea-yoon-suk-yeol_7168817.jpg?20260219071509",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-19 06:07:00",
        "Headline": "Yoon was found guilty of abuse of authority and masterminding an insurrection, stemming from his mobilisation of military and police forces in an illegal attempt to seize the liberal-led National Assembly in December 2024",
        "Content": "A South Korean court has sentenced former president Yoon Suk Yeol to life in prison after he imposed martial law in the country in 2024. Yoon was found guilty of abuse of authority and masterminding an insurrection, stemming from his mobilisation of military and police forces in an illegal attempt to seize the liberal-led National Assembly in December 2024, in a case that meant he also faced the death penalty. The 65-year-old staunch conservative had defended his decree as necessary to stop liberals, whom he described as \"anti-state\" forces, from obstructing his agenda with their legislative majority. The emergency rule triggered a national political crisis. Martial law lasted for around six hours, before being lifted after politicians managed to break through a blockade by hundreds of heavily-armed troops and police, unanimously voting to lift the measure. Prosecutors sought the death penalty in January, saying \"his unconstitutional and ‌illegal emergency martial law undermined the function of the National Assembly and the Election Commission... actually destroying the liberal democratic constitutional order.\" South Korea has not executed anyone since 1997 - a move widely seen as a de facto moratorium on capital punishment. The court also convicted and sentenced several former military and police officials involved in enforcing the martial law decree. Former defence minister Kim Yong Hyun received a 30-year jail term for his central role in planning the measure and mobilising the military. Read more from Sky News:British couple sentenced to 10 years in prison in Iran, family sayHow US military is assembling within striking distance of Iran Yoon was sentenced last month to five years in prison for resisting arrest, fabricating the martial law proclamation and sidestepping a legally mandated full cabinet meeting before he declared martial law. The Seoul Central Court has also convicted two of Yoon's cabinet members in other cases, including former prime minister Han Duck-soo, who received a 23-year prison sentence for attempting to legitimise the decree by forcing it through a cabinet council meeting, falsifying records and lying under oath. He has appealed the verdict."
    },
    {
        "title": "Toxic gas leak in Nigeria kills nearly 40 miners and leaves many more in hospital ",
        "description": "A toxic gas leak at a mine in Nigeria has killed 37 people and left 26 injured in hospital.&#160;",
        "url": "https://news.sky.com/story/toxic-gas-leak-in-nigeria-kills-nearly-40-miners-and-leaves-many-more-in-hospital-13509467",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-nigeria-mine-mines_7169093.jpg?20260219114643",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-19 11:08:00",
        "Headline": "The miners didn't realise they were breathing in a sudden discharge of lead oxide, carbon monoxide and other poisonous gases.",
        "Content": "A toxic gas leak at a mine in Nigeria has killed 37 people and left 26 injured in hospital.  Poisonous lead, sulphur and carbon monoxide was suddenly discharged into the shaft, killing nearly 40 miners working underground. They were said to have not realised they were breathing in deadly fumes until they started to become unwell, according to the Nigerian government. The victims were taken ill in the early hours of Tuesday morning in Kampani Zurak, a police spokesman said. Alfred Alabo said: \"A preliminary investigation revealed that the miners faced a sudden discharge of lead oxide and other associated gases like sulphur and carbon monoxide. \"These gases are toxic and poisonous to humans, particularly in a confined or poorly ventilated environment.\" He added that the bodies of the deceased had been released to their families for burial in accordance with their religious practices. The Nigerian government has closed the mining site and an investigation into the leak is continuing. Read more from Sky News:Former South Korean president handed life sentenceWhat is in the Chagos Islands deal criticised by Donald Trump The miners were unaware of the toxic nature of the emissions and continued their operations, Nigeria's Minister of Solid Minerals Development Dele Alake said. It's not clear what was being mined at the site and whether the mine was operating legally. Nigeria is trying to rein in illegal gold mining operations across the country that have killed hundreds of people over the years."
    },
    {
        "title": "Bill Gates withdraws from Indian AI Impact Summit",
        "description": "The Indian AI Impact Summit was meant to demonstrate that the country is a serious player in AI and serve as its showcase.",
        "url": "https://news.sky.com/story/bill-gates-withdraws-from-indian-ai-impact-summit-13509392",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-bill-gates-micosoft_7168854.jpg?20260219082122",
        "type": "World",
        "Author": "Neville Lazarus",
        "Date Published": "2026-02-19 08:13:00",
        "Headline": "Mr Gates was scheduled to speak alongside Prime Minister Modi, French President Macron and others notable guests.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n The Indian AI Impact Summit was meant to demonstrate that the country is a serious player in AI and serve as its showcase. However, it has been dogged by controversies of alleged mismanagement, inconvenience to delegates, exhibitors and the public due to security sweeps, and allegedly false claims by an Indian University. The official claimed that a Chinese 'robodog' was developed by her Galgotias University - with the institution later apologising for the minsunderstanding. But it has been the participation of the co-founder of Microsoft, Bill Gates, who was to give a key address on the inauguration day, that has been the most damaging. Mr Gates was scheduled to speak today alongside Prime Minister Narendra Modi, French President Emmanuel Macron, Google head Sundar Pichai, OpenAI chief executive Sam Altman and others. Just hours before he was due to speak, a social media post by the Gates Foundation said: \"After careful consideration, and to ensure the focus remains on the AI summit's key priorities, Mr Gates will not be delivering his keynote address. \"The Gates Foundation remains fully committed to our work in India to advance our shared health and development goals.\" \n                  Bill Gates speeds up plans to give away his fortune\n                 \n                  Bill Gates says he would be diagnosed with autism if he was young today\n                 \n                  Bill Gates says AI will make it easier to combat climate change but must be 'used by people with good intent'\n                 There was much consternation about Mr Gates taking part in such a high-profile event when last month the US Justice Department released emails, photographs and documents of his exchange with convicted sex offender Jeffrey Epstein. Read more from Sky News:British couple sentenced to 10 years in prison in IranFormer South Korean president Yoon Suk Yeol handed life sentence Mr Gates maintains that his relationship and repeated meetings with Epstein were confined to philanthropy-related discussions and that it was a mistake for him to meet Epstein. Until yesterday, the Gates Foundation asserted and stated, \"Bill Gates is attending the AI Impact Summit. He will be delivering his keynote as scheduled.\""
    },
    {
        "title": "UK has not agreed to let US strike Iran from British bases, Sky News understands",
        "description": "The UK has not agreed to allow the US to launch air strikes against Iran from a British base on Diego Garcia and another in Gloucestershire, it is understood.",
        "url": "https://news.sky.com/story/uk-has-not-agreed-to-let-us-strike-iran-from-british-bases-sky-news-understands-13509668",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-f-35-raf_7169608.jpg?20260219191355",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2026-02-19 17:41:00",
        "Headline": "The UK is not thought to be preparing to support the US in any military offensive against Iran, but has deployed six F-35 warplanes to Cyprus, and sent four Typhoon jets to Qatar, as part of efforts to bolster its own defences should an attack occur.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n The UK has not agreed to allow the US to launch air strikes against Iran from a British base on Diego Garcia and another in Gloucestershire, it is understood. The Times first reported the lack of permission. The newspaper said, as a result of the UK's reticence, Donald Trump had withdrawn his support for a deal struck by Sir Keir Starmer to hand the Chagos Islands, which include Diego Garcia, over to Mauritius. US military plans to strike Iran involve the use of a British and American military base on Diego Garcia as well as RAF Fairford in Gloucestershire, which hosts a US fleet of heavy bombers. Under long-standing agreements between London and Washington, the Pentagon is only able to launch operations from the two sites, as well as other air bases in the UK that are home to US warplanes and personnel, with advance approval from the British government. This has not yet been given in relation to any potential strike against Iran because of concern that such a mission would be a breach of international law, according to The Times. President Trump on Thursday said the world would find out \"over the next, probably, 10 days\" whether the US would reach a deal with Iran to end its nuclear ambitions - or take military action. He has been surging forces to the Middle East - including two giant aircraft carriers and supporting warships and jets - to increase his options for launching a significant military operation against the Islamic Republic should talks fail. Mr Trump spoke on Tuesday evening by phone with the British prime minister. The topics covered included the Iran crisis, but not the Chagos Islands. However, the following day, the president launched a new attack on Mr Starmer over the Chagos Islands deal, even after his own State Department had said it supported the UK's decision to give the territory to Mauritius and lease back Diego Garcia. In a post on social media, Mr Trump explicitly mentioned the utility of Diego Garcia and Fairford for US military operations against Iran, and appeared to suggest why it would be within international law for the UK to grant such deployments, given that it too could be under threat. \"Should Iran decide not to make a Deal, it may be necessary for the United States to use Diego Garcia, and the Airfield located in Fairford, in order to eradicate a potential attack by a highly unstable and dangerous Regime\" Mr Trump wrote on his Truth Social site. \"An attack that would potentially be made on the United Kingdom, as well as other friendly countries.\" He then said: \"We will always be ready, willing, and able to fight for the UK, but they have to remain strong in the face of Wokeism, and other problems put before them.\" Read more:Why is the Chagos Islands deal controversial?Trump to PM: 'Do not give away Diego Garcia' The UK is not thought to be preparing to support the US in any military offensive against Iran. However, the Royal Air Force has deployed six F-35 warplanes to RAF Akrotiri on Cyprus, and sent four Typhoon jets to Qatar, as part of efforts to bolster its own defences in the event of any Iranian counterattack in response to American strikes. On the Chagos Islands deal, the government has repeatedly defended its decision to hand over the territory to Mauritius, saying it would avoid a costly legal battle while securing access to Diego Garcia for 100 years."
    },
    {
        "title": "Sudanese rebels' capture of Darfur city bears 'hallmarks of genocide', UN officials say",
        "description": "An 18-month siege and mass killings carried out by Sudanese rebels during their seizure of a city in Darfur bore the hallmarks of genocide, UN experts have said.&#160;",
        "url": "https://news.sky.com/story/sudanese-rebels-capture-of-darfur-city-bears-hallmarks-of-genocide-un-officials-say-13509390",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sudan-al-fashir_7063213.jpg?20251026191619",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-19 08:14:00",
        "Headline": "Foreign Secretary Yvette Cooper called for \"urgent action\" from the international community, including a criminal probe after more than half the city's population were killed.",
        "Content": "An 18-month siege and mass killings carried out by Sudanese rebels during their seizure of a city in Darfur bore the hallmarks of genocide, UN experts have said.  The Rapid Support Force paramilitaries are said to have committed atrocities and human rights abuses in el-Fasher during a campaign that started in 2023 and ended with they overran the territory in October 2024. The conflict also saw Arab militias try to completely destroy non-Arab communities, with more than half the population slaughtered in the bloodbath, according to the independent fact-finding mission. Mona Rishmawi, one of the authors of the report, wrote: \"Starvation, denial of assistance, mass killings, rape, torture and enforced disappearance...leaves only one reasonable inference - these are the hallmarks of genocide\". Foreign Secretary Yvette Cooper has called for \"urgent action\" from the international community, including criminal investigations \"to ensure accountability for vile perpetrators, justice for victims, and to break the cycle of bloodshed\". Rebel commanders \"calculated to bring about the physical destruction\" of non-Arab areas, in particular the Zaghawa and the Fur communities, according to the report released on Thursday. UN officials said several thousand civilians were killed when the RSF and fellow paramilitary groups took over el-Fasher, which had been the Sudanese army's only remaining stronghold in Darfur. Only 40% of the city's 260,000 residents were able to flee the assault alive, thousands of whom were wounded, the officials said. The fate of the rest remains unknown. The report went on to say: \"Thousands of persons, particularly the Zaghawa, were killed, raped or disappeared during three days of absolute horror. \"The wanton violations that were perpetrated by the RSF and allied Arab militia in the final offensive on el-Fasher underscore that persistent impunity fuels continued cycles of violence.\" One witness was quoted as saying that he saw bodies thrown into the air, \"like a scene out of a horror movie\", according to the report. Ms Cooper said: \"The world is still failing the people of Sudan. When the stories started to emerge about the horrors of el-Fasher it should have been a turning point, but the violence is continuing. \"It is time to listen to the women of Sudan, not the military men who have been prosecuting this war. We need action for justice, accountability and peace.\" Ms Cooper is expected to raise the report at a UN Security Council meeting in New York today. Sudan was plunged into conflict in mid-April 2023, when long-running tensions between its military and paramilitary leaders erupted in the capital Khartoum and spread to other regions, including Darfur. Read more from Sky News:Former South Korean president handed life sentenceHow US military is assembling within striking distance of Iran The war has seen more than 40,000 people killed, according to UN figures, but aid groups say the true number could be many times higher. The RSF and their allied Arab militias, known as Janjaweed, overran el-Fasher on 26 October and stormed the city. Widespread atrocities were committed during the offensive that included mass killings and summary executions, sexual violence, torture, and abductions for ransom, according to the UN Human Rights Office. More than 6,000 people were killed between 25 October and 27 October in the city, the office said. Ahead of the assault, the rebels ran riot in the Abu Shouk displacement camp, just outside of the city, and killed at least 300 people over two days, it said. The group's commander, General Mohamed Hamdan Dagalo, has previously acknowledged abuses by his forces, but disputed the scale of atrocities. An international convention known colloquially as the \"Genocide Convention\" - adopted in 1948 - sets out five criteria to assess whether genocide has taken place. They include killing members of a group, causing its members serious bodily or mental harm, imposing measures aimed to prevent births in the group, deliberately inflicting conditions calculated to bring about the \"physical destruction\" of the group, and forcibly transferring its children to another group. The fact-finding team, which doesn't have the final say on whether a genocide has been committed, said it found at least three of those five factors were met in the RSF's actions. Under the convention, a genocide determination could be made even if only one of the five were met. The RSF acts in el-Fasher included killing members of a protected ethnic group; causing serious mental and bodily harm; and deliberately inflicting conditions of life to bring about the group's physical destruction in whole or in part - all key elements of the crime of genocide under international law, according to the fact-finding team. The fact-finding mission pointed to mass killings, widespread rape, sexual violence, torture and cruel treatment, arbitrary detention, extortion, and enforced disappearances during RSF's takeover of el-Fasher in late October."
    },
    {
        "title": "Andrew 'clearly has knowledge' on Jeffrey Epstein, claims US politician ready to hear testimony",
        "description": "Anytime, any place, anywhere.",
        "url": "https://news.sky.com/story/the-us-politician-who-wants-to-meet-andrew-and-make-sure-he-tells-the-truth-13509695",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-suhas-epstein_7169602.jpg?20260219190805",
        "type": "World",
        "Author": "James Matthews",
        "Date Published": "2026-02-19 18:36:00",
        "Headline": "Representative Suhas Subramanyam has told Sky News that he is prepared to travel to the UK to speak to the former prince.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n Anytime, any place, anywhere. The American politicians who want to speak to Andrew Mountbatten Windsor about Jeffrey Epstein say his arrest reinforces their case to have him called before them. They'll make it work, whatever and wherever it takes them. \"He can testify remotely, he can testify in person - and in the UK,\" US Representative Suhas Subramanyam told me. The Democratic member of the House Oversight Committee is prepared to travel to Britain to hear testimony from Andrew. \"We are going to New York to meet with the Clintons, we just came from Ohio to meet with Les Wexner,\" said Rep Subramanyam. \"And the entire committee doesn't have to come. \"It can be certain members who are interested in that particular witness, but we are very flexible when it comes to hearing testimony from people who have knowledge of what happened with Epstein and Maxwell, and the cover up as well. He clearly has knowledge.\" As a foreign national, Andrew can't be subpoenaed to give evidence. He has ignored all requests to testify. He also denies any wrongdoing. But committee members believe he has questions to answer over and above the interests of Thames Valley Police. Rep Subramanyam told me: \"I want to still hear from him. The door is still open. We will do it on his terms, and engage on his terms. I just want to make sure he tells the truth to us, because he's not been truthful so far.\" Americans 'want to see justice' The arrest of Andrew further accentuates the difference in impact of the scandal in the US compared to other countries. In the UK, the former prince and Peter Mandelson are casualties of the Epstein affair. In turn, it has weakened Prime Minister Sir Keir Starmer, whose chief of staff, Morgan McSweeney, has quit. In the US, outside of the private sector, there has been little to no consequence for individuals named in the Epstein files. Read more: What does Andrew's arrest mean for the royal family?Andrew's arrest 'worst possible thing' for the Crown Rep Subramanyam said: \"The people who've gotten the least amount of consequences are people in the Trump administration who keep coming up in the files. \"I think the American public and the world public want to see accountability and justice, not just for the victims, but they want to see the system work. \"And so that's what this is really about. Is about making sure that governments aren't covering up for rich and powerful people and that they're being held accountable for these heinous crimes.\""
    },
    {
        "title": "Donald Trump's Board of Peace pledges billions of dollars to rebuild Gaza",
        "description": "Donald Trump's Board of Peace has offered $7bn (&#163;5.2bn) in funds to rebuild war-torn Gaza at the group's first meeting, the US president has said.",
        "url": "https://news.sky.com/story/donald-trumps-board-of-peace-pledges-billions-of-dollars-and-thousands-of-troops-to-gaza-13509741",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-donald-trump-board-of-peace_7169709.jpg?20260219204154",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-19 20:30:00",
        "Headline": "The money is \"an investment in stability\", according to the US president, but is only a 10th of the total needed to rebuild the territory destroyed by the two-year war between Israel and Hamas.",
        "Content": "Donald Trump's Board of Peace has offered $7bn (£5.2bn) in funds to rebuild war-torn Gaza at the group's first meeting, the US president has said. The money was pledged by nine of the board's member countries, while five nations agreed to send troops for an international stabilisation force for the territory, Mr Trump said after Thursday's gathering in Washington DC. Kazakhstan, Azerbaijan, the United Arab Emirates, Morocco, Bahrain, Qatar, Saudi Arabia, Uzbekistan and Kuwait have promised funds. Indonesia, Morocco, Kazakhstan, Kosovo and Albania pledged to send soldiers, who will initially be deployed to Rafah. The city in southern Gaza is a major population centre where Washington hopes to base its first efforts at reconstruction. Egypt and Jordan committed to train police. As he thanked the donors, Mr Trump said that \"every dollar spent is an investment in stability, and the hope of new and harmonious [region]\". The board, he said, \"is showing how a better future can be built right here in this room\". An estimated $70bn (£52bn) is needed to rebuild the Palestinian territory decimated after two years of war between Israel and Hamas. Mr Trump also announced the US was pledging $10bn (£7.4bn) for the board, but did not say where the money was coming from or what it will be used for. Major General Jasper Jeffers, head of the newly-created International Stabilisation Force, said the plan calls for 12,000 police and 20,000 soldiers to \"help bring the security that Gaza needs for a future of prosperity and enduring peace\". The board was founded as part of Mr Trump's 20-point peace plan to end the conflict in the enclave, where the fragile ceasefire, agreed in October, is holding. Photographs published on Thursday showed Muslims sitting down to the Ramadan fast-breaking iftar meal surrounded by rubble. Since its launch in August, Mr Trump's vision for the board has switched from bringing lasting peace between Israel and Hamas to helping solve conflicts across the globe, prompting accusations that he sees it as a potential rival to the UN. Mr Trump dismissed such concerns, claiming instead that \"it [the UN] is going to be much stronger, and the Board of Peace is going to almost be looking over the United Nations and making sure it runs properly\". Around 50 countries attended the meeting, including the UK, which has not joined the board, but whose officials went as observers, along with those of Germany, Italy, Norway and Switzerland. Read more on Sky News:What eight wars has Trump claimed to have ended?Airstrikes kill 11 amid claims of ceasefire violation Mr Trump said: \"Almost everybody's accepted, and the ones that haven't, will be. \"Some are playing a little cute - it doesn't work. You can't play cute with me.\" The US president, who is sending a second aircraft carrier group to the Middle East, warned Iran that \"we have to make a meaningful deal. Otherwise bad things happen\"."
    },
    {
        "title": "Andrew 'clearly has knowledge' on Jeffrey Epstein, claims US politician ready to hear testimony",
        "description": "Anytime, any place, anywhere.",
        "url": "https://news.sky.com/story/the-us-politician-who-wants-to-meet-andrew-and-make-sure-he-tells-the-truth-13509695",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-suhas-epstein_7169602.jpg?20260219190805",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2026-02-19 18:36:00",
        "Headline": "Representative Suhas Subramanyam has told Sky News that he is prepared to travel to the UK to speak to the former prince.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n Anytime, any place, anywhere. The American politicians who want to speak to Andrew Mountbatten Windsor about Jeffrey Epstein say his arrest reinforces their case to have him called before them. They'll make it work, whatever and wherever it takes them. \"He can testify remotely, he can testify in person - and in the UK,\" US Representative Suhas Subramanyam told me. The Democratic member of the House Oversight Committee is prepared to travel to Britain to hear testimony from Andrew. \"We are going to New York to meet with the Clintons, we just came from Ohio to meet with Les Wexner,\" said Rep Subramanyam. \"And the entire committee doesn't have to come. \"It can be certain members who are interested in that particular witness, but we are very flexible when it comes to hearing testimony from people who have knowledge of what happened with Epstein and Maxwell, and the cover up as well. He clearly has knowledge.\" As a foreign national, Andrew can't be subpoenaed to give evidence. He has ignored all requests to testify. He also denies any wrongdoing. But committee members believe he has questions to answer over and above the interests of Thames Valley Police. Rep Subramanyam told me: \"I want to still hear from him. The door is still open. We will do it on his terms, and engage on his terms. I just want to make sure he tells the truth to us, because he's not been truthful so far.\" Americans 'want to see justice' The arrest of Andrew further accentuates the difference in impact of the scandal in the US compared to other countries. In the UK, the former prince and Peter Mandelson are casualties of the Epstein affair. In turn, it has weakened Prime Minister Sir Keir Starmer, whose chief of staff, Morgan McSweeney, has quit. In the US, outside of the private sector, there has been little to no consequence for individuals named in the Epstein files. Read more: What does Andrew's arrest mean for the royal family?Andrew's arrest 'worst possible thing' for the Crown Rep Subramanyam said: \"The people who've gotten the least amount of consequences are people in the Trump administration who keep coming up in the files. \"I think the American public and the world public want to see accountability and justice, not just for the victims, but they want to see the system work. \"And so that's what this is really about. Is about making sure that governments aren't covering up for rich and powerful people and that they're being held accountable for these heinous crimes.\""
    },
    {
        "title": "'This was addiction by design... I call it murder': Parents' anger as Zuckerberg faces court",
        "description": "Grieving parents awaited Mark Zuckerberg's arrival at a courthouse in downtown Los Angeles for what is being called the social media industry's \"big tobacco moment\".",
        "url": "https://news.sky.com/story/this-was-addiction-by-design-i-call-it-murder-parents-anger-as-zuckerberg-faces-court-13509367",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lori-schott-social-media_7168797.jpg?20260219054310",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2026-02-19 05:40:00",
        "Headline": "The Facebook founder has appeared in front of a jury for the first time, responding to the allegation that he put profit over the health and wellbeing of children.",
        "Content": "\n          US correspondent\n              @marthakelner\n Grieving parents awaited Mark Zuckerberg's arrival at a courthouse in downtown Los Angeles for what is being called the social media industry's \"big tobacco moment\". \"I'm comforted by the fact he's here alone, with only his lawyers and a jury. He's without his lobbyists or his PR machine,\" says Lori Schott, whose 18-year-old daughter Annalee had a social media addiction and died by suicide in 2020. \"If we would have been here in this court 10 years earlier she would have still been alive,\" she adds. 'They knew what they were doing' Lori tells me how Annalee, who she describes as the central cog of their family, grew up on a farm in rural Colorado, but an interest in rodeos and horses was superseded by addiction to social media. On TikTok and Instagram, she would use beauty filters, says Lori, and compare herself to other girls. Annalee's anxiety and depression grew, and she even viewed a live suicide video online. \"They [the social media companies] knew what they were doing,\" says Lori. \"They did it for profit motives, and it's got to stop. Our children deserve to take control of their own digital footprint. \"My daughter shouldn't have had content pushed at her that said she was ugly, or her life had no future. This was an addiction by design, metrics were set on increasing usage. Some call it capitalism, I call it murder.\" Lori argues social media platforms are inherently addictive, and that the addictive nature of them has led to a host of personal harms. That is also the allegation being made by the plaintiff in this case, a 20-year-old, referred to in court as \"Kaley GM\". She became an Instagram user aged nine and developed an addiction to many social media platforms. Kaley GM suffered from negative body image, anxiety and depression, her lawyers say. TikTok and Snapchat have both reached settlements in the lawsuit, leaving Meta and Google as the remaining defendants. Zuckerberg draws the crowds Kaley GM's is the first of nine separate trials in Los Angeles by nine different plaintiffs who claim that when they were minors they became addicted to social media and suffered varying harms. Mr Zuckerberg, the CEO of Meta, which owns and operates Facebook and Instagram was appearing in front of a jury for the first time, responding to the allegation that he put profit over the health and wellbeing of children. He arrived at court flanked by bodyguards and sat nervously as he waited to take the stand. When he testified, the plaintiff KGM was sitting directly in his eye line, but he never looked at her. He nodded at the 12 jury members as they made their way to the box. The interest in this case is so massive that the court held a \"lottery\" to determine who would \"win\" a seat in the public gallery to see Mr Zuckerberg. Raffle tickets were drawn and even some of the bereaved parents who travelled across the country to be here for this watershed trial were not allowed inside the room. Zuckerberg in court - as it happened The plaintiff's lawyer, Mark Lanier, focused on Instagram's stated policy of not allowing under-13s on the platform. Mr Lanier argued that not only did Instagram know there were users under 13, but the company aggressively sought to recruit them to the platform. On three screens inside the courtroom he displayed an internal Meta memo from 2018. \"If we want to win big with teens, we must bring them in as tweens,\" it said. \"We have definitively established tweens as the highest retention age group in the US.\" But Mr Zuckerberg bristled at the suggestion that Instagram is designed to be harmful to children. \"I'm focused on building a community that is sustainable,\" he said. \"If you do something that's not good for people, maybe they'll spend more time [on Instagram] short term, but if they're not happy with it, they're not going to use it over time. I'm not trying to maximise the amount of time people spend every month.\" He sparred with Mr Lanier, repeatedly accusing him of mischaracterising his testimony on the stand and previous statements he had made to Congress. There was no \"gotcha\" moment with Mr Zuckerberg and there is still plenty more testimony to come. But if the plaintiff in this lawsuit is successful there may be thousands more similar cases waiting in the wings. It could drastically alter the way the social media industry operates."
    },
    {
        "title": "Epstein files will be just the start of a police investigation into Andrew",
        "description": "Andrew Mountbatten-Windsor is not just a former prince. The other title he held for a decade was that of UK trade envoy.",
        "url": "https://news.sky.com/story/epstein-files-will-be-just-the-start-of-a-police-investigation-into-andrew-13509762",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-prince-andrew-andrew_7169277.jpg?20260219133934",
        "type": "US",
        "Author": "Sarah Hajibagheri, news editor",
        "Date Published": "2026-02-19 21:25:00",
        "Headline": "Andrew Mountbatten-Windsor was arrested 20 days after the Department of Justice released three million documents about Jeffrey Epstein. The former prince, who has previously denied wrongdoing in relation to Epstein, was later released under investigation. ",
        "Content": "By Sarah Hajibagheri, news editor  Andrew Mountbatten-Windsor is not just a former prince. The other title he held for a decade was that of UK trade envoy. He lost both titles due to his association with the convicted sex offender and US financier Jeffrey Epstein. While he's been referred to in many colourful ways over the decades, \"Randy Andy\" and \"Airmiles Andy\", Thames Valley Police described him plainly - \"a man in his sixties from Norfolk\" had been arrested. His arrest came just 20 days after the Department of Justice released three million documents about Epstein. They were dense, disparate, and often difficult to piece together. Buried among them were references to glamorous birthday parties at palaces. An invitation to \"celebrate 50 years of Papa/Andrew\" was sent to Epstein. He did not reply, so the former Duke's office chased his RSVP. Epstein declined to attend with just two words: \"not able\". Correspondence was sometimes professional and often personal. The files made headlines daily and have now led police to investigate allegations of misconduct in public office against the King's brother. We do not know what specifically led to Andrew's arrest on his 66th birthday. The former prince has always denied wrongdoing. Read more: What does Andrew's arrest mean for the royal family?Andrew's arrest 'worst possible thing' for the Crown But the documents give us a glimpse into fragments of conversations that were occurring while Andrew was the UK's special representative for international trade and investment. On Christmas Eve in 2010, Andrew sent the US financier a document the former Duke himself described as a \"confidential brief\". It contained \"investment opportunities\" in gold, uranium and oil extraction. The former prince wrote, \"I am going to offer this elsewhere in my network (including Abu Dhabi)\". The email was sent over a fortnight after the pair's infamous walk in the park in New York, where Andrew later claimed on television that he had ended his relationship with Epstein. In his Newsnight interview, Andrew said: \"I never had any contact with him from that day forward.\" But the emails show communications between the pair continued. As trade envoy, Andrew travelled the globe extensively and had access to senior government and business contacts around the world On 24 July 2010, an email from an associate of Epstein suggested they could \"discreetly\" capitalise on Andrew's \"aura and access\" to jointly set up a private wealth management business in London targeting high net worth Chinese individuals. The former Duke was not on that email. On 21 July 2011, the day Andrew stepped down as UK trade envoy. Epstein said in an email about the news, \"I'm sure this is good for him, he will now be free\". Epstein sent a news article about Andrew stepping down from the role to Ghislaine Maxwell, who asked \"why?\" The financier responded, \"I think he wants to make money\". The files that have been reported on for weeks now will just be the start of the police investigation as they gather and explore the allegation of misconduct in public office. Andrew has been released under investigation. He has previously denied wrongdoing in relation to Epstein."
    },
    {
        "title": "Peter Mandelson-founded lobbying firm Global Counsel on brink of closure",
        "description": "The advisory firm founded by Lord Mandelson is on the verge of being placed in administration, a member of staff has told Sky News.",
        "url": "https://news.sky.com/story/peter-mandelson-founded-lobbying-firm-global-counsel-on-brink-of-closure-13509596",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/00a7865eb66302a6575c64125c51e76ce70f071fb6f75cae86a92d064ba77aed_7081250.jpg?20260203152627",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-02-19 14:34:00",
        "Headline": "An employee of Global Counsel tells Sky News how staff were told about the decision to effectively shut the company down. ",
        "Content": "The advisory firm founded by Lord Mandelson is on the verge of being placed in administration, a member of staff has told Sky News. Global Counsel (GC), which severed its connection to the former government minister and ambassador to the US earlier this month amid his association with the late paedophile financier Jeffrey Epstein, employs around 130 staff. A new leadership team, appointed after GC's chief executive departed on 6 February and including the chair of M&S Archie Norman, took the decision to call it a day amid an exodus of clients. Mark Kleinman blog: See the latest from Sky's City editor Sky News reported a week ago that KKR, the US investment firm, had become the latest global name to pull its business from the company in the wake of Peter Mandelson's sacking in Washington and decision to expel him from the Labour Party over his links to Epstein. The GC employee told Sky News: \"Officially, we were told around 1pm today at a company all hands meeting, but I think everyone knew the writing was on the wall as many of the tech and financial big name clients had left. \"So I think naturally people's conclusion was 'who was paying us?'. But I don't think anyone realised the extent of the damage. I think a lot of people thought the junior staff would be cut, but it wasn't apparent until today that everything was going to be shut down. \n                  Sky News gains rare access to Bank of England's gold vaults\n                 \n                  Norwegian green steel group in running to buy major UK producer\n                 \n                  'Two-hour queues, utter chaos': Readers share experiences of new EU entry system | Money blog\n                 \"In the meeting they said tomorrow the administrators would be coming and the office lease will be coming in the next few days. Recruiters will be coming in to help people with the next steps. \"People had questions about what their entitlements are, and the chairman Archie was also there and made a short statement. \"Archie Norman said essentially that this isn't a reflection of anyone's work or anything. We have been unfairly caught up in this, and alluded to his previous experience delivering with crises. \"Mandelson wasn't explicitly mentioned at any point, but Rebecca Park [new chief executive] said this has come about unfairly hitting the employees because of the association. For more information about how we use your data and your rights, you can visit our Privacy Centre. \"Actually a lot of people at the company are relatively new and have never met Mandelson, and he wasn't involved in the commercial activities for a long time. It is tough for all of us. \"I know for one of our clients that is a global streaming company that Mandelson was an issue. For public companies that are listed with a UK exposure, it's a big issue.\" GC later said in a statement: \"After an exhaustive review of the options available to the company, the Board of Global Counsel has decided to ask the UK courts to appoint Interpath as an administrator to take control of and realise the assets of the company. \"To be clear, this will no longer be business as usual as the Administrators-in-waiting have already indicated that, in the unlikely event that any ongoing servicing of clients is viable, this will be on a limited basis only. \"Inevitably therefore, this will result in a significant number of redundancies being made by the Administrators when they take control of the company tomorrow.\" It added: \"The Board wishes to thank: firstly, all our staff who have stood together in very difficult times and shown exceptional resilience in the face of circumstances beyond their control; secondly, our clients, who have been placed in a difficult position by these events and whose generous support has been a tribute to our teams, and; thirdly, our shareholders who have suffered a material loss through no fault of their own.\" Global Counsel was founded in November 2010, and the new leadership team had no association to its co-founders. It offered lobbying and other advisory services to many top global firms. Lord Mandelson's appointment as US ambassador by Sir Keir Starmer in late 2024 meant he had to step back from any role in its day-to-day business. GC had declared earlier this month that a divestment in his shares was being completed in a move that brought \"to an end any connection between Global Counsel and Peter Mandelson. \"This means he no longer has any shareholding, role, or association with Global Counsel, and exercises no influence over the company in any capacity\", the company said. Lord Mandelson has resigned from the House of Lords, and is widely expected to lose his peerage in the coming months."
    },
    {
        "title": "Norwegian green steel group in running to buy major UK producer",
        "description": "A Norwegian green steel group is in the running to buy Speciality Steels UK (SSUK), Britain's third-biggest producer of the metal, six months after it collapsed into liquidation.",
        "url": "https://news.sky.com/story/norwegian-green-steel-group-in-running-to-buy-major-uk-producer-13509506",
        "image_url": "https://e3.365dm.com/21/03/1920x1080/skynews-liberty-steel-rotherham_5317948.jpg?20210325194938",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-02-19 12:03:00",
        "Headline": "Blastr, which has drawn up plans to relocate its holding company from Norway to the UK, is among the bidders in talks to buy Speciality Steels UK, which was previously owned by Sanjeev Gupta, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A Norwegian green steel group is in the running to buy Speciality Steels UK (SSUK), Britain's third-biggest producer of the metal, six months after it collapsed into liquidation. Sky News has learnt that Blastr, which is privately owned, is among a small number of parties which remain talks with the Official Receiver about a deal to buy SSUK, which operates from sites in Rotherham and Sheffield. Money blog: TV chef closes pub due to 'increasingly challenging' conditions Employing well over 1,000 people, SSUK was part of the metals empire of Sanjeev Gupta, the tycoon who is facing financial, legal and regulatory battles on a multitude of fronts. The business was declared \"hopelessly insolvent\" by a judge last summer, and collapsed into compulsory liquidation. Since then, a number of parties have stepped forward with proposals to rescue SSUK. Blastr is run by Mark Bula, a steel industry veteran who has worked at the American companies Nucor and Big River Steel. Both businesses are said to have successfully disrupted traditional blast furnace production with electric arc furnace steelmaking technology. Based in Norway, Blastr was set up to create an iron and steel value chain in the UK and Europe, with a low-cost, globally competitive and environmentally sustainable footprint. Sources close to the situation said Blastr had retained Evercore, the investment bank, to advise on its interest in SSUK. Evercore has also been engaged by the UK government to advise on its strategy for the steel industry, including options which could lead to the merger of SSUK with other sector assets. One insider said Blastr was scouring the industry for strategic acquisitions which could enable it to deliver ultra-low emission iron and steel at the lowest cost in the UK and Europe. Blastr is understood to have drawn up plans to move its holding company from Norway to the UK, although it is unclear whether that move is dependent upon a successful acquisition of SSUK. A deal for Blastr to buy Mr Gupta's former assets would probably involve a special purpose vehicle being set up, the insider added. Blastr joins rival bidders including Arabian Gulf Steel Industries (AGSI), which is headquartered in Abu Dhabi, and 7 Steel UK, owned by Czech energy tycoon Pavel Tykac and which last year bought the Allied Steel and Wire site in Cardiff from Spanish firm Celsa. Whitehall insiders said a decision about a preferred bidder could be made within weeks, although they cautioned that it was plausible that none of the shortlisted suitors might be able to strike a satisfactory deal. The financing of any of the bids remains unclear. Last month, Sky News reported that AGSI was rumoured to be keen to secure financial backing from Britain's National Wealth Fund to support a takeover of SSUK and fund a resumption of steelmaking at its sites in Yorkshire. Mr Gupta himself had secured backing from third parties including Blackrock, the world's biggest asset manager, although the prospect of him being chosen to repurchase the business appears to be extremely remote. For more information about how we use your data and your rights, you can visit our Privacy Centre. A spokesman for Blastr declined to comment on Thursday. An Insolvency Service spokesperson told Sky News earlier this month: \"\"We can confirm that the Official Receiver continues to progress bids for the sale of Speciality Steel UK. \"This process is ongoing, with the aim to complete a sale at the earliest opportunity.\" The sale process for SSUK comes during a period of broader uncertainty for the British steel sector. British Steel, the Scunthorpe-based producer which is legally owned by China's JIngye Group but which was seized by the government last April amid a threat to close its remaining blast furnaces, is costing taxpayers a daily seven-figure sum to subsidise. So far, the government has spent hundreds of millions of pounds on running the company. The government's move prevented the immediate loss of more than 3,000 jobs, although there remain questions about the company's viability as a standalone entity. In 2024, ministers agreed to provide £500m in grant funding to Tata Steel, the Indian company, to install an electric arc furnace at its Port Talbot steelworks in Wales. The new facility is expected to be operational in 2027, but has been bitterly opposed by trade unions infuriated that the new funding was effectively used to drive through thousands of redundancies at the plant."
    },
    {
        "title": "eBay to buy Depop from Etsy in $1.2bn cash deal",
        "description": "Online seller eBay has agreed to pay $1.2bn (&#163;890m) to purchase second-hand fashion marketplace Depop from Etsy, the companies have announced.",
        "url": "https://news.sky.com/story/ebay-to-buy-depop-from-etsy-in-12bn-cash-deal-13509364",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ebay-money_7168794.jpg?20260219043132",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-02-19 03:55:00",
        "Headline": "The deal comes as the popularity of used clothing has grown in recent years, with consumers seeking a sustainable, more affordable alternative to traditional retailers.",
        "Content": "Online seller eBay has agreed to pay $1.2bn (£890m) to purchase second-hand fashion marketplace Depop from Etsy, the companies have announced. The all-cash deal is expected to be completed by the middle of this year - five years after Etsy, an online marketplace, bought Depop for $1.6bn (£1.18bn). The acquisition comes as the popularity of used clothing has grown in recent years, with consumers seeking a sustainable, more affordable alternative to traditional retailers. Depop, which was founded in the UK in 2011, is expected to retain its name, brand and platform, the companies said. For more information about how we use your data and your rights, you can visit our Privacy Centre. At the end of last year, Depop's marketplace had three million active sellers and seven million active buyers, nearly 90% of which were under the age of 34. In a statement, eBay's CEO Jamie Ianonne said the purchase presents an opportunity to capture a younger demographic. Mr Ianonne said: \"Depop has built a trusted, social-forward marketplace with strong momentum in the pre-loved fashion category. \"We are confident that as part of eBay, Depop will be even more well-positioned for long-term growth, benefiting from our scale, complementary offerings, and operational capabilities.\" Peter Semple, CEO of Depop, said the transaction is \"testament to the significant growth we have delivered\". Read more from Sky News:Retail warns of more job lossesInterest rate cut even more likely next month Etsy chief executive Kruti Patel Goyal called the deal is \"a positive next step for all involved\" and added she was \"confident Depop is well-positioned for its next phase of growth as part of eBay\". Following the announcement of the acquisition, eBay's shares rose more than 7%, while Etsy's share soared close to 15%."
    },
    {
        "title": "Savings Guide: How to spare your child crippling student debt - and doing it right could save you £15,000",
        "description": "For this week's Savings Guide, we have a special edition with Mark Chicken, a chartered financial planner at The Private Office, looking at how you can save your child from university debt...",
        "url": "https://news.sky.com/story/savings-guide-how-to-spare-your-child-crippling-student-debt-and-doing-it-right-could-save-you-16315000-13509380",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-university-erasmus_7113004.jpg?20251217130927",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-02-19 07:15:00",
        "Headline": "With average graduate debts now more than £50,000, here are a few tips to financially prepare your child if they decide to study at university.",
        "Content": "For this week's Savings Guide, we have a special edition with Mark Chicken, a chartered financial planner at The Private Office, looking at how you can save your child from university debt... For parents with young children, university can feel a very long way off. But with graduates in England facing up to 40 years of repayments, it's never too early to get ahead on setting your kids up for university. Follow all the latest money news The average graduate now leaves university with a debt of £51,645, including tuition fees and maintenance loans, according to investment platform Lightyear. Students starting courses today fall under the new Plan 5 system. They repay 9% of earnings above £25,000, and repayments can continue for up to 40 years before any remaining balance is written off. That means children starting school now could still be repaying student debt in their sixties. So, as parents, if you are in a position to put money aside for your child, could you meaningfully reduce the long-term cost? First, let's look at how the new student loans work Student loans don't work like traditional bank loans. A graduate earning £45,000 today would repay around £1,800 a year under the rules. Over time, those payments can add up significantly, particularly given the length of the repayment period. Should parents save in cash or invest?  Parents can save up to £9,000 a year into a Junior ISA in the child's name, which can be held either in cash or invested. Known as a JISA, it's a tax-free savings or investment account for children under the age of 18. Top cash JISAs are paying up to 3.85%. For cautious savers, that can feel reassuring, particularly given the ups and downs investment markets can experience. Over long periods, however, investing in a diversified global equity portfolio has historically delivered stronger returns than cash, albeit with more short-term volatility along the way. \"As a firm, when modelling over longer timeframes, we tend to use cautious nominal assumptions such as: Cash growing at around 1% per year and investments growing at around 5% per year,\" Chicken explained. \"In practice, long-term returns from global stock markets have historically been higher than 5% per year, but we prefer to work on cautious assumptions when planning. \"Actual returns can vary significantly from year to year. The figures above are simply used to illustrate the long-term impact of compounding.\" Explained:How to get started with a stocks and shares ISA For more information about how we use your data and your rights, you can visit our Privacy Centre. The £15,000 choice While today's cash JISA rates are attractive, interest rates can change over time, and many people fall into the trap of leaving their cash to languish in poor paying accounts, rarely switching. Using those assumptions (1% cash and 5% investments), the difference over 18 years can be considerable. Take this example... To build a pot of at least £51,645 over 18 years: \"As you can see from the above example, long-term investment growth has the power to do a lot of the heavy lifting. It still requires regular saving, but the effect of compounding means a meaningful portion of the final pot can come from investment returns rather than direct contributions,\" Chicken said. \"Ultimately, cash plays an important role in protecting capital in the short-term. But over longer-term periods, it has often struggled to keep pace with inflation.\" How can you manage risk as university approaches?  The example above shows how, over the long term, a diversified global equity portfolio can offer the potential for stronger growth, albeit with periods where values fall along the way, Chicken said. When university is many years away, those short-term ups and downs tend to matter less. But as the point at which the money is needed approaches, market falls become more relevant. For that reason, it may be sensible to choose to reduce investment risk gradually in the final few years before university, for example, by moving part of the pot into cash, to lessen the risk of a market downturn just before fees are due. More Money news:Big fall in household energy bills predictedRetail warns of more job lossesPlan to raise minimum wage for young could face delay Junior ISAs v Parent Owned Accounts One of the main advantages of using a JISA is that investment growth is free from income tax and capital gains tax. Over 18 years, that tax efficiency can make a meaningful difference. The trade-off is loss of control. At age 18, the money legally becomes the child's. Parents ultimately have no control over how it is used and spent. An alternative is to invest in a parent's own name in, for example, an ISA or even a general investment account. These accounts legally remain the parents' assets, but they can be notionally earmarked for a child's future. \"The benefit of this route is flexibility. Parents keep full control over how and when money is distributed. If a child decides not to go to university, the pot could instead contribute towards a house deposit or other milestone,\" Chicken said. The drawback is that unless the money is in an ISA, the parents will pay tax at their usual rate - be that income tax or capital gains tax. In this case, if you have one parent who pays a higher tax rate than the other, it could make sense to put the funds into their name to minimise the tax due, though you should seek advice when considering how to do this. Who wants to make their baby a millionaire? For those lucky enough to have more to save for their child, it's amazing how much can be gifted at age 18. If parents or grandparents were to save £9,000 a year into a JISA, assuming growth of 5% a year, by age 18 that child could have a tax-free lump sum of nearly £266,000, Chicken said. If the child then transferred their JISA funds into an adult ISA at 18 and left it until retirement, it could grow to almost £1.8m if left untouched until age 57. If you want to give your child a huge boost to their retirement, contributing to a pension can be a good alternative, though the funds cannot be accessed until age 57 (assuming no change to current legislation). In depth: How to make your baby a millionaire Even if the child has no income, pension contributions still qualify for basic rate tax relief on total contributions of up to £3,600 a year. So this can be affordable for many families as a maximum gross contribution of £3,600 each year until age 18 costs £2,880 net annually (£51,840 over 18 years), with the government adding £720 in tax relief each year (£12,960 in total). Assuming 5% growth until age 57, and even with no further contributions after 18, the pension could still reach £737,000. \"There are lots of options for parents who can afford to put something away regularly for their children - and starting early can make it easier to ease at least some of their future financial burdens,\" Chicken added."
    },
    {
        "title": "UK has not agreed to let US strike Iran from British bases, Sky News understands",
        "description": "The UK has not agreed to allow the US to launch air strikes against Iran from a British base on Diego Garcia and another in Gloucestershire, it is understood.",
        "url": "https://news.sky.com/story/uk-has-not-agreed-to-let-us-strike-iran-from-british-bases-sky-news-understands-13509668",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-f-35-raf_7169608.jpg?20260219191355",
        "type": "Politics",
        "Author": "Deborah Haynes",
        "Date Published": "2026-02-19 17:41:00",
        "Headline": "The UK is not thought to be preparing to support the US in any military offensive against Iran, but has deployed six F-35 warplanes to Cyprus, and sent four Typhoon jets to Qatar, as part of efforts to bolster its own defences should an attack occur.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n The UK has not agreed to allow the US to launch air strikes against Iran from a British base on Diego Garcia and another in Gloucestershire, it is understood. The Times first reported the lack of permission. The newspaper said, as a result of the UK's reticence, Donald Trump had withdrawn his support for a deal struck by Sir Keir Starmer to hand the Chagos Islands, which include Diego Garcia, over to Mauritius. US military plans to strike Iran involve the use of a British and American military base on Diego Garcia as well as RAF Fairford in Gloucestershire, which hosts a US fleet of heavy bombers. Under long-standing agreements between London and Washington, the Pentagon is only able to launch operations from the two sites, as well as other air bases in the UK that are home to US warplanes and personnel, with advance approval from the British government. This has not yet been given in relation to any potential strike against Iran because of concern that such a mission would be a breach of international law, according to The Times. President Trump on Thursday said the world would find out \"over the next, probably, 10 days\" whether the US would reach a deal with Iran to end its nuclear ambitions - or take military action. He has been surging forces to the Middle East - including two giant aircraft carriers and supporting warships and jets - to increase his options for launching a significant military operation against the Islamic Republic should talks fail. Mr Trump spoke on Tuesday evening by phone with the British prime minister. The topics covered included the Iran crisis, but not the Chagos Islands. However, the following day, the president launched a new attack on Mr Starmer over the Chagos Islands deal, even after his own State Department had said it supported the UK's decision to give the territory to Mauritius and lease back Diego Garcia. In a post on social media, Mr Trump explicitly mentioned the utility of Diego Garcia and Fairford for US military operations against Iran, and appeared to suggest why it would be within international law for the UK to grant such deployments, given that it too could be under threat. \"Should Iran decide not to make a Deal, it may be necessary for the United States to use Diego Garcia, and the Airfield located in Fairford, in order to eradicate a potential attack by a highly unstable and dangerous Regime\" Mr Trump wrote on his Truth Social site. \"An attack that would potentially be made on the United Kingdom, as well as other friendly countries.\" He then said: \"We will always be ready, willing, and able to fight for the UK, but they have to remain strong in the face of Wokeism, and other problems put before them.\" Read more:Why is the Chagos Islands deal controversial?Trump to PM: 'Do not give away Diego Garcia' The UK is not thought to be preparing to support the US in any military offensive against Iran. However, the Royal Air Force has deployed six F-35 warplanes to RAF Akrotiri on Cyprus, and sent four Typhoon jets to Qatar, as part of efforts to bolster its own defences in the event of any Iranian counterattack in response to American strikes. On the Chagos Islands deal, the government has repeatedly defended its decision to hand over the territory to Mauritius, saying it would avoid a costly legal battle while securing access to Diego Garcia for 100 years."
    },
    {
        "title": "Andrew Mountbatten-Windsor: Is anyone truly above the law? ",
        "description": "<a href='https://podcasts.apple.com/us/podcast/electoral-dysfunction/id1613562765' target='_blank'> 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈</a>       ",
        "url": "https://news.sky.com/story/andrew-mountbatten-windsor-is-anyone-truly-above-the-law-13509651",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-electoral-dysfunction_7039456.png?20251030132307",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-19 16:52:00",
        "Headline": "No subtitle found",
        "Content": " 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈  Andrew Mountbatten-Windsor was arrested whilst Harriet and Ruth were in the middle of answering your questions for a half-term special whilst Beth is off on her holidays.  So in this episode, they react to the news that the former prince has been held on suspicion of misconduct in public office and discuss what it means for the rule of law. Later, they tackle questions on the government's latest U-turn over postponed local elections, and whether Reform UK is facing proper scrutiny over the Equality Act. Plus, as Sir Keir Starmer appoints the first woman head of the civil service, they ask why female public figures still face misogyny. And with major Special Educational Needs and Disabilities (SEND) reforms expected next week, Harriet and Ruth hear from parents who fear change could make a broken system worse, not better. Responding to Harriet's comments about Reform, a Reform UK spokesman said: \"Unlike Harriet, we don't need a pink bus to attract women to our party. \n                  Sir Keir Starmer to accuse Reform UK and Greens of being 'soft on Russia' and 'weak on NATO'\n                 \n                  Is a 'boys' club' undermining Starmer's government?\n                 \n                  Police search Peter Mandelson's properties in Camden and Wiltshire\n                 \"Reform has high-profile women throughout our cabinet and senior women in our party staff, unlike Starmer.\" And on the Equality Act, the spokesman added: \"Reform UK remains committed to supporting workplace protections against discrimination. No one should be treated unfairly because of their sex, race, if they are pregnant or have a disability. \"That's why we will introduce a new 'Workplace Fairness Act' to replace the Equality Act and ensure workplace protections are maintained whilst also re-asserting the rights of individuals rather than groups under the law. \"The Equality Act has been damaging to our economy, our society, and the way government works. It has unleashed the burdensome and unfair DEI culture that plagues workspaces and has enforced discrimination and equality of outcome. \"This has led to the unacceptable situation of unfair recruitment policies, positive discrimination and anti-white working-class bias, pitting different groups against each other and dividing our country.\" Got a question for the burner phone? WhatsApp 07934 200 444 or email electoraldysfunction@sky.uk. And if you didn't know, you can also watch Beth, Ruth, and Harriet on YouTube."
    },
    {
        "title": "Now 'even more important' Andrew gives evidence to US Congress, Harman says ",
        "description": "Baroness Harman has said Andrew Mountbatten-Windsor's arrest has heightened the need for him to testify to US politicians about his relationship with Jeffrey Epstein.",
        "url": "https://news.sky.com/story/now-even-more-important-andrew-gives-evidence-to-us-congress-harman-says-13509490",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-andrew-prince-andrew_7169038.jpg?20260219112315",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-19 11:33:00",
        "Headline": "The Labour peer tells Sky News the former prince's arrest means he should provide evidence about his relationship with Jeffrey Epstein.",
        "Content": "Baroness Harman has said Andrew Mountbatten-Windsor's arrest has heightened the need for him to testify to US politicians about his relationship with Jeffrey Epstein. It follows the former prince being taken into custody by Thames Valley Police on Thursday - his birthday - over allegations of misconduct in a public office. He has previously denied all allegations of wrongdoing. Speaking on the Electoral Dysfunction podcast, Harriet Harman said: \"I think it also makes it even more important that Prince Andrew agrees to go to give evidence to Congress on the investigations that they're doing there.\" Andrew latest - follow live The US Congress has been publishing documents relating to deceased paedophile Jeffrey Epstein over recent months, the so-called Epstein files. In November, Democrats on the US House Oversight Committee wrote to the former prince, asking him to travel to Washington DC to testify before them about his relationship with the disgraced financier. This followed Mountbatten-Windsor being stripped of his royal titles. \n                  Andrew Mountbatten-Windsor released under investigation after arrest for misconduct in public office\n                 \n                  King Charles and Thames Valley Police statements on Andrew Mountbatten-Windsor's arrest\n                 \n                  Andrew Mountbatten-Windsor arrest 'worst possible thing' for the Crown, Sky's royal commentator says\n                 You can listen to the full episode of Electoral Dysfunction tomorrow morning - follow here to listen wherever you get your podcasts. Speaking following his arrest, Baroness Harman told Sky News: \"Well, I think it was inevitable once there was started to be investigation on Peter Mandelson for leaking information, which was supposedly confidential government economic and commercial information, that if those emails appeared to show Prince Andrew when he was trade envoy doing the exact same thing, that he would have to be investigated and arrested as well.\" Lord Mandelson remains under police investigation over allegations he leaked government information while serving as business secretary - under then-PM Gordon Brown - something he denies. Politics latest - follow live Mountbatten-Windsor was appointed by the government as a trade envoy in 2001. He held the role - which gave him had access to senior ministers and business contacts - for a decade, in which time he travelled the world promoting the UK. Baroness Harman continued: \"I think that this is an absolutely unprecedented moment of huge implications because I think what's happened is that Epstein emails have broken open the secrecy about how very rich, powerful, and sometimes royal men behave. \"Remember that Andrew has been arrested by police who are part of His Majesty's constabulary. These are the King's police. If it were to go to court, it is His Majesty's court. But as the prime minister said, nobody should be above the law.\" She said the arrest would have \"huge implications\" for the Royal Family. Her podcast co-host, former Scottish Conservative leader Ruth Davidson, agreed, saying images of police cars arriving at the Sandringham Estate in Norfolk to arrest Mountbatten-Windsor are the \"sort of pictures you never thought you would see\". She added: \"The human side of me is thinking, thank God the late queen didn't live to see this, because it would have broken her heart. \"But then the kind of, the rational side of my brain kicks in. People who may have committed crimes - that we're finding out about through the Epstein trials being opened - should face that in the same way.\" Ms Davidson added: \"Even the investigations happening now, none of them are touching at the fundamental question of why were young women and girls trafficked around the world to be abused by rich and powerful men and why are no rich and powerful men being questioned about that element of any of this.\""
    },
    {
        "title": "Hillsborough Law will 'criminalise lying' by senior ministers, say campaigners",
        "description": "Hillsborough Law will make it a criminal offence for prime ministers and cabinet ministers to deliberately mislead the public &#8211; but not backbench MPs. ",
        "url": "https://news.sky.com/story/hillsborough-law-will-criminalise-lying-by-senior-ministers-say-campaigners-13509580",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-hillsborough-law-liverpool_7022734.jpg?20250917095229",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2026-02-19 14:07:00",
        "Headline": "It's via a new standalone offence - which will apply to the prime minister - of \"misleading the public\", punishable by up to two years in jail.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Hillsborough Law will make it a criminal offence for prime ministers and cabinet ministers to deliberately mislead the public – but not backbench MPs.  Democracy campaigners say a \"historic\" measure within the flagship legislation has gone under the radar, which is a move to \"criminalise lying\" by senior politicians. That is through a new standalone offence of \"misleading the public\", punishable by up to two years in jail. This will apply to heads of government departments, civil servants and public officials such as police and NHS staff, if they intentionally mislead the public in a way that is \"seriously improper\". MPs and peers are currently exempt - but dozens of backbenchers argue that should not be the case. Labour MP Neil Duncan-Jordan told Sky News: \"MPs shouldn't be above the law. Politicians have such a low standing with the public and that's got to change.\" Mr Duncan-Jordan is one of over 30 MPs who have backed an amendment by Labour MP Luke Myer, calling for the remit to be extended to all members of both houses of parliament. Mr Myer is understood to have held discussions with ministers and backbench colleagues to ramp up support for his plan ahead of the bill returning to the Commons for its report stage. 'No-brainer' One Labour source described it as \"turkeys voting for Christmas\", but independent MP Rosie Duffield, who resigned from the party in 2024, said backing the amendment should be a \"no-brainer\". The Canterbury MP said trust is at an \"all-time low\" and the new offence could stop ministers lying or withholding information about connections to certain people or companies. She said that level of transparency should also apply to \"ordinary backbenchers\" to restore trust, as \"when a few at the top are embroiled in scandal, it besmirches us all\". Bill's delayed journey through parliament Hillsborough Law's passage through parliament was pulled last month following a row between the government and Hillsborough families over how it would apply to the security services. Liverpool MP Ian Byrne, who has led work on Hillsborough Law and supports Mr Myer's amendment, this week urged the prime minister to apply it in full to all public officials \"without further delay\", saying the Peter Mandelson scandal shows exactly why it is necessary. The bill - officially known as the Public Office Accountability Bill - follows a decades-long campaign by families bereaved by the 1989 football stadium disaster, which claimed 97 lives and led to a cover-up of police failings. Much of its focus has been on the duty of candour, which establishes new requirements for public officials to act with honesty during investigations and inquiries into the state. This duty is under pinned by the misleading the public offence, but the offence itself is not limited to inquiries. Campaigner Marcus Ball, who tried to prosecute Boris Johnson over claims on Vote Leave's \"Brexit Bus\", described this as a \"historic\" move which would \"criminalise lying in politics\" for the first time. However, he called for the offence's remit to be extended, saying it is \"completely illogical that this same law does not extend to backbench MPs or Lords\". Free speech concerns The government argues MPs and peers should be exempt as they do not make decisions on behalf of the state. Experts said this is still a significant step towards a better culture of accountability, though not as straightforward as punishing ministers for \"telling fibs\". The government has added a clause which requires proof of harm or potential harm in order to be charged with misleading the public, which some MPs argue could weaken its effectiveness. However, other MPs have expressed concern about free speech. Conservative MP Mike Wood argued in the Commons that the new offence may subject ministers to \"politically motivated lawfare\", and disagreements \"must be a matter for the ballot box rather than the courtroom\". Read more from Sky News:Andrew released after arrestSky News gains rare access to Bank's gold vaults Officials stress the offence is intended for serious cases, such as public officials spreading false narratives about events - as happened with Hillsborough. It won't apply to words said in parliament as that is covered by privilege, a long-standing convention that allows politicians to debate freely. A government spokesperson said: \"We are committed to delivering this vital piece of legislation, changing the balance of power, so the state must always act for the people it serves. The Hillsborough disaster will remain in our national consciousness for its tragedy and disgraceful injustice. \"The bill will lead to a public service that truly acts in the public interest. But for those who don't, there will be criminal sanctions for the most serious breaches, including for misleading the public in a way which is seriously improper.\""
    },
    {
        "title": "Pupils with SEND to have support reviewed when they join secondary school",
        "description": "Ministers will introduce reforms so that children with special educational needs (SEND) will have their support reviewed as they move from primary to secondary school.",
        "url": "https://news.sky.com/story/pupils-with-send-to-have-support-reviewed-when-they-join-secondary-school-13509414",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-classroom-teaching_7156196.jpg?20260205103147",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-19 09:44:00",
        "Headline": "The government is understood to be considering a range of changes, one of which it hopes will reduce the number of children relying on Education Health and Care Plans (EHCP).",
        "Content": "Ministers will introduce reforms so that children with special educational needs (SEND) will have their support reviewed as they move from primary to secondary school. The move is one of the key changes that will be introduced to reform the SEND system by Education Secretary Bridget Phillipson, as part of a wider package of measures, Sky News understands. The full details of the proposals are expected to be revealed on Monday, when parliament returns from recess. Politics latest - follow live But one of the key planks of the reforms will be reducing the reliance of children with SEND on Education Health and Care Plans (EHCP). What are EHCPs, and what's the problem with them? These plans are legally binding and support children and young adults up to the age of 25. But the number of people with them has nearly doubled since 2017. \n                  Screen time linked to poor speech development in under-fives, say ministers as parents offered new guidance\n                 \n                  Will the fight for deputy Labour leader save the PM - or undermine his leadership even more?\n                 \n                  Starmer's national security adviser played no role in collapse of China spy trial, cabinet minister says\n                 It is due to rise further by the end of the decade - putting huge financial pressure on local authorities, who fund special educational needs provision. The increase has also led to long waiting lists, while unhappy families who initially fail to get the plans are increasingly going to court to overturn that decision - with 99% of appeals accepted in 2023. But the County Councils Network says that for all their cost and effort, EHCPs aren't actually improving educational outcomes, and the system needs \"root and branch\" reform to stop councils being pushed to the financial brink. The government appears to have also come to the same conclusion, as one of the main reforms to the SEND system will see children with EHCPs reassessed as they move from primary to second school. It is expected that this will reduce the number of children relying on EHCPs. Government figures show around 19% of children currently get the plans between age 10-11, as they transition from primary to secondary school. Sector sources previously suggested EHCPs could be limited to only children with the most severe needs, but it is not clear if the elements leaked today are a departure from that plan or part of it. New form of SEND plan to be introduced for some As first reported by the BBC, children who don't get EHCPs but have extra needs, will get a new identified special educational needs plan or Individual Support Plan (ISP) from their school. It is understood that the ISPs will have some sort of legal protection. However, if these plans are written by schools, it is not clear who parents would appeal to if they are not happy. Government sources have insisted that this is not about taking rights away from people, and that no child would lose a place in a special school once they have one. The idea is that mainstream schools will take on more of the responsibility for moderate special needs provision, rather than local authorities. However, it is not clear how they will be funded to do so. No changes are expected to come into place for 2029, so it may be that there are no changes at all before the next general election."
    },
    {
        "title": "Battle of the wind farms: Can the 'blockers' beat the government?",
        "description": "\"An ineffective form of renewable energy&#8230; carpet-bombing the countryside&#8230; irreversible damage.\"",
        "url": "https://news.sky.com/story/battle-of-the-wind-farms-can-the-blockers-beat-the-government-13509640",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-wind-farm-teaser-image_7169853.jpg?20260219233616",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-02-19 16:37:00",
        "Headline": "Some admit they're NIMBYs. Others say that word doesn’t mean what you think it means…",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n \"An ineffective form of renewable energy… carpet-bombing the countryside… irreversible damage.\" These are the noisy, angry and organised campaigners against onshore wind in Wales. Dozens of new projects are set to sweep across the rolling hills of Cymru as the government races to hit its clean power targets. It says it is willing to take on the \"blockers\" to build hundreds of these soaring steel giants, aiming to make energy cheaper, cleaner and more secure. But in Wales, these \"blockers\" see themselves as environmentalists too: nature lovers who fear the plans will mar their countryside and culture forever. They are convinced there are better ways for Wales to go green. So who is really saving Wales? \"No more pylons\" chant a few hundred protesters outside the Welsh parliament on a cold - not to mention windy - February lunchtime. Many at the protest distance themselves from Reform UK politicians, who have vocally opposed onshore wind because they question the extent to which the climate is changing at all. \"Very few of us are climate deniers,\" one protester says in Cardiff. \"We all realise there is a problem… the question is: how do we resolve it?\" The answer, they say, is with a mixture of offshore wind, community projects and rooftop solar, arguing these can meet Wales's needs without building turbines that will also send power to England. For they are irked by a sense that history is repeating itself: another Welsh resource - following water and coal - harvested to keep England's lights on. But with electricity demand due to at least double in Wales by 2050, and 60% of it still coming from gas, Labour say doing without onshore wind is a luxury it cannot afford. Welsh Labour told Sky News it would be \"challenging to deliver the scale of electricity required at the pace needed for a climate emergency, if we were to rely wholly on community owned generation\". The ghost of Hendy wind farm The shadow of the Hendy wind farm looms large over the debate. Seven \"ghost turbines\" in Powys built despite the council's objection, which were never connected to the grid. While the industry calls Hendy an anomaly, locals see it as a cautionary tale of broken promises and reckless haste. It's why they are digging in against the proposed Nant Mithil energy park. The project would plant turbines 220m high - twice the height of Big Ben - on the peaceful hilltop of Radnor Forest. While the site could power 130,000 homes, campaigner Nigel Dodman sees only \"ecological disaster.\" \"Because of the industrialisation, the 27 kilometres of roadways they'd have to build, all the construction work that goes on,\" he says. \"Do we ruin this landscape and its ecology,\" he asks, \"or do we preserve it for generations to come?\" What does the majority say? While the protest is loud, the data suggests they are swimming against the tide. Nearly 80% of Welsh citizens are comfortable seeing turbines, versus 22% who aren't, according to polling by thinktank More In Common. A UK government survey finds more people in Britain would be happy to host onshore wind in their area, than those who would not. But support waivers at a hyper-local level, with widespread local opposition to Nant Mithil and another planned for Powys called Garreg Fawr. And these vocal minority know net zero policy is on the line at the Welsh elections in May. They have also won the support of the Campaign to Protect Rural Wales (CPRW). Its trustee Jonathan Dean says: \"Onshore wind is quicker and easier to build, but we do have time to do this properly.\" He says Labour cannot take public support for its clean power push for granted. \"If public displeasure continues to increase, and a political party intent on 'cancelling net zero' gains any power, we get the worst possible outcome. Net zero needs to maintain its 'social licence'.\" Meanwhile, the industry itself is attempting to sweeten the deal, offering above-average, though voluntary, funding for local communities hosting energy infrastructure, on top of jobs and training. Jess Hooper from trade body RenewableUK Cymru said: \"For the areas around the wind farms themselves, there's community benefit funds, in excess of £6m being realised annually. \"There's then the economic opportunity from jobs and economic growth that comes with it and investment into our rural heartlands that haven't seen such investment in many, many years.\" 'Next, it might be you' Wherever the energy comes from, an explosion of new projects are in the pipeline to meet soaring demand. This fact, combined with the upcoming elections, ups the stakes for the government to persuade people that the trade-offs are worth it. As for the NIMBYs, one protester in Cardiff says: \"Yes, we are NIMBYs, but also we don't understand why when there are so many alternatives they have to start destroying, basically un-messed with areas of countryside.\" Nigel Dodman tells me: \"I say that there's a new definition of NIMBY which is… 'Next, it might be you'.\""
    },
    {
        "title": "Universal vaccine for cold, flu, COVID and allergies moves a step closer, scientists say",
        "description": "A universal vaccine for humans against cold, flu, COVID and allergies has moved a significant step closer following a study using mice, scientists say.",
        "url": "https://news.sky.com/story/universal-vaccine-for-cold-flu-covid-and-allergies-moves-a-step-closer-scientists-say-13509462",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-c-cold-flu_7169386.jpg?20260219151714",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-19 11:11:00",
        "Headline": "It is hoped that in the next few years, the vaccine could replace multiple jabs for winter respiratory infections.",
        "Content": "A universal vaccine for humans against cold, flu, COVID and allergies has moved a significant step closer following a study using mice, scientists say. The vaccine, which could be given as a nasal spray, has been developed by experts at Stanford Medicine in the US. It may protect against a wide range of respiratory viruses, bacteria and allergy triggers, they claimed. Scientists said the vaccine offered broad protection in the lungs of mice for several months. Vaccinated animals were protected against COVID and other coronaviruses, Staph (which can infect the skin and cause sepsis), Acinetobacter baumannii (which can cause infections in the blood, urinary tract, lungs or wounds), and house dust mites. This form of vaccine, if translated into humans, could replace multiple jabs every year for winter respiratory infections. It also has the potential to work against new pandemic bugs. Lead author Dr Bali Pulendran, from Stanford Medicine, said: \"I think what we have is a universal vaccine against diverse respiratory threats. \"Imagine getting a nasal spray in the fall months that protects you from all respiratory viruses including COVID-19, influenza, respiratory syncytial virus and the common cold, as well as bacterial pneumonia and early spring allergens. \"That would transform medical practice.\" The researchers are now hoping to trial the vaccine on humans. A safety trial would be followed by a larger trial in which patients are exposed to infections. Dr Pulendran thinks two doses of the nasal spray would be sufficient to provide protection in people. He estimates the vaccine might be available in five to seven years, if there is enough funding. Read more from Sky News:Who is Dame Antonia Romeo?Retail warns of more job losses In the study, a drop of the vaccine was administered to mice through their noses. The vaccine offered protection for several months against various forms of viral infections, bacterial respiratory infections and house dust mites - a common trigger for allergic asthma. Researchers were able to demonstrate protection in mice and showed that helpful T cells in the lungs, which are working against pathogens, could send signals to the body's innate immune cells to keep them active. Instead of trying to mimic part of a pathogen, the vaccine mimics the signals that immune cells use to communicate with each other during an infection. Professor Brendan Wren, from the London School of Hygiene and Tropical Medicine, said it was a \"potentially promising approach that could have wide applications and implications\" but he cautioned it was \"early days\". He added there was \"a long road to go before we'll know if this approach produces a safe and effective vaccine for humans\". The new vaccine, known for now as GLA-3M-052-LS+OVA, mimics the T cell signals that directly stimulate innate immune cells in the lungs. It also contains a harmless antigen that recruits T cells into the lungs to help the body fend off pathogens for weeks or months. The study was published in the journal Science."
    },
    {
        "title": "'This was addiction by design... I call it murder': Parents' anger as Zuckerberg faces court",
        "description": "Grieving parents awaited Mark Zuckerberg's arrival at a courthouse in downtown Los Angeles for what is being called the social media industry's \"big tobacco moment\".",
        "url": "https://news.sky.com/story/this-was-addiction-by-design-i-call-it-murder-parents-anger-as-zuckerberg-faces-court-13509367",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lori-schott-social-media_7168797.jpg?20260219054310",
        "type": "Technology",
        "Author": "Martha Kelner",
        "Date Published": "2026-02-19 05:40:00",
        "Headline": "The Facebook founder has appeared in front of a jury for the first time, responding to the allegation that he put profit over the health and wellbeing of children.",
        "Content": "\n          US correspondent\n              @marthakelner\n Grieving parents awaited Mark Zuckerberg's arrival at a courthouse in downtown Los Angeles for what is being called the social media industry's \"big tobacco moment\". \"I'm comforted by the fact he's here alone, with only his lawyers and a jury. He's without his lobbyists or his PR machine,\" says Lori Schott, whose 18-year-old daughter Annalee had a social media addiction and died by suicide in 2020. \"If we would have been here in this court 10 years earlier she would have still been alive,\" she adds. 'They knew what they were doing' Lori tells me how Annalee, who she describes as the central cog of their family, grew up on a farm in rural Colorado, but an interest in rodeos and horses was superseded by addiction to social media. On TikTok and Instagram, she would use beauty filters, says Lori, and compare herself to other girls. Annalee's anxiety and depression grew, and she even viewed a live suicide video online. \"They [the social media companies] knew what they were doing,\" says Lori. \"They did it for profit motives, and it's got to stop. Our children deserve to take control of their own digital footprint. \"My daughter shouldn't have had content pushed at her that said she was ugly, or her life had no future. This was an addiction by design, metrics were set on increasing usage. Some call it capitalism, I call it murder.\" Lori argues social media platforms are inherently addictive, and that the addictive nature of them has led to a host of personal harms. That is also the allegation being made by the plaintiff in this case, a 20-year-old, referred to in court as \"Kaley GM\". She became an Instagram user aged nine and developed an addiction to many social media platforms. Kaley GM suffered from negative body image, anxiety and depression, her lawyers say. TikTok and Snapchat have both reached settlements in the lawsuit, leaving Meta and Google as the remaining defendants. Zuckerberg draws the crowds Kaley GM's is the first of nine separate trials in Los Angeles by nine different plaintiffs who claim that when they were minors they became addicted to social media and suffered varying harms. Mr Zuckerberg, the CEO of Meta, which owns and operates Facebook and Instagram was appearing in front of a jury for the first time, responding to the allegation that he put profit over the health and wellbeing of children. He arrived at court flanked by bodyguards and sat nervously as he waited to take the stand. When he testified, the plaintiff KGM was sitting directly in his eye line, but he never looked at her. He nodded at the 12 jury members as they made their way to the box. The interest in this case is so massive that the court held a \"lottery\" to determine who would \"win\" a seat in the public gallery to see Mr Zuckerberg. Raffle tickets were drawn and even some of the bereaved parents who travelled across the country to be here for this watershed trial were not allowed inside the room. Zuckerberg in court - as it happened The plaintiff's lawyer, Mark Lanier, focused on Instagram's stated policy of not allowing under-13s on the platform. Mr Lanier argued that not only did Instagram know there were users under 13, but the company aggressively sought to recruit them to the platform. On three screens inside the courtroom he displayed an internal Meta memo from 2018. \"If we want to win big with teens, we must bring them in as tweens,\" it said. \"We have definitively established tweens as the highest retention age group in the US.\" But Mr Zuckerberg bristled at the suggestion that Instagram is designed to be harmful to children. \"I'm focused on building a community that is sustainable,\" he said. \"If you do something that's not good for people, maybe they'll spend more time [on Instagram] short term, but if they're not happy with it, they're not going to use it over time. I'm not trying to maximise the amount of time people spend every month.\" He sparred with Mr Lanier, repeatedly accusing him of mischaracterising his testimony on the stand and previous statements he had made to Congress. There was no \"gotcha\" moment with Mr Zuckerberg and there is still plenty more testimony to come. But if the plaintiff in this lawsuit is successful there may be thousands more similar cases waiting in the wings. It could drastically alter the way the social media industry operates."
    },
    {
        "title": "Bill Gates withdraws from Indian AI Impact Summit",
        "description": "The Indian AI Impact Summit was meant to demonstrate that the country is a serious player in AI and serve as its showcase.",
        "url": "https://news.sky.com/story/bill-gates-withdraws-from-indian-ai-impact-summit-13509392",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-bill-gates-micosoft_7168854.jpg?20260219082122",
        "type": "Technology",
        "Author": "Neville Lazarus",
        "Date Published": "2026-02-19 08:13:00",
        "Headline": "Mr Gates was scheduled to speak alongside Prime Minister Modi, French President Macron and others notable guests.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n The Indian AI Impact Summit was meant to demonstrate that the country is a serious player in AI and serve as its showcase. However, it has been dogged by controversies of alleged mismanagement, inconvenience to delegates, exhibitors and the public due to security sweeps, and allegedly false claims by an Indian University. The official claimed that a Chinese 'robodog' was developed by her Galgotias University - with the institution later apologising for the minsunderstanding. But it has been the participation of the co-founder of Microsoft, Bill Gates, who was to give a key address on the inauguration day, that has been the most damaging. Mr Gates was scheduled to speak today alongside Prime Minister Narendra Modi, French President Emmanuel Macron, Google head Sundar Pichai, OpenAI chief executive Sam Altman and others. Just hours before he was due to speak, a social media post by the Gates Foundation said: \"After careful consideration, and to ensure the focus remains on the AI summit's key priorities, Mr Gates will not be delivering his keynote address. \"The Gates Foundation remains fully committed to our work in India to advance our shared health and development goals.\" \n                  Bill Gates speeds up plans to give away his fortune\n                 \n                  Bill Gates says he would be diagnosed with autism if he was young today\n                 \n                  Bill Gates says AI will make it easier to combat climate change but must be 'used by people with good intent'\n                 There was much consternation about Mr Gates taking part in such a high-profile event when last month the US Justice Department released emails, photographs and documents of his exchange with convicted sex offender Jeffrey Epstein. Read more from Sky News:British couple sentenced to 10 years in prison in IranFormer South Korean president Yoon Suk Yeol handed life sentence Mr Gates maintains that his relationship and repeated meetings with Epstein were confined to philanthropy-related discussions and that it was a mistake for him to meet Epstein. Until yesterday, the Gates Foundation asserted and stated, \"Bill Gates is attending the AI Impact Summit. He will be delivering his keynote as scheduled.\""
    },
    {
        "title": "Tetris can help tackle memories of past trauma, study finds",
        "description": "Playing Tetris could help tackle memories of past trauma, research has found.",
        "url": "https://news.sky.com/story/tetris-can-help-tackle-memories-of-past-trauma-study-finds-13509361",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-tetris-trauma_7168792.jpg?20260219010435",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-19 00:55:00",
        "Headline": "Experts have called the findings \"a real breakthrough\" and claim the impact of the study could be \"enormous\". ",
        "Content": "Playing Tetris could help tackle memories of past trauma, research has found. The trial included close to 100 NHS staff who had been exposed to trauma at work - such as witnessing deaths during the pandemic. It found those who played the classic video game as part of their treatment experienced fewer flashbacks. The study was carried out by researchers in the UK and Sweden, with experts now hoping to test the method on a larger group of people. Known as imagery competing task intervention (ICTI), the treatment involved some 40 patients playing a slow version of Tetris while briefly recalling a traumatic memory. The group were the asked to use their mind's eye to imagine the game's grid and visualise the blocks. ICTI is thought to weaken the vividness of the traumatic memories by occupying the brain's visuospatial areas, responsible for analysing and understanding physical space. Emily Holmes, a professor of psychology at Uppsala University, who led the study, said: \"Even a single, fleeting intrusive memory of past trauma can exert a powerful impact in daily life by hijacking attention and leaving people at the mercy of unwanted and intrusive emotions. \"By weakening the intrusive aspect of these sensory memories via this brief visual intervention, people experience fewer trauma images flashing back.\" The remaining patients in the study either received standard treatment, or listened to music by Mozart - along with podcasts about the Austrian composer. Read more from Sky News:'Change your AI generated passwords immediately'Tech firms face being blocked from UK The findings showed that, within four weeks, those who received the ICTI treatment had 10 times fewer flashbacks compared to other groups. After six months, 70% reported having no intrusive memories at all. The treatment also helped tackle symptoms of post-traumatic stress disorder. 'A real breakthrough' Prof Holmes called the study \"a real breakthrough\", insisting that while the treatment is more than just playing Tetris, it is designed to be \"as gentle, brief, and practical as possible to fit into people's busy lives\". Tayla McCloud, research lead for digital mental health at Wellcome - which funded the study - claimed the impact of the trial could be \"enormous\". Ms McCloud said: \"It's rare to see something so accessible, scalable and adaptable across contexts. It doesn't require patients to put their trauma into words and even transcends language barriers.\" The apparent psychological impact of the game, which was created in 1984 by Alexey Pajitnov, has previously led to the coining of a phenomenon known as the Tetris Effect, with some claiming to see falling blocks in their dreams or buildings move together in the street after spending hours playing the game."
    },
    {
        "title": "Tetris can help tackle memories of past trauma, study finds",
        "description": "Playing Tetris could help tackle memories of past trauma, research has found.",
        "url": "https://news.sky.com/story/tetris-can-help-tackle-memories-of-past-trauma-study-finds-13509361",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-tetris-trauma_7168792.jpg?20260219010435",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-19 00:55:00",
        "Headline": "Experts have called the findings \"a real breakthrough\" and claim the impact of the study could be \"enormous\". ",
        "Content": "Playing Tetris could help tackle memories of past trauma, research has found. The trial included close to 100 NHS staff who had been exposed to trauma at work - such as witnessing deaths during the pandemic. It found those who played the classic video game as part of their treatment experienced fewer flashbacks. The study was carried out by researchers in the UK and Sweden, with experts now hoping to test the method on a larger group of people. Known as imagery competing task intervention (ICTI), the treatment involved some 40 patients playing a slow version of Tetris while briefly recalling a traumatic memory. The group were the asked to use their mind's eye to imagine the game's grid and visualise the blocks. ICTI is thought to weaken the vividness of the traumatic memories by occupying the brain's visuospatial areas, responsible for analysing and understanding physical space. Emily Holmes, a professor of psychology at Uppsala University, who led the study, said: \"Even a single, fleeting intrusive memory of past trauma can exert a powerful impact in daily life by hijacking attention and leaving people at the mercy of unwanted and intrusive emotions. \"By weakening the intrusive aspect of these sensory memories via this brief visual intervention, people experience fewer trauma images flashing back.\" The remaining patients in the study either received standard treatment, or listened to music by Mozart - along with podcasts about the Austrian composer. Read more from Sky News:'Change your AI generated passwords immediately'Tech firms face being blocked from UK The findings showed that, within four weeks, those who received the ICTI treatment had 10 times fewer flashbacks compared to other groups. After six months, 70% reported having no intrusive memories at all. The treatment also helped tackle symptoms of post-traumatic stress disorder. 'A real breakthrough' Prof Holmes called the study \"a real breakthrough\", insisting that while the treatment is more than just playing Tetris, it is designed to be \"as gentle, brief, and practical as possible to fit into people's busy lives\". Tayla McCloud, research lead for digital mental health at Wellcome - which funded the study - claimed the impact of the trial could be \"enormous\". Ms McCloud said: \"It's rare to see something so accessible, scalable and adaptable across contexts. It doesn't require patients to put their trauma into words and even transcends language barriers.\" The apparent psychological impact of the game, which was created in 1984 by Alexey Pajitnov, has previously led to the coining of a phenomenon known as the Tetris Effect, with some claiming to see falling blocks in their dreams or buildings move together in the street after spending hours playing the game."
    }
]