[
    {
        "title": "Government makes concessions to Labour rebels over welfare reforms",
        "description": "The government has made an offer to rebel Labour MPs over its controversial welfare reforms, Sky News understands.",
        "url": "https://news.sky.com/story/government-to-make-concessions-to-labour-rebels-over-welfare-reforms-sky-news-understands-13388797",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-starmer-labour_6950635.jpg?20250625171042",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-26 20:20:00",
        "Headline": "Sir Keir Starmer has made an offer to rebel MPs in a bid to pass his reforms to the welfare and benefits.",
        "Content": "The government has made an offer to rebel Labour MPs over its controversial welfare reforms, Sky News understands. More than 120 Labour MPs were poised to vote against the Universal Credit and Personal Independence Payment (PIP) Bill on Tuesday. The changes come after a ring-around by cabinet ministers failed to bring rebels on side. The bill was intended to restrict eligibility for the PIP - the main disability payment in England- and limit the sickness-related element of universal credit, to help shave £5bn off the welfare budget by 2030. Politics latest: Government to make offer to rebels 'We have listened' A spokesperson for Downing Street said: \"We have listened to MPs who support the principle of reform but are worried about the pace of change for those already supported by the system. \"This package will preserve the social security system for those who need it by putting it on a sustainable footing, provide dignity for those unable to work, supports those who can and reduce anxiety for those currently in the system. \"Our reforms are underpinned by Labour values and our determination to deliver the change the country voted for last year.\"  Liz Kendall, the welfare secretary, said in a letter to MPs there would be two changes to the bill, including ensuring that all of those currently receiving PIP \"will stay within the current system. \"The new eligibility requirements will be implemented from November 2026 for new claims only,\" Ms Kendall said. \"Secondly, we will adjust the pathway of Universal Credit payment rates to make sure all existing recipients of the UC health element - and any new claimant meeting the severe conditions criteria - have their incomes fully protected in real terms.\" Sky News political editor Beth Rigby was earlier on Thursday told existing PIP claimants will be able to keep their payments, which means 370,000 people will not lose out. This will cost the government at least £1.5bn, according to the Institute for Fiscal Studies. Sky News understands that a senior source has accepted the change, but it will be up to each individual rebel to make a decision on whether to withdraw. Read more:Welfare bill: A humiliating blow for Starmer The source said they think the changes are a \"good package\" with \"generous concessions\". A reasoned amendment signed by 126 Labour MPs argued that disabled people had not been properly consulted and further scrutiny of the changes is needed. If passed, this would have killed the bill. Sky News understands that some senior rebels are willing to accept the concessions - with one saying that \"the concessions will be positively received, and I expect to vote with the government now\". Other MPs who had not wanted to rebel were also expecting to change their votes. However, several Labour MPs on the left of the party have gone public to say they will still oppose the government, including Diane Abbott, Richard Burgon, Nadia Whittome and Brian Leishman. Conservative shadow chancellor Sir Mel Stride said the change would mark a \"screeching U-turn\" - and claimed the changes mark \"another unfunded spending commitment\". Meanwhile, Helen Whately, shadow work and pensions secretary, said: \"This is another humiliating U-turn forced upon Keir Starmer. \"With the sickness benefits bill set to reach £100 billion by 2030 the country needs action. But Labour has lurched from a bad plan to a next-to-nothing plan. \"The latest 'deal' with Labour rebels sounds a lot like a two-tier benefits system, more likely to encourage anyone already on benefits to stay there rather than get into work.\" What is PIP? The biggest shakeup to the system involved changes to PIP - money given to people, including some of whom are in work - who have extra care needs or mobility needs as a result of a disability. People who claim it are awarded points depending on their ability to do certain activities, such as washing and preparing food, and this influences how much they will receive. From November 2026, people would have needed to score a minimum of four points in at least one activity to qualify for the daily living element of PIP - instead of fewer points spread across a range of tasks. This would have impacted existing claimants as well as new ones. The government's concessions are understood to see this change dropped for existing claimants. Universal credit The government intended to freeze the health element of universal credit, claimed by more than two million people, at £97 a week during this parliament, and cut the rate to £50 for new claimants. Again, it's understood the government's concessions mean this change now won't apply to existing claimants."
    },
    {
        "title": "Welfare bill: A humiliating blow for Starmer, and the fallout will be felt way beyond this week",
        "description": "First there was stonewalling, then the private complaints from MPs before a very public outburst that saw an eye-watering 127 MPs tell their prime minister they were going to defy him on a welfare vote.",
        "url": "https://news.sky.com/story/welfare-bill-a-humiliating-blow-for-starmer-and-the-fallout-will-be-felt-way-beyond-this-week-13389181",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-beth-rigby_6915218.jpg?20250513140605",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-26 22:43:00",
        "Headline": "A government with a massive 165-strong working majority, has had an awakening to the importance of parliament as it embarked on a humiliating climbdown after the private warnings of MPs to Downing Street fell on deaf ears.",
        "Content": "\n          Political editor\n              @BethRigby\n First there was stonewalling, then the private complaints from MPs before a very public outburst that saw an eye-watering 127 MPs tell their prime minister they were going to defy him on a welfare vote. Now, the inevitable climbdown has arrived, with Downing Street making a significant offer to rebels last night on their planned cuts to disability benefits. A government with a massive 165-strong working majority, had an awakening on Thursday to the importance of parliament as it embarked on a humiliating climbdown after the private warnings of MPs to Downing Street fell on deaf ears. It's worth taking a beat to reflect on the enormity of this moment. Less than a year ago, the prime minister was walking into No. 10 having won a landslide, with a Labour majority not seen since the Blair era. That he has been forced to retreat by angry foot soldiers so early in this premiership, despite having such a big majority, is simply unprecedented. No government has lost a vote at second reading - this basically the general principles of a bill - since 1986 (Thatcher's shops bill) and that was the only occasion a government with a working majority lost a bill at the second reading in the entire 20th century. It is obviously a humiliating blow to the authority of the prime minister from a parliamentary party that has felt ignored by Downing Street. And while No. 10 has finally moved - and quickly - to try to shut down the rebellion, the fallout is going to be felt long beyond this week. Before we get into the problems for Starmer, I would like to acknowledge the predicament he's in. \n                  Who will take the fall for welfare chaos?\n                 \n                  UK to buy F-35 stealth jets that can carry US nuclear warheads\n                 \n                  Welfare versus warfare - the PM has made his choice but faces the hardest fight of his premiership\n                 Over the past 10 days, I have followed him to the G7 in Canada, where the Iran-Israel crisis, US-UK trade deal and Ukraine war were on the agenda, to Chequers at the weekend as he tried to deal with the US attack on Iran and all the risk it carried, and to the NATO summit this week in the Netherlands. He could be forgiven for being furious with his operation for failing to contain the crisis when all his attention was on grave international matters. He landed back in Westminster from the NATO summit on Wednesday night into a domestic battle that he really didn't need but moved quickly to contain, signing off a plan that had been worked up this week in Downing Street to try to see of this rebellion.  What will the changes be? At the time of writing this, the government is yet to officially announce the climbdown, but I expect it to be significant. I understand the government is offering to keep personal independence payments, the benefits given to those who are disabled, unchanged for existing claimants, rowing back on an initial plan to take it away from hundreds of thousands of people by tightening the criteria for claiming. I also understand the government will drop the cuts to the health element of universal credit for existing claimants, in changes that will cost an estimated £1.5bn - nearly a third of the savings the government has previously earmarked from these changes. One senior parliamentary source told me on Thursday night they thought it was a \"good package\" with \"generous concessions\", but said it was up to individual MPs to decide whether to withdraw their names from the amendment that would have torpedoed the welfare bill. In the coming days, No. 10 will have to make the case to backbenchers and whittle down the rebellion in order to get the welfare bill passed on Tuesday. But it's clear that No. 10 has given MPs a ladder to climb down. But the bigger question is where does it leave the government and its party. There is quiet fury from many MPs I have spoken to, angry at the No. 10 operation and critical of what they see as a \"boy's club\". There has been criticism levelled at the PM's chief of staff Morgan McSweeney, with MPs in seats facing challenge from the left rather than the right frustrated that the whole No. 10 strategy seems to be seeing off Reform, rather than look to the broader Labour base and threats from the Lib Dems or the Greens. There is also much ire reserved for Rachel Reeves - interestingly Liz Kendall is escaping the criticism despite being the architect of the reforms - with MPs, already angry over winter fuel debacle, now in open revolt over the chancellor's decision to force through these cuts ahead of the Spring Statement in March in order to help fill her fiscal black hole. MPs felt talked down to One Labour figure told me on Thursday the growing drumbeat in the party is that Reeves must go. Another MP told me colleagues hated the cabinet ring around to try to persuade them to back down over welfare, saying more MPs ended up adding their names to the list because they felt talked down to. Read more:Rayner refuses to repeat chancellor's tax hikes pledgeNew plans to deport foreign prisoners earlier All of this needs work if the PM has any hope of rebuilding trust between his party and his operation. There is also the problem of what flows from the concessions. The chancellor will have to fund these concessions, and that could mean hard choices elsewhere. Will this mean that the government ends up doing less on reforming the two-child cap, or will it have to find welfare cuts elsewhere? That flows into the third problem. In seeing off this rebellion No. 10 has contained MPs rather than converting them. What the parliamentary party has seen is a government that, when pressed, be it on winter fuel or benefit cuts, will fold. That will only serve to embolden MPs to fight again. In the immediate term, the government will hope it has seen off a potentially catastrophic defeat. But seeing off the growing malaise around the Starmer administration just got a bit harder after this."
    },
    {
        "title": "Post Office: Police identify seven suspects related to Horizon scandal",
        "description": "Police investigating the Horizon Post Office scandal have now identified seven suspects, with more than 45 people classed as \"persons of interest\".",
        "url": "https://news.sky.com/story/post-office-police-identify-seven-suspects-related-to-horizon-scandal-13388913",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-olympos-post-office_6951157.jpg?20250626123103",
        "type": "Home",
        "Author": "Adele Robinson",
        "Date Published": "2025-06-26 10:48:00",
        "Headline": "A \"scaled-up\" national team of officers has been in place for over six months as part of Operation Olympos - dedicated to looking at crimes related to the Horizon Post Office scandal.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n Police investigating the Horizon Post Office scandal have now identified seven suspects, with more than 45 people classed as \"persons of interest\". A \"scaled-up\" national team of officers has been in place for over six months as part of Operation Olympos - dedicated to looking at crimes related to the Horizon Post Office scandal. The number of suspects has increased to seven since before Christmas, as part of a UK-wide investigation involving 100 officers. Four have now been interviewed under caution. Hundreds of subpostmasters were wrongfully convicted of stealing after faulty computer software created false accounting shortfalls in Post Office branches between 1999 and 2015. Commander Stephen Clayman, Gold Command for Operation Olympos, described a \"huge shift\" in terms of their investigation and \"significant progress\". \"We've got over four million documents that are going to rise to about six million documents,\" he said, \"but we're beginning to methodically work through those and looking at individuals who are associated with certain prosecutions.\" \n                  Post Office scandal: Government has not done enough to ensure compensation for victims, committee of MPs finds\n                 \n                  Post Office Capture scandal: Sir Alan Bates calls for those responsible for wrongful convictions to be 'brought to account'\n                 \n                  Post Office scandal redress must not only be fair - it must be fast\n                 He described a \"pool of about 45 people plus\" classed as \"persons of interest\", with that number \"expected to grow\". He added that officers have questioned \"some\" in the past and \"more recently\" and are looking at the offences of perverting the course of justice and perjury. The \"wider pool\" of persons of interest is made up of Post Office investigators, lawyers, and \"management\" across Fujitsu and the Post Office.  The team of officers will be identifying actions which could amount to criminal offences on both an individual and corporate basis. Any decisions made on whether to charge will not happen until after the Post Office inquiry findings are \"published and reviewed\". The Operation Olympos officers are part of four teams - a London hub and three regional teams - who have been described as \"highly motivated\" across England and Wales. Police Scotland and the Police Service of Northern Ireland are also helping. Cmdr Clayman said that officers \"will be building a robust case\" to pass on to the Crown Prosecution Service. He also added that, compared to the inquiry, his officers will have to \"prove this to the criminal standard…a much, much higher standard\". He described feeling \"optimistic\" and \"confident\" that the teams will have \"some successful outcomes\", and said they are \"working as hard and as quickly as (they) can\". Teams are involved in what has been described as a \"focused strategy which gets to the heart of the issues\". Their investigations are being overseen by the National Police Chiefs' Council and the Metropolitan Police. Read more from Sky News:Pornography sites to introduce 'robust' age verificationSalmonella cases reach highest levels in a decade Victims have also been told that the police will not be reinvestigating every case but \"taking a speculative look at cases\" to focus on key people involved and evidence for prosecution. Operation Olympos is also making use of special software to help process the amount of evidence to sift through material in relation to key events and identified cases. Of the four suspects interviewed under caution, two were questioned in late 2021, one in late 2024 and the most recent in early 2025."
    },
    {
        "title": "US defence secretary's Iran strikes briefing turned into a full throttle assault on the press",
        "description": "Two things can be true at the same time.",
        "url": "https://news.sky.com/story/us-defence-secretarys-iran-strikes-briefing-turned-into-a-full-throttle-assault-on-the-press-13389120",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-pete-hegseth-pentagon_6951211.jpg?20250626131253",
        "type": "Home",
        "Author": "Mark Stone",
        "Date Published": "2025-06-26 18:38:00",
        "Headline": "The storm around the level of destruction caused by Saturday's American airstrikes could be a distraction. Nevertheless, the early morning Pentagon news conference revealed plenty.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  Two things can be true at the same time. It's possible that the American airstrikes did \"obliterate\" the Iranian nuclear sites hit on Saturday night. It's also possible that Iran retains stockpiles of enriched uranium and nuclear production equipment elsewhere - undisclosed. We know from the International Atomic Energy Agency that Iran has been obstructive, and we know too that the regime has attempted to build new facilities. This pattern of behaviour makes it possible, even probable, that they have existing hidden programmes. Preliminary intelligence reports shared with European governments indicated that Iran's highly-enriched uranium stockpile remains largely intact and that much of it was not concentrated in the Fordow site. Given all this, the storm around the level of destruction caused by Saturday's American airstrikes could be a distraction. Nevertheless, the early morning Pentagon news conference revealed plenty. There were two strands to the briefing. From the politician, we got a political attack, and from the general, we got the military detail. The attack on the media Defence secretary Pete Hegseth went full throttle on his assault against the 'fake news'. He didn't just shoot the messenger; he sprayed his blunt criticism all over the defence department press room with characteristic disdain. The Fox News anchor-turned-politician has left his past well behind him.  \"In hunting for scandals all the time, in trying to find wedges and spin stories, this press corps and the press corps miss historic moments,\" he said. \"You, and I mean specifically you, the press, specifically you, the press corps, because you cheer against Trump so hard. \"It's like in your DNA and in your blood to cheer against Trump because you want him not to be successful, so bad. You have to cheer against the efficacy of these strikes.\" This was a news conference to counter the leaks to numerous US news outlets, which suggested that the weekend strikes on the Iranian nuclear site might not have been very successful. The leaks, which Team Trump believes may have come from Congress, where certain lawmakers were shown the initial intelligence assessments, were from a preliminary report which was marked as containing 'low confidence' information. Mr Hegseth said: \"How about we talk about how special America is, that only we have these capabilities. \"I think it's too much to ask, unfortunately, for the fake news, so we're used to that, but we also have an opportunity to stand at the podium and read the truth of what's really happened... \"And the reality is, you want to call it destroyed. You want to call it defeated. You want to call it obliterated. Choose your word. This was a historically successful attack.\" The spy and the specially-designed bomb The second strand of the news conference, from America's top general Dan Caine, provided us with new details about the air strikes last Saturday night. General Caine would not be drawn on the definitive success of the bombings. \"We do not mark our own homework,\" he said. Instead, he sought to illustrate how the mission the military was tasked with, and the performance of the weapons used, all played out perfectly.  He revealed the Fordow nuclear site had been under surveillance for 15 years. One intelligence officer, he said, had the job of monitoring the site. \"For more than 15 years, this officer and his teammate lived and breathed this single target,\" General Caine said. \"He studied the geology. He watched the Iranians dig it out. He watched the construction, the weather, the discard material, the geology, the construction materials, where the materials came from. \"He looked at the vent shaft, the exhaust shaft, the electrical systems, the environmental control systems, every nook, every crater, every piece of equipment going in and every piece of equipment going out, they literally dreamed about this target at night, when they slept.\" He also revealed the bunker-busting bombs were developed precisely for this mission. He showed newly-declassified videos of the Massive Ordnance Penetrators (MOP) bombs exploding in test scenarios. Together, the information was designed to show the high probability of massive damage to the nuclear sites. Read more:Trump dodges commitment to NATO principleWhy did the US attack on Iran avoid some nuclear sites? A congressional leak? In a related development, a Trump administration official has confirmed that the White House plans to limit intelligence sharing with lawmakers following the leak of the initial damage assessment. According to NBC News, the administration plans to post less information on CAPNET, which is the name of a system utilised to share classified material with Congress. It is not clear whether the assessment was leaked by someone in Congress or by a defence department official, but the speaker of the house - Trump ally Mike Johnson - said he suspects it came from Congress. \"There was a leak, and we're trying to get down to the bottom of that. It's dangerous and ridiculous that happened. We're going to solve that problem, and we'll keep the coordination,\" Mr Johnson told NBC News. Democratic Party Minority Leader Chuck Schumer criticised the development. \"They seem not to want to see the facts get out. Just Trump's version of the facts, which we know is often false,\" Schumer said."
    },
    {
        "title": "Brad Pitt's Los Angeles home broken into",
        "description": "Brad Pitt's home in Los Angeles was broken into on Wednesday, two law enforcement sources have told Sky News' US partner, NBC News.",
        "url": "https://news.sky.com/story/brad-pitts-los-angeles-home-broken-into-13389149",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-pitt-brad_6951524.jpg?20250626212608",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-26 20:21:00",
        "Headline": "The Hollywood star wasn't at home when the alleged burglary took place on Wednesday night, two law enforcement sources have told Sky News' US partner, NBC News.",
        "Content": "Brad Pitt's home in Los Angeles was broken into on Wednesday, two law enforcement sources have told Sky News' US partner, NBC News. The actor was not in when the alleged break-in occurred, the sources said. Los Angeles Police Department (LAPD) is investigating a reported burglary. An LAPD spokesman confirmed a break-in at a residence in the Los Feliz area of Los Angeles at 10.30pm on Wednesday. However, the spokesman did not identify who lived at the property or who owned it. An unknown amount of property was allegedly stolen by the thieves, the value of which has not been disclosed. Read more from Sky News:Two Met Police officers sacked over strip search of schoolgirlWeight loss and diabetes jabs linked to potentially fatal side effect Police were looking for three suspects who climbed over a front fence and broke in through the home's front window, the sources said. Pitt, 61, was in London on Monday for the European premiere of his new film, F1: The Movie. Directed and co-written by Top Gun: Maverick filmmaker Joseph Kosinski, F1 was partly filmed during Formula One Grand Prix weekends, with scenes shot on the circuits during breaks and real drivers also appearing on screen."
    },
    {
        "title": "Prosecutors give closing arguments in Sean 'Diddy' Combs trial",
        "description": "Sean \"Diddy\" Combs led a criminal enterprise for two decades, using \"power, violence and fear\" to carry out brutal crimes, believing his \"fame, wealth and power\" put him above the law, a prosecutor has told his trial.",
        "url": "https://news.sky.com/story/prosecutors-give-closing-arguments-in-sean-diddy-combs-trial-13389178",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-diddy-sean-combs_6951274.jpg?20250626141802",
        "type": "Home",
        "Author": "Bethany Minelle",
        "Date Published": "2025-06-26 22:08:00",
        "Headline": "The prosecution has given its closing argument, following more than six weeks of testimony in the Sean \"Diddy\" Combs trial, with the defence due to wrap up their case on Friday.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Sean \"Diddy\" Combs led a criminal enterprise for two decades, using \"power, violence and fear\" to carry out brutal crimes, believing his \"fame, wealth and power\" put him above the law, a prosecutor has told his trial. Christy Slavik spoke for nearly five hours, as she presented the prosecution's closing arguments after more than six weeks of testimony and 34 witnesses. She began by describing the 55-year-old music mogul, telling the court: \"He's the leader of a criminal enterprise. He doesn't take 'no' for an answer. And now you know about many crimes he committed with members of his enterprise.\" She said charges of sex trafficking and racketeering conspiracy were supported by proof that over two decades, Combs kidnapped one of his employees, committed arson by trying to blow up fellow rapper Kid Cudi's car, engaged in forced labour, bribed a security officer and carried out the \"brutal crimes at the heart of this case.\" Diddy trial: As it happened Ms Slavik said Combs \"again and again forced, threatened and manipulated\" his former girlfriend, Cassie Ventura and an ex-girlfriend who testified under the pseudonym Jane into drugged-up, elaborate sexual performances, dubbed \"freak offs\" or \"hotel\" or \"king nights\". \"The defendant used power, violence and fear to get what he wanted,\" she said. \"He thought that his fame, wealth and power put him above the law.\" Combs is charged with one count of racketeering conspiracy, two charges of sex trafficking, and two charges of transportation to engage in prostitution. He has pleaded not guilty to all charges and has strenuously denied all allegations of sexual abuse. Read more:Everything you need to know about the trialThe rise and fall of Sean 'Diddy' CombsWhat we learned from Cassie's testimony Ms Slavik said Combs used a \"small army\" of employees - his trusted inner circle of staff including bodyguards and assistants - to \"serve his needs,\" covering up his harm to women in the process. Homing in on the racketeering charge against him, she said, while Combs was already \"very powerful\", he became even more so with the support of his business. She said Combs and his inner circle \"committed hundreds of racketeering acts,\" including drug distribution, kidnapping, arson and witness tampering. They listed drugs such as cocaine, meth, ketamine, Oxycodone and MDMA, that Combs's assistants said they procured for him, or that federal agents said they found during raids of his multiple homes. During parts of the evidence, Combs looked dejected, sitting with his head down, and with his chair pushed back from the defence table. At one point, when video footage of Combs appearing to beat Cassie at the InterContinental Hotel was shown to the court, he looked away. Combs has been in a New York jail since his arrest in September last year. If convicted on all counts, he could face a minimum 15-year prison term and could be sentenced to life behind bars. The 12-member jury must be unanimous to convict Combs on any of the counts. Defence lawyers have conceded that Combs was involved in domestic violence but say he committed no federal crimes. They say the women took part in the \"freak offs\" willingly and that there was no racketeering conspiracy because none of his employees agreed to be part of any conspiracy. They say the drugs procured were for his own personal use. But in her closing argument, Ms Slavik said employees repeatedly agreed to commit crimes for Combs, such as delivering him drugs, accompanying him to kidnap his personal assistant, Capricorn Clark, and locking his girlfriend in a hotel room after he stomped on her face. In her conclusion, she said proof of Combs's guilt had been demonstrated, adding: \"Before today, he was able to get away with it due to his money, power and influence, but that stops now… \"It is time to hold him accountable, it is time for justice, and it's time to find him guilty.\" On Friday, Combs's lead attorney Marc Agnifilo will give his closing argument, followed by the government's rebuttal. Judge Arun Subramanian says he will instruct the jury on the law later that day, allowing them to begin deliberating as early as late afternoon. The trial continues."
    },
    {
        "title": "Dame Anna Wintour steps back as American Vogue editor-in-chief after 37 years",
        "description": "Dame Anna Wintour is stepping down as American Vogue editor-in-chief after 37 years.",
        "url": "https://news.sky.com/story/dame-anna-wintour-steps-back-as-vogue-editor-in-chief-after-37-years-13389141",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wintour-met_6951520.jpg?20250626212038",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-26 20:08:00",
        "Headline": "Dame Anna transformed American Vogue after landing the top job in 1988, following a three-year stint editing the British version - but is stepping aside so she can \"help the next generation of editors\". ",
        "Content": "Dame Anna Wintour is stepping down as American Vogue editor-in-chief after 37 years. The British-born editor broke the news to the magazine's staff at a meeting on Thursday, announcing that a new role, head of editorial content, would be introduced. The longtime Vogue powerhouse isn't leaving the publication entirely, though. She will remain global editorial director of Vogue and chief content officer for its publishing house, Conde Nast. Whoever lands the role of head of editorial content will report directly to Dame Anna, who will continue to oversee all of Conde Nast's brands, including Vanity Fair and GQ, except for The New Yorker. According to Vogue, Dame Anna told staff at Thursday's meeting she wanted to \"help the next generation of editors storm the field with their own ideas\". \"Anybody in a creative field knows how essential it is never to stop growing in one's work,\" she said. \"When I became the editor of Vogue, I was eager to prove to all who might listen that there was a new, exciting way to imagine an American fashion magazine. \"Now, I find that my greatest pleasure is helping the next generation of impassioned editors storm the field with their own ideas, supported by a new, exciting view of what a major media company can be.\" Read more:Bezos wedding celebrations start in VeniceDirector picked for next Bond film As well as editing US Vogue, Dame Anna has run the annual Met Gala since 1995, raising more than $300m (£220m) for the fashion wing of the Metropolitan Museum of Art. She landed the top job at American Vogue in 1988 following a three-year stint editing the British version. In her 37 years at the magazine, she transformed the title by featuring celebrities on the cover and mixing high fashion with more affordable street style. She was given a Damehood for her services to fashion earlier this year. Following the investiture ceremony at Buckingham Palace, Dame Anna said she did not intend to retire anytime soon. She said: \"The last time I was here, the Queen gave me a medal and we both agreed that we had been doing our job a very long time, and then this morning His Majesty asked me if this meant I was going to stop working, and I said firmly, no.\""
    },
    {
        "title": "Teachers given new guidance in dealing with AI-generated child sexual abuse material",
        "description": "Guidelines on how to deal with AI-generated child sexual abuse material (CSAM) have been issued to 38,000 teachers and staff across the UK.&#160;",
        "url": "https://news.sky.com/story/teachers-given-new-guidance-in-dealing-with-ai-generated-child-sexual-abuse-material-13389136",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-internet-watch-foundation_6716683.jpg?20241015151406",
        "type": "Home",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-26 19:50:00",
        "Headline": "The guidelines suggest that young people creating AI-generated child sexual abuse material may not be aware that what they're doing is illegal.",
        "Content": "\n          Science and Technology reporter\n       Guidelines on how to deal with AI-generated child sexual abuse material (CSAM) have been issued to 38,000 teachers and staff across the UK.  The guidelines are an attempt to help people working with children tackle the \"highly disturbing\" rise in AI-generated CSAM. They have been issued by the National Crime Agency (NCA) and the Internet Watch Foundation (IWF). The AI-generated content is illegal in the UK and is treated the same as any other sexual abuse imagery of children, even if the imagery isn't photorealistic. \"The rise in AI-generated child sexual abuse imagery is highly disturbing and it is vital that every arm of society keeps up with the latest online threats,\" said safeguarding minister Jess Phillips. \"AI-generated child sexual abuse is illegal and we know that sick predators' activities online often lead to them carrying out the most horrific abuse in person. \"We will not allow technology to be weaponised against children and we will not hesitate to go further to protect our children online,\" she said. The guidelines suggest that if young people are using AI to create nude images from each other's pictures - known as nudifying - or creating AI-generating CSAM, they may not be aware that what they're doing is illegal. Nudifying is when a non-explicit picture of someone is edited to make them appear nude and is increasingly common in \"sextortion\" cases - when someone is blackmailed with explicit pictures. \"Where an under-18 is creating AI-CSAM, they may think it is 'just a joke' or 'banter' or do so with the intention of blackmailing or harming another child,\" suggests the guidance. \"They may or may not recognise the illegality or the serious, lasting impact their actions can have on the victim.\" Last year, the NCA surveyed teachers and found that over a quarter weren't aware AI-generated CSAM was illegal, and most weren't sure their students were aware either. More than half of the respondents said guidance was their most urgently needed resource. The IWF has seen an increasing amount of AI-generated CSAM as it scours the internet, processing 380% more reports of the abuse in 2024 than in 2023. \"The creation and distribution of AI-manipulated and fake sexual imagery of a child can have a devastating impact on the victim,\" said Derek Ray-Hill, interim chief executive at the IWF. Read more from Sky News:Major pornography sites to introduce 'robust' age verification for UK usersDoctors using unapproved AI to record patient meetingsMinecraft users targeted by cyber criminals \"It can be used to blackmail and extort young people. There can be no doubt that real harm is inflicted and the capacity to create this type of imagery quickly and easily, even via an app on a phone, is a real cause for concern.\" Multiple paedophiles have been sent to jail for using artificial intelligence to create child sexual abuse images in recent years. Last year, Hugh Nelson was sentenced to 18 years in jail for creating AI-generated CSAM that police officers were able to link back to real children. \"Tackling child sexual abuse is a priority for the NCA and our policing partners, and we will continue to investigate and prosecute individuals who produce, possess, share or search for CSAM, including AI-generated CSAM,\" said Alex Murray, the NCA's director of threat leadership and policing lead for artificial intelligence. In February, the government announced that AI tools designed to generate child sex abuse material would be made illegal under \"world-leading\" legislation. In the meantime, however, campaigners called for guidance to be issued to teachers. Laura Bates, the author of a book on the spread of online misogyny, told MPs earlier this month that deepfake pornography \"would be the next big sexual violence epidemic facing schools, and people don't even know it is going on.\" \"It shouldn't be the case that a 12-year-old boy can easily and freely access tools to create these forms of content in the first place,\" she said."
    },
    {
        "title": "'Life-changing' drug for teenager who lost mother to genetic condition",
        "description": "A teenager who lost her mother, aunt and uncle to a genetic condition is the first person in Europe to receive a \"life-changing\" drug.",
        "url": "https://news.sky.com/story/life-changing-drug-for-teenager-who-lost-mother-to-genetic-condition-13388976",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-apds-catchpole_6951323.jpg?20250626151639",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-26 12:58:00",
        "Headline": "The new drug called Lleniolisib (Joenja) is a simple tablet taken twice a day and is the first ever targeted treatment for activated PI3-Kinase delta syndrome (APDS), a rare inherited disorder.",
        "Content": "A teenager who lost her mother, aunt and uncle to a genetic condition is the first person in Europe to receive a \"life-changing\" drug. Mary Catchpole, 19, from Great Yarmouth, suffers from a rare inherited disorder called activated PI3-Kinase delta syndrome (APDS), which leaves people with a significantly weakened immune system. The condition was passed down by her mother's side of the family, with her mother Sarah dying aged 42 in 2018, while her aunt Helen died aged 12, her uncle Edward when he was 39 and her grandmother Mary when she was 48. APDS patients are vulnerable to repeated infections, causing them to face a lifetime of antibiotics and immunoglobulin replacement therapy to prevent infections and organ damage, and a bone marrow or stem cell transplant - until now. A new drug called leniolisib (Joenja) is a simple tablet taken twice a day and is the first ever targeted treatment for APDS. Ms Catchpole, who is the first person in Europe to receive the medicine after it was made available on the NHS, said taking the new drug is \"life-changing\" as it means she can leave behind huge amounts of medication. \"I was diagnosed with APDS aged seven and it's had a big effect on my life. I had lots of cannulas when I was younger and lots of hospital trips,\" she said. \n                  Patient's death linked to cyber attack on NHS, hospital trust says\n                 \n                  Areas of England to get extra NHS funding announced\n                 \n                  More Britons than ever struggling to make ends meet, report warns\n                 \"I had a permanent line in the side of my body when I was younger, which they put medicine in regularly at the hospital.\" Ms Catchpole added that she wasn't allowed to do much physical activity, including dancing, which she's \"always loved to do\". \"It has been hard,\" said the teaching assistant, who lives with her father Jimmy, 64, and her brother Joe, 20, who does not have APDS. The condition was identified by Cambridge researchers in 2013, with Ms Catchpole's family playing a key role in its discovery, as her mother and uncle were both patients at Addenbrooke's Hospital and were offered DNA sequencing to find out whether there was a genetic cause for their immunodeficiency. Read more from Sky News:Weight loss jabs linked to potentially fatal side effectGene therapy device could create medicines for rare diseases The researchers found a change in their genes that increased activity of an enzyme called PI3-Kinase delta, meaning this enzyme is effectively \"switched on\" all the time, preventing immune cells from fighting infection. Professor Sergey Nejentsev, from the University of Cambridge, who led the research that discovered APDS, said: \"As soon as we understood the cause of APDS, we immediately realised that certain drugs could be used to inhibit the enzyme that is activated in these patients.\" The new drug works by inhibiting the PI3-Kinase delta enzyme, effectively normalising the immune system of the patient. \"This new drug will make a huge difference to people living with APDS,\" Dr Anita Chandra, consultant immunologist at Addenbrooke's and affiliated assistant professor at the University of Cambridge, said. Ms Catchpole says she can now look to the future with optimism and lead a normal life. \"I really want to become a dance teacher,\" she said. \"I absolutely love my current job as a teaching assistant but I'd also like to go on some adventures as well. I've always felt different so it will be nice to feel like I belong.\" There are between 40 and 50 people in England who are known to have APDS. Experts believe the new APDS drug will work long-term in patients as long as they keep taking it, with researchers looking at the potential for the medicine to work on other, more common immune conditions."
    },
    {
        "title": "Post Office: Police identify seven suspects related to Horizon scandal",
        "description": "Police investigating the Horizon Post Office scandal have now identified seven suspects, with more than 45 people classed as \"persons of interest\".",
        "url": "https://news.sky.com/story/post-office-police-identify-seven-suspects-related-to-horizon-scandal-13388913",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-olympos-post-office_6951157.jpg?20250626123103",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2025-06-26 10:48:00",
        "Headline": "A \"scaled-up\" national team of officers has been in place for over six months as part of Operation Olympos - dedicated to looking at crimes related to the Horizon Post Office scandal.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n Police investigating the Horizon Post Office scandal have now identified seven suspects, with more than 45 people classed as \"persons of interest\". A \"scaled-up\" national team of officers has been in place for over six months as part of Operation Olympos - dedicated to looking at crimes related to the Horizon Post Office scandal. The number of suspects has increased to seven since before Christmas, as part of a UK-wide investigation involving 100 officers. Four have now been interviewed under caution. Hundreds of subpostmasters were wrongfully convicted of stealing after faulty computer software created false accounting shortfalls in Post Office branches between 1999 and 2015. Commander Stephen Clayman, Gold Command for Operation Olympos, described a \"huge shift\" in terms of their investigation and \"significant progress\". \"We've got over four million documents that are going to rise to about six million documents,\" he said, \"but we're beginning to methodically work through those and looking at individuals who are associated with certain prosecutions.\" \n                  Post Office scandal: Government has not done enough to ensure compensation for victims, committee of MPs finds\n                 \n                  Post Office Capture scandal: Sir Alan Bates calls for those responsible for wrongful convictions to be 'brought to account'\n                 \n                  Post Office scandal redress must not only be fair - it must be fast\n                 He described a \"pool of about 45 people plus\" classed as \"persons of interest\", with that number \"expected to grow\". He added that officers have questioned \"some\" in the past and \"more recently\" and are looking at the offences of perverting the course of justice and perjury. The \"wider pool\" of persons of interest is made up of Post Office investigators, lawyers, and \"management\" across Fujitsu and the Post Office.  The team of officers will be identifying actions which could amount to criminal offences on both an individual and corporate basis. Any decisions made on whether to charge will not happen until after the Post Office inquiry findings are \"published and reviewed\". The Operation Olympos officers are part of four teams - a London hub and three regional teams - who have been described as \"highly motivated\" across England and Wales. Police Scotland and the Police Service of Northern Ireland are also helping. Cmdr Clayman said that officers \"will be building a robust case\" to pass on to the Crown Prosecution Service. He also added that, compared to the inquiry, his officers will have to \"prove this to the criminal standard…a much, much higher standard\". He described feeling \"optimistic\" and \"confident\" that the teams will have \"some successful outcomes\", and said they are \"working as hard and as quickly as (they) can\". Teams are involved in what has been described as a \"focused strategy which gets to the heart of the issues\". Their investigations are being overseen by the National Police Chiefs' Council and the Metropolitan Police. Read more from Sky News:Pornography sites to introduce 'robust' age verificationSalmonella cases reach highest levels in a decade Victims have also been told that the police will not be reinvestigating every case but \"taking a speculative look at cases\" to focus on key people involved and evidence for prosecution. Operation Olympos is also making use of special software to help process the amount of evidence to sift through material in relation to key events and identified cases. Of the four suspects interviewed under caution, two were questioned in late 2021, one in late 2024 and the most recent in early 2025."
    },
    {
        "title": "Government makes concessions to Labour rebels over welfare reforms",
        "description": "The government has made an offer to rebel Labour MPs over its controversial welfare reforms, Sky News understands.",
        "url": "https://news.sky.com/story/government-to-make-concessions-to-labour-rebels-over-welfare-reforms-sky-news-understands-13388797",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-starmer-labour_6950635.jpg?20250625171042",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-26 20:20:00",
        "Headline": "Sir Keir Starmer has made an offer to rebel MPs in a bid to pass his reforms to the welfare and benefits.",
        "Content": "The government has made an offer to rebel Labour MPs over its controversial welfare reforms, Sky News understands. More than 120 Labour MPs were poised to vote against the Universal Credit and Personal Independence Payment (PIP) Bill on Tuesday. The changes come after a ring-around by cabinet ministers failed to bring rebels on side. The bill was intended to restrict eligibility for the PIP - the main disability payment in England- and limit the sickness-related element of universal credit, to help shave £5bn off the welfare budget by 2030. Politics latest: Government to make offer to rebels 'We have listened' A spokesperson for Downing Street said: \"We have listened to MPs who support the principle of reform but are worried about the pace of change for those already supported by the system. \"This package will preserve the social security system for those who need it by putting it on a sustainable footing, provide dignity for those unable to work, supports those who can and reduce anxiety for those currently in the system. \"Our reforms are underpinned by Labour values and our determination to deliver the change the country voted for last year.\"  Liz Kendall, the welfare secretary, said in a letter to MPs there would be two changes to the bill, including ensuring that all of those currently receiving PIP \"will stay within the current system. \"The new eligibility requirements will be implemented from November 2026 for new claims only,\" Ms Kendall said. \"Secondly, we will adjust the pathway of Universal Credit payment rates to make sure all existing recipients of the UC health element - and any new claimant meeting the severe conditions criteria - have their incomes fully protected in real terms.\" Sky News political editor Beth Rigby was earlier on Thursday told existing PIP claimants will be able to keep their payments, which means 370,000 people will not lose out. This will cost the government at least £1.5bn, according to the Institute for Fiscal Studies. Sky News understands that a senior source has accepted the change, but it will be up to each individual rebel to make a decision on whether to withdraw. Read more:Welfare bill: A humiliating blow for Starmer The source said they think the changes are a \"good package\" with \"generous concessions\". A reasoned amendment signed by 126 Labour MPs argued that disabled people had not been properly consulted and further scrutiny of the changes is needed. If passed, this would have killed the bill. Sky News understands that some senior rebels are willing to accept the concessions - with one saying that \"the concessions will be positively received, and I expect to vote with the government now\". Other MPs who had not wanted to rebel were also expecting to change their votes. However, several Labour MPs on the left of the party have gone public to say they will still oppose the government, including Diane Abbott, Richard Burgon, Nadia Whittome and Brian Leishman. Conservative shadow chancellor Sir Mel Stride said the change would mark a \"screeching U-turn\" - and claimed the changes mark \"another unfunded spending commitment\". Meanwhile, Helen Whately, shadow work and pensions secretary, said: \"This is another humiliating U-turn forced upon Keir Starmer. \"With the sickness benefits bill set to reach £100 billion by 2030 the country needs action. But Labour has lurched from a bad plan to a next-to-nothing plan. \"The latest 'deal' with Labour rebels sounds a lot like a two-tier benefits system, more likely to encourage anyone already on benefits to stay there rather than get into work.\" What is PIP? The biggest shakeup to the system involved changes to PIP - money given to people, including some of whom are in work - who have extra care needs or mobility needs as a result of a disability. People who claim it are awarded points depending on their ability to do certain activities, such as washing and preparing food, and this influences how much they will receive. From November 2026, people would have needed to score a minimum of four points in at least one activity to qualify for the daily living element of PIP - instead of fewer points spread across a range of tasks. This would have impacted existing claimants as well as new ones. The government's concessions are understood to see this change dropped for existing claimants. Universal credit The government intended to freeze the health element of universal credit, claimed by more than two million people, at £97 a week during this parliament, and cut the rate to £50 for new claimants. Again, it's understood the government's concessions mean this change now won't apply to existing claimants."
    },
    {
        "title": "'Life-changing' drug for teenager who lost mother to genetic condition",
        "description": "A teenager who lost her mother, aunt and uncle to a genetic condition is the first person in Europe to receive a \"life-changing\" drug.",
        "url": "https://news.sky.com/story/life-changing-drug-for-teenager-who-lost-mother-to-genetic-condition-13388976",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-apds-catchpole_6951323.jpg?20250626151639",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-26 12:58:00",
        "Headline": "The new drug called Lleniolisib (Joenja) is a simple tablet taken twice a day and is the first ever targeted treatment for activated PI3-Kinase delta syndrome (APDS), a rare inherited disorder.",
        "Content": "A teenager who lost her mother, aunt and uncle to a genetic condition is the first person in Europe to receive a \"life-changing\" drug. Mary Catchpole, 19, from Great Yarmouth, suffers from a rare inherited disorder called activated PI3-Kinase delta syndrome (APDS), which leaves people with a significantly weakened immune system. The condition was passed down by her mother's side of the family, with her mother Sarah dying aged 42 in 2018, while her aunt Helen died aged 12, her uncle Edward when he was 39 and her grandmother Mary when she was 48. APDS patients are vulnerable to repeated infections, causing them to face a lifetime of antibiotics and immunoglobulin replacement therapy to prevent infections and organ damage, and a bone marrow or stem cell transplant - until now. A new drug called leniolisib (Joenja) is a simple tablet taken twice a day and is the first ever targeted treatment for APDS. Ms Catchpole, who is the first person in Europe to receive the medicine after it was made available on the NHS, said taking the new drug is \"life-changing\" as it means she can leave behind huge amounts of medication. \"I was diagnosed with APDS aged seven and it's had a big effect on my life. I had lots of cannulas when I was younger and lots of hospital trips,\" she said. \n                  Patient's death linked to cyber attack on NHS, hospital trust says\n                 \n                  Areas of England to get extra NHS funding announced\n                 \n                  More Britons than ever struggling to make ends meet, report warns\n                 \"I had a permanent line in the side of my body when I was younger, which they put medicine in regularly at the hospital.\" Ms Catchpole added that she wasn't allowed to do much physical activity, including dancing, which she's \"always loved to do\". \"It has been hard,\" said the teaching assistant, who lives with her father Jimmy, 64, and her brother Joe, 20, who does not have APDS. The condition was identified by Cambridge researchers in 2013, with Ms Catchpole's family playing a key role in its discovery, as her mother and uncle were both patients at Addenbrooke's Hospital and were offered DNA sequencing to find out whether there was a genetic cause for their immunodeficiency. Read more from Sky News:Weight loss jabs linked to potentially fatal side effectGene therapy device could create medicines for rare diseases The researchers found a change in their genes that increased activity of an enzyme called PI3-Kinase delta, meaning this enzyme is effectively \"switched on\" all the time, preventing immune cells from fighting infection. Professor Sergey Nejentsev, from the University of Cambridge, who led the research that discovered APDS, said: \"As soon as we understood the cause of APDS, we immediately realised that certain drugs could be used to inhibit the enzyme that is activated in these patients.\" The new drug works by inhibiting the PI3-Kinase delta enzyme, effectively normalising the immune system of the patient. \"This new drug will make a huge difference to people living with APDS,\" Dr Anita Chandra, consultant immunologist at Addenbrooke's and affiliated assistant professor at the University of Cambridge, said. Ms Catchpole says she can now look to the future with optimism and lead a normal life. \"I really want to become a dance teacher,\" she said. \"I absolutely love my current job as a teaching assistant but I'd also like to go on some adventures as well. I've always felt different so it will be nice to feel like I belong.\" There are between 40 and 50 people in England who are known to have APDS. Experts believe the new APDS drug will work long-term in patients as long as they keep taking it, with researchers looking at the potential for the medicine to work on other, more common immune conditions."
    },
    {
        "title": "Teachers given new guidance in dealing with AI-generated child sexual abuse material",
        "description": "Guidelines on how to deal with AI-generated child sexual abuse material (CSAM) have been issued to 38,000 teachers and staff across the UK.&#160;",
        "url": "https://news.sky.com/story/teachers-given-new-guidance-in-dealing-with-ai-generated-child-sexual-abuse-material-13389136",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-internet-watch-foundation_6716683.jpg?20241015151406",
        "type": "UK",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-26 19:50:00",
        "Headline": "The guidelines suggest that young people creating AI-generated child sexual abuse material may not be aware that what they're doing is illegal.",
        "Content": "\n          Science and Technology reporter\n       Guidelines on how to deal with AI-generated child sexual abuse material (CSAM) have been issued to 38,000 teachers and staff across the UK.  The guidelines are an attempt to help people working with children tackle the \"highly disturbing\" rise in AI-generated CSAM. They have been issued by the National Crime Agency (NCA) and the Internet Watch Foundation (IWF). The AI-generated content is illegal in the UK and is treated the same as any other sexual abuse imagery of children, even if the imagery isn't photorealistic. \"The rise in AI-generated child sexual abuse imagery is highly disturbing and it is vital that every arm of society keeps up with the latest online threats,\" said safeguarding minister Jess Phillips. \"AI-generated child sexual abuse is illegal and we know that sick predators' activities online often lead to them carrying out the most horrific abuse in person. \"We will not allow technology to be weaponised against children and we will not hesitate to go further to protect our children online,\" she said. The guidelines suggest that if young people are using AI to create nude images from each other's pictures - known as nudifying - or creating AI-generating CSAM, they may not be aware that what they're doing is illegal. Nudifying is when a non-explicit picture of someone is edited to make them appear nude and is increasingly common in \"sextortion\" cases - when someone is blackmailed with explicit pictures. \"Where an under-18 is creating AI-CSAM, they may think it is 'just a joke' or 'banter' or do so with the intention of blackmailing or harming another child,\" suggests the guidance. \"They may or may not recognise the illegality or the serious, lasting impact their actions can have on the victim.\" Last year, the NCA surveyed teachers and found that over a quarter weren't aware AI-generated CSAM was illegal, and most weren't sure their students were aware either. More than half of the respondents said guidance was their most urgently needed resource. The IWF has seen an increasing amount of AI-generated CSAM as it scours the internet, processing 380% more reports of the abuse in 2024 than in 2023. \"The creation and distribution of AI-manipulated and fake sexual imagery of a child can have a devastating impact on the victim,\" said Derek Ray-Hill, interim chief executive at the IWF. Read more from Sky News:Major pornography sites to introduce 'robust' age verification for UK usersDoctors using unapproved AI to record patient meetingsMinecraft users targeted by cyber criminals \"It can be used to blackmail and extort young people. There can be no doubt that real harm is inflicted and the capacity to create this type of imagery quickly and easily, even via an app on a phone, is a real cause for concern.\" Multiple paedophiles have been sent to jail for using artificial intelligence to create child sexual abuse images in recent years. Last year, Hugh Nelson was sentenced to 18 years in jail for creating AI-generated CSAM that police officers were able to link back to real children. \"Tackling child sexual abuse is a priority for the NCA and our policing partners, and we will continue to investigate and prosecute individuals who produce, possess, share or search for CSAM, including AI-generated CSAM,\" said Alex Murray, the NCA's director of threat leadership and policing lead for artificial intelligence. In February, the government announced that AI tools designed to generate child sex abuse material would be made illegal under \"world-leading\" legislation. In the meantime, however, campaigners called for guidance to be issued to teachers. Laura Bates, the author of a book on the spread of online misogyny, told MPs earlier this month that deepfake pornography \"would be the next big sexual violence epidemic facing schools, and people don't even know it is going on.\" \"It shouldn't be the case that a 12-year-old boy can easily and freely access tools to create these forms of content in the first place,\" she said."
    },
    {
        "title": "Trade war: UK car exports to US halved in May ahead of truce",
        "description": "The extent of the harm inflicted on UK car exporters from US tariffs has been revealed, with shipments plunging by more than half last month according to industry figures.  ",
        "url": "https://news.sky.com/story/trade-war-uk-car-exports-to-us-halved-in-may-ahead-of-truce-13389007",
        "image_url": "https://e3.365dm.com/22/07/1920x1080/skynews-new-cars-produced-stock_5823914.jpg?20220705070337",
        "type": "UK",
        "Author": "James Sillars",
        "Date Published": "2025-06-26 13:42:00",
        "Headline": "The struggling industry says there are reasonable hopes for recovery ahead now that US tariffs have been reduced and the government has promised help through its industrial strategy.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The extent of the harm inflicted on UK car exporters from US tariffs has been revealed, with shipments plunging by more than half last month according to industry figures.   The Society of Motor Manufacturers and Traders (SMMT) said the number of UK-made cars heading across the Atlantic fell 55.4% during May following a decline of just under 3% the previous month. The dramatic slowdown marked a reaction to the 25% tariffs imposed on imports by the Trump administration from 3 April amid the president's \"liberation day\" trade war escalation which sparked chaos in global supply chains. The move prompted Jaguar Land Rover - the biggest exporter of cars to the US from these shores - to suspend all shipments temporarily.  The US is the most important market for UK producers, in value terms, and was worth £9bn last year with the vast majority of those sales coming from luxury brands also including Bentley, Rolls-Royce Motor Cars and Aston Martin. Tariffs on UK-made cars imported into the US have since been reduced from 25% to 10% for up to 100,000 vehicles on an annual basis. That was signed off by the president 10 days ago. \n                  VIvergo bioethanol plant to close 'due to UK-US trade agreement'\n                 \n                  Money blog: Pound at near four-year high against dollar - which could be good news for shoppers\n                 \n                  Fresh drive to fix shortfalls in UK's economic statistics\n                 While it spares UK producers from the worst, the US trade war does not represent the only challenge.  The industry has been crying out for help to bolster its competitiveness and increase demand for new electric vehicles amid lacklustre interest, not just at home, but abroad too. It has welcomed promised help with punitive energy costs through the government's industrial strategy. Wider SMMT figures showed car and commercial vehicle production fell for the fifth consecutive month in May. It reported a 33% decline to just 49,810 vehicles and said it was the worst performance for May, when the COVID years were excluded, since 1949. The industry body blamed continuing model changeovers, along with the impact of US tariffs. The number of vehicles produced for the domestic market fell while shipments to the EU, which generally accounts for the biggest share of volumes, was down by 22.5%. Read more:Industrial strategy targets short-term pain for long-term gain Mike Hawes, the SMMT's chief executive, said: \"While 2025 has proved to be an incredibly challenging year for UK automotive production, there is the beginning of some optimism for the future. \"Confirmed trade deals with crucial markets, especially the US and a more positive relationship with the EU, as well as government strategies on industry and trade that recognise the critical role the sector plays in driving economic growth, should help recovery. \"With rapid implementation, particularly on the energy costs constraining our competitiveness, the UK can deliver the jobs, growth and decarbonisation that is desperately needed.\""
    },
    {
        "title": "Child Q: Two Met Police officers sacked over strip search of 15-year-old schoolgirl",
        "description": "Two Metropolitan Police officers have been sacked after a misconduct hearing found they committed gross misconduct during the strip search of a 15-year-old schoolgirl wrongly suspected of possessing cannabis.",
        "url": "https://news.sky.com/story/child-q-two-met-police-officers-committed-gross-misconduct-during-strip-search-of-15-year-old-schoolgirl-13388924",
        "image_url": "https://e3.365dm.com/22/03/1920x1080/skynews-child-q-london-met-police_5711292.jpg?20220318222241",
        "type": "UK",
        "Author": "Greg Wilford, news editor",
        "Date Published": "2025-06-26 11:05:00",
        "Headline": "Three officers conducted the search of the black girl, known as Child Q, with no appropriate adult present at a school in Hackney, east London, in 2020.",
        "Content": "By Greg Wilford, news editor  Two Metropolitan Police officers have been sacked after a misconduct hearing found they committed gross misconduct during the strip search of a 15-year-old schoolgirl wrongly suspected of possessing cannabis. PCs Kristina Linge, Victoria Wray, and Rafal Szmydynski conducted the search of the black girl, known as Child Q, with no appropriate adult present at a school in Hackney, east London, in 2020. Scotland Yard apologised, and the Children's Commissioner for England, Dame Rachel de Souza, described the case as \"shocking\" after details of the incident emerged in 2022.  PCs Linge, Wray and Szmydynski suspected the girl was in possession of cannabis, but the police watchdog later determined no drugs were found in her bags or outer clothing. At a police misconduct hearing in London today, Linge and Szmydytnski were found to have committed gross misconduct. They have both been dismissed. Wray was cleared of gross misconduct, but found to have committed misconduct, and was given a final written warning. The panel found she became involved in a \"situation where the decision had been decided already\". In a statement Child Q said: \"Someone walked into the school, where I was supposed to feel safe, took me away from the people who were supposed to protect me and stripped me naked, while on my period. \"I can't go a single day without wanting to scream, shout, cry or just give up. \"I don't know if I'm going to feel normal again. But I do know this can't happen to anyone, ever again.\" Her case drew outrage when it first came to light in March 2022 and sparked protests. The officers had been accused of treating Child Q differently due to her race, but Commander Jason Prins, chair of the misconduct panel, said: \"We do not draw any inference that race was an effective cause of this incident.\" The panel found concerns about drugs and potential gang involvement were initially raised by school staff. \"Like many cases where stop and search is used, here the subject of the search was identified to police officers by other professionals rather than being by officers in the street,\" Commander Prins added. He said the problem was with the decision to conduct the strip search in the first place, finding it was \"unnecessary\" and \"disproportionate\". \"There should never have been a strip search in these circumstances,\" he said, accepting Child Q found it \"humiliating and degrading\". Read more from Sky News:Europe 'will need millions of drones' to defend against possible Russian attacksMum who 'heard midwife blame her for son's illness' calls for investigation The panel did not find any officer breached professional behaviour standards relating to equality and diversity, or honesty and integrity. During the misconduct case, the three officers gave evidence, and each said they were not influenced by subconscious bias. Luke Ponte, for Linge, said they happened to be \"three immigrant officers\" who were \"trying to do their best to their adopted country\" as they were seeking to solve a problem. Mr Ponte said: \"These officers must not bear the entire weight of Child Q where there has been wider dysfunction as to how this came about.\" A fourth officer will face a disciplinary meeting at a later date relating to no appropriate adult being present during the search. This is separate from this misconduct hearing, and it's a lower level of discipline. Commander Kevin Southworth, on behalf of the force, said in a statement after the verdict: \"The experience of Child Q should never have happened and was truly regrettable. \"We have sincerely apologised to Child Q since this incident happened. Again, I am deeply sorry to Child Q and her family for the trauma that we caused her, and the damage this incident caused to the trust and confidence Black communities across London have in our officers. \"While the officers involved did not act correctly, we acknowledge there were organisational failings. Training to our officers around strip search and the type of search carried out on Child Q was inadequate, and our oversight of the power was also severely lacking. \"This left officers, often young in service or junior in rank, making difficult decisions in complex situations with little information, support or clear resources to help their decision-making.  \"What happened to Child Q was a catalyst for change, both for the Met and for policing nationally. \"While we should not have needed an incident such as Child Q to check our approach, it has absolutely led us to improving our processes and significantly reducing the number of these types of searches carried out. \"It's crucial we get this right to ensure the impact on young people is minimised as far as possible. \"Sadly, we know there are children in London being exploited to carry drugs and weapons for others as well as involved in criminality, so these types of searches have to remain within police powers. The work we have done since Child Q means we now have the right safeguards in place.\""
    },
    {
        "title": "Five people taken to hospital after double-decker bus carrying students crashes into river in Hampshire",
        "description": "Five people, including the driver, were treated in hospital after a bus left the road and ended up in a river in Hampshire, police said.",
        "url": "https://news.sky.com/story/three-people-taken-to-hospital-after-double-decker-bus-crashes-into-river-in-hampshire-13388927",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bus-eastleigh-hampshire_6951266.jpg?20250626141109",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-26 11:09:00",
        "Headline": "The bus was carrying students from Barton Peveril Sixth Form College when it left the road in Eastleigh, Hampshire.",
        "Content": " Five people, including the driver, were treated in hospital after a bus left the road and ended up in a river in Hampshire, police said. The force added that two of them were in a \"serious but not life-threatening\" condition. Emergency services were called to Bishopstoke Road, Eastleigh, at 10.07am on Thursday after the Bluestar bus left the road. It was earlier reported that three \"high-priority\" patients were taken to hospital following the collision. Several people were treated at the scene after the crash. The bus was carrying students from Barton Peveril Sixth Form College in Eastleigh. Inspector Andy Tester, of Hampshire Constabulary, said a total of 20 people were onboard the bus, 19 of which were passengers. \n                  Post Office: Police identify seven suspects related to Horizon scandal\n                 \n                  Government makes concessions to Labour rebels over welfare reforms\n                 \n                  'Atrocity not accident': Families of pedestrians killed by drivers running red lights speak out\n                 He added that there is \"no indication\" as to why the bus left the road and an investigation is under way to determine what happened. Mr Tester continued: \"It must have been terrifying and my thoughts are very much with what the children and the driver on the bus, who must have had a terrifying experience.\" He added that several people including the driver were trapped on board when emergency services arrived. He said: \"There were a large number of specialist resources helping to get people out of the bus. \"Some people had got themselves out of the bus, and it was obviously important to us to triage the injured people, to assess the people who were still stuck in the bus, and to make sure we had accounted for everyone.\" Mr Tester added that the force hopes the road will be reopened within 12 hours. A South Central Ambulance Service spokesman said it scrambled two helicopters and five ambulances to the scene. The spokesman said: \"We have sent multiple units to the incident including five ambulances, two helicopters, and specialist response units. \"We're continuing to support and assess patients on scene. All patients have been removed from the bus. Three high priority patients are being taken to hospital. Around 14 with less serious injuries are being treated on scene.\" The college posted on Facebook that an incident centre had been set up for parents and it was \"working closely\" with police. It continued: \"We ask that people do not attend the actual scene. For concerned parents, an incident centre has been established at The Hub at Bishopstoke. \"An officer and college staff will be available at The Hub to provide updates and address any questions you may have.\" A Hampshire Constabulary spokesman said: \"We are currently dealing with an incident on Bishopstoke Road in Eastleigh, after College Bus 607 for Barton Peveril students left the carriageway into a river. \"Emergency services are in attendance and the road has been closed so please avoid the area. \"It is anticipated the road may be closed for up to 12 hours for investigation and recovery work. \"Everyone on the bus has been accounted for and all injured persons are being treated by the ambulance service.\" A Hampshire and Isle of Wight Fire and Rescue Service spokesman said: \"We are on scene of an RTC involving one double decker bus that went off the road in Bishopstoke, Eastleigh. \"Fire crews from Eastleigh, St Mary's, Redbridge, Hightown and Portchester are in attendance alongside emergency service colleagues. \"People are asked to avoid the area to help emergency services deal with this incident.\" Read more from Sky NewsWeight loss jabs linked to side effectReform 'would win most seats in general election'Families call for maternity services to be investigated Richard Tyldsley, Bluestar general manager, said: \"One of our buses, carrying students to Barton Peveril College, was involved in an incident earlier this morning in Bishopstoke Road, Eastleigh. \"Reports suggest the bus left the highway and came to rest in a shallow river. \"There were 19 passengers on-board at the time. Our driver and at least two of the passengers have confirmed injuries, and we are awaiting further updates on the status of others on-board. \"We do not currently have full details of their injuries and are following their progress closely. \"Our thoughts are with everybody involved, and we wish those who were injured a full and speedy recovery. \"At this time, we do not know the circumstances behind this incident and are carrying out an immediate investigation. We are also assisting the police as they carry out their own inquiries.\""
    },
    {
        "title": "Dame Anna Wintour steps back as American Vogue editor-in-chief after 37 years",
        "description": "Dame Anna Wintour is stepping down as American Vogue editor-in-chief after 37 years.",
        "url": "https://news.sky.com/story/dame-anna-wintour-steps-back-as-vogue-editor-in-chief-after-37-years-13389141",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wintour-met_6951520.jpg?20250626212038",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-26 20:08:00",
        "Headline": "Dame Anna transformed American Vogue after landing the top job in 1988, following a three-year stint editing the British version - but is stepping aside so she can \"help the next generation of editors\". ",
        "Content": "Dame Anna Wintour is stepping down as American Vogue editor-in-chief after 37 years. The British-born editor broke the news to the magazine's staff at a meeting on Thursday, announcing that a new role, head of editorial content, would be introduced. The longtime Vogue powerhouse isn't leaving the publication entirely, though. She will remain global editorial director of Vogue and chief content officer for its publishing house, Conde Nast. Whoever lands the role of head of editorial content will report directly to Dame Anna, who will continue to oversee all of Conde Nast's brands, including Vanity Fair and GQ, except for The New Yorker. According to Vogue, Dame Anna told staff at Thursday's meeting she wanted to \"help the next generation of editors storm the field with their own ideas\". \"Anybody in a creative field knows how essential it is never to stop growing in one's work,\" she said. \"When I became the editor of Vogue, I was eager to prove to all who might listen that there was a new, exciting way to imagine an American fashion magazine. \"Now, I find that my greatest pleasure is helping the next generation of impassioned editors storm the field with their own ideas, supported by a new, exciting view of what a major media company can be.\" Read more:Bezos wedding celebrations start in VeniceDirector picked for next Bond film As well as editing US Vogue, Dame Anna has run the annual Met Gala since 1995, raising more than $300m (£220m) for the fashion wing of the Metropolitan Museum of Art. She landed the top job at American Vogue in 1988 following a three-year stint editing the British version. In her 37 years at the magazine, she transformed the title by featuring celebrities on the cover and mixing high fashion with more affordable street style. She was given a Damehood for her services to fashion earlier this year. Following the investiture ceremony at Buckingham Palace, Dame Anna said she did not intend to retire anytime soon. She said: \"The last time I was here, the Queen gave me a medal and we both agreed that we had been doing our job a very long time, and then this morning His Majesty asked me if this meant I was going to stop working, and I said firmly, no.\""
    },
    {
        "title": "UK weather: Amber heat health alert issued for England ahead of potentially the hottest June day on record",
        "description": "An amber heat health alert has been issued for some parts of England - days before what could be the hottest June day on record.",
        "url": "https://news.sky.com/story/uk-weather-amber-heat-health-alert-issued-ahead-of-potentially-the-hottest-june-day-on-record-13388830",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-hot-weather-heatwave_6951018.jpg?20250626101906",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-26 08:37:00",
        "Headline": "Highs of 30C are expected across the UK this weekend with heatwave conditions likely to be met on Sunday and Monday.",
        "Content": "An amber heat health alert has been issued for some parts of England - days before what could be the hottest June day on record. Sky News weather producer Joanna Robinson said highs of 34C are possible on Monday - with a 20% chance of beating the hottest day in June record of 35.6C from 1976. The likelihood of a record-breaking temperature on Monday could increase over the weekend as the day approaches. If the temperature does exceed 35.6C it would make it the hottest start to Wimbledon ever - with the world-famous tennis tournament beginning on Monday. The highest temperature for the opening day of the tournament so far came on 25 June 2001, with 29.3C at Kew Gardens. Heatwave criteria are likely to be met in a few places on Sunday and Monday, mainly across parts of central and eastern England. A heatwave is recorded when an area reaches a certain temperature - the level of which varies across the UK - for three consecutive days. The UK Health Security Agency (UKHSA) has issued an amber heat health alert for the East Midlands, east of England, London, South East and the South West. It has also issued a yellow heat health alert for Yorkshire and The Humber and the West Midlands. Both alerts begin at 12pm on Friday and end at 6pm on Tuesday 1 July. The UKHSA alerts are designed to warn health and social care workers about possible significant impacts on their services - they are not public weather warnings. The alerts in place over the coming days warn of a possible rise in weather-related deaths - particularly among those aged 65 and over or people with health conditions. The hot weather will come after unsettled conditions on Thursday which look set to continue on Friday - with heavy rain possible in the West, while the east of England could remain dry, escaping with some sunny intervals. Warm, humid air is set to linger in the South and East, with maximum temperatures of 27C in eastern England. Parts of the South and East may also remain very warm, with highs potentially reaching 28C as the muggy air returns. The wet conditions mean there has been a soggy start to this year's Glastonbury music festival before highs of 30C are expected across the UK this weekend. Warms nights have also been forecast for the weekend and going into next week - with temperatures set to be well above average across the UK. Read more from Sky NewsWeight loss jabs linked to side effectReform 'would win most seats in general election'Families call for maternity services to be investigated Robinson said there is some uncertainty over how quickly daytime temperatures will start to fall - but it is likely to happen from Tuesday. She added that June is the first month of summer so higher temperatures are more likely in July and August. However, a rapid analysis from scientists at World Weather Attribution found that June heatwaves in the South East - where there would need to be three consecutive days of temperatures above 28C - are about 10 times more likely due to climate change compared with the cooler pre-industrial climate. It comes after 2023 brought the hottest June on record with heatwaves also seen in June 2017 and June 2020. Last Saturday was the hottest day of 2025 so far, with a provisional temperature of 33.2C recorded in Charlwood, Surrey. In addition, the Met Office confirmed \"many places\" in England and \"one or two areas\" in Wales, including Cardiff, entered a heatwave last Friday."
    },
    {
        "title": "Pete Hegseth's news conference made one thing clear – but two questions still need answering ",
        "description": "Pete Hegseth's angry news conference, where the US defence secretary roundly abused those media outlets and individuals who didn't agree with him, certainly told us one thing.",
        "url": "https://news.sky.com/story/pete-hegseths-news-conference-made-one-thing-clear-8211-but-two-questions-still-need-answering-13389081",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-pete-hegseth-defence-secretary_6951281.jpg?20250626143733",
        "type": "World",
        "Author": "Michael Clarke",
        "Date Published": "2025-06-26 16:17:00",
        "Headline": "The fierce argument over how to characterise the damage done in the US attack on Iran's Fordow nuclear plant is really just a semantic spat. The key questions are rather different.",
        "Content": "\n          Military analyst\n        Pete Hegseth's angry news conference, where the US defence secretary roundly abused those media outlets and individuals who didn't agree with him, certainly told us one thing. That when reliable information eventually emerges from the battle damage assessment of the US attack on Iran's Fordow nuclear plant, it won't be accepted by everyone. The whole issue has suddenly become politically toxic in Washington DC and will doubtless be fed into the spin dryer of vitriolic commentary and assertion that has been the most stand-out feature of this second Trump administration. But what we did find out from the chairman of the joint chiefs of staff, General Dan Caine, was that the GBU-57 bunker buster bombs had been designed in some secrecy with exactly this sort of target in mind.  Trump-Iran live: US president reacts to Hegseth news conference We also learned they all worked as per the test simulations, and that 12 were fired at six separate targets at Fordow and another two at a single target at the Natanz nuclear facility. But the fierce argument over how to characterise the damage done in these attacks is really just a semantic spat. The two key questions are rather different. \n                  What will Keir Starmer learn from the Labour welfare chaos?\n                 \n                  There were toe-curling displays of affection towards 'Daddy' Trump at the NATO summit - but like it or not, it worked\n                 \n                  CIA chief says Iran nuclear site 'severely damaged' by US strikes - despite leaked report claiming the impact was minimal\n                 Firstly, will the Iranians decide to give up their quest for a nuclear weapon as a result of this attack, as the Syrians did in 2007 when the Israelis destroyed their Al Kibar nuclear reactor? Or else will they go hell for leather for a nuclear weapon, as Iraqi leader Saddam Hussein did after the Israelis destroyed his nuclear reactor in 1981? Read more:Truth about success of US strikes lies deep undergroundNATO chief refers to Trump as 'daddy' And secondly, if the Iranians decide to go again for a nuclear weapon, how long will it be before they are back at the nuclear threshold, where they were less than a month ago? Will it be within a year? Or five years? Or longer? When we have an answer to those two questions, then we can put some real perspective on whether the US bombing has really been a success."
    },
    {
        "title": "Brazil calls out world 'preoccupied' by defence, as it prepares to host global climate summit COP30",
        "description": "Brazilian officials have rebuked the push to increase defence spending, as it tries to bring countries together for negotiations on tackling climate change later in the year.",
        "url": "https://news.sky.com/story/brazil-calls-out-world-preoccupied-by-defence-as-it-prepares-to-host-global-climate-summit-cop30-13389174",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-marina-silva-brazil_6951566.jpg?20250626233444",
        "type": "World",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-06-26 21:48:00",
        "Headline": "While western leaders are distracted by military spending and security concerns, Brazil fears the knock on impact on the climate fight. Minister Marina Silva also vowed this year's COP30 climate summit would be \"different\" from the preceding ones.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Brazilian officials have rebuked the push to increase defence spending, as it tries to bring countries together for negotiations on tackling climate change later in the year. Last year's COP climate conference ended in disappointment after failing to cough up anything like enough money to help countries cope with already rising sea levels, heavier floods and harsher droughts, which are forcing people to migrate. But this week NATO member states broadly agreed to a US demand to boost defence spending to 5% of gross domestic product. Read more: 'Things are getting worse', experts warn Leaders are anxious about military threats from Russia and terrorism, while the number of global conflicts and people killed in them have been rising since the 2000s. Brazil's climate minister Marina Silva, in London to drum up support before Brazil hosts COP30 in November, admitted countries are somewhat \"preoccupied\".  \"We have been discussing for so many years, the $100bn, the $300bn, and then now the $1.3 trillion targets that we need [for climate funding],\" she told a news conference on Thursday. And then \"very swiftly, there is an announcement of the increase of 5% in the expenditure in defence\" when that money \"ought to be going in the other direction\", she said via a translator. The money should be used not to fight wars but for \"fighting hunger [and] the climate emergency\", she added. The UK in February raided its foreign aid budget to boost defence spending, prompting warnings it will struggle to keep its £11.6bn climate aid promise. Her comments echo those of Brazilian President Luiz Inácio Lula da Silva, who last week told G7 leaders: \"Year after year, wars and conflicts accumulate. \"Military spending annually consumes the equivalent to Italy's GDP. \"This corresponds to $2.7 trillion that could be invested in hunger eradication and the just transition.\" In Ukraine, \"only dialogue between the parties can lead to a ceasefire and pave the way for lasting peace\", he said. The fears about the world becoming more dangerous and fractured are set to make beleaguered climate talks even more challenging. Governments are already failing to ditch fossil fuels and are grappling with a surge in power demand, driven by things like AI datacentres and air conditioning. That means emissions of greenhouse gases continue to rise when they should be plummeting - though the rise appears to be tapering off. However minister Silva did say despite the \"geopolitical context\", her team had encountered \"a lot of the support and solidarity and commitment\" to climate negotiations. She also vowed this year's COP would be \"different from the preceding ones\", with a focus on implementing pledges. They also met with King Charles and Prince William while they were in the capital for London Climate Action Week."
    },
    {
        "title": "Jeff Bezos's Venice wedding celebrations begin with star-studded party after fresh protests",
        "description": "Jeff Bezos and Lauren Sanchez's star-studded wedding celebrations in Venice have begun, with VIP guests including the Kardashians descending on the Italian city.",
        "url": "https://news.sky.com/story/jeff-bezoss-venice-wedding-celebrations-begin-with-star-studded-party-after-fresh-protests-13389107",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wedding-sanchez-bezos_6951463.jpg?20250626190337",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-26 17:57:00",
        "Headline": "While the couple and their A-list guests were all smiles, some in Venice are not happy about the wedding - with protesters seeing it as an example of the city being gift-wrapped for ultra-rich outsiders.",
        "Content": "Jeff Bezos and Lauren Sanchez's star-studded wedding celebrations in Venice have begun, with VIP guests including the Kardashians descending on the Italian city. The billionaire Amazon founder and his journalist fiancee waved to onlookers as they left a luxury hotel to travel to their pre-wedding reception by water taxi on Thursday evening. Hollywood star Orlando Bloom was seen flashing a peace sign to fans as he left Venice's Gritti Palace Hotel and he was soon followed by TV presenter Oprah Winfrey, who smiled and waved. Kim and Khloe Kardashian travelled to the reception with their mother Kris Jenner - who snapped a picture of the pair on a water taxi - and other notable figures in town for the nuptials include Ivanka Trump and Jared Kushner. Some 200-250 A-list guests from showbusiness, politics and finance are expected to attend the events, with the wedding and its parts estimated to cost €40m-€48m (£34m-£41m). Bezos, his soon-to-be wife and their famous guests have taken over numerous locations in the city, with the couple staying in the luxury Aman hotel, where rooms go for at least €4,000 per night. The first of the weekend's many wedding parties is taking place in the cloisters of Madonna dell'Orto, a medieval church that hosts masterpieces by 16th century painter Tintoretto. While the couple and their A-list guests were all smiles, some in Venice are not happy about the wedding - with protesters seeing it as an example of the city being gift-wrapped for ultra-rich outsiders. Read more: Why are activists protesting the wedding? An activist climbed one of the poles in the main St Mark's Square on Thursday, unfurling a banner which said: \"The 1% ruins the world.\" Elsewhere, a life-size mannequin of Bezos clutching an Amazon box was dropped into one of the city's famous canals. €48m price tag The wedding and its parts are expected to cost €40m-€48m (£34-£41m), Luca Zaia, the president of Venice's local government, said on Tuesday. This includes sizeable charity donations from the Amazon founder, including €1m (£850k) to Corila, a consortium that studies Venice's lagoon ecosystem, local media has reported.  90 private jets  The first private jets began landing at Venice airport on Tuesday and there will be around 90 in total, Mr Zaia said. \n  They're not all arriving in Venice though, as some have landed at the nearby Treviso and Verona airports. 250 guests  Five of the city's most luxurious hotels have been booked out to host an estimated 200-250 guests.  These include the celeb favourite Cipriani, where George and Amal Clooney married in 2014. 30 water taxis Attendees of course aren't hopping on public water buses to get around the city's many islands.  The wedding's organisers have booked at least 30 water taxis for them to use instead.  In a bid to keep demonstrators away from Thursday's party, the city council banned pedestrians and water traffic from the area surrounding the venue, from 4.30pm local time to midnight.  The couple will exchange their vows on Friday, on the small island of San Giorgio, opposite St Mark's Square. Another party will follow on Saturday - the venue for which was changed at the last-minute earlier this week."
    },
    {
        "title": "North Korea opens huge coastal resort as Kim Jong Un celebrates 'one of the greatest successes this year'",
        "description": "North Korea has built a huge coastal resort which might one day open to foreign tourists.",
        "url": "https://news.sky.com/story/north-korea-opens-huge-coastal-resort-as-kim-jong-un-celebrates-one-of-the-greatest-successes-this-year-13388815",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wonsan-kim-jong-un_6950905.jpg?20250626074940",
        "type": "World",
        "Author": "Samuel Osborne",
        "Date Published": "2025-06-26 08:16:00",
        "Headline": "The secretive state's leader opened the Wonsan Kalma coastal tourist area with \"great satisfaction\" and called it \"the proud first step\" towards realising the government's policy of developing tourism.",
        "Content": "\n          News reporter\n              @samuelosborne93\n North Korea has built a huge coastal resort which might one day open to foreign tourists. The secretive state's leader Kim Jong Un opened the Wonsan Kalma coastal tourist area with \"great satisfaction\", the official Korean Central News Agency (KCNA) reported. Mr Kim toured the site and said its construction would be considered \"one of the greatest successes this year\" and called it \"the proud first step\" towards realising the government's policy of developing tourism. The beach resort can accommodate around 20,000 visitors and will open to domestic tourists next Tuesday, but the report did not say when it would welcome foreign visitors. Mr Kim opened the resort with his daughter, and presumed heir, Kim Ju Ae and wife Ri Sol Ju. The North Korean leader has been working to shape the hermit kingdom into a tourist destination as part of efforts to revive its struggling economy. State media says North Korea will confirm plans to build large tourist sites in other locations as well. North Korea is yet to fully lift the ban on foreign tourists it imposed in early 2020 in response to the coronavirus pandemic. From February 2024 it has been accepting Russian tourists amid the deepening relations between the two countries, but Chinese group tours remain stalled, despite making up more than 90% of visitors before the pandemic. Russia's ambassador to North Korea and his embassy staff attended the ceremony marking the completion of the resort, KCNA said. It did not say whether any Chinese diplomats had been invited. Read more:North Korea tests hypersonic missile of 'intermediate range'Kim Jong Un triggers huge explosion in capital construction project A small group of international tourists visited the country for the first time in February this year, but in March travel agencies said their tours to North Korea were paused. In April it held a marathon event which hosted foreign runners."
    },
    {
        "title": "Fito - Ecuador's most-wanted fugitive - found hiding under kitchen counter after a year on the run",
        "description": "Ecuador's most-wanted fugitive has been recaptured - more than a year after he escaped from a maximum-security prison.",
        "url": "https://news.sky.com/story/fito-ecuadors-most-wanted-fugitive-found-hiding-under-kitchen-counter-after-a-year-on-the-run-13388750",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-macias-villamar-ecuador_6950852.jpg?20250626045527",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-26 03:37:00",
        "Headline": "\"Fito\" had cult status among the public and was known for throwing parties in prison, where he had access to alcohol and roosters for cockfighting matches.",
        "Content": " Ecuador's most-wanted fugitive has been recaptured - more than a year after he escaped from a maximum-security prison. Jose Adolfo Macias, also known as \"Fito\", led a gang called Los Choneros and was discovered in his hometown of Manta following a 10-hour operation. Footage from the Ecuadorian army showed a uniformed officer aiming a gun at the drug trafficker's head after finding him hiding in a small hole beneath a kitchen counter. \"Fito\" has an extensive criminal record including charges of murder and organised crime, and he was sentenced to 34 years behind bars in 2011. Officials are yet to explain how he escaped - and only realised he was missing when the military arrived to transfer him to another prison and found his cell empty. A 60-day state of emergency was declared, with hooded gunmen bursting onto the set of a live television studio and declaring they had bombs.  Interpol quickly issued an arrest warrant for Macias, who is due to face international drug and gun charges at a court in New York. \n                  'British man' dies after being dragged out of police station in Ecuador - reports\n                 \n                  Ecuador: Five jailed over murder of presidential candidate Fernando Villavicencio\n                 \n                  Ecuador police rescue 49 kidnapping victims from crime gang\n                 He has been accused of distributing cocaine around the world, and smuggling firearms and ammunition from the US into Ecuador with the help of Mexican cartels. Ecuadorian President Daniel Noboa confirmed the country has already requested his extradition to the US - and vowed that more notorious gang members \"will fall\". Read more world news:Man on death row for almost 50 years executedDirector of next James Bond film announced  \"Fito\" had cult status among the public and was known for throwing parties in prison, where he had access to alcohol and roosters for cockfighting matches. In 2023, he released a video addressed to the Ecuadorian people while behind bars - and was flanked by armed men. The US classified Los Choneros as one of the world's most violent gangs last year, while Ecuador has described it as a terrorist organisation. His capture comes weeks after the government announced that the reward for his capture was going to be increased to $1m (£729,000)."
    },
    {
        "title": "Richard Gerald Jordan: Man who was on death row in Mississippi for almost 50 years executed",
        "description": "A man who was on death row in Mississippi for almost 50 years has been executed.",
        "url": "https://news.sky.com/story/richard-gerald-jordan-man-who-was-on-death-row-in-mississippi-for-almost-50-years-executed-13388733",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-richard-gerald-jordan_6950848.jpg?20250626011814",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-26 00:10:00",
        "Headline": "Richard Gerald Jordan kidnapped Edwina Marter and shot her dead in a forest - before demanding a $25,000 ransom from her husband.",
        "Content": "A man who was on death row in Mississippi for almost 50 years has been executed. Richard Gerald Jordan kidnapped and killed Edwina Marter, a stay-at-home mother who was married to a banker, in a violent ransom scheme. The 79-year-old, a Vietnam War veteran who suffered from post-traumatic stress disorder, died by lethal injection at 6.16pm local time (12.16am UK time) on Wednesday. Jordan was the longest-serving man on death row in Mississippi - and had sued the state over its three-drug execution protocol, arguing it was inhumane. When given an opportunity to make a final statement, he said: \"First I would like to thank everyone for a humane way of doing this. I want to apologise to the victim's family.\" Jordan's wife Marsha and his lawyer Krissy Nobile attended the execution, and dabbed their eyes several times as it took place. He thanked them both and asked for forgiveness, and his final words were: \"I will see you on the other side, all of you.\" \n                  Death row inmate in US executed using nitrogen gas after Supreme Court appeal fails\n                 \n                  Death Row prisoner uses final words to swear - before taking 10 minutes to die in nitrogen execution\n                 \n                  Alabama executes man who asked to be put to death - as Texas judge halts another execution\n                 Mrs Marter's husband Charles and her two sons were not present.  This is the third execution to take place in Mississippi over the past 10 years, with the last taking place back in December 2022. A man was also put to death in Florida on Tuesday, meaning this is shaping up to be the year with the most executions since 2015. Back in 1976, Jordan had called the Gulf National Bank. An operator said Charles Marter could take the call. He then hung up and found Mr Marter's home address in the phone book, and kidnapped his wife Edwina. According to court records, he fatally shot her in a forest - and then rang Mr Marter to demand a $25,000 ransom for her safe return. Her son, who was 11 years old at the time of the murder, previously said that the execution \"should have happened a long time ago\". Eric Marter added: \"I'm not really interested in giving him the benefit of the doubt. He needs to be punished.\" Read from US news:Man dies after being struck by lightning on honeymoonPakistan says it will nominate Trump for Nobel Peace Prize  Jordan's lawyer had attempted to argue that a jury never got to hear about his experiences in Vietnam, but her appeal was dismissed by the Supreme Court. A petition had also asked Mississippi governor Tate Reeves for clemency, and said Jordan suffered severe PTSD after serving three back-to-back tours, which could have been a factor in his crime. Franklin Rosenblatt from the National Institute of Military Justice said: \"His war service, his war trauma, was considered not relevant in his murder trial. \"We just know so much more than we did 10 years ago, and certainly during Vietnam, about the effect of war trauma on the brain and how that affects ongoing behaviours.\" But Eric Marter said he disagreed with this argument, adding: \"I know what he did. He wanted money and he couldn't take her with him. And so he did what he did.\""
    },
    {
        "title": "How gene therapy device could create personalised medicines for rare diseases",
        "description": "A new portable gene therapy device could allow hospital pharmacies to create personalised medicines on demand, a new study says.",
        "url": "https://news.sky.com/story/how-gene-therapy-device-could-create-personalised-medicines-for-rare-diseases-13388819",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nanospresso-health_6951030.png?20250626104059",
        "type": "World",
        "Author": "Megan Harwood-Baynes",
        "Date Published": "2025-06-26 08:27:00",
        "Headline": "Rare diseases affect more than 300 million people worldwide - 36 million in the EU alone - but they are often overlooked due to low patient numbers and the high costs associated with drug development.",
        "Content": "\n          Social affairs and health reporter\n              @megbaynes\n A new portable gene therapy device could allow hospital pharmacies to create personalised medicines on demand, a new study says. Rare diseases affect more than 300 million people worldwide - 36 million in the EU alone - but they are often overlooked due to low patient numbers and the high costs associated with drug development. Most medicines are made in factories and shipped to hospitals, but for rare conditions there often aren't enough patients for companies to justify developing medicines in bulk. But the NANOSPRESSO project could allow pharmacists to create medicines for them on demand, according to a paper published in Frontiers in Science. A pharmacist using the machine would put ingredients (such as genetic material and fats) into a small cartridge, which the device then mixes together in a very precise way. A tiny, targeted medicine can then be injected into the patient. Prof Raymond Schiffelers, who led the project, said there is an \"urgent need\" for a way to make personalised medicines in hospitals and on demand in an affordable way. \"By shifting production to the point of care, NANOSPRESSO could help bring life-changing precision medicines within reach of patients.\" \n                  Post Office: Police identify seven suspects related to Horizon scandal\n                 \n                  Government makes concessions to Labour rebels over welfare reforms\n                 \n                  'Atrocity not accident': Families of pedestrians killed by drivers running red lights speak out\n                 However, NANOSPRESSO faces significant hurdles before it can be seen in a healthcare setting anytime soon. The medicines it creates will need to meet strict safety and quality standards, and regulators will need to decide how they will approve and monitor individualised treatments. Read more:500 families in Oxford call for maternity unit to be investigatedWeight loss jabs linked to potentially fatal side effectNext Bond director announced \"NANOSPRESSO could revolutionise the way we treat rare diseases by bringing personalised medicine to more patients, faster,\" says study author Dr Mariona Estapé Senti. \"The user-friendly, affordable device could let medics treat conditions that conventional approaches can't manage.\" The study cites a historical precedent for pharmacies producing medicines - until the 20th century, pharmacists routinely prepared tailored medicines by hand. They also cite the success of using similar nucleic acid platforms to produce mRNA vaccines during the COVID-19 pandemic, and say that modern advancements in closed-system microfluidics have enabled such breakthroughs such as this."
    },
    {
        "title": "Six killed in China floods as tropical storm threatens further devastation",
        "description": "At least six people have died after floods overwhelmed China's Guizhou province.",
        "url": "https://news.sky.com/story/six-killed-in-china-floods-as-tropical-storm-threatens-further-devastation-13388773",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-china-flood-rongjiang_6950073.jpg?20250625073925",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-26 05:58:00",
        "Headline": "Flooding in the city of Rongjiang in Guizhou province reached a scale that could only happen once in 50 years, meteorologists said.",
        "Content": "At least six people have died after floods overwhelmed China's Guizhou province. The flooding has spread to other southwestern parts of the country, submerging towns and villages, ahead of a tropical depression. Parts of neighbouring Guangxi province are half-submerged, with the township of Meilin worst hit, state media reported on Thursday. Floodwaters peaked at more than 4 metres (13ft) above what was considered safe. Rongjiang and Congjiang in Guizhou province have already seen flooding, but now the wider region is on alert for potential road collapses, landslides and hydro-dam overflows. On Tuesday, at least six people died when Rongjiang - a city of around 300,000 residents where three rivers meet - was hit by a flood on a scale that Chinese meteorologists said could only happen once in 50 years. At one point, the flow rate in the River Liu was more than 80 times the average.  Displaced residents were forced to stay at local hotels, which were also hosting rescue personnel and reconstruction workers, according to Reuters. As deluge-hit areas began to remove silt left behind by the flooding and restore power, water and phone lines - a tropical depression was expected to strike Guangxi on Thursday night. The storm risks a new round of flooding. The tropical depression made landfall on China's island province of Hainan early on Thursday, and later again in Guangdong on the mainland. It brought further rain to a region still suffering after Typhoon Wutip two weeks ago. Read more from Sky News:Ecuador's most-wanted is foundThe truth about US airstrikes on IranEurope needs 'millions of drones' Extreme storms and severe flooding, which meteorologists link to climate change, increasingly pose major challenges for Chinese officials. The storms threaten to overwhelm ageing flood defences, displace millions of people and cause billions of dollars in economic losses. \"Climate change is making extreme weather more frequent and unpredictable,\" said Chen Xiaoguang, a professor at Southwestern University of Finance and Economics in Chengdu, in Sichuan province. \"Rural areas face significant challenges due to limited infrastructure and resources,\" he added."
    },
    {
        "title": "US defence secretary's Iran strikes briefing turned into a full throttle assault on the press",
        "description": "Two things can be true at the same time.",
        "url": "https://news.sky.com/story/us-defence-secretarys-iran-strikes-briefing-turned-into-a-full-throttle-assault-on-the-press-13389120",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-pete-hegseth-pentagon_6951211.jpg?20250626131253",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-06-26 18:38:00",
        "Headline": "The storm around the level of destruction caused by Saturday's American airstrikes could be a distraction. Nevertheless, the early morning Pentagon news conference revealed plenty.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  Two things can be true at the same time. It's possible that the American airstrikes did \"obliterate\" the Iranian nuclear sites hit on Saturday night. It's also possible that Iran retains stockpiles of enriched uranium and nuclear production equipment elsewhere - undisclosed. We know from the International Atomic Energy Agency that Iran has been obstructive, and we know too that the regime has attempted to build new facilities. This pattern of behaviour makes it possible, even probable, that they have existing hidden programmes. Preliminary intelligence reports shared with European governments indicated that Iran's highly-enriched uranium stockpile remains largely intact and that much of it was not concentrated in the Fordow site. Given all this, the storm around the level of destruction caused by Saturday's American airstrikes could be a distraction. Nevertheless, the early morning Pentagon news conference revealed plenty. There were two strands to the briefing. From the politician, we got a political attack, and from the general, we got the military detail. The attack on the media Defence secretary Pete Hegseth went full throttle on his assault against the 'fake news'. He didn't just shoot the messenger; he sprayed his blunt criticism all over the defence department press room with characteristic disdain. The Fox News anchor-turned-politician has left his past well behind him.  \"In hunting for scandals all the time, in trying to find wedges and spin stories, this press corps and the press corps miss historic moments,\" he said. \"You, and I mean specifically you, the press, specifically you, the press corps, because you cheer against Trump so hard. \"It's like in your DNA and in your blood to cheer against Trump because you want him not to be successful, so bad. You have to cheer against the efficacy of these strikes.\" This was a news conference to counter the leaks to numerous US news outlets, which suggested that the weekend strikes on the Iranian nuclear site might not have been very successful. The leaks, which Team Trump believes may have come from Congress, where certain lawmakers were shown the initial intelligence assessments, were from a preliminary report which was marked as containing 'low confidence' information. Mr Hegseth said: \"How about we talk about how special America is, that only we have these capabilities. \"I think it's too much to ask, unfortunately, for the fake news, so we're used to that, but we also have an opportunity to stand at the podium and read the truth of what's really happened... \"And the reality is, you want to call it destroyed. You want to call it defeated. You want to call it obliterated. Choose your word. This was a historically successful attack.\" The spy and the specially-designed bomb The second strand of the news conference, from America's top general Dan Caine, provided us with new details about the air strikes last Saturday night. General Caine would not be drawn on the definitive success of the bombings. \"We do not mark our own homework,\" he said. Instead, he sought to illustrate how the mission the military was tasked with, and the performance of the weapons used, all played out perfectly.  He revealed the Fordow nuclear site had been under surveillance for 15 years. One intelligence officer, he said, had the job of monitoring the site. \"For more than 15 years, this officer and his teammate lived and breathed this single target,\" General Caine said. \"He studied the geology. He watched the Iranians dig it out. He watched the construction, the weather, the discard material, the geology, the construction materials, where the materials came from. \"He looked at the vent shaft, the exhaust shaft, the electrical systems, the environmental control systems, every nook, every crater, every piece of equipment going in and every piece of equipment going out, they literally dreamed about this target at night, when they slept.\" He also revealed the bunker-busting bombs were developed precisely for this mission. He showed newly-declassified videos of the Massive Ordnance Penetrators (MOP) bombs exploding in test scenarios. Together, the information was designed to show the high probability of massive damage to the nuclear sites. Read more:Trump dodges commitment to NATO principleWhy did the US attack on Iran avoid some nuclear sites? A congressional leak? In a related development, a Trump administration official has confirmed that the White House plans to limit intelligence sharing with lawmakers following the leak of the initial damage assessment. According to NBC News, the administration plans to post less information on CAPNET, which is the name of a system utilised to share classified material with Congress. It is not clear whether the assessment was leaked by someone in Congress or by a defence department official, but the speaker of the house - Trump ally Mike Johnson - said he suspects it came from Congress. \"There was a leak, and we're trying to get down to the bottom of that. It's dangerous and ridiculous that happened. We're going to solve that problem, and we'll keep the coordination,\" Mr Johnson told NBC News. Democratic Party Minority Leader Chuck Schumer criticised the development. \"They seem not to want to see the facts get out. Just Trump's version of the facts, which we know is often false,\" Schumer said."
    },
    {
        "title": "Pete Hegseth's news conference made one thing clear – but two questions still need answering ",
        "description": "Pete Hegseth's angry news conference, where the US defence secretary roundly abused those media outlets and individuals who didn't agree with him, certainly told us one thing.",
        "url": "https://news.sky.com/story/pete-hegseths-news-conference-made-one-thing-clear-8211-but-two-questions-still-need-answering-13389081",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-pete-hegseth-defence-secretary_6951281.jpg?20250626143733",
        "type": "US",
        "Author": "Michael Clarke",
        "Date Published": "2025-06-26 16:17:00",
        "Headline": "The fierce argument over how to characterise the damage done in the US attack on Iran's Fordow nuclear plant is really just a semantic spat. The key questions are rather different.",
        "Content": "\n          Military analyst\n        Pete Hegseth's angry news conference, where the US defence secretary roundly abused those media outlets and individuals who didn't agree with him, certainly told us one thing. That when reliable information eventually emerges from the battle damage assessment of the US attack on Iran's Fordow nuclear plant, it won't be accepted by everyone. The whole issue has suddenly become politically toxic in Washington DC and will doubtless be fed into the spin dryer of vitriolic commentary and assertion that has been the most stand-out feature of this second Trump administration. But what we did find out from the chairman of the joint chiefs of staff, General Dan Caine, was that the GBU-57 bunker buster bombs had been designed in some secrecy with exactly this sort of target in mind.  Trump-Iran live: US president reacts to Hegseth news conference We also learned they all worked as per the test simulations, and that 12 were fired at six separate targets at Fordow and another two at a single target at the Natanz nuclear facility. But the fierce argument over how to characterise the damage done in these attacks is really just a semantic spat. The two key questions are rather different. \n                  What will Keir Starmer learn from the Labour welfare chaos?\n                 \n                  There were toe-curling displays of affection towards 'Daddy' Trump at the NATO summit - but like it or not, it worked\n                 \n                  CIA chief says Iran nuclear site 'severely damaged' by US strikes - despite leaked report claiming the impact was minimal\n                 Firstly, will the Iranians decide to give up their quest for a nuclear weapon as a result of this attack, as the Syrians did in 2007 when the Israelis destroyed their Al Kibar nuclear reactor? Or else will they go hell for leather for a nuclear weapon, as Iraqi leader Saddam Hussein did after the Israelis destroyed his nuclear reactor in 1981? Read more:Truth about success of US strikes lies deep undergroundNATO chief refers to Trump as 'daddy' And secondly, if the Iranians decide to go again for a nuclear weapon, how long will it be before they are back at the nuclear threshold, where they were less than a month ago? Will it be within a year? Or five years? Or longer? When we have an answer to those two questions, then we can put some real perspective on whether the US bombing has really been a success."
    },
    {
        "title": "Brad Pitt's Los Angeles home broken into",
        "description": "Brad Pitt's home in Los Angeles was broken into on Wednesday, two law enforcement sources have told Sky News' US partner, NBC News.",
        "url": "https://news.sky.com/story/brad-pitts-los-angeles-home-broken-into-13389149",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-pitt-brad_6951524.jpg?20250626212608",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-26 20:21:00",
        "Headline": "The Hollywood star wasn't at home when the alleged burglary took place on Wednesday night, two law enforcement sources have told Sky News' US partner, NBC News.",
        "Content": "Brad Pitt's home in Los Angeles was broken into on Wednesday, two law enforcement sources have told Sky News' US partner, NBC News. The actor was not in when the alleged break-in occurred, the sources said. Los Angeles Police Department (LAPD) is investigating a reported burglary. An LAPD spokesman confirmed a break-in at a residence in the Los Feliz area of Los Angeles at 10.30pm on Wednesday. However, the spokesman did not identify who lived at the property or who owned it. An unknown amount of property was allegedly stolen by the thieves, the value of which has not been disclosed. Read more from Sky News:Two Met Police officers sacked over strip search of schoolgirlWeight loss and diabetes jabs linked to potentially fatal side effect Police were looking for three suspects who climbed over a front fence and broke in through the home's front window, the sources said. Pitt, 61, was in London on Monday for the European premiere of his new film, F1: The Movie. Directed and co-written by Top Gun: Maverick filmmaker Joseph Kosinski, F1 was partly filmed during Formula One Grand Prix weekends, with scenes shot on the circuits during breaks and real drivers also appearing on screen."
    },
    {
        "title": "Dame Anna Wintour steps back as American Vogue editor-in-chief after 37 years",
        "description": "Dame Anna Wintour is stepping down as American Vogue editor-in-chief after 37 years.",
        "url": "https://news.sky.com/story/dame-anna-wintour-steps-back-as-vogue-editor-in-chief-after-37-years-13389141",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wintour-met_6951520.jpg?20250626212038",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-26 20:08:00",
        "Headline": "Dame Anna transformed American Vogue after landing the top job in 1988, following a three-year stint editing the British version - but is stepping aside so she can \"help the next generation of editors\". ",
        "Content": "Dame Anna Wintour is stepping down as American Vogue editor-in-chief after 37 years. The British-born editor broke the news to the magazine's staff at a meeting on Thursday, announcing that a new role, head of editorial content, would be introduced. The longtime Vogue powerhouse isn't leaving the publication entirely, though. She will remain global editorial director of Vogue and chief content officer for its publishing house, Conde Nast. Whoever lands the role of head of editorial content will report directly to Dame Anna, who will continue to oversee all of Conde Nast's brands, including Vanity Fair and GQ, except for The New Yorker. According to Vogue, Dame Anna told staff at Thursday's meeting she wanted to \"help the next generation of editors storm the field with their own ideas\". \"Anybody in a creative field knows how essential it is never to stop growing in one's work,\" she said. \"When I became the editor of Vogue, I was eager to prove to all who might listen that there was a new, exciting way to imagine an American fashion magazine. \"Now, I find that my greatest pleasure is helping the next generation of impassioned editors storm the field with their own ideas, supported by a new, exciting view of what a major media company can be.\" Read more:Bezos wedding celebrations start in VeniceDirector picked for next Bond film As well as editing US Vogue, Dame Anna has run the annual Met Gala since 1995, raising more than $300m (£220m) for the fashion wing of the Metropolitan Museum of Art. She landed the top job at American Vogue in 1988 following a three-year stint editing the British version. In her 37 years at the magazine, she transformed the title by featuring celebrities on the cover and mixing high fashion with more affordable street style. She was given a Damehood for her services to fashion earlier this year. Following the investiture ceremony at Buckingham Palace, Dame Anna said she did not intend to retire anytime soon. She said: \"The last time I was here, the Queen gave me a medal and we both agreed that we had been doing our job a very long time, and then this morning His Majesty asked me if this meant I was going to stop working, and I said firmly, no.\""
    },
    {
        "title": "Prosecutors give closing arguments in Sean 'Diddy' Combs trial",
        "description": "Sean \"Diddy\" Combs led a criminal enterprise for two decades, using \"power, violence and fear\" to carry out brutal crimes, believing his \"fame, wealth and power\" put him above the law, a prosecutor has told his trial.",
        "url": "https://news.sky.com/story/prosecutors-give-closing-arguments-in-sean-diddy-combs-trial-13389178",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-diddy-sean-combs_6951274.jpg?20250626141802",
        "type": "US",
        "Author": "Bethany Minelle",
        "Date Published": "2025-06-26 22:08:00",
        "Headline": "The prosecution has given its closing argument, following more than six weeks of testimony in the Sean \"Diddy\" Combs trial, with the defence due to wrap up their case on Friday.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Sean \"Diddy\" Combs led a criminal enterprise for two decades, using \"power, violence and fear\" to carry out brutal crimes, believing his \"fame, wealth and power\" put him above the law, a prosecutor has told his trial. Christy Slavik spoke for nearly five hours, as she presented the prosecution's closing arguments after more than six weeks of testimony and 34 witnesses. She began by describing the 55-year-old music mogul, telling the court: \"He's the leader of a criminal enterprise. He doesn't take 'no' for an answer. And now you know about many crimes he committed with members of his enterprise.\" She said charges of sex trafficking and racketeering conspiracy were supported by proof that over two decades, Combs kidnapped one of his employees, committed arson by trying to blow up fellow rapper Kid Cudi's car, engaged in forced labour, bribed a security officer and carried out the \"brutal crimes at the heart of this case.\" Diddy trial: As it happened Ms Slavik said Combs \"again and again forced, threatened and manipulated\" his former girlfriend, Cassie Ventura and an ex-girlfriend who testified under the pseudonym Jane into drugged-up, elaborate sexual performances, dubbed \"freak offs\" or \"hotel\" or \"king nights\". \"The defendant used power, violence and fear to get what he wanted,\" she said. \"He thought that his fame, wealth and power put him above the law.\" Combs is charged with one count of racketeering conspiracy, two charges of sex trafficking, and two charges of transportation to engage in prostitution. He has pleaded not guilty to all charges and has strenuously denied all allegations of sexual abuse. Read more:Everything you need to know about the trialThe rise and fall of Sean 'Diddy' CombsWhat we learned from Cassie's testimony Ms Slavik said Combs used a \"small army\" of employees - his trusted inner circle of staff including bodyguards and assistants - to \"serve his needs,\" covering up his harm to women in the process. Homing in on the racketeering charge against him, she said, while Combs was already \"very powerful\", he became even more so with the support of his business. She said Combs and his inner circle \"committed hundreds of racketeering acts,\" including drug distribution, kidnapping, arson and witness tampering. They listed drugs such as cocaine, meth, ketamine, Oxycodone and MDMA, that Combs's assistants said they procured for him, or that federal agents said they found during raids of his multiple homes. During parts of the evidence, Combs looked dejected, sitting with his head down, and with his chair pushed back from the defence table. At one point, when video footage of Combs appearing to beat Cassie at the InterContinental Hotel was shown to the court, he looked away. Combs has been in a New York jail since his arrest in September last year. If convicted on all counts, he could face a minimum 15-year prison term and could be sentenced to life behind bars. The 12-member jury must be unanimous to convict Combs on any of the counts. Defence lawyers have conceded that Combs was involved in domestic violence but say he committed no federal crimes. They say the women took part in the \"freak offs\" willingly and that there was no racketeering conspiracy because none of his employees agreed to be part of any conspiracy. They say the drugs procured were for his own personal use. But in her closing argument, Ms Slavik said employees repeatedly agreed to commit crimes for Combs, such as delivering him drugs, accompanying him to kidnap his personal assistant, Capricorn Clark, and locking his girlfriend in a hotel room after he stomped on her face. In her conclusion, she said proof of Combs's guilt had been demonstrated, adding: \"Before today, he was able to get away with it due to his money, power and influence, but that stops now… \"It is time to hold him accountable, it is time for justice, and it's time to find him guilty.\" On Friday, Combs's lead attorney Marc Agnifilo will give his closing argument, followed by the government's rebuttal. Judge Arun Subramanian says he will instruct the jury on the law later that day, allowing them to begin deliberating as early as late afternoon. The trial continues."
    },
    {
        "title": "Jeff Bezos's Venice wedding celebrations begin with star-studded party after fresh protests",
        "description": "Jeff Bezos and Lauren Sanchez's star-studded wedding celebrations in Venice have begun, with VIP guests including the Kardashians descending on the Italian city.",
        "url": "https://news.sky.com/story/jeff-bezoss-venice-wedding-celebrations-begin-with-star-studded-party-after-fresh-protests-13389107",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wedding-sanchez-bezos_6951463.jpg?20250626190337",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-26 17:57:00",
        "Headline": "While the couple and their A-list guests were all smiles, some in Venice are not happy about the wedding - with protesters seeing it as an example of the city being gift-wrapped for ultra-rich outsiders.",
        "Content": "Jeff Bezos and Lauren Sanchez's star-studded wedding celebrations in Venice have begun, with VIP guests including the Kardashians descending on the Italian city. The billionaire Amazon founder and his journalist fiancee waved to onlookers as they left a luxury hotel to travel to their pre-wedding reception by water taxi on Thursday evening. Hollywood star Orlando Bloom was seen flashing a peace sign to fans as he left Venice's Gritti Palace Hotel and he was soon followed by TV presenter Oprah Winfrey, who smiled and waved. Kim and Khloe Kardashian travelled to the reception with their mother Kris Jenner - who snapped a picture of the pair on a water taxi - and other notable figures in town for the nuptials include Ivanka Trump and Jared Kushner. Some 200-250 A-list guests from showbusiness, politics and finance are expected to attend the events, with the wedding and its parts estimated to cost €40m-€48m (£34m-£41m). Bezos, his soon-to-be wife and their famous guests have taken over numerous locations in the city, with the couple staying in the luxury Aman hotel, where rooms go for at least €4,000 per night. The first of the weekend's many wedding parties is taking place in the cloisters of Madonna dell'Orto, a medieval church that hosts masterpieces by 16th century painter Tintoretto. While the couple and their A-list guests were all smiles, some in Venice are not happy about the wedding - with protesters seeing it as an example of the city being gift-wrapped for ultra-rich outsiders. Read more: Why are activists protesting the wedding? An activist climbed one of the poles in the main St Mark's Square on Thursday, unfurling a banner which said: \"The 1% ruins the world.\" Elsewhere, a life-size mannequin of Bezos clutching an Amazon box was dropped into one of the city's famous canals. €48m price tag The wedding and its parts are expected to cost €40m-€48m (£34-£41m), Luca Zaia, the president of Venice's local government, said on Tuesday. This includes sizeable charity donations from the Amazon founder, including €1m (£850k) to Corila, a consortium that studies Venice's lagoon ecosystem, local media has reported.  90 private jets  The first private jets began landing at Venice airport on Tuesday and there will be around 90 in total, Mr Zaia said. \n  They're not all arriving in Venice though, as some have landed at the nearby Treviso and Verona airports. 250 guests  Five of the city's most luxurious hotels have been booked out to host an estimated 200-250 guests.  These include the celeb favourite Cipriani, where George and Amal Clooney married in 2014. 30 water taxis Attendees of course aren't hopping on public water buses to get around the city's many islands.  The wedding's organisers have booked at least 30 water taxis for them to use instead.  In a bid to keep demonstrators away from Thursday's party, the city council banned pedestrians and water traffic from the area surrounding the venue, from 4.30pm local time to midnight.  The couple will exchange their vows on Friday, on the small island of San Giorgio, opposite St Mark's Square. Another party will follow on Saturday - the venue for which was changed at the last-minute earlier this week."
    },
    {
        "title": "Richard Gerald Jordan: Man who was on death row in Mississippi for almost 50 years executed",
        "description": "A man who was on death row in Mississippi for almost 50 years has been executed.",
        "url": "https://news.sky.com/story/richard-gerald-jordan-man-who-was-on-death-row-in-mississippi-for-almost-50-years-executed-13388733",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-richard-gerald-jordan_6950848.jpg?20250626011814",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-26 00:10:00",
        "Headline": "Richard Gerald Jordan kidnapped Edwina Marter and shot her dead in a forest - before demanding a $25,000 ransom from her husband.",
        "Content": "A man who was on death row in Mississippi for almost 50 years has been executed. Richard Gerald Jordan kidnapped and killed Edwina Marter, a stay-at-home mother who was married to a banker, in a violent ransom scheme. The 79-year-old, a Vietnam War veteran who suffered from post-traumatic stress disorder, died by lethal injection at 6.16pm local time (12.16am UK time) on Wednesday. Jordan was the longest-serving man on death row in Mississippi - and had sued the state over its three-drug execution protocol, arguing it was inhumane. When given an opportunity to make a final statement, he said: \"First I would like to thank everyone for a humane way of doing this. I want to apologise to the victim's family.\" Jordan's wife Marsha and his lawyer Krissy Nobile attended the execution, and dabbed their eyes several times as it took place. He thanked them both and asked for forgiveness, and his final words were: \"I will see you on the other side, all of you.\" \n                  Death row inmate in US executed using nitrogen gas after Supreme Court appeal fails\n                 \n                  Death Row prisoner uses final words to swear - before taking 10 minutes to die in nitrogen execution\n                 \n                  Alabama executes man who asked to be put to death - as Texas judge halts another execution\n                 Mrs Marter's husband Charles and her two sons were not present.  This is the third execution to take place in Mississippi over the past 10 years, with the last taking place back in December 2022. A man was also put to death in Florida on Tuesday, meaning this is shaping up to be the year with the most executions since 2015. Back in 1976, Jordan had called the Gulf National Bank. An operator said Charles Marter could take the call. He then hung up and found Mr Marter's home address in the phone book, and kidnapped his wife Edwina. According to court records, he fatally shot her in a forest - and then rang Mr Marter to demand a $25,000 ransom for her safe return. Her son, who was 11 years old at the time of the murder, previously said that the execution \"should have happened a long time ago\". Eric Marter added: \"I'm not really interested in giving him the benefit of the doubt. He needs to be punished.\" Read from US news:Man dies after being struck by lightning on honeymoonPakistan says it will nominate Trump for Nobel Peace Prize  Jordan's lawyer had attempted to argue that a jury never got to hear about his experiences in Vietnam, but her appeal was dismissed by the Supreme Court. A petition had also asked Mississippi governor Tate Reeves for clemency, and said Jordan suffered severe PTSD after serving three back-to-back tours, which could have been a factor in his crime. Franklin Rosenblatt from the National Institute of Military Justice said: \"His war service, his war trauma, was considered not relevant in his murder trial. \"We just know so much more than we did 10 years ago, and certainly during Vietnam, about the effect of war trauma on the brain and how that affects ongoing behaviours.\" But Eric Marter said he disagreed with this argument, adding: \"I know what he did. He wanted money and he couldn't take her with him. And so he did what he did.\""
    },
    {
        "title": "Trade war: UK car exports to US halved in May ahead of truce",
        "description": "The extent of the harm inflicted on UK car exporters from US tariffs has been revealed, with shipments plunging by more than half last month according to industry figures.  ",
        "url": "https://news.sky.com/story/trade-war-uk-car-exports-to-us-halved-in-may-ahead-of-truce-13389007",
        "image_url": "https://e3.365dm.com/22/07/1920x1080/skynews-new-cars-produced-stock_5823914.jpg?20220705070337",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-06-26 13:42:00",
        "Headline": "The struggling industry says there are reasonable hopes for recovery ahead now that US tariffs have been reduced and the government has promised help through its industrial strategy.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The extent of the harm inflicted on UK car exporters from US tariffs has been revealed, with shipments plunging by more than half last month according to industry figures.   The Society of Motor Manufacturers and Traders (SMMT) said the number of UK-made cars heading across the Atlantic fell 55.4% during May following a decline of just under 3% the previous month. The dramatic slowdown marked a reaction to the 25% tariffs imposed on imports by the Trump administration from 3 April amid the president's \"liberation day\" trade war escalation which sparked chaos in global supply chains. The move prompted Jaguar Land Rover - the biggest exporter of cars to the US from these shores - to suspend all shipments temporarily.  The US is the most important market for UK producers, in value terms, and was worth £9bn last year with the vast majority of those sales coming from luxury brands also including Bentley, Rolls-Royce Motor Cars and Aston Martin. Tariffs on UK-made cars imported into the US have since been reduced from 25% to 10% for up to 100,000 vehicles on an annual basis. That was signed off by the president 10 days ago. \n                  VIvergo bioethanol plant to close 'due to UK-US trade agreement'\n                 \n                  Money blog: Pound at near four-year high against dollar - which could be good news for shoppers\n                 \n                  Fresh drive to fix shortfalls in UK's economic statistics\n                 While it spares UK producers from the worst, the US trade war does not represent the only challenge.  The industry has been crying out for help to bolster its competitiveness and increase demand for new electric vehicles amid lacklustre interest, not just at home, but abroad too. It has welcomed promised help with punitive energy costs through the government's industrial strategy. Wider SMMT figures showed car and commercial vehicle production fell for the fifth consecutive month in May. It reported a 33% decline to just 49,810 vehicles and said it was the worst performance for May, when the COVID years were excluded, since 1949. The industry body blamed continuing model changeovers, along with the impact of US tariffs. The number of vehicles produced for the domestic market fell while shipments to the EU, which generally accounts for the biggest share of volumes, was down by 22.5%. Read more:Industrial strategy targets short-term pain for long-term gain Mike Hawes, the SMMT's chief executive, said: \"While 2025 has proved to be an incredibly challenging year for UK automotive production, there is the beginning of some optimism for the future. \"Confirmed trade deals with crucial markets, especially the US and a more positive relationship with the EU, as well as government strategies on industry and trade that recognise the critical role the sector plays in driving economic growth, should help recovery. \"With rapid implementation, particularly on the energy costs constraining our competitiveness, the UK can deliver the jobs, growth and decarbonisation that is desperately needed.\""
    },
    {
        "title": "VIvergo bioethanol plant to close 'due to UK-US trade agreement'",
        "description": "Despite \"extensive\" negotiations with the government, the UK's largest bioethanol plant is to close due to the UK-US trade agreement, according to the firm that owns it.",
        "url": "https://news.sky.com/story/vivergo-bioethanol-plant-to-close-due-to-uk-us-trade-agreement-13388772",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vivergo-bioethanol_6950889.jpg?20250626072546",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-06-26 05:54:00",
        "Headline": "The UK's largest bioethanol plant, employing around more than 160 people, has been explicit that it is the trade agreement and uncertainty over the outcome of government negotiations that has led to the closure.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Despite \"extensive\" negotiations with the government, the UK's largest bioethanol plant is to close due to the UK-US trade agreement, according to the firm that owns it. Consultations have begun with the more than 160 employees at Vivergo's Hull site, with all manufacturing to cease before 13 September if no funding is agreed with government, the business said. Money blog: Top chef on overrated trend he doesn't get The wind-down of the factory is attributed to the recent agreement between the US and UK, which allowed for tariff-free US ethanol to enter the UK. The agreement \"undermined\" the commercial viability of Vivergo, Primark's parent company Associated British Foods (ABF) said regarding its bioethanol business. \"The situation has been made significantly worse by the UK's trade deal with the US\", it said.  Unless the UK funds the company's short-term losses and comes up with a longer-term solution, Vivergo will shut after the staff consultation and its contractual obligations are met. \n                  US-China trade talks: The fact neither side is saying much on the outcome says a lot\n                 \n                  Diplomatic win for UK hosting US-China trade talks\n                 \n                  White House officials to meet Chinese delegation in London for next round of trade talks\n                 'Uncertain' talks The government committed to formal negotiations on a sustainable solution, ABF said in a regulatory update, but the outcome is uncertain. As a result of that uncertainty, consulting staff on \"an orderly wind down\" is taking place at the same time. \"Extensive\" discussions had already been under way with government in an effort to find a \"financial and regulatory solution\" so Vivergo can operate on a \"profitable and sustainable basis\". It had set a deadline of Wednesday for that solution to be delivered, the update said. Bioethanol is a renewable fuel made from plants. Vivergo manufactures the fuel from wheat. In return for the UK agreeing to allow American ethanol to enter tariff-free, the US said it would reduce tariffs on imports of UK cars and steel. In response to the news, a government spokesperson said: \"We recognise this is a concerning time for workers and their families and it is disappointing to see this announcement after we entered into negotiations with the company on financial support yesterday. \"We will continue to take proactive steps to address the long-standing challenges the company faces and remain committed to working closely with them throughout this period to present a plan for a way forward that protects supply chains, jobs and livelihoods.\""
    },
    {
        "title": "Fresh drive to fix shortfalls in UK's economic statistics",
        "description": "Ten million pounds is to be spent on fixing shortfalls in the core numbers produced by the Office for National Statistics (ONS) amid a continuing lack of confidence in their accuracy.",
        "url": "https://news.sky.com/story/ons-secures-extra-cash-to-restore-confidence-in-uks-economic-statistics-13389050",
        "image_url": "https://e3.365dm.com/23/06/1920x1080/skynews-unemployment-economy_6185783.jpg?20230613085927",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-06-26 15:21:00",
        "Headline": "The Bank of England, which needs accurate readings for its rate-setting committee to make informed judgements, is among institutions to have expressed frustration with the ONS numbers since the COVID pandemic.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Ten million pounds is to be spent on fixing shortfalls in the core numbers produced by the Office for National Statistics (ONS) amid a continuing lack of confidence in their accuracy. The body is tasked with producing official figures covering key areas of the economy and societal trends. It has faced particular criticism over the quality of its Labour Force Survey (LFS) - used to calculate employment figures. Money latest: Pound nears four-year high versus dollar The Bank of England, which needs accurate readings for its rate-setting committee to make informed judgements, is among institutions to have expressed frustration with the numbers since the COVID pandemic. The problems at the ONS are not all financial. The Newport-based body's challenges include poor participation rates in areas such as the LFS. \n                  Rayner refuses to repeat chancellor's pledge on tax hikes\n                 \n                  'Inflation and customer cutbacks' blamed for big dive in retail sales\n                 \n                  Bank of England holds rate but eyes cuts ahead despite global risks\n                 It hopes to have made improvements by spring next year. That will be of little comfort to the Bank, which needs to know how much inflationary pressure is lingering in the jobs market, through things like wage growth, as it sets interest rates. The ONS confirmed that plans were being enacted to \"urgently\" improve the quality of its work in two areas - that covering the economy and population, and the other its household and business data. The extra cash, to be spent over two years, is to fund the recruitment of up to 150 more data specialists, it said in a statement. The ONS also said that the UK Statistics Authority and Cabinet Office had agreed with a recommendation to temporarily separate the role of national statistician from that of ONS permanent secretary. This was in order to provide a greater focus on improving the quality of its core statistics. Read more from Sky News:British plant reveals closure plan due to 'US-UK trade deal'Trade strategy aims to better protect UK firms The ONS did not rule out revisions to past data in the months ahead. Acting director general for economic statistics, Grant Fitzner, said: \"The ONS's Plan for Economic Statistics aims to restore confidence and improve the quality of our core statistics. \"It is open about where things stand today and where we need to do better - and forms a crucial part of our response to the recent Office for Statistics Regulation review into economic statistics. \"The Survey Improvement and Enhancement Plan does the same for our household and business surveys.\""
    },
    {
        "title": "Mobile signal blackspots to be eliminated on many of the UK's major train routes",
        "description": "Train journeys can be frustrating at the best of times - with passengers having to put up with delays, noisy commuters or a lack of available seats.",
        "url": "https://news.sky.com/story/mobile-signal-blackspots-to-be-eliminated-on-many-of-the-uks-major-train-routes-13388789",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mobile-phone-signal_6950911.jpg?20250626080207",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-26 06:51:00",
        "Headline": "The move, called Project Reach, comes after the Department for Transport signed a deal with Network rail and telecoms companies Neos Networks and Freshwave.",
        "Content": "Train journeys can be frustrating at the best of times - with passengers having to put up with delays, noisy commuters or a lack of available seats. However, train users could soon have one less thing to worry about as mobile signal blackspots - where the internet cuts out and pauses your favourite TV show or game - are set to be eliminated on many of the UK's major train routes by 2028. The move, called Project Reach, comes after the Department for Transport (Dft) signed a deal with Network Rail and telecoms companies Neos Networks and Freshwave. The installation of infrastructure is expected to begin next year and will initially see Neos Networks install 621 miles of ultra-fast fibre optic cable along parts of the East Coast Main Line, West Coast Main Line, Great Western Main Line and Chiltern Main Line. There is an ambition to expand the cabling beyond 3,107 miles in the \"near future\", the DfT said. Freshwave will tackle blackspots in 57 tunnels - covering nearly 31 miles - including the Chipping Sodbury tunnel near Bristol and the Gasworks and Copenhagen tunnels outside King's Cross. As part of the deal, mobile network operators will also invest in new 4G and 5G infrastructure at these 12 railway stations: Birmingham New Street, Bristol Temple Meads, Edinburgh Waverley, Euston, Glasgow Central, King's Cross, Leeds, Liverpool Lime Street, Liverpool Street, Manchester Piccadilly, Paddington and Waterloo. Read more from Sky NewsWeight loss jabs linked to side effectReform 'would win most seats in general election'Families call for maternity services to be investigated The DfT said the agreement \"brings together public and private sector investment and infrastructure\", and is expected to save taxpayers \"around £300m\". Transport Secretary Heidi Alexander said: \"This is a game-changer for passengers up and down the country, and will revolutionise journeys from Paddington to Penzance and Edinburgh to Euston. \"By boosting connectivity and tackling signal blackspots, we are also ensuring a more reliable and efficient service. \"This means better journeys for passengers while supporting our broader plan for change goals of economic growth and digital innovation.\""
    },
    {
        "title": "Miliband shuns £25bn UK-Morocco renewable energy project Xlinks",
        "description": "The government is snubbing a &#163;25bn renewable energy project which promised to import enough solar and wind power from Morocco to meet nearly a tenth of the UK's electricity demand.",
        "url": "https://news.sky.com/story/miliband-shuns-16325bn-uk-morocco-renewable-energy-project-xlinks-13388783",
        "image_url": "https://e3.365dm.com/23/04/1920x1080/skynews-xlinks-power-energy_6109268.jpg?20230403120729",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-26 06:37:00",
        "Headline": "Whitehall sources say the government will emphasise a desire to focus on \"homegrown\" energy in a statement explaining its rejection of the Xlinks project, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The government is snubbing a £25bn renewable energy project which promised to import enough solar and wind power from Morocco to meet nearly a tenth of the UK's electricity demand. Sky News has learnt that Ed Miliband, the energy security and net zero secretary, has decided not to proceed to formal negotiations with Xlinks, a privately owned company, about a 25-year price guarantee agreement. A ministerial statement is expected to be made confirming the decision later on Thursday. Money blog: Top chef on overrated trend he doesn't get  The government's move to snub Xlinks after protracted talks with the company will come as a surprise to energy industry executives given the company's pledge to deliver large quantities of power at a price roughly half of that to be generated by new nuclear power stations. Xlinks, which is chaired by the former Tesco chief executive Sir Dave Lewis, had been seeking to agree a 25-year contract for difference with the Department for Energy Security and Net Zero (DESNZ), which would have guaranteed a price for the power generated by the project. One Whitehall insider said its decision was partly motivated by a desire to focus on \"homegrown\" energy supplies - an assertion queried by industry sources. \n                  Trade war: UK car exports to US halved in May ahead of truce\n                 \n                  VIvergo bioethanol plant to close 'due to UK-US trade agreement'\n                 \n                  Money blog: Pound at near four-year high against dollar - which could be good news for shoppers\n                 Sir Dave told The Sunday Telegraph earlier this year that Xlinks would switch its focus to another country if the UK government did not agree to support the project. The company is now expected to explore other commercial opportunities. Xlinks had not been seeking taxpayer funding for it, and claimed it could help solve the \"intermittency problem\" of variable supply to UK households and businesses. Reducing manufacturers' energy costs was the centrepiece of the government's industrial strategy launched earlier this week. Sources said that market-testing of the financing for Xlinks' construction of a 4,000-kilometre cable between Morocco and the Devon coast had been significantly oversubscribed. Xlinks' investors include Total, the French energy giant, with the company having raised about £100m in development funding so far. The company has said it would be able to deliver energy at £70-£80-per-megawatt hour, significantly lower than that of new nuclear power stations such as the one at Sizewell C in Suffolk to which the government allocated more than £14bn of taxpayers' money earlier this month. It was unclear whether the growing risk of undersea cable sabotage was one of the factors behind the government's decision not to engage further with Xlinks. In an interview with Sky News in 2022, Sir Dave said Xlinks enjoyed low geopolitical risk because of Britain's centuries-old trading relationship with Morocco and the north African country's ambitions of growing the energy sector as a share of its exports. \"The Moroccan government has recognised that exporting green [energy] is a very important part of their economic plan going forward, so they have an export strategy,\" he said at the time. \"The Sahara desert is probably one of the best places in the world to generate renewable energy from... so you have a very long period of generation. \"And if you're capturing that energy and adding some battery storage, you can generate energy to cover a little bit more than 20 hours a day, which makes it a fantastic partner for the UK.\" The former Tesco chief added the quality of modern high-voltage cables meant energy could now be transported \"over very long distances with very, very few losses\". Sir Dave said the technology risks associated with the project were relatively small, citing examples of much longer cable links being planned elsewhere in the world. \"The benefit here is that it's proven technology with a very committed reliable partner with a cost profile... that we will never [be able to] match in the UK,\" he said. A spokesperson for DESNZ said it did not comment on speculation, while Xlinks declined to comment on Thursday."
    },
    {
        "title": "Student visa giant Study Group secures reprieve with new funding",
        "description": "One of the largest sponsors of international students at British universities has landed tens of millions of pounds of new funding from two major investment firms.",
        "url": "https://news.sky.com/story/student-visa-giant-study-group-secures-reprieve-with-new-funding-13388903",
        "image_url": "https://e3.365dm.com/23/05/1920x1080/skynews-university-students_6166734.jpg?20230525083947",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-26 10:19:00",
        "Headline": "The company, which has faced scrutiny over foreign students who go on to claim asylum in Britain, will become majority-owned by ICG and Bain Capital following an injection of capital, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n One of the largest sponsors of international students at British universities has landed tens of millions of pounds of new funding from two major investment firms. Sky News has learnt that Study Group, which was acquired by the French private equity group Ardian in 2019, has sealed a deal which will see it become majority-owned by Intermediate Capital Group (ICG) and Bain Capital. City sources said the two firms were injecting a substantial sum into the company, with Ardian remaining involved as a minority shareholder. The recapitalisation of Study Group comes after a challenging period for the company, amid growing scrutiny over the number of foreign students who go on to claim asylum. Money blog: Top chef on overrated trend he doesn't get It emerged last year that more than 800 students for which it had secured visas in the UK had later claimed asylum. Sources close to Study Group's financial restructuring insisted, however, that its new majority-owners were \"highly optimistic\" about its prospects. \n                  Trade war: UK car exports to US halved in May ahead of truce\n                 \n                  VIvergo bioethanol plant to close 'due to UK-US trade agreement'\n                 \n                  Money blog: Pound at near four-year high against dollar - which could be good news for shoppers\n                 The company is said to have won a number of significant new contracts recently, although details of these were unclear. Responding to an enquiry from Sky News, a spokesperson for ICG said: \"Bain Capital and ICG will increase their existing stake in leading international education provider, Study Group, partnering with existing shareholder, Ardian, who will retain a stake in the business. \"This new investment underpins Bain Capital and ICG's conviction in Study Group's ambitious growth programme and outstanding management team.\" Ardian is said to have injected additional funding into the business on two separate occasions. At the time of its acquisition of Study Group, it said it supported 30,000 students from more than 140 countries every year. The company prepares international students for undergraduate courses at leading English-speaking universities by teaching them academic and language skills. In 2023, it sold its Australian operations to Navitas, a multinational education group. A spokesperson for Ardian has been contacted for comment."
    },
    {
        "title": "'It's invading menus': Top chef on overrated trend he doesn't get - and world's best food city",
        "description": "Every Thursday, our Money blog team interviews chefs from around the UK, hearing about their cheap food hacks and more. This week, we chat to Mike Reid, renowned TV chef and <a href=\"https://www.aussiebeefandlamb.co.uk/aussie-beef-mates/\" target=\"_blank\">\"Aussie Beef Mate\"</a>.",
        "url": "https://news.sky.com/story/its-invading-menus-top-chef-on-overrated-trend-he-doesnt-get-and-worlds-best-food-city-13388770",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mike-reid-chef-tv-aussie-beef-mate_6950866.jpg?20250626063956",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-26 05:44:00",
        "Headline": "A top TV chef shares his controversial opinion, his favourite city in the world for food and his favourite easy recipe in our regular Money blog feature, Cheap Eats.",
        "Content": "Every Thursday, our Money blog team interviews chefs from around the UK, hearing about their cheap food hacks and more. This week, we chat to Mike Reid, renowned TV chef and \"Aussie Beef Mate\". Good food doesn't have to be expensive... tasty food is simply tasty food. Obviously, better ingredients and produce (which would usually mean higher costs) would lend to a better flavour. However, some of the best food I eat is street food, from local markets or vendors. When I was in Singapore last year, I tried one of the cheapest Michelin-starred restaurants in the world, with a pork noodle dish at about the equivalent of £5 for a one star dish. It proves that good food doesn't have to be expensive. Money blog: Follow the latest Michelin-starred food isn't always the tastiest, but... it is definitely a marker of consistency and talent. We are blessed in the UK with a thriving food scene, with so many great chefs, and not all of them are cooking within Michelin restaurants. What I would say with Michelin restaurants is that it is a very good marker for a place to eat where you should be getting great service and great food. It is a guide to help you. I love dining out at Michelin restaurants and have cooked at this level too, but I'm just as happy dining across the great spectrum of restaurants that we are blessed to have. The best chefs I've worked with are... legends such as Michel Roux Jr and Gordon Ramsay. I also had the pleasure of making \"Five Star Chef\" with Michel for Netflix, and that was such an incredible experience of working with him again. His professionalism and talent stand out every day, and I learned so much from him about being on set and the energy and expertise he brings with him. I handle a TV chef cooking me a bad meal by... styling it out - I would never want to publicly embarrass anyone. Food is so subjective, even though it may not be to my taste, the next person who tries it might love it. So I would try my best not to pass comment. Or my other tactic is to focus on a redeeming element, so for example: \"Oh wow, the flavour of that beef is beautiful, or the colour of that sauce is so vibrant.\" What annoys me the most about the industry is... how we have an expectation now of being able to eat most foods all year round - then we actually complain about how it doesn't taste as good. We need to get back to respecting our produce more and understanding the seasons. To enjoy strawberries in summer and not look for them in winter. To get back to eating tomatoes that have been grown and ripened on the vine in the sun, as opposed to in a greenhouse, grown and picked early. It will be so much better for the planet and better for us to enjoy things as nature intended. The biggest mistake I see chefs make is… overcomplicating their dishes. We have such a desire when we are younger and starting out to showcase our skills, to show on each plate what we can do, and this often leads to dishes being overly complicated and too much going on. Sometimes you see 10 elements on a plate when only five are needed to make it really outstanding. Restraint is the mark of confidence and a true belief in the food that they are cooking. I remember so clearly when the penny dropped for me and my food went to another level after this. My chefs were happier, too. The most overrated single food item is… Dubai chocolate. I do not understand why this has swept the world and taken over. It's invading menus in every area, breakfast is now littered with it, inspiring dishes, and dessert menus are overloaded with it too. I think it's overly rich and way too sweet. But that's just my humble opinion! What I think about food influencers is... that love them or hate them, they drive covers to your restaurants, so you need to embrace them. I have worked with and met many - most are lovely people and big foodies who feel fortunate to do what they do. The minority can be a little \"needy\", let's say, but I think when you have a genuine influencer that you know will drive business to your restaurant, you are happy to work with them. I think it's about being selective and choosing the right ones for your audience. Read more Cheap Eats:Restaurant chain top chef dislikesSirloin? No - chef's steak tip'Why our £225 menu is worth it' My controversial food/restaurant opinion is… your meal should be paid for in advance. We are one of the few, if not the only, \"entertainment\" services where you pay after receiving your goods. Think if you go to the movies, theatre or a concert, you pay in advance. Paying after your meal gives some guests the impression that if it wasn't exactly as you wanted, you don't have to pay for anything. You don't get a refund if you don't like a movie? We have already paid for everything, the staff, the ingredients, the building and our costs have been laid out in advance, so I don't see why the experience is different to other industries. It shouldn't be a choice. Of course, if we don't meet your expectations, there needs to be a level of compensation, but at the moment, all the power lies with the guest. The best city in the world to eat is... San Sebastian. From the Michelin-starred restaurants to the incredible pinchos bars - the quality of food is incredible. My favourite restaurant chain is... Sticks and Sushi. Great concept, good quality fish, and I love the sticks too. My sort of chain. My go-to cheap eat at home is... wagyu skirt sandwich For the gravy: Method"
    },
    {
        "title": "Government makes concessions to Labour rebels over welfare reforms",
        "description": "The government has made an offer to rebel Labour MPs over its controversial welfare reforms, Sky News understands.",
        "url": "https://news.sky.com/story/government-to-make-concessions-to-labour-rebels-over-welfare-reforms-sky-news-understands-13388797",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-starmer-labour_6950635.jpg?20250625171042",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-26 20:20:00",
        "Headline": "Sir Keir Starmer has made an offer to rebel MPs in a bid to pass his reforms to the welfare and benefits.",
        "Content": "The government has made an offer to rebel Labour MPs over its controversial welfare reforms, Sky News understands. More than 120 Labour MPs were poised to vote against the Universal Credit and Personal Independence Payment (PIP) Bill on Tuesday. The changes come after a ring-around by cabinet ministers failed to bring rebels on side. The bill was intended to restrict eligibility for the PIP - the main disability payment in England- and limit the sickness-related element of universal credit, to help shave £5bn off the welfare budget by 2030. Politics latest: Government to make offer to rebels 'We have listened' A spokesperson for Downing Street said: \"We have listened to MPs who support the principle of reform but are worried about the pace of change for those already supported by the system. \"This package will preserve the social security system for those who need it by putting it on a sustainable footing, provide dignity for those unable to work, supports those who can and reduce anxiety for those currently in the system. \"Our reforms are underpinned by Labour values and our determination to deliver the change the country voted for last year.\"  Liz Kendall, the welfare secretary, said in a letter to MPs there would be two changes to the bill, including ensuring that all of those currently receiving PIP \"will stay within the current system. \"The new eligibility requirements will be implemented from November 2026 for new claims only,\" Ms Kendall said. \"Secondly, we will adjust the pathway of Universal Credit payment rates to make sure all existing recipients of the UC health element - and any new claimant meeting the severe conditions criteria - have their incomes fully protected in real terms.\" Sky News political editor Beth Rigby was earlier on Thursday told existing PIP claimants will be able to keep their payments, which means 370,000 people will not lose out. This will cost the government at least £1.5bn, according to the Institute for Fiscal Studies. Sky News understands that a senior source has accepted the change, but it will be up to each individual rebel to make a decision on whether to withdraw. Read more:Welfare bill: A humiliating blow for Starmer The source said they think the changes are a \"good package\" with \"generous concessions\". A reasoned amendment signed by 126 Labour MPs argued that disabled people had not been properly consulted and further scrutiny of the changes is needed. If passed, this would have killed the bill. Sky News understands that some senior rebels are willing to accept the concessions - with one saying that \"the concessions will be positively received, and I expect to vote with the government now\". Other MPs who had not wanted to rebel were also expecting to change their votes. However, several Labour MPs on the left of the party have gone public to say they will still oppose the government, including Diane Abbott, Richard Burgon, Nadia Whittome and Brian Leishman. Conservative shadow chancellor Sir Mel Stride said the change would mark a \"screeching U-turn\" - and claimed the changes mark \"another unfunded spending commitment\". Meanwhile, Helen Whately, shadow work and pensions secretary, said: \"This is another humiliating U-turn forced upon Keir Starmer. \"With the sickness benefits bill set to reach £100 billion by 2030 the country needs action. But Labour has lurched from a bad plan to a next-to-nothing plan. \"The latest 'deal' with Labour rebels sounds a lot like a two-tier benefits system, more likely to encourage anyone already on benefits to stay there rather than get into work.\" What is PIP? The biggest shakeup to the system involved changes to PIP - money given to people, including some of whom are in work - who have extra care needs or mobility needs as a result of a disability. People who claim it are awarded points depending on their ability to do certain activities, such as washing and preparing food, and this influences how much they will receive. From November 2026, people would have needed to score a minimum of four points in at least one activity to qualify for the daily living element of PIP - instead of fewer points spread across a range of tasks. This would have impacted existing claimants as well as new ones. The government's concessions are understood to see this change dropped for existing claimants. Universal credit The government intended to freeze the health element of universal credit, claimed by more than two million people, at £97 a week during this parliament, and cut the rate to £50 for new claimants. Again, it's understood the government's concessions mean this change now won't apply to existing claimants."
    },
    {
        "title": "Welfare bill: A humiliating blow for Starmer, and the fallout will be felt way beyond this week",
        "description": "First there was stonewalling, then the private complaints from MPs before a very public outburst that saw an eye-watering 127 MPs tell their prime minister they were going to defy him on a welfare vote.",
        "url": "https://news.sky.com/story/welfare-bill-a-humiliating-blow-for-starmer-and-the-fallout-will-be-felt-way-beyond-this-week-13389181",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-beth-rigby_6915218.jpg?20250513140605",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-26 22:43:00",
        "Headline": "A government with a massive 165-strong working majority, has had an awakening to the importance of parliament as it embarked on a humiliating climbdown after the private warnings of MPs to Downing Street fell on deaf ears.",
        "Content": "\n          Political editor\n              @BethRigby\n First there was stonewalling, then the private complaints from MPs before a very public outburst that saw an eye-watering 127 MPs tell their prime minister they were going to defy him on a welfare vote. Now, the inevitable climbdown has arrived, with Downing Street making a significant offer to rebels last night on their planned cuts to disability benefits. A government with a massive 165-strong working majority, had an awakening on Thursday to the importance of parliament as it embarked on a humiliating climbdown after the private warnings of MPs to Downing Street fell on deaf ears. It's worth taking a beat to reflect on the enormity of this moment. Less than a year ago, the prime minister was walking into No. 10 having won a landslide, with a Labour majority not seen since the Blair era. That he has been forced to retreat by angry foot soldiers so early in this premiership, despite having such a big majority, is simply unprecedented. No government has lost a vote at second reading - this basically the general principles of a bill - since 1986 (Thatcher's shops bill) and that was the only occasion a government with a working majority lost a bill at the second reading in the entire 20th century. It is obviously a humiliating blow to the authority of the prime minister from a parliamentary party that has felt ignored by Downing Street. And while No. 10 has finally moved - and quickly - to try to shut down the rebellion, the fallout is going to be felt long beyond this week. Before we get into the problems for Starmer, I would like to acknowledge the predicament he's in. \n                  Who will take the fall for welfare chaos?\n                 \n                  UK to buy F-35 stealth jets that can carry US nuclear warheads\n                 \n                  Welfare versus warfare - the PM has made his choice but faces the hardest fight of his premiership\n                 Over the past 10 days, I have followed him to the G7 in Canada, where the Iran-Israel crisis, US-UK trade deal and Ukraine war were on the agenda, to Chequers at the weekend as he tried to deal with the US attack on Iran and all the risk it carried, and to the NATO summit this week in the Netherlands. He could be forgiven for being furious with his operation for failing to contain the crisis when all his attention was on grave international matters. He landed back in Westminster from the NATO summit on Wednesday night into a domestic battle that he really didn't need but moved quickly to contain, signing off a plan that had been worked up this week in Downing Street to try to see of this rebellion.  What will the changes be? At the time of writing this, the government is yet to officially announce the climbdown, but I expect it to be significant. I understand the government is offering to keep personal independence payments, the benefits given to those who are disabled, unchanged for existing claimants, rowing back on an initial plan to take it away from hundreds of thousands of people by tightening the criteria for claiming. I also understand the government will drop the cuts to the health element of universal credit for existing claimants, in changes that will cost an estimated £1.5bn - nearly a third of the savings the government has previously earmarked from these changes. One senior parliamentary source told me on Thursday night they thought it was a \"good package\" with \"generous concessions\", but said it was up to individual MPs to decide whether to withdraw their names from the amendment that would have torpedoed the welfare bill. In the coming days, No. 10 will have to make the case to backbenchers and whittle down the rebellion in order to get the welfare bill passed on Tuesday. But it's clear that No. 10 has given MPs a ladder to climb down. But the bigger question is where does it leave the government and its party. There is quiet fury from many MPs I have spoken to, angry at the No. 10 operation and critical of what they see as a \"boy's club\". There has been criticism levelled at the PM's chief of staff Morgan McSweeney, with MPs in seats facing challenge from the left rather than the right frustrated that the whole No. 10 strategy seems to be seeing off Reform, rather than look to the broader Labour base and threats from the Lib Dems or the Greens. There is also much ire reserved for Rachel Reeves - interestingly Liz Kendall is escaping the criticism despite being the architect of the reforms - with MPs, already angry over winter fuel debacle, now in open revolt over the chancellor's decision to force through these cuts ahead of the Spring Statement in March in order to help fill her fiscal black hole. MPs felt talked down to One Labour figure told me on Thursday the growing drumbeat in the party is that Reeves must go. Another MP told me colleagues hated the cabinet ring around to try to persuade them to back down over welfare, saying more MPs ended up adding their names to the list because they felt talked down to. Read more:Rayner refuses to repeat chancellor's tax hikes pledgeNew plans to deport foreign prisoners earlier All of this needs work if the PM has any hope of rebuilding trust between his party and his operation. There is also the problem of what flows from the concessions. The chancellor will have to fund these concessions, and that could mean hard choices elsewhere. Will this mean that the government ends up doing less on reforming the two-child cap, or will it have to find welfare cuts elsewhere? That flows into the third problem. In seeing off this rebellion No. 10 has contained MPs rather than converting them. What the parliamentary party has seen is a government that, when pressed, be it on winter fuel or benefit cuts, will fold. That will only serve to embolden MPs to fight again. In the immediate term, the government will hope it has seen off a potentially catastrophic defeat. But seeing off the growing malaise around the Starmer administration just got a bit harder after this."
    },
    {
        "title": "What will Keir Starmer learn from the Labour welfare chaos?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/electoral-dysfunction/id1613562765' target='_blank'> 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/what-will-keir-starmer-learn-from-the-labour-welfare-chaos-13389008",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-electoral-dysfunction_6862564.png?20250320204606",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-26 13:56:00",
        "Headline": "No subtitle found",
        "Content": " 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 It sounds like concessions are coming for the over 100 Labour MPs who had threatened to rebel over the government's planned welfare cuts. On this episode, Beth Rigby, Ruth Davidson, and Harriet Harman went over the possible options for the Prime Minister. They also talk about what Keir Starmer needs to learn from the chaos of the past few days. Plus, is President Trump the \"daddy\" in his handling of the Israel-Iran conflict, as NATO head Mark Rutte may have suggested? Remember, you can also watch us on YouTube."
    },
    {
        "title": "Who will take the fall for welfare chaos?",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics At Sam And Anne's on your podcast app👈</a>",
        "url": "https://news.sky.com/story/who-will-take-the-fall-for-welfare-chaos-13388769",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250623145702",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-26 05:34:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics At Sam And Anne's on your podcast app👈 Sky News' Sam Coates and Politico's Anne McElvoy serve up their essential guide to the day in British politics. In a statement sent to Sam overnight, the government admits that concessions are on their way after an internal struggle over welfare reforms inside the Labour Party. It seems like meaningful talks are under way. Next Tuesday - the day of a supposed crunch vote on disability cuts that could have seen the government lose a vote - could now be just \"the start\". As Chancellor Rachel Reeves prepares to row back on savings, how much of the £5bn she wanted to save will she forgo? And why does this government always seem to be U-turning?"
    },
    {
        "title": "Welfare concessions are on the table, PM confirms ahead of crunch vote",
        "description": "Concessions on welfare are being discussed with rebel MPs ahead of a crunch vote next week, Sir Keir Starmer has confirmed. ",
        "url": "https://news.sky.com/story/welfare-concessions-are-on-the-table-pm-confirms-ahead-of-crunch-vote-13388878",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-starmer-keir-prime-minister_6933568.jpg?20250603090015",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-26 09:47:00",
        "Headline": "Sir Keir Starmer says discussions are happening with rebel MPs - as several tell Sky News they are \"sticking to their guns\" and want the welfare bill scrapped.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Concessions on welfare are being discussed with rebel MPs ahead of a crunch vote next week, Sir Keir Starmer has confirmed.  The prime minister opened a statement about the NATO summit he has just returned from with a nod to the troubles he is facing at home. Politics Live: PM offers olive branch to Labour rebels ahead of pivotal vote Speaking in the Commons he said all colleagues want to get welfare reform right and \"so do I\". He added: \"We want to see reform implemented with Labour values of fairness. That conversation will continue in the coming days.\" Sir Keir faces a difficult task as several MPs have told Sky News they are \"sticking to their guns\" after frantic calls from cabinet ministers on Wednesday failed to bring them on side. One MP from the 2024 intake said: \"Many are sticking to their guns. It's now become more than welfare. They were too heavy with their calls this week and pressure on back benches.\" Another MP accused Number 10 and the prime minister of showing \"utter contempt\" towards the rebels' concerns and said this \"is only annoying people more\". The Universal Credit and Personal Independence Payment Bill aims to shave £5bn off the welfare budget by 2030.   This includes restricting eligibility for the personal independence payment (pip), the main disability payment in England, and limit the sickness-related element of universal credit. The government's own figures show 250,000 people could be pushed into poverty, including 50,000 children, because of the changes. Ministers say this will be offset by plans to get more people into work, but while lots of MPs agree with that in principle they say it's not clear how this will be achieved. What are the rebels calling for? More than 120 Labour MPs have signed a \"reasoned amendment\" arguing that disabled people have not been properly consulted and further scrutiny of the changes is needed. The government initially stuck to its guns amid the growing disquiet. But while outwardly confident, Sky News learnt that cabinet ministers were ringing MPs asking them to take their name off the amendment and warning of a potential leadership contest or general election if the government loses the vote on Tuesday.  What concessions could be reached? Ministers have since hinted at attempts to reach a compromise, but it's not clear what sort of concessions would satisfy the bills' critics. Sky News understands there has been discussions about watering down the changes to pip. Under current plans, people will need to score a minimum of four points in at least one activity to qualify for the daily living element instead of fewer points spread across a range of tasks, as is currently the case. Ministers have discussed lowering the new criteria to three points, but one MP told Sky News this is \"still unacceptable\" as it would not greatly reduce the number of people set to lose out. Read More:Reform would win most seats in general election, poll suggests Another MP said they had not heard anything concrete on concessions yet, but added: \"Frankly, personally, this has been so badly mishandled that short of pulling the bill and bringing it back later in the year following the impact assessment and with amendments, I don't think my position will change going in to Tuesday at this point.\" Timeline for debate 'unbelievable' MPs are also annoyed that if the legislation clears the first hurdle it will then face only a few hours' examination rather than days or weeks in front of a committee tasked with looking at the bill. Lucy Powell, the leader of the House of Commons, has said following the second reading and vote on Tuesday 1 July, the bill's remaining stages will take place in a Commons debate on 9 July. She said the vote next week is for the principles to be considered, with the details to be \"discussed and amended\" at the next stages. This appears to suggest the government is asking MPs to back the bill on Tuesday as a show of agreement on the principle of reform, with a promise that changes could be made later. But it's not clear whether this strategy will work given one of the rebels' main concerns is that the bill is being rushed through. One MP said: \"The new line appears to be we all agree on the principle of reform so back at second reading and amend at remaining stages. \"One single day [for] all other stages of the bill is unbelievable.\""
    },
    {
        "title": "VIvergo bioethanol plant to close 'due to UK-US trade agreement'",
        "description": "Despite \"extensive\" negotiations with the government, the UK's largest bioethanol plant is to close due to the UK-US trade agreement, according to the firm that owns it.",
        "url": "https://news.sky.com/story/vivergo-bioethanol-plant-to-close-due-to-uk-us-trade-agreement-13388772",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vivergo-bioethanol_6950889.jpg?20250626072546",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-06-26 05:54:00",
        "Headline": "The UK's largest bioethanol plant, employing around more than 160 people, has been explicit that it is the trade agreement and uncertainty over the outcome of government negotiations that has led to the closure.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Despite \"extensive\" negotiations with the government, the UK's largest bioethanol plant is to close due to the UK-US trade agreement, according to the firm that owns it. Consultations have begun with the more than 160 employees at Vivergo's Hull site, with all manufacturing to cease before 13 September if no funding is agreed with government, the business said. Money blog: Top chef on overrated trend he doesn't get The wind-down of the factory is attributed to the recent agreement between the US and UK, which allowed for tariff-free US ethanol to enter the UK. The agreement \"undermined\" the commercial viability of Vivergo, Primark's parent company Associated British Foods (ABF) said regarding its bioethanol business. \"The situation has been made significantly worse by the UK's trade deal with the US\", it said.  Unless the UK funds the company's short-term losses and comes up with a longer-term solution, Vivergo will shut after the staff consultation and its contractual obligations are met. \n                  US-China trade talks: The fact neither side is saying much on the outcome says a lot\n                 \n                  Diplomatic win for UK hosting US-China trade talks\n                 \n                  White House officials to meet Chinese delegation in London for next round of trade talks\n                 'Uncertain' talks The government committed to formal negotiations on a sustainable solution, ABF said in a regulatory update, but the outcome is uncertain. As a result of that uncertainty, consulting staff on \"an orderly wind down\" is taking place at the same time. \"Extensive\" discussions had already been under way with government in an effort to find a \"financial and regulatory solution\" so Vivergo can operate on a \"profitable and sustainable basis\". It had set a deadline of Wednesday for that solution to be delivered, the update said. Bioethanol is a renewable fuel made from plants. Vivergo manufactures the fuel from wheat. In return for the UK agreeing to allow American ethanol to enter tariff-free, the US said it would reduce tariffs on imports of UK cars and steel. In response to the news, a government spokesperson said: \"We recognise this is a concerning time for workers and their families and it is disappointing to see this announcement after we entered into negotiations with the company on financial support yesterday. \"We will continue to take proactive steps to address the long-standing challenges the company faces and remain committed to working closely with them throughout this period to present a plan for a way forward that protects supply chains, jobs and livelihoods.\""
    },
    {
        "title": "Brazil calls out world 'preoccupied' by defence, as it prepares to host global climate summit COP30",
        "description": "Brazilian officials have rebuked the push to increase defence spending, as it tries to bring countries together for negotiations on tackling climate change later in the year.",
        "url": "https://news.sky.com/story/brazil-calls-out-world-preoccupied-by-defence-as-it-prepares-to-host-global-climate-summit-cop30-13389174",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-marina-silva-brazil_6951566.jpg?20250626233444",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-06-26 21:48:00",
        "Headline": "While western leaders are distracted by military spending and security concerns, Brazil fears the knock on impact on the climate fight. Minister Marina Silva also vowed this year's COP30 climate summit would be \"different\" from the preceding ones.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Brazilian officials have rebuked the push to increase defence spending, as it tries to bring countries together for negotiations on tackling climate change later in the year. Last year's COP climate conference ended in disappointment after failing to cough up anything like enough money to help countries cope with already rising sea levels, heavier floods and harsher droughts, which are forcing people to migrate. But this week NATO member states broadly agreed to a US demand to boost defence spending to 5% of gross domestic product. Read more: 'Things are getting worse', experts warn Leaders are anxious about military threats from Russia and terrorism, while the number of global conflicts and people killed in them have been rising since the 2000s. Brazil's climate minister Marina Silva, in London to drum up support before Brazil hosts COP30 in November, admitted countries are somewhat \"preoccupied\".  \"We have been discussing for so many years, the $100bn, the $300bn, and then now the $1.3 trillion targets that we need [for climate funding],\" she told a news conference on Thursday. And then \"very swiftly, there is an announcement of the increase of 5% in the expenditure in defence\" when that money \"ought to be going in the other direction\", she said via a translator. The money should be used not to fight wars but for \"fighting hunger [and] the climate emergency\", she added. The UK in February raided its foreign aid budget to boost defence spending, prompting warnings it will struggle to keep its £11.6bn climate aid promise. Her comments echo those of Brazilian President Luiz Inácio Lula da Silva, who last week told G7 leaders: \"Year after year, wars and conflicts accumulate. \"Military spending annually consumes the equivalent to Italy's GDP. \"This corresponds to $2.7 trillion that could be invested in hunger eradication and the just transition.\" In Ukraine, \"only dialogue between the parties can lead to a ceasefire and pave the way for lasting peace\", he said. The fears about the world becoming more dangerous and fractured are set to make beleaguered climate talks even more challenging. Governments are already failing to ditch fossil fuels and are grappling with a surge in power demand, driven by things like AI datacentres and air conditioning. That means emissions of greenhouse gases continue to rise when they should be plummeting - though the rise appears to be tapering off. However minister Silva did say despite the \"geopolitical context\", her team had encountered \"a lot of the support and solidarity and commitment\" to climate negotiations. She also vowed this year's COP would be \"different from the preceding ones\", with a focus on implementing pledges. They also met with King Charles and Prince William while they were in the capital for London Climate Action Week."
    },
    {
        "title": "'Life-changing' drug for teenager who lost mother to genetic condition",
        "description": "A teenager who lost her mother, aunt and uncle to a genetic condition is the first person in Europe to receive a \"life-changing\" drug.",
        "url": "https://news.sky.com/story/life-changing-drug-for-teenager-who-lost-mother-to-genetic-condition-13388976",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-apds-catchpole_6951323.jpg?20250626151639",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-26 12:58:00",
        "Headline": "The new drug called Lleniolisib (Joenja) is a simple tablet taken twice a day and is the first ever targeted treatment for activated PI3-Kinase delta syndrome (APDS), a rare inherited disorder.",
        "Content": "A teenager who lost her mother, aunt and uncle to a genetic condition is the first person in Europe to receive a \"life-changing\" drug. Mary Catchpole, 19, from Great Yarmouth, suffers from a rare inherited disorder called activated PI3-Kinase delta syndrome (APDS), which leaves people with a significantly weakened immune system. The condition was passed down by her mother's side of the family, with her mother Sarah dying aged 42 in 2018, while her aunt Helen died aged 12, her uncle Edward when he was 39 and her grandmother Mary when she was 48. APDS patients are vulnerable to repeated infections, causing them to face a lifetime of antibiotics and immunoglobulin replacement therapy to prevent infections and organ damage, and a bone marrow or stem cell transplant - until now. A new drug called leniolisib (Joenja) is a simple tablet taken twice a day and is the first ever targeted treatment for APDS. Ms Catchpole, who is the first person in Europe to receive the medicine after it was made available on the NHS, said taking the new drug is \"life-changing\" as it means she can leave behind huge amounts of medication. \"I was diagnosed with APDS aged seven and it's had a big effect on my life. I had lots of cannulas when I was younger and lots of hospital trips,\" she said. \n                  Patient's death linked to cyber attack on NHS, hospital trust says\n                 \n                  Areas of England to get extra NHS funding announced\n                 \n                  More Britons than ever struggling to make ends meet, report warns\n                 \"I had a permanent line in the side of my body when I was younger, which they put medicine in regularly at the hospital.\" Ms Catchpole added that she wasn't allowed to do much physical activity, including dancing, which she's \"always loved to do\". \"It has been hard,\" said the teaching assistant, who lives with her father Jimmy, 64, and her brother Joe, 20, who does not have APDS. The condition was identified by Cambridge researchers in 2013, with Ms Catchpole's family playing a key role in its discovery, as her mother and uncle were both patients at Addenbrooke's Hospital and were offered DNA sequencing to find out whether there was a genetic cause for their immunodeficiency. Read more from Sky News:Weight loss jabs linked to potentially fatal side effectGene therapy device could create medicines for rare diseases The researchers found a change in their genes that increased activity of an enzyme called PI3-Kinase delta, meaning this enzyme is effectively \"switched on\" all the time, preventing immune cells from fighting infection. Professor Sergey Nejentsev, from the University of Cambridge, who led the research that discovered APDS, said: \"As soon as we understood the cause of APDS, we immediately realised that certain drugs could be used to inhibit the enzyme that is activated in these patients.\" The new drug works by inhibiting the PI3-Kinase delta enzyme, effectively normalising the immune system of the patient. \"This new drug will make a huge difference to people living with APDS,\" Dr Anita Chandra, consultant immunologist at Addenbrooke's and affiliated assistant professor at the University of Cambridge, said. Ms Catchpole says she can now look to the future with optimism and lead a normal life. \"I really want to become a dance teacher,\" she said. \"I absolutely love my current job as a teaching assistant but I'd also like to go on some adventures as well. I've always felt different so it will be nice to feel like I belong.\" There are between 40 and 50 people in England who are known to have APDS. Experts believe the new APDS drug will work long-term in patients as long as they keep taking it, with researchers looking at the potential for the medicine to work on other, more common immune conditions."
    },
    {
        "title": "Teachers given new guidance in dealing with AI-generated child sexual abuse material",
        "description": "Guidelines on how to deal with AI-generated child sexual abuse material (CSAM) have been issued to 38,000 teachers and staff across the UK.&#160;",
        "url": "https://news.sky.com/story/teachers-given-new-guidance-in-dealing-with-ai-generated-child-sexual-abuse-material-13389136",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-internet-watch-foundation_6716683.jpg?20241015151406",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-26 19:50:00",
        "Headline": "The guidelines suggest that young people creating AI-generated child sexual abuse material may not be aware that what they're doing is illegal.",
        "Content": "\n          Science and Technology reporter\n       Guidelines on how to deal with AI-generated child sexual abuse material (CSAM) have been issued to 38,000 teachers and staff across the UK.  The guidelines are an attempt to help people working with children tackle the \"highly disturbing\" rise in AI-generated CSAM. They have been issued by the National Crime Agency (NCA) and the Internet Watch Foundation (IWF). The AI-generated content is illegal in the UK and is treated the same as any other sexual abuse imagery of children, even if the imagery isn't photorealistic. \"The rise in AI-generated child sexual abuse imagery is highly disturbing and it is vital that every arm of society keeps up with the latest online threats,\" said safeguarding minister Jess Phillips. \"AI-generated child sexual abuse is illegal and we know that sick predators' activities online often lead to them carrying out the most horrific abuse in person. \"We will not allow technology to be weaponised against children and we will not hesitate to go further to protect our children online,\" she said. The guidelines suggest that if young people are using AI to create nude images from each other's pictures - known as nudifying - or creating AI-generating CSAM, they may not be aware that what they're doing is illegal. Nudifying is when a non-explicit picture of someone is edited to make them appear nude and is increasingly common in \"sextortion\" cases - when someone is blackmailed with explicit pictures. \"Where an under-18 is creating AI-CSAM, they may think it is 'just a joke' or 'banter' or do so with the intention of blackmailing or harming another child,\" suggests the guidance. \"They may or may not recognise the illegality or the serious, lasting impact their actions can have on the victim.\" Last year, the NCA surveyed teachers and found that over a quarter weren't aware AI-generated CSAM was illegal, and most weren't sure their students were aware either. More than half of the respondents said guidance was their most urgently needed resource. The IWF has seen an increasing amount of AI-generated CSAM as it scours the internet, processing 380% more reports of the abuse in 2024 than in 2023. \"The creation and distribution of AI-manipulated and fake sexual imagery of a child can have a devastating impact on the victim,\" said Derek Ray-Hill, interim chief executive at the IWF. Read more from Sky News:Major pornography sites to introduce 'robust' age verification for UK usersDoctors using unapproved AI to record patient meetingsMinecraft users targeted by cyber criminals \"It can be used to blackmail and extort young people. There can be no doubt that real harm is inflicted and the capacity to create this type of imagery quickly and easily, even via an app on a phone, is a real cause for concern.\" Multiple paedophiles have been sent to jail for using artificial intelligence to create child sexual abuse images in recent years. Last year, Hugh Nelson was sentenced to 18 years in jail for creating AI-generated CSAM that police officers were able to link back to real children. \"Tackling child sexual abuse is a priority for the NCA and our policing partners, and we will continue to investigate and prosecute individuals who produce, possess, share or search for CSAM, including AI-generated CSAM,\" said Alex Murray, the NCA's director of threat leadership and policing lead for artificial intelligence. In February, the government announced that AI tools designed to generate child sex abuse material would be made illegal under \"world-leading\" legislation. In the meantime, however, campaigners called for guidance to be issued to teachers. Laura Bates, the author of a book on the spread of online misogyny, told MPs earlier this month that deepfake pornography \"would be the next big sexual violence epidemic facing schools, and people don't even know it is going on.\" \"It shouldn't be the case that a 12-year-old boy can easily and freely access tools to create these forms of content in the first place,\" she said."
    },
    {
        "title": "Major pornography sites to introduce 'robust' age verification for UK users",
        "description": "Major pornography sites including Pornhub and Redtube will introduce \"highly effective age checks\" from the 25 July in the UK for the first time.",
        "url": "https://news.sky.com/story/major-pornography-sites-to-introduce-robust-age-verification-for-uk-users-13388827",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-generic-laptop-keyboard_6951039.jpg?20250626110003",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-26 08:29:00",
        "Headline": "Under the Online Safety Act, age verification and age estimation must be \"highly effective\" at correctly determining whether a user is under 18 for sites hosting harmful content.",
        "Content": "\n          Science and technology reporter\n       Major pornography sites including Pornhub and Redtube will introduce \"highly effective age checks\" from the 25 July in the UK for the first time. New Ofcom rules designed to keep children from seeing harmful content online come into force next month, with \"robust\" age checks a \"cornerstone\" of the regulations, according to the communications regulator. Under the Online Safety Act, age verification and age estimation must be \"highly effective\" at correctly determining whether a user is under 18 for sites hosting harmful content. Highly effective age checks include credit card checks, open banking or facial age estimation. According to new research by the regulator, 8% of eight to 14-year-olds in the UK visited a pornography site in one month with 19% of boys aged 13 and 14 visiting the sites. Around 11% of girls the same age visited pornography sites in one month. As part of the new rules, platforms must also ensure age verification measures don't exclude adults from accessing legal content or compromise their privacy. Ofcom said the other sites that have confirmed they will bring in the new age checks represent a broad range of pornography services accessed in the UK. \"Society has long protected youngsters from products that aren't suitable for them, from alcohol to smoking or gambling. But for too long children have been only a click away from harmful pornography online,\" said Oliver Griffiths, Ofcom's group director of online safety. \"Now, change is happening. These age checks will bring pornography into line with how we treat adult services in the real world, without compromising access and privacy for over-18s.\" The Internet Watch Foundation (IWF), the UK authority for finding and removing child sexual abuse imagery from the internet, called the announcement a \"vital step\" and said it welcomes platforms doing \"all they can\" to comply with the new rules. \"Exposure to pornography at an inappropriately early age can normalise harmful sexual behaviours, with the availability of violent pornography by children and young adults increasingly being linked to the growing rates of sexual violence against girls and young women,\" said Derek Ray-Hill, interim chief executive of the IWF. \"It can leave children more vulnerable to grooming and predators - and we must be vigilant.\" Read more from Sky News:Doctors using unapproved AI to record patient meetingsMinecraft users targeted by cyber criminals In France, pornography operators including Pornhub recently \"went dark\" in protest against new age verification rules similar to those required in the UK. \"I can confirm that Aylo has made the difficult decision to suspend access to its user-uploaded platforms in France. We will be using our platforms to directly address the French public tomorrow,\" a spokesperson for Pornhub said on 3 June. \"If Aylo would rather leave France than apply our laws, they are free to do so,\" Clara Chappaz, France's junior minister for artificial intelligence and digital technology, wrote in a post on social media platform X. Sky News has contacted Pornhub and Redtube for comment. Privacy concerns Privacy concerns have long swirled around plans like this, with some worried that data collected by pornography sites could be used to identify them. However, Tony Allen, the chief executive of the Age Check Certification Scheme, which oversees age-checking tools around the world, said those fears have been addressed by the industry. \"That was probably a fair concern five or 10 years ago. But obviously, the industry's response to that is, 'No, we need to come up with a way we can do that in a privacy-preserving way'. And they have,\" he told Sky News. The sites are regulated by the Information Commissioner's Office in the UK and will be held to the same data privacy standards as other businesses. According to the NSPCC, effective age checks can play a \"vital role\" in protecting children. \"Children and young people deserve to navigate the online world safely,\" Rani Govender, policy manager for child safety online at the NSPCC, told Sky News. \"It is time tech companies take responsibility for ensuring children have safe, age-appropriate experiences online, and we welcome the progress that Ofcom are making in this space.\" The dark web However, one legal expert told Sky News the age checks may not address the core problem, and could end up pushing young people to the unregulated dark web. \"I have cases where clients as young as 14 access the dark web,\" said Marcus Johnstone from PCD Solicitors. He specialises in criminal defence representation for people accused of sexual offences. \"In one case, my client, aged 15, accessed the dark web to buy drugs but also then found access to extreme illegal pornography.\"As a society, we must accept that children, although illegal, are having sex at a younger age. In my opinion it will be impossible to stop them viewing porn sites. \"Any teenager with a phone can now watch and read content that is both illegal and heinous, and is unregulated by any company or agency.\"It is the dark web that is the greatest menace to our society and is a gateway to a world of abuse, exploitation and radicalisation. This is where better policing is required.\""
    },
    {
        "title": "Historian blames post-war 'chaos' for Harvard Magna Carta 'copy' confusion",
        "description": "A British historian who discovered a Magna Carta copy was a genuine manuscript has shared his theory on why the document was misidentified.",
        "url": "https://news.sky.com/story/historian-blames-post-war-chaos-for-harvard-magna-carta-copy-confusion-13389041",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-magna-carta-harvard-law-school_6916876.jpg?20250515073310",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-26 15:17:00",
        "Headline": "Harvard Law Library bought a version of the royal charter at auction for just $27.50 in 1946, the equivalent of round $450 (£328) today - which was last month discovered to be the real deal.",
        "Content": "A British historian who discovered a Magna Carta copy was a genuine manuscript has shared his theory on why the document was misidentified. Harvard Law Library bought a version of the royal charter at auction for just $27.50 in 1946, the equivalent of around $450 (£328) today. The vellum document was described as a \"copy made in 1327... somewhat rubbed and damp-stained\" - but two historians last month discovered it was actually a rare original worth millions of pounds. The document was just one of seven versions of Magna Carta to survive from King Edward I's 1300 issue of the charter. Professor David Carpenter, who made the discovery with Professor Nicholas Vincent, believes \"post-war chaos\" is to blame for the confusion. Speaking at a meeting of the Pipe Roll Society at The National Archives in London, he said: \"This was just after the war, there was still a measure of chaos, someone has misread the date on it. \"This is most likely how it happened.\" \n                  Post Office: Police identify seven suspects related to Horizon scandal\n                 \n                  Government makes concessions to Labour rebels over welfare reforms\n                 \n                  'Atrocity not accident': Families of pedestrians killed by drivers running red lights speak out\n                 Following the discovery, Prof Vincent traced the history of the document prior to Harvard buying it. His research suggests that after it was issued by King Edward I to the former parliamentary borough of Appleby, it fell into the hands of a family before being passed to slavery abolitionist Thomas Clarkson. Via his estate, it ended up in the hands of Forster Maynard, a World War One flying ace, who sold it to London book dealers Sweet & Maxwell for £42, which then sold it to Harvard. Read more from Sky News:Double-decker bus crashes into riverWoman arrested over Greece wildfires Prof Carpenter, a medieval historian at King's College London, immediately realised the 'copy' looked a lot like the real Magna Carta when he spotted it in Harvard's online catalogue. \"I immediately sent the image to my colleague Nicholas Vincent asking him 'Is this what I think it is?',\" he said. Speaking at the same meeting, Prof Vincent said: \"I told him immediately, you know what that is!\" Magna Carta was originally established in 1215 under King John and outlined the rights of ordinary people under common law for the first time. It has since formed the basis of constitutions worldwide."
    },
    {
        "title": "Miliband shuns £25bn UK-Morocco renewable energy project Xlinks",
        "description": "The government is snubbing a &#163;25bn renewable energy project which promised to import enough solar and wind power from Morocco to meet nearly a tenth of the UK's electricity demand.",
        "url": "https://news.sky.com/story/miliband-shuns-16325bn-uk-morocco-renewable-energy-project-xlinks-13388783",
        "image_url": "https://e3.365dm.com/23/04/1920x1080/skynews-xlinks-power-energy_6109268.jpg?20230403120729",
        "type": "Technology",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-26 06:37:00",
        "Headline": "Whitehall sources say the government will emphasise a desire to focus on \"homegrown\" energy in a statement explaining its rejection of the Xlinks project, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The government is snubbing a £25bn renewable energy project which promised to import enough solar and wind power from Morocco to meet nearly a tenth of the UK's electricity demand. Sky News has learnt that Ed Miliband, the energy security and net zero secretary, has decided not to proceed to formal negotiations with Xlinks, a privately owned company, about a 25-year price guarantee agreement. A ministerial statement is expected to be made confirming the decision later on Thursday. Money blog: Top chef on overrated trend he doesn't get  The government's move to snub Xlinks after protracted talks with the company will come as a surprise to energy industry executives given the company's pledge to deliver large quantities of power at a price roughly half of that to be generated by new nuclear power stations. Xlinks, which is chaired by the former Tesco chief executive Sir Dave Lewis, had been seeking to agree a 25-year contract for difference with the Department for Energy Security and Net Zero (DESNZ), which would have guaranteed a price for the power generated by the project. One Whitehall insider said its decision was partly motivated by a desire to focus on \"homegrown\" energy supplies - an assertion queried by industry sources. \n                  Trade war: UK car exports to US halved in May ahead of truce\n                 \n                  VIvergo bioethanol plant to close 'due to UK-US trade agreement'\n                 \n                  Money blog: Pound at near four-year high against dollar - which could be good news for shoppers\n                 Sir Dave told The Sunday Telegraph earlier this year that Xlinks would switch its focus to another country if the UK government did not agree to support the project. The company is now expected to explore other commercial opportunities. Xlinks had not been seeking taxpayer funding for it, and claimed it could help solve the \"intermittency problem\" of variable supply to UK households and businesses. Reducing manufacturers' energy costs was the centrepiece of the government's industrial strategy launched earlier this week. Sources said that market-testing of the financing for Xlinks' construction of a 4,000-kilometre cable between Morocco and the Devon coast had been significantly oversubscribed. Xlinks' investors include Total, the French energy giant, with the company having raised about £100m in development funding so far. The company has said it would be able to deliver energy at £70-£80-per-megawatt hour, significantly lower than that of new nuclear power stations such as the one at Sizewell C in Suffolk to which the government allocated more than £14bn of taxpayers' money earlier this month. It was unclear whether the growing risk of undersea cable sabotage was one of the factors behind the government's decision not to engage further with Xlinks. In an interview with Sky News in 2022, Sir Dave said Xlinks enjoyed low geopolitical risk because of Britain's centuries-old trading relationship with Morocco and the north African country's ambitions of growing the energy sector as a share of its exports. \"The Moroccan government has recognised that exporting green [energy] is a very important part of their economic plan going forward, so they have an export strategy,\" he said at the time. \"The Sahara desert is probably one of the best places in the world to generate renewable energy from... so you have a very long period of generation. \"And if you're capturing that energy and adding some battery storage, you can generate energy to cover a little bit more than 20 hours a day, which makes it a fantastic partner for the UK.\" The former Tesco chief added the quality of modern high-voltage cables meant energy could now be transported \"over very long distances with very, very few losses\". Sir Dave said the technology risks associated with the project were relatively small, citing examples of much longer cable links being planned elsewhere in the world. \"The benefit here is that it's proven technology with a very committed reliable partner with a cost profile... that we will never [be able to] match in the UK,\" he said. A spokesperson for DESNZ said it did not comment on speculation, while Xlinks declined to comment on Thursday."
    },
    {
        "title": "How gene therapy device could create personalised medicines for rare diseases",
        "description": "A new portable gene therapy device could allow hospital pharmacies to create personalised medicines on demand, a new study says.",
        "url": "https://news.sky.com/story/how-gene-therapy-device-could-create-personalised-medicines-for-rare-diseases-13388819",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nanospresso-health_6951030.png?20250626104059",
        "type": "Technology",
        "Author": "Megan Harwood-Baynes",
        "Date Published": "2025-06-26 08:27:00",
        "Headline": "Rare diseases affect more than 300 million people worldwide - 36 million in the EU alone - but they are often overlooked due to low patient numbers and the high costs associated with drug development.",
        "Content": "\n          Social affairs and health reporter\n              @megbaynes\n A new portable gene therapy device could allow hospital pharmacies to create personalised medicines on demand, a new study says. Rare diseases affect more than 300 million people worldwide - 36 million in the EU alone - but they are often overlooked due to low patient numbers and the high costs associated with drug development. Most medicines are made in factories and shipped to hospitals, but for rare conditions there often aren't enough patients for companies to justify developing medicines in bulk. But the NANOSPRESSO project could allow pharmacists to create medicines for them on demand, according to a paper published in Frontiers in Science. A pharmacist using the machine would put ingredients (such as genetic material and fats) into a small cartridge, which the device then mixes together in a very precise way. A tiny, targeted medicine can then be injected into the patient. Prof Raymond Schiffelers, who led the project, said there is an \"urgent need\" for a way to make personalised medicines in hospitals and on demand in an affordable way. \"By shifting production to the point of care, NANOSPRESSO could help bring life-changing precision medicines within reach of patients.\" \n                  Post Office: Police identify seven suspects related to Horizon scandal\n                 \n                  Government makes concessions to Labour rebels over welfare reforms\n                 \n                  'Atrocity not accident': Families of pedestrians killed by drivers running red lights speak out\n                 However, NANOSPRESSO faces significant hurdles before it can be seen in a healthcare setting anytime soon. The medicines it creates will need to meet strict safety and quality standards, and regulators will need to decide how they will approve and monitor individualised treatments. Read more:500 families in Oxford call for maternity unit to be investigatedWeight loss jabs linked to potentially fatal side effectNext Bond director announced \"NANOSPRESSO could revolutionise the way we treat rare diseases by bringing personalised medicine to more patients, faster,\" says study author Dr Mariona Estapé Senti. \"The user-friendly, affordable device could let medics treat conditions that conventional approaches can't manage.\" The study cites a historical precedent for pharmacies producing medicines - until the 20th century, pharmacists routinely prepared tailored medicines by hand. They also cite the success of using similar nucleic acid platforms to produce mRNA vaccines during the COVID-19 pandemic, and say that modern advancements in closed-system microfluidics have enabled such breakthroughs such as this."
    },
    {
        "title": "Six killed in China floods as tropical storm threatens further devastation",
        "description": "At least six people have died after floods overwhelmed China's Guizhou province.",
        "url": "https://news.sky.com/story/six-killed-in-china-floods-as-tropical-storm-threatens-further-devastation-13388773",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-china-flood-rongjiang_6950073.jpg?20250625073925",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-26 05:58:00",
        "Headline": "Flooding in the city of Rongjiang in Guizhou province reached a scale that could only happen once in 50 years, meteorologists said.",
        "Content": "At least six people have died after floods overwhelmed China's Guizhou province. The flooding has spread to other southwestern parts of the country, submerging towns and villages, ahead of a tropical depression. Parts of neighbouring Guangxi province are half-submerged, with the township of Meilin worst hit, state media reported on Thursday. Floodwaters peaked at more than 4 metres (13ft) above what was considered safe. Rongjiang and Congjiang in Guizhou province have already seen flooding, but now the wider region is on alert for potential road collapses, landslides and hydro-dam overflows. On Tuesday, at least six people died when Rongjiang - a city of around 300,000 residents where three rivers meet - was hit by a flood on a scale that Chinese meteorologists said could only happen once in 50 years. At one point, the flow rate in the River Liu was more than 80 times the average.  Displaced residents were forced to stay at local hotels, which were also hosting rescue personnel and reconstruction workers, according to Reuters. As deluge-hit areas began to remove silt left behind by the flooding and restore power, water and phone lines - a tropical depression was expected to strike Guangxi on Thursday night. The storm risks a new round of flooding. The tropical depression made landfall on China's island province of Hainan early on Thursday, and later again in Guangdong on the mainland. It brought further rain to a region still suffering after Typhoon Wutip two weeks ago. Read more from Sky News:Ecuador's most-wanted is foundThe truth about US airstrikes on IranEurope needs 'millions of drones' Extreme storms and severe flooding, which meteorologists link to climate change, increasingly pose major challenges for Chinese officials. The storms threaten to overwhelm ageing flood defences, displace millions of people and cause billions of dollars in economic losses. \"Climate change is making extreme weather more frequent and unpredictable,\" said Chen Xiaoguang, a professor at Southwestern University of Finance and Economics in Chengdu, in Sichuan province. \"Rural areas face significant challenges due to limited infrastructure and resources,\" he added."
    },
    {
        "title": "Mobile signal blackspots to be eliminated on many of the UK's major train routes",
        "description": "Train journeys can be frustrating at the best of times - with passengers having to put up with delays, noisy commuters or a lack of available seats.",
        "url": "https://news.sky.com/story/mobile-signal-blackspots-to-be-eliminated-on-many-of-the-uks-major-train-routes-13388789",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mobile-phone-signal_6950911.jpg?20250626080207",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-26 06:51:00",
        "Headline": "The move, called Project Reach, comes after the Department for Transport signed a deal with Network rail and telecoms companies Neos Networks and Freshwave.",
        "Content": "Train journeys can be frustrating at the best of times - with passengers having to put up with delays, noisy commuters or a lack of available seats. However, train users could soon have one less thing to worry about as mobile signal blackspots - where the internet cuts out and pauses your favourite TV show or game - are set to be eliminated on many of the UK's major train routes by 2028. The move, called Project Reach, comes after the Department for Transport (Dft) signed a deal with Network Rail and telecoms companies Neos Networks and Freshwave. The installation of infrastructure is expected to begin next year and will initially see Neos Networks install 621 miles of ultra-fast fibre optic cable along parts of the East Coast Main Line, West Coast Main Line, Great Western Main Line and Chiltern Main Line. There is an ambition to expand the cabling beyond 3,107 miles in the \"near future\", the DfT said. Freshwave will tackle blackspots in 57 tunnels - covering nearly 31 miles - including the Chipping Sodbury tunnel near Bristol and the Gasworks and Copenhagen tunnels outside King's Cross. As part of the deal, mobile network operators will also invest in new 4G and 5G infrastructure at these 12 railway stations: Birmingham New Street, Bristol Temple Meads, Edinburgh Waverley, Euston, Glasgow Central, King's Cross, Leeds, Liverpool Lime Street, Liverpool Street, Manchester Piccadilly, Paddington and Waterloo. Read more from Sky NewsWeight loss jabs linked to side effectReform 'would win most seats in general election'Families call for maternity services to be investigated The DfT said the agreement \"brings together public and private sector investment and infrastructure\", and is expected to save taxpayers \"around £300m\". Transport Secretary Heidi Alexander said: \"This is a game-changer for passengers up and down the country, and will revolutionise journeys from Paddington to Penzance and Edinburgh to Euston. \"By boosting connectivity and tackling signal blackspots, we are also ensuring a more reliable and efficient service. \"This means better journeys for passengers while supporting our broader plan for change goals of economic growth and digital innovation.\""
    },
    {
        "title": "Prosecutors give closing arguments in Sean 'Diddy' Combs trial",
        "description": "Sean \"Diddy\" Combs led a criminal enterprise for two decades, using \"power, violence and fear\" to carry out brutal crimes, believing his \"fame, wealth and power\" put him above the law, a prosecutor has told his trial.",
        "url": "https://news.sky.com/story/prosecutors-give-closing-arguments-in-sean-diddy-combs-trial-13389178",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-diddy-sean-combs_6951274.jpg?20250626141802",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-06-26 22:08:00",
        "Headline": "The prosecution has given its closing argument, following more than six weeks of testimony in the Sean \"Diddy\" Combs trial, with the defence due to wrap up their case on Friday.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Sean \"Diddy\" Combs led a criminal enterprise for two decades, using \"power, violence and fear\" to carry out brutal crimes, believing his \"fame, wealth and power\" put him above the law, a prosecutor has told his trial. Christy Slavik spoke for nearly five hours, as she presented the prosecution's closing arguments after more than six weeks of testimony and 34 witnesses. She began by describing the 55-year-old music mogul, telling the court: \"He's the leader of a criminal enterprise. He doesn't take 'no' for an answer. And now you know about many crimes he committed with members of his enterprise.\" She said charges of sex trafficking and racketeering conspiracy were supported by proof that over two decades, Combs kidnapped one of his employees, committed arson by trying to blow up fellow rapper Kid Cudi's car, engaged in forced labour, bribed a security officer and carried out the \"brutal crimes at the heart of this case.\" Diddy trial: As it happened Ms Slavik said Combs \"again and again forced, threatened and manipulated\" his former girlfriend, Cassie Ventura and an ex-girlfriend who testified under the pseudonym Jane into drugged-up, elaborate sexual performances, dubbed \"freak offs\" or \"hotel\" or \"king nights\". \"The defendant used power, violence and fear to get what he wanted,\" she said. \"He thought that his fame, wealth and power put him above the law.\" Combs is charged with one count of racketeering conspiracy, two charges of sex trafficking, and two charges of transportation to engage in prostitution. He has pleaded not guilty to all charges and has strenuously denied all allegations of sexual abuse. Read more:Everything you need to know about the trialThe rise and fall of Sean 'Diddy' CombsWhat we learned from Cassie's testimony Ms Slavik said Combs used a \"small army\" of employees - his trusted inner circle of staff including bodyguards and assistants - to \"serve his needs,\" covering up his harm to women in the process. Homing in on the racketeering charge against him, she said, while Combs was already \"very powerful\", he became even more so with the support of his business. She said Combs and his inner circle \"committed hundreds of racketeering acts,\" including drug distribution, kidnapping, arson and witness tampering. They listed drugs such as cocaine, meth, ketamine, Oxycodone and MDMA, that Combs's assistants said they procured for him, or that federal agents said they found during raids of his multiple homes. During parts of the evidence, Combs looked dejected, sitting with his head down, and with his chair pushed back from the defence table. At one point, when video footage of Combs appearing to beat Cassie at the InterContinental Hotel was shown to the court, he looked away. Combs has been in a New York jail since his arrest in September last year. If convicted on all counts, he could face a minimum 15-year prison term and could be sentenced to life behind bars. The 12-member jury must be unanimous to convict Combs on any of the counts. Defence lawyers have conceded that Combs was involved in domestic violence but say he committed no federal crimes. They say the women took part in the \"freak offs\" willingly and that there was no racketeering conspiracy because none of his employees agreed to be part of any conspiracy. They say the drugs procured were for his own personal use. But in her closing argument, Ms Slavik said employees repeatedly agreed to commit crimes for Combs, such as delivering him drugs, accompanying him to kidnap his personal assistant, Capricorn Clark, and locking his girlfriend in a hotel room after he stomped on her face. In her conclusion, she said proof of Combs's guilt had been demonstrated, adding: \"Before today, he was able to get away with it due to his money, power and influence, but that stops now… \"It is time to hold him accountable, it is time for justice, and it's time to find him guilty.\" On Friday, Combs's lead attorney Marc Agnifilo will give his closing argument, followed by the government's rebuttal. Judge Arun Subramanian says he will instruct the jury on the law later that day, allowing them to begin deliberating as early as late afternoon. The trial continues."
    },
    {
        "title": "Jeff Bezos's Venice wedding celebrations begin with star-studded party after fresh protests",
        "description": "Jeff Bezos and Lauren Sanchez's star-studded wedding celebrations in Venice have begun, with VIP guests including the Kardashians descending on the Italian city.",
        "url": "https://news.sky.com/story/jeff-bezoss-venice-wedding-celebrations-begin-with-star-studded-party-after-fresh-protests-13389107",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wedding-sanchez-bezos_6951463.jpg?20250626190337",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-26 17:57:00",
        "Headline": "While the couple and their A-list guests were all smiles, some in Venice are not happy about the wedding - with protesters seeing it as an example of the city being gift-wrapped for ultra-rich outsiders.",
        "Content": "Jeff Bezos and Lauren Sanchez's star-studded wedding celebrations in Venice have begun, with VIP guests including the Kardashians descending on the Italian city. The billionaire Amazon founder and his journalist fiancee waved to onlookers as they left a luxury hotel to travel to their pre-wedding reception by water taxi on Thursday evening. Hollywood star Orlando Bloom was seen flashing a peace sign to fans as he left Venice's Gritti Palace Hotel and he was soon followed by TV presenter Oprah Winfrey, who smiled and waved. Kim and Khloe Kardashian travelled to the reception with their mother Kris Jenner - who snapped a picture of the pair on a water taxi - and other notable figures in town for the nuptials include Ivanka Trump and Jared Kushner. Some 200-250 A-list guests from showbusiness, politics and finance are expected to attend the events, with the wedding and its parts estimated to cost €40m-€48m (£34m-£41m). Bezos, his soon-to-be wife and their famous guests have taken over numerous locations in the city, with the couple staying in the luxury Aman hotel, where rooms go for at least €4,000 per night. The first of the weekend's many wedding parties is taking place in the cloisters of Madonna dell'Orto, a medieval church that hosts masterpieces by 16th century painter Tintoretto. While the couple and their A-list guests were all smiles, some in Venice are not happy about the wedding - with protesters seeing it as an example of the city being gift-wrapped for ultra-rich outsiders. Read more: Why are activists protesting the wedding? An activist climbed one of the poles in the main St Mark's Square on Thursday, unfurling a banner which said: \"The 1% ruins the world.\" Elsewhere, a life-size mannequin of Bezos clutching an Amazon box was dropped into one of the city's famous canals. €48m price tag The wedding and its parts are expected to cost €40m-€48m (£34-£41m), Luca Zaia, the president of Venice's local government, said on Tuesday. This includes sizeable charity donations from the Amazon founder, including €1m (£850k) to Corila, a consortium that studies Venice's lagoon ecosystem, local media has reported.  90 private jets  The first private jets began landing at Venice airport on Tuesday and there will be around 90 in total, Mr Zaia said. \n  They're not all arriving in Venice though, as some have landed at the nearby Treviso and Verona airports. 250 guests  Five of the city's most luxurious hotels have been booked out to host an estimated 200-250 guests.  These include the celeb favourite Cipriani, where George and Amal Clooney married in 2014. 30 water taxis Attendees of course aren't hopping on public water buses to get around the city's many islands.  The wedding's organisers have booked at least 30 water taxis for them to use instead.  In a bid to keep demonstrators away from Thursday's party, the city council banned pedestrians and water traffic from the area surrounding the venue, from 4.30pm local time to midnight.  The couple will exchange their vows on Friday, on the small island of San Giorgio, opposite St Mark's Square. Another party will follow on Saturday - the venue for which was changed at the last-minute earlier this week."
    },
    {
        "title": "Brad Pitt's Los Angeles home broken into",
        "description": "Brad Pitt's home in Los Angeles was broken into on Wednesday, two law enforcement sources have told Sky News' US partner, NBC News.",
        "url": "https://news.sky.com/story/brad-pitts-los-angeles-home-broken-into-13389149",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-pitt-brad_6951524.jpg?20250626212608",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-26 20:21:00",
        "Headline": "The Hollywood star wasn't at home when the alleged burglary took place on Wednesday night, two law enforcement sources have told Sky News' US partner, NBC News.",
        "Content": "Brad Pitt's home in Los Angeles was broken into on Wednesday, two law enforcement sources have told Sky News' US partner, NBC News. The actor was not in when the alleged break-in occurred, the sources said. Los Angeles Police Department (LAPD) is investigating a reported burglary. An LAPD spokesman confirmed a break-in at a residence in the Los Feliz area of Los Angeles at 10.30pm on Wednesday. However, the spokesman did not identify who lived at the property or who owned it. An unknown amount of property was allegedly stolen by the thieves, the value of which has not been disclosed. Read more from Sky News:Two Met Police officers sacked over strip search of schoolgirlWeight loss and diabetes jabs linked to potentially fatal side effect Police were looking for three suspects who climbed over a front fence and broke in through the home's front window, the sources said. Pitt, 61, was in London on Monday for the European premiere of his new film, F1: The Movie. Directed and co-written by Top Gun: Maverick filmmaker Joseph Kosinski, F1 was partly filmed during Formula One Grand Prix weekends, with scenes shot on the circuits during breaks and real drivers also appearing on screen."
    },
    {
        "title": "Dame Anna Wintour steps back as American Vogue editor-in-chief after 37 years",
        "description": "Dame Anna Wintour is stepping down as American Vogue editor-in-chief after 37 years.",
        "url": "https://news.sky.com/story/dame-anna-wintour-steps-back-as-vogue-editor-in-chief-after-37-years-13389141",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wintour-met_6951520.jpg?20250626212038",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-26 20:08:00",
        "Headline": "Dame Anna transformed American Vogue after landing the top job in 1988, following a three-year stint editing the British version - but is stepping aside so she can \"help the next generation of editors\". ",
        "Content": "Dame Anna Wintour is stepping down as American Vogue editor-in-chief after 37 years. The British-born editor broke the news to the magazine's staff at a meeting on Thursday, announcing that a new role, head of editorial content, would be introduced. The longtime Vogue powerhouse isn't leaving the publication entirely, though. She will remain global editorial director of Vogue and chief content officer for its publishing house, Conde Nast. Whoever lands the role of head of editorial content will report directly to Dame Anna, who will continue to oversee all of Conde Nast's brands, including Vanity Fair and GQ, except for The New Yorker. According to Vogue, Dame Anna told staff at Thursday's meeting she wanted to \"help the next generation of editors storm the field with their own ideas\". \"Anybody in a creative field knows how essential it is never to stop growing in one's work,\" she said. \"When I became the editor of Vogue, I was eager to prove to all who might listen that there was a new, exciting way to imagine an American fashion magazine. \"Now, I find that my greatest pleasure is helping the next generation of impassioned editors storm the field with their own ideas, supported by a new, exciting view of what a major media company can be.\" Read more:Bezos wedding celebrations start in VeniceDirector picked for next Bond film As well as editing US Vogue, Dame Anna has run the annual Met Gala since 1995, raising more than $300m (£220m) for the fashion wing of the Metropolitan Museum of Art. She landed the top job at American Vogue in 1988 following a three-year stint editing the British version. In her 37 years at the magazine, she transformed the title by featuring celebrities on the cover and mixing high fashion with more affordable street style. She was given a Damehood for her services to fashion earlier this year. Following the investiture ceremony at Buckingham Palace, Dame Anna said she did not intend to retire anytime soon. She said: \"The last time I was here, the Queen gave me a medal and we both agreed that we had been doing our job a very long time, and then this morning His Majesty asked me if this meant I was going to stop working, and I said firmly, no.\""
    },
    {
        "title": "Denis Villeneuve: Director of next James Bond film announced  - and says he's a 'diehard 007 fan'",
        "description": "The director of the next James Bond film has been announced. ",
        "url": "https://news.sky.com/story/denis-villeneuve-director-of-next-james-bond-film-announced-and-says-hes-a-diehard-007-fan-13388737",
        "image_url": "https://e3.365dm.com/21/09/1920x1080/skynews-premiere-red-carpet_5528472.jpg?20250626033029",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-26 01:41:00",
        "Headline": "Denis Villeneuve's appointment comes as the British spy franchise experiences a major overhaul - with Daniel Craig's successor yet to emerge.",
        "Content": "The director of the next James Bond film has been announced.  Denis Villeneuve - a four-time Academy Award nominee who earned critical acclaim for the Dune Franchise and Blade Runner 2049 - said the role is a \"massive responsibility\". The Canadian filmmaker described himself as a \"diehard\" fan since childhood, adding that it is a \"huge honour\" to come on board. \"Some of my earliest movie-going memories are connected to 007. I grew up watching James Bond films with my father, ever since Dr No with Sean Connery,\" Villeneuve said. Reassuring fans, the director continued: \"To me, he's sacred territory. I intend to honour the tradition and open the path for many new missions to come.\" His appointment comes as the British spy franchise experiences a major overhaul, with Barbara Broccoli and Michael G Wilson handing over creative control to Amazon MGM Studios. The Broccoli family have long been the force behind the Bond films, and now co-own the intellectual property. \n                  Dune special screening: Director Denis Villeneuve 'needed' the talent of Timothee Chalamet to make sci-fi epic\n                 \n                  Blade Runner director Denis Villeneuve 'must not fear' Dune reboot\n                 Two recently appointed producers - Spider-Man's Amy Pascal and Harry Potter's David Heyman - said securing a director and developing a screenplay were top priorities before deciding who would succeed Daniel Craig in the role. Read more entertainment news:After Amazon takeover, what happens to James Bond?Richard E Grant goes on 'emotional' Gavin And Stacey tour'A gold rush': What's driving the boom in immersive events? The head of Amazon MGM Studios, Mike Hopkins, described Villeneuve as a \"cinematic master whose filmography speaks for itself\". He added: \"Denis has delivered compelling worlds, dynamic visuals, complex characters, and - most importantly - the immersive storytelling that global audiences yearn to experience in theatres. \"James Bond is in the hands of one of today's greatest filmmakers and we cannot wait to get started on 007's next adventure.\""
    },
    {
        "title": "Calls for Scotland-wide seagull summit amid warnings someone could be killed",
        "description": "Politicians have called for a Scotland-wide seagull summit to be held amid warnings someone could be killed.",
        "url": "https://news.sky.com/story/calls-for-scotland-wide-seagull-summit-amid-warnings-someone-could-be-killed-13389093",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-seagull-scotland_6951429.jpg?20250626182148",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-06-26 17:18:00",
        "Headline": "Scots are being left \"scared, attacked and traumatised\", Tory MSP Rachael Hamilton said as she called for a nationwide summit to tackle the issue.",
        "Content": "Politicians have called for a Scotland-wide seagull summit to be held amid warnings someone could be killed. Former Scottish Tory leader Douglas Ross told the nation's parliament during a debate on the issue that people risk losing their lives over the \"growing problem\" of \"nuisance\" gulls. Scots are being left \"scared, attacked and traumatised\", fellow Tory Rachael Hamilton said as she called for a nationwide summit. Ms Hamilton said \"aggressive\" seagulls had attacked seven children in one month last year in Eyemouth, leaving one girl \"with gashes to her scalp and blood running down her face\". Agriculture minister Jim Fairlie had already promised to hold a seagull summit in the north of Scotland, but Ms Hamilton, who represents the south of Scotland, said a summit for the whole nation is necessary. The Ettrick, Roxburgh and Berwickshire MSP called for action on the \"growing nuisance\", which she said posed a health and safety risk to residents. 'Real concern' \n                  Scottish government apologises for 'cultural genocide' of gypsy travellers \n                 \n                  'Rare offering': Entire Scottish island with ruined castle goes on sale for £5.5m\n                 \n                  University of Dundee bosses quit after 'scathing' report into financial crisis\n                 Ms Hamilton said the debate was \"important\" as she criticised what she said was a lack of action from the Scottish government, telling MSPs that \"absolutely nothing\" was getting done. \"Aggressive seagull behaviour continues to cause a real concern amongst businesses, amongst tourists, amongst everybody that has anything to do along the harbour,\" she said about her constituency in Eyemouth. She said one business owner had described the situation as \"people being scared, attacked and traumatised\". 'Extremely serious issue' Mr Ross said during the debate on Thursday, one day before summer recess, that people would often \"smirk\" when hearing that the Scottish parliament was discussing the problems around gulls - but he said it was an \"extremely serious issue\". The Highlands and Islands MSP said constituents have told him they were worried about leaving their homes for fear of being \"divebombed\", while others have suffered mental health issues thanks to a lack of sleep caused by noisy gulls. He accused NatureScot of having a conflict of interest as the body responsible for both the licensing to control birds and to conserve them. He went on: \"The behaviour of the SNP's quango NatureScot confirms they have lost the plot. They have told people to protect themselves with umbrellas and even suggested dogs as a deterrent. \"The time has come to break up NatureScot. There is a clear conflict of interest in the fact they are responsible for considering licences to control gulls but are also responsible for protecting bird numbers.\" He added: \"The strength of the cross-party support in my debate today should be all the SNP government need to finally act before we see someone killed due to being attacked by a gull.\" Read more from Sky News:Two Met Police officers sacked over strip search of girlAmber heat health alert issued for England Jim Fairlie, the minister for agriculture, warned that the issue of gulls was \"deadly serious\", but said that he could not intervene on NatureScot to change the licensing system because it would leave the government open to judicial review. He urged people to stop feeding the birds, which he said was the primary reason for the issue."
    }
]