[
    {
        "title": "US plan to bomb Yemen's Houthis accidentally shared with journalist Jeffrey Goldberg in group chat",
        "description": "An American reporter was accidentally included in a group chat in which senior officials in Donald Trump's government discussed conducting airstrikes on Yemen's Iran-backed Houthis earlier this month.",
        "url": "https://news.sky.com/story/us-plan-to-bomb-yemens-houthis-accidentally-shared-with-american-journalist-in-group-chat-13335159",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-pete-hegseth_6866218.jpg?20250325011626",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-24 20:00:00",
        "Headline": "In an article titled The Trump Administration Accidentally Texted Me Its War Plans, the editor-in-chief of The Atlantic magazine revealed he \"knew two hours before the first bombs exploded that the attack might be coming\".",
        "Content": " An American reporter was accidentally included in a group chat in which senior officials in Donald Trump's government discussed conducting airstrikes on Yemen's Iran-backed Houthis earlier this month. Jeffrey Goldberg, the editor-in-chief of The Atlantic magazine, was added to a group which included US vice president JD Vance, defence secretary Pete Hegseth, national security adviser Mike Waltz and director of national intelligence Tulsi Gabbard. In an article titled The Trump Administration Accidentally Texted Me Its War Plans, Mr Goldberg revealed he \"knew two hours before the first bombs exploded that the attack might be coming\". He said he had received a connection request on the encrypted messaging service Signal by Mr Waltz on 11 March and was invited to join the \"Houthi PC small group\" two days later. Responding to the report, Mr Trump said \"I know nothing about it\" and called The Atlantic \"not much of a magazine\". He added: \"I don't know anything about it. You're telling me about it for the first time.\" Speaking to reporters as he landed in Hawaii, Mr Hegseth said \"nobody was texting war plans and that's all I have to say about that\". He also claimed Mr Goldberg was \"peddling garbage\". On 15 March, US airstrikes killed at least 53 people in Yemen in retaliation for Houthi threats to begin targeting \"Israeli\" ships after Israel blocked aid entering the Gaza Strip. The daily bombardment has continued for the 10 days since then.  \"Your time is up, and your attacks must stop, starting today,\" Mr Trump said at the time. \"If they don't, hell will rain down upon you like nothing you have ever seen before.\" He said Iran would be held \"fully accountable\" for its proxy's actions, adding: \"And we won't be nice about it!\" When Mr Goldberg initially received a connection request from Mr Waltz, he was sceptical and initially thought \"someone could be masquerading as Waltz in order to somehow entrap me\". By David Blevins, Sky correspondent in Washington DC \"FUBAR\" - that's one congressman's response to the jaw-dropping news that Trump officials discussed war plans in a group chat on the Signal app. It's an old military acronym meaning 'F***ed up beyond recognition\" or \"…beyond repair\". \"Only one word for this: FUBAR,\" said Democrat representative Pat Ryan, an army veteran who sits on the armed services committee. The leak raises huge questions about national security, but legal experts suggest establishing the group on Signal may violate the espionage act. Click here to read the full analysis by David Blevins A spokesperson for the National Security Council said: \"At this time, the message thread that was reported appears to be authentic, and we are reviewing how an inadvertent number was added to the chain. \"The thread is a demonstration of the deep and thoughtful policy coordination between senior officials. The ongoing success of the Houthi operation demonstrates that there were no threats to our service members or our national security.\" Read more:Who are the Houthis? Group included 'active intelligence officer' After he was added to the \"Houthi PC small group\" on 13 March, Mr Goldberg saw a message from Mr Waltz asking the other members to provide a point of contact \"for us to coordinate with over the next couple of days and over the weekend\". In total, 18 people were part of the group, Mr Goldberg said, including Steve Witkoff, Mr Trump's Middle East and Ukraine negotiator, and an \"active intelligence officer\" whose name he did not publish. The next day Mr Waltz texted the group: \"Team, you should have a statement of conclusions with taskings per the Presidents [sic] guidance this morning in your high side inboxes,\" with \"high side\" referring to classified computer systems. \"State and DOD [Department of Defence], we developed suggested notification lists for regional Allies and partners. Joint Staff is sending this am [morning] a more specific sequence of events in the coming days and we will work w DOD to ensure COS [chief of staff], OVP [office of the vice president] and POTUS [president of the United States] are briefed.\" 'I think we are making a mistake', vice president says Mr Trump's vice president Mr Vance, who was at an economic event in Michigan, messaged: \"I think we are making a mistake. \"[Three] percent of US trade runs through the [Suez Canal]. 40 percent of European trade does. There is a real risk that the public doesn't understand this or why it's necessary. The strongest reason to do this is, as POTUS said, to send a message.\" He added: \"I am not sure the president is aware how inconsistent this is with his message on Europe right now. There's a further risk that we see a moderate to severe spike in oil prices. I am willing to support the consensus of the team and keep these concerns to myself. But there is a strong argument for delaying this a month, doing the messaging work on why this matters, seeing where the economy is, etc.\" European 'free-loading' is 'PATHETIC', senior officials say Later in the conversation, Mr Waltz criticised the limited capabilities of European navies, writing: \"Whether it's now or several weeks from now, it will have to be the United States that reopens these shipping lanes. Per the president's request we are working with DOD and State to determine how to compile the cost associated and levy them on the Europeans.\" Mr Vance addressed Mr Trump's defence secretary Mr Hegseth in a message reading: \"If you think we should do it let's go. I just hate bailing Europe out again.\" Mr Hegseth replied: \"VP: I fully share your loathing of European free-loading. It's PATHETIC. But Mike is correct, we are the only ones on the planet (on our side of the ledger) who can do this. Nobody else even close. Question is timing. I feel like now is as good a time as any, given POTUS directive to reopen shipping lanes. I think we should go; but POTUS still retains 24 hours of decision space.\" An account believed to be the deputy White House chief of staff, Stephen Miller, then said: \"As I heard it, the president was clear: green light, but we soon make clear to Egypt and Europe what we expect in return. We also need to figure out how to enforce such a requirement. EG, if Europe doesn't remunerate, then what? If the US successfully restores freedom of navigation at great cost there needs to be some further economic gain extracted in return.\" Messages could 'harm American military and intelligence personnel' The next day, the day of the strikes, Mr Goldberg said he saw messages which \"if they had been read by an adversary of the United States, could conceivably have been used to harm American military and intelligence personnel\". \"I will say a prayer for victory,\" Mr Vance said. Mr Goldberg said after the strikes many of those in the group celebrated with messages including \"good job\" and \"God bless\". When he realised the messages were real Mr Goldberg removed himself from the Signal group and emailed several officials in the group for comment. A spokesperson for Mr Vance replied: \"The Vice President's first priority is always making sure that the President's advisers are adequately briefing him on the substance of their internal deliberations,\" he said. \"Vice President Vance unequivocally supports this administration's foreign policy. The President and the Vice President have had subsequent conversations about this matter and are in complete agreement.\" It comes after Mr Hegseth's office announced a crackdown on leaking sensitive information."
    },
    {
        "title": "Trump officials discussing war plans on messaging app lambasted as 'amateur hour'",
        "description": "\"FUBAR\".",
        "url": "https://news.sky.com/story/trump-officials-discussing-war-plans-on-messaging-app-lambasted-as-amateur-hour-13335205",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-yemen-sanaa_6866024.jpg?20250324192701",
        "type": "Home",
        "Author": "David Blevins, Sky correspondent, in Washington DC",
        "Date Published": "2025-03-24 20:50:00",
        "Headline": "Jeffrey Goldberg, The Atlantic's editor in chief, reports he was accidentally added to an encrypted messaging group. The conversation appeared to include vice president JD Vance, defence secretary Pete Hegseth and national security adviser Mike Waltz.",
        "Content": "By David Blevins, Sky correspondent, in Washington DC   \"FUBAR\". That's one congressman's response to the jaw-dropping news that Trump officials discussed war plans in a group chat on the Signal app. It's an old military acronym meaning 'F***ed up beyond recognition\" or \"…beyond repair\". Jeffrey Goldberg, The Atlantic's editor in chief, reports he was accidentally added to an encrypted messaging group. The conversation appeared to include vice president JD Vance, defence secretary Pete Hegseth and national security adviser Mike Waltz. They were discussing highly sensitive security information relating to an impending attack on Houthi rebels in Yemen. \"I didn't think it could be real,\" writes Goldberg, \"… then the bombs started falling\". \n                  Ukraine war: Russia accused of 'hollow' peace talks as strike injures dozens including children\n                 \n                  US plan to bomb Yemen's Houthis accidentally shared with journalist Jeffrey Goldberg in group chat\n                 \n                  Donald Trump portrait he branded 'purposely distorted' to be taken down\n                 Brian Hughes, spokesman for the National Security Council, confirmed the veracity of the Signal group. \"This appears to be an authentic message chain, and we are reviewing how an inadvertent number was added to the chain,\" he said. \"Only one word for this: FUBAR,\" said Democrat representative Pat Ryan, an army veteran who sits on the armed services committee. 👉 Follow Trump 100 on your podcast app 👈 The leak raises huge questions about national security, but legal experts suggest establishing the group on Signal may violate the espionage act. Remember how often Donald Trump called for Hillary Clinton to be jailed for using a private server for emails when she was US secretary of state?  Old alliances 'abandoned' by White House As if that's not enough, the online conversation appears to shed further light on the Trump administration's abandonment of old alliances. Vance seems to question the president's decision to strike, writing: \"I just hate bailing Europe out again.\" Hegseth replies: \"I fully share your loathing of European free-loading. PATHETIC.\" Read more from Sky News:Trump lashes out over portraitJD Vance's wife leads US team on Greenland visit Trump and his team argue that European countries benefit from US protection of shipping lanes in the Red Sea, a frequent target for attacks. Goldberg's initial scepticism is understandable - with participants using emojis like praying hands, the US flag, a fist and a fire, in a highly sensitive military discussion. \"Amateur hour,\" said Democrat senator Ruben Gallego, a marine veteran."
    },
    {
        "title": "Ukraine war: Russia accused of 'hollow' peace talks as strike injures dozens including children",
        "description": "Russia has been accused of making \"hollow statements about peace\" after launching a missile strike that wounded dozens of people, including children, as it held talks with the US on a proposed ceasefire at sea in the war in Ukraine.",
        "url": "https://news.sky.com/story/ukraine-war-russia-accused-of-hollow-peace-talks-as-strike-injures-dozens-including-children-13335293",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-russia-ukraine_6865776.jpg?20250324142734",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-24 23:56:00",
        "Headline": "As Russia and the US held talks in Saudi Arabia, a missile strike in the northeastern Ukrainian city of Sumy wounded at least 88 people, local officials said.",
        "Content": " Russia has been accused of making \"hollow statements about peace\" after launching a missile strike that wounded dozens of people, including children, as it held talks with the US on a proposed ceasefire at sea in the war in Ukraine. Russian and US officials met in Saudi Arabia on Monday, with Ukrainian and American delegations due to gather in Riyadh on Tuesday. Both Russia and Ukraine have accused the other of undermining efforts to reach a pause in the three-year-old war. There was no immediate word on whether an agreement had been hammered out or progress made in Monday's talks with Russia. A Russian source told the Reuters news agency that a draft joint statement on the talks' outcome has been sent to Moscow and Washington for approval, with the parties aiming to release it on Tuesday, A White House source said the talks have been going \"extremely well\" and a positive announcement is expected soon. The talks were expected to cover energy infrastructure and a potential pause in attacks in the Black Sea to ensure the safety of commercial shipping. In an exchange with reporters at the White House, Donald Trump said territorial lines and the potential for US ownership of the Zaporizhzhia nuclear power plant in southern Ukraine have been part of the talks. Read more:Which key pieces of infrastructure could be part of Ukraine ceasefire deal?How has Trump - the 'dealmaker' - done on foreign policy? As the Russia-US meeting was under way, a Russian missile strike damaged a school and a hospital in the northeastern Ukrainian city of Sumy, wounding at least 88 people, including 17 children, according to the local council. \"Moscow speaks of peace while carrying out brutal strikes on densely populated residential areas in major Ukrainian cities,\" Ukrainian foreign minister Andrii Sybiha said. \"Instead of making hollow statements about peace, Russia must stop bombing our cities and end its war on civilians.\" Sumy is about 18.6 miles from the Russian border and is subject to regular drone and missile strikes by Russia. 👉Listen to The World With Richard Engel And Yalda Hakim on your podcast app👈 Meanwhile, Ukraine's main intelligence agency claims Russia is recruiting unwitting Ukrainian teenagers to carry out terrorist attacks. Russian intelligence agencies are promising children easy money on social media for delivering packages, which are remotely detonated, the Security Service of Ukraine (SBU) said. The SBU said the Russian Federal Security Service used a 15-year-old boy as an \"assassin\" in Kharkiv and killed a teenager in Ivano-Frankivsk, western Ukraine. Sky News cannot independently verify these claims."
    },
    {
        "title": "Officials publish list of 'priority pathogens' posing greatest risk to public health",
        "description": "Health officials have published a new list of viruses and bacteria they say pose the greatest threat to public health.",
        "url": "https://news.sky.com/story/officials-publish-list-of-priority-pathogens-posing-greatest-risk-to-public-health-13335287",
        "image_url": "https://e3.365dm.com/23/05/1920x1080/skynews-covid-coronavirus_6160190.jpg?20230804111849",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-24 23:15:00",
        "Headline": "The UK Health Security Agency says its guide is designed to help scientists and researchers focus their efforts and bolster preparedness for any future pandemic.",
        "Content": "Health officials have published a new list of viruses and bacteria they say pose the greatest threat to public health. The UK Health Security Agency (UKHSA) says its \"priority pathogen\" guide is designed to help scientists and researchers focus their efforts and bolster preparedness for any future pandemic. The list of 24 pathogen families is the first to consider global health threats, as well as threats specific to the UK population, and it is hoped it will speed up the development of vaccines. The viral pathogen families classed as high risk for both epidemics and pandemics include: coronaviridae, which includes COVID-19; orthomyxoviridae, which includes avian influenza; and paramyxoviridae, which causes the Nipah virus. Dr Isabel Oliver, chief scientific officer for UKHSA, said: \"We live at the time of increasing challenges and increasing risks from infectious diseases. \"But at the same time we have got, thanks to scientific advancement, better tools than we've ever had to protect health against these threats.\" \"Having said that there are areas where we still need more or better diagnostics, vaccines and medicines and therapeutics, and this tool has been designed to help inform the work of government research funders, but also our partners in industry and academia who are critical to the development of these tools that we so desperately need.\" Experts assessed the pandemic and epidemic potential of each viral family in order to create the tool, looking at the severity of disease, routes of transmission and previous pandemics among known pathogens in the family. Each group was then given a rating of high, medium or low risk based on the opinions of scientists at UKHSA. Read more from Sky News:What you should know about bird flu in the UKFive years since lockdown: The images we can't forget The tool also includes information on whether the risk is sensitive to climate change, if vaccines are available and if human-to-human transmission is likely, as well as their resistance to drugs like antibiotics. Dr Oliver said: \"We haven't ranked because the situation is constantly evolving, as you can imagine, and one of the things that we do in the UKHSA is undertake surveillance and monitor threats.\" She added: \"This is an important lesson from the COVID-19 pandemic, is that it is really important that we consider the breadth of potential threats to health, and that we continue to monitor the situation and flexibly respond to those. \"So our approach is very much to increase our resilience against all families of concern and to work with partners to advance resilience across all of these.\""
    },
    {
        "title": "Donald Trump portrait he branded 'purposely distorted' to be taken down",
        "description": "A portrait of Donald Trump, which he branded \"truly the worst\", will be taken down, officials have said.",
        "url": "https://news.sky.com/story/truly-the-worst-donald-trump-demands-removal-of-purposefully-distorted-portrait-13335008",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-portrait_6865704.jpg?20250324130743",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-24 12:50:00",
        "Headline": "The painting by British artist Sarah Boardman has been hanging in Colorado's State Capitol. Mr Trump said a portrait by the same artist of former US president Barack Obama was \"wonderful\" but \"the one on me is truly the worst\".",
        "Content": "A portrait of Donald Trump, which he branded \"truly the worst\", will be taken down, officials have said. The US president claimed the portrait by British artist Sarah Boardman, which was hanging in Colorado's State Capitol, was \"purposefully distorted\". Posting on his social media platform Truth Social, he said: \"Nobody likes a bad picture or painting of themselves, but the one in Colorado, in the State Capitol, put up by the Governor, along with all other Presidents, was purposefully distorted to a level that even I, perhaps, have never seen before.\" He said a portrait by the same artist of former US president Barack Obama was \"wonderful\" but \"the one on me is truly the worst\". In Colorado, House Democrats said in a statement that the oil painting that attracted Mr Trump's criticism would be taken down at the request of Republican leaders in the legislature. \"If the GOP (Republican Party) wants to spend time and money on which portrait of Trump hangs in the capitol, then that's up to them,\" the Democrats said. Colorado Republicans raised more than $10,000 (£7,700) through a GoFundMe account to commission the oil painting. \n                  Ukraine war: Russia accused of 'hollow' peace talks as strike injures dozens including children\n                 \n                  Trump officials discussing war plans on messaging app lambasted as 'amateur hour'\n                 \n                  US plan to bomb Yemen's Houthis accidentally shared with journalist Jeffrey Goldberg in group chat\n                 Referring to the artist, whose collection of official portraits also includes one of former president George W. Bush, Mr Trump said \"she must have lost her talent as she got older\". He then added: \"In any event, I would much prefer not having a picture than having this one.\" Mr Trump's portrait by Boardman has been hanging in the State Capitol since 2019. It is unclear what sparked Mr Trump's complaint on Sunday night. The criticism of the painting came on the same day that the Kremlin confirmed Vladimir Putin had gifted to Mr Trump a portrait he commissioned of the US president. Mr Putin gave the painting to Mr Trump's special envoy, Steve Witkoff, in Moscow earlier this month, the Russian president's spokesperson Dmitry Peskov said. Mr Witkoff told former Fox News host Tucker Carlson that Mr Trump \"was clearly touched\" by the portrait, which he described as \"beautiful\". Mr Witkoff met Mr Putin after talks with Russian officials about trying to end the war in Ukraine.  Read more:Trump trade war: Hopes rise for limited escalationWhy does Trump want to take over Greenland? The president, who started his second stint in the White House when he was sworn in on 20 January, had appealed to the \"Radical Left Governor, Jared Polis\" to take it down. The 78-year-old said he was speaking on behalf of \"many people from Colorado\" who were \"angry\" about the picture and wanted it removed.  The president ended his post saying: \"Jared should be ashamed of himself!\" When the portrait was unveiled in 2019, Boardman posted pictures online and said it was a \"great day\". She wrote: \"Please remain respectful - this is about portraiture, not politics.\" The artist's website states: \"Sarah believes that the ultimate challenge is to capture the 'personality, character and soul' of an individual in a two-dimensional format. \"She uses a combination of realism and painterly aspects designed to draw the viewer into piece.\""
    },
    {
        "title": "Airlines threaten Heathrow with legal action",
        "description": "A body representing more than 90 airlines using Heathrow Airport has threatened to take legal action if a settlement over the costs they incurred from Friday's day-long closure is not reached. ",
        "url": "https://news.sky.com/story/airlines-threaten-heathrow-with-legal-action-13335133",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-heathrow-plane_6865974.jpg?20250324184037",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-24 17:18:00",
        "Headline": "An independent inquiry has been called for by the body representing 90 airlines including BA and Virgin Atlantic. ",
        "Content": " A body representing more than 90 airlines using Heathrow Airport has threatened to take legal action if a settlement over the costs they incurred from Friday's day-long closure is not reached.  The chief executive of Heathrow Airline Operators' Committee Nigel Wicking told Sky News he hoped the matter could be \"amicably settled at some point in time\" but said, \"if we don't get good enough recourse and repayment in terms of the costs, then yes, there might be a case for legal action\". \"I would hope not. But in some of these situations that's the only course once you've gone through everything else\", he added. Money blog: Price of a pint is about to hit big milestone Heathrow, Europe's largest airport, was closed from the early hours of Friday morning after a fire at a major electricity substation hit electricity supplies. No planes were allowed to take off or land, causing flight diversions. About 1,300 flights were impacted with roughly 250,000 passengers affected. Some flights resumed on Friday evening but airlines faced difficulties and passengers were disrupted due to airline crew being in different parts of the world. \n                  National Grid boss claims Heathrow had 'enough power' despite shutdown\n                 \n                  Chancellor says Heathrow shutdown shows need for increased resilience in UK critical infrastructure\n                 \n                  Chaos in the skies: 'Nightmare' Heathrow shutdown in numbers\n                 Mr Wicking also called for an independent investigation of what happened and why recovery took so long. \"Airlines have a regulatory duty to take care of their passengers,\" he said. \"But in this particular case, we do feel that it was another party that caused the situation.\" Energy secretary Ed Miliband said he was working with energy regulator Ofgem and commissioned the National Energy System Operator to investigate the fire at the substation incident. 'Appalling' communication The head of the airline group representing companies such as British Airways and Virgin Atlantic was also critical of Heathrow's communication. He said it was \"appalling\" that airlines had to wait until midnight on Friday to confirm terminal two would open on Saturday. The situation was \"not justifiable given the amount of money that has been spent on Heathrow over the years and the fact that it is the most expensive airport in the world\". The hit to airlines Airlines and suppliers alone could face costs of \"at least\" £20m for the day of halted operations, said travel expert Paul Charles, a former Virgin Atlantic communications director and chief executive of travel consultancy The PC Agency. The figure includes an estimate of expenses for passengers, crew accommodation, additional transport, fuel and other costs for the aircraft themselves.  Analysts at investment bank Jefferies said compensation for delays could knock 1% to 3% off profits at BA and Aer Lingus parent company IAG. But the outage could be considered a force majeure event, meaning passengers would not be entitled to compensation, according to the head of the Spanish airlines association Javier Gandara. Heathrow response A spokesperson said: \"This was an unprecedented issue which began with a fire at an off-airport substation, in less than 24 hours the entire airport was rebooted from a standing start and we delivered a full schedule from Saturday onwards. \"There are two reviews into the systems and response both at Heathrow and with the wider grid infrastructure. We will support these and lessons will be learned where needed. \"Every penny we invest in our airport infrastructure is approved by airlines and our regulator. On a project-by-project basis, they oversee and influence how we build and maintain Heathrow.\" Its CEO Thomas Woldbye said in a post on LinkedIn today he was \"proud\" of how the airport responded to the outage. He said: \"So, was I proud of the situation we found ourselves in? Of course not. \"But I am incredibly grateful for, and proud of, what was achieved to get us out of the situation in such a short amount of time by teams of people we all rely on across the entire airport eco-system, but who rarely get the credit they deserve.\" Mr Woldbye previously said a backup transformer failed during the power outage, meaning systems had to be closed in line with safety procedures so power supplies could be restructured from two remaining substations. Transport Secretary Heidi Alexander said the airport took the decision to suspend flights because it needed to reboot systems after switching to a different power supply."
    },
    {
        "title": "Woman who can smell Parkinson's disease describes moment she realised her husband had it",
        "description": "A woman who can smell Parkinson's disease has described the moment she realised her husband had it.",
        "url": "https://news.sky.com/story/woman-who-can-smell-parkinsons-disease-describes-moment-she-realised-her-husband-had-it-13335219",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-joy-milne-les-milne_6866187.jpg?20250324224633",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-24 20:40:00",
        "Headline": "Joy Milne told The UK Tonight With Sarah-Jane Mee about how her rare condition of hyperosmia, an incredibly sensitive sense of smell, helped her sniff out the disease in her late husband, Les.",
        "Content": " A woman who can smell Parkinson's disease has described the moment she realised her husband had it. Joy Milne told Sky's The UK Tonight With Sarah-Jane Mee about how her rare condition of hyperosmia, an incredibly sensitive sense of smell, helped her sniff out the disease in her late husband, Les. She said: \"Well, when you know, you're saying to your husband 'well you're smelling, you're not having enough showers and you're not brushing your teeth enough' and various other things, it doesn't go down well to start off with does it?\" \"We continued like that for a while, and then I thought I've got to stop this, he's not terribly pleased, I'll just have to keep quiet.\" But when Mr Milne was around 29 years old \"there was a definite change, a very distinct change,\" she said. And by the time he was 31 \"his smell had completely changed\" and other things had \"begun to happen\", leading her to think \"maybe he had a brain tumour\". A neurologist eventually diagnosed Mr Milne with Parkinson's. Ms Milne said she later went to a Parkinson's meeting in Perth, Scotland, and noticed \"by the time I left, I could tell you who had Parkinson's, who did and who didn't\". \"Now, there were over 30 people there. And, you know, I was quite able to do that.\" She described her ability to Dr Tilo Kunath from Edinburgh University, who worked with Perdita Barran, professor of mass spectrometry at the University of Manchester, to devise an experiment to test Ms Milne's ability. Professor Barran told Sky News: \"We had to do an experiment to separate the obvious movement symptoms of people with Parkinson's disease from the smell.\" They had people wear T-shirts and then put the T-shirts in bags, which were given to Joy, who \"was 100% correct in smelling the T-shirts and diagnosing from a T-shirt whether someone had Parkinson's or not\". Professor Barran said: \"So that was the first incredible step change, because it actually meant we could diagnose someone from the material that they were wearing, from clothes.\" They now use gauze or Q-tips to collect samples and analyse them using a method called mass spectrometry, which \"weighs molecules and helps us to find out what they are\". The method allows Ms Milne to smell molecules while they are identified by the machine. Professor Barran explained: \"So we split them. Some go to be weighed and some go to Joy's nose. And that allows us to code to find out which of the very complicated mixture of molecules we have on our skin from skin swabs, are to do with the disease, are the ones that smell of it.\" Asked how it feels to walk past someone who might smell like they're carrying the condition and whether it's difficult to carry on walking by, Ms Milne said: \"It is very difficult, but I have signed a non-disclosure because it is unethical. It is and I can't do anything about that.\" Read more from Sky News:Trump lashes out over portraitPM says minister for men 'not the answer' Pressed on whether she finds it a blessing or extremely difficult, she said: \"I think, because it's a genetic thing in the female side of the family, my grandmother did warn me when she trained me, she did warn me not to use [it]. \"She said I would find it very difficult unless I made the decision that I would go ahead and do it. And I have made that choice. I was a nurse, a carer for my mother-in-law and my husband with Parkinson's and really it was the right choice. I think it was the right choice.\""
    },
    {
        "title": "Oscar-winning Palestinian filmmaker detained by Israeli military after being beaten up, say activists",
        "description": "An Oscar-winning Palestinian filmmaker has been held by the Israeli military in the occupied West Bank, according to activists.",
        "url": "https://news.sky.com/story/oscar-winning-palestinian-filmmaker-detained-by-israeli-military-after-being-beaten-up-say-activists-13335246",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-hamdan-ballal-no-other-land_6866157.jpg?20250324220459",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-24 23:20:00",
        "Headline": "The Centre for Jewish Nonviolence said Hamdan Ballal suffered a bleeding head in the assault, and as he was being treated in an ambulance, he and another Palestinian man were detained.",
        "Content": "An Oscar-winning Palestinian filmmaker has been held by the Israeli military in the occupied West Bank, according to activists. Hamdan Ballal had earlier been beaten up by Israeli settlers who were among dozens who attacked the Palestinian village of Susya in the Masafer Yatta area and destroyed property, said the Centre for Jewish Nonviolence. The activist group said Mr Ballal suffered a bleeding head in the assault, and as he was being treated in an ambulance, he and another Palestinian man were detained. \"We don't know where Hamdan is because he was taken away in a blindfold,\" said 28-year-old Josh Kimelman, who was at the scene. 'Masked settlers attack activists with stones' During the incident, around 10-20 masked settlers reportedly attacked Jewish activists with stones and sticks, smashing car windows and slashing tyres. One settler swung his fists at two activists before the pair rushed back to their vehicle, video provided by the Centre for Jewish Nonviolence showed. IDF statement \n                  What happened to the Israel-Hamas ceasefire - and could there be another one?\n                 \n                  Israeli strike hits key Gaza hospital as number of Palestinians killed passes 50,000\n                 \n                  Starmer expresses 'deep concern' about lack of humanitarian aid in Gaza\n                 The Israel Defence Forces (IDF) said in a statement to Sky News that on Monday night \"several terrorists hurled rocks at Israeli citizens, damaging their vehicles near Susya\". The IDF also said a violent confrontation then broke out involving \"mutual rock-hurling between Palestinians and Israelis at the scene\". \"IDF and Israeli Police forces arrived to disperse the confrontation, at this point, several terrorists began hurling rocks at the security forces,\" according to the statement. \"In response, the forces apprehended three Palestinians suspected of hurling rocks at them, as well as an Israeli civilian involved in the violent confrontation. The detainees were taken for further questioning by the Israel police. An Israeli citizen was injured in the incident and was evacuated to receive medical treatment. \"Contrary to claims, no Palestinian was apprehended from inside an ambulance.\" Best documentary Mr Ballal is one of the co-directors of No Other Land which won the best documentary Oscar this year. The film follows Masafer Yatta residents as they struggle to stop Israel's army from demolishing their villages. No Other Land has two Palestinian co-directors, Ballal and Basel Adra, both Masafar Yatta residents, and two Israeli directors, Yuval Abraham and Rachel Szor. Read more from Sky News:What happened to Israel-Hamas ceasefire?West Bank areas 'turning into mini-Gaza' Hundreds of Palestinians have been killed in the West Bank in Israeli military operations during the Gaza war, and there has also been a rise in settler attacks on Palestinians. There has also been a surge in Palestinian attacks on Israelis. Red Cross office damaged Meanwhile, in the southern Gazan city of Rafah, a Red Cross office was damaged by an explosive projectile. The Israeli military said its forces fired at a building belonging to the charity after identifying suspects and sensing a threat. But it admitted it had opened fire due to an incorrect identification. \"The structure's ownership was unknown to the force at the time of the shooting,\" the military added. No one was injured, according to the International Committee of the Red Cross, which said the attack had a direct impact on its ability to operate."
    },
    {
        "title": "Inside the court as sexual assault trial of French actor Gerard Depardieu begins",
        "description": "Gerard Depardieu is more than just a household name in France.",
        "url": "https://news.sky.com/story/inside-the-court-as-sexual-assault-trial-of-french-actor-gerard-depardieu-begins-13335174",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-gerard-depardieu-sex-assault-trial_6865982.jpg?20250324184752",
        "type": "Home",
        "Author": "Sophie Garratt, Europe news editor, in Paris",
        "Date Published": "2025-03-24 18:33:00",
        "Headline": "Around 100 protesters from France's #MeToo movement had come to show their support outside the court for the alleged victims. Inside the court, there was a visible presence of Depardieu's supporters.",
        "Content": "By Sophie Garratt, Europe news editor, in Paris   Gerard Depardieu is more than just a household name in France. The actor has starred in over 200 films - he's the face of French cinema for all generations. As he entered a crowded court on Monday in Paris, dressed all in black, he turned every head in the room. The 76-year-old limped towards the front benches, propping himself up on court furniture along the way. It was the first day of a trial expected to last two or three days. The actor faces charges of sexually assaulting two women on the set of French movie Les Volets Verts (The Green Shutters) in 2021 - allegations he denies. Around 100 protesters from France's #MeToo movement came to show their support outside the court for the alleged victims. Inside the court, there was a visible presence of Depardieu's supporters. Fans of the star took up public seats in the chamber, as well as French A-list actors Vincent Perez and Fanny Ardant, the latter confirming she would testify as a witness for the defence. Throughout the hearing, Depardieu repeatedly faced the alleged victims and looked them in the eyes, nodding during the opening arguments delivered by his lawyers. Electric exchanges There were electric exchanges between the legal teams, as the actor's lawyer Jeremie Assous requested the case be withdrawn due to a lack of evidence and witnesses provided by the prosecution. Read more from Sky News:What Depardieu trial means for #MeToo in FranceGisele Pelicot's son speaks to Sky News The lawyers for the prosecution, in turn, complained that the profile of Depardieu gave him an unfair advantage, criticising the judge for allowing the defence almost two hours for their opening statement. Tempers flared during the hearing, with actress Anouk Grinberg, who had come to show support for the alleged victims, ejected from the chamber for contempt. The trial continues, with Depardieu expected to speak on Tuesday."
    },
    {
        "title": "Airlines threaten Heathrow with legal action",
        "description": "A body representing more than 90 airlines using Heathrow Airport has threatened to take legal action if a settlement over the costs they incurred from Friday's day-long closure is not reached. ",
        "url": "https://news.sky.com/story/airlines-threaten-heathrow-with-legal-action-13335133",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-heathrow-plane_6865974.jpg?20250324184037",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-24 17:18:00",
        "Headline": "An independent inquiry has been called for by the body representing 90 airlines including BA and Virgin Atlantic. ",
        "Content": " A body representing more than 90 airlines using Heathrow Airport has threatened to take legal action if a settlement over the costs they incurred from Friday's day-long closure is not reached.  The chief executive of Heathrow Airline Operators' Committee Nigel Wicking told Sky News he hoped the matter could be \"amicably settled at some point in time\" but said, \"if we don't get good enough recourse and repayment in terms of the costs, then yes, there might be a case for legal action\". \"I would hope not. But in some of these situations that's the only course once you've gone through everything else\", he added. Money blog: Price of a pint is about to hit big milestone Heathrow, Europe's largest airport, was closed from the early hours of Friday morning after a fire at a major electricity substation hit electricity supplies. No planes were allowed to take off or land, causing flight diversions. About 1,300 flights were impacted with roughly 250,000 passengers affected. Some flights resumed on Friday evening but airlines faced difficulties and passengers were disrupted due to airline crew being in different parts of the world. \n                  National Grid boss claims Heathrow had 'enough power' despite shutdown\n                 \n                  Chancellor says Heathrow shutdown shows need for increased resilience in UK critical infrastructure\n                 \n                  Chaos in the skies: 'Nightmare' Heathrow shutdown in numbers\n                 Mr Wicking also called for an independent investigation of what happened and why recovery took so long. \"Airlines have a regulatory duty to take care of their passengers,\" he said. \"But in this particular case, we do feel that it was another party that caused the situation.\" Energy secretary Ed Miliband said he was working with energy regulator Ofgem and commissioned the National Energy System Operator to investigate the fire at the substation incident. 'Appalling' communication The head of the airline group representing companies such as British Airways and Virgin Atlantic was also critical of Heathrow's communication. He said it was \"appalling\" that airlines had to wait until midnight on Friday to confirm terminal two would open on Saturday. The situation was \"not justifiable given the amount of money that has been spent on Heathrow over the years and the fact that it is the most expensive airport in the world\". The hit to airlines Airlines and suppliers alone could face costs of \"at least\" £20m for the day of halted operations, said travel expert Paul Charles, a former Virgin Atlantic communications director and chief executive of travel consultancy The PC Agency. The figure includes an estimate of expenses for passengers, crew accommodation, additional transport, fuel and other costs for the aircraft themselves.  Analysts at investment bank Jefferies said compensation for delays could knock 1% to 3% off profits at BA and Aer Lingus parent company IAG. But the outage could be considered a force majeure event, meaning passengers would not be entitled to compensation, according to the head of the Spanish airlines association Javier Gandara. Heathrow response A spokesperson said: \"This was an unprecedented issue which began with a fire at an off-airport substation, in less than 24 hours the entire airport was rebooted from a standing start and we delivered a full schedule from Saturday onwards. \"There are two reviews into the systems and response both at Heathrow and with the wider grid infrastructure. We will support these and lessons will be learned where needed. \"Every penny we invest in our airport infrastructure is approved by airlines and our regulator. On a project-by-project basis, they oversee and influence how we build and maintain Heathrow.\" Its CEO Thomas Woldbye said in a post on LinkedIn today he was \"proud\" of how the airport responded to the outage. He said: \"So, was I proud of the situation we found ourselves in? Of course not. \"But I am incredibly grateful for, and proud of, what was achieved to get us out of the situation in such a short amount of time by teams of people we all rely on across the entire airport eco-system, but who rarely get the credit they deserve.\" Mr Woldbye previously said a backup transformer failed during the power outage, meaning systems had to be closed in line with safety procedures so power supplies could be restructured from two remaining substations. Transport Secretary Heidi Alexander said the airport took the decision to suspend flights because it needed to reboot systems after switching to a different power supply."
    },
    {
        "title": "Officials publish list of 'priority pathogens' posing greatest risk to public health",
        "description": "Health officials have published a new list of viruses and bacteria they say pose the greatest threat to public health.",
        "url": "https://news.sky.com/story/officials-publish-list-of-priority-pathogens-posing-greatest-risk-to-public-health-13335287",
        "image_url": "https://e3.365dm.com/23/05/1920x1080/skynews-covid-coronavirus_6160190.jpg?20230804111849",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-24 23:15:00",
        "Headline": "The UK Health Security Agency says its guide is designed to help scientists and researchers focus their efforts and bolster preparedness for any future pandemic.",
        "Content": "Health officials have published a new list of viruses and bacteria they say pose the greatest threat to public health. The UK Health Security Agency (UKHSA) says its \"priority pathogen\" guide is designed to help scientists and researchers focus their efforts and bolster preparedness for any future pandemic. The list of 24 pathogen families is the first to consider global health threats, as well as threats specific to the UK population, and it is hoped it will speed up the development of vaccines. The viral pathogen families classed as high risk for both epidemics and pandemics include: coronaviridae, which includes COVID-19; orthomyxoviridae, which includes avian influenza; and paramyxoviridae, which causes the Nipah virus. Dr Isabel Oliver, chief scientific officer for UKHSA, said: \"We live at the time of increasing challenges and increasing risks from infectious diseases. \"But at the same time we have got, thanks to scientific advancement, better tools than we've ever had to protect health against these threats.\" \"Having said that there are areas where we still need more or better diagnostics, vaccines and medicines and therapeutics, and this tool has been designed to help inform the work of government research funders, but also our partners in industry and academia who are critical to the development of these tools that we so desperately need.\" Experts assessed the pandemic and epidemic potential of each viral family in order to create the tool, looking at the severity of disease, routes of transmission and previous pandemics among known pathogens in the family. Each group was then given a rating of high, medium or low risk based on the opinions of scientists at UKHSA. Read more from Sky News:What you should know about bird flu in the UKFive years since lockdown: The images we can't forget The tool also includes information on whether the risk is sensitive to climate change, if vaccines are available and if human-to-human transmission is likely, as well as their resistance to drugs like antibiotics. Dr Oliver said: \"We haven't ranked because the situation is constantly evolving, as you can imagine, and one of the things that we do in the UKHSA is undertake surveillance and monitor threats.\" She added: \"This is an important lesson from the COVID-19 pandemic, is that it is really important that we consider the breadth of potential threats to health, and that we continue to monitor the situation and flexibly respond to those. \"So our approach is very much to increase our resilience against all families of concern and to work with partners to advance resilience across all of these.\""
    },
    {
        "title": "British tourist in hospital seriously injured after Rome explosion",
        "description": "A British tourist has been left seriously injured after a suspected gas explosion destroyed a three-storey B&B in Rome.",
        "url": "https://news.sky.com/story/british-tourist-in-hospital-seriously-injured-after-rome-explosion-13334927",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rome-grant-paterson_6865726.jpg?20250324134912",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-24 11:19:00",
        "Headline": "The Foreign, Commonwealth and Development Office (FCDO) said it is supporting Grant Paterson's family and is in contact with the local authorities.",
        "Content": "A British tourist has been left seriously injured after a suspected gas explosion destroyed a three-storey B&B in Rome. Grant Paterson, 54, from East Kilbride in South Lanarkshire, has reportedly been left severely burned after the explosion in the Monteverde area of the Italian city on Sunday morning. Mr Paterson was pulled out of the ruins by firefighters and is currently undergoing treatment at Sant'Eugenio Hospital. Sky News was told by officials Mr Paterson has suffered third degree burns to at least 70% of his body and is in a critical condition. A witness at the scene said Mr Paterson was screaming under the collapsed building before being saved by the emergency crew. A neighbour reported the explosion made his house windows shake, while another witness thought it had been a bomb or an earthquake. The Foreign, Commonwealth and Development Office (FCDO) said it is supporting Mr Paterson's family and is in contact with the local authorities. It is understood Mr Paterson arrived in Rome on 17 March and was due to return home on Monday. The B&B, named Mamma Roma, was on Via Vitellia in the busy neighbourhood of Monteverde, in the southwest part of Rome. Flying debris from the explosion, which occurred around 8.40am, damaged several cars and part of the wall of Villa Doria Pamphili - a seventeenth-century villa which also serves as the representative seat of the Italian government. More than a dozen people were evacuated and are currently unable to return to their homes. Rome Mayor Roberto Gualtieri told Sky News efforts are being made to find a solution. Rome's Public Prosecutors' Offices has opened a probe into the case. At the moment it is a suspected gas leak. Read more from Sky News:Gisele Pelicot's son relives moment he discovered his father was a monsterTurkey protesters met with tear gas and rubber bullets The mayor earlier visited the scene and told reporters he had ordered a full investigation into the explosion. Mr Gualtieri said: \"The important thing is that fortunately there are no victims, although unfortunately one person was seriously injured. \"Most likely he is a guest of a hospitality facility, of Scottish origin. \"We don't know his exact condition, but he suffered burns, and this also suggests that it was an explosion caused by gas, which also causes flames. \"It was a very loud explosion, a building collapsed and the wall of Villa Pamphili was also damaged.\""
    },
    {
        "title": "Poppy Atkinson: Funeral held for schoolgirl Manchester United fan who died after being struck by car",
        "description": "People in a Cumbrian town have come together to mark the life of Poppy Atkinson, the Manchester United-supporting schoolgirl who died after being struck by a car while playing on a sports pitch.",
        "url": "https://news.sky.com/story/poppy-atkinson-funeral-held-for-schoolgirl-manchester-united-fan-who-died-after-being-struck-by-car-13335012",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-funeral-poppy-atkinson_6865618.jpg?20250324113044",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-24 12:58:00",
        "Headline": "Poppy Atkinson, 10, was in the youth ranks at Kendal United and also played at county level, was \"100% determined to be a professional footballer\", and one day play for Manchester United.",
        "Content": "People in a Cumbrian town have come together to mark the life of Poppy Atkinson, the Manchester United-supporting schoolgirl who died after being struck by a car while playing on a sports pitch. Mourners at the talented young footballer's funeral service were asked to wear red by the 10-year-old's family. They also requested that anyone lining the streets of Kendal, Cumbria, pay their respects by wearing red or football shirts. An artist's impression of the youngster with a football by her side, in a poppy field looking at Old Trafford, had been painted on to one side of the coffin. Poppy's parents, Ben and Clare, and seven-year-old brother Edward, as well as other members of her family, were in the congregation at Kendal Parish Church. Players and officials from local junior football teams, many wearing Manchester United shirts with the number 10 and Poppy on the back were also there. Mourners formed a \"guard of honour\" in the church grounds where earlier four young boys with \"Poppy\" football shirts kicked a ball around. Tributes were read out by her parents, her headteacher at Old Hutton CE Primary School, Nick Turley, and one of her local football coaches, Corey Smith. GT7 Football Academy, where she was being coached, released a message on social media: \"Today we said our final goodbyes to our beloved, Poppy. \"The last few weeks has been full of pain, but with that came smiles, with memories of such a special girl. \"We will never forget you Poppy, your legacy will live on and as you said and did 'Dare to Dream'\". Read more:Heathrow 'had enough power'Bird flu detected in sheepCouncils warned over potholes Classmates from the school's choir sang a pop medley for the congregation in her honour. Hundreds of mourners clapped as the funeral procession made its way through the town centre later. A private burial followed. Following Poppy's death, her family said the schoolgirl, who was in the under-12s team at Kendal United and also played at county level, was \"100% determined to be a professional footballer\", and one day play for Manchester United. Her family said Poppy idolised the team and England players Ella Toone and Kobbie Mainoo, as well as Lioness Georgia Stanway and former Barcelona superstar Lionel Messi \"to name a few\". Police investigating the collision during a football practice session at Kendal Rugby Club earlier this month arrested a 40-year-old man from Lancaster on suspicion of causing death by dangerous driving. He was later released from custody."
    },
    {
        "title": "List of closures as hundreds at risk of redundancy due to Morrisons shutting cafes, meat counters and convenience stores",
        "description": "Roughly 365 jobs could be lost at Morrisons shops across Britain as cafes and in-store services are to close.",
        "url": "https://news.sky.com/story/list-of-closures-as-hundreds-at-risk-of-redundancy-due-to-morrisons-shutting-cafes-meat-counters-and-convenience-stores-13335075",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-morrisons-leeds-supermarket_6645271.jpg?20240802073500",
        "type": "UK",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-03-24 14:48:00",
        "Headline": "Despite closing cafes in areas facing \"specific local challenges\", Morrisons said its remaining sites had a \"bright future\" and it was working with third parties to provide a \"specialist offer\" in some locations.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Roughly 365 jobs could be lost at Morrisons shops across Britain as cafes and in-store services are to close. Those hundreds of roles are at risk of redundancy, the supermarket chain said, as it is to close 52 cafes, all 18 market kitchens food-to-go sites, 17 convenience stores, 13 florists, 35 meat counters, 35 fish counters and four pharmacies. Some staff working at these services will be redeployed elsewhere in the business, Morrisons said. Money blog: Price of a pint is about to hit big milestone Morrisons did not say exactly when these closures were taking place but that the operations would be closed \"over the next few months\". The cuts come as \"costs of operations are significantly out of line with usage, volumes or the value that customers place on them\", the supermarket chain said. Despite shuttering 52 of its cafes, Morrisons said this offering \"has a bright future\" in most locations. In 2021 there were 406 Morrisons cafes. \"A minority have specific local challenges and in those locations, regrettably, closure and re-allocation of the space is the only sensible option\", Morrisons chief executive Rami Baitieh said. Where some cafes are closing, the supermarket said it planned to work with \"third parties to provide a relevant specialist offer\".  List of closures The cafes due to close are: Bradford, ThornburyPaisley, Falside RoadLondon, QueensburyPortsmouthNewcastle, Great ParkBanchory, North Deeside RoadFailsworth, Poplar StreetBlackburn, Railway RoadLeeds, Swinnow RoadLondon, Wood GreenKirkham, Poulton StreetLutterworth, Bitteswell RoadBirmingham, StirchleyLeeds, HorsforthLondon, ErithEast Sussex, CrowboroughBellshill, John StreetDumbarton, Glasgow RoadEast Kilbride, LindsayfieldEast Kilbride, StewartfieldGlasgow, NewlandsLargs, Irvine RoadTroon, Academy StreetWishaw, Kirk RoadNewcastle Upon Tyne, CowgateNorthampton, Kettering RoadBromsgrove, Buntsford Industrial ParkSolihull, Warwick RoadBrecon, Free StreetCaernarfon, North RoadIpswich, HadleighLondon, Hatch EndHigh Wycombe, Temple EndLeighton Buzzard, Lake StreetLondon, StratfordSidcup, Westwood LaneWelwyn Garden City, Black Fan RoadWarminster, Weymouth StreetOxted, Station YardReigate, Bell StreetBorehamwood, Stirling WayWeybridge, Monument HillBathgate, Linkston WayErskine, Bridgewater Shopping CentreGorleston, Blackwell RoadDeeside, Connah's QuayMansfield, Woodhouse CentreHalifax, EllandGloucester, Metz WayWatford, Ascot RoadLittlehampton, WickHelensburgh, Cardross Road Morrisons daily convenience stores being shut are: Gorleston, Lowestoft RoadPeebles, Old TownShenfield, Hutton RoadPoole, Waterloo EstateTonbridge, Higham LaneRomsey, The CornmarketStewarton, Lainshaw StreetSelsdon Featherbed LaneHaxby VillageGreat Barr, Queslett RoadWhickham, Oakfield RoadWeston-super-Mare, WorleGoring-By-Sea, Strand ParadeWoking, Westfield Road Wokingham, Peach StreetExeter, Sidwell StreetBath, Moorland Road The union representing Morrisons workers - the Union of Shop, Distributive and Allied Workers (USDAW) - said it would be supporting its members. Darren Matthews, USDAW National Officer said: \"Our priority is to keep as many employed in the business as possible. \"We welcome Morrisons' early indication that the majority of staff affected by the changes are expected to be deployed to roles elsewhere in the business. \"USDAW is also maintaining regular talks with the company on these proposals where we'll be able to raise concerns, challenge and ask serious questions about the company's business case.\""
    },
    {
        "title": "Major investigation into ongoing gang feud which has seen properties firebombed and shots fired in Edinburgh streets",
        "description": "A major investigation has been launched into an ongoing feud between crime gangs in Edinburgh which has seen properties firebombed and shots fired in the capital's streets.",
        "url": "https://news.sky.com/story/major-investigation-into-ongoing-gang-feud-which-has-seen-properties-firebombed-and-shots-fired-in-edinburgh-streets-13334861",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-musselburgh-fire-storage-warehouse_6865523.jpg?20250324090938",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-03-24 09:01:00",
        "Headline": "Extensive enquiries are taking place into a number of incidents in and around the Scottish capital in recent days. Police Scotland believes the criminal activity is \"linked to groups who are actively targeting each other\".",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A major investigation has been launched into an ongoing feud between crime gangs in Edinburgh which has seen properties firebombed and shots fired in the capital's streets. Police Scotland said a team of detectives, along with specialist and divisional officers, are working to disrupt the criminal activity currently blighting the nation's east coast. A home in Edinburgh's Hay Drive was firebombed during the early hours of Sunday. Police are probing the \"suspicious fire\" along with two shooting incidents in the city. On Thursday, a firearm was discharged at a property in Niddrie Marischal Crescent. The following day a gun was fired at an address in West Pilton Bank. No one was injured in either attack, but police believe both incidents are linked to groups \"who are actively targeting each other\". Earlier this month, a beauty salon in Leith's Albert Street and a storage warehouse in Musselburgh, East Lothian, went up in flames. \n                  Tour de France returning to the UK in 2027\n                 \n                  Mum says 12-year-old son's mental health 'severely impacted' after pornography shared between pupils at Edinburgh school\n                 \n                  Police Scotland investigation under way after girl, 8, targeted in sextortion plot\n                 Sky News understands officers are keeping an open mind as to whether these incidents are linked to the others. Superintendent Paul Gillespie said: \"We understand this will be concerning for local communities, but I want to reassure everyone that we are pursuing those involved and are using every tool and tactic at our disposal. \"From our investigations so far, we believe these are linked to groups who are actively targeting each other.\" Read more from Sky News:Gisele Pelicot's son relives moment he discovered father was a monsterThird teenager charged in connection with boy's death The force said \"significant\" CCTV footage had been collected and, on Saturday, road and vehicle checks across several streets in the Ferry Road, Niddrie and Pennywell areas were carried out. Superintendent Gillespie added: \"We are carrying out additional high-visibility patrols and I would encourage anyone with any concerns to approach these officers. \"We understand the significant impact this has had on the local community. If you know anything that could help, please do the right thing and speak to police.\""
    },
    {
        "title": "Woman who can smell Parkinson's disease describes moment she realised her husband had it",
        "description": "A woman who can smell Parkinson's disease has described the moment she realised her husband had it.",
        "url": "https://news.sky.com/story/woman-who-can-smell-parkinsons-disease-describes-moment-she-realised-her-husband-had-it-13335219",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-joy-milne-les-milne_6866187.jpg?20250324224633",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-24 20:40:00",
        "Headline": "Joy Milne told The UK Tonight With Sarah-Jane Mee about how her rare condition of hyperosmia, an incredibly sensitive sense of smell, helped her sniff out the disease in her late husband, Les.",
        "Content": " A woman who can smell Parkinson's disease has described the moment she realised her husband had it. Joy Milne told Sky's The UK Tonight With Sarah-Jane Mee about how her rare condition of hyperosmia, an incredibly sensitive sense of smell, helped her sniff out the disease in her late husband, Les. She said: \"Well, when you know, you're saying to your husband 'well you're smelling, you're not having enough showers and you're not brushing your teeth enough' and various other things, it doesn't go down well to start off with does it?\" \"We continued like that for a while, and then I thought I've got to stop this, he's not terribly pleased, I'll just have to keep quiet.\" But when Mr Milne was around 29 years old \"there was a definite change, a very distinct change,\" she said. And by the time he was 31 \"his smell had completely changed\" and other things had \"begun to happen\", leading her to think \"maybe he had a brain tumour\". A neurologist eventually diagnosed Mr Milne with Parkinson's. Ms Milne said she later went to a Parkinson's meeting in Perth, Scotland, and noticed \"by the time I left, I could tell you who had Parkinson's, who did and who didn't\". \"Now, there were over 30 people there. And, you know, I was quite able to do that.\" She described her ability to Dr Tilo Kunath from Edinburgh University, who worked with Perdita Barran, professor of mass spectrometry at the University of Manchester, to devise an experiment to test Ms Milne's ability. Professor Barran told Sky News: \"We had to do an experiment to separate the obvious movement symptoms of people with Parkinson's disease from the smell.\" They had people wear T-shirts and then put the T-shirts in bags, which were given to Joy, who \"was 100% correct in smelling the T-shirts and diagnosing from a T-shirt whether someone had Parkinson's or not\". Professor Barran said: \"So that was the first incredible step change, because it actually meant we could diagnose someone from the material that they were wearing, from clothes.\" They now use gauze or Q-tips to collect samples and analyse them using a method called mass spectrometry, which \"weighs molecules and helps us to find out what they are\". The method allows Ms Milne to smell molecules while they are identified by the machine. Professor Barran explained: \"So we split them. Some go to be weighed and some go to Joy's nose. And that allows us to code to find out which of the very complicated mixture of molecules we have on our skin from skin swabs, are to do with the disease, are the ones that smell of it.\" Asked how it feels to walk past someone who might smell like they're carrying the condition and whether it's difficult to carry on walking by, Ms Milne said: \"It is very difficult, but I have signed a non-disclosure because it is unethical. It is and I can't do anything about that.\" Read more from Sky News:Trump lashes out over portraitPM says minister for men 'not the answer' Pressed on whether she finds it a blessing or extremely difficult, she said: \"I think, because it's a genetic thing in the female side of the family, my grandmother did warn me when she trained me, she did warn me not to use [it]. \"She said I would find it very difficult unless I made the decision that I would go ahead and do it. And I have made that choice. I was a nurse, a carer for my mother-in-law and my husband with Parkinson's and really it was the right choice. I think it was the right choice.\""
    },
    {
        "title": "Downing Street responds to Trump envoy's criticism of Starmer's Ukraine plans",
        "description": "Sir Keir Starmer is focused on a \"durable peace\", Downing Street has said, after Donald Trump's envoy to Ukraine dismissed his \"coalition of the willing\" plan.",
        "url": "https://news.sky.com/story/downing-street-responds-to-trump-envoys-criticism-of-starmers-ukraine-plans-13335069",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-starmer-pm-defence_6862737.jpg?20250320234743",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-03-24 14:36:00",
        "Headline": "Downing Street defended Sir Keir's peace plan for Ukraine after a Trump envoy criticised it - but would not say if it was discussed in an overnight phone call with the US president.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Sir Keir Starmer is focused on a \"durable peace\", Downing Street has said, after Donald Trump's envoy to Ukraine dismissed his \"coalition of the willing\" plan. Steve Witkoff - who is leading the US ceasefire negotiations with Ukraine and Russia - described the prime minister's idea as \"posture and pose\" and accused him of adopting the \"simplistic\" notion that leaders \"have all got to be like Winston Churchill\". Politics Live: No 10 dismisses row over chancellor's Sabrina Carpenter freebie Pushed by the UK and France, the \"coalition of the willing\" could see troops from a number of European and NATO countries deployed to Ukraine as peacekeepers after a ceasefire in order to deter Vladimir Putin from launching further attacks on its neighbour. Sir Keir's official spokesman defended the idea following Mr Witkoff's comments, saying the PM remained \"focused on the outcome of durable peace in Ukraine\" and that he was working on the \"planning phase\" of the coalition. He wouldn't be drawn on whether the remarks were discussed in a phone call between the prime minister and Mr Trump on Sunday night. He said the focus of their conversation was an \"economic deal\" with the US, but \"we are engaging with the US at all levels on Ukraine\".  Mr Witkoff made the comments in an interview with pro-Trump journalist Tucker Carlson. He told Mr Carlson he recently met with the Russian president in Moscow and \"liked\" him. \"I don't regard Putin as a bad guy. I thought that he was straight up with me,\" he said. Chancellor Rachel Reeves defended the prime minister's \"diplomatic efforts\" in bringing together European leaders after being shown the clip on the BBC's Sunday with Laura Kuenssberg. She said she was not \"put off\" by Mr Witkoff's comments and any ceasefire \"needs to be enforced\" - and that's what Sir Keir was focused on. Ukraine war latest: Putin's gift to Trump revealed as ceasefire talks focus on Black Sea Lib Dem leader Sir Ed Davey was more direct in his criticism, saying: \"Trump's so-called 'special' envoy might dismiss British leadership as pointless posturing, but we know what it really is. \"Britain leading in Europe again, as we have done in the greatest moments of our nation's history.\" Read more from Sky News:PM says minister for men 'not the answer' to 'problem with boys'What you need to know about spring statement More than 30 countries now stand ready to enforce a peace deal in Ukraine as part of the \"coalition of the willing\", Downing Street said last week. This includes a \"significant number\" of countries that will provide troops on the ground, while others are ready to contribute logistics and background support. Ceasefire talks aiming to end the conflict in Ukraine began today in Saudi Arabia, and both nations are expected to hold indirect talks mediated by the US. The hope is that both sides will agree on pausing long-range attacks on energy facilities and civilian infrastructure."
    },
    {
        "title": "Ukraine war: Russia accused of 'hollow' peace talks as strike injures dozens including children",
        "description": "Russia has been accused of making \"hollow statements about peace\" after launching a missile strike that wounded dozens of people, including children, as it held talks with the US on a proposed ceasefire at sea in the war in Ukraine.",
        "url": "https://news.sky.com/story/ukraine-war-russia-accused-of-hollow-peace-talks-as-strike-injures-dozens-including-children-13335293",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-russia-ukraine_6865776.jpg?20250324142734",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-24 23:56:00",
        "Headline": "As Russia and the US held talks in Saudi Arabia, a missile strike in the northeastern Ukrainian city of Sumy wounded at least 88 people, local officials said.",
        "Content": " Russia has been accused of making \"hollow statements about peace\" after launching a missile strike that wounded dozens of people, including children, as it held talks with the US on a proposed ceasefire at sea in the war in Ukraine. Russian and US officials met in Saudi Arabia on Monday, with Ukrainian and American delegations due to gather in Riyadh on Tuesday. Both Russia and Ukraine have accused the other of undermining efforts to reach a pause in the three-year-old war. There was no immediate word on whether an agreement had been hammered out or progress made in Monday's talks with Russia. A Russian source told the Reuters news agency that a draft joint statement on the talks' outcome has been sent to Moscow and Washington for approval, with the parties aiming to release it on Tuesday, A White House source said the talks have been going \"extremely well\" and a positive announcement is expected soon. The talks were expected to cover energy infrastructure and a potential pause in attacks in the Black Sea to ensure the safety of commercial shipping. In an exchange with reporters at the White House, Donald Trump said territorial lines and the potential for US ownership of the Zaporizhzhia nuclear power plant in southern Ukraine have been part of the talks. Read more:Which key pieces of infrastructure could be part of Ukraine ceasefire deal?How has Trump - the 'dealmaker' - done on foreign policy? As the Russia-US meeting was under way, a Russian missile strike damaged a school and a hospital in the northeastern Ukrainian city of Sumy, wounding at least 88 people, including 17 children, according to the local council. \"Moscow speaks of peace while carrying out brutal strikes on densely populated residential areas in major Ukrainian cities,\" Ukrainian foreign minister Andrii Sybiha said. \"Instead of making hollow statements about peace, Russia must stop bombing our cities and end its war on civilians.\" Sumy is about 18.6 miles from the Russian border and is subject to regular drone and missile strikes by Russia. 👉Listen to The World With Richard Engel And Yalda Hakim on your podcast app👈 Meanwhile, Ukraine's main intelligence agency claims Russia is recruiting unwitting Ukrainian teenagers to carry out terrorist attacks. Russian intelligence agencies are promising children easy money on social media for delivering packages, which are remotely detonated, the Security Service of Ukraine (SBU) said. The SBU said the Russian Federal Security Service used a 15-year-old boy as an \"assassin\" in Kharkiv and killed a teenager in Ivano-Frankivsk, western Ukraine. Sky News cannot independently verify these claims."
    },
    {
        "title": "Gisele Pelicot's son relives moment he discovered his father was a monster",
        "description": "His father is one of France's worst sex offenders, his mother a national hero.",
        "url": "https://news.sky.com/story/son-of-french-rapist-dominique-pelicot-relives-moment-he-discovered-the-father-he-loved-was-a-manipulative-monster-13334463",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-pelicot-david-gisele_6865098.jpg?20250324094235",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-03-24 00:01:00",
        "Headline": "Dominique Pelicot was last year jailed for repeatedly drugging and raping his wife Gisele, and inviting dozens of other men to do the same. His eldest son, David, tells Sky News how his family is trying to move forward after \"unspeakable pain\".",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  His father is one of France's worst sex offenders, his mother a national hero. As the friendly, smartly dressed man sits in front of me, waiting for our interview to begin, it is impossible to understand the pain and anguish which has haunted David Pelicot and his family over the last four years. \"He was my father, but he's not anymore,\" David says. \"Today he's a monster.\" David is the eldest son of Gisele Pelicot, the woman at the centre of a mass rape trial who became a household name after waiving her right to anonymity and bravely declaring that \"shame must change sides\". His father, Dominique, admitted repeatedly drugging and raping Gisele between 2011 and 2020, and inviting dozens of other men to their home in southern France to do the same. As strangers attacked his sedated wife, Dominique filmed them, building up a vile library of abuse. His crimes were exposed by chance in 2020 after he was caught filming up women's skirts in a local supermarket. When police seized his devices, they uncovered 20,000 meticulously organised videos and images of abuse.  Gisele was the unconscious victim in many of them. On 2 November 2020, police showed her what they had found. After seeing herself violated in the most hideous ways, she had to call her children to tell them what their father had done. \"It's a moment that will remain etched in my memory forever,\" David says, as he recounts the evening which would destroy his family. He remembers his wife answering the phone, speaking to his mother and turning pale before handing him the call. His mother gently asked him to go somewhere quiet, where he could be alone. She then explained she had been repeatedly raped by his father and dozens of other men. \"What she told me was like a tsunami,\" David says. \"I felt so many emotions rising within me… and then the nausea which had been mounting during the entire conversation reached a peak. \"I hung up the phone and it felt like the floor gave way under my feet, and I felt sick. I went to the bathroom and threw up.\" Read more:How Gisele Pelicot went from victim to feminist heroInside the depraved mind of 'career criminal' Dominique Just like his mother, the 50-year-old is dignified and clear as he relives the moment he discovered the father he loved and trusted was a manipulative monster. Dominique Pelicot, the affable guy who people liked, was a predator who carefully planned his crimes, crushing sleep-inducing drugs into his unsuspecting wife's food before allowing strangers to abuse and degrade her. No day was off limits; Gisele was assaulted on her birthday, Valentine's Day and New Year's Eve. \"The moment we were told that she had been abused by more than 50 men was very difficult to hear, because this man, Dominique Pelicot, was the backbone of the family,\" David continues. \"He'd taught me to respect women, so when I heard what he'd done to our own mother, as the eldest son, I was filled with anger and total incomprehension.\" Throughout our conversation, David always uses Dominique's full name. He explains it's his way of moving forward and grieving. In December, Dominique Pelicot was sentenced to 20 years in jail after admitting his crimes. During the trial, his lawyer argued he had a split personality which enabled him to be a seemingly perfect husband and loving father while secretly committing hideous assaults. The question of how he had managed to trick them all clearly plays on David's mind. He says he believes Dominique is a Jekyll and Hyde type character who can be kind one minute, then depraved and cruel another. The trial heard as well as the attacks on Gisele, Dominique put up cameras to secretly film and photograph his son's wives, including one who was pregnant. The cameras were hidden in their bathrooms or rooms in his home. He then shared naked photos of them online. He also took photos of his adult daughter, Caroline, semi-naked while she was asleep. Dominique has always denied assaulting her, but she is terrified she was another of his victims. David tells me he also believes his sister was abused and pledges to help her in her fight for justice. After police exposed Dominique's crimes, David cut him off. But just before the trial started his father sent him a letter. \"The first thing I asked myself was why is he writing to me? Is he writing to apologise? To ask for forgiveness? Or to try to manipulate me?\" he says. \"So, I read his letter carefully, but quite honestly, I tore it up and threw it in the bin. \"Personally, I will never forgive him.\" There's only one question he wants to ask his father - why? Why did he do this to his wife, to his children and his grandchildren? Gisele isn't believed to be Dominique's only victim but David doesn't believe his father will ever tell the truth about his crimes. \"I have no doubt he'll die in prison, but I'm convinced that he'll take many of his secrets to the grave,\" he says. While there's no doubt Dominique was the conductor in this depraved orchestra of abuse, 50 other men were also found guilty of raping or sexually assaulting Gisele. Around nine men are appealing but the case has forced France to look at its rape culture.  Inspired by Gisele's bravery in waiving her anonymity and allowing images of herself being raped to be shown in open court, tens of thousands of people joined demonstrations against sexual violence around the country. Many held photos or drawings of Gisele. Her courage has seen her named as one of Time Magazine's women of the year, while a bold sketch of her with the words \"No more shame\" was emblazoned on the cover of German Vogue. I ask David how he sees the woman who has become an icon for many? \"First and foremost, she's our mum. She's also our children's grandmother, but today, and for the rest of her life, she'll be a heroine,\" he says. For all the strength and dignity Gisele and her children have shown, it's unclear if they will ever be able to heal from the damage inflicted upon them. David explains his mother is trying to slowly rebuild herself but acknowledges that the family endured \"unspeakable pain\" throughout the trial. \"We must continue to live, give meaning to our lives and not forget that in the world, there are other women who cannot speak and who absolutely must be helped,\" he says.  At the end of the interview, he asks our all-female team how we think toxic masculinity and rape culture can be tackled. He listens intently to our responses and is clearly passionate about trying to find ways to educate young men and help build a safer society for women. He is impatiently waiting for the government to change the law around sexual consent. He has seen the darkest side of humanity and is desperately seeking the light. He says he found it in the crowds of cheering women who came to support his mother at court, crying with joy when the verdicts were read out. The case exposed unrepentant evil but also \"gave immense hope to all women who suffer sexual violence,\" David concludes. \"Not only bad came from this case. There was also a lot of positivity; today people are free to speak out.\""
    },
    {
        "title": "Why are people protesting in Turkey?",
        "description": "Hundreds of thousands of people have gathered on the streets of Istanbul to protest against the arrest of the city's mayor - as he was due to be selected as an opposition candidate to President Recep Tayyip Erdogan.",
        "url": "https://news.sky.com/story/why-are-people-protesting-in-turkey-13334828",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-turkey-istanbul_6865506.jpg?20250324080605",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-24 07:25:00",
        "Headline": "Those who have taken to Istanbul's streets see the arrest of its mayor Ekrem Imamoglu as politically motivated, as he was formally arrested and jailed on the same day the Republican People's Party (CHP) was expected to vote him in as their presidential candidate for the 2028 elections.",
        "Content": "Hundreds of thousands of people have gathered on the streets of Istanbul to protest against the arrest of the city's mayor - as he was due to be selected as an opposition candidate to President Recep Tayyip Erdogan. Ekrem Imamoglu, 54, was detained on corruption charges alongside 100 others on 19 March - and was formally arrested and jailed five days later. Those who have taken to the streets see Mr Imamoglu's detention as politically motivated, as he was sent to jail on the same day the Republican People's Party (CHP) was expected to vote him in as their presidential candidate for the 2028 elections. Mr Erdogan's government has denied these claims, describing the demonstrations as \"street terror\", a \"disruption of public order\", and \"vandalism\". They are thought to be the largest protests since the Gezi Park demonstrations in 2013, when around three million people took part. Police used tear gas, water cannon and rubber bullets as they tried to disperse crowds during five nights of protests and had detained 323 people by Sunday, interior minister Ali Yerlikaya said.  Why was Istanbul's mayor arrested? According to state prosecutors, Ekrem Imamoglu was arrested on suspicion of \"establishing and managing a criminal organisation, taking bribes, extortion, illegally recording personal data, and rigging a tender\". They also questioned him on terrorism charges, alleging that he took part in an \"urban consensus initiative\" aimed at increasing the influence of Kurdish figures in municipal Turkish politics. The prosecutors say the scheme was linked to the People's Democratic Congress (HDK), which is part of the Kurdistan Workers' Party (PKK), a proscribed terrorist group in Turkey, the UK, and the US.  Read moreWriter once detained for 'insulting Turkishness' Mr Imamoglu was detained alongside one of his aides and the mayors for Istanbul's Sisli and Beylikduzu districts. It came four days before the CHP was due to hold its primary elections for the 2028 Turkish elections, in which Mr Imamoglu was their sole candidate. Although only 1.5 million delegates were eligible to vote, the party reportedly set up \"solidarity\" ballot boxes allowing others to show him their support. According to CHP leader Ozgur Ozel, at least 13 million people submitted votes for him, in addition to the party members. The day before his detention, Istanbul University revoked his degrees - in business administration and human resources management. University bosses claim this was due to irregularities stemming from the fact he had transferred from a private university in northern Cyprus. However, his supporters were quick to point out that this would prevent him from running for the presidency - as a university degree is among the essential criteria. During a court hearing on Saturday, Mr Imamoglu described the claims against him as \"unimaginable accusations and slanders\". \"I strongly reject all allegations,\" he said, before being denied bail and moved to a prison west of Istanbul. Speaking after the decision to charge his colleague, CHP leader Mr Ozel said: \"The only crime of Ekrem Imamoglu, who has been elected by 16 million Istanbulites three times, is to have defeated Recep Tayyip Erdogan and he has been arrested because he would win the next election.\" Mr Erdogan's office has denied these allegations - and accused the CHP of trying to \"disturb the peace and polarise our people\". Why is he important?  Mr Imamoglu was elected mayor of Istanbul in March 2019 - having served as mayor of Beylikduzu, a western district of the city, for five years previously. It represented a huge blow for President Recep Tayyip Erdogan whose Justice and Development (AK) Party had controlled Istanbul for 25 years. AK challenged the result, claiming irregularities, and demanded a re-run, which took place in June and which Mr Imamoglu also won. Mr Imamoglu won a second five-year term as mayor in last year's mayoral election - with more than 50% of the vote. On Sunday, Turkey's interior ministry said Mr Imamoglu had been suspended from duty as a \"temporary measure\". This was also seen by demonstrators as symbolic of the curbing of Turkish democracy and its rule of law.  What is the wider political situation in Turkey?  Mr Erdogan came to power in 2003. He served as prime minister until 2014 when he oversaw Turkey's move from a parliamentary to presidential system and became the country's first directly-elected president. He has been re-elected twice - in the 2018 and 2023 elections. The current constitution would prevent him from running again but many believe he will amend the rules to stay in office. During his tenure he has expanded presidential powers and reversed previous bids to make Turkey a more secular society - instead advocating for conservative, pro-religious positions. World leaders and human rights organisations have voiced increasing concerns about Turkish democracy. Human Rights Watch says Mr Erdogan's government has \"set back Turkey's human rights record by decades\". They cite the \"targeting of perceived government critics and political opponents\", \"undermining the independence of the judiciary\" and \"hollowing out democratic institutions\". Amnesty International claims he is responsible for \"baseless investigations, prosecutions and convictions of human rights defenders, journalists, and opposition politicians\". The group says that anti-terrorism and disinformation laws have been used to \"curtail freedom of expression\" and \"unlawfully restrict freedom of assembly\". Amid protests this week, public gatherings have been banned, parts of Istanbul's public transport network suspended, and there are reports of access to social media platforms such as X and TikTok being restricted. Following the earthquakes in Turkey in February 2023, in which 15 million people were impacted and at least 50,000 people killed, 257 people were arrested for criticising the government response. Mr Erdogan and his ministers have repeatedly denied allegations of autocracy."
    },
    {
        "title": "The 'charisma battle' at the heart of the Turkish protests",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>   ",
        "url": "https://news.sky.com/story/the-charisma-battle-at-the-heart-of-the-turkish-protests-13334941",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-daily-podcast-240325_6865585.png?20250324104803",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-24 11:32:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈   Thousands of protesters have taken to the streets of Turkey, following the arrest of Ekrem Imamoglu - the main political rival of President Recep Tayyip Erdogan. Opposition leader Mr Imamoglu is a popular politician, the mayor of Istanbul, and a 2028 presidential candidate. But last Wednesday he was detained and later formally arrested on allegations of corruption, a move he says is politically motivated. On Sky News Daily, Liz Bates talks to Sky's special correspondent Alex Crawford who has been reporting from Istanbul and meeting with protesters. She also speaks to Hannah Lucinda Smith, the author of Erdogan Rising: The Battle For The Soul Of Turkey, about who Mr Imamoglu is and what his arrest tells us about the direction Mr Erdogan is taking the country. Help us understand more about our listeners by taking our survey! This form should only take a few minutes to complete, and Sky anonymises the responses as much as possible Podcast producer: Rosie GillottEditor: Paul Stanworth"
    },
    {
        "title": "Inside the court as sexual assault trial of French actor Gerard Depardieu begins",
        "description": "Gerard Depardieu is more than just a household name in France.",
        "url": "https://news.sky.com/story/inside-the-court-as-sexual-assault-trial-of-french-actor-gerard-depardieu-begins-13335174",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-gerard-depardieu-sex-assault-trial_6865982.jpg?20250324184752",
        "type": "World",
        "Author": "Sophie Garratt, Europe news editor, in Paris",
        "Date Published": "2025-03-24 18:33:00",
        "Headline": "Around 100 protesters from France's #MeToo movement had come to show their support outside the court for the alleged victims. Inside the court, there was a visible presence of Depardieu's supporters.",
        "Content": "By Sophie Garratt, Europe news editor, in Paris   Gerard Depardieu is more than just a household name in France. The actor has starred in over 200 films - he's the face of French cinema for all generations. As he entered a crowded court on Monday in Paris, dressed all in black, he turned every head in the room. The 76-year-old limped towards the front benches, propping himself up on court furniture along the way. It was the first day of a trial expected to last two or three days. The actor faces charges of sexually assaulting two women on the set of French movie Les Volets Verts (The Green Shutters) in 2021 - allegations he denies. Around 100 protesters from France's #MeToo movement came to show their support outside the court for the alleged victims. Inside the court, there was a visible presence of Depardieu's supporters. Fans of the star took up public seats in the chamber, as well as French A-list actors Vincent Perez and Fanny Ardant, the latter confirming she would testify as a witness for the defence. Throughout the hearing, Depardieu repeatedly faced the alleged victims and looked them in the eyes, nodding during the opening arguments delivered by his lawyers. Electric exchanges There were electric exchanges between the legal teams, as the actor's lawyer Jeremie Assous requested the case be withdrawn due to a lack of evidence and witnesses provided by the prosecution. Read more from Sky News:What Depardieu trial means for #MeToo in FranceGisele Pelicot's son speaks to Sky News The lawyers for the prosecution, in turn, complained that the profile of Depardieu gave him an unfair advantage, criticising the judge for allowing the defence almost two hours for their opening statement. Tempers flared during the hearing, with actress Anouk Grinberg, who had come to show support for the alleged victims, ejected from the chamber for contempt. The trial continues, with Depardieu expected to speak on Tuesday."
    },
    {
        "title": "JD Vance's wife leads high-profile US team on Greenland visit",
        "description": "A high-profile US delegation will visit Greenland this week as President Donald Trump continues to threaten to annexe the strategic Danish territory.&#160;",
        "url": "https://news.sky.com/story/jd-vances-wife-leads-high-profile-us-team-on-greenland-visit-13334797",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nuuk-greenland_6850476.png?20250308173411",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-24 04:26:00",
        "Headline": "Usha Vance will lead the delegation that includes White House national security adviser Mike Waltz and energy secretary Chris Wright.",
        "Content": " A high-profile US delegation will visit Greenland this week as President Donald Trump continues to threaten to annexe the strategic Danish territory.  Usha Vance, wife of vice-president JD Vance, will lead the delegation that includes White House national security adviser Mike Waltz and energy secretary Chris Wright. Mr Waltz and Mr Wright plan to visit the Pituffik space base, the US military base in Greenland. The team will also watch a national dogsled race and visit historical sites. Brian Hughes, spokesperson for the White House national security council, said the US team is \"confident that this visit presents an opportunity to build on partnerships that respects Greenland's self-determination and advances economic cooperation\". \"This is a visit to learn about Greenland, its culture, history, and people and to attend a dogsled race the United States is proud to sponsor, plain and simple,\" Mr Hughes added. Mr Trump has made the US annexation of Greenland a major talking point since taking office on 20 January. \n                  Why does Trump want to take over Greenland - and could he actually do it?\n                 \n                  Donald Trump says he thinks US will annex Greenland\n                 \n                  Greenland's slow independence party wins election in result seen as rejection of Trump's interference\n                 Read more: Do people in Greenland want to be part of the US? Greenland's strategic location and rich mineral resources would benefit the US. It also lies along the shortest route from Europe to North America, and is vital for the US ballistic missile warning system. The governments of both Greenland and Denmark have voiced opposition to such a move. Greenland Prime Minister Mute Egede reacted angrily to news of the US visit, saying his nation has tried \"all diplomatic and democratic options\", but Mr Trump's mission is \"to own and control Greenland\". Mr Egede told newspaper Sermitsiaq: \"Every minute counts to ensure that the Americans' dream of annexing our country does not become a reality.\" He said, \"until recently\" they could \"safely trust\" Washington, but \"that time is over\". US leadership, he said, is \"completely and utterly indifferent to what we have stood together on so far, because now it is only a matter of them taking over our country over our heads\". He told Greenland's international allies that \"hiding in a small corner and almost whispering that they support us has no effect\". \"If they do not speak out loudly about how the USA is treating Greenland, the situation will escalate day by day, and the American aggression will increase,\" he added. Read more from Sky News:Gisele Pelicot's son relives moment he discovered his father was a monsterCanadian PM vows Trump will not 'break us' as he calls snap election Danish Prime Minister Mette Frederiksen said in a written statement reacting to news of the visit that \"this is something we take seriously\". She said Denmark wants to cooperate with the US, but it should be cooperation based on \"the fundamental rules of sovereignty\". Referring to Ms Vance's upcoming trip, Tom Hoyem, former Danish minister for Greenland, told Sky News it is \"politically incorrect and provocative to make such a visit\" just as Greenlanders prepare to go to the polls for local elections on 1 April. He said \"Greenland is an open country, of course the lady [Ms Vance] can arrive and she can look at the dogsled run as she would like\", but \"the timing is really bad and in this way it is a provocation\". Mr Hoyem said there was a need for talks to avoid \"unnecessary provocation\". \"The kingdom of Denmark with Greenland and the Faroe islands, that's a sovereign kingdom and no one can try and take [it] over,\" he added."
    },
    {
        "title": "Why does Trump want to take over Greenland - and could he actually do it?",
        "description": "Since winning re-election, president-elect Donald Trump has expressed an interest in acquiring Greenland.",
        "url": "https://news.sky.com/story/greenland-why-does-trump-want-buy-the-arctic-island-and-could-he-actually-do-it-13285350",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-donald-trump-jr-greenland_6794227.jpg?20250108104747",
        "type": "World",
        "Author": "Lauren Russell",
        "Date Published": "2025-03-24 11:33:00",
        "Headline": "Mr Trump's aims to take control of Greenland coincides with his repeated claims that Canada should become the 51st state of the US - and him directing the US military to draw up options to achieve his goal of \"reclaiming\" the Panama Canal.",
        "Content": "\n          News reporter\n              @laurenvrussell\n  Since winning re-election, president-elect Donald Trump has expressed an interest in acquiring Greenland. His aims surrounding Greenland coincide with his repeated claims that Canada should become the 51st state of the US and him directing the US military to draw up options to achieve his goal of \"reclaiming\" the Panama Canal. Here is everything you need to know about the US president's proposals and if they could actually happen. National security purposes Greenland is the world's largest island and a semiautonomous territory of Denmark. With a population of 57,000, it has been part of Denmark for 600 years. It is also a founding member of NATO and home to a large US military base. Straddling the Arctic circle between the US, Russia and Europe, the island offers a unique geopolitical advantage that America has eyed for more than 150 years. It's even more valuable as the Arctic opens up more to shipping and trade. The idea of purchasing Greenland is not a new one for Mr Trump, who raised it as a possibility during his first term in office. But he has since reiterated the benefit it could have for America's national security. \"We need greater national security purposes,\" Mr Trump has said in the past. \"I've been told that for a long time, long before I even ran [for president]. \"People really don't even know that Denmark has any legal right to it, but if they do, they should give it up because we need it for national security.\" Mr Trump's claim to the island coincided with a visit by his son, Donald Trump Jr, back in January. Usha Vance, wife of Vice President JD Vance, will also lead a US delegation to the island which the White House said had been organised as a chance to learn about Greenland. The delegation will \"visit historical sites, learn about Greenlandic heritage, and attend the Avannaata Qimussersu, Greenland's national dogsled race\".  Rich in natural resources As well as its location, Greenland holds rich deposits of various natural resources. Locked inside the island are valuable rare earth minerals needed for telecommunications, as well as uranium, billions of untapped barrels of oil and a vast supply of natural gas that used to be inaccessible but is becoming less so. Many of the same minerals are currently mostly supplied by China, so other countries such as the US are interested in tapping into available resources closer to home. A front-row seat to the climate crisis More than the oil, gas or minerals, Greenland has a lot of ice - and provides a front-row seat to the globe's climate crisis. If that ice melts, it would reshape coastlines across the globe and has the potential to dramatically shift weather patterns.  In fact, Greenland holds enough ice that if it all melts, the world's seas would rise by 24ft (7.4m). Greenland also influences hurricane and winter storm activity. Because of its mountains of ice, it has the power to change patterns in the jet stream, which brings storms across the globe and dictates daily weather. Often, especially in winter, a blocking system of high pressure off Greenland causes Arctic air to plunge to the west and east, sweeping across North America and Europe, winter weather expert Judah Cohen told the Associated Press. British politician and security expert Mike Martin explained on X that the seas between Greenland and the UK - which has Iceland in the middle - are \"utterly vital\" for NATO. He explained that during the Cold War, the UK would often have 50 ships stationed in the area to look after the Greenland-Iceland-UK (GIUK) gap - which is the \"only sensible route\" that the Russian northern fleet has to get into the Atlantic Ocean. Both the UK and Denmark continue to have a shared security interest in the gap. The UK government website states that as part of the UK's Arctic Policy Framework, it will continue to develop military capability in collaboration with Denmark, to allow it to operate in the region and in order to safeguard UK interests and those of its allies. However, if the territory is taken over by the US, this collaboration could be affected. British Foreign Secretary David Lammy told Sky News at the beginning of the year that the comments were \"classic Donald Trump\". \"He came in very clearly saying he was going to work for working people,\" Mr Lammy said. \"And, he sees American national economic security as centring that. \"That is why he's raising issues, in relation to the Panama Canal, and I suspect to Greenland.\" He added that behind Mr Trump's \"intensity\", there are \"actually quite serious national security and economic issues\". Ever since Mr Trump expressed an interest in Greenland the country's government has opposed him. As the country headed to the polls in early March to elect a new prime minister, Mr Trump promised \"billions of dollars\" in investment telling them he will \"make you rich\".  The Demokraatit party won 30% of the vote in the election, handing Jens-Frederik Nielsen the win. Although his party favours independence, it prefers a slow move away from Denmark. Mr Nielsen told Sky News' international affairs editor Dominic Waghorn that he hopes his victory sends a clear message to Mr Trump that \"we are not for sale\". \"We don't want to be Americans. No, we don't want to be Danes. We want to be Greenlanders. And we want our own independence in the future. And we want to build our own country by ourselves, not with his hope,\" he said. Ahead of the delegation visit led by Mrs Vance, all five parties in Greenland's parliament issued a joint statement last week rejecting Mr Trump's remarks. Danish Prime Minister Mette Frederiksen has also said she did not believe the US would use military or economic power to secure control over Greenland. \"Greenland is not for sale,\" Ms Frederiksen said, adding: \"We need to stay calm and stick to our principles.\" Referring to the US as Denmark's \"most important and closest ally\" she said she welcomed the US taking a greater interest in the Arctic region, but said it would have to be done in a way that is \"respectful of the Greenlandic people\". Denmark has recognised Greenland's right to independence at a time of its choosing. French foreign minister Jean-Noel Barrot also weighed in on the matter earlier this year, saying that the European Union would not let \"other nations of the world attack its sovereign borders, whoever they are\". \"If you're asking me whether I think the United States will invade Greenland, my answer is no. But have we entered intoa period of time when it is survival of the fittest? Then my answer is yes,\" Mr Barrot said. In Germany, Chancellor Olaf Scholz said the principle of inviolability of borders applies to every country no matter how powerful. \"Borders must not be moved by force,\" Mr Scholz said in a reaction to Mr Trump's remarks, although he did not mention the president by name. The Panama Canal is a waterway that connects the Caribbean Sea with the Pacific Ocean. It acts as a shortcut route, saving time and costs for transporting goods, according to the Embassy of Panama website. Under the Jimmy Carter administration, control of the canal was handed from the US to Panama in 1979, with the US ending its joint partnership in controlling the strategic waterway in 1999. It is now administered by the Panama Canal Authority, an autonomous government entity, although a Hong Kong-based contractor operates two ports connected to it. Mr Trump has claimed that the US is being treated unfairly when it is \"overcharged\" higher rates for its ships to sail the canal than those of other countries. He claimed Panama was in \"violation\" of a deal with the US and that \"China is basically taking it over\". \"We gave the Panama Canal to Panama. We didn't give it to China,\" Mr Trump said on Tuesday. \"They've abused that gift.\" Panamanian President Jose Raul Mulino denied in a video statement last month that China has influence over the canal and shot down the idea of the US taking back authority over it. \"Every square metre of the canal belongs to Panama and will continue to be so,\" he said.  Mr Trump's repeated attacks on Canada's sovereignty has infuriated leadership in the country. He has claimed that the country \"only works as a state\" adding the US doesn't need any of their resources such as lumber or energy. \"As a state, it would be one of the great states anywhere,\" Mr Trump said. \"This would be the most incredible country, visually. If you look at a map, they drew an artificial line right through it, between Canada and the US. Just a straight, artificial line. Somebody did it a long time ago, many many decades ago. Makes no sense. It's so perfect as a great and cherished state.\"  Relations between the two countries have since dwindled, with new Canadian Prime Minister Mark Carney saying Canada faces the most \"significant crisis of our lifetimes\" because of the president's \"threats to our sovereignty\". Mr Carney, who is the former governor of the Bank of England, has called a snap election after the resignation of Justin Trudeau. The election on 28 April is likely to come down to who is best equipped to take on Mr Trump. The incoming president has offered few details as to how he might carry out his plans to grow the US footprint. He told Congress at the beginning of March that \"America is back\", adding that the American Dream was bigger and better than ever before. In reality, if Greenland becomes independent, it could choose to become associated with the US. One option could be to form a so-called \"free association\" pact with America, similar to the status of Pacific island nations Marshall Islands, Micronesia and Palau. Mr Trump has also suggested he would impose tariffs on Denmark if it resists his offer to purchase the island. This could make things difficult for Danish companies, particularly drugmakers like Novo Nordisk, which sells the weight loss drug Wegovy and the type 2 diabetes medicine Ozempic. Eswar Prasad, a professor of trade policy at Cornell University, told investment magazine Barron's that the Trump administration could tailor specific tariffs to target products made by Danish companies regardless of where they are manufactured. On Canada, Congress would first have to approve accepting a new state. Canada would likely have to have a referendum to gauge voters' interests in joining the US before more detailed aspects of the process could begin. If Canada were to join the US - a highly unlikely prospect - its population of 41.6 million would make it the largest state, exceeding California's 39.4 million residents. It would also need two senators and 55 House seats - which would have huge effects on US presidental elections."
    },
    {
        "title": "Andrew Tate checks in at police station on return to Romania",
        "description": "Controversial social media influencer Andrew Tate has checked in at a police station in Romania after returning to the country from the United States.",
        "url": "https://news.sky.com/story/andrew-tate-checks-in-at-police-station-on-return-to-romania-13334900",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-andrew-tate-romania_6865752.jpg?20250324140219",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-24 10:42:00",
        "Headline": "Andrew Tate and his brother Tristan are under investigation in Romania, the UK and Florida. They have denied any wrongdoing.",
        "Content": " Controversial social media influencer Andrew Tate has checked in at a police station in Romania after returning to the country from the United States. The self-styled \"king of toxic masculinity\" and his brother Tristan are under investigation in Romania where they face multiple allegations. They have denied any wrongdoing. Outside a police station in Voluntari, on the outskirts of the Romanian capital Bucharest, Andrew Tate, 38, said: \"I'm happy to be back in Romania. This is where I live. I love Romania very much. \"I'm going to spend the next few weeks in Romania, probably - unless I decide, spontaneously, to leave. \"I will do that as long as I obey my obligations to the court, which I of course will do. I'm allowed to go anywhere I like.\" He and his 36-year-old brother flew to the US on a private jet last month after a travel ban imposed on them was lifted. In Romania, the Tate brothers are facing allegations of trafficking minors, sexual intercourse with a minor and money laundering. A separate case against them, in which they are accused of human trafficking and forming a criminal gang to sexually exploit women, has been sent back to prosecutors.  The brothers are fighting a series of legal battles not just in Romania, but also in the UK and the US. They are due to be extradited to the UK following the conclusion of proceedings in Romania. Bedfordshire Police has secured a European arrest warrant for separate and unrelated allegations of rape and human trafficking involving different women. Those allegations, which the brothers \"unequivocally deny\", date back to 2012-2015. A recent lawsuit filed in Florida accuses both Tate brothers of conspiring to coerce a woman into sex work, luring her to Romania and defaming her after her testimony to Romanian authorities. The Tate brothers had previously sued her for defamation in 2023. Read more:Who is Andrew Tate - and what charges does he face?Tate leaves US to prove 'innocent men don't run'The Tates and Donald Trump's deepening ties The Trump administration reportedly pressed the Romanian government to lift travel restrictions on the brothers last month, before they were allowed to fly to Florida. However, on their arrival in the US, Florida launched a criminal investigation into the brothers. James Uthmeier, the state's attorney general, said its work was \"active\" into holding a preliminary inquiry into the Tate brothers, who have denied committing any offences. The brothers - who champion US President Donald Trump - are dual UK and US nationals whose controversial views are shared widely on social media platforms such as TikTok and X. The pair are often criticised for their misogynistic views online - particularly as they have a predominately young, male audience."
    },
    {
        "title": "Oscar-winning Palestinian filmmaker detained by Israeli military after being beaten up, say activists",
        "description": "An Oscar-winning Palestinian filmmaker has been held by the Israeli military in the occupied West Bank, according to activists.",
        "url": "https://news.sky.com/story/oscar-winning-palestinian-filmmaker-detained-by-israeli-military-after-being-beaten-up-say-activists-13335246",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-hamdan-ballal-no-other-land_6866157.jpg?20250324220459",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-24 23:20:00",
        "Headline": "The Centre for Jewish Nonviolence said Hamdan Ballal suffered a bleeding head in the assault, and as he was being treated in an ambulance, he and another Palestinian man were detained.",
        "Content": "An Oscar-winning Palestinian filmmaker has been held by the Israeli military in the occupied West Bank, according to activists. Hamdan Ballal had earlier been beaten up by Israeli settlers who were among dozens who attacked the Palestinian village of Susya in the Masafer Yatta area and destroyed property, said the Centre for Jewish Nonviolence. The activist group said Mr Ballal suffered a bleeding head in the assault, and as he was being treated in an ambulance, he and another Palestinian man were detained. \"We don't know where Hamdan is because he was taken away in a blindfold,\" said 28-year-old Josh Kimelman, who was at the scene. 'Masked settlers attack activists with stones' During the incident, around 10-20 masked settlers reportedly attacked Jewish activists with stones and sticks, smashing car windows and slashing tyres. One settler swung his fists at two activists before the pair rushed back to their vehicle, video provided by the Centre for Jewish Nonviolence showed. IDF statement \n                  What happened to the Israel-Hamas ceasefire - and could there be another one?\n                 \n                  Israeli strike hits key Gaza hospital as number of Palestinians killed passes 50,000\n                 \n                  Starmer expresses 'deep concern' about lack of humanitarian aid in Gaza\n                 The Israel Defence Forces (IDF) said in a statement to Sky News that on Monday night \"several terrorists hurled rocks at Israeli citizens, damaging their vehicles near Susya\". The IDF also said a violent confrontation then broke out involving \"mutual rock-hurling between Palestinians and Israelis at the scene\". \"IDF and Israeli Police forces arrived to disperse the confrontation, at this point, several terrorists began hurling rocks at the security forces,\" according to the statement. \"In response, the forces apprehended three Palestinians suspected of hurling rocks at them, as well as an Israeli civilian involved in the violent confrontation. The detainees were taken for further questioning by the Israel police. An Israeli citizen was injured in the incident and was evacuated to receive medical treatment. \"Contrary to claims, no Palestinian was apprehended from inside an ambulance.\" Best documentary Mr Ballal is one of the co-directors of No Other Land which won the best documentary Oscar this year. The film follows Masafer Yatta residents as they struggle to stop Israel's army from demolishing their villages. No Other Land has two Palestinian co-directors, Ballal and Basel Adra, both Masafar Yatta residents, and two Israeli directors, Yuval Abraham and Rachel Szor. Read more from Sky News:What happened to Israel-Hamas ceasefire?West Bank areas 'turning into mini-Gaza' Hundreds of Palestinians have been killed in the West Bank in Israeli military operations during the Gaza war, and there has also been a rise in settler attacks on Palestinians. There has also been a surge in Palestinian attacks on Israelis. Red Cross office damaged Meanwhile, in the southern Gazan city of Rafah, a Red Cross office was damaged by an explosive projectile. The Israeli military said its forces fired at a building belonging to the charity after identifying suspects and sensing a threat. But it admitted it had opened fire due to an incorrect identification. \"The structure's ownership was unknown to the force at the time of the shooting,\" the military added. No one was injured, according to the International Committee of the Red Cross, which said the attack had a direct impact on its ability to operate."
    },
    {
        "title": "US plan to bomb Yemen's Houthis accidentally shared with journalist Jeffrey Goldberg in group chat",
        "description": "An American reporter was accidentally included in a group chat in which senior officials in Donald Trump's government discussed conducting airstrikes on Yemen's Iran-backed Houthis earlier this month.",
        "url": "https://news.sky.com/story/us-plan-to-bomb-yemens-houthis-accidentally-shared-with-american-journalist-in-group-chat-13335159",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-pete-hegseth_6866218.jpg?20250325011626",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-24 20:00:00",
        "Headline": "In an article titled The Trump Administration Accidentally Texted Me Its War Plans, the editor-in-chief of The Atlantic magazine revealed he \"knew two hours before the first bombs exploded that the attack might be coming\".",
        "Content": " An American reporter was accidentally included in a group chat in which senior officials in Donald Trump's government discussed conducting airstrikes on Yemen's Iran-backed Houthis earlier this month. Jeffrey Goldberg, the editor-in-chief of The Atlantic magazine, was added to a group which included US vice president JD Vance, defence secretary Pete Hegseth, national security adviser Mike Waltz and director of national intelligence Tulsi Gabbard. In an article titled The Trump Administration Accidentally Texted Me Its War Plans, Mr Goldberg revealed he \"knew two hours before the first bombs exploded that the attack might be coming\". He said he had received a connection request on the encrypted messaging service Signal by Mr Waltz on 11 March and was invited to join the \"Houthi PC small group\" two days later. Responding to the report, Mr Trump said \"I know nothing about it\" and called The Atlantic \"not much of a magazine\". He added: \"I don't know anything about it. You're telling me about it for the first time.\" Speaking to reporters as he landed in Hawaii, Mr Hegseth said \"nobody was texting war plans and that's all I have to say about that\". He also claimed Mr Goldberg was \"peddling garbage\". On 15 March, US airstrikes killed at least 53 people in Yemen in retaliation for Houthi threats to begin targeting \"Israeli\" ships after Israel blocked aid entering the Gaza Strip. The daily bombardment has continued for the 10 days since then.  \"Your time is up, and your attacks must stop, starting today,\" Mr Trump said at the time. \"If they don't, hell will rain down upon you like nothing you have ever seen before.\" He said Iran would be held \"fully accountable\" for its proxy's actions, adding: \"And we won't be nice about it!\" When Mr Goldberg initially received a connection request from Mr Waltz, he was sceptical and initially thought \"someone could be masquerading as Waltz in order to somehow entrap me\". By David Blevins, Sky correspondent in Washington DC \"FUBAR\" - that's one congressman's response to the jaw-dropping news that Trump officials discussed war plans in a group chat on the Signal app. It's an old military acronym meaning 'F***ed up beyond recognition\" or \"…beyond repair\". \"Only one word for this: FUBAR,\" said Democrat representative Pat Ryan, an army veteran who sits on the armed services committee. The leak raises huge questions about national security, but legal experts suggest establishing the group on Signal may violate the espionage act. Click here to read the full analysis by David Blevins A spokesperson for the National Security Council said: \"At this time, the message thread that was reported appears to be authentic, and we are reviewing how an inadvertent number was added to the chain. \"The thread is a demonstration of the deep and thoughtful policy coordination between senior officials. The ongoing success of the Houthi operation demonstrates that there were no threats to our service members or our national security.\" Read more:Who are the Houthis? Group included 'active intelligence officer' After he was added to the \"Houthi PC small group\" on 13 March, Mr Goldberg saw a message from Mr Waltz asking the other members to provide a point of contact \"for us to coordinate with over the next couple of days and over the weekend\". In total, 18 people were part of the group, Mr Goldberg said, including Steve Witkoff, Mr Trump's Middle East and Ukraine negotiator, and an \"active intelligence officer\" whose name he did not publish. The next day Mr Waltz texted the group: \"Team, you should have a statement of conclusions with taskings per the Presidents [sic] guidance this morning in your high side inboxes,\" with \"high side\" referring to classified computer systems. \"State and DOD [Department of Defence], we developed suggested notification lists for regional Allies and partners. Joint Staff is sending this am [morning] a more specific sequence of events in the coming days and we will work w DOD to ensure COS [chief of staff], OVP [office of the vice president] and POTUS [president of the United States] are briefed.\" 'I think we are making a mistake', vice president says Mr Trump's vice president Mr Vance, who was at an economic event in Michigan, messaged: \"I think we are making a mistake. \"[Three] percent of US trade runs through the [Suez Canal]. 40 percent of European trade does. There is a real risk that the public doesn't understand this or why it's necessary. The strongest reason to do this is, as POTUS said, to send a message.\" He added: \"I am not sure the president is aware how inconsistent this is with his message on Europe right now. There's a further risk that we see a moderate to severe spike in oil prices. I am willing to support the consensus of the team and keep these concerns to myself. But there is a strong argument for delaying this a month, doing the messaging work on why this matters, seeing where the economy is, etc.\" European 'free-loading' is 'PATHETIC', senior officials say Later in the conversation, Mr Waltz criticised the limited capabilities of European navies, writing: \"Whether it's now or several weeks from now, it will have to be the United States that reopens these shipping lanes. Per the president's request we are working with DOD and State to determine how to compile the cost associated and levy them on the Europeans.\" Mr Vance addressed Mr Trump's defence secretary Mr Hegseth in a message reading: \"If you think we should do it let's go. I just hate bailing Europe out again.\" Mr Hegseth replied: \"VP: I fully share your loathing of European free-loading. It's PATHETIC. But Mike is correct, we are the only ones on the planet (on our side of the ledger) who can do this. Nobody else even close. Question is timing. I feel like now is as good a time as any, given POTUS directive to reopen shipping lanes. I think we should go; but POTUS still retains 24 hours of decision space.\" An account believed to be the deputy White House chief of staff, Stephen Miller, then said: \"As I heard it, the president was clear: green light, but we soon make clear to Egypt and Europe what we expect in return. We also need to figure out how to enforce such a requirement. EG, if Europe doesn't remunerate, then what? If the US successfully restores freedom of navigation at great cost there needs to be some further economic gain extracted in return.\" Messages could 'harm American military and intelligence personnel' The next day, the day of the strikes, Mr Goldberg said he saw messages which \"if they had been read by an adversary of the United States, could conceivably have been used to harm American military and intelligence personnel\". \"I will say a prayer for victory,\" Mr Vance said. Mr Goldberg said after the strikes many of those in the group celebrated with messages including \"good job\" and \"God bless\". When he realised the messages were real Mr Goldberg removed himself from the Signal group and emailed several officials in the group for comment. A spokesperson for Mr Vance replied: \"The Vice President's first priority is always making sure that the President's advisers are adequately briefing him on the substance of their internal deliberations,\" he said. \"Vice President Vance unequivocally supports this administration's foreign policy. The President and the Vice President have had subsequent conversations about this matter and are in complete agreement.\" It comes after Mr Hegseth's office announced a crackdown on leaking sensitive information."
    },
    {
        "title": "Trump officials discussing war plans on messaging app lambasted as 'amateur hour'",
        "description": "\"FUBAR\".",
        "url": "https://news.sky.com/story/trump-officials-discussing-war-plans-on-messaging-app-lambasted-as-amateur-hour-13335205",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-yemen-sanaa_6866024.jpg?20250324192701",
        "type": "US",
        "Author": "David Blevins, Sky correspondent, in Washington DC",
        "Date Published": "2025-03-24 20:50:00",
        "Headline": "Jeffrey Goldberg, The Atlantic's editor in chief, reports he was accidentally added to an encrypted messaging group. The conversation appeared to include vice president JD Vance, defence secretary Pete Hegseth and national security adviser Mike Waltz.",
        "Content": "By David Blevins, Sky correspondent, in Washington DC   \"FUBAR\". That's one congressman's response to the jaw-dropping news that Trump officials discussed war plans in a group chat on the Signal app. It's an old military acronym meaning 'F***ed up beyond recognition\" or \"…beyond repair\". Jeffrey Goldberg, The Atlantic's editor in chief, reports he was accidentally added to an encrypted messaging group. The conversation appeared to include vice president JD Vance, defence secretary Pete Hegseth and national security adviser Mike Waltz. They were discussing highly sensitive security information relating to an impending attack on Houthi rebels in Yemen. \"I didn't think it could be real,\" writes Goldberg, \"… then the bombs started falling\". \n                  Ukraine war: Russia accused of 'hollow' peace talks as strike injures dozens including children\n                 \n                  US plan to bomb Yemen's Houthis accidentally shared with journalist Jeffrey Goldberg in group chat\n                 \n                  Donald Trump portrait he branded 'purposely distorted' to be taken down\n                 Brian Hughes, spokesman for the National Security Council, confirmed the veracity of the Signal group. \"This appears to be an authentic message chain, and we are reviewing how an inadvertent number was added to the chain,\" he said. \"Only one word for this: FUBAR,\" said Democrat representative Pat Ryan, an army veteran who sits on the armed services committee. 👉 Follow Trump 100 on your podcast app 👈 The leak raises huge questions about national security, but legal experts suggest establishing the group on Signal may violate the espionage act. Remember how often Donald Trump called for Hillary Clinton to be jailed for using a private server for emails when she was US secretary of state?  Old alliances 'abandoned' by White House As if that's not enough, the online conversation appears to shed further light on the Trump administration's abandonment of old alliances. Vance seems to question the president's decision to strike, writing: \"I just hate bailing Europe out again.\" Hegseth replies: \"I fully share your loathing of European free-loading. PATHETIC.\" Read more from Sky News:Trump lashes out over portraitJD Vance's wife leads US team on Greenland visit Trump and his team argue that European countries benefit from US protection of shipping lanes in the Red Sea, a frequent target for attacks. Goldberg's initial scepticism is understandable - with participants using emojis like praying hands, the US flag, a fist and a fire, in a highly sensitive military discussion. \"Amateur hour,\" said Democrat senator Ruben Gallego, a marine veteran."
    },
    {
        "title": "DOGE staff getting daily death threats, says Elon Musk",
        "description": "Elon Musk claims some members of his Department of Government&#160;Efficiency (DOGE) are getting death threats on a daily basis.",
        "url": "https://news.sky.com/story/doge-staff-getting-daily-death-threats-says-elon-musk-13335145",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-elon-musk-cabinet-meeting_6865962.jpg?20250324182454",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-24 17:47:00",
        "Headline": "There have been angry protests against Elon Musk's federal cutbacks, which have included axing tens of thousands of public sector jobs. Meanwhile, the director of the FBI has described recent attacks on Tesla showrooms as \"domestic terrorism\".",
        "Content": " Elon Musk claims some members of his Department of Government Efficiency (DOGE) are getting death threats on a daily basis. The Tesla CEO and owner of X, who was speaking during a cabinet meeting at the White House, has drawn criticism over his efforts to downsize the US federal government. In just nine weeks, entire agencies have been dismantled and tens of thousands of workers from the 2.3 million federal workforce have been fired or agreed to leave their jobs. On Monday, US President Donald Trump gathered his cabinet secretaries, praising his department leaders for their cost-cutting measures even as he acknowledged these may not be \"popular\". Mr Trump said the cuts had to happen regardless of the political ramifications. \"I have no idea how it plays out in the public... but it's something that has to be done.\" The death threats, which Mr Musk claimed had been targeted at his staff at DOGE, follow recent attacks on Tesla showrooms, charging stations and privately owned cars. FBI Director Kash Patel said the bureau was investigating what he called \"the increase in violent activity toward Tesla\". \n                  US defence staff could face lie detector tests in probe into leaks after Musk Pentagon visit\n                 \n                  Trump 100 Day 62: Why was Elon Musk at the Pentagon?\n                 \n                  Trump 100 Day 61: Can team Trump impeach judges?\n                 In a post on X on Monday, he added: \"We have taken additional steps to crack down and coordinate our response. This is domestic terrorism. Those responsible will be pursued, caught, and brought to justice\". On Monday, police in Austin, Texas said they were investigating several incendiary devices found at a dealership. Over the weekend, there were demonstrations at Tesla dealerships across North America, and some clashes between pro and anti-Tesla protestors. A man drove his car into campaigners outside a showroom in Florida. No one was injured. And in California, police said a counter-demonstrator was arrested after activating a stun gun during an anti-Musk protest. During the White House meeting on Monday, some cabinet members heaped support on Musk and DOGE, with Environmental Protection Agency administrator Lee Zeldin touting the \"incredible\" partnership with his department and Attorney General Pam Bondi offering praise for \"Elon's incredible team\". Read more from Sky News:Trump demands removal of portraitWhy does Trump want Greenland?Vandals damage Tesla cars 'Many fraudulent contracts' There were also claims that \"many fraudulent contracts\" had been brought to light by Mr Musk, who sat at the end of the table wearing a red \"Trump Was Right About Everything\" hat. 👉 Follow Trump 100 on your podcast app 👈 At one point, he spoke to claim that the Small Business Association had discovered a loan awarded to a \"very precocious\" baby. But there have been reports of tensions over workforce reductions, with the president saying that future cutbacks would be at the discretion of department leaders. But then later, he insisted Mr Musk would intervene if departments don't make sufficient reductions. White genocide is a 'false narrative' Separately on Monday, South African President Cyril Ramaphosa hit back at claims from Mr Musk that white people are being persecuted in his country, describing the accusations as a \"completely false narrative\". It was his latest attempt to dismiss claims from the Tesla CEO - who was born in South Africa - as well as Mr Trump. Mr Musk has regularly accused South Africa's government of being anti-white, and said on social media that some of the country's political figures are \"actively promoting white genocide\"."
    },
    {
        "title": "Donald Trump portrait he branded 'purposely distorted' to be taken down",
        "description": "A portrait of Donald Trump, which he branded \"truly the worst\", will be taken down, officials have said.",
        "url": "https://news.sky.com/story/truly-the-worst-donald-trump-demands-removal-of-purposefully-distorted-portrait-13335008",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-portrait_6865704.jpg?20250324130743",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-24 12:50:00",
        "Headline": "The painting by British artist Sarah Boardman has been hanging in Colorado's State Capitol. Mr Trump said a portrait by the same artist of former US president Barack Obama was \"wonderful\" but \"the one on me is truly the worst\".",
        "Content": "A portrait of Donald Trump, which he branded \"truly the worst\", will be taken down, officials have said. The US president claimed the portrait by British artist Sarah Boardman, which was hanging in Colorado's State Capitol, was \"purposefully distorted\". Posting on his social media platform Truth Social, he said: \"Nobody likes a bad picture or painting of themselves, but the one in Colorado, in the State Capitol, put up by the Governor, along with all other Presidents, was purposefully distorted to a level that even I, perhaps, have never seen before.\" He said a portrait by the same artist of former US president Barack Obama was \"wonderful\" but \"the one on me is truly the worst\". In Colorado, House Democrats said in a statement that the oil painting that attracted Mr Trump's criticism would be taken down at the request of Republican leaders in the legislature. \"If the GOP (Republican Party) wants to spend time and money on which portrait of Trump hangs in the capitol, then that's up to them,\" the Democrats said. Colorado Republicans raised more than $10,000 (£7,700) through a GoFundMe account to commission the oil painting. \n                  Ukraine war: Russia accused of 'hollow' peace talks as strike injures dozens including children\n                 \n                  Trump officials discussing war plans on messaging app lambasted as 'amateur hour'\n                 \n                  US plan to bomb Yemen's Houthis accidentally shared with journalist Jeffrey Goldberg in group chat\n                 Referring to the artist, whose collection of official portraits also includes one of former president George W. Bush, Mr Trump said \"she must have lost her talent as she got older\". He then added: \"In any event, I would much prefer not having a picture than having this one.\" Mr Trump's portrait by Boardman has been hanging in the State Capitol since 2019. It is unclear what sparked Mr Trump's complaint on Sunday night. The criticism of the painting came on the same day that the Kremlin confirmed Vladimir Putin had gifted to Mr Trump a portrait he commissioned of the US president. Mr Putin gave the painting to Mr Trump's special envoy, Steve Witkoff, in Moscow earlier this month, the Russian president's spokesperson Dmitry Peskov said. Mr Witkoff told former Fox News host Tucker Carlson that Mr Trump \"was clearly touched\" by the portrait, which he described as \"beautiful\". Mr Witkoff met Mr Putin after talks with Russian officials about trying to end the war in Ukraine.  Read more:Trump trade war: Hopes rise for limited escalationWhy does Trump want to take over Greenland? The president, who started his second stint in the White House when he was sworn in on 20 January, had appealed to the \"Radical Left Governor, Jared Polis\" to take it down. The 78-year-old said he was speaking on behalf of \"many people from Colorado\" who were \"angry\" about the picture and wanted it removed.  The president ended his post saying: \"Jared should be ashamed of himself!\" When the portrait was unveiled in 2019, Boardman posted pictures online and said it was a \"great day\". She wrote: \"Please remain respectful - this is about portraiture, not politics.\" The artist's website states: \"Sarah believes that the ultimate challenge is to capture the 'personality, character and soul' of an individual in a two-dimensional format. \"She uses a combination of realism and painterly aspects designed to draw the viewer into piece.\""
    },
    {
        "title": "JD Vance's wife leads high-profile US team on Greenland visit",
        "description": "A high-profile US delegation will visit Greenland this week as President Donald Trump continues to threaten to annexe the strategic Danish territory.&#160;",
        "url": "https://news.sky.com/story/jd-vances-wife-leads-high-profile-us-team-on-greenland-visit-13334797",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nuuk-greenland_6850476.png?20250308173411",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-24 04:26:00",
        "Headline": "Usha Vance will lead the delegation that includes White House national security adviser Mike Waltz and energy secretary Chris Wright.",
        "Content": " A high-profile US delegation will visit Greenland this week as President Donald Trump continues to threaten to annexe the strategic Danish territory.  Usha Vance, wife of vice-president JD Vance, will lead the delegation that includes White House national security adviser Mike Waltz and energy secretary Chris Wright. Mr Waltz and Mr Wright plan to visit the Pituffik space base, the US military base in Greenland. The team will also watch a national dogsled race and visit historical sites. Brian Hughes, spokesperson for the White House national security council, said the US team is \"confident that this visit presents an opportunity to build on partnerships that respects Greenland's self-determination and advances economic cooperation\". \"This is a visit to learn about Greenland, its culture, history, and people and to attend a dogsled race the United States is proud to sponsor, plain and simple,\" Mr Hughes added. Mr Trump has made the US annexation of Greenland a major talking point since taking office on 20 January. \n                  Why does Trump want to take over Greenland - and could he actually do it?\n                 \n                  Donald Trump says he thinks US will annex Greenland\n                 \n                  Greenland's slow independence party wins election in result seen as rejection of Trump's interference\n                 Read more: Do people in Greenland want to be part of the US? Greenland's strategic location and rich mineral resources would benefit the US. It also lies along the shortest route from Europe to North America, and is vital for the US ballistic missile warning system. The governments of both Greenland and Denmark have voiced opposition to such a move. Greenland Prime Minister Mute Egede reacted angrily to news of the US visit, saying his nation has tried \"all diplomatic and democratic options\", but Mr Trump's mission is \"to own and control Greenland\". Mr Egede told newspaper Sermitsiaq: \"Every minute counts to ensure that the Americans' dream of annexing our country does not become a reality.\" He said, \"until recently\" they could \"safely trust\" Washington, but \"that time is over\". US leadership, he said, is \"completely and utterly indifferent to what we have stood together on so far, because now it is only a matter of them taking over our country over our heads\". He told Greenland's international allies that \"hiding in a small corner and almost whispering that they support us has no effect\". \"If they do not speak out loudly about how the USA is treating Greenland, the situation will escalate day by day, and the American aggression will increase,\" he added. Read more from Sky News:Gisele Pelicot's son relives moment he discovered his father was a monsterCanadian PM vows Trump will not 'break us' as he calls snap election Danish Prime Minister Mette Frederiksen said in a written statement reacting to news of the visit that \"this is something we take seriously\". She said Denmark wants to cooperate with the US, but it should be cooperation based on \"the fundamental rules of sovereignty\". Referring to Ms Vance's upcoming trip, Tom Hoyem, former Danish minister for Greenland, told Sky News it is \"politically incorrect and provocative to make such a visit\" just as Greenlanders prepare to go to the polls for local elections on 1 April. He said \"Greenland is an open country, of course the lady [Ms Vance] can arrive and she can look at the dogsled run as she would like\", but \"the timing is really bad and in this way it is a provocation\". Mr Hoyem said there was a need for talks to avoid \"unnecessary provocation\". \"The kingdom of Denmark with Greenland and the Faroe islands, that's a sovereign kingdom and no one can try and take [it] over,\" he added."
    },
    {
        "title": "Why does Trump want to take over Greenland - and could he actually do it?",
        "description": "Since winning re-election, president-elect Donald Trump has expressed an interest in acquiring Greenland.",
        "url": "https://news.sky.com/story/greenland-why-does-trump-want-buy-the-arctic-island-and-could-he-actually-do-it-13285350",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-donald-trump-jr-greenland_6794227.jpg?20250108104747",
        "type": "US",
        "Author": "Lauren Russell",
        "Date Published": "2025-03-24 11:33:00",
        "Headline": "Mr Trump's aims to take control of Greenland coincides with his repeated claims that Canada should become the 51st state of the US - and him directing the US military to draw up options to achieve his goal of \"reclaiming\" the Panama Canal.",
        "Content": "\n          News reporter\n              @laurenvrussell\n  Since winning re-election, president-elect Donald Trump has expressed an interest in acquiring Greenland. His aims surrounding Greenland coincide with his repeated claims that Canada should become the 51st state of the US and him directing the US military to draw up options to achieve his goal of \"reclaiming\" the Panama Canal. Here is everything you need to know about the US president's proposals and if they could actually happen. National security purposes Greenland is the world's largest island and a semiautonomous territory of Denmark. With a population of 57,000, it has been part of Denmark for 600 years. It is also a founding member of NATO and home to a large US military base. Straddling the Arctic circle between the US, Russia and Europe, the island offers a unique geopolitical advantage that America has eyed for more than 150 years. It's even more valuable as the Arctic opens up more to shipping and trade. The idea of purchasing Greenland is not a new one for Mr Trump, who raised it as a possibility during his first term in office. But he has since reiterated the benefit it could have for America's national security. \"We need greater national security purposes,\" Mr Trump has said in the past. \"I've been told that for a long time, long before I even ran [for president]. \"People really don't even know that Denmark has any legal right to it, but if they do, they should give it up because we need it for national security.\" Mr Trump's claim to the island coincided with a visit by his son, Donald Trump Jr, back in January. Usha Vance, wife of Vice President JD Vance, will also lead a US delegation to the island which the White House said had been organised as a chance to learn about Greenland. The delegation will \"visit historical sites, learn about Greenlandic heritage, and attend the Avannaata Qimussersu, Greenland's national dogsled race\".  Rich in natural resources As well as its location, Greenland holds rich deposits of various natural resources. Locked inside the island are valuable rare earth minerals needed for telecommunications, as well as uranium, billions of untapped barrels of oil and a vast supply of natural gas that used to be inaccessible but is becoming less so. Many of the same minerals are currently mostly supplied by China, so other countries such as the US are interested in tapping into available resources closer to home. A front-row seat to the climate crisis More than the oil, gas or minerals, Greenland has a lot of ice - and provides a front-row seat to the globe's climate crisis. If that ice melts, it would reshape coastlines across the globe and has the potential to dramatically shift weather patterns.  In fact, Greenland holds enough ice that if it all melts, the world's seas would rise by 24ft (7.4m). Greenland also influences hurricane and winter storm activity. Because of its mountains of ice, it has the power to change patterns in the jet stream, which brings storms across the globe and dictates daily weather. Often, especially in winter, a blocking system of high pressure off Greenland causes Arctic air to plunge to the west and east, sweeping across North America and Europe, winter weather expert Judah Cohen told the Associated Press. British politician and security expert Mike Martin explained on X that the seas between Greenland and the UK - which has Iceland in the middle - are \"utterly vital\" for NATO. He explained that during the Cold War, the UK would often have 50 ships stationed in the area to look after the Greenland-Iceland-UK (GIUK) gap - which is the \"only sensible route\" that the Russian northern fleet has to get into the Atlantic Ocean. Both the UK and Denmark continue to have a shared security interest in the gap. The UK government website states that as part of the UK's Arctic Policy Framework, it will continue to develop military capability in collaboration with Denmark, to allow it to operate in the region and in order to safeguard UK interests and those of its allies. However, if the territory is taken over by the US, this collaboration could be affected. British Foreign Secretary David Lammy told Sky News at the beginning of the year that the comments were \"classic Donald Trump\". \"He came in very clearly saying he was going to work for working people,\" Mr Lammy said. \"And, he sees American national economic security as centring that. \"That is why he's raising issues, in relation to the Panama Canal, and I suspect to Greenland.\" He added that behind Mr Trump's \"intensity\", there are \"actually quite serious national security and economic issues\". Ever since Mr Trump expressed an interest in Greenland the country's government has opposed him. As the country headed to the polls in early March to elect a new prime minister, Mr Trump promised \"billions of dollars\" in investment telling them he will \"make you rich\".  The Demokraatit party won 30% of the vote in the election, handing Jens-Frederik Nielsen the win. Although his party favours independence, it prefers a slow move away from Denmark. Mr Nielsen told Sky News' international affairs editor Dominic Waghorn that he hopes his victory sends a clear message to Mr Trump that \"we are not for sale\". \"We don't want to be Americans. No, we don't want to be Danes. We want to be Greenlanders. And we want our own independence in the future. And we want to build our own country by ourselves, not with his hope,\" he said. Ahead of the delegation visit led by Mrs Vance, all five parties in Greenland's parliament issued a joint statement last week rejecting Mr Trump's remarks. Danish Prime Minister Mette Frederiksen has also said she did not believe the US would use military or economic power to secure control over Greenland. \"Greenland is not for sale,\" Ms Frederiksen said, adding: \"We need to stay calm and stick to our principles.\" Referring to the US as Denmark's \"most important and closest ally\" she said she welcomed the US taking a greater interest in the Arctic region, but said it would have to be done in a way that is \"respectful of the Greenlandic people\". Denmark has recognised Greenland's right to independence at a time of its choosing. French foreign minister Jean-Noel Barrot also weighed in on the matter earlier this year, saying that the European Union would not let \"other nations of the world attack its sovereign borders, whoever they are\". \"If you're asking me whether I think the United States will invade Greenland, my answer is no. But have we entered intoa period of time when it is survival of the fittest? Then my answer is yes,\" Mr Barrot said. In Germany, Chancellor Olaf Scholz said the principle of inviolability of borders applies to every country no matter how powerful. \"Borders must not be moved by force,\" Mr Scholz said in a reaction to Mr Trump's remarks, although he did not mention the president by name. The Panama Canal is a waterway that connects the Caribbean Sea with the Pacific Ocean. It acts as a shortcut route, saving time and costs for transporting goods, according to the Embassy of Panama website. Under the Jimmy Carter administration, control of the canal was handed from the US to Panama in 1979, with the US ending its joint partnership in controlling the strategic waterway in 1999. It is now administered by the Panama Canal Authority, an autonomous government entity, although a Hong Kong-based contractor operates two ports connected to it. Mr Trump has claimed that the US is being treated unfairly when it is \"overcharged\" higher rates for its ships to sail the canal than those of other countries. He claimed Panama was in \"violation\" of a deal with the US and that \"China is basically taking it over\". \"We gave the Panama Canal to Panama. We didn't give it to China,\" Mr Trump said on Tuesday. \"They've abused that gift.\" Panamanian President Jose Raul Mulino denied in a video statement last month that China has influence over the canal and shot down the idea of the US taking back authority over it. \"Every square metre of the canal belongs to Panama and will continue to be so,\" he said.  Mr Trump's repeated attacks on Canada's sovereignty has infuriated leadership in the country. He has claimed that the country \"only works as a state\" adding the US doesn't need any of their resources such as lumber or energy. \"As a state, it would be one of the great states anywhere,\" Mr Trump said. \"This would be the most incredible country, visually. If you look at a map, they drew an artificial line right through it, between Canada and the US. Just a straight, artificial line. Somebody did it a long time ago, many many decades ago. Makes no sense. It's so perfect as a great and cherished state.\"  Relations between the two countries have since dwindled, with new Canadian Prime Minister Mark Carney saying Canada faces the most \"significant crisis of our lifetimes\" because of the president's \"threats to our sovereignty\". Mr Carney, who is the former governor of the Bank of England, has called a snap election after the resignation of Justin Trudeau. The election on 28 April is likely to come down to who is best equipped to take on Mr Trump. The incoming president has offered few details as to how he might carry out his plans to grow the US footprint. He told Congress at the beginning of March that \"America is back\", adding that the American Dream was bigger and better than ever before. In reality, if Greenland becomes independent, it could choose to become associated with the US. One option could be to form a so-called \"free association\" pact with America, similar to the status of Pacific island nations Marshall Islands, Micronesia and Palau. Mr Trump has also suggested he would impose tariffs on Denmark if it resists his offer to purchase the island. This could make things difficult for Danish companies, particularly drugmakers like Novo Nordisk, which sells the weight loss drug Wegovy and the type 2 diabetes medicine Ozempic. Eswar Prasad, a professor of trade policy at Cornell University, told investment magazine Barron's that the Trump administration could tailor specific tariffs to target products made by Danish companies regardless of where they are manufactured. On Canada, Congress would first have to approve accepting a new state. Canada would likely have to have a referendum to gauge voters' interests in joining the US before more detailed aspects of the process could begin. If Canada were to join the US - a highly unlikely prospect - its population of 41.6 million would make it the largest state, exceeding California's 39.4 million residents. It would also need two senators and 55 House seats - which would have huge effects on US presidental elections."
    },
    {
        "title": "Snow White: Blighted by controversy, but Disney live-action remake still tops box office",
        "description": "Disney's live-action remake of Snow White And The Seven Dwarves has topped the North American box office chart, despite a controversy-packed run-up to the film's release.",
        "url": "https://news.sky.com/story/snow-white-blighted-by-controversy-but-disney-live-action-remake-still-tops-box-office-13334949",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-disney-gal-gadot-snow-white_6862607.jpg?20250320213227",
        "type": "US",
        "Author": "Bethany Minelle",
        "Date Published": "2025-03-24 11:41:00",
        "Headline": "Snow White's marketing campaign has been an absolute disaster, and one review dubbed the live-action remake \"exhaustingly awful\". But weekend box office charts show that people still turned out to watch.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Disney's live-action remake of Snow White And The Seven Dwarves has topped the North American box office chart, despite a controversy-packed run-up to the film's release. Based on the 1937 classic that established Disney's name as an industry leader, Snow White took an estimated $43m (£33.1m) domestically, and $87.3m (£67.3m) worldwide, according to Box Office Mojo. In the UK and Ireland, the film took £3.85m, accounting for 43% of all tickets sold across its three-day opening weekend. For comparison, Disney's Mufasa: The Lion King, which came to cinemas in December, took $35m domestically (£27m). It's now gone on to take over $700m (£540m) globally. Meanwhile, Disney's 2019 live-action Dumbo, directed by Tim Burton, took $45m (£35m) domestically in its opening weekend. It has since taken over $350m (£270m) worldwide. Snow White has not performed well in China, only making it to seventh place in the Chinese box office charts and grossing less than $1m (£770,000) over its opening, according to EntGroup's China Box Office website. Reviews for the movie have been mixed, with The Guardian calling it an \"exhaustingly awful reboot\" and The Observer similarly judging it to be \"toe-curlingly terrible\". \n                  Snow White: Little people feel 'erased' by Disney's use of CGI instead of real actors\n                 \n                  Sterling K Brown on Black Panther, taping up his basketball shoes and Paradise\n                 \n                  Disney being sued for billions over Moana claims\n                 The Independent wasn't a fan of the \"uncanny CGI caricatures\" which it said were reminiscent of 2004 movie The Polar Express, a sentiment echoed by Empire which called the reimagined dwarves an \"unholy VFX disaster\". The Daily Mail called it \"painfully muddle-headed\", but gave Zegler the thumbs up, highlighting her \"oodles of talent\", while The New York Post said it was \"mediocre\" and unmemorable. Some US outlets have given a more favourable critique, with Variety calling it \"one of the better live-action adaptations of a Disney animated feature,\" and The Hollywood Reporter judging it \"mostly captivating\". Reviews aggregator Rotten Tomatoes gives the movie a 44% critic score - which translates to \"rotten\" - however the audience score on the site's \"Popcornometer\" is currently at 74%, rating it \"fresh\".  Dubbed 'woke' and plagued with speculation The movie had a muted marketing campaign, with no UK premiere and reduced US press opportunities. Costing around $250m to make, the film had been flagged as a potential tent-pole movie (a film that is expected to be very successful and support a range of merchandise or spin-off opportunities) for Disney early on. But aspirations faded as it approached release as it was hit by controversy after controversy. Early on, Snow White was labelled \"woke\" due to its casting of Latina actress Rachel Zegler, who is of Colombian-Polish descent, in the lead role. Zegler also faced a backlash after suggesting the early version of the film had content that was unsuitable for the 21st century - namely the fact the prince \"literally stalks\" Snow White. There was then speculation as to whether Zegler got on with Israeli actress Gal Gadot, who plays the evil queen, as they have previously expressed very different views over the Israel-Hamas war. The use of CGI to create the seven dwarf characters, thus replacing the potential for little people to take up the roles, has left disability activists to accuse the movie of \"erasing\" them from the narrative. Ahead of the film's release, comedian, model and content creator Fats Timbo told Sky News she believed Disney missed a golden opportunity to educate children during what was likely to be their first encounter with someone with dwarfism. Snow White is in cinemas now."
    },
    {
        "title": "Ukraine war ceasefire talks begin in Saudi Arabia as Russia continues attacks",
        "description": "Negotiations spearheaded by a US delegation for a partial Russia-Ukraine ceasefire are underway in Saudi Arabia, the Kremlin has said.",
        "url": "https://news.sky.com/story/ukraine-war-ceasefire-talks-begin-in-saudi-as-russia-continues-attacks-13334818",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ukraine-donetsk_6865558.jpg?20250324100538",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-24 07:12:00",
        "Headline": "The US says a maritime ceasefire in the Black Sea will be the primary aim of the talks in Riyadh.",
        "Content": "Negotiations spearheaded by a US delegation for a partial Russia-Ukraine ceasefire are underway in Saudi Arabia, the Kremlin has said. The talks in Riyadh between a US delegation and Russian negotiators started on Monday morning. It follows a round of discussions between US and Ukrainian negotiators, Russian media reported. Reaching a maritime ceasefire in the Black Sea will be the primary aim of the talks, the White House said, to allow for the free flow of shipping. Follow the latest updates on Ukraine White House national security adviser Mike Waltz told CBS's Face the Nation on Sunday the teams will also discuss \"the line of control\" between the two countries, which he described as \"verification measures, peacekeeping, freezing the lines where they are\". He said \"confidence-building measures\" were being discussed, including the return of Ukrainian children taken by Russia. It comes after US President Donald Trump's special envoy Steve Witkoff dismissed UK Prime Minister Sir Keir Starmer's plans as a \"combination of a posture and a pose\" in an interview with pro-Trump journalist Tucker Carlson. The prime minister has suggested a \"coalition of the willing\", made up of several European and NATO countries, could provide boots on the ground in Ukraine after a ceasefire. Mr Witkoff, who is leading the US ceasefire negotiations with Ukraine and Russia, also accused the prime minister of adopting the \"simplistic\" notion that leaders \"have all got to be like Winston Churchill\". \"The Russians are going to march across Europe. I think that's preposterous. We have something called NATO that we did not have in World War Two,\" he said. Mr Witkoff recently met with the Russian leader in Moscow and told Carlson he \"liked\" Russian President Vladimir Putin, who in February 2022 shocked the world by launching a land, air and sea invasion of Ukraine. \"I don't regard Putin as a bad guy,\" Mr Witkoff said. \"I thought that he was straight up with me.\" It comes as Russia launched its third consecutive overnight attack on Kyiv, wounding one person and damaging houses in the region, according to the city's governor. Ukraine's air force said on Monday it shot down 57 out of 99 drones. It follows a weekend of deadly strikes on Ukraine. Moscow correspondent Kyiv might be furious at Steve Witkoff's comments over the weekend but in Moscow, they're lapping them up. The US envoy's interviews with Fox News and Tucker Carlson have made front page news, prompting talk of \"mutual attraction\" between the White House and the Kremlin. That's because Mr Witkoff repeated many of the lines we normally hear coming from Moscow: that Vladimir Putin \"wants peace\"; that European fears of further Russian invasions are \"preposterous\"; that the \"root cause\" of the war is not Russian aggression, but issues of Ukrainian nationhood. Moscow can barely believe its luck. American and Russian officials are now speaking \"the same language\", according to daily Nezavisimaya Gazeta, which says Mr Witkoff's comments show that Russia's interests are \"justified\" and will be taken into account by the US.  Another newspaper, Kommersant, talks excitedly of Mr Witkoff's \"enthusiastic assessments\" of President Putin. But it's Mr Witkoff's remarks about Russia's territorial claims that are receiving the most attention.  The former property mogul said that most people in the Russian-controlled areas of eastern Ukraine wanted to live under Russian rule, citing Moscow-organised referenda that were condemned as shams by the UN.  The comments were pounced on by Margarita Simonyan, the head of state broadcaster RT, who described them as the \"main message\" of Mr Trump's Ukraine policy.  Writing on Telegram, she suggested the ground was being prepared for recognition of Russia's territorial claims. Read more from Sky News:Gisele Pelicot's son relives moment he discovered his father was a monsterJD Vance's wife leads high-profile US team on Greenland visitCanadian PM vows Trump will not 'break us' as he calls snap election Officials said at least seven people were killed in the country after Moscow launched a series of drone attacks on Saturday night. The attacks struck the Kharkiv, Sumy, Chernihiv, Odesa and Donetsk regions, as well as the capital.  Kyiv mayor Vitali Klitschko described the attack as \"massive\", adding emergency services were dispatched to several districts. Three people, including a five-year-old child, were killed and 10 others were injured in Kyiv, the city's military administration said."
    },
    {
        "title": "Trump trade war: Hopes rise for limited escalation",
        "description": "Global financial markets are giving a cautious welcome to reports the Trump administration is to row back on elements of its threatened trade war escalation.",
        "url": "https://news.sky.com/story/trump-trade-war-hopes-rise-for-limited-escalation-13334872",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-department-of-education_6862706.jpg?20250320225410",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-03-24 09:37:00",
        "Headline": "There are plenty of developments to digest as speculation mounts that the big bazooka tariff measures threatened for 2 April may now be significantly watered down.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Global financial markets are giving a cautious welcome to reports the Trump administration is to row back on elements of its threatened trade war escalation. Separate US news organisations said over the weekend that sector-specific tariffs, which the president had warned would come into effect on 2 April, were now unlikely. If true, it would mean tariffs of up to 25% on cars, semiconductors and pharmaceutical goods would not take effect. Money latest: Supermarket 'price war' heats up Bloomberg News was first to report the development, which followed fierce lobbying from the industries concerned. The Wall Street Journal, citing a Trump administration official, also reported the threatened import charges were to be withdrawn, at least for a further temporary period. They added, however, that so-called \"reciprocal\" tariffs in response to duties imposed on US goods to date were still planned for 2 April. \n                  Ukraine war: Russia accused of 'hollow' peace talks as strike injures dozens including children\n                 \n                  Trump officials discussing war plans on messaging app lambasted as 'amateur hour'\n                 \n                  US plan to bomb Yemen's Houthis accidentally shared with journalist Jeffrey Goldberg in group chat\n                  There is speculation tariffs could be narrowed to target the countries, or blocs, with the greatest trade imbalances with the United States. The White House has yet to comment officially. But the remarks were seen as further hope of a climbdown by financial markets, as they built on earlier comments by US Treasury Secretary Scott Bessent that indicated a possible delay to the reciprocal element as details continued to be ironed out. Further US talks with China are planned, while the European Union said last week it may delay implementing its threatened response to US steel and aluminium tariffs.  Any signs for optimism are being seized upon by investors. US stocks and the dollar have suffered particularly in recent weeks amid fears the trade war could spark recession in the world's largest economy and inflict hefty economic damage elsewhere. The latest economic indicators suggested harm for the UK already after the universal tariffs on metals came into effect earlier this month. Data from S&P Global showed weak international demand resulted in the fastest decline in manufacturing export sales since August 2023 during March - and the steepest downturn in production volumes for almost one-and-a-half years. Stock markets were up across the board on Monday and US futures pointed to a positive open on the back of the reported climbdown. Read more:Trump trade war expands with 25% tariffs on all steel and aluminium importsHow tariffs are wreaking havoc in UK metals industry In Europe, the FTSE 100 rose by 0.5% in early deals, while there were similar gains for the DAX in Germany. Russ Mould, investment director at AJ Bell, said of the market mood: \"An uncertain outlook for many countries is problematic from an economic perspective and it's bad for investors who are struggling to know how they should position portfolios. Constant chopping and changing could result in financial markets feeling like they've got seasickness. \"2025 is fast becoming the year of the economic slowdown. There is a high chance that businesses pause investment until they know the lay of the land and consumers continue to be cautious with their spending. Fortunately, more information could be just around the corner. \"Trump says 2 April will be 'Liberation Day' for the US, whereby he will unveil reciprocal tariffs on countries deemed to be giving the US a bad deal on trade. Interestingly, markets haven't braced themselves for the worst on this news. Instead, there is chatter that Liberation Day might not be so punishing as previously thought.\""
    },
    {
        "title": "Airlines threaten Heathrow with legal action",
        "description": "A body representing more than 90 airlines using Heathrow Airport has threatened to take legal action if a settlement over the costs they incurred from Friday's day-long closure is not reached. ",
        "url": "https://news.sky.com/story/airlines-threaten-heathrow-with-legal-action-13335133",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-heathrow-plane_6865974.jpg?20250324184037",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-24 17:18:00",
        "Headline": "An independent inquiry has been called for by the body representing 90 airlines including BA and Virgin Atlantic. ",
        "Content": " A body representing more than 90 airlines using Heathrow Airport has threatened to take legal action if a settlement over the costs they incurred from Friday's day-long closure is not reached.  The chief executive of Heathrow Airline Operators' Committee Nigel Wicking told Sky News he hoped the matter could be \"amicably settled at some point in time\" but said, \"if we don't get good enough recourse and repayment in terms of the costs, then yes, there might be a case for legal action\". \"I would hope not. But in some of these situations that's the only course once you've gone through everything else\", he added. Money blog: Price of a pint is about to hit big milestone Heathrow, Europe's largest airport, was closed from the early hours of Friday morning after a fire at a major electricity substation hit electricity supplies. No planes were allowed to take off or land, causing flight diversions. About 1,300 flights were impacted with roughly 250,000 passengers affected. Some flights resumed on Friday evening but airlines faced difficulties and passengers were disrupted due to airline crew being in different parts of the world. \n                  National Grid boss claims Heathrow had 'enough power' despite shutdown\n                 \n                  Chancellor says Heathrow shutdown shows need for increased resilience in UK critical infrastructure\n                 \n                  Chaos in the skies: 'Nightmare' Heathrow shutdown in numbers\n                 Mr Wicking also called for an independent investigation of what happened and why recovery took so long. \"Airlines have a regulatory duty to take care of their passengers,\" he said. \"But in this particular case, we do feel that it was another party that caused the situation.\" Energy secretary Ed Miliband said he was working with energy regulator Ofgem and commissioned the National Energy System Operator to investigate the fire at the substation incident. 'Appalling' communication The head of the airline group representing companies such as British Airways and Virgin Atlantic was also critical of Heathrow's communication. He said it was \"appalling\" that airlines had to wait until midnight on Friday to confirm terminal two would open on Saturday. The situation was \"not justifiable given the amount of money that has been spent on Heathrow over the years and the fact that it is the most expensive airport in the world\". The hit to airlines Airlines and suppliers alone could face costs of \"at least\" £20m for the day of halted operations, said travel expert Paul Charles, a former Virgin Atlantic communications director and chief executive of travel consultancy The PC Agency. The figure includes an estimate of expenses for passengers, crew accommodation, additional transport, fuel and other costs for the aircraft themselves.  Analysts at investment bank Jefferies said compensation for delays could knock 1% to 3% off profits at BA and Aer Lingus parent company IAG. But the outage could be considered a force majeure event, meaning passengers would not be entitled to compensation, according to the head of the Spanish airlines association Javier Gandara. Heathrow response A spokesperson said: \"This was an unprecedented issue which began with a fire at an off-airport substation, in less than 24 hours the entire airport was rebooted from a standing start and we delivered a full schedule from Saturday onwards. \"There are two reviews into the systems and response both at Heathrow and with the wider grid infrastructure. We will support these and lessons will be learned where needed. \"Every penny we invest in our airport infrastructure is approved by airlines and our regulator. On a project-by-project basis, they oversee and influence how we build and maintain Heathrow.\" Its CEO Thomas Woldbye said in a post on LinkedIn today he was \"proud\" of how the airport responded to the outage. He said: \"So, was I proud of the situation we found ourselves in? Of course not. \"But I am incredibly grateful for, and proud of, what was achieved to get us out of the situation in such a short amount of time by teams of people we all rely on across the entire airport eco-system, but who rarely get the credit they deserve.\" Mr Woldbye previously said a backup transformer failed during the power outage, meaning systems had to be closed in line with safety procedures so power supplies could be restructured from two remaining substations. Transport Secretary Heidi Alexander said the airport took the decision to suspend flights because it needed to reboot systems after switching to a different power supply."
    },
    {
        "title": "List of closures as hundreds at risk of redundancy due to Morrisons shutting cafes, meat counters and convenience stores",
        "description": "Roughly 365 jobs could be lost at Morrisons shops across Britain as cafes and in-store services are to close.",
        "url": "https://news.sky.com/story/list-of-closures-as-hundreds-at-risk-of-redundancy-due-to-morrisons-shutting-cafes-meat-counters-and-convenience-stores-13335075",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-morrisons-leeds-supermarket_6645271.jpg?20240802073500",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-03-24 14:48:00",
        "Headline": "Despite closing cafes in areas facing \"specific local challenges\", Morrisons said its remaining sites had a \"bright future\" and it was working with third parties to provide a \"specialist offer\" in some locations.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Roughly 365 jobs could be lost at Morrisons shops across Britain as cafes and in-store services are to close. Those hundreds of roles are at risk of redundancy, the supermarket chain said, as it is to close 52 cafes, all 18 market kitchens food-to-go sites, 17 convenience stores, 13 florists, 35 meat counters, 35 fish counters and four pharmacies. Some staff working at these services will be redeployed elsewhere in the business, Morrisons said. Money blog: Price of a pint is about to hit big milestone Morrisons did not say exactly when these closures were taking place but that the operations would be closed \"over the next few months\". The cuts come as \"costs of operations are significantly out of line with usage, volumes or the value that customers place on them\", the supermarket chain said. Despite shuttering 52 of its cafes, Morrisons said this offering \"has a bright future\" in most locations. In 2021 there were 406 Morrisons cafes. \"A minority have specific local challenges and in those locations, regrettably, closure and re-allocation of the space is the only sensible option\", Morrisons chief executive Rami Baitieh said. Where some cafes are closing, the supermarket said it planned to work with \"third parties to provide a relevant specialist offer\".  List of closures The cafes due to close are: Bradford, ThornburyPaisley, Falside RoadLondon, QueensburyPortsmouthNewcastle, Great ParkBanchory, North Deeside RoadFailsworth, Poplar StreetBlackburn, Railway RoadLeeds, Swinnow RoadLondon, Wood GreenKirkham, Poulton StreetLutterworth, Bitteswell RoadBirmingham, StirchleyLeeds, HorsforthLondon, ErithEast Sussex, CrowboroughBellshill, John StreetDumbarton, Glasgow RoadEast Kilbride, LindsayfieldEast Kilbride, StewartfieldGlasgow, NewlandsLargs, Irvine RoadTroon, Academy StreetWishaw, Kirk RoadNewcastle Upon Tyne, CowgateNorthampton, Kettering RoadBromsgrove, Buntsford Industrial ParkSolihull, Warwick RoadBrecon, Free StreetCaernarfon, North RoadIpswich, HadleighLondon, Hatch EndHigh Wycombe, Temple EndLeighton Buzzard, Lake StreetLondon, StratfordSidcup, Westwood LaneWelwyn Garden City, Black Fan RoadWarminster, Weymouth StreetOxted, Station YardReigate, Bell StreetBorehamwood, Stirling WayWeybridge, Monument HillBathgate, Linkston WayErskine, Bridgewater Shopping CentreGorleston, Blackwell RoadDeeside, Connah's QuayMansfield, Woodhouse CentreHalifax, EllandGloucester, Metz WayWatford, Ascot RoadLittlehampton, WickHelensburgh, Cardross Road Morrisons daily convenience stores being shut are: Gorleston, Lowestoft RoadPeebles, Old TownShenfield, Hutton RoadPoole, Waterloo EstateTonbridge, Higham LaneRomsey, The CornmarketStewarton, Lainshaw StreetSelsdon Featherbed LaneHaxby VillageGreat Barr, Queslett RoadWhickham, Oakfield RoadWeston-super-Mare, WorleGoring-By-Sea, Strand ParadeWoking, Westfield Road Wokingham, Peach StreetExeter, Sidwell StreetBath, Moorland Road The union representing Morrisons workers - the Union of Shop, Distributive and Allied Workers (USDAW) - said it would be supporting its members. Darren Matthews, USDAW National Officer said: \"Our priority is to keep as many employed in the business as possible. \"We welcome Morrisons' early indication that the majority of staff affected by the changes are expected to be deployed to roles elsewhere in the business. \"USDAW is also maintaining regular talks with the company on these proposals where we'll be able to raise concerns, challenge and ask serious questions about the company's business case.\""
    },
    {
        "title": "National Grid boss claims Heathrow had 'enough power' despite shutdown",
        "description": "The chief executive of National Grid has claimed that Heathrow Airport had enough power from other substations despite Friday's shutdown.",
        "url": "https://news.sky.com/story/national-grid-boss-claims-heathrow-had-enough-power-despite-shutdown-13334787",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-heathrow-airport-fire_6864202.jpg?20250322155749",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-24 01:43:00",
        "Headline": "John Pettigrew, the chief executive of National Grid, said there were two other substations \"always available for the distribution network companies and Heathrow to take power\".",
        "Content": "The chief executive of National Grid has claimed that Heathrow Airport had enough power from other substations despite Friday's shutdown. Around 1,300 flights were affected after a fire knocked out an electricity substation in Hayes on Thursday evening. Operations were not able to resume until Friday evening. John Pettigrew from National Grid said there were two other substations \"always available for the distribution network companies and Heathrow to take power\". In his first comments since the disruption, Mr Pettigrew told the Financial Times: \"There was no lack of capacity from the substations. \"Each substation individually can provide enough power to Heathrow.\" He added: \"Losing a substation is a unique event - but there were two others available. \"So that is a level of resilience.\" \n                  Airlines threaten Heathrow with legal action\n                 \n                  Chancellor says Heathrow shutdown shows need for increased resilience in UK critical infrastructure\n                 \n                  Chaos in the skies: 'Nightmare' Heathrow shutdown in numbers\n                 In response to the comments, a Heathrow Airport spokesperson said: \"As the National Grid's chief executive, John Pettigrew, noted, he has never seen a transformer failure like this in his 30 years in the industry. \"His view confirms that this was an unprecedented incident and that it would not have been possible for Heathrow to operate uninterrupted.  \"Hundreds of critical systems across the airport were required to be safely powered down and then safely and systematically rebooted. Given Heathrow's size and operational complexity, safely restarting operations after a disruption of this magnitude was a significant challenge.\" Speaking to Wilfred Frost on Breakfast this morning, Transport Secretary Heidi Alexander said the decision to suspend flights at Heathrow on Friday was taken by the airport because it needed to reboot systems after switching to a different power supply. She said she had had a conversation with Thomas Woldbye, the chief executive of Heathrow, on Friday morning. \"He told me that whilst there are multiple power supplies into the airport, the fire had created a very significant problem with respect to Terminals two and four specifically and that there had to be some reconfiguration of power supplies into the airport. \"That meant all the systems had to be turned off and all the systems had to be restarted again in a safe way.\" Mr Woldbye previously said a back-up transformer failed during the power outage, meaning systems had to be closed in accordance with safety procedures so power supplies could be restructured from two remaining substations. Read more:What will the economic impact be?How can Heathrow avoid another crisis?Heathrow shutdown in numbers But it has emerged that a report by consultancy firm Jacobs more than 10 years ago found a \"key weakness\" of Heathrow's electricity supply was \"main transmission line connections to the airport\". The document, published in 2014, stated \"outages could cause disruption to passenger, baggage and aircraft handling functions\", and \"could require closure of areas of affected terminals or potentially the entire airport\". In its appraisal of operational risk at the airport, Jacobs said provision of on-site generation and other measures to ensure resilient supply appeared \"to be adequate\" to enable Heathrow \"to withstand and recover from interruptions to supply\". The report added that the airport operated \"within risk parameters that are not excessive or unusual for an airport of its type\". Metropolitan Police counter-terrorism officers initially led the investigation but the force said the fire was not believed to be suspicious so the London Fire Brigade is now leading the probe which will focus on the electrical distribution equipment. Heathrow is Europe's largest airport, with more than 83.9 million passengers travelling through its terminals in 2024. Around 200,000 passengers were affected by Friday's closure."
    },
    {
        "title": "Trump trade war: Hopes rise for limited escalation",
        "description": "Global financial markets are giving a cautious welcome to reports the Trump administration is to row back on elements of its threatened trade war escalation.",
        "url": "https://news.sky.com/story/trump-trade-war-hopes-rise-for-limited-escalation-13334872",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-department-of-education_6862706.jpg?20250320225410",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-03-24 09:37:00",
        "Headline": "There are plenty of developments to digest as speculation mounts that the big bazooka tariff measures threatened for 2 April may now be significantly watered down.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Global financial markets are giving a cautious welcome to reports the Trump administration is to row back on elements of its threatened trade war escalation. Separate US news organisations said over the weekend that sector-specific tariffs, which the president had warned would come into effect on 2 April, were now unlikely. If true, it would mean tariffs of up to 25% on cars, semiconductors and pharmaceutical goods would not take effect. Money latest: Supermarket 'price war' heats up Bloomberg News was first to report the development, which followed fierce lobbying from the industries concerned. The Wall Street Journal, citing a Trump administration official, also reported the threatened import charges were to be withdrawn, at least for a further temporary period. They added, however, that so-called \"reciprocal\" tariffs in response to duties imposed on US goods to date were still planned for 2 April. \n                  Ukraine war: Russia accused of 'hollow' peace talks as strike injures dozens including children\n                 \n                  Trump officials discussing war plans on messaging app lambasted as 'amateur hour'\n                 \n                  US plan to bomb Yemen's Houthis accidentally shared with journalist Jeffrey Goldberg in group chat\n                  There is speculation tariffs could be narrowed to target the countries, or blocs, with the greatest trade imbalances with the United States. The White House has yet to comment officially. But the remarks were seen as further hope of a climbdown by financial markets, as they built on earlier comments by US Treasury Secretary Scott Bessent that indicated a possible delay to the reciprocal element as details continued to be ironed out. Further US talks with China are planned, while the European Union said last week it may delay implementing its threatened response to US steel and aluminium tariffs.  Any signs for optimism are being seized upon by investors. US stocks and the dollar have suffered particularly in recent weeks amid fears the trade war could spark recession in the world's largest economy and inflict hefty economic damage elsewhere. The latest economic indicators suggested harm for the UK already after the universal tariffs on metals came into effect earlier this month. Data from S&P Global showed weak international demand resulted in the fastest decline in manufacturing export sales since August 2023 during March - and the steepest downturn in production volumes for almost one-and-a-half years. Stock markets were up across the board on Monday and US futures pointed to a positive open on the back of the reported climbdown. Read more:Trump trade war expands with 25% tariffs on all steel and aluminium importsHow tariffs are wreaking havoc in UK metals industry In Europe, the FTSE 100 rose by 0.5% in early deals, while there were similar gains for the DAX in Germany. Russ Mould, investment director at AJ Bell, said of the market mood: \"An uncertain outlook for many countries is problematic from an economic perspective and it's bad for investors who are struggling to know how they should position portfolios. Constant chopping and changing could result in financial markets feeling like they've got seasickness. \"2025 is fast becoming the year of the economic slowdown. There is a high chance that businesses pause investment until they know the lay of the land and consumers continue to be cautious with their spending. Fortunately, more information could be just around the corner. \"Trump says 2 April will be 'Liberation Day' for the US, whereby he will unveil reciprocal tariffs on countries deemed to be giving the US a bad deal on trade. Interestingly, markets haven't braced themselves for the worst on this news. Instead, there is chatter that Liberation Day might not be so punishing as previously thought.\""
    },
    {
        "title": "Snow White: Blighted by controversy, but Disney live-action remake still tops box office",
        "description": "Disney's live-action remake of Snow White And The Seven Dwarves has topped the North American box office chart, despite a controversy-packed run-up to the film's release.",
        "url": "https://news.sky.com/story/snow-white-blighted-by-controversy-but-disney-live-action-remake-still-tops-box-office-13334949",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-disney-gal-gadot-snow-white_6862607.jpg?20250320213227",
        "type": "Business",
        "Author": "Bethany Minelle",
        "Date Published": "2025-03-24 11:41:00",
        "Headline": "Snow White's marketing campaign has been an absolute disaster, and one review dubbed the live-action remake \"exhaustingly awful\". But weekend box office charts show that people still turned out to watch.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Disney's live-action remake of Snow White And The Seven Dwarves has topped the North American box office chart, despite a controversy-packed run-up to the film's release. Based on the 1937 classic that established Disney's name as an industry leader, Snow White took an estimated $43m (£33.1m) domestically, and $87.3m (£67.3m) worldwide, according to Box Office Mojo. In the UK and Ireland, the film took £3.85m, accounting for 43% of all tickets sold across its three-day opening weekend. For comparison, Disney's Mufasa: The Lion King, which came to cinemas in December, took $35m domestically (£27m). It's now gone on to take over $700m (£540m) globally. Meanwhile, Disney's 2019 live-action Dumbo, directed by Tim Burton, took $45m (£35m) domestically in its opening weekend. It has since taken over $350m (£270m) worldwide. Snow White has not performed well in China, only making it to seventh place in the Chinese box office charts and grossing less than $1m (£770,000) over its opening, according to EntGroup's China Box Office website. Reviews for the movie have been mixed, with The Guardian calling it an \"exhaustingly awful reboot\" and The Observer similarly judging it to be \"toe-curlingly terrible\". \n                  Snow White: Little people feel 'erased' by Disney's use of CGI instead of real actors\n                 \n                  Sterling K Brown on Black Panther, taping up his basketball shoes and Paradise\n                 \n                  Disney being sued for billions over Moana claims\n                 The Independent wasn't a fan of the \"uncanny CGI caricatures\" which it said were reminiscent of 2004 movie The Polar Express, a sentiment echoed by Empire which called the reimagined dwarves an \"unholy VFX disaster\". The Daily Mail called it \"painfully muddle-headed\", but gave Zegler the thumbs up, highlighting her \"oodles of talent\", while The New York Post said it was \"mediocre\" and unmemorable. Some US outlets have given a more favourable critique, with Variety calling it \"one of the better live-action adaptations of a Disney animated feature,\" and The Hollywood Reporter judging it \"mostly captivating\". Reviews aggregator Rotten Tomatoes gives the movie a 44% critic score - which translates to \"rotten\" - however the audience score on the site's \"Popcornometer\" is currently at 74%, rating it \"fresh\".  Dubbed 'woke' and plagued with speculation The movie had a muted marketing campaign, with no UK premiere and reduced US press opportunities. Costing around $250m to make, the film had been flagged as a potential tent-pole movie (a film that is expected to be very successful and support a range of merchandise or spin-off opportunities) for Disney early on. But aspirations faded as it approached release as it was hit by controversy after controversy. Early on, Snow White was labelled \"woke\" due to its casting of Latina actress Rachel Zegler, who is of Colombian-Polish descent, in the lead role. Zegler also faced a backlash after suggesting the early version of the film had content that was unsuitable for the 21st century - namely the fact the prince \"literally stalks\" Snow White. There was then speculation as to whether Zegler got on with Israeli actress Gal Gadot, who plays the evil queen, as they have previously expressed very different views over the Israel-Hamas war. The use of CGI to create the seven dwarf characters, thus replacing the potential for little people to take up the roles, has left disability activists to accuse the movie of \"erasing\" them from the narrative. Ahead of the film's release, comedian, model and content creator Fats Timbo told Sky News she believed Disney missed a golden opportunity to educate children during what was likely to be their first encounter with someone with dwarfism. Snow White is in cinemas now."
    },
    {
        "title": "Former Spurs chief Buchler sails to rescue of Fairline Yachts",
        "description": "An investment vehicle founded by a former Tottenham Hotspur Football Club executive is sailing to the rescue of one of Britain's biggest luxury boat-builders with a pledge to keep its manufacturing operations in the UK.",
        "url": "https://news.sky.com/story/former-spurs-chief-buchler-sails-to-rescue-of-fairline-yachts-13334955",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-fairline-yachts_6812077.jpg?20250127133642",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-24 11:45:00",
        "Headline": "Bronzewood Capital, which is run by David Buchler, has emerged as the preferred bidder for Fairline Yachts, two months  after the Northamptonshire-based company fell into administration, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n An investment vehicle founded by a former Tottenham Hotspur Football Club executive is sailing to the rescue of one of Britain's biggest luxury boat-builders with a pledge to keep its manufacturing operations in the UK. Sky News has learnt that a consortium led by Bronzewood Capital, the private equity arm of advisory firm Buchler Phillips, has secured the status of preferred bidder for Fairline Yachts. Northamptonshire-based Fairline collapsed into administration in January, with insolvency practitioners Alvarez & Marsal (A&M) having conducted a rigorous sale process encompassing numerous parties with the objective of saving the company. Money latest: Pubs warn on pint cost milestone Sources close to Bronzewood, whose boss, David Buchler, was a vice-chairman of Spurs for years, said it planned to retain the bulk of Fairline's workforce as part of the deal. It was said to have had 250 employees at the time of A&M's appointment. The price being paid by Bronzewood was unclear on Monday, with a deal potentially being completed within the next week. \n                  Airlines threaten Heathrow with legal action\n                 \n                  List of closures as hundreds at risk of redundancy due to Morrisons shutting cafes, meat counters and convenience stores\n                 \n                  National Grid boss claims Heathrow had 'enough power' despite shutdown\n                 If concluded, the transaction will be Bronzewood's first since it was established last month. The yacht manufacturer's staff were briefed by the administrators that a preferred bidder had been chosen on Monday morning, according to a source close to the buyer. Fairline's collapse into administration came less than two months after it was sold to new investors, after DF Capital, the company's main lender, triggered the appointment of A&M. The business was sold in December by Hanover Investors to Arrowbolt Propulsion Systems, which was described in an announcement about the deal as a \"clean propulsion technology company\". Further details of that deal were unclear, although the statement in December said that Arrowbolt was appointing Peter Hamlyn, an experienced industry executive, as Fairline Yachts' new chief executive. Fairline Yachts' collapse came nearly two years after rival Princess Yachts was sold to investor KPS Capital Partners. Last autumn, Sunseeker, another big player in the sector, was sold to international investors Lionheart Capital and Orienta Capital Partners. A spokesperson for Bronzewood declined to comment, while A&M could not be reached for comment."
    },
    {
        "title": "Banks and Which? unite to demand fraud action from tech giants",
        "description": "Britain's biggest banks and most prominent consumer campaign group have joined forces in a rare show of unity to urge ministers to accelerate action to tackle Britain's online fraud epidemic.",
        "url": "https://news.sky.com/story/banks-and-which-unite-to-demand-fraud-action-from-tech-giants-13334929",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-hacker-cyberattack_6439404.jpg?20240131153309",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-24 11:21:00",
        "Headline": "The bosses of UK Finance and Which? have joined forces to call on ministers to force major tech and telecoms companies to share the cost of tackling Britain's online fraud pandemic, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Britain's biggest banks and most prominent consumer campaign group have joined forces in a rare show of unity to urge ministers to accelerate action to tackle Britain's online fraud epidemic. Sky News has obtained a joint letter from UK Finance, the main lobbying group for UK lenders, and Which? to three cabinet ministers including Rachel Reeves, the chancellor, and home secretary Yvette Cooper. Sent earlier this month, it argued technology and telecoms companies risked missing a government-imposed deadline to provide an update on their efforts to curb online fraud, and demanded more action was urgently needed. Money latest: Pubs warn on pint cost milestone They argued voluntary anti-fraud initiatives had so far \"had no meaningful impact on the scale of fraud\", citing data showing that nearly three-quarters of authorised push payment (APP) fraud - which involves criminals tricking people into transferring them money - originated online, with 16% starting on telecommunications networks. \"While some firms are making efforts, it's clear that not all of them are taking the problem seriously enough,\" the letter said. \"Before the election the Prime Minister highlighted the role the financial services sector plays in supporting customers who've been defrauded, including through the Payment Systems Regulator's (PSR) newly introduced mandatory reimbursement scheme for APP fraud victims. \n                  Airlines threaten Heathrow with legal action\n                 \n                  List of closures as hundreds at risk of redundancy due to Morrisons shutting cafes, meat counters and convenience stores\n                 \n                  National Grid boss claims Heathrow had 'enough power' despite shutdown\n                 \"He also outlined the need for big tech to step up and do more, calling for these firms to have a 'clear obligation' and 'financial incentive' to work with banks and law enforcement agencies to identify and stop fraudsters from targeting UK consumers. \"Which? and the banking sector wholeheartedly agree.\"  The groups referred to statistics showing that nearly £1.2bn was stolen through payment fraud in 2023 - equivalent to more than £2,000-per-minute. UK Finance and Which? called on ministers to ensure the cost of dealing with fraud was shared with tech and telecoms companies, and to \"accelerate the publication of a Fraud Strategy in which it sets out its plans to close gaps in consumer protections, especially in relation to online advertising outside of the scope of the [Online Safety Act], and to improve consumer protections from scam calls and texts\". Pressure has been growing for companies such as Meta - owner of Facebook, Instagram and WhatsApp - to contribute financially to the growing cost of online fraud, but the latest demand comes at an awkward time for ministers, with suggestions that big tech companies are to be spared an £800m digital tax amid negotiations aimed at staving off US President Donald Trump's tariffs on UK companies. \"The problem isn't just a financial one,\" the joint letter said. \"Fraud is a pernicious crime that can cause severe psychological and emotional harm to victims. \"Which? research from 2023 calculated the impact on the wellbeing of consumers who've fallen victim to online scams as equivalent to the cost of £7.2bn per year. \"Some victims have reported changes in their behaviour and a loss of trust in the online world. In the long run, this is likely to have knock-on effects on consumers' willingness to try new products and services, which is compromising economic growth.\" The two groups argued that while the Online Safety Act would prevent some online fraud being committed, ministers needed to go further. \"It is deeply concerning that the regulator [Ofcom] previously announced it was delaying the implementation of the codes for paid-for fraudulent advertising by over a year, meaning that the Act will not be fully enforced until 2027 at the earliest. \"The government must ensure Ofcom not only swiftly implements these codes, but that the codes themselves are sufficiently robust to effectively reduce the volume of fraudulent advertising online. \"We ask that you publicly call for these provisions to be in place as soon as practically possible to provide much needed reassurance to consumers.\""
    },
    {
        "title": "Rachel Reeves dismisses reports universal free school meals could be axed in cost-cutting drive",
        "description": "Rachel Reeves has pushed back at suggestions ministers are considering ending universal free school meals for primary school children.",
        "url": "https://news.sky.com/story/rachel-reeves-dismisses-reports-universal-free-school-meals-could-be-axed-in-cost-cutting-drive-13335009",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-rachel-reeves-eynsham_6813520.jpg?20250129122803",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-03-24 15:38:00",
        "Headline": "The chancellor says she does not \"recognise\" suggestions that means testing could be introduced in a bid to save money.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Rachel Reeves has pushed back at suggestions ministers are considering ending universal free school meals for primary school children. The chancellor said she did not \"recognise\" reports in The Times that Bridget Phillipson, the education secretary, had suggested making free school meals for younger pupils means tested instead of universal, as is the case for older children. Currently, all children in reception, year one and year two are entitled to free school meals, but according to the newspaper, Ms Phillipson made the recommendation as part of a package to reduce school spending by £500m. Politics latest: MPs get a pay rise A source close to Ms Phillipson told Sky News the reports were \"complete rubbish\" while the chancellor pointed to the government's decision to roll out free breakfast clubs in all primary schools from April. Ms Reeves told broadcasters: \"This government is rolling out free breakfast clubs in all primary schools from April. \"I don't recognise those claims that the government are looking at means-testing free school meals. \n                  Prove how many potholes you've fixed or lose cash, councils told\n                 \n                  Rachel Reeves is coming out fighting as she prepares to unveil billions in cuts\n                 \n                  Civil service to axe 10,000 jobs, Chancellor Rachel Reeves says - as she eyes cutting £2bn in costs\n                 \"In fact, this government are ensuring that all children get a good start to the day with a breakfast club, helping working parents and helping all children get a good start in life. \"That is what this government is determined to do after 14 years of Conservative failure.\" On Wednesday the chancellor is expected to deliver a spring statement that sets out savings of around £10bn, including the £5bn of welfare savings announced last week. Ms Reeves has also confirmed the civil service will be forced to cut £2bn a year by slashing administration costs by the end of the decade - although the savings will be used to protect frontline services from cutbacks. The proposed cuts follow a speech by the prime minister in which he announced the abolition of NHS England, the administrative body that runs the national health service, in a bid to slash red tape and cut costs. Today Sir Keir Starmer said the government was \"looking across the board\" at making cuts to unprotected departmental budgets. \"We're not going to alter the basics, but we are going to look across and one of the areas that we will be looking at is: can we run the government more efficiently?\" he told the BBC. As well as suggestions that free school meals could be curtailed, The Times also said Ms Phillipson had offered to stop funding for free period products in schools as well as dance, music and PE schemes. The source close to Ms Phillipson also denied those claims, saying: \"It's no secret that there are some tough choices coming down the track - but if people don't think Bridget is going to fight tooth and nail to protect programmes that support the most disadvantaged children, they don't know Bridget very well. \"Any suggestions those things are being 'offered up' is complete rubbish.\" At the same time, Ms Reeves has drawn criticism for hinting she could abolish or slash the digital services tax paid by tech companies while reducing benefits for ill and disabled people. Read more:Sir Keir Starmer rejects minister for men ideaWhat you need to know about the spring statement The levy, introduced in 2020 under former Conservative prime minister Rishi Sunak, ensures that digital companies with global sales exceeding £500m and with at least £25m worth of UK sales pay a tax of 2% on those UK sales. Liberal Democrat leader Sir Ed Davey said changing the policy would amount to \"appeasement\" of Donald Trump following reports the government could alter or abandon the tax in a bid to avoid punitive US tariffs.  Asked if the government was also considering abolishing or slashing the digital services tax paid by tech companies, Ms Reeves said: \"Digital services tax is hugely important, it brings in around £800m a year and ensures that companies pay tax in the country that they are operating in. \"So we will continue to make sure that businesses pay their fair share of tax, including businesses in the digital sector.\" Addressing the cuts that are expected in Wednesday's spring statement, the prime minister's official spokesperson said: \"The whole cabinet is focused on delivering high quality public services. \"This is shown in fixing the NHS and giving our kids the best opportunities and doing it to give taxpayers the best value for money.\" Turning to the suggestions the digital services tax could be axed, the spokesman added the UK would only do a deal with the US that was \"in this country's national interest\"."
    },
    {
        "title": "Downing Street responds to Trump envoy's criticism of Starmer's Ukraine plans",
        "description": "Sir Keir Starmer is focused on a \"durable peace\", Downing Street has said, after Donald Trump's envoy to Ukraine dismissed his \"coalition of the willing\" plan.",
        "url": "https://news.sky.com/story/downing-street-responds-to-trump-envoys-criticism-of-starmers-ukraine-plans-13335069",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-starmer-pm-defence_6862737.jpg?20250320234743",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-03-24 14:36:00",
        "Headline": "Downing Street defended Sir Keir's peace plan for Ukraine after a Trump envoy criticised it - but would not say if it was discussed in an overnight phone call with the US president.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Sir Keir Starmer is focused on a \"durable peace\", Downing Street has said, after Donald Trump's envoy to Ukraine dismissed his \"coalition of the willing\" plan. Steve Witkoff - who is leading the US ceasefire negotiations with Ukraine and Russia - described the prime minister's idea as \"posture and pose\" and accused him of adopting the \"simplistic\" notion that leaders \"have all got to be like Winston Churchill\". Politics Live: No 10 dismisses row over chancellor's Sabrina Carpenter freebie Pushed by the UK and France, the \"coalition of the willing\" could see troops from a number of European and NATO countries deployed to Ukraine as peacekeepers after a ceasefire in order to deter Vladimir Putin from launching further attacks on its neighbour. Sir Keir's official spokesman defended the idea following Mr Witkoff's comments, saying the PM remained \"focused on the outcome of durable peace in Ukraine\" and that he was working on the \"planning phase\" of the coalition. He wouldn't be drawn on whether the remarks were discussed in a phone call between the prime minister and Mr Trump on Sunday night. He said the focus of their conversation was an \"economic deal\" with the US, but \"we are engaging with the US at all levels on Ukraine\".  Mr Witkoff made the comments in an interview with pro-Trump journalist Tucker Carlson. He told Mr Carlson he recently met with the Russian president in Moscow and \"liked\" him. \"I don't regard Putin as a bad guy. I thought that he was straight up with me,\" he said. Chancellor Rachel Reeves defended the prime minister's \"diplomatic efforts\" in bringing together European leaders after being shown the clip on the BBC's Sunday with Laura Kuenssberg. She said she was not \"put off\" by Mr Witkoff's comments and any ceasefire \"needs to be enforced\" - and that's what Sir Keir was focused on. Ukraine war latest: Putin's gift to Trump revealed as ceasefire talks focus on Black Sea Lib Dem leader Sir Ed Davey was more direct in his criticism, saying: \"Trump's so-called 'special' envoy might dismiss British leadership as pointless posturing, but we know what it really is. \"Britain leading in Europe again, as we have done in the greatest moments of our nation's history.\" Read more from Sky News:PM says minister for men 'not the answer' to 'problem with boys'What you need to know about spring statement More than 30 countries now stand ready to enforce a peace deal in Ukraine as part of the \"coalition of the willing\", Downing Street said last week. This includes a \"significant number\" of countries that will provide troops on the ground, while others are ready to contribute logistics and background support. Ceasefire talks aiming to end the conflict in Ukraine began today in Saudi Arabia, and both nations are expected to hold indirect talks mediated by the US. The hope is that both sides will agree on pausing long-range attacks on energy facilities and civilian infrastructure."
    },
    {
        "title": "Sir Keir Starmer reveals he's been in touch with ex-England boss about issues raised in Netflix drama",
        "description": "Sir Keir Starmer has rejected the idea of creating a minister for men to combat some of the issues raised in the hit Netflix drama Adolescence.",
        "url": "https://news.sky.com/story/sir-keir-starmer-reveals-hes-been-in-touch-with-ex-england-boss-about-issues-raised-in-netflix-drama-13334870",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-starmer-keir_6865144.jpg?20250323173201",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-24 09:35:00",
        "Headline": "Sir Keir Starmer has been watching Adolescence with his teenage children, but says a \"minister for men\" is \"not the answer\" to the issues raised in the show. He says he's more persuaded by arguments put forward by Gareth Southgate.",
        "Content": "Sir Keir Starmer has rejected the idea of creating a minister for men to combat some of the issues raised in the hit Netflix drama Adolescence. Sir Keir said he was \"worried\" about the \"crisis in masculinity\" raised in the programme, which centres on a 13-year-old boy arrested for the murder of a young girl and the rise of incel culture. Politics latest: Starmer 'looking' at cuts after chancellor confirms 10,000 civil service jobs to be axed The themes touched upon in the show have led to suggestions that the government introduce a minister for men to mirror the women and equalities minister that currently exists in the cabinet. But speaking to BBC Radio 5 Live, the prime minister said he did not think appointing a new minister was \"the answer\" to the problems affecting young boys today, including negative and harmful social media content and a lack of visible role models. \"I am worried about this; I've got a 16-year-old boy and a 14-year-old girl,\" he said. \"There's a reason why the debate has suddenly sparked into life on this and that's because I think a lot of parents, a lot of people who work with young people at school or elsewhere, recognise that we may have a problem with boys and young men that we need to address.\" \n                  Nigel Farage would turn UK into a 'Trump tribute act', Lib Dem leader Sir Ed Davey says\n                 \n                  Celebrities urge government to reverse 'shameful' welfare cuts\n                 \n                  Starmer defends 'vital' benefit cuts - as he cites cases of his late mother and brother\n                 Sir Keir said he was more persuaded by arguments put forward by former England manger Gareth Southgate, who argued in a recent lecture that young men lacked positive role models, making them vulnerable to online influencers who promoted negative ideologies about the world and women. \"I've been in touch with Gareth,\" the prime minister said. \"I know Gareth. I thought his lecture, what he was saying, was really powerful, will have resonated with a lot of parents. Read more:Stephen Graham on how incel culture influenced new Netflix showIncels pose 'emerging threat to children', study findsWhy violent motivations are becoming harder to define \"And I do think this is something that we have to take seriously, we have to address. We can't shrug our shoulders at it.\" Asked whether a minister for men would help, Sir Keir said: \"No, I don't think that's the answer. \"I think it is time for listening carefully to what Gareth Southgate was saying and responding to it. \"I want to have that further discussion with him. We've already had a bit of a discussion about this, but I do think it's important we pick this challenge up and see it for what it is.\" By Anjum Peerbacos, education reporter As a former English teacher, I was interested to see how the show depicted schools and teachers – and their interaction with the central character. Some elements struck me as truthful, others not so much. \"Shut up,\" we hear one child yell at the teacher, Mrs Fenumore, as she's taking the detectives to meet Jamie's class. It made me wince, despite knowing that this does happen in schools. In this depiction of schools, poor language was prevalent and not challenged appropriately by the adults in the situation. As is the case in every profession, in classrooms there are good and bad teachers. But in some cases I found the lack of knowledge and extent of ignorance from Mrs Fenumore hard to believe - and on a personal level hard to watch. How could she not know about the incel movement? It was her job to know. For example, I remember devising lessons and assemblies specifically looking into the incel movement, which were even more pertinent when the case of murdered 33-year-old Sarah Everard was in the news. Adolescence is a must-watch, but it is also a hard-watch for anyone that has a young person in their life.  Delivering the BBC's annual Richard Dimbleby Lecture, Mr Southgate revealed how his experience of missing a penalty at Euro 96 \"still haunts me today\". And he warned that \"callous\" influencers online were tricking young men into thinking women and the world were against them, causing them to \"withdraw\" into the online world and express their emotions there rather than in \"real-world communities. 👉 Listen to Sky News Daily on your podcast app 👈 He said a \"void\" in their search for direction is often now being filled by some influencers who \"willingly trick young men into believing that success is measured by money or dominance\". In his interview with the BBC, Sir Keir suggested footballers and athletes could be role models for boys and young men but said there was also a need for inspirational people in communities. Asked who the British male role models were, Sir Keir told BBC Radio 5 Live: \"I always go to sport for this. Footballers, athletes, I think they are role models. \"But I also think if you actually ask a young person, they're more likely to identify somebody who's in their school, a teacher, or somebody who maybe is a sports coach, something like that. Read more politics news:The horrific content teenagers are exposed to online'I banned my kids from using phones - schools should too' \"So we need to make sure that - this is something that dads do, dad would reach for a sort of sporting hero - I think children, young people, are more likely to reach someone closer to them, within their school, within their community. \"And that's, I think, where we need to do some of the work.\" The UK has never had a minister for men but previous Conservative MPs, including former Doncaster MP Nick Fletcher, have called for one in the past to tackle high rates of suicide among men. The position of minister for women was created by former Labour prime minister Tony Blair as a means of prioritising women's issues across government."
    },
    {
        "title": "Officials publish list of 'priority pathogens' posing greatest risk to public health",
        "description": "Health officials have published a new list of viruses and bacteria they say pose the greatest threat to public health.",
        "url": "https://news.sky.com/story/officials-publish-list-of-priority-pathogens-posing-greatest-risk-to-public-health-13335287",
        "image_url": "https://e3.365dm.com/23/05/1920x1080/skynews-covid-coronavirus_6160190.jpg?20230804111849",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-24 23:15:00",
        "Headline": "The UK Health Security Agency says its guide is designed to help scientists and researchers focus their efforts and bolster preparedness for any future pandemic.",
        "Content": "Health officials have published a new list of viruses and bacteria they say pose the greatest threat to public health. The UK Health Security Agency (UKHSA) says its \"priority pathogen\" guide is designed to help scientists and researchers focus their efforts and bolster preparedness for any future pandemic. The list of 24 pathogen families is the first to consider global health threats, as well as threats specific to the UK population, and it is hoped it will speed up the development of vaccines. The viral pathogen families classed as high risk for both epidemics and pandemics include: coronaviridae, which includes COVID-19; orthomyxoviridae, which includes avian influenza; and paramyxoviridae, which causes the Nipah virus. Dr Isabel Oliver, chief scientific officer for UKHSA, said: \"We live at the time of increasing challenges and increasing risks from infectious diseases. \"But at the same time we have got, thanks to scientific advancement, better tools than we've ever had to protect health against these threats.\" \"Having said that there are areas where we still need more or better diagnostics, vaccines and medicines and therapeutics, and this tool has been designed to help inform the work of government research funders, but also our partners in industry and academia who are critical to the development of these tools that we so desperately need.\" Experts assessed the pandemic and epidemic potential of each viral family in order to create the tool, looking at the severity of disease, routes of transmission and previous pandemics among known pathogens in the family. Each group was then given a rating of high, medium or low risk based on the opinions of scientists at UKHSA. Read more from Sky News:What you should know about bird flu in the UKFive years since lockdown: The images we can't forget The tool also includes information on whether the risk is sensitive to climate change, if vaccines are available and if human-to-human transmission is likely, as well as their resistance to drugs like antibiotics. Dr Oliver said: \"We haven't ranked because the situation is constantly evolving, as you can imagine, and one of the things that we do in the UKHSA is undertake surveillance and monitor threats.\" She added: \"This is an important lesson from the COVID-19 pandemic, is that it is really important that we consider the breadth of potential threats to health, and that we continue to monitor the situation and flexibly respond to those. \"So our approach is very much to increase our resilience against all families of concern and to work with partners to advance resilience across all of these.\""
    },
    {
        "title": "Hacking by criminals and spies has reached 'unprecedented complexity', Microsoft says",
        "description": "A surge in hacking attempts by criminals, fraudsters and spy agencies has reached a level of \"unprecedented complexity\" that only artificial intelligence will be able to combat,&#160;according to Microsoft.",
        "url": "https://news.sky.com/story/microsoft-looks-to-ai-to-close-window-on-hackers-13335086",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-microsoft-copilot_6865818.png?20250324154628",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-03-24 16:00:00",
        "Headline": "The US-based tech company is launching 11 AI cybersecurity \"agents\" tasked with identifying and sifting through suspicious emails, blocking hacking attempts and gathering intelligence on where attacks may originate.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  A surge in hacking attempts by criminals, fraudsters and spy agencies has reached a level of \"unprecedented complexity\" that only artificial intelligence will be able to combat, according to Microsoft. \"Last year we tracked 30 billion phishing emails,\" says Vasu Jakkal, vice president of security at the US-based tech giant. \"There's no way any human can keep up with the volume.\" In response, the company is launching 11 AI cybersecurity \"agents\" tasked with identifying and sifting through suspicious emails, blocking hacking attempts and gathering intelligence on where attacks may originate. With around 70% of the world's computers running Windows software and many businesses relying on their cloud computing infrastructure, Microsoft has long been the prime target for hackers. Unlike an AI assistant that might answer a user's query or book a hair appointment, an AI agent is a computer programme that autonomously interacts with its environment to carry out tasks without direct input from a user. In recent years, there's been a boom in marketplaces on the dark web offering ready-made malware programmes for carrying out phishing attacks, as well as the potential for AI to write new malware code and automate attacks, which has led to what Ms Jakkal describes as a \"gig economy\" for cybercriminals worth $9.2trn (£7.1trn). She says they have seen a five-fold increase in the number of organised hacking groups - whether state-backed or criminal. \"We are facing unprecedented complexity when it comes to the threat landscape,\" says Ms Jakkal. The AI agents, some created by Microsoft, and others made by external partners, will be incorporated into Microsoft's portfolio of AI tools called Copilot and will primarily serve their customers' IT and cybersecurity teams rather than individual Windows users. Because an AI can spot patterns in data and screen inboxes for dodgy-looking emails far faster than a human IT manager, specialist cybersecurity firms and now Microsoft have been launching \"agentic\" AI models to keep increasingly vulnerable users safe online. Read more from Sky News:Trump lashes out over portraitPM says minister for men 'not the answer' But others in the field are deeply concerned about unleashing autonomous AI agents across a user's computer or network. In an interview with Sky News last month, Meredith Whittaker, CEO of messaging app Signal, said: \"Whether you call it an agent, whether you call it a bot, whether you call it something else, it can only know what's in the data it has access to, which means there is a hunger for your private data and there's a real temptation to do privacy invading forms of AI.\" Microsoft says its release of multiple cybersecurity agents ensures each AI has a very defined role, only allowing it access to data that's relevant to its task. It also applies what it calls a \"zero trust framework\" to its AI tools, which requires the company to constantly assess whether agents are playing by the rules they were programmed with. A roll-out of new AI cybersecurity software by a company as dominant as Microsoft will be closely watched. Last July, a tiny error in the software code of an application made cybersecurity firm CrowdStrike instantly crash around 8.5 million computers worldwide running Microsoft Windows, leaving users unable to restart their machines. The incident - described as the largest outage in the history of computing - affected airports, hospitals, rail networks and thousands of businesses including Sky News - some of which took days to recover."
    },
    {
        "title": "Bird flu detected in sheep in England for the first time",
        "description": "Bird flu has been detected in a sheep in England for the first time, the government has said.",
        "url": "https://news.sky.com/story/bird-flu-detected-in-sheep-in-england-for-the-first-time-13334862",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-bird-flu-h5n1-virus_6865534.jpg?20250324092503",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-24 09:00:00",
        "Headline": "No further infection of the virus was detected in the remaining flock at the premises in the Yorkshire area, but the government has urged livestock farmers to remain vigilant for any signs of potential bird flu outbreaks.",
        "Content": "Bird flu has been detected in a sheep in England for the first time, the government has said. The single case was identified in Yorkshire during a routine check of livestock on a farm where the H5N1 virus, also called avian influenza, had previously been confirmed in captive birds. No further infection of the virus was detected in the remaining flock, the Department for Environment, Food and Rural Affairs (DEFRA) said. \"While this is the first time this virus has been reported in a sheep, it is not the first time influenza of avian origin has been detected in livestock in other countries,\" it added. \"There is no evidence to suggest an increased risk to the nation's livestock population.\" DEFRA said it has been introducing livestock surveillance on infected premises following the outbreak of avian influenza in dairy cows in the US. The infected sheep has been humanely culled to enable extensive testing, it said. Livestock farmers are being urged to remain vigilant to any signs of bird flu following recent outbreaks. The UK's chief veterinary officer, Christine Middlemiss, said: \"We have confirmed the detection of influenza of avian origin in a single sheep on a farm in Yorkshire. \"Strict biosecurity measures have been implemented to prevent the further spread of disease. \"While the risk to livestock remains low, I urge all animal owners to ensure scrupulous cleanliness is in place and to report any signs of infection to the Animal Plant Health Agency immediately.\"  Read more:What you should know about bird flu in the UKBird flu restrictions in place in England and Scotland  Dr Meera Chand, of the UK Health Security Agency, said: \"Globally, we continue to see that mammals can be infected with avian influenza. \"However, current evidence suggests that the avian influenza viruses we're seeing circulating around the world do not spread easily to people - and the risk of avian flu to the general public remains very low.\" The Food Standards Agency has said properly cooked poultry and associated products, including eggs, remain safe to eat. Bird flu poses a very low food safety risk to UK consumers since the virus is not normally transmitted through food, it added."
    },
    {
        "title": "Bird flu tops list of viruses likely to cause another pandemic - so authorities are on high alert",
        "description": "A sheep infected with bird flu will ring another alarm bell as the virus continues to drift into mammals.",
        "url": "https://news.sky.com/story/bird-flu-tops-list-of-viruses-likely-to-cause-another-pandemic-so-authorities-are-on-high-alert-13334962",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-bird-flu-avian-influenza_6865712.jpg?20250324131225",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-03-24 11:54:00",
        "Headline": "As avian influenza is found in a sheep in Yorkshire, the close contact humans have with domesticated animals is an extra worry because the virus has more opportunities to jump species again - but swift action by the authorities can reduce the chances of further genetic changes.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n A sheep infected with bird flu will ring another alarm bell as the virus continues to drift into mammals. It's the first time anywhere in the world that a sheep is known to have been infected. It just happens to have been in Yorkshire. But the H5N1 virus is also found quite widely in US dairy cattle. And Sky News revealed in December that horses can harbour the virus too. These are 'spill-over' infections, with the bird virus jumping species. That's a concern, particularly if the virus shows signs of adapting to mammalian cells. And the close contact that humans have with domesticated animals is an extra worry because the virus has more opportunities to jump species again. The UK is in another wave of H5N1, with large areas now part of avian influenza prevention zones. Millions of poultry have been culled in recent months. Wild mammals are also being affected. Most recently the virus has been detected in dead seals in north Norfolk. But foxes, otters, dolphins and porpoises have also been found to have the virus. The Animal Plant Health Agency is closely monitoring the situation. Ever since the outbreak in US dairy cattle, it has started routine testing of livestock on UK farms with infected poultry. That's how this ewe was detected, with H5 antibodies in her blood and genetic material from the virus in her milk. Fortunately, all the other sheep on the farm were negative, but the animal was culled. Read more:What you should know about bird flu in the UKBird flu restrictions in place in England and Scotland  Swift action like that reduces the chances of the virus evolving genetic changes and spreading. US authorities were too slow to act when the virus was detected in cattle. It's now in at least 950 herds in 16 states, and harmless fragments of the virus have been detected in milk on supermarket shelves. Further tests are being carried out on the virus that infected the Yorkshire sheep. Scientists will look at whether it had any genetic changes compared to the variants found in birds. Read more:Why is egg smuggling on the rise in the US? The UK Health Security Agency says H5N1 is still primarily a bird disease and the risk to the general public is still very low. But it tops the list of viruses likely to cause a pandemic, so authorities are on high alert."
    },
    {
        "title": "Banks and Which? unite to demand fraud action from tech giants",
        "description": "Britain's biggest banks and most prominent consumer campaign group have joined forces in a rare show of unity to urge ministers to accelerate action to tackle Britain's online fraud epidemic.",
        "url": "https://news.sky.com/story/banks-and-which-unite-to-demand-fraud-action-from-tech-giants-13334929",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-hacker-cyberattack_6439404.jpg?20240131153309",
        "type": "Technology",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-24 11:21:00",
        "Headline": "The bosses of UK Finance and Which? have joined forces to call on ministers to force major tech and telecoms companies to share the cost of tackling Britain's online fraud pandemic, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Britain's biggest banks and most prominent consumer campaign group have joined forces in a rare show of unity to urge ministers to accelerate action to tackle Britain's online fraud epidemic. Sky News has obtained a joint letter from UK Finance, the main lobbying group for UK lenders, and Which? to three cabinet ministers including Rachel Reeves, the chancellor, and home secretary Yvette Cooper. Sent earlier this month, it argued technology and telecoms companies risked missing a government-imposed deadline to provide an update on their efforts to curb online fraud, and demanded more action was urgently needed. Money latest: Pubs warn on pint cost milestone They argued voluntary anti-fraud initiatives had so far \"had no meaningful impact on the scale of fraud\", citing data showing that nearly three-quarters of authorised push payment (APP) fraud - which involves criminals tricking people into transferring them money - originated online, with 16% starting on telecommunications networks. \"While some firms are making efforts, it's clear that not all of them are taking the problem seriously enough,\" the letter said. \"Before the election the Prime Minister highlighted the role the financial services sector plays in supporting customers who've been defrauded, including through the Payment Systems Regulator's (PSR) newly introduced mandatory reimbursement scheme for APP fraud victims. \n                  Airlines threaten Heathrow with legal action\n                 \n                  List of closures as hundreds at risk of redundancy due to Morrisons shutting cafes, meat counters and convenience stores\n                 \n                  National Grid boss claims Heathrow had 'enough power' despite shutdown\n                 \"He also outlined the need for big tech to step up and do more, calling for these firms to have a 'clear obligation' and 'financial incentive' to work with banks and law enforcement agencies to identify and stop fraudsters from targeting UK consumers. \"Which? and the banking sector wholeheartedly agree.\"  The groups referred to statistics showing that nearly £1.2bn was stolen through payment fraud in 2023 - equivalent to more than £2,000-per-minute. UK Finance and Which? called on ministers to ensure the cost of dealing with fraud was shared with tech and telecoms companies, and to \"accelerate the publication of a Fraud Strategy in which it sets out its plans to close gaps in consumer protections, especially in relation to online advertising outside of the scope of the [Online Safety Act], and to improve consumer protections from scam calls and texts\". Pressure has been growing for companies such as Meta - owner of Facebook, Instagram and WhatsApp - to contribute financially to the growing cost of online fraud, but the latest demand comes at an awkward time for ministers, with suggestions that big tech companies are to be spared an £800m digital tax amid negotiations aimed at staving off US President Donald Trump's tariffs on UK companies. \"The problem isn't just a financial one,\" the joint letter said. \"Fraud is a pernicious crime that can cause severe psychological and emotional harm to victims. \"Which? research from 2023 calculated the impact on the wellbeing of consumers who've fallen victim to online scams as equivalent to the cost of £7.2bn per year. \"Some victims have reported changes in their behaviour and a loss of trust in the online world. In the long run, this is likely to have knock-on effects on consumers' willingness to try new products and services, which is compromising economic growth.\" The two groups argued that while the Online Safety Act would prevent some online fraud being committed, ministers needed to go further. \"It is deeply concerning that the regulator [Ofcom] previously announced it was delaying the implementation of the codes for paid-for fraudulent advertising by over a year, meaning that the Act will not be fully enforced until 2027 at the earliest. \"The government must ensure Ofcom not only swiftly implements these codes, but that the codes themselves are sufficiently robust to effectively reduce the volume of fraudulent advertising online. \"We ask that you publicly call for these provisions to be in place as soon as practically possible to provide much needed reassurance to consumers.\""
    },
    {
        "title": "Woman who can smell Parkinson's disease describes moment she realised her husband had it",
        "description": "A woman who can smell Parkinson's disease has described the moment she realised her husband had it.",
        "url": "https://news.sky.com/story/woman-who-can-smell-parkinsons-disease-describes-moment-she-realised-her-husband-had-it-13335219",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-joy-milne-les-milne_6866187.jpg?20250324224633",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-24 20:40:00",
        "Headline": "Joy Milne told The UK Tonight With Sarah-Jane Mee about how her rare condition of hyperosmia, an incredibly sensitive sense of smell, helped her sniff out the disease in her late husband, Les.",
        "Content": " A woman who can smell Parkinson's disease has described the moment she realised her husband had it. Joy Milne told Sky's The UK Tonight With Sarah-Jane Mee about how her rare condition of hyperosmia, an incredibly sensitive sense of smell, helped her sniff out the disease in her late husband, Les. She said: \"Well, when you know, you're saying to your husband 'well you're smelling, you're not having enough showers and you're not brushing your teeth enough' and various other things, it doesn't go down well to start off with does it?\" \"We continued like that for a while, and then I thought I've got to stop this, he's not terribly pleased, I'll just have to keep quiet.\" But when Mr Milne was around 29 years old \"there was a definite change, a very distinct change,\" she said. And by the time he was 31 \"his smell had completely changed\" and other things had \"begun to happen\", leading her to think \"maybe he had a brain tumour\". A neurologist eventually diagnosed Mr Milne with Parkinson's. Ms Milne said she later went to a Parkinson's meeting in Perth, Scotland, and noticed \"by the time I left, I could tell you who had Parkinson's, who did and who didn't\". \"Now, there were over 30 people there. And, you know, I was quite able to do that.\" She described her ability to Dr Tilo Kunath from Edinburgh University, who worked with Perdita Barran, professor of mass spectrometry at the University of Manchester, to devise an experiment to test Ms Milne's ability. Professor Barran told Sky News: \"We had to do an experiment to separate the obvious movement symptoms of people with Parkinson's disease from the smell.\" They had people wear T-shirts and then put the T-shirts in bags, which were given to Joy, who \"was 100% correct in smelling the T-shirts and diagnosing from a T-shirt whether someone had Parkinson's or not\". Professor Barran said: \"So that was the first incredible step change, because it actually meant we could diagnose someone from the material that they were wearing, from clothes.\" They now use gauze or Q-tips to collect samples and analyse them using a method called mass spectrometry, which \"weighs molecules and helps us to find out what they are\". The method allows Ms Milne to smell molecules while they are identified by the machine. Professor Barran explained: \"So we split them. Some go to be weighed and some go to Joy's nose. And that allows us to code to find out which of the very complicated mixture of molecules we have on our skin from skin swabs, are to do with the disease, are the ones that smell of it.\" Asked how it feels to walk past someone who might smell like they're carrying the condition and whether it's difficult to carry on walking by, Ms Milne said: \"It is very difficult, but I have signed a non-disclosure because it is unethical. It is and I can't do anything about that.\" Read more from Sky News:Trump lashes out over portraitPM says minister for men 'not the answer' Pressed on whether she finds it a blessing or extremely difficult, she said: \"I think, because it's a genetic thing in the female side of the family, my grandmother did warn me when she trained me, she did warn me not to use [it]. \"She said I would find it very difficult unless I made the decision that I would go ahead and do it. And I have made that choice. I was a nurse, a carer for my mother-in-law and my husband with Parkinson's and really it was the right choice. I think it was the right choice.\""
    },
    {
        "title": "Snow White: Blighted by controversy, but Disney live-action remake still tops box office",
        "description": "Disney's live-action remake of Snow White And The Seven Dwarves has topped the North American box office chart, despite a controversy-packed run-up to the film's release.",
        "url": "https://news.sky.com/story/snow-white-blighted-by-controversy-but-disney-live-action-remake-still-tops-box-office-13334949",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-disney-gal-gadot-snow-white_6862607.jpg?20250320213227",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-03-24 11:41:00",
        "Headline": "Snow White's marketing campaign has been an absolute disaster, and one review dubbed the live-action remake \"exhaustingly awful\". But weekend box office charts show that people still turned out to watch.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Disney's live-action remake of Snow White And The Seven Dwarves has topped the North American box office chart, despite a controversy-packed run-up to the film's release. Based on the 1937 classic that established Disney's name as an industry leader, Snow White took an estimated $43m (£33.1m) domestically, and $87.3m (£67.3m) worldwide, according to Box Office Mojo. In the UK and Ireland, the film took £3.85m, accounting for 43% of all tickets sold across its three-day opening weekend. For comparison, Disney's Mufasa: The Lion King, which came to cinemas in December, took $35m domestically (£27m). It's now gone on to take over $700m (£540m) globally. Meanwhile, Disney's 2019 live-action Dumbo, directed by Tim Burton, took $45m (£35m) domestically in its opening weekend. It has since taken over $350m (£270m) worldwide. Snow White has not performed well in China, only making it to seventh place in the Chinese box office charts and grossing less than $1m (£770,000) over its opening, according to EntGroup's China Box Office website. Reviews for the movie have been mixed, with The Guardian calling it an \"exhaustingly awful reboot\" and The Observer similarly judging it to be \"toe-curlingly terrible\". \n                  Snow White: Little people feel 'erased' by Disney's use of CGI instead of real actors\n                 \n                  Sterling K Brown on Black Panther, taping up his basketball shoes and Paradise\n                 \n                  Disney being sued for billions over Moana claims\n                 The Independent wasn't a fan of the \"uncanny CGI caricatures\" which it said were reminiscent of 2004 movie The Polar Express, a sentiment echoed by Empire which called the reimagined dwarves an \"unholy VFX disaster\". The Daily Mail called it \"painfully muddle-headed\", but gave Zegler the thumbs up, highlighting her \"oodles of talent\", while The New York Post said it was \"mediocre\" and unmemorable. Some US outlets have given a more favourable critique, with Variety calling it \"one of the better live-action adaptations of a Disney animated feature,\" and The Hollywood Reporter judging it \"mostly captivating\". Reviews aggregator Rotten Tomatoes gives the movie a 44% critic score - which translates to \"rotten\" - however the audience score on the site's \"Popcornometer\" is currently at 74%, rating it \"fresh\".  Dubbed 'woke' and plagued with speculation The movie had a muted marketing campaign, with no UK premiere and reduced US press opportunities. Costing around $250m to make, the film had been flagged as a potential tent-pole movie (a film that is expected to be very successful and support a range of merchandise or spin-off opportunities) for Disney early on. But aspirations faded as it approached release as it was hit by controversy after controversy. Early on, Snow White was labelled \"woke\" due to its casting of Latina actress Rachel Zegler, who is of Colombian-Polish descent, in the lead role. Zegler also faced a backlash after suggesting the early version of the film had content that was unsuitable for the 21st century - namely the fact the prince \"literally stalks\" Snow White. There was then speculation as to whether Zegler got on with Israeli actress Gal Gadot, who plays the evil queen, as they have previously expressed very different views over the Israel-Hamas war. The use of CGI to create the seven dwarf characters, thus replacing the potential for little people to take up the roles, has left disability activists to accuse the movie of \"erasing\" them from the narrative. Ahead of the film's release, comedian, model and content creator Fats Timbo told Sky News she believed Disney missed a golden opportunity to educate children during what was likely to be their first encounter with someone with dwarfism. Snow White is in cinemas now."
    },
    {
        "title": "Sir Keir Starmer reveals he's been in touch with ex-England boss about issues raised in Netflix drama",
        "description": "Sir Keir Starmer has rejected the idea of creating a minister for men to combat some of the issues raised in the hit Netflix drama Adolescence.",
        "url": "https://news.sky.com/story/sir-keir-starmer-reveals-hes-been-in-touch-with-ex-england-boss-about-issues-raised-in-netflix-drama-13334870",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-starmer-keir_6865144.jpg?20250323173201",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-24 09:35:00",
        "Headline": "Sir Keir Starmer has been watching Adolescence with his teenage children, but says a \"minister for men\" is \"not the answer\" to the issues raised in the show. He says he's more persuaded by arguments put forward by Gareth Southgate.",
        "Content": "Sir Keir Starmer has rejected the idea of creating a minister for men to combat some of the issues raised in the hit Netflix drama Adolescence. Sir Keir said he was \"worried\" about the \"crisis in masculinity\" raised in the programme, which centres on a 13-year-old boy arrested for the murder of a young girl and the rise of incel culture. Politics latest: Starmer 'looking' at cuts after chancellor confirms 10,000 civil service jobs to be axed The themes touched upon in the show have led to suggestions that the government introduce a minister for men to mirror the women and equalities minister that currently exists in the cabinet. But speaking to BBC Radio 5 Live, the prime minister said he did not think appointing a new minister was \"the answer\" to the problems affecting young boys today, including negative and harmful social media content and a lack of visible role models. \"I am worried about this; I've got a 16-year-old boy and a 14-year-old girl,\" he said. \"There's a reason why the debate has suddenly sparked into life on this and that's because I think a lot of parents, a lot of people who work with young people at school or elsewhere, recognise that we may have a problem with boys and young men that we need to address.\" \n                  Nigel Farage would turn UK into a 'Trump tribute act', Lib Dem leader Sir Ed Davey says\n                 \n                  Celebrities urge government to reverse 'shameful' welfare cuts\n                 \n                  Starmer defends 'vital' benefit cuts - as he cites cases of his late mother and brother\n                 Sir Keir said he was more persuaded by arguments put forward by former England manger Gareth Southgate, who argued in a recent lecture that young men lacked positive role models, making them vulnerable to online influencers who promoted negative ideologies about the world and women. \"I've been in touch with Gareth,\" the prime minister said. \"I know Gareth. I thought his lecture, what he was saying, was really powerful, will have resonated with a lot of parents. Read more:Stephen Graham on how incel culture influenced new Netflix showIncels pose 'emerging threat to children', study findsWhy violent motivations are becoming harder to define \"And I do think this is something that we have to take seriously, we have to address. We can't shrug our shoulders at it.\" Asked whether a minister for men would help, Sir Keir said: \"No, I don't think that's the answer. \"I think it is time for listening carefully to what Gareth Southgate was saying and responding to it. \"I want to have that further discussion with him. We've already had a bit of a discussion about this, but I do think it's important we pick this challenge up and see it for what it is.\" By Anjum Peerbacos, education reporter As a former English teacher, I was interested to see how the show depicted schools and teachers – and their interaction with the central character. Some elements struck me as truthful, others not so much. \"Shut up,\" we hear one child yell at the teacher, Mrs Fenumore, as she's taking the detectives to meet Jamie's class. It made me wince, despite knowing that this does happen in schools. In this depiction of schools, poor language was prevalent and not challenged appropriately by the adults in the situation. As is the case in every profession, in classrooms there are good and bad teachers. But in some cases I found the lack of knowledge and extent of ignorance from Mrs Fenumore hard to believe - and on a personal level hard to watch. How could she not know about the incel movement? It was her job to know. For example, I remember devising lessons and assemblies specifically looking into the incel movement, which were even more pertinent when the case of murdered 33-year-old Sarah Everard was in the news. Adolescence is a must-watch, but it is also a hard-watch for anyone that has a young person in their life.  Delivering the BBC's annual Richard Dimbleby Lecture, Mr Southgate revealed how his experience of missing a penalty at Euro 96 \"still haunts me today\". And he warned that \"callous\" influencers online were tricking young men into thinking women and the world were against them, causing them to \"withdraw\" into the online world and express their emotions there rather than in \"real-world communities. 👉 Listen to Sky News Daily on your podcast app 👈 He said a \"void\" in their search for direction is often now being filled by some influencers who \"willingly trick young men into believing that success is measured by money or dominance\". In his interview with the BBC, Sir Keir suggested footballers and athletes could be role models for boys and young men but said there was also a need for inspirational people in communities. Asked who the British male role models were, Sir Keir told BBC Radio 5 Live: \"I always go to sport for this. Footballers, athletes, I think they are role models. \"But I also think if you actually ask a young person, they're more likely to identify somebody who's in their school, a teacher, or somebody who maybe is a sports coach, something like that. Read more politics news:The horrific content teenagers are exposed to online'I banned my kids from using phones - schools should too' \"So we need to make sure that - this is something that dads do, dad would reach for a sort of sporting hero - I think children, young people, are more likely to reach someone closer to them, within their school, within their community. \"And that's, I think, where we need to do some of the work.\" The UK has never had a minister for men but previous Conservative MPs, including former Doncaster MP Nick Fletcher, have called for one in the past to tackle high rates of suicide among men. The position of minister for women was created by former Labour prime minister Tony Blair as a means of prioritising women's issues across government."
    }
]