[
    {
        "title": "Trump denies knowledge of Israel's 'unfortunate' strike on Qatar - as Starmer joins global condemnation",
        "description": "Donald Trump has distanced the US from Israel's \"unfortunate\" strike in Qatar, which drew international condemnation and killed five members of Hamas.",
        "url": "https://news.sky.com/story/trump-denies-knowledge-of-israels-unfortunate-strike-on-qatar-as-starmer-joins-global-condemnation-13427908",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-qatar-israel-trump_7015659.jpg?20250910003346",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-09 21:58:00",
        "Headline": "Sir Keir Starmer has condemned Israel's strike ahead of his controversial meeting with Israeli President Isaac Herzog in London, saying it violates Qatar's sovereignty and risks further escalation in the region.",
        "Content": " Donald Trump has distanced the US from Israel's \"unfortunate\" strike in Qatar, which drew international condemnation and killed five members of Hamas. The Israeli Defence Forces said it carried out Tuesday's strike in Doha \"targeting the senior leadership of the Hamas terrorist organisation\". Prime Minister Benjamin Netanyahu's office said \"Israel initiated it, Israel conducted it, and Israel takes full responsibility\" for the attack - which the US president echoed on Truth Social. As it happened: NATO member says it will stand by Qatar Mr Trump said the US military notified his administration about the Israeli attack on the Qatari capital, and added: \"It was not a decision made by me. \"Unilaterally bombing inside Qatar, a Sovereign Nation and close Ally of the United States, that is working very hard and bravely taking risks with us to broker Peace, does not advance Israel or America's goals.\" Mr Trump then said however that eliminating Hamas \"is a worthy goal,\" and that he believes \"this unfortunate incident could serve as an opportunity for PEACE\". Speaking to reporters a little later, he said he was \"not thrilled\" about the strike and would make a \"full statement\" on Wednesday.  Qatar's UN ambassador says strike 'cowardly' Mr Netanyahu said the operation was a \"surgical, precision strike,\" and claimed it was \"completely justified\" after six people were killed in Jerusalem - which Hamas took responsibility for. Meanwhile, Qatar's interior ministry said that a member of its security forces were killed in Israel's strike, and its UN ambassador called the attack a \"criminal assault\" and \"cowardly\" act.  Alya Ahmed Saif Al-Thani told the United Nations Security Council that Qatar \"not tolerate this reckless Israeli behavior and the ongoing disruption of regional security,\" adding the strike \"constitutes a blatant violation of all international laws and norms\". In a phone call with Mr Trump, Qatari Emir Sheikh Tamim bin Hamad Al-Thani also said Qatar will take all necessary measures to protect its security and preserve its sovereignty. Read more on this story:Hard to see how Doha airstrike helps Israeli hostagesUS 'feels badly' about Qatar attack  Starmer condemns strike ahead of Herzog visit UK Prime Minister Sir Keir Starmer also condemned Israel's strike, saying it violates Qatar's sovereignty and risks further escalation in the region. His comments came ahead of Israeli President Isaac Herzog's visit to Britain, where he will meet with the prime minister this afternoon. Sir Keir said in a statement he intends to raise the issue of the \"intolerable situation\" in Gaza with Mr Herzog, adding: \"We've been clear Israel must take action to end [the] horrific scenes.\" In a phone call with the Emir of Qatar, Sir Keir also \"gave his condolences for the death of a Qatari security officer killed in the attack\", according to a Downing Street readout. Protests against Mr Herzog's visit are widely expected throughout his visit. Demonstrators gathered outside Downing Street yesterday to protest his arrival, while Green Party leader Zack Polanski told Sky News that the official should be arrested. Mr Polanski, who is Jewish, said: \"Welcoming a potential war criminal to the UK is another demonstration of how this Labour government is implicated in the ongoing genocide in Gaza. \"It also serves as a brutal insult to those mourning the thousands of innocent lives lost and to hundreds of thousands of Palestinians facing ongoing violence and hunger.\" Read more from Sky News:Disconnect between Mandelson's claim and his Epstein letterAnalysis: Nepal protests a powder keg momentWhat we have learnt from Harry's trip to the UK Israel has strongly denied that its actions in Gaza amount to genocide, but is being challenged on the issue in a case at the International Court of Justice in The Hague. The world's leading association of genocide scholars, as well as several Israeli human rights organisations, have already accused the country of genocide."
    },
    {
        "title": "Many reasons for Israel to hate the old men of Hamas, but hard to see how Doha strike helps plight of hostages",
        "description": "The Israeli airstrike on the Qatari capital Doha is a step change in the way they tackle their enemies, but only the latest in a series of them.",
        "url": "https://news.sky.com/story/many-reasons-for-israel-to-hate-the-old-men-of-hamas-but-hard-to-see-how-doha-strike-helps-plight-of-hostages-13427757",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-doha-israel-airstrike_7015487.jpg?20250909183459",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-09-09 16:47:00",
        "Headline": "Israel's airstrike in Doha is not against a country that is hostile, but one it has relations with, to the horror of the region, triggering off a massive diplomatic fallout",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  The Israeli airstrike on the Qatari capital Doha is a step change in the way they tackle their enemies, but only the latest in a series of them. In the past, Israel used stealthier means to dispatch its foes. Plausible deniability was preferable. October 7 changed everything, the Israelis say. So when they came for Hamas leader Ismail Haniyeh in 2024 in the Iranian capital of Tehran, they didn't bother with anything as subtle as poison or strangulation - they blew him up with an airstrike instead. Now it's launched another one, this time not on a city in a country that's hostile to Israel, but one it has relations with, to the horror of the region and massive diplomatic fallout. You might assume the targets were high value, a clear and present threat to Israel, to justify all that. Not exactly. There are plenty of reasons for Israelis to hate the old men of Hamas, whom they appear to have targeted. In the past, some of them were instrumental in organising terrorist attacks that killed many innocent women and children. Follow the latest: Hamas leadership 'survives Israeli strikes on Doha' They will have cheered on the 7 October atrocities, but so far as we know, they were not its primary masterminds. Hamas' Doha office In 2011, the US government persuaded the Qataris to let Hamas open a political office in Doha, and the Israelis approved of the idea. Everyone wanted an address to negotiate with and funnel millions of dollars through to Gaza. In the words of one Israeli official: \"We believe that better conditions in Gaza would lessen the incentive of Hamas and the population to go again to a war. So in a way, it is helping the deterrence.\" Critics of Benjamin Netanyahu said he was deliberately strengthening one wing of Palestinian politics as part of a cynical policy of divide and rule. For whatever reason, Israel acquiesced fully in the Hamas political office being set up in Doha. It was staffed with some of the veterans of its cause who seem to have been on the target list in this strike. When I interviewed Khaled Meshaal in Doha in October 2023, he was determined and dogmatic, but seemed at one stage removed. He was no longer the ideological godfather of the movement, he clearly had been when I first met him in Damascus in 2017. The hard men of Gaza - Yahya Sinwar, Abu Obeida, Muhammad Deif - were in control now, much more than those languishing in exile. Hard to see how strikes help hostages in Gaza Mr Netanyahu will have had his reasons for today's strikes. He has almost certainly been waiting for another chance to kill Meshaal after his first attempt failed so spectacularly. Read more from Sky News:Israel launches strikes on Hamas leaders in DohaMan arrested after Heathrow Airport incident In 1997, he sent Mossad agents to pour a lethal poison into his ear in the Jordanian capital, Amman. They botched the job, and King Hussein told then-US president Bill Clinton to order the Israeli leader to hand over an antidote that saved him. Initial reports suggest the wily Meshaal escaped the latest attempt on his life, too. But the men killed and targeted today were, for all their faults, the people Israel was indirectly talking to try to negotiate the return of their hostages. It is hard to see how this helps their plight now."
    },
    {
        "title": "'Best pal' to 'wish I never met him': The disconnect between Mandelson's claim and his Epstein letter",
        "description": "He is Britain's ambassador to the United States, a former deputy prime minister of the United Kingdom, no less.",
        "url": "https://news.sky.com/story/best-pal-to-wish-i-never-met-him-the-disconnect-between-mandelsons-claim-and-his-epstein-letter-13427790",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-epstein-mandelson_7014791.png?20250909072448",
        "type": "Home",
        "Author": "Mark Stone",
        "Date Published": "2025-09-09 17:59:00",
        "Headline": "The British Embassy in Washington is making no new comment on revelations in congressional papers that Lord Mandelson described the billionaire paedophile Jeffrey Epstein as 'my best pal'.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n He is Britain's ambassador to the United States, a former deputy prime minister of the United Kingdom, no less. He has been a titan of British politics for decades and is the sharpest of operators. Yet Peter Mandelson has been unable to explain why he counted the paedophile Jeffrey Epstein as his \"best pal\". Warning: This story contains graphic descriptions of sexual acts. \"Wherever he is in the world, he remains my best pal!\" Lord Mandelson wrote in Epstein's 50th birthday book in 2003. The handwritten words were accompanied by a snap of a dressing-gown-clad Mandelson with Epstein. Lord Mandelson was one of many contributors to the book, which has been made public for the first time after being published by a congressional committee in Washington. It was compiled by Epstein's girlfriend and co-conspirator Ghislaine Maxwell in 2003, three years before allegations of sexual abuse of minors by Epstein became public. At the very least, there is the question of judgement for Lord Mandelson. The victims of Epstein's abuse have said repeatedly that anyone close to him would have been fully aware of his behaviour. While that is unprovable, it is deeply uncomfortable for anyone close to him, and even more so for those who contributed to the birthday book. The book is hard to read. For page after page, the content is at times graphically sexual. It contains stories, anecdotes and boasts from friends discussing their sexual escapades with Epstein. Some of the images are disturbing, including hand-drawn images of Epstein being massaged by three young-looking women on a beach and images of him with girls - their faces blacked out by the US congressional committee which released the book. 'She left screaming' One note, from an unknown contributor, reads: \"I was porking some girl in bed and Jeff brings in the mains to make beef. She left screaming and never came back.\" It continues: \"We're both in bed porking some girls and I said what do you think, while he's shoving penicillin down my throat.\" Elsewhere in the book, the full note from Lord Mandelson, accompanied by photos, reads: \"Once upon a time, an intelligent, sharp-witted man they call 'mysterious' parachuted into my life… \"You would spend many hours just waiting for him to turn up. And often, no sooner were you getting used to having him around, you would suddenly be alone… again leaving you with some 'interesting' friends to entertain instead… [this caption is accompanied by a photo of two unidentified women]. It continues: \"Or just some dogs to keep you company (he wasn't always so keen on them). But then he would parachute back in… very occasionally, taking you by surprise in some far-off places [this caption accompanied with a whiskey label with Mandelson's name on it]... or in one of his glorious homes he likes to share with his friends (yum yum). But wherever he is in the world, he remains my best pal!\" In May, Sky News asked Lord Mandelson about his relationship with Mr Epstein. \"I'm not answering any questions about him,\" he told Sky's James Matthews. \"My knowledge of him is something that I regret. I wish I'd never met him in the first place.\" \"Why did you have an association with him?\" he was asked. \"Why did many people meet him? He was a prolific networker, and I wish I never met him in the first place,\" Mandelson said.  Sources have told Sky News the ambassador was unhappy with our questions. Notably, Sky was not invited to briefings with the embassy for a few months, and engagement with staff there was more challenging. In February, as he prepared to become the new ambassador, the Financial Times asked Lord Mandelson about his relationship with Epstein. \"I regret ever meeting him or being introduced to him by his partner Ghislaine Maxwell,\" he told the paper. \"I regret even more the hurt he caused to many young women. I'm not going to go into this. It's an FT obsession, and frankly, you can all f*ck off. OK?\" Mandelson has never been accused of any sexual impropriety by any of the Epstein victims. No comment He has not made any fresh comments on the notes in the book, but a spokesperson for the British Embassy in Washington had no comment, only referring me to the words from the ambassador in May. In London, the prime minister's spokesperson was asked if Sir Keir Starmer had spoken to Mandelson since the emergence of the letter. \"No, he's now gotten this statement, and it is a matter of public record. He is focused on delivering the state visit.\" The spokesperson added: \"I can only refer to the statement the ambassador himself made… I have nothing to add other than what the ambassador has already said about the previous relationship with Epstein… he is focused on the state visit.\" More from Sky:Mandelson questions come at worse possible momentHandwriting expert debunks Trump's signature denialExplainer: What is in the 'birthday files'? It's also not clear if Sir Keir and Number 10 officials were aware of the extent of the ties between Mandelson and Epstein. If they were, that raises serious questions about their own judgement. That state visit, next week, is now complicated by this news. The degrees of separation for three key characters involved in the visit are deeply awkward. US President Donald Trump seems increasingly closely associated with Epstein, with the publication of the letter in the book purported to be from him. Mr Trump continues to claim the letter is a fake. Lord Mandelson's association now appears to have been much closer than previously known. The King's brother, Prince Andrew, also had an association with Epstein and Maxwell that is well documented. He reached an out-of-court settlement with one Epstein victim who accused Andrew of sexual impropriety. He denies any wrongdoing. Deeply personal scandal Lord Mandelson is spearheading Britain's diplomatic and trade relationship with the United States. He has put the UK in a uniquely good position since he became ambassador at the start of the year. The state visit will form a key part of the effort to deepen relations with the Trump administration. There is an expectation of new trade, tech and AI announcements between the president and the prime minister next week. Lord Mandelson is a master of spin and strategy. He and his advisors will be hoping this deeply personal scandal doesn't derail diplomatic progress. But there remains a huge disconnect between his assertion that \"my knowledge of him is something that I regret\" and this new revelation that Epstein was his \"best pal\"."
    },
    {
        "title": "Handwriting expert says 'Donald Trump signature' in Epstein birthday book is 'absolutely' his - despite his denials",
        "description": "A handwriting expert has said the signature on a controversial birthday message to paedophile Jeffrey Epstein is \"absolutely\" US President Donald Trump's.",
        "url": "https://news.sky.com/story/handwriting-expert-says-donald-trump-signature-on-epstein-birthday-book-is-absolutely-his-despite-his-denials-13427738",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-handwriting-graphologist_7015430.jpg?20250909172155",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-09 16:01:00",
        "Headline": "A graphologist tells Sky News the message written in a book for the billionaire paedophile had a number of distinctive characteristics that make it unmistakeable.",
        "Content": " A handwriting expert has said the signature on a controversial birthday message to paedophile Jeffrey Epstein is \"absolutely\" US President Donald Trump's. Graphologist Emma Bache compared the signature with others the president wrote at the time, and told Sky News: \"It is very much the signature he had in the 2000s. I can absolutely say it is Donald Trump's.\" Newly released files handed to the United States Congress appear to contain birthday messages to billionaire paedophile Epstein from both the US president and the current British ambassador to the US, Peter Mandelson.  They include a hand-drawing of a woman's body, signed \"Donald\", a picture of Epstein holding an outsized cheque, signed by \"DJTRUMP\", and a message appearing to show Lord Mandelson calling Epstein his \"best pal\". Addressing the release of the image in a post on X, White House press secretary Karoline Leavitt said: \"As I have said all along, it's very clear President Trump did not draw this picture, and he did not sign it.\" But Ms Bache was unequivocal. \"It's incredibly distinctive. If we look at the way he has formed the 'o' of Donald, it's actually a circle. \"He also has a very long horizontal stroke at the end of his name - which funnily enough is saying to people 'keep away' - and it's absolutely identical in pressure, in length and formation of about every single stroke (to his current official signature).\" She said the capital 'D' of his name in the Epstein message, was also very distinctive and exactly the same as another letter written in 1996 and 2000. The files were handed over following a demand by the Oversight Committee of the US Congress and are from a book compiled by Epstein's co-conspirator, Ghislaine Maxwell, to celebrate his 50th birthday in 2003. More from Sky:Explainer: What is in the 'birthday files'?Trump latest: White House denial and Mandelson notesThe White House said the president's legal team was \"aggressively pursuing litigation\". Ms Bache said she was \"not surprised he would deny it\". She added: \"He has an awful lot to lose, but it doesn't affect my analysis of it.\" 👉 Follow Trump100 on your podcast app 👈 'You will listen to me - I am right' After examining a number of his signatures under a microscope, she concluded: \"The idea that it could be forged would be almost impossible. I certainly wouldn't be able to get anywhere close to Donald Trump's handwriting. \"It's a very confident, very speedy signature and when you forge something, you do it more slowly.\" She said his modern signature had changed a little but still had clear similarities. She added: \"His modern signature is all angles and in graphology, angles are about energy, aggression, there's a tension there. \"There's no softness and his communication style is one of 'you will listen to me and I am right'. Ambassador's denial Lord Mandelson has also come under scrutiny for his relationship with Epstein - and the release of the files has compounded the issue.  They appear to include a glowing contribution from the Labour grandee, with him calling Epstein his \"best pal\" and writing of the friend \"taking you by surprise… in one of his glorious homes he likes to share with his friends (yum yum)\". Lord Mandelson's spokesman said he \"very much regrets ever having been introduced to Epstein\"."
    },
    {
        "title": "Nepal's anti-government protests are a powder keg moment that could change the country for years",
        "description": "As we flew into Kathmandu, you could already see from the sky, the fury playing out on the streets below.",
        "url": "https://news.sky.com/story/nepals-anti-government-protests-are-a-powder-keg-moment-that-could-change-the-country-for-years-13427828",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nepal-protest-cordelia-lynch_7015591.jpg?20250909211547",
        "type": "Home",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-09-09 19:34:00",
        "Headline": "The second day of intense protests felt like something seismic: The leadership lifted restrictions on social media, and the prime minister resigned, but that wasn't enough to satisfy the thousands defying a curfew.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  As we flew into Kathmandu, you could already see from the sky, the fury playing out on the streets below. Huge plumes of smoke rose over the Nepalese capital. It was the second day of intense protests, and it soon felt like something seismic. On the ground, it was kinetic and chaotic. We landed just before the army closed the airport. The protesters were minutes away. On the road, a constant stream of young people sped by on motorbikes, honking their horns as they raced towards parliament.  Some were carrying batons, others guns, some simply using their voices, declaring a \"revolution\". We watched as they set fire to a police station. Many, already angry, were incensed by the deaths of 19 people on Monday - accusing the police of using live ammunition to silence dissent. The government has so far only acknowledged using rubber bullets and tear gas.  The leadership did lift the restrictions on social media - allowing people to use apps like X, YouTube and Instagram once again. And soon after, Nepalese Prime Minister KP Sharma Oli resigned. But that wasn't enough to satisfy the thousands defying the curfew. Nearly everyone we spoke to shared the same message - this was not about any platform - it was about something far deeper and far more entrenched. \"This protest is not against the social media ban,\" one man said as he raced through on a bike. \"This is against the big corruption that these ministers have done for the past few decades. \"We were suppressed. Now we have a voice.\" Throughout the day, you could feel people getting more emboldened. It was less than 24 hours before that we'd seen police firing at protesters - some victims died in their school uniforms. But on Tuesday, we didn't see a single officer. The only army we clocked was at the airport. And their absence was no more glaring than at the very centre of politics. Parliament House, home to lawmakers, was engulfed in flames as we approached. Protesters were rejoicing outside - thousands cheering as the building burned. It was surreal. The building looked abandoned - overrun by those who want radical change. \"They have given an open challenge to Gen Z,\" one man told me, punching his wooden stick into the air as he spoke. \"You should not challenge the youth or challenge Gen Z.\" I asked a young woman, Sandeep Bista, 26, if she was worried about more violence, given that 19 people had already died. \"I think to gain something you have to lose something,\" she said. \"So they're patriots for us. But today I'm happy. Revolution is coming.\" As the light faded, the mood shifted, people edging closer until they finally stormed inside - large groups clutching phones - seemingly undeterred by the sound of small explosions. There was smashed glass everywhere, dust obscuring the winding stairs. People climbed up them to try and grab or destroy what little was left - relics to remember the day by. Some came back with gleeful faces, holding bits of gold furniture and decoration - a symbol of the elite they've come to loathe. Read more from Sky News:Hard to see how Doha airstrike helps Israeli hostagesExpert examines 'Trump signature' in Epstein birthday book Elsewhere in the city, politicians were attacked, their homes targeted. The young people here feel on the cusp of victory and the right side of history. When you ask them what justice looks like, they say they want equality - a leadership that addresses their needs. Quite what that equality looks like seems harder for them to specify. But a wholesale change in leadership appears to be a crucial demand. The big question is, what next? We don't yet know who might take over from the prime minister. The police clearly chose to stay away on Tuesday - no doubt fearful of the reception they'd receive. But by evening, the Nepali army vowed to \"take control of the situation\". From what we saw, calm currently feels pretty elusive. Hundreds of inmates have escaped prisons, politicians' home addresses are being shared online, and many young people who feel they have waited far too long already want dramatic change and quickly. Read more from Cordelia Lynch:The red pill explosion fuelling a secret detox ritualAt the scene of mosque hit by an Indian missile strike It is a powder keg moment that could change the course of the country for many years to come. Like the recent demonstration in Indonesia and the uprising in Bangladesh just a year ago, this moment in Nepal has shown the fierce political power of young people."
    },
    {
        "title": "Bridget Phillipson emerges as frontrunner in Labour's deputy leadership race",
        "description": "Bridget Phillipson has emerged as the early frontrunner in the Labour deputy leadership race as other candidates scramble to catch up ahead of a crunch deadline.",
        "url": "https://news.sky.com/story/bridget-phillipson-emerges-as-frontrunner-in-labours-deputy-leadership-race-13427824",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bridget-phillipson_7009004.jpg?20250902092346",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2025-09-09 19:17:00",
        "Headline": "Other candidates are racing to catch up ahead of a crunch deadline on Thursday - but there is concern about the logistics of a key hustings event in which contenders will make their pitch to undecided voters.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Bridget Phillipson has emerged as the early frontrunner in the Labour deputy leadership race as other candidates scramble to catch up ahead of a crunch deadline. The education secretary had the backing of 44 colleagues as of 6pm on Tuesday, according to the first official tally released by the Parliamentary Labour Party (PLP) since nominations opened. Former Commons leader Lucy Powell, who was sacked by Sir Keir Starmer in his reshuffle last week, is close behind with 35, followed by backbenchers Bell Ribeiro-Addy with eight, Dame Emily Thornberry with seven and Paula Barker with three.  Housing minister Alison McGovern is currently coming last with two nominations, though sources on her campaign team suggested this did not reflect the true level of support behind her. Candidates have until 5pm on Thursday to receive the backing of 80 colleagues, meaning there is still plenty left to play for as less than 100 MPs have made their official nominations so far, out of 398. A fresh tally will be published by the PLP on Wednesday evening, though MPs may publicly reveal who they are backing before then. Those not on the PLP's current list include Southport MP Patrick Hurley, who has thrown his weight behind Ms McGovern in a post on X. \n                  Bridget Phillipson: Mam was threatened with baseball bat\n                 \n                  Bridget Phillipson woos unions with promise to deliver employment rights uplift 'in full'\n                 \n                  Labour deputy leadership contest: How does it work and who is eligible to vote?\n                 Candidates will have the chance to woo undecided colleagues during a hustings event on Wednesday evening, but there are fears it could descend into chaos as the event will be held online only. That means hundreds of MPs will have just one hour to quiz the six contenders virtually. It is not clear if or how the event will be moderated. Ms Barker, the MP for Liverpool Wavertree, expressed concern about the logistics of the contest. Asked if she feels confident she can get the numbers, she told Sky News: \"I think the very tight timeframe and the fact hustings for MPs are being held online 8pm - 9pm when the majority of colleagues are travelling home undoubtedly compounds the issue. \"Of course, that is an issue to be addressed by whoever wins the race and at this moment in time we are all in the same boat.\" However, a Labour source defended the decision, saying: \"There's frankly no convenient time to do it. Ministers will have busy diaries serving the public during the day... priority has to remain public service.\" Ms Ribeiro-Addy has also criticised the contest's rules, telling Sky News' Politics Hub with Sophy Ridge that having just a few days to get 80 nominations \"doesn't feel right\", especially given the winner is \"ultimately decided by members\". Candidates who make it through the first round must go on to win the support of either 5% of Constituency Labour Parties (CLPs) or three organisations affiliated to the party, two of which must be trade unions. The successful candidates will then appear on the ballot for a vote of all party members and affiliated party supporters, with results declared on 25 October. The six-week timeline was set by Labour's ruling National Executive Committee but will be overseen by the party machinery who insist they will work with all candidates to give them a fair hearing. There are many MPs and ministers who want to see the contest done quickly, to avoid it being a distraction from the government's priorities. Explainer: Who is standing to replace Angela Rayner as deputy Labour leader?  Candidates make their pitch The race was triggered by the resignation of former deputy prime minister and housing secretary Angela Rayner after she admitted underpaying stamp duty on a flat she bought in Hove. Following calls for her replacement to be a Northern woman, all six candidates who entered are female, though Ms Ribeiro-Addy and Dame Emily represent seats in London. Ms Phillipson and Ms McGovern are seen as candidates that would remain loyal to Number 10, which some MPs want to see to avoid the party becoming more divided. They both honed in on their Northern roots while pitching themselves as the candidate to take on Reform UK when announcing their deputy leadership bids on Tuesday. Clapham and Brixton Hill MP Ms Ribeiro-Addy is seen as the left-wing candidate, and has the backing of many MPs in the Socialist Campaign Group (SCG) such as Corbynite Richard Burgon. However, Ms Baker, a former trade union official and Ms Thornberry, chair of the foreign affairs committee, have also vowed to challenge the government on issues like welfare and Gaza. Manchester Central MP Ms Powell was recently ousted from government and said she decided to stand \"after much encouragement\" from colleagues. A Survation survey of 1,308 Labour members who read the LabourList website suggested Ms Phillipson was the most popular choice for the role."
    },
    {
        "title": "Full line-up revealed for Sky News' The Immigration Debate",
        "description": "The full line-up for Sky News' The Immigration Debate hosted by Trevor Phillips has been announced.",
        "url": "https://news.sky.com/story/full-line-up-revealed-for-sky-news-the-immigration-debate-13427718",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-mike-tapp-zia-yusuf_7015344.png?20250909153810",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-09 15:29:00",
        "Headline": "The Immigration Debate, hosted by Sky News' Trevor Phillips in front of a live audience, will take place in Birmingham at 7pm on Wednesday 10 September.",
        "Content": " The full line-up for Sky News' The Immigration Debate hosted by Trevor Phillips has been announced. Home Office minister Mike Tapp, Reform UK's Zia Yusuf, shadow justice minister Kieran Mullan and Liberal Democrat MP Lisa Smart will take part in the event at 7pm on Wednesday 10 September. Each participant will set out their party's position in individual interviews with Trevor, before answering questions from a live audience to ensure perspectives from all sides of the debate are addressed. Then, from 8pm until 9pm, the special programme will continue, presented by Sarah-Jane Mee, with reaction from deputy political editor Sam Coates, economics and data editor Ed Conway and social affairs correspondent Becky Johnson. Zack Polanski, the new leader of the Green Party, will also be interviewed. Politics latest: Follow live updates If you would like to be part of this studio audience and have the opportunity to ask a question to one of the party representatives, please click here. Wednesday's debate is taking place after a summer of unrest over the issue of asylum hotels has provided Prime Minister Sir Keir Starmer with one of the toughest tests of his leadership so far. There has also been a record number of migrants crossing the Channel in small boats - with 29,003 having made the journey by 30 August, the most ever for this point in a year. Meanwhile, Reform UK leader Nigel Farage has promised to deport up to 600,000 asylum seekers if he wins the next election in 2029 - a plan opponents have criticised as unworkable. The developments mean immigration was the first thing on the government's agenda as it kicked off the first week back from recess on Monday. Sky News' immigration debate will give you the chance to make your voice heard and listen to both sides about an issue which is dividing communities."
    },
    {
        "title": "William and Harry show separate commitment to shared causes - it shows what a powerful team they could be",
        "description": "This industrial estate in Nottingham was certainly not the glamour of California.",
        "url": "https://news.sky.com/story/william-and-harry-show-separate-commitment-to-shared-causes-it-shows-what-a-powerful-team-they-could-be-13427697",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-duke-of-sussex-prince-harry_7015392.jpg?20250909163416",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-09-09 14:57:00",
        "Headline": "Harry seemed at home during his trip back, showing an enduring commitment to the UK on the same day his elder brother displayed his own loyalty to a similar cause.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  This industrial estate in Nottingham was certainly not the glamour of California. But Prince Harry could not have seemed more at home during his trip back, which was ultimately to see friends. Ever since he left for America, he's stayed in touch privately with community groups that do the vital work of trying to keep young people out of trouble and tackle youth violence. They have been discreet about his contact, and loyal to him. So now it felt like he was paying them back - with a huge million-pound donation from his own pocket, not from his charitable foundation. That's particularly interesting because we don't usually get told the amounts royals donate. But also when there's been so much chat about Harry and his money since he left the comfort of the Royal Family. It also seems to show a firm commitment to the UK that we've not physically seen from him in a while. Is this the half-in, half-out royal life that he always wanted? Other family members don't have a choice, of course. In London, Prince William was making a similar type of visit to an event in Lambeth focused on what his homelessness initiative, Homewards, is trying to do more specifically for young people. I was once told by a palace insider that Harry would be William's wingman when he became king. Their ongoing commitment to the same issues shows how much they could still be a powerful team if they could patch things up. As I watched Harry walk out of the recording studios, there was a serious feeling of deja vu. This had felt so similar to engagements I'd done with him on this very spot in the past, and that is hard to square with what's happened over the last five years. Read more on Sky News:Princes still so far apartHarry talks of sibling 'challenge'Will Harry meet the KIng? We thought he was leaving, but instead, he hopped over a small wall to chat and take photos with the crowd, despite his security team trying to guide him to the car. Will there be any other unexpected sights over the next two days? We'll have to wait and see."
    },
    {
        "title": "Police watchdog warns of difference between 'what is offensive and what is criminal'",
        "description": "Police must use common sense to decide what is a crime and what's offensive, the policing watchdog Sir Andy Cooke has told Sky News.",
        "url": "https://news.sky.com/story/police-watchdog-warns-of-difference-between-what-is-offensive-and-what-is-criminal-13427915",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-police-metropolitan_6992773.jpg?20250816154341",
        "type": "Home",
        "Author": "Martin Brunt",
        "Date Published": "2025-09-09 23:15:00",
        "Headline": "The chief inspector of constabulary told Sky News he felt \"non-crime hate incidents are no longer required, and they can be dealt with differently\".",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n Police must use common sense to decide what is a crime and what's offensive, the policing watchdog Sir Andy Cooke has told Sky News. Doing so would help lift continuing low public confidence in the police, which he said had dropped markedly in the past five years. He hit out after the wide condemnation of comedy writer Graham Linehan's arrest, publicly, by five armed officers for tweeting messages about trans issues, which allegedly incited violence.  Sir Andy, the chief inspector of constabulary, said: \"For me, non-crime hate incidents are no longer required, and they can be dealt with differently. \"I'm not saying it's not wrong to actually use that language, but is it a criminal offence that needs to be dealt with by the police, or can the police deal with it differently through using it as intelligence?\" He also questioned, like other police leaders, whether the laws governing social media were relevant today and should be updated. \"It's really difficult for policing to deal with the social media issues that we see now,\" he added. \"But there's always discretion and common sense that needs to be used as well. \"We need to get that balance, we need to decide what is offensive and what is criminal.\" Non-crime hate incidents are used by police to gather intelligence on increasing tensions, with the aim of spotting any signs of future violence or unrest. Debate over how they are used flared last year when officers from Essex Police visited Telegraph columnist Allison Pearson to arrange an interview about an entry on X. Palestine Action 'a major public order issue' Sir Andy defended officers who made mass arrests of peaceful protestors supporting Palestine Action, the group recently designated a terrorist organisation.  \"That decision has been made by the government,\" Sir Andy said. \"Policing needs to identify the best way to deal with that, which is an operational issue for the relevant commissioner or chief constable. \"It's a major public order issue.\" While he acknowledged most are not protesting violently, he said \"it's still a massive issue for the people of those cities where these protests are taking place, and the law is quite clear in relation to proscription\". \"It is a serious offence,\" he said. 'Once-in-a-lifetime opportunity' to reform policing Sir Andy was speaking ahead of the launch of his annual assessment of the state of policing in England and Wales. In his report, the former chief constable of Merseyside called for adequate funding to achieve government aims that include boosting neighbourhood policing, reducing knife crime and halving offences against women and girls. Sir Andy said: \"This is a once-in-a-lifetime opportunity to actually start that reform that policing needs, and it will be a missed opportunity if it's not properly funded from the start.\" Read more from Sky News:NHS publishes trust league tables for first timeWhat we have learnt from Harry's trip to the UKMan arrested after Heathrow terminal evacuation The National Police Chiefs Council has identified a £1.3bn shortfall in police funding over the next two years. Sir Andy said there were difficulties in hiring chief constables, with some job adverts attracting only one candidate and not always the right candidate. He also said that the much-needed recruitment of 20,000 rank-and-file officers over the past few years had happened too quickly and left forces with an average of more than one-third of staff with less than five years' experience."
    },
    {
        "title": "How much does the UK rely on legal migration?",
        "description": "\"Stop the boats\", \"smash the gangs\", \"one in, one out\".",
        "url": "https://news.sky.com/story/how-much-does-the-uk-rely-on-legal-migration-13427636",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-shabana-mahmood-legal-migration_7015329.png?20250909152005",
        "type": "UK",
        "Author": "Daniel Dunford",
        "Date Published": "2025-09-09 13:43:00",
        "Headline": "Sky News breaks down the UK's immigration numbers in recent years - with almost a million people moving to Britain legally in 2024.",
        "Content": "\n          Senior data journalist\n              @danieljdunford\n \"Stop the boats\", \"smash the gangs\", \"one in, one out\". In recent years, the most headline grabbing political promises on migration have involved people arriving in the country illegally, often on small boats. Shabana Mahmood, the new home secretary, has said the UK could suspend visas from countries that do not \"play ball\" and agree to returns deals for migrants. But 95% of immigration doesn't fit in this category.  Almost a million people moved to the UK legally in 2024. That compares with the near 44,000 who arrived \"irregularly\" - the Home Office term for people who arrive (or are found) in the UK without correct documentation. Immigration has made up 98% of recent population growth in the UK, according to the Office for National Statistics (ONS). \n                  Is good weather to blame for small boat crossings? It's not as simple as the government suggests\n                 \n                  How many people are coming to Britain on student visas?\n                 \n                  Fertility rates continue to fall, but number of births rise\n                 These are not the people living in detention centres or asylum hotels, but those who work, often in social care and the NHS, or study at British universities. Legal migration has also experienced some of the biggest changes in recent years - not just in terms of the raw numbers but who makes up those numbers. Through the 2010s, an average of 750,000 people moved to the UK each year. That grew by 75% within three years of Britain leaving the EU in 2020. One reason for the sudden growth - particularly from countries outside the EU like India, Pakistan and Nigeria - was the decision to introduce specialist health and care worker visas, and the fact that people coming for work or study could bring dependants with them. Both the health and care worker visa and the dependant rule have since been removed, which led to the immigration numbers falling back in 2024. The 2024 figure - 948,000 - is still 26% higher than the average from 2012-2019. In the 2010s, more than half of the people moving to the UK were from EU countries, while an additional 10% were Britons returning home. A third of people moving to Britain came from outside of the EU. As of 2024, eight in ten people moving to the country were from outside the EU. Other European countries have also experienced high levels of immigration in recent years. Almost two million people moved to Germany in 2022, falling to 1.3 million in 2023, the most recent year for which Eurostat provides data. More than a million people moved to Spain in both of those years as well, while the numbers for Italy and France have remained below 500,000 throughout the past 10 years. Pull factors: Why are people coming to the UK? Other than a period in 2023 when work was briefly the most popular reason, the opportunity to study at British universities has been the most common factor attracting people from outside of the EU to move to the UK over the past few years. The number of people coming for both of those reasons has fallen since people with work or study visas were no longer allowed to bring dependantsi with them, following a policy change introduced in March 2024 under Rishi Sunak’s premiership. The number of people coming for humanitarian reasons is down by more than two thirds compared with 2021 and 2022, when the war in Ukraine and the Taliban resurgence in Afghanistan led to many people needing to flee their countries at short notice. The number claiming asylum has more than doubled since 2019, however. It’s easy to see the impact of the changes to visa rules regarding dependants. The number of people moving to the UK because they were the dependant of someone studying fell by 86% between 2023 and 2024, from 123,000 to 17,000. The number of people on work dependant visas fell by a third over the same period. Work visa dependants are still allowed for people in a highly skilled role. The most common nationality of people emigrating to the UK from outside of the EU in 2024 was Indian (157,000), followed by Pakistani (76,000), Chinese (70,000), Nigerian (52,000) and Ukrainian (22,000). Three quarters of Chinese people who moved to the UK were on study visas. That was also the most popular reason among Indians. Among Nigerians and Pakistanis there were more people coming for work than study. The data around which EU countries people move to the UK from, or the reasons why they move to Britain, is not as detailed as it is for those from further afield, although the ONS is working on improving this in the coming months. A third of EU nationals have their reason for moving to the UK listed as “other”. That could mean they did not respond when asked why they were moving to the UK or that their response was non-specific - for example just saying “emigrating” or “immigrating”. Among those we do have detail on, more people come for work than to study. How much do universities rely on foreign students? Foreign students paid almost £12bn in tuition fees in the 2023-24 academic year, representing 47% of all fees received by British universities that year. Tuition fees make up 52% of the total income received by British universities, with the remainder coming from research grants, funding bodies, investments income, donations and other sources. Some major universities, for example the universities of Glasgow, Edinburgh and St Andrews in Scotland, as well as University College London, the London School of Economics, and Imperial College (also in London), received upwards of three quarters of their tuition fee income from foreign students. Around two-thirds of tuition fees paid to Oxford and Cambridge, as well as the universities of Manchester, Warwick and Southampton, came from students who were not based in the UK before they started their course of study. See how your academic institution compares with this lookup: The public generally has a positive attitude towards people coming to the UK for study, or those staying in the UK because they got a graduate job after their course has finished. A majority of people also support people coming for either high-skilled jobs, or low-skilled jobs where there is a shortage of British workers in the sector - for example agricultural workers or carers. Seven in 10 people still think that overall immigration numbers have been too high in recent years, however, including a majority of supporters of all the main political parties other than the Greens. Even among the Greens it's the most popular opinion. There are concerns that some people are abusing the student visa system by either telling UK immigration officials that they are coming to study but actually not having any intention of doing so, or overstaying their legal visa after their course has finished. Read more: How many people are coming to Britain on student visas? What industries do workers move to the UK for? Agriculture is the industry that attracts the most temporary workers, averaging 24,000 visa applications a year since 2021. But health and social care attracts the most applications for permanent visas - nearly 9,000 in the year to June 2025, despite falling almost 95% since 2023. In the year to June 2023, 383,000 people were granted a visa under the Health and Care Worker scheme, more than 220,000 of which were dependants of health and care workers. The Health and Care Worker visa was introduced by Boris Johnson’s government to create a fast-track route for would-be NHS employees and social care workers, to fill vacancies in the sector. It was cancelled in May this year as part of a general crackdown on visas for lower-skilled workers. That decision was described at the time as \"a crushing blow to an already fragile sector\" by Professor Martin Green, chief executive of Care England. \"Vacancies still remain sky-high, and many providers are on the brink of collapse,\" he added. \"Who do ministers think is going to care for people tomorrow, next week, or next month?\" Then home secretary Yvette Cooper said: \"It's about preventing this chaotic system where we had overseas recruitment soar while training in the UK was cut, and we saw low-skilled migration in particular hugely go up at the same time as UK residents in work or in training fell. That is a broken system. So that is what we need to change.\" The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Bridget Phillipson emerges as frontrunner in Labour's deputy leadership race",
        "description": "Bridget Phillipson has emerged as the early frontrunner in the Labour deputy leadership race as other candidates scramble to catch up ahead of a crunch deadline.",
        "url": "https://news.sky.com/story/bridget-phillipson-emerges-as-frontrunner-in-labours-deputy-leadership-race-13427824",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bridget-phillipson_7009004.jpg?20250902092346",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-09-09 19:17:00",
        "Headline": "Other candidates are racing to catch up ahead of a crunch deadline on Thursday - but there is concern about the logistics of a key hustings event in which contenders will make their pitch to undecided voters.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Bridget Phillipson has emerged as the early frontrunner in the Labour deputy leadership race as other candidates scramble to catch up ahead of a crunch deadline. The education secretary had the backing of 44 colleagues as of 6pm on Tuesday, according to the first official tally released by the Parliamentary Labour Party (PLP) since nominations opened. Former Commons leader Lucy Powell, who was sacked by Sir Keir Starmer in his reshuffle last week, is close behind with 35, followed by backbenchers Bell Ribeiro-Addy with eight, Dame Emily Thornberry with seven and Paula Barker with three.  Housing minister Alison McGovern is currently coming last with two nominations, though sources on her campaign team suggested this did not reflect the true level of support behind her. Candidates have until 5pm on Thursday to receive the backing of 80 colleagues, meaning there is still plenty left to play for as less than 100 MPs have made their official nominations so far, out of 398. A fresh tally will be published by the PLP on Wednesday evening, though MPs may publicly reveal who they are backing before then. Those not on the PLP's current list include Southport MP Patrick Hurley, who has thrown his weight behind Ms McGovern in a post on X. \n                  Bridget Phillipson: Mam was threatened with baseball bat\n                 \n                  Bridget Phillipson woos unions with promise to deliver employment rights uplift 'in full'\n                 \n                  Labour deputy leadership contest: How does it work and who is eligible to vote?\n                 Candidates will have the chance to woo undecided colleagues during a hustings event on Wednesday evening, but there are fears it could descend into chaos as the event will be held online only. That means hundreds of MPs will have just one hour to quiz the six contenders virtually. It is not clear if or how the event will be moderated. Ms Barker, the MP for Liverpool Wavertree, expressed concern about the logistics of the contest. Asked if she feels confident she can get the numbers, she told Sky News: \"I think the very tight timeframe and the fact hustings for MPs are being held online 8pm - 9pm when the majority of colleagues are travelling home undoubtedly compounds the issue. \"Of course, that is an issue to be addressed by whoever wins the race and at this moment in time we are all in the same boat.\" However, a Labour source defended the decision, saying: \"There's frankly no convenient time to do it. Ministers will have busy diaries serving the public during the day... priority has to remain public service.\" Ms Ribeiro-Addy has also criticised the contest's rules, telling Sky News' Politics Hub with Sophy Ridge that having just a few days to get 80 nominations \"doesn't feel right\", especially given the winner is \"ultimately decided by members\". Candidates who make it through the first round must go on to win the support of either 5% of Constituency Labour Parties (CLPs) or three organisations affiliated to the party, two of which must be trade unions. The successful candidates will then appear on the ballot for a vote of all party members and affiliated party supporters, with results declared on 25 October. The six-week timeline was set by Labour's ruling National Executive Committee but will be overseen by the party machinery who insist they will work with all candidates to give them a fair hearing. There are many MPs and ministers who want to see the contest done quickly, to avoid it being a distraction from the government's priorities. Explainer: Who is standing to replace Angela Rayner as deputy Labour leader?  Candidates make their pitch The race was triggered by the resignation of former deputy prime minister and housing secretary Angela Rayner after she admitted underpaying stamp duty on a flat she bought in Hove. Following calls for her replacement to be a Northern woman, all six candidates who entered are female, though Ms Ribeiro-Addy and Dame Emily represent seats in London. Ms Phillipson and Ms McGovern are seen as candidates that would remain loyal to Number 10, which some MPs want to see to avoid the party becoming more divided. They both honed in on their Northern roots while pitching themselves as the candidate to take on Reform UK when announcing their deputy leadership bids on Tuesday. Clapham and Brixton Hill MP Ms Ribeiro-Addy is seen as the left-wing candidate, and has the backing of many MPs in the Socialist Campaign Group (SCG) such as Corbynite Richard Burgon. However, Ms Baker, a former trade union official and Ms Thornberry, chair of the foreign affairs committee, have also vowed to challenge the government on issues like welfare and Gaza. Manchester Central MP Ms Powell was recently ousted from government and said she decided to stand \"after much encouragement\" from colleagues. A Survation survey of 1,308 Labour members who read the LabourList website suggested Ms Phillipson was the most popular choice for the role."
    },
    {
        "title": "Jaguar Land Rover getting 'daily' support as workers told to stay at home",
        "description": "Jaguar Land Rover is getting \"daily\" support from the government after last week's cyber attack, which has ground its operations to a halt.",
        "url": "https://news.sky.com/story/jaguar-land-rover-getting-daily-support-as-workers-told-to-stay-at-home-13427714",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jaguar-land-rover_7009369.jpg?20250902155229",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-09 15:26:00",
        "Headline": "Sky News understands JLR workers are not due back at work on Wednesday with production suspended for another day.",
        "Content": "Jaguar Land Rover is getting \"daily\" support from the government after last week's cyber attack, which has ground its operations to a halt. The British car maker shut down operations when it spotted the attack last Tuesday, and its staff have been told to stay at home since. Sky News understands JLR workers are not due back at work on Wednesday, with production suspended for another day.   When asked for a timeline on when operations would resume for all of the company's 34,000 UK workers, business minister Sir Chris Bryant said: \"I wish that I could provide one, but I cannot. \"This is a very live situation that has been ongoing for a week.\" He also said he could not share details on who was behind the attack, despite hacking group Scattered Spider claiming responsibility. Scattered Spider was blamed for the attacks on British retailers earlier this year, which are thought to have cost M&S around £300m. Four people were arrested for their suspected involvement in the April attacks and have been bailed. Asked whether the incident was linked to the M&S attack earlier this year, Mr Bryant said he could not say as he \"didn't know\". \"I do not think anybody has come to any secure decisions on that,\" he said. Read more:Murdoch family reach deal over future of empireMore than 20 civilians killed in 'brutal' Russian strike on Donetsk Jaguar Land Rover (JLR) has invited local MPs whose constituents are impacted by the shutdown to a Q&A session on Friday. \"The JLR Halewood plant in my constituency is an important and valued employer,\" said Labour MP Derek Twigg, who asked an urgent question about the government's response to the attack in the Commons on Tuesday. \"Many of my constituents are employees, which is also the case for my neighbouring Merseyside MPs. Thousands of jobs in the supply chain have been affected.\" JLR employs 39,000 people around the world, with many more working in its supply chains. Mr Twigg warned: \"There could be an ongoing and even more serious effect on our economy.\" In his response, Sir Chris said: \"We simply cannot afford any degree of complacency in this. \"There are major criminals operating in this space, as well as some malicious state actors, and some 40% of companies in the UK last year reported that they had faced some kind of cyber attack. \"So it is a very important issue that we take seriously.\" JLR said it continues \"to work around the clock\" to restart work in a \"controlled and safe manner\". \"We are very sorry for the disruption this incident has caused. Our retail partners remain open and we will continue to provide further updates.\""
    },
    {
        "title": "Bridget Phillipson: Mam was threatened with baseball bat",
        "description": "In her first audition for the job of Labour deputy leader, Bridget Phillipson came to Brighton to woo the trade unions. And she began with a traumatic story about her childhood.",
        "url": "https://news.sky.com/story/bridget-phillipson-mam-was-threatened-with-baseball-bat-13427764",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-bridget-phillipson_6959935.jpg?20250708102236",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-09-09 17:01:00",
        "Headline": "The education secretary is one of six women, so far, standing to replace Angela Rayner as deputy Labour leader.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n In her first audition for the job of Labour deputy leader, Bridget Phillipson came to Brighton to woo the trade unions. And she began with a traumatic story about her childhood. By the time she rose to address the Trades Union Congress (TUC) conference at 3.30pm, she was one of no fewer than six candidates, all women, having announced her bid as \"a proud working-class woman from the North East from a single-parent family\". And as is the habit of candidates for election to high office these days - Sir Keir Starmer first told the story about his father Rodney the toolmaker in a speech at a TUC conference - she told delegates about an ordeal during her childhood. Politics latest: Sixth MP enters deputy race  \"I grew up on a street of council houses in Washington, in the North East - just me and my mam,\" she said. Note she said \"mam\", not \"mother\". \"And back when I was young,\" she continued, \"a man turned up at the front door with a baseball bat. \n                  Bridget Phillipson emerges as frontrunner in Labour's deputy leadership race\n                 \n                  Bridget Phillipson woos unions with promise to deliver employment rights uplift 'in full'\n                 \n                  Labour deputy leadership contest: How does it work and who is eligible to vote?\n                 \"A few weeks earlier, we'd been burgled - and my mam had reported it to the police. Now the man had come back to scare her into silence. \"He clearly didn't know my mam though. Because even at nine years old I could have told him he was wasting his time. \"She stood her ground. He went to prison.\" And the lesson she learned? \"From my mam I learned about strength,\" she said. \"Not the kind that preys on the weak. \"No, I learned the kind that stands up to adversity. The strength to do what's right, even if it would be easier to crumble. \"That street of ours had challenges, yes, of course. But there was kindness. There was compassion. So much of it. \"There was our neighbour who knew that we were struggling one winter, posted an envelope through the letterbox, marked 'for Bridget's coat'. \"And I never forget that kindness. \"There were my grandparents, too, who moved here from Ireland. A happy presence in my childhood. \"It's from my grandad that I get my love of reading and learning. From the days when he would bounce me on his knee - book in hand.\" Read more: Who is standing to replace Rayner as deputy Labour leader?  She could have gone on to say that that love of reading took her from her Catholic high school to Oxford University, where she graduated in history and modern languages. Her grandfather, she said, fought on the front line in the Second World War, then was in the vanguard of new nurses helping to build the new National Health Service, under the Attlee government. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 \"And so, congress, when people ask me where my values come from, I point to my mam, to my grandparents, to my neighbours, to my community,\" she said. Lots of politicians claim working class origins, poverty and hardship. And no doubt some of them embellish their humble back story for political advantage. But Bridget Phillipson is the genuine working class article. And her story - like Sir Keir's Rodney the toolmaker - is one we'll no doubt hear a lot more during this deputy leader election campaign."
    },
    {
        "title": "UK internet user helps stop teenager launching deadly attack on Ukrainian school",
        "description": "A UK internet user helped police stop a teenager from unleashing a deadly attack on his school in Ukraine, the Metropolitan Police has said.",
        "url": "https://news.sky.com/story/uk-internet-user-helps-stop-teenager-launching-deadly-attack-on-ukrainian-school-13427703",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ukraine-school-attack_7015404.jpg?20250909164225",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-09 15:18:00",
        "Headline": "The anonymous referral to the Met's Counter Terrorism Internet Referral Unit was passed to Europol, which alerted Ukrainian authorities.",
        "Content": "A UK internet user helped police stop a teenager from unleashing a deadly attack on his school in Ukraine, the Metropolitan Police has said. The anonymous referral was made to the Met's Counter Terrorism Internet Referral Unit on 4 September, according to the force. It warned of an \"imminent attack being planned by an individual in Ukraine\" and was immediately passed to Europol to help alert local police. A day later, a 15-year-old boy was arrested at a school in Zakarpattia, western Ukraine, the country's ministry for internal affairs confirmed in a post on X.  The boy was a student at the school and was arrested with a knife in his backpack while he was livestreaming the incident online, the post revealed. It was accompanied by an image of the knife, phone, and rucksack seized by police at the scene. Read more from Sky NewsOnline conspiracies over deaths of 16 election candidatesIsrael launches strikes on Hamas in QatarSix killed in rush hour bus shooting Commander Dominic Murphy, of the Met's Counter Terrorism Command, described the intel and subsequent response as a \"truly remarkable piece of work\". \"The swift actions by our officers alerting Ukrainian counterparts have helped to avert what could have been a potentially devastating attack at a school in Ukraine,\" he said. \"It's all the more remarkable when you consider the incredible difficulties those in Ukraine are facing while fighting a war, but thanks to our collective efforts, lives have almost certainly been saved.\" He urged people in the UK to report anything suspicious they see online to the Met's internet unit so they can work with international partners to thwart other potential incidents."
    },
    {
        "title": "Kemi Badenoch reveals her conditions for helping Sir Keir Starmer with 'out of control' welfare spending",
        "description": "Kemi Badenoch has offered to help the government pass legislation to slash the welfare bill - but with conditions attached.",
        "url": "https://news.sky.com/story/kemi-badenoch-reveals-her-conditions-for-helping-sir-keir-starmer-with-out-of-control-welfare-spending-13427687",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-kemi-badenoch-conservative_7015086.jpg?20250909132657",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-09 14:52:00",
        "Headline": "Labour brand the Tory leader \"delusional\" after she said her party would \"always act in the national interest\".",
        "Content": " Kemi Badenoch has offered to help the government pass legislation to slash the welfare bill - but with conditions attached. In a speech on Tuesday morning, the Conservative Party leader accused the government of having \"totally lost control of spending\" and \"leading Britain into a deeper and deeper crisis\". She argued that the only way to fix the issue was to dramatically reduce the welfare budget - and set out to Sky News political correspondent Tamara Cohen her conditions for supporting the government. Politics latest: Six MPs enter deputy Labour leader race  Speaking at the Institute of Chartered Accountants, Ms Badenoch said: \"We are the only party arguing that government has to live within its means. \"Every single other political party in parliament today, every single other one, wants to increase welfare spending and they voted to do so. \n                  Boris Johnson ally Nadine Dorries latest Tory to defect to Reform UK\n                 \n                  Everything you need to know about being a political party member\n                 \n                  Former Conservative MP David Warburton accused of sexual misconduct and cocaine use, dies 'unexpectedly' at 59\n                 \"They wanted to lift the so-called two child benefit cap. They don't mind that our sickness benefits bill alone is on course to reach £100bn by 2030.\" The Tory leader said the chancellor will have no option but to raise taxes at the budget in the autumn to fund Labour's spending plans, and also pay the interest on the vast government debt.  But she claimed that \"some in government must know that things need to change\", saying: \"You can picture their grim faces, looking at the latest OBR [Office for Budget Responsibility forecast] figures. \"But the truth is they came into government with no real plans for how to save money - only how to spend it. That's why they are in trouble.\" To that end, she said she is \"making the prime minister a serious offer\" because \"the Conservative Party will always act in the national interest\". 👉Listen to Politics At Sam And Anne's on your podcast app👈  She noted that Sir Keir Starmer had tried to cut welfare spending by targeting benefits paid to disabled people, but had to \"gut\" the legislation just before the vote and was \"humiliated by his own backbenches\". But she continued: \"If he is serious about cutting spending, and really bringing down the welfare bill, we will help him.\" And pointing to Angela Rayner's resignation, and the ensuing contest for a new deputy Labour leader, Ms Badneoch said: \"Whether he wants to admit it or not, Keir Starmer needs our help.\" 'We need to find common ground' Speaking to Sky News after her speech, the Tory leader said she will only support new government legislation on welfare as long as it brings the total spending down. \"Right now, what I'm offering is for us to sit down together and find common ground,\" she told Cohen. \"We know that this is difficult, but Conservatives have done this before. We had to find welfare savings and reform welfare in the coalition, [majority] government and after, and we can do it again.\" She insisted the Tories reduced the welfare bill before the pandemic, when it started going up again. She said: \"We fixed the previous problem. There is now a new problem and what we're saying is let's work together to fix it.\" \"If we don't live within our means, we will go bankrupt and our children will have to pay off the debt,\" she added. 'Stop all these distractions' Ms Badenoch was also challenged on her claim that she was offered a scholarship place at the Stanford Medical School in California, which The Guardian reports has been denied by the admissions staff who were there at the time. She told Cohen: \"They've been told something that I didn't say. I didn't say I was offered a place - I said I was offered a scholarship, a part scholarship. I hadn't applied for it. \"But I stand by every single thing that I said. It's something American universities do. They send out speculative offers.\" She called on people to \"stop all these distractions about who said what, and who's up and who is down\", and focus on Angela Rayner's property taxes, and the economy. \"I tell the truth. I stand by what I said. But right now, the truth is our economy is going in the wrong direction - it's in free fall, and we have got to fix this.\" A Labour Party spokesperson rejected Ms Badenoch's offer of help. \"It's delusional of Kemi Badenoch to think anyone would want to take economic advice from her Conservative Party,\" they said. \"Their economy-crashing, growth-killing, irresponsible approach to governing left mortgages spiralling and working people worse off. \"The only thing in Britain that needs a bailout is the Conservative Party from its leadership. The Tories haven't listened, they haven't learned, and they can't be trusted. \"Labour is clear that people who can work should work. This Labour government is getting people back into the workplace and out of the doom loop of joblessness that spiralled out of control under the Conservatives.\""
    },
    {
        "title": "Woman dies after small boat rescue operation in English Channel",
        "description": "A woman has died after \"small boat activity\" sparked a rescue operation in the English Channel.",
        "url": "https://news.sky.com/story/woman-dies-after-small-boats-rescue-operation-in-english-channel-13427634",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-dover-kent-coastguard_7015302.jpg?20250909164621",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-09 13:33:00",
        "Headline": "Police say the woman was airlifted to shore where she was pronounced dead. It follows a rescue operation in response to \"small boat activity\".",
        "Content": "A woman has died after \"small boat activity\" sparked a rescue operation in the English Channel. In a statement, Kent Police said it was \"made aware by the Coastguard of an incident in the channel involving a small boat just after 1pm\". \"One woman was airlifted back to shore where she was pronounced deceased,\" police said. \"Officers are conducing enquiries to establish the circumstances surrounding the incident.\"   A government spokesperson said Border Force \"responded to reports of a migrant boat in distress in the Channel at 1245 this afternoon\". \"One passenger was found unresponsive and was given CPR,\" they said. \"Sadly, we can now confirm that this individual has died.\" They said the government was \"shocked and saddened by this tragic incident\". \"Our immediate thoughts are with all of those who have been affected,\" the spokesman said, before adding: \"This latest tragedy underlines the terrible dangers of small boat crossings, and we continue to do everything we can to prevent callous criminals exploiting vulnerable people.\"  Earlier, the Maritime and Coastguard Agency said it sent UK Border Force vessels, RNLI [Royal National Lifeboat Institution] lifeboats, and HM Coastguard aircraft, in response to small boat activity reported in the Channel on Tuesday. A coastguard emergency helicopter was spotted flying above the Port of Dover. Read more from Sky News:Israel launches strikes on Hamas leaders in DohaMan arrested after Heathrow Airport incident The RNLI confirmed it responded to \"incidents in the Channel\". Two of its vessels were seen on a marine tracker heading to the rescue site, around 10 minutes from the coast. Two coastguard vans and ambulances were also pictured waiting to receive people from the boats at the Port of Dover. A group of people, thought to be migrants, have since been pictured being brought in to the Border Force compound in Dover, Kent, from one of its vessels."
    },
    {
        "title": "Police watchdog warns of difference between 'what is offensive and what is criminal'",
        "description": "Police must use common sense to decide what is a crime and what's offensive, the policing watchdog Sir Andy Cooke has told Sky News.",
        "url": "https://news.sky.com/story/police-watchdog-warns-of-difference-between-what-is-offensive-and-what-is-criminal-13427915",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-police-metropolitan_6992773.jpg?20250816154341",
        "type": "UK",
        "Author": "Martin Brunt",
        "Date Published": "2025-09-09 23:15:00",
        "Headline": "The chief inspector of constabulary told Sky News he felt \"non-crime hate incidents are no longer required, and they can be dealt with differently\".",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n Police must use common sense to decide what is a crime and what's offensive, the policing watchdog Sir Andy Cooke has told Sky News. Doing so would help lift continuing low public confidence in the police, which he said had dropped markedly in the past five years. He hit out after the wide condemnation of comedy writer Graham Linehan's arrest, publicly, by five armed officers for tweeting messages about trans issues, which allegedly incited violence.  Sir Andy, the chief inspector of constabulary, said: \"For me, non-crime hate incidents are no longer required, and they can be dealt with differently. \"I'm not saying it's not wrong to actually use that language, but is it a criminal offence that needs to be dealt with by the police, or can the police deal with it differently through using it as intelligence?\" He also questioned, like other police leaders, whether the laws governing social media were relevant today and should be updated. \"It's really difficult for policing to deal with the social media issues that we see now,\" he added. \"But there's always discretion and common sense that needs to be used as well. \"We need to get that balance, we need to decide what is offensive and what is criminal.\" Non-crime hate incidents are used by police to gather intelligence on increasing tensions, with the aim of spotting any signs of future violence or unrest. Debate over how they are used flared last year when officers from Essex Police visited Telegraph columnist Allison Pearson to arrange an interview about an entry on X. Palestine Action 'a major public order issue' Sir Andy defended officers who made mass arrests of peaceful protestors supporting Palestine Action, the group recently designated a terrorist organisation.  \"That decision has been made by the government,\" Sir Andy said. \"Policing needs to identify the best way to deal with that, which is an operational issue for the relevant commissioner or chief constable. \"It's a major public order issue.\" While he acknowledged most are not protesting violently, he said \"it's still a massive issue for the people of those cities where these protests are taking place, and the law is quite clear in relation to proscription\". \"It is a serious offence,\" he said. 'Once-in-a-lifetime opportunity' to reform policing Sir Andy was speaking ahead of the launch of his annual assessment of the state of policing in England and Wales. In his report, the former chief constable of Merseyside called for adequate funding to achieve government aims that include boosting neighbourhood policing, reducing knife crime and halving offences against women and girls. Sir Andy said: \"This is a once-in-a-lifetime opportunity to actually start that reform that policing needs, and it will be a missed opportunity if it's not properly funded from the start.\" Read more from Sky News:NHS publishes trust league tables for first timeWhat we have learnt from Harry's trip to the UKMan arrested after Heathrow terminal evacuation The National Police Chiefs Council has identified a £1.3bn shortfall in police funding over the next two years. Sir Andy said there were difficulties in hiring chief constables, with some job adverts attracting only one candidate and not always the right candidate. He also said that the much-needed recruitment of 20,000 rank-and-file officers over the past few years had happened too quickly and left forces with an average of more than one-third of staff with less than five years' experience."
    },
    {
        "title": "On the streets with some of England's flag-raisers - as one reveals role of Tommy Robinson",
        "description": "\"I'm incredibly patriotic,\" says Ross, \"I love our flag.\" ",
        "url": "https://news.sky.com/story/on-the-streets-with-some-of-englands-flag-raisers-as-one-reveals-role-of-tommy-robinson-13427749",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-immigration-graphics_7015669.jpg?20250910023923",
        "type": "UK",
        "Author": "Becky Johnson",
        "Date Published": "2025-09-09 16:30:00",
        "Headline": "A bystander calls their behaviour \"shameful\", while another says they've asked the council to remove them. But to Ross and his group, flags are about patriotism and pride, even if it has been timed to coincide with concerns about immigration.",
        "Content": "\n          Social Affairs correspondent\n              @BeckyJohnsonSky\n  \"I'm incredibly patriotic,\" says Ross, \"I love our flag.\"  He's pulling a trailer loaded with England flags, otherwise known as the flag of St George, and Union flags, while his friends carry a ladder. They're heading out to fly flags from lamp posts in his hometown, Lichfield. We're here to spend an evening with them - keen to understand why flags are appearing on streets across England and what people make of it. As the flags go up, several passing drivers beep and shout their support. But it isn't long before a man and woman walk past, visibly annoyed. \"Shameful behaviour,\" the woman tells the group. One of Ross's group calls back: \"Why can't you be proud?\" \"I am proud, but we're absolutely tripping over from patriotism to an overt display of nationalism,\" the man replies. \"There have been many occasions throughout history where the British flag has been adopted by groups that I don't agree with\". It's a tense moment. Read more: Why have flags started appearing across the UK? I ask Ross, 27, if the flying of the flags is timed to coincide with concerns about immigration. \"Yes,\" he replies. \"My personal stance on it is, yes, this is us saying 'you're in our country', right? \"This is what we stand for, you bow to this flag how we do, right, and you shouldn't be doing illegal things, and for example, raping the women and committing crimes, which we don't agree with.\" He tells me some of the handful of people he's with went to the same school as him. But Octavia, the only woman in their group, only met them recently. \"She bumped into us the other day, and now she's a full-fledged flagger,\" Ross says. Octavia, 27, lifts her jumper to reveal she's wearing an England flag dress. \"I saw him putting up the flags and I genuinely wondered why,\" she says. \"He kind of explained to me, like, we're protecting people of Britain, we are spreading awareness, that is literally all, and I was really happy to get involved\". As the next flag is being put up, a man walks past and breaks into song. \"No surrender, no surrender, no surrender to the boats coming over,\" he sings. Ross, filming him, thanks him for his \"performance\". Social Affairs correspondent Over the course of an evening in Lichfield, we struggled to find anyone who didn’t have an opinion on the flags appearing around the town.\n\n Yet we did find people who were reticent to speak on camera, particularly those opposed to the flags being there. \n This is a town where around 93% of residents were born in England, according to the census in 2021.  Unlike many British towns and cities, there is little visible evidence of the mass migration this country has experienced in recent decades.\n\n Octavia, the newest recruit to the group of “flaggers” we met, grew up in Leicester, where just under 58% of people were born in England.\n\n After meeting people opposed to the flags in Lichfield, she told me “they’re wealthy, they live in a nice area, they don't actually have to go through the struggles that everybody else does”.\n\n She then revealed her opposition to migrant hotels is in part because she was once at risk of homelessness and didn’t get state support.\n\n But from what we saw, it would be wrong to conclude that there are obvious dividing lines in this debate.\n\n On both sides, there were people from a range of different backgrounds, young and old. \n\n Some see a display of pure patriotism. To others, it’s blatant nationalism that has to stop.\n\n But in these uneasy times, the removal of any flags has been seized on as a political act that has sparked anger in communities.\n A woman sees it all happen and tells us her husband has written to the council to ask for the flags to be removed. She's unhappy about how it may make the town feel for some people. But she doesn't want to go on camera - or even have her words recorded. I ask Ross about his political views. He says he doesn't belong to any party, but he tells me he supports Tommy Robinson - and had been with him the previous evening. He got the flags they're putting up from him. Further down the street, we meet Bob. He's just out for dinner. We get talking about the flags. \"It's not a racist thing just to be wanting to look after your people,\" Ross tells him. Bob agrees, but is concerned about why flags are going up now. Tap here to see the full line-up for Sky News' The Immigration Debate \"It's become quite extreme,\" he says. I ask if he thinks the flag is being used as a racist symbol. \"100% yeah, I do,\" he says. But an elderly couple over the road completely disagrees with him. \"Of course, we support St George's flag, we're British,\" the woman says. Read more on immigration:What's driven UK's astounding immigration levels?Labour weigh up military barracks to house asylum seekersHow much does the UK rely on legal migration? \"There's nothing wrong with showing the English flag,\" her husband agrees. It's hard to find anyone who doesn't have a view on the flags appearing around the town. We leave Lichfield with a sense that they're provoking strong feelings on both sides of a very live national debate."
    },
    {
        "title": "Trump denies knowledge of Israel's 'unfortunate' strike on Qatar - as Starmer joins global condemnation",
        "description": "Donald Trump has distanced the US from Israel's \"unfortunate\" strike in Qatar, which drew international condemnation and killed five members of Hamas.",
        "url": "https://news.sky.com/story/trump-denies-knowledge-of-israels-unfortunate-strike-on-qatar-as-starmer-joins-global-condemnation-13427908",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-qatar-israel-trump_7015659.jpg?20250910003346",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-09 21:58:00",
        "Headline": "Sir Keir Starmer has condemned Israel's strike ahead of his controversial meeting with Israeli President Isaac Herzog in London, saying it violates Qatar's sovereignty and risks further escalation in the region.",
        "Content": " Donald Trump has distanced the US from Israel's \"unfortunate\" strike in Qatar, which drew international condemnation and killed five members of Hamas. The Israeli Defence Forces said it carried out Tuesday's strike in Doha \"targeting the senior leadership of the Hamas terrorist organisation\". Prime Minister Benjamin Netanyahu's office said \"Israel initiated it, Israel conducted it, and Israel takes full responsibility\" for the attack - which the US president echoed on Truth Social. As it happened: NATO member says it will stand by Qatar Mr Trump said the US military notified his administration about the Israeli attack on the Qatari capital, and added: \"It was not a decision made by me. \"Unilaterally bombing inside Qatar, a Sovereign Nation and close Ally of the United States, that is working very hard and bravely taking risks with us to broker Peace, does not advance Israel or America's goals.\" Mr Trump then said however that eliminating Hamas \"is a worthy goal,\" and that he believes \"this unfortunate incident could serve as an opportunity for PEACE\". Speaking to reporters a little later, he said he was \"not thrilled\" about the strike and would make a \"full statement\" on Wednesday.  Qatar's UN ambassador says strike 'cowardly' Mr Netanyahu said the operation was a \"surgical, precision strike,\" and claimed it was \"completely justified\" after six people were killed in Jerusalem - which Hamas took responsibility for. Meanwhile, Qatar's interior ministry said that a member of its security forces were killed in Israel's strike, and its UN ambassador called the attack a \"criminal assault\" and \"cowardly\" act.  Alya Ahmed Saif Al-Thani told the United Nations Security Council that Qatar \"not tolerate this reckless Israeli behavior and the ongoing disruption of regional security,\" adding the strike \"constitutes a blatant violation of all international laws and norms\". In a phone call with Mr Trump, Qatari Emir Sheikh Tamim bin Hamad Al-Thani also said Qatar will take all necessary measures to protect its security and preserve its sovereignty. Read more on this story:Hard to see how Doha airstrike helps Israeli hostagesUS 'feels badly' about Qatar attack  Starmer condemns strike ahead of Herzog visit UK Prime Minister Sir Keir Starmer also condemned Israel's strike, saying it violates Qatar's sovereignty and risks further escalation in the region. His comments came ahead of Israeli President Isaac Herzog's visit to Britain, where he will meet with the prime minister this afternoon. Sir Keir said in a statement he intends to raise the issue of the \"intolerable situation\" in Gaza with Mr Herzog, adding: \"We've been clear Israel must take action to end [the] horrific scenes.\" In a phone call with the Emir of Qatar, Sir Keir also \"gave his condolences for the death of a Qatari security officer killed in the attack\", according to a Downing Street readout. Protests against Mr Herzog's visit are widely expected throughout his visit. Demonstrators gathered outside Downing Street yesterday to protest his arrival, while Green Party leader Zack Polanski told Sky News that the official should be arrested. Mr Polanski, who is Jewish, said: \"Welcoming a potential war criminal to the UK is another demonstration of how this Labour government is implicated in the ongoing genocide in Gaza. \"It also serves as a brutal insult to those mourning the thousands of innocent lives lost and to hundreds of thousands of Palestinians facing ongoing violence and hunger.\" Read more from Sky News:Disconnect between Mandelson's claim and his Epstein letterAnalysis: Nepal protests a powder keg momentWhat we have learnt from Harry's trip to the UK Israel has strongly denied that its actions in Gaza amount to genocide, but is being challenged on the issue in a case at the International Court of Justice in The Hague. The world's leading association of genocide scholars, as well as several Israeli human rights organisations, have already accused the country of genocide."
    },
    {
        "title": "Nepal's anti-government protests are a powder keg moment that could change the country for years",
        "description": "As we flew into Kathmandu, you could already see from the sky, the fury playing out on the streets below.",
        "url": "https://news.sky.com/story/nepals-anti-government-protests-are-a-powder-keg-moment-that-could-change-the-country-for-years-13427828",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nepal-protest-cordelia-lynch_7015591.jpg?20250909211547",
        "type": "World",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-09-09 19:34:00",
        "Headline": "The second day of intense protests felt like something seismic: The leadership lifted restrictions on social media, and the prime minister resigned, but that wasn't enough to satisfy the thousands defying a curfew.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  As we flew into Kathmandu, you could already see from the sky, the fury playing out on the streets below. Huge plumes of smoke rose over the Nepalese capital. It was the second day of intense protests, and it soon felt like something seismic. On the ground, it was kinetic and chaotic. We landed just before the army closed the airport. The protesters were minutes away. On the road, a constant stream of young people sped by on motorbikes, honking their horns as they raced towards parliament.  Some were carrying batons, others guns, some simply using their voices, declaring a \"revolution\". We watched as they set fire to a police station. Many, already angry, were incensed by the deaths of 19 people on Monday - accusing the police of using live ammunition to silence dissent. The government has so far only acknowledged using rubber bullets and tear gas.  The leadership did lift the restrictions on social media - allowing people to use apps like X, YouTube and Instagram once again. And soon after, Nepalese Prime Minister KP Sharma Oli resigned. But that wasn't enough to satisfy the thousands defying the curfew. Nearly everyone we spoke to shared the same message - this was not about any platform - it was about something far deeper and far more entrenched. \"This protest is not against the social media ban,\" one man said as he raced through on a bike. \"This is against the big corruption that these ministers have done for the past few decades. \"We were suppressed. Now we have a voice.\" Throughout the day, you could feel people getting more emboldened. It was less than 24 hours before that we'd seen police firing at protesters - some victims died in their school uniforms. But on Tuesday, we didn't see a single officer. The only army we clocked was at the airport. And their absence was no more glaring than at the very centre of politics. Parliament House, home to lawmakers, was engulfed in flames as we approached. Protesters were rejoicing outside - thousands cheering as the building burned. It was surreal. The building looked abandoned - overrun by those who want radical change. \"They have given an open challenge to Gen Z,\" one man told me, punching his wooden stick into the air as he spoke. \"You should not challenge the youth or challenge Gen Z.\" I asked a young woman, Sandeep Bista, 26, if she was worried about more violence, given that 19 people had already died. \"I think to gain something you have to lose something,\" she said. \"So they're patriots for us. But today I'm happy. Revolution is coming.\" As the light faded, the mood shifted, people edging closer until they finally stormed inside - large groups clutching phones - seemingly undeterred by the sound of small explosions. There was smashed glass everywhere, dust obscuring the winding stairs. People climbed up them to try and grab or destroy what little was left - relics to remember the day by. Some came back with gleeful faces, holding bits of gold furniture and decoration - a symbol of the elite they've come to loathe. Read more from Sky News:Hard to see how Doha airstrike helps Israeli hostagesExpert examines 'Trump signature' in Epstein birthday book Elsewhere in the city, politicians were attacked, their homes targeted. The young people here feel on the cusp of victory and the right side of history. When you ask them what justice looks like, they say they want equality - a leadership that addresses their needs. Quite what that equality looks like seems harder for them to specify. But a wholesale change in leadership appears to be a crucial demand. The big question is, what next? We don't yet know who might take over from the prime minister. The police clearly chose to stay away on Tuesday - no doubt fearful of the reception they'd receive. But by evening, the Nepali army vowed to \"take control of the situation\". From what we saw, calm currently feels pretty elusive. Hundreds of inmates have escaped prisons, politicians' home addresses are being shared online, and many young people who feel they have waited far too long already want dramatic change and quickly. Read more from Cordelia Lynch:The red pill explosion fuelling a secret detox ritualAt the scene of mosque hit by an Indian missile strike It is a powder keg moment that could change the course of the country for many years to come. Like the recent demonstration in Indonesia and the uprising in Bangladesh just a year ago, this moment in Nepal has shown the fierce political power of young people."
    },
    {
        "title": "'Best pal' to 'wish I never met him': The disconnect between Mandelson's claim and his Epstein letter",
        "description": "He is Britain's ambassador to the United States, a former deputy prime minister of the United Kingdom, no less.",
        "url": "https://news.sky.com/story/best-pal-to-wish-i-never-met-him-the-disconnect-between-mandelsons-claim-and-his-epstein-letter-13427790",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-epstein-mandelson_7014791.png?20250909072448",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-09-09 17:59:00",
        "Headline": "The British Embassy in Washington is making no new comment on revelations in congressional papers that Lord Mandelson described the billionaire paedophile Jeffrey Epstein as 'my best pal'.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n He is Britain's ambassador to the United States, a former deputy prime minister of the United Kingdom, no less. He has been a titan of British politics for decades and is the sharpest of operators. Yet Peter Mandelson has been unable to explain why he counted the paedophile Jeffrey Epstein as his \"best pal\". Warning: This story contains graphic descriptions of sexual acts. \"Wherever he is in the world, he remains my best pal!\" Lord Mandelson wrote in Epstein's 50th birthday book in 2003. The handwritten words were accompanied by a snap of a dressing-gown-clad Mandelson with Epstein. Lord Mandelson was one of many contributors to the book, which has been made public for the first time after being published by a congressional committee in Washington. It was compiled by Epstein's girlfriend and co-conspirator Ghislaine Maxwell in 2003, three years before allegations of sexual abuse of minors by Epstein became public. At the very least, there is the question of judgement for Lord Mandelson. The victims of Epstein's abuse have said repeatedly that anyone close to him would have been fully aware of his behaviour. While that is unprovable, it is deeply uncomfortable for anyone close to him, and even more so for those who contributed to the birthday book. The book is hard to read. For page after page, the content is at times graphically sexual. It contains stories, anecdotes and boasts from friends discussing their sexual escapades with Epstein. Some of the images are disturbing, including hand-drawn images of Epstein being massaged by three young-looking women on a beach and images of him with girls - their faces blacked out by the US congressional committee which released the book. 'She left screaming' One note, from an unknown contributor, reads: \"I was porking some girl in bed and Jeff brings in the mains to make beef. She left screaming and never came back.\" It continues: \"We're both in bed porking some girls and I said what do you think, while he's shoving penicillin down my throat.\" Elsewhere in the book, the full note from Lord Mandelson, accompanied by photos, reads: \"Once upon a time, an intelligent, sharp-witted man they call 'mysterious' parachuted into my life… \"You would spend many hours just waiting for him to turn up. And often, no sooner were you getting used to having him around, you would suddenly be alone… again leaving you with some 'interesting' friends to entertain instead… [this caption is accompanied by a photo of two unidentified women]. It continues: \"Or just some dogs to keep you company (he wasn't always so keen on them). But then he would parachute back in… very occasionally, taking you by surprise in some far-off places [this caption accompanied with a whiskey label with Mandelson's name on it]... or in one of his glorious homes he likes to share with his friends (yum yum). But wherever he is in the world, he remains my best pal!\" In May, Sky News asked Lord Mandelson about his relationship with Mr Epstein. \"I'm not answering any questions about him,\" he told Sky's James Matthews. \"My knowledge of him is something that I regret. I wish I'd never met him in the first place.\" \"Why did you have an association with him?\" he was asked. \"Why did many people meet him? He was a prolific networker, and I wish I never met him in the first place,\" Mandelson said.  Sources have told Sky News the ambassador was unhappy with our questions. Notably, Sky was not invited to briefings with the embassy for a few months, and engagement with staff there was more challenging. In February, as he prepared to become the new ambassador, the Financial Times asked Lord Mandelson about his relationship with Epstein. \"I regret ever meeting him or being introduced to him by his partner Ghislaine Maxwell,\" he told the paper. \"I regret even more the hurt he caused to many young women. I'm not going to go into this. It's an FT obsession, and frankly, you can all f*ck off. OK?\" Mandelson has never been accused of any sexual impropriety by any of the Epstein victims. No comment He has not made any fresh comments on the notes in the book, but a spokesperson for the British Embassy in Washington had no comment, only referring me to the words from the ambassador in May. In London, the prime minister's spokesperson was asked if Sir Keir Starmer had spoken to Mandelson since the emergence of the letter. \"No, he's now gotten this statement, and it is a matter of public record. He is focused on delivering the state visit.\" The spokesperson added: \"I can only refer to the statement the ambassador himself made… I have nothing to add other than what the ambassador has already said about the previous relationship with Epstein… he is focused on the state visit.\" More from Sky:Mandelson questions come at worse possible momentHandwriting expert debunks Trump's signature denialExplainer: What is in the 'birthday files'? It's also not clear if Sir Keir and Number 10 officials were aware of the extent of the ties between Mandelson and Epstein. If they were, that raises serious questions about their own judgement. That state visit, next week, is now complicated by this news. The degrees of separation for three key characters involved in the visit are deeply awkward. US President Donald Trump seems increasingly closely associated with Epstein, with the publication of the letter in the book purported to be from him. Mr Trump continues to claim the letter is a fake. Lord Mandelson's association now appears to have been much closer than previously known. The King's brother, Prince Andrew, also had an association with Epstein and Maxwell that is well documented. He reached an out-of-court settlement with one Epstein victim who accused Andrew of sexual impropriety. He denies any wrongdoing. Deeply personal scandal Lord Mandelson is spearheading Britain's diplomatic and trade relationship with the United States. He has put the UK in a uniquely good position since he became ambassador at the start of the year. The state visit will form a key part of the effort to deepen relations with the Trump administration. There is an expectation of new trade, tech and AI announcements between the president and the prime minister next week. Lord Mandelson is a master of spin and strategy. He and his advisors will be hoping this deeply personal scandal doesn't derail diplomatic progress. But there remains a huge disconnect between his assertion that \"my knowledge of him is something that I regret\" and this new revelation that Epstein was his \"best pal\"."
    },
    {
        "title": "Many reasons for Israel to hate the old men of Hamas, but hard to see how Doha strike helps plight of hostages",
        "description": "The Israeli airstrike on the Qatari capital Doha is a step change in the way they tackle their enemies, but only the latest in a series of them.",
        "url": "https://news.sky.com/story/many-reasons-for-israel-to-hate-the-old-men-of-hamas-but-hard-to-see-how-doha-strike-helps-plight-of-hostages-13427757",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-doha-israel-airstrike_7015487.jpg?20250909183459",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-09-09 16:47:00",
        "Headline": "Israel's airstrike in Doha is not against a country that is hostile, but one it has relations with, to the horror of the region, triggering off a massive diplomatic fallout",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  The Israeli airstrike on the Qatari capital Doha is a step change in the way they tackle their enemies, but only the latest in a series of them. In the past, Israel used stealthier means to dispatch its foes. Plausible deniability was preferable. October 7 changed everything, the Israelis say. So when they came for Hamas leader Ismail Haniyeh in 2024 in the Iranian capital of Tehran, they didn't bother with anything as subtle as poison or strangulation - they blew him up with an airstrike instead. Now it's launched another one, this time not on a city in a country that's hostile to Israel, but one it has relations with, to the horror of the region and massive diplomatic fallout. You might assume the targets were high value, a clear and present threat to Israel, to justify all that. Not exactly. There are plenty of reasons for Israelis to hate the old men of Hamas, whom they appear to have targeted. In the past, some of them were instrumental in organising terrorist attacks that killed many innocent women and children. Follow the latest: Hamas leadership 'survives Israeli strikes on Doha' They will have cheered on the 7 October atrocities, but so far as we know, they were not its primary masterminds. Hamas' Doha office In 2011, the US government persuaded the Qataris to let Hamas open a political office in Doha, and the Israelis approved of the idea. Everyone wanted an address to negotiate with and funnel millions of dollars through to Gaza. In the words of one Israeli official: \"We believe that better conditions in Gaza would lessen the incentive of Hamas and the population to go again to a war. So in a way, it is helping the deterrence.\" Critics of Benjamin Netanyahu said he was deliberately strengthening one wing of Palestinian politics as part of a cynical policy of divide and rule. For whatever reason, Israel acquiesced fully in the Hamas political office being set up in Doha. It was staffed with some of the veterans of its cause who seem to have been on the target list in this strike. When I interviewed Khaled Meshaal in Doha in October 2023, he was determined and dogmatic, but seemed at one stage removed. He was no longer the ideological godfather of the movement, he clearly had been when I first met him in Damascus in 2017. The hard men of Gaza - Yahya Sinwar, Abu Obeida, Muhammad Deif - were in control now, much more than those languishing in exile. Hard to see how strikes help hostages in Gaza Mr Netanyahu will have had his reasons for today's strikes. He has almost certainly been waiting for another chance to kill Meshaal after his first attempt failed so spectacularly. Read more from Sky News:Israel launches strikes on Hamas leaders in DohaMan arrested after Heathrow Airport incident In 1997, he sent Mossad agents to pour a lethal poison into his ear in the Jordanian capital, Amman. They botched the job, and King Hussein told then-US president Bill Clinton to order the Israeli leader to hand over an antidote that saved him. Initial reports suggest the wily Meshaal escaped the latest attempt on his life, too. But the men killed and targeted today were, for all their faults, the people Israel was indirectly talking to try to negotiate the return of their hostages. It is hard to see how this helps their plight now."
    },
    {
        "title": "UK internet user helps stop teenager launching deadly attack on Ukrainian school",
        "description": "A UK internet user helped police stop a teenager from unleashing a deadly attack on his school in Ukraine, the Metropolitan Police has said.",
        "url": "https://news.sky.com/story/uk-internet-user-helps-stop-teenager-launching-deadly-attack-on-ukrainian-school-13427703",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ukraine-school-attack_7015404.jpg?20250909164225",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-09 15:18:00",
        "Headline": "The anonymous referral to the Met's Counter Terrorism Internet Referral Unit was passed to Europol, which alerted Ukrainian authorities.",
        "Content": "A UK internet user helped police stop a teenager from unleashing a deadly attack on his school in Ukraine, the Metropolitan Police has said. The anonymous referral was made to the Met's Counter Terrorism Internet Referral Unit on 4 September, according to the force. It warned of an \"imminent attack being planned by an individual in Ukraine\" and was immediately passed to Europol to help alert local police. A day later, a 15-year-old boy was arrested at a school in Zakarpattia, western Ukraine, the country's ministry for internal affairs confirmed in a post on X.  The boy was a student at the school and was arrested with a knife in his backpack while he was livestreaming the incident online, the post revealed. It was accompanied by an image of the knife, phone, and rucksack seized by police at the scene. Read more from Sky NewsOnline conspiracies over deaths of 16 election candidatesIsrael launches strikes on Hamas in QatarSix killed in rush hour bus shooting Commander Dominic Murphy, of the Met's Counter Terrorism Command, described the intel and subsequent response as a \"truly remarkable piece of work\". \"The swift actions by our officers alerting Ukrainian counterparts have helped to avert what could have been a potentially devastating attack at a school in Ukraine,\" he said. \"It's all the more remarkable when you consider the incredible difficulties those in Ukraine are facing while fighting a war, but thanks to our collective efforts, lives have almost certainly been saved.\" He urged people in the UK to report anything suspicious they see online to the Met's internet unit so they can work with international partners to thwart other potential incidents."
    },
    {
        "title": "Online conspiracy theories rife after 16 election candidates die in Germany ",
        "description": "Officials in western Germany have sought to calm online speculation following the deaths of 16 candidates, including seven from a far-right party, in the run-up to a local election.",
        "url": "https://news.sky.com/story/online-conspiracy-theories-rife-after-16-election-candidates-die-in-germany-13427546",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-germany-election_7015072.jpg?20250909112049",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-09-09 10:14:00",
        "Headline": "Officials are seeking to calm speculation after the deaths of several candidates, including seven from the Alternative for Germany, which said it was \"saddened\" by the news.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n Officials in western Germany have sought to calm online speculation following the deaths of 16 candidates, including seven from a far-right party, in the run-up to a local election. Voters will go to the polls on 14 September in North Rhine-Westphalia, the country’s most populous state. However, online conspiracy theories have been running rife after the deaths of several candidates, including seven representing the far-right Alternative for Germany (AFD) party. AfD co-leader, Alice Weidel, highlighted the initial deaths on social media with a post on X saying “4 AfD candidates died.” However, Dr Martin Vincentz, a spokesperson for the North Rhine-Westphalia branch of the party, told Sky News the confirmed number had risen to seven. In a statement, he said the AfD was saddened by the news but that, according to the information they had received so far, there was “currently no indication of unnatural deaths\". Some of those running had known pre-existing conditions. In total, 16 candidates are believed to have died, with police already ruling out unnatural causes in four of the cases, according to the DPA news agency. The seven AfD nominees were standing for election in a variety of districts and with confirmed ages between 59 and 80. The far-right party is reported to be the only one that has had more than one candidate die.  In all districts where candidates have died, any completed postal ballots will need to be re-cast, local media said. Read more on Sky News:Israel 'not committing genocide'Trump and Mandelson in Epstein bookFrance's political crisis just got worse Ahead of the vote, a spokesman for the local election commission tried to dispel intense online speculation, telling the media that the number of deaths was \"not significantly higher\" than in previous campaigns.  Some 20,000 seats are up for grabs in the election in a state with a population of more than 18 million. Sky News contacted the police for comment."
    },
    {
        "title": "Green Party leader Polanski calls for Israeli president's arrest during UK visit over 'ongoing genocide'",
        "description": "New Green Party leader Zack Polanski has called for the arrest of Israel's president during his UK visit this week.",
        "url": "https://news.sky.com/story/israel-not-committing-genocide-in-gaza-but-casualties-and-destruction-are-utterly-appalling-says-uk-government-13427380",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-isaac-herzog-zack-polanski_7015359.jpg?20250909155716",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-09 00:21:00",
        "Headline": "Israel has strongly denied that its actions in Gaza amount to genocide, but is being challenged on the issue in a case at the International Court of Justice in The Hague.",
        "Content": "New Green Party leader Zack Polanski has called for the arrest of Israel's president during his UK visit this week. The self-branded \"eco-populist\" accused Isaac Herzog, who will meet Sir Keir Starmer on Wednesday, of being part of the \"Israeli government engaged in an ongoing genocide\". Mr Polanski, who is Jewish, said: \"Welcoming a potential war criminal to the UK is another demonstration of how this Labour government is implicated in the ongoing genocide in Gaza. \"It also serves as a brutal insult to those mourning the thousands of innocent lives lost and to hundreds of thousands of Palestinians facing ongoing violence and hunger.\" The Greens leader, who won the election last Tuesday, said refusing to detain President Herzog \"can be seen as a contravention of the Geneva Convention\". More than 60 parliamentarians signed a letter to Sir Keir and new Foreign Secretary Yvette Cooper asking what legal advice the government has received about Mr Herzog's visit and whether his entry to the UK \"is compatible with our obligations under the Genocide Convention\". They asked if Mr Herzog's visa application will be rejected or if he will be subject to police investigation if he does arrive. The MPs said the International Court of Justice determined in January last year Israel faces a \"plausible risk of genocide\" and the court cited statements by Mr Herzog, including him saying there are \"no innocent civilians in Gaza\" and \"it is an entire nation that is responsible\". Confusion over UK position on genocide Ahead of Mr Herzog's visit, there was confusion over whether the UK government had concluded if Israel is committing genocide or not. A letter from new Deputy Prime Minister David Lammy said the government has concluded Israel is not committing genocide in Gaza but \"must do much more\" to prevent and alleviate the suffering. Written last week, when he was foreign secretary, but published on Tuesday, Mr Lammy wrote that \"the crime of genocide occurs only where there is specific 'intent to destroy, in whole or in part, a national, ethnic, racial or religious group.' \"The government has not concluded that Israel is acting with that intent.\" However, minister Wes Streeting caused confusion over the government's position when he said on Tuesday Mr Herzog should answer charges of \"genocide\" when he visits the UK on Wednesday. Questioned about what exactly the government's position is, the prime minister's spokesman said Mr Lammy's letter was \"written in the context of export licenses\" for arms to Israel. \"We've always said that it's for the international court to make these determinations, and that has not been made,\" he said. He said the letter \"reflects the UK's position that we've not come to any conclusion as to whether genocide has or has not been committed in Gaza, that's been our longstanding position\". And he said Sir Keir will raise the \"intolerable situation in Gaza with the president of Israel when he meets him\". However, Labour MP and chair of the international development committee Sarah Champion, who Mr Lammy's letter was addressed to, asked whether Mr Lammy's words meant the government's position on genocide in Israel was shifting. She also asked whether the government is \"still of the view this is a matter for a 'competent court' such as the International Court of Justice, or is it ready to make its own assessment of whether this is a serious risk of genocide\". \"I urge the new foreign secretary to set the record straight as soon as possible,\" she told Sky News. Previously, the government's position had been that it was for an international court to decide if Israel was committing genocide. Israel has strongly denied that its actions in Gaza amount to genocide, but is being challenged on the issue in a case at the International Court of Justice in The Hague. The world's leading association of genocide scholars, as well as several Israeli human rights organisations, have already accused the country of genocide. Mr Lammy, who was replaced by Yvette Cooper as foreign secretary during Sir Keir Starmer's recent reshuffle, also criticised the \"catastrophic humanitarian situation\" in the region. Lammy: Destruction is 'utterly appalling' \"The high civilian casualties, including women and children, and the extensive destruction in Gaza, are utterly appalling,\" he wrote. \"Israel must do much more to prevent and alleviate the suffering that this conflict is causing.\" Israel struck and destroyed another high-rise building in Gaza City on Monday after warning residents to evacuate. The military said it was targeting Hamas observation posts and bombs placed around the 12-story office building, though has not provided evidence for this claim. Israeli Prime Minister Benjamin Netanyahu has told residents they should leave the city immediately. On Monday, a flotilla aiming to transport humanitarian aid to Gaza claimed one of its boats was struck by a drone on Tuesday in Tunisian waters, suffering fire damage. None of the passengers or crew on the Portuguese-flagged vessel were hurt, the Global Sumud Flotilla (GSF) said in a statement. But a spokesperson for Tunisia's National Guard rejected GSF's reports of a drone strike and told Mosaique FM radio that an initial inspection indicated the explosion originated inside the vessel. Israel has imposed a naval blockade on the coastal enclave since Hamas took control of Gaza in 2007, saying it aims to stop weapons from reaching the militant group. Israeli weapons ban 'antisemitic' Meanwhile, Spain has banned ships and aircraft carrying weapons to Israel from calling at Spanish ports or entering its airspace, because of Israel's military offensive in Gaza. The measures were described as antisemitic by Israeli foreign minister, Gideon Saar. Prime Minister Pedro Sanchez's government also said it would not allow anyone who has participated directly in \"genocide\" in Gaza to enter Spain. Read more from Sky News:Jerusalem shooting will exacerbate tensionsHouthi drone attack on Israel airportLush shuts 'in solidarity with Gaza' Deadly bus stop shooting Israel suffered its deadliest shooting since October 2024 on Monday, when gunmen opened fire at a bus stop in Jerusalem, killing six people and wounding another 12. An Israeli soldier and civilians who were at the scene shot and killed the two attackers, said police, who later arrested a third person. Israel's Shin Bet internal security agency said the two attackers, aged 20 and 21, were Palestinians from the West Bank with no prior arrests. The militant group Hamas did not say it was behind the attack but called it a \"natural response to the occupation's crimes against our people\". Starmer holds talks with Abbas President Mahmoud Abbas, head of the Palestinian Authority (PA), condemned \"any targeting of Palestinian and Israeli civilians\" and \"denounced all forms of violence and terrorism, regardless of their source,\" according to a statement from his office. Mr Abbas visited Downing Street on Monday evening for discussions with Sir Keir Starmer. Following the talks, the prime minister's spokesperson said they spoke about \"the intolerable situation in Gaza\" and how to secure \"enduring peace and stability for both Palestinians and Israelis\". \"The president welcomed the prime minister's pledge to recognising (sic) a Palestinian state ahead of the UN General Assembly meeting later this month, unless Israel changes its course,\" the statement added. Sky News has contacted the Israeli government for a comment regarding Mr Polanski's call."
    },
    {
        "title": "Hamas claims responsibility for shooting that killed six people in Jerusalem",
        "description": "Palestinian militant group Hamas has claimed responsibility for the shooting that killed six people on the outskirts of Jerusalem.",
        "url": "https://news.sky.com/story/hamas-claims-responsibility-for-shooting-that-killed-six-people-in-jerusalem-13427506",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jerusalem-bus-shooting_7014162.jpg?20250908090459",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-09 09:01:00",
        "Headline": "The two attackers, who Israeli media said were believed to have set out from two villages in the Israeli-occupied West Bank, were shot dead by police. A third suspect was later arrested.",
        "Content": "Palestinian militant group Hamas has claimed responsibility for the shooting that killed six people on the outskirts of Jerusalem. Two gunmen boarded a bus on Monday in one of the deadliest attacks the city has seen in recent times. Footage from a dashboard camera showed dozens of people fleeing from a bus stop as shots rang out. Follow latest: IDF launches strike against Hamas leaders in Doha  Paramedics who responded said the scene was chaotic and covered in broken glass, with people wounded and lying unconscious on the road and pavement near the bus stop. The two attackers, who Israeli media said were believed to have set out from two villages in the Israeli-occupied West Bank, were shot dead by police. A third suspect was later arrested. \n                  Trump denies knowledge of Israel's 'unfortunate' strike on Qatar - as Starmer joins global condemnation\n                 \n                  Economic crisis, political turmoil: What's happening in France?\n                 \n                  Green Party leader Polanski calls for Israeli president's arrest during UK visit over 'ongoing genocide'\n                  Israel has ordered the demolition of the two men's homes and said every structure built without permission in the towns of Qatanna and Qubeiba would be demolished. Defence minister Israel Katz added that 750 people - who he said are the men's relatives and fellow villagers - will have their permits to work in Israel removed. Analysis: The bus shooting has exacerbated already high tensions Israel says demolishing the homes of attackers' relatives and neighbours is a deterrent to future assaults - but human rights groups and Palestinians consider the practice a form of collective punishment, prohibited by international law. Benjamin Netanyahu visited the scene of the shooting at Ramot Junction on Monday and has been assessing, with his heads of security, what happened. The Israeli prime minister sent condolences to the families of the victims and said Israel was \"in an intense war against terror on several fronts\". Among the dead in the shooting was a man of about 50 years old, three men aged around 30 and a woman aged about 50. It is understood a total of about 15 people were injured, with six in a serious condition."
    },
    {
        "title": "Nepal PM KP Sharma Oli resigns after deadly protests triggered by social media ban",
        "description": "Nepal's prime minister KP Sharma Oli has resigned after violent anti-corruption protests.",
        "url": "https://news.sky.com/story/nepal-pm-resigns-after-deadly-protests-triggered-by-social-media-ban-13427412",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-kathmandu-nepal-protest_7015002.jpg?20250909101736",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-09 10:09:00",
        "Headline": "KP Sharma Oli's exit comes as demonstrators defied an indefinite curfew and clashed with police, a day after 19 people died in violent protests triggered by a social media ban.",
        "Content": " Nepal's prime minister KP Sharma Oli has resigned after violent anti-corruption protests. \"The PM has quit,\" his aide Prakash Silwal told Reuters news agency on Tuesday. In his resignation letter, sent to Nepal's President Ram Chandra Paudel, Mr Oli said he is leaving with immediate effect \"in order to take further steps towards a political solution and resolution of the problems [...] taking into account the extraordinary situation currently prevailing in the country.\" The president has now begun the process to install a new PM, his aide said. Mr Oli's exit comes as demonstrators defied an indefinite curfew, clashed with police and set politicians' homes on fire, a day after 19 people died in violent protests triggered by a social media ban. His government lifted the ban after protests turned violent when police fired tear gas and rubber bullets at protesters trying to storm parliament on Monday. The unrest is the worst Nepal has seen in decades. The Himalayan country has struggled with economic uncertainty and political instability since protests led to its monarchy being abolished in 2008. \n                  Trump denies knowledge of Israel's 'unfortunate' strike on Qatar - as Starmer joins global condemnation\n                 \n                  Trump latest: President would back expert review of alleged signature on note to Epstein, White House says\n                 \n                  Nepal's anti-government protests are a powder keg moment that could change the country for years\n                 Prior to resigning, Mr Oli had on Tuesday called a cross-party meeting where he said violence was not in Nepal's interests and added: \"We have to resort to peaceful dialogue to find solutions to any problem.\" But anger against the government continued with protesters gathering outside parliament and other significant locations in the Nepali capital of Kathmandu. Kathmandu Airport, Nepal's international gateway, closed at around 3.15pm local time (10.30am UK time) on Tuesday due to the unrest. In the city centre, some demonstrators set fire to tyres, threw stones at riot police and chased officers through the streets. The Kathmandu homes of some politicians were also set on fire. These include properties belonging to resident Poudel and Sher Bahadur Deuba, leader of the largest party Nepali Congress.  Local media reported that some ministers were taken to safety by military helicopters. The demonstrations began in response to social media networks, including Facebook, X and YouTube, being blocked in Nepal last week after they failed to comply with new government regulations. But the unrest has spiralled, driven by young people's frustration with the Nepali government's perceived lack of action to tackle corruption and boost economic opportunities."
    },
    {
        "title": "Trump denies knowledge of Israel's 'unfortunate' strike on Qatar - as Starmer joins global condemnation",
        "description": "Donald Trump has distanced the US from Israel's \"unfortunate\" strike in Qatar, which drew international condemnation and killed five members of Hamas.",
        "url": "https://news.sky.com/story/trump-denies-knowledge-of-israels-unfortunate-strike-on-qatar-as-starmer-joins-global-condemnation-13427908",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-qatar-israel-trump_7015659.jpg?20250910003346",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-09 21:58:00",
        "Headline": "Sir Keir Starmer has condemned Israel's strike ahead of his controversial meeting with Israeli President Isaac Herzog in London, saying it violates Qatar's sovereignty and risks further escalation in the region.",
        "Content": " Donald Trump has distanced the US from Israel's \"unfortunate\" strike in Qatar, which drew international condemnation and killed five members of Hamas. The Israeli Defence Forces said it carried out Tuesday's strike in Doha \"targeting the senior leadership of the Hamas terrorist organisation\". Prime Minister Benjamin Netanyahu's office said \"Israel initiated it, Israel conducted it, and Israel takes full responsibility\" for the attack - which the US president echoed on Truth Social. As it happened: NATO member says it will stand by Qatar Mr Trump said the US military notified his administration about the Israeli attack on the Qatari capital, and added: \"It was not a decision made by me. \"Unilaterally bombing inside Qatar, a Sovereign Nation and close Ally of the United States, that is working very hard and bravely taking risks with us to broker Peace, does not advance Israel or America's goals.\" Mr Trump then said however that eliminating Hamas \"is a worthy goal,\" and that he believes \"this unfortunate incident could serve as an opportunity for PEACE\". Speaking to reporters a little later, he said he was \"not thrilled\" about the strike and would make a \"full statement\" on Wednesday.  Qatar's UN ambassador says strike 'cowardly' Mr Netanyahu said the operation was a \"surgical, precision strike,\" and claimed it was \"completely justified\" after six people were killed in Jerusalem - which Hamas took responsibility for. Meanwhile, Qatar's interior ministry said that a member of its security forces were killed in Israel's strike, and its UN ambassador called the attack a \"criminal assault\" and \"cowardly\" act.  Alya Ahmed Saif Al-Thani told the United Nations Security Council that Qatar \"not tolerate this reckless Israeli behavior and the ongoing disruption of regional security,\" adding the strike \"constitutes a blatant violation of all international laws and norms\". In a phone call with Mr Trump, Qatari Emir Sheikh Tamim bin Hamad Al-Thani also said Qatar will take all necessary measures to protect its security and preserve its sovereignty. Read more on this story:Hard to see how Doha airstrike helps Israeli hostagesUS 'feels badly' about Qatar attack  Starmer condemns strike ahead of Herzog visit UK Prime Minister Sir Keir Starmer also condemned Israel's strike, saying it violates Qatar's sovereignty and risks further escalation in the region. His comments came ahead of Israeli President Isaac Herzog's visit to Britain, where he will meet with the prime minister this afternoon. Sir Keir said in a statement he intends to raise the issue of the \"intolerable situation\" in Gaza with Mr Herzog, adding: \"We've been clear Israel must take action to end [the] horrific scenes.\" In a phone call with the Emir of Qatar, Sir Keir also \"gave his condolences for the death of a Qatari security officer killed in the attack\", according to a Downing Street readout. Protests against Mr Herzog's visit are widely expected throughout his visit. Demonstrators gathered outside Downing Street yesterday to protest his arrival, while Green Party leader Zack Polanski told Sky News that the official should be arrested. Mr Polanski, who is Jewish, said: \"Welcoming a potential war criminal to the UK is another demonstration of how this Labour government is implicated in the ongoing genocide in Gaza. \"It also serves as a brutal insult to those mourning the thousands of innocent lives lost and to hundreds of thousands of Palestinians facing ongoing violence and hunger.\" Read more from Sky News:Disconnect between Mandelson's claim and his Epstein letterAnalysis: Nepal protests a powder keg momentWhat we have learnt from Harry's trip to the UK Israel has strongly denied that its actions in Gaza amount to genocide, but is being challenged on the issue in a case at the International Court of Justice in The Hague. The world's leading association of genocide scholars, as well as several Israeli human rights organisations, have already accused the country of genocide."
    },
    {
        "title": "Handwriting expert says 'Donald Trump signature' in Epstein birthday book is 'absolutely' his - despite his denials",
        "description": "A handwriting expert has said the signature on a controversial birthday message to paedophile Jeffrey Epstein is \"absolutely\" US President Donald Trump's.",
        "url": "https://news.sky.com/story/handwriting-expert-says-donald-trump-signature-on-epstein-birthday-book-is-absolutely-his-despite-his-denials-13427738",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-handwriting-graphologist_7015430.jpg?20250909172155",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-09 16:01:00",
        "Headline": "A graphologist tells Sky News the message written in a book for the billionaire paedophile had a number of distinctive characteristics that make it unmistakeable.",
        "Content": " A handwriting expert has said the signature on a controversial birthday message to paedophile Jeffrey Epstein is \"absolutely\" US President Donald Trump's. Graphologist Emma Bache compared the signature with others the president wrote at the time, and told Sky News: \"It is very much the signature he had in the 2000s. I can absolutely say it is Donald Trump's.\" Newly released files handed to the United States Congress appear to contain birthday messages to billionaire paedophile Epstein from both the US president and the current British ambassador to the US, Peter Mandelson.  They include a hand-drawing of a woman's body, signed \"Donald\", a picture of Epstein holding an outsized cheque, signed by \"DJTRUMP\", and a message appearing to show Lord Mandelson calling Epstein his \"best pal\". Addressing the release of the image in a post on X, White House press secretary Karoline Leavitt said: \"As I have said all along, it's very clear President Trump did not draw this picture, and he did not sign it.\" But Ms Bache was unequivocal. \"It's incredibly distinctive. If we look at the way he has formed the 'o' of Donald, it's actually a circle. \"He also has a very long horizontal stroke at the end of his name - which funnily enough is saying to people 'keep away' - and it's absolutely identical in pressure, in length and formation of about every single stroke (to his current official signature).\" She said the capital 'D' of his name in the Epstein message, was also very distinctive and exactly the same as another letter written in 1996 and 2000. The files were handed over following a demand by the Oversight Committee of the US Congress and are from a book compiled by Epstein's co-conspirator, Ghislaine Maxwell, to celebrate his 50th birthday in 2003. More from Sky:Explainer: What is in the 'birthday files'?Trump latest: White House denial and Mandelson notesThe White House said the president's legal team was \"aggressively pursuing litigation\". Ms Bache said she was \"not surprised he would deny it\". She added: \"He has an awful lot to lose, but it doesn't affect my analysis of it.\" 👉 Follow Trump100 on your podcast app 👈 'You will listen to me - I am right' After examining a number of his signatures under a microscope, she concluded: \"The idea that it could be forged would be almost impossible. I certainly wouldn't be able to get anywhere close to Donald Trump's handwriting. \"It's a very confident, very speedy signature and when you forge something, you do it more slowly.\" She said his modern signature had changed a little but still had clear similarities. She added: \"His modern signature is all angles and in graphology, angles are about energy, aggression, there's a tension there. \"There's no softness and his communication style is one of 'you will listen to me and I am right'. Ambassador's denial Lord Mandelson has also come under scrutiny for his relationship with Epstein - and the release of the files has compounded the issue.  They appear to include a glowing contribution from the Labour grandee, with him calling Epstein his \"best pal\" and writing of the friend \"taking you by surprise… in one of his glorious homes he likes to share with his friends (yum yum)\". Lord Mandelson's spokesman said he \"very much regrets ever having been introduced to Epstein\"."
    },
    {
        "title": "With UK state visit looming, Epstein questions come at worst moment for Lord Mandelson",
        "description": "The resurfacing of an affectionate greeting to paedophile Jeffrey Epstein, alleged to have come from Lord Mandelson, raises huge questions.",
        "url": "https://news.sky.com/story/with-uk-state-visit-looming-epstein-questions-come-at-worst-moment-for-lord-mandelson-13427641",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/image_6928956.jpg?20250527185531",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-09-09 13:56:00",
        "Headline": "The notes allegedly written by Lord Mandelson, one of which describes the convicted paedophile as his \"best pal\", suggest a closer relationship than has previously been acknowledged.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n The resurfacing of an affectionate greeting to paedophile Jeffrey Epstein, alleged to have come from Lord Mandelson, raises huge questions. It couldn't have come at a worse moment - days before Donald Trump's state visit to the UK, in which Mandelson, the UK's ambassador to Washington, will play a significant role. While he focuses on crafting Anglo-American collaboration on technology, his judgment is under scrutiny on both sides of the Atlantic. Newly released files, which had been demanded by the House of Representatives Oversight Committee on Capitol Hill, appear to contain notes he sent to Jeffrey Epstein. Follow updates: White House denies Trump behind birthday note  One reads: \"…wherever he is in the world, he remains my best pal!\" \"Happy birthday, Jeffrey we love you!!\" it concludes. Mandelson's connection to the billionaire, who died by suicide in prison while awaiting trial on sex-trafficking charges, is well documented. A 2019 JP Morgan internal report flagged a notably close relationship between the two. But his alleged use of the words \"best pal\" suggests a closer and warmer relationship than had been previously acknowledged. Questioned about it in 2025, the UK's ambassador to the US expressed \"deep regret\" over knowing Epstein but dismissed the issue as a media \"obsession\". Peter Mandelson, once dubbed \"the Prince of Darkness\" within Westminster, is a veteran politician who served in cabinet under Tony Blair and Gordon Brown. His appointment as UK Ambassador to the United States in February 2025 surprised many people. Read more:What is in Epstein's 'birthday book'? It is unusual for someone considered a political heavyweight to find themselves in what is traditionally a diplomatic role.  Asked about the alleged birthday greeting, the prime minister's official spokesperson said Sir Keir Starmer had \"full confidence\" in the UK's ambassador to the US. The one thing sparing him any difficult questions from the White House is the fact that Mr Trump faces just as many himself over Epstein."
    },
    {
        "title": "'Best pal' to 'wish I never met him': The disconnect between Mandelson's claim and his Epstein letter",
        "description": "He is Britain's ambassador to the United States, a former deputy prime minister of the United Kingdom, no less.",
        "url": "https://news.sky.com/story/best-pal-to-wish-i-never-met-him-the-disconnect-between-mandelsons-claim-and-his-epstein-letter-13427790",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-epstein-mandelson_7014791.png?20250909072448",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-09-09 17:59:00",
        "Headline": "The British Embassy in Washington is making no new comment on revelations in congressional papers that Lord Mandelson described the billionaire paedophile Jeffrey Epstein as 'my best pal'.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n He is Britain's ambassador to the United States, a former deputy prime minister of the United Kingdom, no less. He has been a titan of British politics for decades and is the sharpest of operators. Yet Peter Mandelson has been unable to explain why he counted the paedophile Jeffrey Epstein as his \"best pal\". Warning: This story contains graphic descriptions of sexual acts. \"Wherever he is in the world, he remains my best pal!\" Lord Mandelson wrote in Epstein's 50th birthday book in 2003. The handwritten words were accompanied by a snap of a dressing-gown-clad Mandelson with Epstein. Lord Mandelson was one of many contributors to the book, which has been made public for the first time after being published by a congressional committee in Washington. It was compiled by Epstein's girlfriend and co-conspirator Ghislaine Maxwell in 2003, three years before allegations of sexual abuse of minors by Epstein became public. At the very least, there is the question of judgement for Lord Mandelson. The victims of Epstein's abuse have said repeatedly that anyone close to him would have been fully aware of his behaviour. While that is unprovable, it is deeply uncomfortable for anyone close to him, and even more so for those who contributed to the birthday book. The book is hard to read. For page after page, the content is at times graphically sexual. It contains stories, anecdotes and boasts from friends discussing their sexual escapades with Epstein. Some of the images are disturbing, including hand-drawn images of Epstein being massaged by three young-looking women on a beach and images of him with girls - their faces blacked out by the US congressional committee which released the book. 'She left screaming' One note, from an unknown contributor, reads: \"I was porking some girl in bed and Jeff brings in the mains to make beef. She left screaming and never came back.\" It continues: \"We're both in bed porking some girls and I said what do you think, while he's shoving penicillin down my throat.\" Elsewhere in the book, the full note from Lord Mandelson, accompanied by photos, reads: \"Once upon a time, an intelligent, sharp-witted man they call 'mysterious' parachuted into my life… \"You would spend many hours just waiting for him to turn up. And often, no sooner were you getting used to having him around, you would suddenly be alone… again leaving you with some 'interesting' friends to entertain instead… [this caption is accompanied by a photo of two unidentified women]. It continues: \"Or just some dogs to keep you company (he wasn't always so keen on them). But then he would parachute back in… very occasionally, taking you by surprise in some far-off places [this caption accompanied with a whiskey label with Mandelson's name on it]... or in one of his glorious homes he likes to share with his friends (yum yum). But wherever he is in the world, he remains my best pal!\" In May, Sky News asked Lord Mandelson about his relationship with Mr Epstein. \"I'm not answering any questions about him,\" he told Sky's James Matthews. \"My knowledge of him is something that I regret. I wish I'd never met him in the first place.\" \"Why did you have an association with him?\" he was asked. \"Why did many people meet him? He was a prolific networker, and I wish I never met him in the first place,\" Mandelson said.  Sources have told Sky News the ambassador was unhappy with our questions. Notably, Sky was not invited to briefings with the embassy for a few months, and engagement with staff there was more challenging. In February, as he prepared to become the new ambassador, the Financial Times asked Lord Mandelson about his relationship with Epstein. \"I regret ever meeting him or being introduced to him by his partner Ghislaine Maxwell,\" he told the paper. \"I regret even more the hurt he caused to many young women. I'm not going to go into this. It's an FT obsession, and frankly, you can all f*ck off. OK?\" Mandelson has never been accused of any sexual impropriety by any of the Epstein victims. No comment He has not made any fresh comments on the notes in the book, but a spokesperson for the British Embassy in Washington had no comment, only referring me to the words from the ambassador in May. In London, the prime minister's spokesperson was asked if Sir Keir Starmer had spoken to Mandelson since the emergence of the letter. \"No, he's now gotten this statement, and it is a matter of public record. He is focused on delivering the state visit.\" The spokesperson added: \"I can only refer to the statement the ambassador himself made… I have nothing to add other than what the ambassador has already said about the previous relationship with Epstein… he is focused on the state visit.\" More from Sky:Mandelson questions come at worse possible momentHandwriting expert debunks Trump's signature denialExplainer: What is in the 'birthday files'? It's also not clear if Sir Keir and Number 10 officials were aware of the extent of the ties between Mandelson and Epstein. If they were, that raises serious questions about their own judgement. That state visit, next week, is now complicated by this news. The degrees of separation for three key characters involved in the visit are deeply awkward. US President Donald Trump seems increasingly closely associated with Epstein, with the publication of the letter in the book purported to be from him. Mr Trump continues to claim the letter is a fake. Lord Mandelson's association now appears to have been much closer than previously known. The King's brother, Prince Andrew, also had an association with Epstein and Maxwell that is well documented. He reached an out-of-court settlement with one Epstein victim who accused Andrew of sexual impropriety. He denies any wrongdoing. Deeply personal scandal Lord Mandelson is spearheading Britain's diplomatic and trade relationship with the United States. He has put the UK in a uniquely good position since he became ambassador at the start of the year. The state visit will form a key part of the effort to deepen relations with the Trump administration. There is an expectation of new trade, tech and AI announcements between the president and the prime minister next week. Lord Mandelson is a master of spin and strategy. He and his advisors will be hoping this deeply personal scandal doesn't derail diplomatic progress. But there remains a huge disconnect between his assertion that \"my knowledge of him is something that I regret\" and this new revelation that Epstein was his \"best pal\"."
    },
    {
        "title": "Jeffrey Epstein 'birthday files' released: What's in them?",
        "description": "Files from a \"birthday book\" compiled for the paedophile sex trafficker Jeffrey Epstein by co-conspirator Ghislaine Maxwell have been released publicly for the first time.",
        "url": "https://news.sky.com/story/jeffrey-epstein-birthday-files-released-whats-in-them-13427486",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jeffrey-epstein-birthday-book_7015109.jpg?20250909114828",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-09 08:29:00",
        "Headline": "The 238-page book shows revealing photos of women, kind and sometimes cryptic messages from high-profile friends and a number of suggestive sketches.",
        "Content": "Files from a \"birthday book\" compiled for the paedophile sex trafficker Jeffrey Epstein by co-conspirator Ghislaine Maxwell have been released publicly for the first time. This article contains images and language that some readers may find disturbing The 238-page book, released by the Democrats on the House Oversight Committee, appears to show messages from several high-profile acquaintances of Epstein to mark his 50th birthday, which was in 2003. They appear to include messages from the likes of Donald Trump and the UK ambassador to Washington, Lord Peter Mandelson. They are among dozens of messages, seemingly from childhood friends, former girlfriends, and people who came to know him after he became a wealthy financier. The book would have been made three years before allegations of sex abuse by Epstein became public in 2006. Here's what the documents show us. Alleged notes and drawing from Trump The birthday note signed 'Donald J. Trump' - which the president has denied sending - features words inside the drawn outline of a woman. It begins with a 'voice over' which says: \"There must be more to life than having everything.\" It then presents a presumably fictitious exchange between 'Donald' and 'Jeffrey' about having \"certain things\" in common. Scroll to see more images released from the 'birthday book' The message concludes: \"Happy Birthday - and may every day be another wonderful secret.\" It ends with a signature similar to Mr Trump's drawn across the woman's waist, which some have interpreted to mimic the appearance of pubic hair. The note was first published in part by The Wall Street Journal in July, prompting Mr Trump to launch legal action and sue the \"ass off\" Rupert Murdoch, who owns the paper. He denied writing the letter, calling it \"fake\" and adding: \"These are not my words, not the way I talk. Also, I don't draw pictures.\" After the full image was released by the House Oversight Committee, White House press secretary Karoline Leavitt said: \"As I have said all along, it's very clear President Trump did not draw this picture, and he did not sign it. \"President Trump's legal team will continue to aggressively pursue litigation.\" There is also a partially redacted image of Epstein holding an oversized cheque signed \"DJTRUMP\". A handwritten note below the photo reads: \"Jeffrey showing early talents with money + women! Sells 'fully depreciated' [redacted] to Donald Trump for $22,500.\" The president has generally denied any impropriety involving Epstein, whom he once counted as a friend. Mandelson's message about 'interesting friends' The documents include what appears to be a birthday note from UK ambassador Lord Mandelson, who refers to Epstein as \"my best pal\". It begins with him appearing to reminisce about the first time he met Epstein, before alluding to how the financier would often leave one alone with some \"interesting friends to entertain\". It is not clear what was meant by these so-called 'interesting friends', but the line is accompanied by an image of two people with their faces obscured or redacted. The note references Epstein \"taking you by surprise… in one of his glorious homes he likes to share with his friends (yum yum)\". Pictures of Lord Mandelson appear on the pages, which include an image of a tropical island. Previously, a 2019 report by JP Morgan bank suggested Lord Mandelson stayed at Epstein's New York flat in 2009, while the disgraced financier was serving an 18-month prison sentence after pleading guilty to procuring a person under the age of 18 for prostitution. Sky News asked Lord Mandelson about the story in May this year, to which he responded: \"I'm not answering any questions about him. My knowledge of him is something I regret, I wish I'd never met him in the first place.\" Asked why he had an association with Epstein while he was in jail, Lord Mandelson replied: \"Why did many people meet him? He was a prolific networker and I wish I'd never met him in the first place.\" Message from Clinton highlights his 'childlike curiosity'  Included in the birthday book is a message seemingly signed by former president Bill Clinton, which references Epstein's \"childlike curiosity\". \"It's reassuring isn't it, to have lasted as long, across all the years of learning and knowing... and also to have your childlike curiosity, the drive to make a difference and the solace of friends,\" the note reads. Mr Clinton was among those acquainted with Epstein before the criminal investigation against him in Florida became public two decades ago. He has never been accused of wrongdoing by any of the women who say Epstein abused them. Mr Clinton previously said, through a spokesperson, that while he travelled on Epstein's jet, he never visited his homes and had no knowledge of his crimes. 'I've sat on the Queen of England's throne' The book's contents were split into sections separating entries from people with different relationships to Epstein, from family, to \"girlfriends\", another section marked \"girl-friends\", colleagues and, towards the end of the book, assistants. One person in the latter category, who did not sign their message, writes about a series of places they have been and things they have done since meeting Epstein. Included on the list is meeting the likes of Prince Andrew, Mr Clinton and Mr Trump, as well as seeing the private quarters of Buckingham Palace and sitting on the 'Queen of England's throne'. Revealing photos, cryptic drawings and lewd references In the book's prologue, Maxwell, Epstein's lover-turned-friend, tells the 50-year-old she hopes he will \"derive as much pleasure looking through it as I did putting it together for you\". While the book starts with messages from Epstein's family and photos of him in his younger years, it soon becomes plastered with photos of women - some naked and some in bikinis - many of which have been partially redacted. Several of the images come from women whose messages are listed in the \"assistants\" section. One concludes her message by writing, \"What else can I say butt...\" before including an image of an unidentified man slipping his hand down the back of a woman's jeans. There are also numerous images of men in tight bathing suits, many including Epstein. Many of the messages contain compliments to Epstein regarding both his personality and his career achievements. One such message comes towards the end of the book from late Bear Stearns CEO Alan \"Ace\" Greenberg, who writes: \"Working with Jeffrey has been a pleasure and watching his meteoric success has given me many vicarious thrills.\" There are also cryptic sketches and edited images included by various contributors. One letter, unsigned, calls Epstein \"a collector of more than beautiful minds\" who appreciates \"beauty marks\". It details how Maxwell went to a Palm Beach Horse Show on a \"mission\" to make a \"compilation of breast photos\" for Epstein. The person writes: \"I came to see you some months later [and] you told me to take off my top. With the usual Epstein smile you looked at my breasts and said 'yeah, I was right.' Memory served you correctly. The beauty mark was on the right breast.\" The letter also included a photo of a bra. A poem says Epstein would \"outrage the public decency\" on \"any occasion\". It reads: \"As far as I can detect, Jeffrey seems to select to express his mood, terms rude, crude and lewd, and politically incorrect.\" It concludes with the line: \"Jeffrey at half a century, with credentials plenipotentiary, though up to no good whenever he could, has avoided the penitentiary.\" Another contributor, whose name has been redacted, details how she met Epstein in the summer of 1985. She shares several memories, including how he asked whether she was a virgin the first time they were left alone, and how they once went shopping together at Bloomingdales, where he \"proceeded to throw me down on the floor… and started kissing and tickling me all over\". She included several photos of her and Epstein which have been edited to mask her identity. One, where she is pictured in underwear while looking in a wardrobe, is captioned: \"Visiting you down in Palm Beach... can't get a second of privacy with you and a camera around - ha ha!\" One contributor refers to him as a \"brilliant and unpredictable friend\", while another says he can \"maybe be a bear, but mostly a teddy bear\". As well as the birthday book, the documents released include Epstein's will, his contact books, agreements he signed with prosecutors and his financial transactions and holdings."
    },
    {
        "title": "Alleged notes from Trump and Mandelson among messages in Epstein 'birthday book'",
        "description": "Files from a \"birthday book\" compiled for the sex trafficker Jeffrey Epstein appear to include a glowing contribution from the current UK ambassador to Washington, Peter Mandelson.",
        "url": "https://news.sky.com/story/notes-from-trump-and-mandelson-among-alleged-messages-in-epstein-birthday-book-13427386",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump-mandelson-epstein_7014793.jpg?20250909043921",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-09-09 02:41:00",
        "Headline": "The newly-released files were handed over following a demand by the Oversight Committee of the US Congress, and appear to contain notes to the billionaire paedophile from Donald Trump and Peter Mandelson.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  Files from a \"birthday book\" compiled for the sex trafficker Jeffrey Epstein appear to include a glowing contribution from the current UK ambassador to Washington, Peter Mandelson. Documents appear to show Lord Mandelson calling Epstein his \"best pal\" and writing of the friend \"taking you by surprise… in one of his glorious homes he likes to share with his friends (yum yum)\". The pages are contained in files from the estate of the deceased billionaire paedophile, handed over to a Congressional committee. The collection of birthday tributes include a hand-drawing of a woman's body, signed \"Donald\". They also contain a picture of Epstein holding an outsized cheque, signed by \"DJTRUMP\". Trump latest: Follow live updates Beneath the image is a handwritten message that reads: \"Jeffrey showing early talents with money + women! Sells 'fully depreciated (redacted) to Donald Trump for $22,500.\" The US president has denied any impropriety involving Epstein, whom he once counted as a friend. Addressing the release of the image in a post on X, White House press secretary Karoline Leavitt said: \"As I have said all along, it's very clear President Trump did not draw this picture, and he did not sign it. \"President Trump's legal team will continue to aggressively pursue litigation.\" Mr Trump has already filed one lawsuit over the birthday note. He began proceedings against the Wall Street Journal, two of its reporters and its owner, Rupert Murdoch, after the publication first reported on the message's existence in July. The newly-released files were handed over following a demand by the Oversight Committee of the US Congress. They are from a book compiled by Epstein's co-conspirator, Ghislaine Maxwell, to celebrate Epstein's 50th birthday in 2003. Mandelson's message to 'best pal' A number of pages include pictures of Lord Mandelson, a former Labour minister, and a message that reads: \"Once upon a time, an intelligent, sharp-witted man they call \"mysterious\" parachuted into my life. \"You would spend many hours just waiting for him to turn up. \"And often, no sooner were you getting used to having him around, you would suddenly be alone…. again. \"Leaving you with some \"interesting\" friends to entertain instead…. \"Or just some dogs to keep you company (he wasn't always so keen on them) \"But then he would parachute back in… \"Very occasionally, taking you by surprise in some far off places \"Or in one of his glorious homes he likes to share with his friends (yum yum) \"But, wherever he is in the world, he remains my best pal! \"Happy birthday, Jeffrey we love you!!\" Pictures of Lord Mandelson appear on the pages, which include an image of a tropical island. Previously, a 2019 report by JP Morgan bank suggested Lord Mandelson had stayed at Epstein's New York flat in 2009, while the disgraced financier was in jail. Epstein was serving an 18-month sentence after pleading guilty to procuring a person under the age of 18 for prostitution. 👉 Follow Trump100 on your podcast app 👈 At the time, Lord Mandelson was the business secretary in the UK government, under then prime minister Gordon Brown. Sky News contacted the British embassy in Washington for comment, and was referred to earlier statements from Mandelson, including an interview with Sky News in May this year.  Asked then about the New York story, he said: \"I'm not answering any questions about him. My knowledge of him is something I regret, I wish I'd never met him in the first place.\" Asked why he had an association with Epstein while he was in jail, Lord Mandelson replied: \"Why did many people meet him? He was a prolific networker and I wish I'd never met him in the first place.\" All you need to know about the Trump-Epstein saga Health Secretary Wes Streeting addressed the US ambassador's appearance in the newly-released files during a Sky News interview on Tuesday morning. When asked if it is a problem that Lord Mandelson has continued to be linked to Epstein, Mr Streeting replied: \"I think our ambassador has made it clear that he deeply regrets ever having been introduced to Epstein.\" \"I don't think we should regard everyone as guilty by association,\" he added. \"I think the important thing is that Epstein's victims receive the justice now and the platform now to tell their stories.\" US correspondent Finally, we see the look of the evidence - and it doesn't look great for Donald Trump. A lewd birthday message Trump allegedly sent to convicted sex offender Jeffrey Epstein has been released by Democrats. The alleged note had always been in doubt, as long as the fabled birthday book remained unpublished. There's more certainty now. Trump had repeatedly denied all association, saying: \"I never wrote a picture in my life. I don't draw pictures of women.\" It will amplify questions surrounding his friendship with Epstein and suggestions of improper behaviour. The US president denies any wrongdoing.\n\n Read the full analysis here US vice president JD Vance defended Mr Trump on X and called out Democrats for \"not caring about Epstein's victims\". He wrote: \"The Democrats don't care about Epstein. They don't even care about his victims. \"That's why they were silent about it for years. The only thing they care about is concocting another fake scandal like Russiagate to smear President Trump with lies. \"No one is falling for this BS.\""
    },
    {
        "title": "All we know about Donald Trump and Jeffrey Epstein's 'friendship'",
        "description": "Donald Trump has been fending off pressure from Democrats and his own Make America Great Again (MAGA) movement to release files related to the crimes of Jeffrey Epstein.",
        "url": "https://news.sky.com/story/all-we-know-about-donald-trump-and-jeffrey-epsteins-friendship-13398405",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jeffrey-epstein-donald-trump_6967766.jpg?20250718130524",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-09 06:44:00",
        "Headline": "The US president is under unprecedented pressure from the public to release the so-called Epstein files - but Mr Trump had a history with the paedophile financier long before allegations against him surfaced. Here's what we know.",
        "Content": " Donald Trump has been fending off pressure from Democrats and his own Make America Great Again (MAGA) movement to release files related to the crimes of Jeffrey Epstein. The paedophile financier was found dead in his Manhattan prison cell in August 2019, shortly after he was arrested on sex trafficking charges. The president pledged to release files on Epstein during his campaign, as his MAGA movement accused the Biden administration of suppressing the extent of Epstein's paedophilia and predatory behaviour. Epstein's so-called \"client list\" is thought to contain names of the rich and famous who conspired with him in his child sex trafficking operation. But Mr Trump made a controversial U-turn and instead started lashing out at supporters who are continuing to call for the files to be released. The saga has thrust Mr Trump and Epstein's former relations back into the spotlight over the past few months. But what do we know about their history? What has Trump said about their relationship? \n                  Trump denies knowledge of Israel's 'unfortunate' strike on Qatar - as Starmer joins global condemnation\n                 \n                  Handwriting expert says 'Donald Trump signature' in Epstein birthday book is 'absolutely' his - despite his denials\n                 \n                  What you need to know about Trump and the Epstein files\n                 Mr Trump and Epstein moved in the same circles in Florida and New York for many years, and were pictured together on several occasions in the 1990s and early 2000s, including at the real estate mogul's club in Palm Beach. There is now-infamous NBC News archive footage of the pair socialising in November 1992 at Mr Trump's Mar-a-Lago estate, with the now-president appearing to point out women on the dance floor.  In a 2002 interview with New York magazine, Mr Trump was quoted saying: \"I've known Jeff for 15 years. Terrific guy. \"He's a lot of fun to be with. It is even said that he likes beautiful women as much as I do, and many of them are on the younger side. No doubt about it - Jeffrey enjoys his social life.\" Allegations that Epstein had been sexually abusing girls became public in 2006 and he was arrested that year before accepting a plea deal. He was then arrested for a second time in 2019 and charged with sex-trafficking conspiracy.  Trump was asked about his relationship with Epstein after he was found dead in his cell, and he played down the extent of their relationship. He said he \"knew him like everybody in Palm Beach knew him\", but added: \"I had a falling out with him. I haven't spoken to him in 15 years. I was not a fan of his, that I can tell you.\" Asked why the pair fell out, Mr Trump said: \"The reason doesn't make any difference, frankly,\" and added that he had \"no idea\" about Epstein's crimes. Trump flew on Epstein's plane numerous times  Epstein owned an island in the Caribbean, a location where he is known to have taken underage girls to abuse them. He had a private plane which his acquaintances flew in, and some of the flight logs have been released to the public. 👉 Follow Trump100 on your podcast app 👈 Amid speculation in January last year, Mr Trump said on social media: \"I was never on Epstein's Plane, or at his 'stupid' Island.\" But the flight logs indicated he flew on Epstein's plane at least seven times. There is no suggestion that Mr Trump was flown to the island. The logs indicate that on one of the trips between New York and Florida he was accompanied by his then-wife Marla Maples and their daughter, Tiffany, and another listed his son Eric as a passenger. Court documents name Trump Court documents relating to Ghislaine Maxwell, her relationship with Jeffrey Epstein and alleged victims of sexual abuse were unsealed in January last year. The documents, which were part of a 2015 defamation case by Virginia Giuffre against Epstein's accomplice Ghislaine Maxwell, named Mr Trump, along with the likes of Prince Andrew and Bill Clinton.  A woman named Johanna Sjoberg gave testimony and said that while flying to Manhattan with Epstein, Maxwell, Ms Giuffre and Prince Andrew, the financier's jet was diverted to Atlantic City, New Jersey - where Epstein suggested going to one of Mr Trump's casinos. \"The pilots told me to go back and tell [Epstein] that we can't land in New York and that we were going to have to land in Atlantic City,\" she said. \"Jeffrey said, 'Great, we'll call up Trump and we'll go to' - I don't recall the name of the casino, but - 'we'll go to the casino'.\" She said she spent several hours with Epstein at a Trump casino but did not say if she met him. Mr Trump was not accused of any wrongdoing. Birthday letter from Trump to Epstein  The Wall Street Journal (WSJ) claimed in July it had seen a letter written by Mr Trump as part of a collection of letters addressed to Epstein that his former girlfriend Ghislaine Maxwell planned to give him as a birthday present in 2003. The paper said Mr Trump's letter featured several lines of typewritten text framed by what appeared to be a hand-drawn outline of a naked woman. Read more:What you need to know about Trump and the Epstein filesHow Ghislaine Maxwell could challenge her imprisonment It said the letter concludes \"Happy Birthday - and may every day be another wonderful secret\", and featured the signature \"Donald\", allegedly drawn across the woman's waist, meant to mimic the appearance of pubic hair. Mr Trump denied he wrote it in an interview with the WSJ prior to publication. In September, the entire birthday album was released by Democrats on the House Oversight Committee, including the letter purportedly signed by Mr Trump. The album also bore the names of other prominent figures, such as former President Bill Clinton and the current UK ambassador to Washington, Lord Peter Mandelson. The White House again denied Mr Trump wrote the letter. Press secretary Karoline Leavitt said in a statement that the president will \"continue to aggressively pursue litigation\", referring to a $10bn (£7.5bn) lawsuit Mr Trump filed against the WSJ after it initially reported on his link to the letter. Falling out Any friendship that existed between Mr Trump and Epstein in the 1990s is said to have turned sour in the early 2000s. The New York Times reports that the pair fell out in 2004 over a foreclosed oceanfront Palm Beach mansion that Mr Trump outbid Epstein for. In 2006 Epstein was indicted as part of an FBI and Florida police investigation. Two years later he pleaded guilty in state court to two felony charges, including soliciting a minor, as part of a plea deal that avoided federal charges that would have meant far more serious prison time. There is little public record of Mr Trump and Epstein crossing paths from 2004 onwards. In 2019 Mr Trump said that he and Epstein had had a \"falling out\" and hadn't spoken for 15 years."
    },
    {
        "title": "Rupert Murdoch's son Lachlan takes control of family media empire, including Fox News and Wall Street Journal",
        "description": "The Murdoch family have reached a deal which will see Rupert Murdoch's son Lachlan cement control of the family media empire that includes Fox News and The Wall Street Journal.",
        "url": "https://news.sky.com/story/rupert-murdochs-son-lachlan-takes-control-of-family-media-empire-including-fox-news-and-wall-street-journal-13427390",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rupert-murdoch-los-angeles_7014794.jpg?20250909043933",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-09 03:18:00",
        "Headline": "The battle for control of one of the highest-profile global media groups is thought to have been one of the inspirations for the TV show Succession.",
        "Content": " The Murdoch family have reached a deal which will see Rupert Murdoch's son Lachlan cement control of the family media empire that includes Fox News and The Wall Street Journal. The agreement ends a battle over who will control one of the highest-profile global media groups. The dispute is thought to have been one of the inspirations for the television series Succession, about the infighting of the members of a media dynasty. Under the deal, Rupert's children James Murdoch, Elisabeth Murdoch and Prudence MacLeod will sell their personal holdings in Fox and News Corp over a period of six months. In return, they are each expected to receive about $1.1bn (£810m) in proceeds, according to a source. Fox Corp said on Monday it had reached a mutual resolution, putting an end to all legal proceedings. A new family trust will be created to benefit Lachlan Murdoch, and his younger siblings Grace and Chloe Murdoch, who are Rupert's children from his marriage to Wendi Deng Murdoch. A battle over the global television and publishing empire had played out last year in a Nevada courtroom, where a judge considered the contentious matter of succession. Rupert, 94, attempted to change the terms of the family's trust, which was set up after his 1999 divorce from his second wife, Anna. The trust holds significant stakes in Fox News parent Fox and Wall Street Journal owner News Corp. Read more from Sky News:Alleged Epstein birthday note releasedTech giants to join Trump on state visitNews Corp takes stake in marketing firm Under the original trust, News Corp and Fox voting shares would have been transferred to Rupert's four oldest children - Prudence, Elisabeth, Lachlan, and James - upon his death. But Rupert had proposed an amendment to the trust after he feared that three of his heirs, James, Elisabeth and Prudence, could mount a coup to oust Lachlan, who is executive chairman of Fox and chairman of News Corp. A court rejected that plan in December, saying Rupert and Lachlan had acted in \"bad faith\" in seeking to amend the irrevocable trust. Mr Murdoch launched Sky, which includes Sky News, in 1989. In 2018, 21st Century Fox sold their 39% stake in the firm to Comcast."
    },
    {
        "title": "CCTV shows at least 15 masked robbers carry out smash-and-grab raid at California jewellery store",
        "description": "CCTV footage shows the moment more than a dozen masked robbers carried out a smash-and-grab raid at a jewellery store in California - with the store's 88-year-old owner knocked to the ground.",
        "url": "https://news.sky.com/story/cctv-shows-at-least-15-masked-robbers-carry-out-smash-and-grab-raid-at-california-jewellery-store-13427564",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-california-robbery_7015190.jpg?20250909130626",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-09 11:02:00",
        "Headline": "The store's elderly owner was pushed over during the raid - with his niece saying doctors later discovered he also suffered a stroke.",
        "Content": " CCTV footage shows the moment more than a dozen masked robbers carried out a smash-and-grab raid at a jewellery store in California - with the store's 88-year-old owner knocked to the ground. The pensioner was taken to hospital where doctors said he also suffered a stroke during the ordeal, his niece told Sky News' US partner network NBC News. The footage shows a grey Ford Explorer SUV pull up outside the Kim Hung Jewelry store in San Jose on Friday afternoon before reversing through the glass front of the store at speed. The vehicle then drives out of the shop and stops nearby before three more cars pull up outside. At least 15 suspects, wearing hoodies and masks, then get out of all four of the vehicles before running inside the store and stealing jewellery after using pick axes and other tools to smash glass displays. Police said at least one of the suspects had a firearm. In the footage, one of the men is seen pushing the elderly store owner to the ground before another robber steps over him as they continue the raid. \n                  Trump denies knowledge of Israel's 'unfortunate' strike on Qatar - as Starmer joins global condemnation\n                 \n                  Trump latest: President would back expert review of alleged signature on note to Epstein, White House says\n                 \n                  Handwriting expert says 'Donald Trump signature' in Epstein birthday book is 'absolutely' his - despite his denials\n                 San Jose police have said the suspects fled in multiple vehicles before officers arrived at the scene and they are yet to identify any suspects. The store owner's niece said she found him outside the shop after the raid with open wounds caused by shattered glass. She added he was released from hospital on Sunday but may never return to work. Read more:Murdoch family reach deal over future of empireMore than 20 civilians killed in 'brutal' Russian strike on Donetsk Edward Escobar, founder of the Coalition for Community Engagement, said at a news conference on Sunday that such robberies have \"become a regular occurrence\" in the state. However, the latest California Department of Justice data show robberies were down last year compared with 2023 and burglary and other property crimes were at a nine-year low last year, NBC News reports. Diana Crofts-Pelayo, a spokesperson for California Governor Gavin Newsom, said the governor's office wishes the store's owner a speedy recovery."
    },
    {
        "title": "What's driven UK's astounding immigration levels - including some unprecedented highs",
        "description": "One of the great tragedies of the way immigration policy has been debated in this country for years, if not decades, is that the conversation is mostly voiced in emotive rather than rational terms.",
        "url": "https://news.sky.com/story/whats-driven-uks-astounding-immigration-levels-including-some-unprecedented-highs-13427778",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-boris-johnson-ed-conway_7015664.jpg?20250910012757",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-09-09 17:44:00",
        "Headline": "Government policy post-Brexit has been the driving force behind the number of people moving to Britain in recent years - and while the numbers crossing on small boats are relatively small, those too are at record highs.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  One of the great tragedies of the way immigration policy has been debated in this country for years, if not decades, is that the conversation is mostly voiced in emotive rather than rational terms. Those who air fears about the flows of foreign-born people into the UK are dismissed as bigots (most famously by Gordon Brown). Those who argue that immigrants are good for the economy are dismissed as being deluded or blind to a mounting crisis. Politics Hub: Follow the latest from Westminster So what's actually going on? Well, let's take a deep breath, try if we can to ignore all the emotions, and focus instead on the numbers. What do those numbers tell us? Highest net migration in British history Well, the big picture is… big. The total flows of migrants coming into the country in recent years have been nothing short of astounding. While the figures have plateaued in the past 18 months or so, as of late 2023, immigration (which is to say, people coming to live here) was running at roughly 1.3 million people a year. Subtract those emigrating in that period (roughly 400,000), and that leaves you with net migration of nearly 900,000 people. This is such a large number it's actually quite hard to get your head around it, but here's one way. As a percentage of the population (it comes out at about 1.25%), this is the highest net migration this country has ever experienced, since roughly comparable records began hundreds of years ago. Indeed, I cannot find another similar episode running back to the reign of Henry VIII. How did we get here? It wasn't all that long ago that David Cameron was promising to reduce net migration to the \"tens of thousands\" each year. So how did we get to a place where net migration was close to running into seven figures? In large part, the answer comes back to the introduction of the new post-Brexit migration rules implemented under Boris Johnson's government. Among these reforms were measures making it comparatively easier for non-EU nationals to get visas. There were also, perhaps even more importantly, new student visa rules making it easier to come and study in this country. Students and government policy The upshot is that numbers of students from countries around the world (but mostly outside the EU, led by India, China, Nigeria, and Pakistan) flowed into this country. The extent to which these visas were really quasi-working visas, enabling young workers to come into this country to work in the gig economy, is something economists and officials are still picking over even now. But what is clear is that there is nothing normal about this influx. It's perhaps worth underlining at this stage that this immigration - the record flows, greater than anything we've seen since at least Henry VIII - is nearly all legal. These are people coming into the country not illegally or on small boats or via the asylum system, but having been issued with visas by the Home Office. This was a direct result of government policy (as well as the economic incentives of coming to a country like the UK). But that raises another question: how much of this was small boats? After all, the vast majority of coverage in papers and television news in recent weeks has fixated on the small boats. So how much of that total do they account for? In short, just under 5% of the total. None of this is to say small boats aren't a very big issue for the UK. But, surprising as this might sound, given how many column inches are devoted to them, they are absolutely dwarfed by the legal flows.  High legal migration - but small boats still at record levels And while the flows of legal immigration to Britain (and, for that matter, student immigration) are among the highest in the developed world, flows of asylum seekers are considerably lower than in most other countries. Britain may rank number one in the OECD on students and number two on overall immigration, but it only saw the eighth-biggest flows of asylum seekers in the most recent year for which we have data (2023). Of the total flows into the UK in the most recent time period, small boat arrivals accounted for a mere 4.8%. The vast majority is legal migration. But that being said, the totals coming in on small boats and into the asylum system are nonetheless at unprecedented highs. Moreover, in recent years, asylum seekers have been less likely to be removed from the country. A growing proportion have been bailed, pending their cases, with the upshot that right now the total number of asylum seekers around the UK is close to 125,000 - about the size of Cambridge. All of which is to say, both of the following statements are true: Firstly, small boats are a tiny fraction of overall immigration, and secondly, Small boat numbers are higher than ever before and are contributing to unprecedented levels of asylum seekers in the UK. Britain is far from the only country to face these challenges. The question now is whether it can succeed in bringing down the flows and the backlog in the coming years."
    },
    {
        "title": "Ben & Jerry's' boss would give back money for brand independence amid 'silencing' claim",
        "description": "The co-founders of the Ben & Jerry's ice cream brand are demanding the brand be given its independence back amid a long-running row with its current UK owner.",
        "url": "https://news.sky.com/story/ben-jerrys-co-founders-demand-independence-for-brand-in-latest-ownership-spat-13427512",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ben-cohen-ben-and-jerrys_7015292.jpg?20250909144902",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-09-09 12:00:00",
        "Headline": "Ben Cohen, the Ben in the famous ice cream company, spoke to Sky News in London as he seeks to have the brand \"released\" - handed its independence back - after a series of high-profile rows with Unilever.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  The co-founders of the Ben & Jerry's ice cream brand are demanding the brand be given its independence back amid a long-running row with its current UK owner. Ben Cohen and Jerry Greenfield have written an open letter demanding that it be \"released\" from its parent firm. Mr Cohen told Sky News he would give back the money he received in the sale of the business to Unilever in 2000 if it meant the brand could be independent. Ben & Jerry's is set to spin off all its ice cream brands under The Magnum Ice Cream Company (TMICC) name in a deal set to be fully completed before the end of the year. \"You're saying, would I give it back? Absolutely. If we could still have Ben and Jerry's independent, any day\", he said. \"It seems like the board of Magnum has been Trumpified\", Mr Cohen told Sky News as he protested the \"silencing\" of Ben & Jerry's social mission. Money latest: My parents' row with P&O Cruises was resolved by audio recording \n                  What's driven UK's astounding immigration levels - including some unprecedented highs\n                 \n                  Jaguar Land Rover getting 'daily' support as workers told to stay at home\n                 \n                  Money blog: Deodorant brand tells customers to stop using certain products after rashes reported\n                 The consumer goods firm Unilever has never enjoyed an easy relationship with Ben & Jerry's - a brand known for its activism on many political and social issues. As part of the original merger deal, an independent board was set up to protect the ice cream brand's mission. But a series of disputes have followed. The most high-profile spat came in 2021 when the US brand took the decision not to sell ice cream in Israeli-occupied Palestinian territories on the grounds that sales would be \"inconsistent\" with its values. Unilever responded by selling the business to its licensee in Israel. The independent board is currently locked in a legal dispute with Unilever, claiming in March that its then-chief executive David Stever was improperly sacked. For its part, Unilever has always argued that it \"reserved primary responsibility for financial and operational decisions\" as owners of Ben & Jerry's. In another example of the frostiness between them, an ice cream flavour launched in support of Democrat presidential candidate Kamala Harris went down badly in London. Ben & Jerry's claimed Unilever had demanded it stop public criticism of Donald Trump. Ben Cohen himself was arrested earlier this year over a protest in support of Gaza during a US Senate hearing. He and Mr Greenfield intervened in the ownership row as TMICC briefed investors on their plans at a so-called capital markets day. They say the independent board and many consumers and employees \"no longer support the trajectory on which it is set\". Mr Cohen, who is attending the event to protest, said: \"Ben & Jerry's was founded on a simple but radical premise: that our business could thrive and make outstanding products whilst standing up for progressive values. \"We fought to ensure our social justice mission was protected by Unilever when the company was acquired, but over the past several years, this has been eroded, and the company's voice has been muted. \"We won't be silent anymore. Authenticity has always been at the very heart of what we do, and stripping this away risks destroying the very value of Ben & Jerry's. We urge the board and potential investors to rethink the inclusion of Ben & Jerry's in Magnum's future makeup and establish a Free Ben & Jerry's.\" The new ice cream division, which will also comprise other brands such as Wall's, is based in the Netherlands and will have a primary stock market listing in Amsterdam. A spokesperson for The Magnum Ice Cream Company told Sky News: \"Ben & Jerry’s is a proud part of The Magnum Ice Cream Company and is not for sale. \"We remain committed to Ben & Jerry’s unique three-part mission – product, economic and social – and look forward to building on its success as an iconic, much-loved business.\" Unilever has also been contacted for comment. "
    },
    {
        "title": "Jaguar Land Rover getting 'daily' support as workers told to stay at home",
        "description": "Jaguar Land Rover is getting \"daily\" support from the government after last week's cyber attack, which has ground its operations to a halt.",
        "url": "https://news.sky.com/story/jaguar-land-rover-getting-daily-support-as-workers-told-to-stay-at-home-13427714",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jaguar-land-rover_7009369.jpg?20250902155229",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-09 15:26:00",
        "Headline": "Sky News understands JLR workers are not due back at work on Wednesday with production suspended for another day.",
        "Content": "Jaguar Land Rover is getting \"daily\" support from the government after last week's cyber attack, which has ground its operations to a halt. The British car maker shut down operations when it spotted the attack last Tuesday, and its staff have been told to stay at home since. Sky News understands JLR workers are not due back at work on Wednesday, with production suspended for another day.   When asked for a timeline on when operations would resume for all of the company's 34,000 UK workers, business minister Sir Chris Bryant said: \"I wish that I could provide one, but I cannot. \"This is a very live situation that has been ongoing for a week.\" He also said he could not share details on who was behind the attack, despite hacking group Scattered Spider claiming responsibility. Scattered Spider was blamed for the attacks on British retailers earlier this year, which are thought to have cost M&S around £300m. Four people were arrested for their suspected involvement in the April attacks and have been bailed. Asked whether the incident was linked to the M&S attack earlier this year, Mr Bryant said he could not say as he \"didn't know\". \"I do not think anybody has come to any secure decisions on that,\" he said. Read more:Murdoch family reach deal over future of empireMore than 20 civilians killed in 'brutal' Russian strike on Donetsk Jaguar Land Rover (JLR) has invited local MPs whose constituents are impacted by the shutdown to a Q&A session on Friday. \"The JLR Halewood plant in my constituency is an important and valued employer,\" said Labour MP Derek Twigg, who asked an urgent question about the government's response to the attack in the Commons on Tuesday. \"Many of my constituents are employees, which is also the case for my neighbouring Merseyside MPs. Thousands of jobs in the supply chain have been affected.\" JLR employs 39,000 people around the world, with many more working in its supply chains. Mr Twigg warned: \"There could be an ongoing and even more serious effect on our economy.\" In his response, Sir Chris said: \"We simply cannot afford any degree of complacency in this. \"There are major criminals operating in this space, as well as some malicious state actors, and some 40% of companies in the UK last year reported that they had faced some kind of cyber attack. \"So it is a very important issue that we take seriously.\" JLR said it continues \"to work around the clock\" to restart work in a \"controlled and safe manner\". \"We are very sorry for the disruption this incident has caused. Our retail partners remain open and we will continue to provide further updates.\""
    },
    {
        "title": "Nationwide app and internet banking back up after outage",
        "description": "The mobile banking app and internet banking were down at Britain's biggest building society this afternoon.",
        "url": "https://news.sky.com/story/nationwide-app-and-internet-banking-down-13427667",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-nationwide-bank-logo_6593239.jpg?20240628115738",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-09-09 14:26:00",
        "Headline": "Nationwide's online services had been offline on Tuesday afternoon.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The mobile banking app and internet banking were down at Britain's biggest building society this afternoon. Nationwide's online services had been offline since around 3pm on Tuesday. It apologised \"for any problems this may cause\". \"We're working to get things back to normal as quickly as we can,\" it added. Money blog: Deodorant brand tells customers to stop using some products Direct debits and standing orders were working normally, and customers could still use cards online and in shops, withdraw money from cash machines and receive payments. Initially, Nationwide said some customers were unable to access the app or internet banking and told users to try again later. At 2.44pm 1,900 users reported issues with Nationwide services on the Downdetector website, but the service was back working around 4pm. The issue of bank outages has been examined by the influential Treasury Committee of MPs after services at several high street lenders were disrupted for two pay days in a row. In response to a February letter from the committee, Nationwide said it had seven incidents of IT failure, impacting customers for 1,577 minutes in 2023, which rose to 11 incidents in 2024 for 2,649 minutes. Read more:Bank payday outages 'will absolutely happen again'HSBC 'being attacked all the time' by online criminals While the overall number of customers impacted could not be recorded, Nationwide said 1.99 million transactions were affected across the two years, which represents approximately 0.03% of all transactions over the period. The failures were caused by \"technical faults in hardware or software\", or as a result of an outage following a planned upgrade or change to Nationwide systems, the March letter read."
    },
    {
        "title": "Argos store card-owner NewDay nears £1.7bn deal with KKR",
        "description": "The owner of Argos's store card division is on the brink of a deal with one of the world's largest private equity investors that will value it at about &#163;1.7bn.",
        "url": "https://news.sky.com/story/argos-store-card-owner-newday-nears-16317bn-deal-with-kkr-13427753",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-argos-sainsburys_6792738.jpg?20250106115833",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-09 16:39:00",
        "Headline": "NewDay, which has partnerships with retailers including John Lewis and AO, was on the brink on Tuesday of a deal that will see KKR becoming a major investor in the group, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of Argos's store card division is on the brink of a deal with one of the world's largest private equity investors that will value it at about £1.7bn. Sky News has learnt that the owners of NewDay Group, which has millions of customers in the UK, were on Tuesday evening close to signing an agreement that will see KKR become a major stakeholder in the company. City sources said KKR was likely to acquire NewDay's existing loan-book as well as buying a stake in its lending platform alongside existing shareholders Cinven and CVC Capital Partners. An agreement could be announced as early as Wednesday, according to insiders. Money blog: Deodorant brand tells customers to stop using some products NewDay has consumer credit links with some of Britain's leading retailers, including John Lewis Partnership and AO, the online electrical goods site It owns the Aqua, Fluid and Marbles credit brands, as well as Bip - the UK's first digital-only credit \"card\". The company's owners have been exploring an outright sale or a more structured transaction for months, drawing interest from parties such as Pimco, the giant bond fund manager. Read more:Bank payday outages 'will absolutely happen again'HSBC 'being attacked all the time' by online criminals NewDay took ownership of Argos's store card business last year in a £720m deal with J Sainsbury, the supermarket giant. It is one of Britain's biggest privately held providers of consumer credit services, with about four million customers. Last year, it reported £213m of underlying pre-tax profit, with new customer acquisitions up 36%. It also launched a technology and lending partnership with Lloyds Banking Group, and launched the pilot of a technology partnership with Debenhams Group in the final quarter of last year. The company is chaired by Sir Mike Rake, the former BT Group and Worldpay chairman. Its chief executive is John Hourican, the former Bank of Cyprus and Royal Bank of Scotland executive. NewDay, KKR and CVC declined to comment."
    },
    {
        "title": "Murdoch succession row resolved but empire's future success far from certain",
        "description": "The deal that finally settles the real-life succession drama of the Murdoch family was driven by a desire to preserve the animating forces of the media mogul&#8217;s remarkable career; power and money.",
        "url": "https://news.sky.com/story/murdoch-succession-row-resolved-but-empires-future-far-from-certain-13427493",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-rupert-murdoch-james_6686650.jpg?20240915162611",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-09-09 08:45:00",
        "Headline": "Sky's Paul Kelso outlines the challenges facing Rupert Murdoch's business interests as control is set to pass to eldest son Lachlan after a protracted legal process that has split the family.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  The deal that finally settles the real-life succession drama of the Murdoch family was driven by a desire to preserve the animating forces of the media mogul’s remarkable career; power and money. Rupert Murdoch's empire was built on the foundations of a news business that astutely served right-of-centre audiences on three continents. First in his native Australia, then the UK, and finally in America, his titles and channels reflect and sometimes make the political weather. Preserving that influence and the income that comes with it was his priority when, two years ago, he tried to oust three of his children from a family trust in favour of Lachlan Murdoch, his eldest son who shares his conservative world-view. Money latest: My parents' row with P&O Cruises was resolved by audio recording The deal just agreed achieves that goal, but only after a pay-off estimated at more than $1bn each to Lachlan's siblings Elisabeth and James, and half-sister Prudence, Murdoch's eldest child from his first marriage. While Lachlan's politics matter, the Murdoch enterprise has seldom been ideological. Rupert has long been pragmatic in his endorsements, unapologetically switching horses if he feared he was backing a loser. When his UK titles ditched the Conservatives to support Tony Blair in 1997, they did so long after the electorate had made up its mind. And while Fox helped create Donald Trump and energise his base, Murdoch is no MAGA-loyalist. \n                  Rupert Murdoch's son Lachlan takes control of family media empire, including Fox News and Wall Street Journal\n                 \n                  Trump, Epstein and a 'bawdy' birthday card\n                 \n                  News Corp to take stake in London-listed marketing group Brave Bison\n                 His Wall Street Journal is being sued by the President for revelations about his links to Jeffrey Epstein, and Fox has paid hundreds of millions in damages for false claims about the probity of the 2020 election. This deal does end the possibility of the more liberally-minded James, a former chief executive of Sky, changing the direction of the US holdings including Fox. But among investors and executives at Fox and News Corp, which controls The Times, The Sunday Times and The Sun, the principal concern has been that a messy succession would lead to the break-up of businesses that between them generated $35bn in revenue last year. Among Rupert Murdoch's many attributes perhaps his most valuable has been for sensing and serving the public mood. Lachlan may share his father's politics, that instinct may not be inheritable. The succession may be secure, but in a media landscape transformed from the one he helped create, his empire's dominance is far from guaranteed."
    },
    {
        "title": "Dragon's Den judge Suleyman swoops with rescue bid for Claire's",
        "description": "The Dragons&#8217; Den judge Touker Suleyman has tabled a bid to rescue Claire&#8217;s, the ailing accessories retailer, with a pledge to retain its head office and a significant chunk of its British store portfolio.",
        "url": "https://news.sky.com/story/dragons-den-judge-suleyman-swoops-with-rescue-bid-for-claires-13427578",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-claires-claires-accesories_7005467.jpg?20250830115912",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-09 11:29:00",
        "Headline": "Touker Suleyman, the owner of menswear brand Hawes & Curtis, has tabled a proposal to buy the accessories retailer’s UK operations and retain most of its workforce, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Dragons’ Den judge Touker Suleyman has tabled a bid to rescue Claire’s, the ailing accessories retailer, with a pledge to retain its head office and a significant chunk of its British store portfolio. Sky News can exclusively reveal that Mr Suleyman is a serious contender to buy Claire's UK operations from Interpath, the administrator appointed to handle its insolvency last month. Mr Suleyman, who owns the menswear brand Hawes & Curtis and womenswear label Ghost, is understood to have lodged a proposal which would keep much of Claire's existing business intact. Sources said on Tuesday that Mr Suleyman and Modella Capital, the retail investor, were now the two likeliest buyers of the retailer's UK operations, with Doug Putman, the HMV owner, also having made an offer. Money latest: Pret to launch meal deal Bidders for Claire's British arm must secure approval for a deal both from Interpath and Ames Watson, a private equity firm which last month agreed to buy Claire's brand and up to 950 of its US stores. The remaining parties in the UK sale process are also understood to have held talks with the new brand-owner. \n                  What's driven UK's astounding immigration levels - including some unprecedented highs\n                 \n                  Ben & Jerry's' boss would give back money for brand independence amid 'silencing' claim\n                 \n                  Jaguar Land Rover getting 'daily' support as workers told to stay at home\n                 Mr Suleyman has become a prominent figure by virtue of his decade-long involvement in the BBC TV show. His involvement in the Claire's auction pits him against the new owner of WH Smith's high street empire, Modella Capital. People close to the process said Mr Suleyman's proposal was likely to save a larger number of jobs and shops than Modella's, although the terms of either's proposals were unclear. Claire's employs more than 2,100 people in the UK and Ireland, where it trades from 278 and 28 stores respectively. Interpath said last month it would keep all shops open while it assessed options for the business. Claire's, which has been a fixture in British shopping centres and town centres for decades, is one of the biggest high street chains to fall into insolvency this year. It has a particular following among teenage shoppers. The company had been running a sale process prior to its appointment as administrators, but did not manage to secure a solvent deal. The retail industry has been left reeling by the employers' national insurance hike announced by Rachel Reeves, the chancellor, last autumn. Both Poundland and River Island recently survived creditor votes, paving the way for them to slash rents and close dozens of stores. The collapse of Claire's UK operations came a week after its US parent company filed for Chapter 11 bankruptcy protection. The company had been owned by former creditors Elliott Management and Monarch Alternative Capital following a previous financial restructuring. Will Wright, UK chief executive at Interpath, said last month: \"Claire's has long been a popular brand across the UK, known not only for its trend-led accessories but also as the go-to destination for ear piercing. \"Over the coming weeks, we will endeavour to continue to operate all stores as a going concern for as long as we can, while we assess options for the company. \"This includes exploring the possibility of a sale which would secure a future for this well-loved brand.\" Neither Mr Suleyman nor Interpath could be reached for comment."
    },
    {
        "title": "Water firms Anglian and South West fined combined £87m for sewage failures",
        "description": "Two water companies have been fined a combined &#163;86.8m over sewage-related failures.",
        "url": "https://news.sky.com/story/water-firms-anglian-and-south-west-fined-combined-16387m-for-sewage-failures-13427422",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sewage-rivers_6968697.jpg?20250719173745",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-09-09 06:09:00",
        "Headline": "Ofwat says it has raked in more than £240m in redress packages for wastewater failures so far this year.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Two water companies have been fined a combined £86.8m over sewage-related failures. Industry watchdog Ofwat - itself set to be scrapped as part of a shake-up of oversight in the sector - said Anglian Water and its shareholders faced a redress package of £62.8m. The penalty for South West Water stood at £24m. Money latest: My parents' row with P&O Cruises was resolved by audio recording The pair are the latest firms to face financial consequences for breaching obligations in the operation of their wastewater treatment works and networks. Ofwat said that both failed to operate, maintain and upgrade their wastewater assets adequately to ensure they could cope with flows of sewage and wastewater. The reports also criticised the processes and management at the companies, including board level oversight. \n                  What's driven UK's astounding immigration levels - including some unprecedented highs\n                 \n                  Ben & Jerry's' boss would give back money for brand independence amid 'silencing' claim\n                 \n                  Jaguar Land Rover getting 'daily' support as workers told to stay at home\n                  The regulator said its five wastewater investigations to have concluded this year had resulted in enforcement action worth more than £240m. Much of the cash goes towards storm drain improvements and local projects aimed at restoring river eco systems. Lynn Parker, senior director for enforcement at Ofwat, said: \"Our investigations found failures in how Anglian Water and South West Water have operated and maintained their sewage works and networks, which has resulted in excessive spills from storm overflows.  \"These are serious breaches and are unacceptable. \"We understand that the public wants to see transformative change. \"That is why we are prioritising this sector-wide investigation, which is holding wastewater companies to account for identified failures. \"We are pleased both companies have accepted that they got things wrong and are now focusing on putting that right, and taking action to come back into compliance.\" Household bills are on the rise, at inflation-busting rates, over the next five years as the industry - including cash-strapped Thames - scrambles to make the necessary improvements to its infrastructure. The major creditors at Thames are currently trying to convince the government and Ofwat of their operational and ownership plans to take control of the business through a new vehicle called London & Valley Water. Firms are also under pressure to save more water, through leak prevention and improved storage capacity, as climate change presents challenges in terms of extremes. While storm drains have been unable to cope with vast volumes associated with heavier storms, rainfall has been scarce since spring with the UK seeing its hottest summer on record. Reservoir stocks are below average levels for this time of year widely and hosepipe bans remain in force across many areas of England, especially in the East."
    },
    {
        "title": "Former Sainsbury’s chief King pulls out of race to chair Channel 4",
        "description": "Justin King, the former J Sainsbury chief executive, has pulled out of the race to chair Channel 4, the state-owned broadcaster.",
        "url": "https://news.sky.com/story/former-sainsbury8217s-chief-king-pulls-out-of-race-to-chair-channel-4-13427474",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-channel-4-channel-four_6846256.jpg?20250304185310",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-09 08:12:00",
        "Headline": "Justin King, the chair of National Lottery operator Allwyn, has told Whitehall officials he is no longer a candidate to head the state-owned broadcaster, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Justin King, the former J Sainsbury chief executive, has pulled out of the race to chair Channel 4, the state-owned broadcaster. Sky News has learnt that Mr King informed government officials earlier this month that he was no longer a potential successor to Sir Ian Cheshire. His exit from the recruitment process leaves existing Channel 4 board member Debbie Wosskow and Wol Kolade, a private equity executive, as the remaining contenders whose identities have been publicly disclosed. Money latest: My parents' row with P&O Cruises was resolved by audio recording Industry sources believe at least one other candidate may also be in contention for the job. Mr King is said by one Whitehall source to have withdrawn citing other commitments, although he recently stepped down from the boards of Ovo Energy and Marks & Spencer. He also chairs Allwyn, the National Lottery operator, and Dexters, the estate agency chain. \n                  What's driven UK's astounding immigration levels - including some unprecedented highs\n                 \n                  Ben & Jerry's' boss would give back money for brand independence amid 'silencing' claim\n                 \n                  Jaguar Land Rover getting 'daily' support as workers told to stay at home\n                 The Whitehall source said Mr King had been encouraged to put his name forward for the role following Sir Ian's departure. The process to recruit a chair for Channel 4 has been ongoing for months, with Dawn Airey, the media industry veteran, holding the role on an interim basis. Sir Keir Starmer's decision to retain Lisa Nandy as culture secretary has removed a potential reason for the conclusion of the process to be delayed, with insiders suggesting a decision about a preferred candidate is imminent. Sir Ian stepped down earlier this year after just one three-year term in the role. The race to lead the state-owned broadcaster's board has acquired additional importance since after the resignation of Alex Mahon, its long-serving chief executive. Ms Mahon, who was a vocal opponent of the last Conservative government's proposed privatisation of Channel 4, has left to join Superstruct, a private equity-owned live entertainment company. Recruitment to the board of Channel 4 is technically led by Ofcom, the media regulator, in agreement with the culture secretary. Ms Nandy is also expected to launch a search shortly for a successor to Lord Grade, the Ofcom chair. The Department for Culture, Media and Sport declined to comment, while Mr King could not be reached for comment."
    },
    {
        "title": "Bridget Phillipson emerges as frontrunner in Labour's deputy leadership race",
        "description": "Bridget Phillipson has emerged as the early frontrunner in the Labour deputy leadership race as other candidates scramble to catch up ahead of a crunch deadline.",
        "url": "https://news.sky.com/story/bridget-phillipson-emerges-as-frontrunner-in-labours-deputy-leadership-race-13427824",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bridget-phillipson_7009004.jpg?20250902092346",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-09-09 19:17:00",
        "Headline": "Other candidates are racing to catch up ahead of a crunch deadline on Thursday - but there is concern about the logistics of a key hustings event in which contenders will make their pitch to undecided voters.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Bridget Phillipson has emerged as the early frontrunner in the Labour deputy leadership race as other candidates scramble to catch up ahead of a crunch deadline. The education secretary had the backing of 44 colleagues as of 6pm on Tuesday, according to the first official tally released by the Parliamentary Labour Party (PLP) since nominations opened. Former Commons leader Lucy Powell, who was sacked by Sir Keir Starmer in his reshuffle last week, is close behind with 35, followed by backbenchers Bell Ribeiro-Addy with eight, Dame Emily Thornberry with seven and Paula Barker with three.  Housing minister Alison McGovern is currently coming last with two nominations, though sources on her campaign team suggested this did not reflect the true level of support behind her. Candidates have until 5pm on Thursday to receive the backing of 80 colleagues, meaning there is still plenty left to play for as less than 100 MPs have made their official nominations so far, out of 398. A fresh tally will be published by the PLP on Wednesday evening, though MPs may publicly reveal who they are backing before then. Those not on the PLP's current list include Southport MP Patrick Hurley, who has thrown his weight behind Ms McGovern in a post on X. \n                  Bridget Phillipson: Mam was threatened with baseball bat\n                 \n                  Bridget Phillipson woos unions with promise to deliver employment rights uplift 'in full'\n                 \n                  Labour deputy leadership contest: How does it work and who is eligible to vote?\n                 Candidates will have the chance to woo undecided colleagues during a hustings event on Wednesday evening, but there are fears it could descend into chaos as the event will be held online only. That means hundreds of MPs will have just one hour to quiz the six contenders virtually. It is not clear if or how the event will be moderated. Ms Barker, the MP for Liverpool Wavertree, expressed concern about the logistics of the contest. Asked if she feels confident she can get the numbers, she told Sky News: \"I think the very tight timeframe and the fact hustings for MPs are being held online 8pm - 9pm when the majority of colleagues are travelling home undoubtedly compounds the issue. \"Of course, that is an issue to be addressed by whoever wins the race and at this moment in time we are all in the same boat.\" However, a Labour source defended the decision, saying: \"There's frankly no convenient time to do it. Ministers will have busy diaries serving the public during the day... priority has to remain public service.\" Ms Ribeiro-Addy has also criticised the contest's rules, telling Sky News' Politics Hub with Sophy Ridge that having just a few days to get 80 nominations \"doesn't feel right\", especially given the winner is \"ultimately decided by members\". Candidates who make it through the first round must go on to win the support of either 5% of Constituency Labour Parties (CLPs) or three organisations affiliated to the party, two of which must be trade unions. The successful candidates will then appear on the ballot for a vote of all party members and affiliated party supporters, with results declared on 25 October. The six-week timeline was set by Labour's ruling National Executive Committee but will be overseen by the party machinery who insist they will work with all candidates to give them a fair hearing. There are many MPs and ministers who want to see the contest done quickly, to avoid it being a distraction from the government's priorities. Explainer: Who is standing to replace Angela Rayner as deputy Labour leader?  Candidates make their pitch The race was triggered by the resignation of former deputy prime minister and housing secretary Angela Rayner after she admitted underpaying stamp duty on a flat she bought in Hove. Following calls for her replacement to be a Northern woman, all six candidates who entered are female, though Ms Ribeiro-Addy and Dame Emily represent seats in London. Ms Phillipson and Ms McGovern are seen as candidates that would remain loyal to Number 10, which some MPs want to see to avoid the party becoming more divided. They both honed in on their Northern roots while pitching themselves as the candidate to take on Reform UK when announcing their deputy leadership bids on Tuesday. Clapham and Brixton Hill MP Ms Ribeiro-Addy is seen as the left-wing candidate, and has the backing of many MPs in the Socialist Campaign Group (SCG) such as Corbynite Richard Burgon. However, Ms Baker, a former trade union official and Ms Thornberry, chair of the foreign affairs committee, have also vowed to challenge the government on issues like welfare and Gaza. Manchester Central MP Ms Powell was recently ousted from government and said she decided to stand \"after much encouragement\" from colleagues. A Survation survey of 1,308 Labour members who read the LabourList website suggested Ms Phillipson was the most popular choice for the role."
    },
    {
        "title": "Bridget Phillipson: Mam was threatened with baseball bat",
        "description": "In her first audition for the job of Labour deputy leader, Bridget Phillipson came to Brighton to woo the trade unions. And she began with a traumatic story about her childhood.",
        "url": "https://news.sky.com/story/bridget-phillipson-mam-was-threatened-with-baseball-bat-13427764",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-bridget-phillipson_6959935.jpg?20250708102236",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-09-09 17:01:00",
        "Headline": "The education secretary is one of six women, so far, standing to replace Angela Rayner as deputy Labour leader.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n In her first audition for the job of Labour deputy leader, Bridget Phillipson came to Brighton to woo the trade unions. And she began with a traumatic story about her childhood. By the time she rose to address the Trades Union Congress (TUC) conference at 3.30pm, she was one of no fewer than six candidates, all women, having announced her bid as \"a proud working-class woman from the North East from a single-parent family\". And as is the habit of candidates for election to high office these days - Sir Keir Starmer first told the story about his father Rodney the toolmaker in a speech at a TUC conference - she told delegates about an ordeal during her childhood. Politics latest: Sixth MP enters deputy race  \"I grew up on a street of council houses in Washington, in the North East - just me and my mam,\" she said. Note she said \"mam\", not \"mother\". \"And back when I was young,\" she continued, \"a man turned up at the front door with a baseball bat. \n                  Bridget Phillipson emerges as frontrunner in Labour's deputy leadership race\n                 \n                  Bridget Phillipson woos unions with promise to deliver employment rights uplift 'in full'\n                 \n                  Labour deputy leadership contest: How does it work and who is eligible to vote?\n                 \"A few weeks earlier, we'd been burgled - and my mam had reported it to the police. Now the man had come back to scare her into silence. \"He clearly didn't know my mam though. Because even at nine years old I could have told him he was wasting his time. \"She stood her ground. He went to prison.\" And the lesson she learned? \"From my mam I learned about strength,\" she said. \"Not the kind that preys on the weak. \"No, I learned the kind that stands up to adversity. The strength to do what's right, even if it would be easier to crumble. \"That street of ours had challenges, yes, of course. But there was kindness. There was compassion. So much of it. \"There was our neighbour who knew that we were struggling one winter, posted an envelope through the letterbox, marked 'for Bridget's coat'. \"And I never forget that kindness. \"There were my grandparents, too, who moved here from Ireland. A happy presence in my childhood. \"It's from my grandad that I get my love of reading and learning. From the days when he would bounce me on his knee - book in hand.\" Read more: Who is standing to replace Rayner as deputy Labour leader?  She could have gone on to say that that love of reading took her from her Catholic high school to Oxford University, where she graduated in history and modern languages. Her grandfather, she said, fought on the front line in the Second World War, then was in the vanguard of new nurses helping to build the new National Health Service, under the Attlee government. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 \"And so, congress, when people ask me where my values come from, I point to my mam, to my grandparents, to my neighbours, to my community,\" she said. Lots of politicians claim working class origins, poverty and hardship. And no doubt some of them embellish their humble back story for political advantage. But Bridget Phillipson is the genuine working class article. And her story - like Sir Keir's Rodney the toolmaker - is one we'll no doubt hear a lot more during this deputy leader election campaign."
    },
    {
        "title": "Kemi Badenoch reveals her conditions for helping Sir Keir Starmer with 'out of control' welfare spending",
        "description": "Kemi Badenoch has offered to help the government pass legislation to slash the welfare bill - but with conditions attached.",
        "url": "https://news.sky.com/story/kemi-badenoch-reveals-her-conditions-for-helping-sir-keir-starmer-with-out-of-control-welfare-spending-13427687",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-kemi-badenoch-conservative_7015086.jpg?20250909132657",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-09 14:52:00",
        "Headline": "Labour brand the Tory leader \"delusional\" after she said her party would \"always act in the national interest\".",
        "Content": " Kemi Badenoch has offered to help the government pass legislation to slash the welfare bill - but with conditions attached. In a speech on Tuesday morning, the Conservative Party leader accused the government of having \"totally lost control of spending\" and \"leading Britain into a deeper and deeper crisis\". She argued that the only way to fix the issue was to dramatically reduce the welfare budget - and set out to Sky News political correspondent Tamara Cohen her conditions for supporting the government. Politics latest: Six MPs enter deputy Labour leader race  Speaking at the Institute of Chartered Accountants, Ms Badenoch said: \"We are the only party arguing that government has to live within its means. \"Every single other political party in parliament today, every single other one, wants to increase welfare spending and they voted to do so. \n                  Boris Johnson ally Nadine Dorries latest Tory to defect to Reform UK\n                 \n                  Everything you need to know about being a political party member\n                 \n                  Former Conservative MP David Warburton accused of sexual misconduct and cocaine use, dies 'unexpectedly' at 59\n                 \"They wanted to lift the so-called two child benefit cap. They don't mind that our sickness benefits bill alone is on course to reach £100bn by 2030.\" The Tory leader said the chancellor will have no option but to raise taxes at the budget in the autumn to fund Labour's spending plans, and also pay the interest on the vast government debt.  But she claimed that \"some in government must know that things need to change\", saying: \"You can picture their grim faces, looking at the latest OBR [Office for Budget Responsibility forecast] figures. \"But the truth is they came into government with no real plans for how to save money - only how to spend it. That's why they are in trouble.\" To that end, she said she is \"making the prime minister a serious offer\" because \"the Conservative Party will always act in the national interest\". 👉Listen to Politics At Sam And Anne's on your podcast app👈  She noted that Sir Keir Starmer had tried to cut welfare spending by targeting benefits paid to disabled people, but had to \"gut\" the legislation just before the vote and was \"humiliated by his own backbenches\". But she continued: \"If he is serious about cutting spending, and really bringing down the welfare bill, we will help him.\" And pointing to Angela Rayner's resignation, and the ensuing contest for a new deputy Labour leader, Ms Badneoch said: \"Whether he wants to admit it or not, Keir Starmer needs our help.\" 'We need to find common ground' Speaking to Sky News after her speech, the Tory leader said she will only support new government legislation on welfare as long as it brings the total spending down. \"Right now, what I'm offering is for us to sit down together and find common ground,\" she told Cohen. \"We know that this is difficult, but Conservatives have done this before. We had to find welfare savings and reform welfare in the coalition, [majority] government and after, and we can do it again.\" She insisted the Tories reduced the welfare bill before the pandemic, when it started going up again. She said: \"We fixed the previous problem. There is now a new problem and what we're saying is let's work together to fix it.\" \"If we don't live within our means, we will go bankrupt and our children will have to pay off the debt,\" she added. 'Stop all these distractions' Ms Badenoch was also challenged on her claim that she was offered a scholarship place at the Stanford Medical School in California, which The Guardian reports has been denied by the admissions staff who were there at the time. She told Cohen: \"They've been told something that I didn't say. I didn't say I was offered a place - I said I was offered a scholarship, a part scholarship. I hadn't applied for it. \"But I stand by every single thing that I said. It's something American universities do. They send out speculative offers.\" She called on people to \"stop all these distractions about who said what, and who's up and who is down\", and focus on Angela Rayner's property taxes, and the economy. \"I tell the truth. I stand by what I said. But right now, the truth is our economy is going in the wrong direction - it's in free fall, and we have got to fix this.\" A Labour Party spokesperson rejected Ms Badenoch's offer of help. \"It's delusional of Kemi Badenoch to think anyone would want to take economic advice from her Conservative Party,\" they said. \"Their economy-crashing, growth-killing, irresponsible approach to governing left mortgages spiralling and working people worse off. \"The only thing in Britain that needs a bailout is the Conservative Party from its leadership. The Tories haven't listened, they haven't learned, and they can't be trusted. \"Labour is clear that people who can work should work. This Labour government is getting people back into the workplace and out of the doom loop of joblessness that spiralled out of control under the Conservatives.\""
    },
    {
        "title": "Full line-up revealed for Sky News' The Immigration Debate",
        "description": "The full line-up for Sky News' The Immigration Debate hosted by Trevor Phillips has been announced.",
        "url": "https://news.sky.com/story/full-line-up-revealed-for-sky-news-the-immigration-debate-13427718",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-mike-tapp-zia-yusuf_7015344.png?20250909153810",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-09 15:29:00",
        "Headline": "The Immigration Debate, hosted by Sky News' Trevor Phillips in front of a live audience, will take place in Birmingham at 7pm on Wednesday 10 September.",
        "Content": " The full line-up for Sky News' The Immigration Debate hosted by Trevor Phillips has been announced. Home Office minister Mike Tapp, Reform UK's Zia Yusuf, shadow justice minister Kieran Mullan and Liberal Democrat MP Lisa Smart will take part in the event at 7pm on Wednesday 10 September. Each participant will set out their party's position in individual interviews with Trevor, before answering questions from a live audience to ensure perspectives from all sides of the debate are addressed. Then, from 8pm until 9pm, the special programme will continue, presented by Sarah-Jane Mee, with reaction from deputy political editor Sam Coates, economics and data editor Ed Conway and social affairs correspondent Becky Johnson. Zack Polanski, the new leader of the Green Party, will also be interviewed. Politics latest: Follow live updates If you would like to be part of this studio audience and have the opportunity to ask a question to one of the party representatives, please click here. Wednesday's debate is taking place after a summer of unrest over the issue of asylum hotels has provided Prime Minister Sir Keir Starmer with one of the toughest tests of his leadership so far. There has also been a record number of migrants crossing the Channel in small boats - with 29,003 having made the journey by 30 August, the most ever for this point in a year. Meanwhile, Reform UK leader Nigel Farage has promised to deport up to 600,000 asylum seekers if he wins the next election in 2029 - a plan opponents have criticised as unworkable. The developments mean immigration was the first thing on the government's agenda as it kicked off the first week back from recess on Monday. Sky News' immigration debate will give you the chance to make your voice heard and listen to both sides about an issue which is dividing communities."
    },
    {
        "title": "Alleged notes from Trump and Mandelson among messages in Epstein 'birthday book'",
        "description": "Files from a \"birthday book\" compiled for the sex trafficker Jeffrey Epstein appear to include a glowing contribution from the current UK ambassador to Washington, Peter Mandelson.",
        "url": "https://news.sky.com/story/notes-from-trump-and-mandelson-among-alleged-messages-in-epstein-birthday-book-13427386",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump-mandelson-epstein_7014793.jpg?20250909043921",
        "type": "Politics",
        "Author": "James Matthews",
        "Date Published": "2025-09-09 02:41:00",
        "Headline": "The newly-released files were handed over following a demand by the Oversight Committee of the US Congress, and appear to contain notes to the billionaire paedophile from Donald Trump and Peter Mandelson.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  Files from a \"birthday book\" compiled for the sex trafficker Jeffrey Epstein appear to include a glowing contribution from the current UK ambassador to Washington, Peter Mandelson. Documents appear to show Lord Mandelson calling Epstein his \"best pal\" and writing of the friend \"taking you by surprise… in one of his glorious homes he likes to share with his friends (yum yum)\". The pages are contained in files from the estate of the deceased billionaire paedophile, handed over to a Congressional committee. The collection of birthday tributes include a hand-drawing of a woman's body, signed \"Donald\". They also contain a picture of Epstein holding an outsized cheque, signed by \"DJTRUMP\". Trump latest: Follow live updates Beneath the image is a handwritten message that reads: \"Jeffrey showing early talents with money + women! Sells 'fully depreciated (redacted) to Donald Trump for $22,500.\" The US president has denied any impropriety involving Epstein, whom he once counted as a friend. Addressing the release of the image in a post on X, White House press secretary Karoline Leavitt said: \"As I have said all along, it's very clear President Trump did not draw this picture, and he did not sign it. \"President Trump's legal team will continue to aggressively pursue litigation.\" Mr Trump has already filed one lawsuit over the birthday note. He began proceedings against the Wall Street Journal, two of its reporters and its owner, Rupert Murdoch, after the publication first reported on the message's existence in July. The newly-released files were handed over following a demand by the Oversight Committee of the US Congress. They are from a book compiled by Epstein's co-conspirator, Ghislaine Maxwell, to celebrate Epstein's 50th birthday in 2003. Mandelson's message to 'best pal' A number of pages include pictures of Lord Mandelson, a former Labour minister, and a message that reads: \"Once upon a time, an intelligent, sharp-witted man they call \"mysterious\" parachuted into my life. \"You would spend many hours just waiting for him to turn up. \"And often, no sooner were you getting used to having him around, you would suddenly be alone…. again. \"Leaving you with some \"interesting\" friends to entertain instead…. \"Or just some dogs to keep you company (he wasn't always so keen on them) \"But then he would parachute back in… \"Very occasionally, taking you by surprise in some far off places \"Or in one of his glorious homes he likes to share with his friends (yum yum) \"But, wherever he is in the world, he remains my best pal! \"Happy birthday, Jeffrey we love you!!\" Pictures of Lord Mandelson appear on the pages, which include an image of a tropical island. Previously, a 2019 report by JP Morgan bank suggested Lord Mandelson had stayed at Epstein's New York flat in 2009, while the disgraced financier was in jail. Epstein was serving an 18-month sentence after pleading guilty to procuring a person under the age of 18 for prostitution. 👉 Follow Trump100 on your podcast app 👈 At the time, Lord Mandelson was the business secretary in the UK government, under then prime minister Gordon Brown. Sky News contacted the British embassy in Washington for comment, and was referred to earlier statements from Mandelson, including an interview with Sky News in May this year.  Asked then about the New York story, he said: \"I'm not answering any questions about him. My knowledge of him is something I regret, I wish I'd never met him in the first place.\" Asked why he had an association with Epstein while he was in jail, Lord Mandelson replied: \"Why did many people meet him? He was a prolific networker and I wish I'd never met him in the first place.\" All you need to know about the Trump-Epstein saga Health Secretary Wes Streeting addressed the US ambassador's appearance in the newly-released files during a Sky News interview on Tuesday morning. When asked if it is a problem that Lord Mandelson has continued to be linked to Epstein, Mr Streeting replied: \"I think our ambassador has made it clear that he deeply regrets ever having been introduced to Epstein.\" \"I don't think we should regard everyone as guilty by association,\" he added. \"I think the important thing is that Epstein's victims receive the justice now and the platform now to tell their stories.\" US correspondent Finally, we see the look of the evidence - and it doesn't look great for Donald Trump. A lewd birthday message Trump allegedly sent to convicted sex offender Jeffrey Epstein has been released by Democrats. The alleged note had always been in doubt, as long as the fabled birthday book remained unpublished. There's more certainty now. Trump had repeatedly denied all association, saying: \"I never wrote a picture in my life. I don't draw pictures of women.\" It will amplify questions surrounding his friendship with Epstein and suggestions of improper behaviour. The US president denies any wrongdoing.\n\n Read the full analysis here US vice president JD Vance defended Mr Trump on X and called out Democrats for \"not caring about Epstein's victims\". He wrote: \"The Democrats don't care about Epstein. They don't even care about his victims. \"That's why they were silent about it for years. The only thing they care about is concocting another fake scandal like Russiagate to smear President Trump with lies. \"No one is falling for this BS.\""
    },
    {
        "title": "Jaguar Land Rover getting 'daily' support as workers told to stay at home",
        "description": "Jaguar Land Rover is getting \"daily\" support from the government after last week's cyber attack, which has ground its operations to a halt.",
        "url": "https://news.sky.com/story/jaguar-land-rover-getting-daily-support-as-workers-told-to-stay-at-home-13427714",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jaguar-land-rover_7009369.jpg?20250902155229",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-09 15:26:00",
        "Headline": "Sky News understands JLR workers are not due back at work on Wednesday with production suspended for another day.",
        "Content": "Jaguar Land Rover is getting \"daily\" support from the government after last week's cyber attack, which has ground its operations to a halt. The British car maker shut down operations when it spotted the attack last Tuesday, and its staff have been told to stay at home since. Sky News understands JLR workers are not due back at work on Wednesday, with production suspended for another day.   When asked for a timeline on when operations would resume for all of the company's 34,000 UK workers, business minister Sir Chris Bryant said: \"I wish that I could provide one, but I cannot. \"This is a very live situation that has been ongoing for a week.\" He also said he could not share details on who was behind the attack, despite hacking group Scattered Spider claiming responsibility. Scattered Spider was blamed for the attacks on British retailers earlier this year, which are thought to have cost M&S around £300m. Four people were arrested for their suspected involvement in the April attacks and have been bailed. Asked whether the incident was linked to the M&S attack earlier this year, Mr Bryant said he could not say as he \"didn't know\". \"I do not think anybody has come to any secure decisions on that,\" he said. Read more:Murdoch family reach deal over future of empireMore than 20 civilians killed in 'brutal' Russian strike on Donetsk Jaguar Land Rover (JLR) has invited local MPs whose constituents are impacted by the shutdown to a Q&A session on Friday. \"The JLR Halewood plant in my constituency is an important and valued employer,\" said Labour MP Derek Twigg, who asked an urgent question about the government's response to the attack in the Commons on Tuesday. \"Many of my constituents are employees, which is also the case for my neighbouring Merseyside MPs. Thousands of jobs in the supply chain have been affected.\" JLR employs 39,000 people around the world, with many more working in its supply chains. Mr Twigg warned: \"There could be an ongoing and even more serious effect on our economy.\" In his response, Sir Chris said: \"We simply cannot afford any degree of complacency in this. \"There are major criminals operating in this space, as well as some malicious state actors, and some 40% of companies in the UK last year reported that they had faced some kind of cyber attack. \"So it is a very important issue that we take seriously.\" JLR said it continues \"to work around the clock\" to restart work in a \"controlled and safe manner\". \"We are very sorry for the disruption this incident has caused. Our retail partners remain open and we will continue to provide further updates.\""
    },
    {
        "title": "Green Party leader Polanski calls for Israeli president's arrest during UK visit over 'ongoing genocide'",
        "description": "New Green Party leader Zack Polanski has called for the arrest of Israel's president during his UK visit this week.",
        "url": "https://news.sky.com/story/israel-not-committing-genocide-in-gaza-but-casualties-and-destruction-are-utterly-appalling-says-uk-government-13427380",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-isaac-herzog-zack-polanski_7015359.jpg?20250909155716",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-09 00:21:00",
        "Headline": "Israel has strongly denied that its actions in Gaza amount to genocide, but is being challenged on the issue in a case at the International Court of Justice in The Hague.",
        "Content": "New Green Party leader Zack Polanski has called for the arrest of Israel's president during his UK visit this week. The self-branded \"eco-populist\" accused Isaac Herzog, who will meet Sir Keir Starmer on Wednesday, of being part of the \"Israeli government engaged in an ongoing genocide\". Mr Polanski, who is Jewish, said: \"Welcoming a potential war criminal to the UK is another demonstration of how this Labour government is implicated in the ongoing genocide in Gaza. \"It also serves as a brutal insult to those mourning the thousands of innocent lives lost and to hundreds of thousands of Palestinians facing ongoing violence and hunger.\" The Greens leader, who won the election last Tuesday, said refusing to detain President Herzog \"can be seen as a contravention of the Geneva Convention\". More than 60 parliamentarians signed a letter to Sir Keir and new Foreign Secretary Yvette Cooper asking what legal advice the government has received about Mr Herzog's visit and whether his entry to the UK \"is compatible with our obligations under the Genocide Convention\". They asked if Mr Herzog's visa application will be rejected or if he will be subject to police investigation if he does arrive. The MPs said the International Court of Justice determined in January last year Israel faces a \"plausible risk of genocide\" and the court cited statements by Mr Herzog, including him saying there are \"no innocent civilians in Gaza\" and \"it is an entire nation that is responsible\". Confusion over UK position on genocide Ahead of Mr Herzog's visit, there was confusion over whether the UK government had concluded if Israel is committing genocide or not. A letter from new Deputy Prime Minister David Lammy said the government has concluded Israel is not committing genocide in Gaza but \"must do much more\" to prevent and alleviate the suffering. Written last week, when he was foreign secretary, but published on Tuesday, Mr Lammy wrote that \"the crime of genocide occurs only where there is specific 'intent to destroy, in whole or in part, a national, ethnic, racial or religious group.' \"The government has not concluded that Israel is acting with that intent.\" However, minister Wes Streeting caused confusion over the government's position when he said on Tuesday Mr Herzog should answer charges of \"genocide\" when he visits the UK on Wednesday. Questioned about what exactly the government's position is, the prime minister's spokesman said Mr Lammy's letter was \"written in the context of export licenses\" for arms to Israel. \"We've always said that it's for the international court to make these determinations, and that has not been made,\" he said. He said the letter \"reflects the UK's position that we've not come to any conclusion as to whether genocide has or has not been committed in Gaza, that's been our longstanding position\". And he said Sir Keir will raise the \"intolerable situation in Gaza with the president of Israel when he meets him\". However, Labour MP and chair of the international development committee Sarah Champion, who Mr Lammy's letter was addressed to, asked whether Mr Lammy's words meant the government's position on genocide in Israel was shifting. She also asked whether the government is \"still of the view this is a matter for a 'competent court' such as the International Court of Justice, or is it ready to make its own assessment of whether this is a serious risk of genocide\". \"I urge the new foreign secretary to set the record straight as soon as possible,\" she told Sky News. Previously, the government's position had been that it was for an international court to decide if Israel was committing genocide. Israel has strongly denied that its actions in Gaza amount to genocide, but is being challenged on the issue in a case at the International Court of Justice in The Hague. The world's leading association of genocide scholars, as well as several Israeli human rights organisations, have already accused the country of genocide. Mr Lammy, who was replaced by Yvette Cooper as foreign secretary during Sir Keir Starmer's recent reshuffle, also criticised the \"catastrophic humanitarian situation\" in the region. Lammy: Destruction is 'utterly appalling' \"The high civilian casualties, including women and children, and the extensive destruction in Gaza, are utterly appalling,\" he wrote. \"Israel must do much more to prevent and alleviate the suffering that this conflict is causing.\" Israel struck and destroyed another high-rise building in Gaza City on Monday after warning residents to evacuate. The military said it was targeting Hamas observation posts and bombs placed around the 12-story office building, though has not provided evidence for this claim. Israeli Prime Minister Benjamin Netanyahu has told residents they should leave the city immediately. On Monday, a flotilla aiming to transport humanitarian aid to Gaza claimed one of its boats was struck by a drone on Tuesday in Tunisian waters, suffering fire damage. None of the passengers or crew on the Portuguese-flagged vessel were hurt, the Global Sumud Flotilla (GSF) said in a statement. But a spokesperson for Tunisia's National Guard rejected GSF's reports of a drone strike and told Mosaique FM radio that an initial inspection indicated the explosion originated inside the vessel. Israel has imposed a naval blockade on the coastal enclave since Hamas took control of Gaza in 2007, saying it aims to stop weapons from reaching the militant group. Israeli weapons ban 'antisemitic' Meanwhile, Spain has banned ships and aircraft carrying weapons to Israel from calling at Spanish ports or entering its airspace, because of Israel's military offensive in Gaza. The measures were described as antisemitic by Israeli foreign minister, Gideon Saar. Prime Minister Pedro Sanchez's government also said it would not allow anyone who has participated directly in \"genocide\" in Gaza to enter Spain. Read more from Sky News:Jerusalem shooting will exacerbate tensionsHouthi drone attack on Israel airportLush shuts 'in solidarity with Gaza' Deadly bus stop shooting Israel suffered its deadliest shooting since October 2024 on Monday, when gunmen opened fire at a bus stop in Jerusalem, killing six people and wounding another 12. An Israeli soldier and civilians who were at the scene shot and killed the two attackers, said police, who later arrested a third person. Israel's Shin Bet internal security agency said the two attackers, aged 20 and 21, were Palestinians from the West Bank with no prior arrests. The militant group Hamas did not say it was behind the attack but called it a \"natural response to the occupation's crimes against our people\". Starmer holds talks with Abbas President Mahmoud Abbas, head of the Palestinian Authority (PA), condemned \"any targeting of Palestinian and Israeli civilians\" and \"denounced all forms of violence and terrorism, regardless of their source,\" according to a statement from his office. Mr Abbas visited Downing Street on Monday evening for discussions with Sir Keir Starmer. Following the talks, the prime minister's spokesperson said they spoke about \"the intolerable situation in Gaza\" and how to secure \"enduring peace and stability for both Palestinians and Israelis\". \"The president welcomed the prime minister's pledge to recognising (sic) a Palestinian state ahead of the UN General Assembly meeting later this month, unless Israel changes its course,\" the statement added. Sky News has contacted the Israeli government for a comment regarding Mr Polanski's call."
    },
    {
        "title": "Who is standing to replace Angela Rayner as deputy Labour leader?",
        "description": "The race to replace Angela Rayner as deputy Labour leader has started.",
        "url": "https://news.sky.com/story/who-is-standing-to-replace-angela-rayner-as-deputy-labour-leader-13427533",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-deputy-labour-leader_7015313.jpg?20250909151031",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-09-09 10:06:00",
        "Headline": "MPs have to nominate their choice by the end of play on Thursday, ahead of members voting later in the month.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The race to replace Angela Rayner as deputy Labour leader has started. She resigned on 5 September from government and from her party post after she was found to have breached the ministerial code for not paying enough stamp duty on a second home she purchased in Hove, East Sussex, earlier this year. Politics latest: Two big Labour names enter the race Ms Rayner had been deputy leader of the Labour Party since 2020, when Sir Keir Starmer was voted in as leader. There is now a battle to replace her, with nominations by MPs due by 5pm on 11 September and a result on 25 October. A total of 80 MPs need to back a candidate for them to be nominated, before Constituency Labour Party members nominate, then members vote from 8-23 October. Who has thrown their hat in the ring? The Clapham and Brixton Hill MP will be popular with those on the left of the party - however, the Socialist Campaign Group of MPs are only about 30-40 strong. Several left-wing Labour MPs, including Nadia Whittome, Richard Burgon and Andy McDonald, were quick to publicly back her after she was the first out of the blocks to announce her intention to stand. Known for standing her ground, she said she was standing because she believes the government \"urgently needs to go back to the guiding values of our party and movement, and deliver an ambitious programme of popular, progressive policies\".  The MP accused Sir Keir's government of being a \"pale imitation of Reform\" and of \"blindly following Treasury orthodoxy\" instead of tackling poverty and inequality \"through wealth taxes and scrapping the two child benefit cap\". She also called the proscription of Palestine Action as a terror group \"absurd and authoritarian\" and said the seven Labour MPs ousted from the party \"for voting with their consciences\" should be allowed back in. Her heavy criticism of the current government may not win her enough support to be nominated, but she could still gain backing from those who believe Labour has departed from its founding principles. A Starmer loyalist and cabinet member, who managed to maintain her position during the reshuffle, Ms Phillipson announced her intention to stand shortly after nominations opened. She described herself as \"a proud working-class woman from the north east\" who had gone from \"a single parent family on a tough council street\" to the cabinet table. The education secretary has won support from across the Labour Party for removing tax relief on private schools, expanding free school meals and funded childcare. She added: \"Make no mistake: we are in a fight. We all know the dangers Reform poses to our country. \"But not only am I ready for it: I've proven we can do it. I've shown we can beat Farage in the north east, while staying true to the Labour Party's values of equality, fairness and social justice.\" As a cabinet minister, those on the left may be suspicious of her closeness to Sir Keir, but she will be seen by backbench MPs as Downing Street's de facto candidate. Her roots as a working-class northerner will tick the boxes for many MPs. The chair of the influential foreign affairs committee, Dame Emily did not make it into Sir Keir's initial (or current) cabinet despite serving as shadow attorney general. In a dig at Ms Rayner, she has promised to speak out and \"not just nod along\" with the party leadership. Her top issues, she said, would be Gaza and welfare, and also a wealth tax and expected cuts to special educational needs (SEND) - all subjects that could gain her support from the left. Dame Emily said she would be a \"voice for the membership, unions, PLP (Parliamentary Labour Party) and our constituents - not just nod along\". As a former barrister in a neighbouring north London constituency to Sir Keir's, she may be seen as too similar to the prime minister. Many members have also called for a deputy from the north of England - something she cannot claim to be. The former leader of the Commons, who was sacked by Sir Keir Starmer during his major cabinet reshuffle, said she had received \"much encouragement\" to stand. Announcing her intention to stand, Ms Powell said living in Manchester \"has rooted my politics in an understanding of people's everyday hopes and fears\". She also promised to \"bring together all parts of the party\" and \"unite our team\". In 2010, Ms Powell managed Ed Miliband's successful leadership campaign. The Manchester Central MP acknowledged the \"huge challenges\" the Labour Party faces - and promised to help face them with \"bold policies, rooted in progressive Labour values.\" The MP for Liverpool Wavertree since 2019, Paula Barker revealed she was standing on Tuesday afternoon, saying her \"numbers are looking healthy\". \"I have been really humbled by the amount of colleagues who are contacting me and showing me their support and I will be working with them going forward,\" she told BBC Radio 4. She is a former local government officer in the north west and took over from Ms Rayner as the Unison trade union's north west regional convenor. A former shadow minister for devolution and English regions, Ms Barker is very active on parliamentary committees and is currently a member of the standards committee and the privileges committee. Ms Barker was previously a member of the Socialist Campaign Group of Labour MPs but left before the general election last year, so it remains to be seen whether those on the left will support her. Recently made local government and English devolution minister, on Friday, the MP for Birkenhead was previously an employment minister. She is only the second member of the government to throw her hat in the ring, after Bridget Phillipson. An MP since 2010, she was Gordon Brown's former parliamentary private secretary and chairs Progressive Britain, a group founded to support Tony Blair, so is seen to be on the right of the Labour Party. She said the UK \"faces a huge threat from the dark forces of right-wing populism\" and that this can only be defeated by giving people \"real hope and pride in our diverse country\". Ms McGovern added: \"I believe I can shape our story, communicating our values in a way that resonates across the Labour family and with the public.\" She said \"too many people still left out of chances and choices in life\" and \"that has to change\"."
    },
    {
        "title": "Being a London MP could 'count against' Thornberry in deputy leadership race, says Baroness Harman",
        "description": "Being a London MP could \"count against\" Dame Emily Thornberry in the race to become Labour's deputy leader,&#160;ex-minister Harriet Harman has told Sky News.",
        "url": "https://news.sky.com/story/being-a-london-mp-could-count-against-thornberry-in-deputy-leadership-race-says-baroness-harman-13427502",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-emily-thornberry-labour_7015266.jpg?20250909142451",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-09 08:57:00",
        "Headline": "The chair of the Foreign Affairs Committee vowed to be \"a voice for the membership, unions, PLP, and our constituents  - not just nod along\" if she is elected deputy Labour leader on 25 October.",
        "Content": "Being a London MP could \"count against\" Dame Emily Thornberry in the race to become Labour's deputy leader, ex-minister Harriet Harman has told Sky News. Dame Emily, who has been the MP for Islington South and Finsbury since 2005, confirmed she will stand for the deputy leadership in a social media post on Tuesday. The chair of the Foreign Affairs Committee vowed to be \"a voice for the membership, unions, PLP, and our constituents - not just nod along\" if she is elected deputy Labour leader on 25 October. Politics latest: Fourth Labour MP enters race to be deputy leader But Baroness Harriet Harman told Beth Rigby's Electoral Dysfunction podcast that the location of Dame Emily's constituency could pose a problem for the would-be deputy. She said the fact Dame Emily represents a London borough could \"count against\" her. \"I think traditionally, if you look at who the party's chosen, they have chosen somebody from a different part of the country to the leader, in order to create reach,\" Baroness Harman said. Angela Rayner, who resigned from the deputy position last Friday, is the MP for Ashton-under-Lyne in Greater Manchester. Ruth Davidson, Electoral Dysfunction co-host and former Scottish Conservative leader, agreed that having a prime minister, deputy prime minister and deputy Labour leader \"that all live and represent within two miles of each other\" is \"not so great\" for Britons who live outside the capital. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 She said those outside London \"already think the city is overrepresented in government, transport and politics and media and, you know, EastEnders and everything else\". Another declared candidate for the Labour deputy leadership - left-wing member Bell Ribeiro-Addy - is also an inner London MP. Ms Ribeiro-Addy has the backing of the Socialist Campaign Group (SCG), which met in Westminster on Monday night to coalesce around one candidate following criticism of the contest's rules. Political reporter The Labour Party rule book sets out how candidates can get on the ballot to stand in the election for deputy party leader. Each nominee must be a sitting member of the Parliamentary Labour Party (a Labour MP), and must be supported by 20% of their fellow members, which currently equates to 80 Labour MPs. The deadline set by the party's governing body to gather the required nominations is 5pm on Thursday 11 September. After that, candidates must win the support of either: • 5% of Constituency Labour Parties (CLPs), which are local party groups; • At least three organisations affiliated to the party - at least two of which must be trade unions - that comprise 5% of the affiliated party membership. This process will start on Saturday 13 September, and close on Saturday 27 September. The successful candidates will then appear on the ballot for a vote of all party members and affiliated party supporters, which will open on Wednesday 8 October, and close on Thursday 23 October at 12pm. The winner will be announced on Saturday 25 October. Read more:Would-be Labour deputies woo the unions in BrightonRayner 'won't get involved' in race to choose successorLabour 'failing to deliver change that people voted for' Meanwhile, Bridget Phillipson, the education secretary, has become the first cabinet minister to announce their candidacy to succeed Ms Rayner. In a statement on Tuesday morning, the MP for Houghton and Sunderland South pledged to \"unite our great party and deliver for working people\", and take on \"the dangers Reform poses our country\". Lucy Powell, who served as leader of the House of Commons until she was sacked by Sir Keir Starmer on Friday, has also confirmed she will run for the position. She is the MP for Manchester Central."
    },
    {
        "title": "Mad science or a radical revolution - could refreezing the Arctic actually work?",
        "description": "Plans to save ice in the polar regions and \"repair\" the climate using technology are a \"flawed\" distraction from the urgent need to reduce greenhouse gases, according to a new scientific assessment.",
        "url": "https://news.sky.com/story/mad-science-or-a-radical-revolution-could-refreezing-the-arctic-actually-work-13427472",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-arctic-sea-ice_7015013.jpg?20250909102546",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-09-09 08:09:00",
        "Headline": " A new report has reopened the controversy over so-called geoengineering. ",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Plans to save ice in the polar regions and \"repair\" the climate using technology are a \"flawed\" distraction from the urgent need to reduce greenhouse gases, according to a new scientific assessment. The review of proposals to reflect sunlight or use barriers to keep warm sea water at bay concludes they are too expensive, hard to scale up and may do more harm than good. But the report has reopened the controversy over so-called geoengineering. The Arctic is warming at least three times faster than the rest of the planet, raising sea levels and increasing the risks of extreme weather in Europe. And other scientists say every effort is needed to prevent climate breakdown in the fragile polar regions. But Professor Martin Siegert, a glaciologist at the University of Exeter, who led the new assessment, told Sky News that using technology to fix the problem was a \"false promise\". \"It's an appealing proposition,\" he said. \"But it doesn't stack up at all. \"It's quite dangerous actually because some people might rely on it as a way to cure the planet, but we just don't think it's viable.\" The review, published in the journal Frontiers in Science, looked at well-publicised proposals to reduce the impact of climate change on polar regions. They include techniques to spray particles into the upper atmosphere to reflect sunlight, use barriers anchored to the seabed to keep warm water away from floating ice shelves or add nutrients to polar oceans to encourage growth of microscopic creatures that suck up carbon from the atmosphere. But the assessment concludes the techniques are unproven and may have unpredictable effects on the atmosphere and environment. Professor Siegert told Sky News: \"Disproportionately high amounts of attention has been given to some of these projects. \"The thing we can do to save the polar regions, the thing we could do to call the planet is to cut emissions of greenhouse gasses to net zero within the next 30 or so years and that will help our polar regions and that will certainly help the planet.\" But British scientists due to carry out one of the first trials of geoengineering in the Arctic this winter say no idea can be off the table. The team, from the University of Cambridge, will use pumps to flood the surface of floating ice with freezing seawater, with the hope that it will become thicker and more resilient to melting over the summer. They believe it could preserve the reflective white blanket over the Arctic Ocean and help cool the planet. Shaun Fitzgerald, director of the University's Centre for Climate Repair, said the technology needs to be tested. \"If we leave it 20 years and climate change continues in the way that we see it right now, with the disasters unfolding, and we haven't done our homework, in other words, thinking about what the potential options are, then we're going to be in a terrible place,\" he told Sky News. \"We owe it to future generations, to equip them with more knowledge about this. \"It may well be an option that they would like to consider because we haven't made the progress with emissions reduction.\" More from Sky News:Zuckerberg sues Meta - but it's not what you think Huge shortfall in NHS funding for weight-loss jab The trial is being funded by the government's Advanced Research and Invention Agency (ARIA), which backs ideas on the very edge of what's possible. Four pumps will be installed over a square kilometre of sea ice and the impact tracked over several months. But the vision is for as many as a million pumps covering 10% of Arctic sea ice to reflect enough sunlight to make a difference to climate change. \"There are no small numbers when it comes to tackling climate change,\" said Dr Fitzgerald. \"It's probably within the realm of engineering do-ability, something that is viable.\""
    },
    {
        "title": "Jaguar Land Rover getting 'daily' support as workers told to stay at home",
        "description": "Jaguar Land Rover is getting \"daily\" support from the government after last week's cyber attack, which has ground its operations to a halt.",
        "url": "https://news.sky.com/story/jaguar-land-rover-getting-daily-support-as-workers-told-to-stay-at-home-13427714",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jaguar-land-rover_7009369.jpg?20250902155229",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-09 15:26:00",
        "Headline": "Sky News understands JLR workers are not due back at work on Wednesday with production suspended for another day.",
        "Content": "Jaguar Land Rover is getting \"daily\" support from the government after last week's cyber attack, which has ground its operations to a halt. The British car maker shut down operations when it spotted the attack last Tuesday, and its staff have been told to stay at home since. Sky News understands JLR workers are not due back at work on Wednesday, with production suspended for another day.   When asked for a timeline on when operations would resume for all of the company's 34,000 UK workers, business minister Sir Chris Bryant said: \"I wish that I could provide one, but I cannot. \"This is a very live situation that has been ongoing for a week.\" He also said he could not share details on who was behind the attack, despite hacking group Scattered Spider claiming responsibility. Scattered Spider was blamed for the attacks on British retailers earlier this year, which are thought to have cost M&S around £300m. Four people were arrested for their suspected involvement in the April attacks and have been bailed. Asked whether the incident was linked to the M&S attack earlier this year, Mr Bryant said he could not say as he \"didn't know\". \"I do not think anybody has come to any secure decisions on that,\" he said. Read more:Murdoch family reach deal over future of empireMore than 20 civilians killed in 'brutal' Russian strike on Donetsk Jaguar Land Rover (JLR) has invited local MPs whose constituents are impacted by the shutdown to a Q&A session on Friday. \"The JLR Halewood plant in my constituency is an important and valued employer,\" said Labour MP Derek Twigg, who asked an urgent question about the government's response to the attack in the Commons on Tuesday. \"Many of my constituents are employees, which is also the case for my neighbouring Merseyside MPs. Thousands of jobs in the supply chain have been affected.\" JLR employs 39,000 people around the world, with many more working in its supply chains. Mr Twigg warned: \"There could be an ongoing and even more serious effect on our economy.\" In his response, Sir Chris said: \"We simply cannot afford any degree of complacency in this. \"There are major criminals operating in this space, as well as some malicious state actors, and some 40% of companies in the UK last year reported that they had faced some kind of cyber attack. \"So it is a very important issue that we take seriously.\" JLR said it continues \"to work around the clock\" to restart work in a \"controlled and safe manner\". \"We are very sorry for the disruption this incident has caused. Our retail partners remain open and we will continue to provide further updates.\""
    },
    {
        "title": "'We may see more things coming out': BBC chief quizzed by MPs about talent 'scandal'",
        "description": "BBC director-general Tim Davie has told MPs that \"we may see more things coming out\" after being asked for assurance there will not be another \"scandal of BBC talent abusing their position\".",
        "url": "https://news.sky.com/story/we-may-see-more-things-coming-out-bbc-chief-quizzed-by-mps-about-talent-scandal-13427495",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tim-davie-bbc_7015003.jpg?20250909101736",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-09-09 09:44:00",
        "Headline": "Earlier this year, BBC director-general Tim Davie admitted it had been a \"tough period\" for the beleaguered corporation, which MP's described as a \"bumpy summer\".",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  BBC director-general Tim Davie has told MPs that \"we may see more things coming out\" after being asked for assurance there will not be another \"scandal of BBC talent abusing their position\". He told the Culture, Media and Sport Committee: \"I think things have changed since we last talked to the committee, we are seeing people call it out, and that is a positive change, but it's ongoing work. \"I don't think you can change culture in six months and suddenly say nothing's going to occur. \"We may see more things coming out, because in some ways I'm asking for it, and being utterly transparent and running towards the problem, that's what we need to do.\" Mr Davie, who was joined by BBC chair Samir Shah on Tuesday, faced questions on subjects including the corporation's Gaza documentary, its Glastonbury coverage and the recent Gregg Wallace investigation, as well as this year's Strictly Come Dancing line-up. The BBC has faced a series of recent controversies, most prominently the sacking of MasterChef presenter Wallace after claims of inappropriate behaviour. Presenter John Torode was later axed from the show after an allegation that he used an \"extremely offensive racist term\". \n                  100 firefighters tackle blaze at former BBC television centre in London's White City\n                 \n                  Observer editor-in-chief James Harding says BBC should be 'put beyond reach of politicians'\n                 \n                  BBC and Channel 4 should 'merge' to survive, Sir Phil Redmond says\n                 On Monday, it was announced that restaurant critic Grace Dent and Irish chef Anna Haugh will be fronting the forthcoming series. 'No one is irreplaceable - absolutely no one' On the question of top talent being treated as irreplaceable, Mr Shah said: \"No one is irreplaceable. Absolutely no one, seriously, no one\". Mr Davie added: \"We're all dispensable. That's an absolute, unequivocal position being given to the whole BBC.\" He also stressed: \"We don't call them talent… Everyone is talent.\" When asked about the decision to air the latest series of MasterChef, with Wallace and Torode still at the helm, Mr Davie said it was \"a tough call,\" but insisted it was the right decision \"on balance\" because the \"vast majority\" of contestants wanted the programme to go out. Mr Davie added: \"I think the consequences for the individuals who presented have been very significant. They no longer work with the BBC.\" The corporation also found itself in hot water in July after it breached its editorial guidelines over a Gaza documentary that was narrated by the child of a Hamas official. Gaza: How To Survive A Warzone aired on the BBC in February but was pulled from iPlayer after it emerged that the child narrator was the son of Ayman Alyazouri, who has worked as Hamas's deputy minister of agriculture. Mr Davie called the broadcast of the documentary, which was made by independent production company Hoyo Films, \"a bad mistake\", and said the BBC had \"executed the recommendations\", adding, \"there are people who are facing consequences\". When asked about Israel refusing to allow journalists into Gaza, Mr Davie said it was \"unacceptable\", calling coverage of the Israel-Hamas war, \"the toughest coverage challenge we have ever faced\". BBC accused of 'disrespect' over Gaza: Doctors Under Attack A second documentary was also discussed, Gaza: Doctors Under Attack, which was commissioned by the BBC but subsequently shelved. It was eventually aired by Channel 4 in July. It was suggested the corporation had been \"overcautious\" in their decision not to air the film, an accusation Mr Davie denied. He said the BBC have a different set of guidelines from Channel 4. Labour MP for Ealing Central and Acton, Dr Rupa Huq, claimed the documentary was recently \"the most asked about thing\" at a recent BBC all-staff meeting, and called the corporation's treatment of the film: \"A disrespect for small, independent work done with integrity that you sit on it for months, give some spurious reason and another channel covers it.\" Bob Vylan's Glastonbury set: 'We're not broadcasting this guy' In June, the livestreaming of the controversial Bob Vylan set at Glastonbury, when the band led chants of \"death to the IDF (Israel Defence Forces)\", resulted in the BBC announcing it would stop broadcasting \"high risk\" performances live. When questioned about Vylan's controversial set, Mr Davie insisted, \"I don't think I misread [the situation]\". He said the Vylan performance was \"absolutely an antisemitic broadcast\", was \"deeply disturbing\", and admitted \"the BBC made a very significant mistake\". Describing the situation as it played out, Mr Davie said when he became aware of the issue at around 5pm on the afternoon of the live broadcast, his approach was \"very quick\". He said: \"My decision was to get that off on demand, simple as that, I mean, it wasn't too complicated in my mind. We're not broadcasting this guy. I think I did the right thing.\" Speaking to the decision of BBC staff to continue broadcasting the set despite the chants, Mr Davie said he had to be \"proportionate\" in his judgement following an ongoing investigation, but said there will be \"consequences for individuals that we're working through at the moment\". Arts and entertainment correspondent It's been quite a year to be the director general, with Tim Davie having to steer the corporation through a slew of dramas. With critics calling for him to quit, his performance in parliament mattered. In recent months, Davie has been christened with the somewhat dubious nickname of “Teflon Tim\" by one tabloid newspaper over how his leadership seems to be impervious to the storms of controversy. How did he fare facing a bombardment of questions over what went wrong? Well, while he largely appeared unflappable, at his most rattled he didn’t rule out that there might be more skeletons in the BBC’s closet. His point-blank refusal to put a figure on the number of “emerging issues” being investigated involving talent coming across as spikey to say the least.   And he certainly wasn’t willing to accept any errors with how he handled news of Bob Vylan’s death chants at Glastonbury. “I don’t think I misread it,” he stated matter of factly. While MP Rupa Huq clearly found Davie’s explanation infuriating that the BBC’s decision to pull its documentary on Gaza came down to “a perception of partiality”. It was an enlightening response she received to the question of whether he was worried about upsetting people by broadcasting it.   “If I was worried about upsetting people, I’d be in the wrong job,” he said. The question is whether this performance in parliament is enough to silence those critics who argue there’s simply been one to many scandals happen under his watch. At the same time as Mr Davie's grilling by MPs, Bob Vylan frontman Bobby Vylan shared news of six upcoming performance dates in November and December, with the message: \"After all the attempts to silence us, we're about to be louder than ever. We won't go quietly!\" In a separate message on X, he called Mr Davie, \"a spineless puppet\" and said: \"There was nothing antisemitic or criminal about anything I said at Glastonbury.\" A police investigation into the performance is currently underway. Avon and Somerset Police told Sky News: \"We recognise the strength of public feeling around what took place, and we hope the ongoing enquiries provide reassurance and show the seriousness with which we are treating this investigation.\" Davie on Strictly casting backlash: 'We've cut the list down too far' When asked about another editorial production call - the decision to cast ex-Apprentice contestant Tom Skinner on this year's Strictly Come Dancing - Mr Davie said it was \"not my decision\" and that he \"was not an expert on the individual per se\". Mr Davie said it was decided by \"the production team\", who \"thought [Skinner] would be interesting to the audience\". Skinner, who now has a large social media following, has previously shared posts saying it is \"not far right\" to be \"flying your flag and loving your country\", and complaining \"it ain't safe out there anymore\" in London. Mr Davie said: \"I think it's fine to cast an individual as long as they're within boundaries.\" When asked what those boundaries were, he said: \"If someone has broadcast things that are totally unacceptable [and] racist, you know, we don't want anywhere near our shows. That's obvious. That's what our [production] team have to judge.\" He added: \"I don't think it's right to say, 'We won't have anyone who's ever said anything that you either disagree with is slightly controversial on social media'. I don't think that works, frankly. I just think we've cut the list down too far nowadays.\" When asked about public scrutiny of the BBC over the summer, Mr Davie, who has been in the corporation's top job for five years, said: \"If I said I wasn't feeling the pressure, I would be inhuman.\""
    },
    {
        "title": "Rupert Murdoch's son Lachlan takes control of family media empire, including Fox News and Wall Street Journal",
        "description": "The Murdoch family have reached a deal which will see Rupert Murdoch's son Lachlan cement control of the family media empire that includes Fox News and The Wall Street Journal.",
        "url": "https://news.sky.com/story/rupert-murdochs-son-lachlan-takes-control-of-family-media-empire-including-fox-news-and-wall-street-journal-13427390",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rupert-murdoch-los-angeles_7014794.jpg?20250909043933",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-09 03:18:00",
        "Headline": "The battle for control of one of the highest-profile global media groups is thought to have been one of the inspirations for the TV show Succession.",
        "Content": " The Murdoch family have reached a deal which will see Rupert Murdoch's son Lachlan cement control of the family media empire that includes Fox News and The Wall Street Journal. The agreement ends a battle over who will control one of the highest-profile global media groups. The dispute is thought to have been one of the inspirations for the television series Succession, about the infighting of the members of a media dynasty. Under the deal, Rupert's children James Murdoch, Elisabeth Murdoch and Prudence MacLeod will sell their personal holdings in Fox and News Corp over a period of six months. In return, they are each expected to receive about $1.1bn (£810m) in proceeds, according to a source. Fox Corp said on Monday it had reached a mutual resolution, putting an end to all legal proceedings. A new family trust will be created to benefit Lachlan Murdoch, and his younger siblings Grace and Chloe Murdoch, who are Rupert's children from his marriage to Wendi Deng Murdoch. A battle over the global television and publishing empire had played out last year in a Nevada courtroom, where a judge considered the contentious matter of succession. Rupert, 94, attempted to change the terms of the family's trust, which was set up after his 1999 divorce from his second wife, Anna. The trust holds significant stakes in Fox News parent Fox and Wall Street Journal owner News Corp. Read more from Sky News:Alleged Epstein birthday note releasedTech giants to join Trump on state visitNews Corp takes stake in marketing firm Under the original trust, News Corp and Fox voting shares would have been transferred to Rupert's four oldest children - Prudence, Elisabeth, Lachlan, and James - upon his death. But Rupert had proposed an amendment to the trust after he feared that three of his heirs, James, Elisabeth and Prudence, could mount a coup to oust Lachlan, who is executive chairman of Fox and chairman of News Corp. A court rejected that plan in December, saying Rupert and Lachlan had acted in \"bad faith\" in seeking to amend the irrevocable trust. Mr Murdoch launched Sky, which includes Sky News, in 1989. In 2018, 21st Century Fox sold their 39% stake in the firm to Comcast."
    },
    {
        "title": "Online conspiracy theories rife after 16 election candidates die in Germany ",
        "description": "Officials in western Germany have sought to calm online speculation following the deaths of 16 candidates, including seven from a far-right party, in the run-up to a local election.",
        "url": "https://news.sky.com/story/online-conspiracy-theories-rife-after-16-election-candidates-die-in-germany-13427546",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-germany-election_7015072.jpg?20250909112049",
        "type": "Strange",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-09-09 10:14:00",
        "Headline": "Officials are seeking to calm speculation after the deaths of several candidates, including seven from the Alternative for Germany, which said it was \"saddened\" by the news.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n Officials in western Germany have sought to calm online speculation following the deaths of 16 candidates, including seven from a far-right party, in the run-up to a local election. Voters will go to the polls on 14 September in North Rhine-Westphalia, the country’s most populous state. However, online conspiracy theories have been running rife after the deaths of several candidates, including seven representing the far-right Alternative for Germany (AFD) party. AfD co-leader, Alice Weidel, highlighted the initial deaths on social media with a post on X saying “4 AfD candidates died.” However, Dr Martin Vincentz, a spokesperson for the North Rhine-Westphalia branch of the party, told Sky News the confirmed number had risen to seven. In a statement, he said the AfD was saddened by the news but that, according to the information they had received so far, there was “currently no indication of unnatural deaths\". Some of those running had known pre-existing conditions. In total, 16 candidates are believed to have died, with police already ruling out unnatural causes in four of the cases, according to the DPA news agency. The seven AfD nominees were standing for election in a variety of districts and with confirmed ages between 59 and 80. The far-right party is reported to be the only one that has had more than one candidate die.  In all districts where candidates have died, any completed postal ballots will need to be re-cast, local media said. Read more on Sky News:Israel 'not committing genocide'Trump and Mandelson in Epstein bookFrance's political crisis just got worse Ahead of the vote, a spokesman for the local election commission tried to dispel intense online speculation, telling the media that the number of deaths was \"not significantly higher\" than in previous campaigns.  Some 20,000 seats are up for grabs in the election in a state with a population of more than 18 million. Sky News contacted the police for comment."
    }
]