[
    {
        "title": "Father of boy, 2, who died from mould in flat hopes new law 'might be enough to protect others'",
        "description": "The father of a two-year-old boy who died from black mould in his social housing flat says he never wants anyone else to go through what they have  - as a new law brought in after his death comes into effect.",
        "url": "https://news.sky.com/story/father-of-boy-2-who-died-from-mould-in-flat-hopes-new-law-might-be-enough-to-protect-others-13458569",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-awaab-ishak-mould_7063450.jpg?20251026235017",
        "type": "Home",
        "Author": "Katie Barnfield",
        "Date Published": "2025-10-26 23:31:00",
        "Headline": "Awaab Ishak's death caused outrage and prompted the passage of Awaab's Law with a requirement for landlords to fix hazards in social housing more quickly and rehouse tenants if necessary.",
        "Content": "\n          North of England correspondent\n        The father of a two-year-old boy who died from black mould in his social housing flat says he never wants anyone else to go through what they have  - as a new law brought in after his death comes into effect. Awaab Ishak died in 2020 from a severe respiratory illness caused by prolonged exposure to the mould in his family's housing association flat in Rochdale, Greater Manchester. His throat, windpipe and other airways were swollen and congested. Fungus was found in his blood and lungs, with such severe inflammation that his official cause of death was given as \"environmental mould pollution\". His father, Faisal Ishak, had complained repeatedly to the housing provider, Rochdale Boroughwide Housing, about the mould in the three years leading up to his son's death - but nothing was done. The toddler's death caused outrage and prompted the passage of Awaab's Law with a requirement for landlords to fix reported hazards in social housing more speedily and rehouse tenants in safe accommodation if necessary. But as the rules come into force in England, a UK-wide survey found 23% of those who said they had issues such as damp, mould or condensation in their homes were social renters. Some 3,982 adults were surveyed by Censuswide earlier this month for the Health Equals campaign, which claims lives are being cut short across the UK, with damp, cold and mould in people's homes being part of the problem. \n                  David Lammy to face Commons grilling over wrongly released migrant sex offender\n                 \n                  Family of schoolgirl sexually assaulted by wrongly released migrant 'infuriated' by ordeal\n                 \n                  Timeline of how manhunt for wrongly released sex offender migrant Hadush Kebatu unfolded\n                 Speaking to Sky News, Mr Ishak said he was grateful there was now a new law protecting people going forward, and although it would \"never bring Awaab back... it might be enough to protect others\". Following Awaab's death, Rochdale Boroughwide Housing was eventually stripped of its funding, and its chief executive, Gareth Swarbrick, was sacked after it emerged that he earned £170,000 during the year of Awaab's death. Mr Ishak added: \"It was really hard for me. I lost my first child suddenly - it was really hard. \"We were very angry but couldn't do anything about it. We didn't get help. \"They have to learn from our case.\" The first phase of Awaab's Law takes effect today and will compel landlords to rectify all emergency hazards and hazardous damp and mould. For emergency hazards, an investigation and the work to fix the problem must take place within 24 hours of the landlord becoming aware of the issue. If they don't - tenants can take legal action. Read more on Sky News:Reform UK defends MP accused of 'racism'Potential mansion tax plan criticised Next year, the regulations will be extended to further issues like excess cold, fire and electrical hazards. Housing Secretary Steve Reed said: \"Everyone deserves a safe and decent home to live in and Awaab Ishak is a powerful reminder of how this can sadly be a matter of life or death. \"Awaab's family has fought hard for change and their work to protect millions of tenants' lives will live on as a legacy to their son. \"Our changes will give tenants a stronger voice and force landlords to act urgently when lives are at risk, ensuring such tragedies are never repeated.\" In 2027, the government plans to extend the law to cover all remaining health and safety hazards. There are also plans to eventually extend the rules to the private rented sector, although no date has been given for this as yet. While the government has committed to extending Awaab's Law, through the Renters' Rights Bill, which is currently awaiting royal assent, no firm timeframe has been given. The research by Health Equals also found people from the lowest-income households were almost twice as likely to live in homes with issues like damp or mould than the highest income households - 21% compared with 12%. 'It's getting worse' Some charities and campaign groups fear Awaab's Law will not go far - or fast - enough to offset this disparity. Kirby Hoyle of the Greater Manchester Tenants Union said: \"It's shocking - we've seen families coming forward whose children have been hospitalised with damp and mould. And this is even after Awaab's death \"I think it's getting worse\" Health Equals' chief campaigns officer Paul McDonald said while Awaab's Law was an \"important milestone\", its research also shows \"we need to go further\"."
    },
    {
        "title": "Key city in Sudan on brink of falling to paramilitary group",
        "description": "After 18 months of surviving forced starvation and shelling by the paramilitary group the Rapid Support Forces (RSF), the regional capital and symbolic battleground of Al Fashir is on the verge of full military collapse.",
        "url": "https://news.sky.com/story/key-city-in-sudan-on-brink-of-falling-to-paramilitary-group-13458383",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sudan-al-fashir_7063210.jpg?20251026191635",
        "type": "Home",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-10-26 18:36:00",
        "Headline": "The Rapid Support Forces (RSF) claims to have taken over the city of Al Fashir and completed its military control of Sudan's Darfur region.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  After 18 months of surviving forced starvation and shelling by the paramilitary group the Rapid Support Forces (RSF), the regional capital and symbolic battleground of Al Fashir is on the verge of full military collapse. On Sunday, the RSF advanced into the heart of the city and captured the 6th Infantry Division of the Sudanese Armed Forces (SAF) in central Al Fashir after three days of intensified ground battles. In propaganda videos shared on RSF social media channels, troops waved their assault rifles in the yard of the garrison and celebrated victory in front of a bullet-ridden wall marked with an emblem of the Sudanese military. They claim to have taken over the city and completed their military control of the Darfur region.  Sudanese army soldiers, civilian resistance fighters and first responders have denounced the RSF's declaration of full victory and say battles are ongoing to fend off the city's capture. A wedge of military-held territory remains on the western edge of Al Fashir where remaining civilians are squeezed in with troops fighting to push outwards and regain key sites lost to the RSF. \"I left because all the residents and forces have been intensely concentrated in Al-Daraja Owla neighbourhood. It was too much and people started fleeing,\" said aid worker and resident Adam al Rashid, who left Al Fashir on Saturday. \"The RSF was moving people out and attacking others. So many have been killed by gunfire and shelling from battles. It was clear this was coming. The RSF has been advancing on the 6th infantry division for three days.\" Around 5,000 people have fled Al Fashir since 23 October, according to initial assessments by the International Organisation for Migration (IOM). Videos shared on RSF channels show masses fleeing on foot - some filmed by an RSF surveillance drone scattered across a field and others left in long, sombre queues as RSF soldiers yelled at them from inside their trucks. Other videos show men of fighting age rounded up and kneeling on the ground as RSF troops yell at them, \"You are all army\". Sources tell Sky News that those fleeing are facing mass arrests and extra-judicial killings on their way out. There is currently a telecommunications blackout in Al Fashir. An ominous sign that has marked previous takeovers by the paramilitary group, including the city of Al Geneina where the United Nations (UN) accused the RSF of killing 10,000 to 15,000 people. Read more:'Massacre' in Sudan kills at least 53Sudanese militia leader convicted of war crimes \"I am very concerned about the life of my relatives, the journalists and the doctors inside the city of Al Fashir. All of us saw what happened in Al Geneina and we are scared that will happen in Al Fashir too,\" said Mohamed Zakarea, a journalist from Al Fashir who fled the city a year ago after five months of the RSF siege. \"The people are waiting for the Sudanese army - for the war planes and the air drops. If all of this doesn't happen, then I'm afraid to say that Al Fashir is falling.\""
    },
    {
        "title": "US warship arrives in Trinidad and Tobago - as Venezuela hits out at 'military provocation'",
        "description": "A US warship has docked in the capital of Trinidad and Tobago, as US President Donald Trump increases military pressure on Venezuela.",
        "url": "https://news.sky.com/story/us-warship-arrives-in-trinidad-and-tobago-as-venezuela-hits-out-at-military-provocation-13458445",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gravely-trinidad_7063251.jpg?20251026200142",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-26 19:46:00",
        "Headline": "Government officials in Trinidad and Tobago and from the US say the warship will remain in Trinidad until Thursday for training exercises. Meanwhile, Venezuela claims it captured a group of mercenaries who intended to carry out a false flag attack in the region.",
        "Content": "A US warship has docked in the capital of Trinidad and Tobago, as US President Donald Trump increases military pressure on Venezuela. The guided missile destroyer, USS Gravely, is in addition to the aircraft carrier USS Gerald R Ford, which is moving closer to Venezuela. President Trump has accused the country's president, Nicolas Maduro, of being the leader of an organised crime gang but has not offered any evidence. President Maduro has called the deployment of warships an attempt by the US government to \"invent a new eternal war\" against his country.  Government officials in Trinidad and Tobago and from the US said the warship will remain in Trinidad until Thursday for training exercises. Venezuela's government has since issued a statement condemning what it called a military provocation by Trinidad and Tobago and the US. The country claimed it captured a group of mercenaries \"with direct information of the American intelligence agency\" who intended to carry out a false flag attack in the region. The statement from vice president Delcy Rodriguez did not give any details or evidence of the alleged false flag attack.  Jenifer Neidhart de Ortiz, the US Embassy's charge d'affaires, said the exercises sought to \"address shared threats like transnational crime and build resilience through training, humanitarian missions, and security efforts\". A senior military official, speaking on condition of anonymity, said the move was only recently scheduled. Read more: Inside Pablo Escobar's home city where drugs are readily available The presence of the ship is controversial for some. \"This is a warship in Trinidad, which will be anchored here for several days just miles off Venezuela when there's a threat of war,\" said David Abdulah, leader of the Movement for Social Justice political party. \"That's an abomination.\" Read more:US accused of 'inventing a war'Survivors reported after boat strikeUS destroys 'drug smuggling submarine' Trinidad and Tobago's Prime Minister Kamla Persad-Bissessar is a supporter of the deadly US strikes on suspected drug boats in waters off Venezuela. On Friday, the US secretary of war claimed six \"narco-terrorists\" had been killed in a strike on an alleged drug smuggling boat in the Caribbean Sea. Chief correspondent The question is simple - is this really all about President Trump's war on drugs in South America? I doubt it. A sledgehammer to crack a nut that isn't even there. There are a few reasons to doubt the American government's stated aim of wiping out these so-called \"narco terrorist\" gangs threatening the US from Venezuela, even after one takes out of the equation the sort of equipment the military is deploying - which isn't what they would need for effective drug smuggling interdiction. While the president acknowledges that the synthetic opioid fentanyl is a huge killer in the US (which it is) and is supplied by drug gangs (which it is), to blame Venezuela for fentanyl production is simply incorrect. Mexican cartels produce fentanyl with precursors largely supplied from China, and it is from Mexico - America's neighbour - that the fentanyl is smuggled directly into the US across its southern border. Venezuela isn't involved in this fentanyl business in any meaningful way, and I know this because I have reported from the Sinaloa cartel's fentanyl production labs in Mexico. Read the full analysis here   Pete Hegseth said his military had bombed a vessel, which he claimed was operated by Tren de Aragua - a Venezuelan gang that was designated a terror group by Washington in February. Speaking during a White House news conference last week, Donald Trump argued the campaign against suspected smugglers from Venezuela would help tackle the opioid crisis in the US. \"Every boat that we knock out, we save 25,000 American lives. So every time you see a boat, and you feel badly you say, 'Wow, that's rough'. It is rough, but if you lose three people and save 25,000 people,\" he said.  Some Democratic politicians have expressed concerns that the strikes risk dragging the US into a war with Venezuela because of their proximity to the South American country's coast. Others have condemned the attacks as extrajudicial killings that would not stand up in a court of law."
    },
    {
        "title": "Woman raped in racially aggravated attack in Walsall, police say",
        "description": "Police are urgently searching for a man suspected of raping a woman in a racially motivated attack.&#160;",
        "url": "https://news.sky.com/story/woman-raped-in-racially-aggravated-attack-in-walsall-police-say-13458481",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rape-walsall_7063293.png?20251026204619",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-26 20:42:00",
        "Headline": "The suspect is described as white, in his 30s, with short hair, and was wearing dark clothing.",
        "Content": "Police are urgently searching for a man suspected of raping a woman in a racially motivated attack.  West Midlands police were called to the Park Hall area of Walsall just after 7.15pm on Saturday night after a woman was seen in distress in the street. The woman, in her 20s, had been raped and assaulted at a nearby property by a man she did not know, according to police.   The incident is being treated as \"racially aggravated\" and police have released CCTV footage of the suspect, asking anyone who knows his identity to call 999 immediately. The suspect is described as white, in his 30s, with short hair, and was wearing dark clothing. \"This was an absolutely appalling attack on a young woman, and we are doing absolutely everything we can to arrest the person responsible,\" said Detective Superintendent Ronan Tyrer. \"We have teams of officers recovering evidence and building a profile of the attacker so that he can be brought into custody as soon as possible. \"While we are following multiple lines of enquiry right now, it's vital that we get to hear from anyone who saw a man acting suspiciously in the area at the time. \"It may be that you were driving through the area and have dashcam footage, or you have CCTV that we have not yet recovered. Your information could be the vital breakthrough that we need. \"At this stage we are not linking this attack to any other offences.\" In September, a Sikh woman was raped in grassland in Tame Road, Oldbury, in an incident also treated as racially aggravated by police. Preet Kaur Gill MP, the Labour (Co-op) MP for Birmingham Edgbaston, posted on X: \"Deeply shocked and saddened that we are hearing of yet another racially aggravated rape this time in Walsall. \"West Midlands Police have reported a rape and assault of a young woman in her 20s in the Park Hall area, described as racially aggravated.\" Read more UK news:Family of girl sexually assaulted by released migrant 'infuriated'Former Bank of England governor criticises potential mansion taxClocks have gone back - but should daylight savings be scrapped? West Midlands Police confirmed officers from the public protection unit, local policing officers and forensic officers had worked overnight on the investigation. Chief Superintendent Phil Dolby said: \"Walsall is a diverse area and we know the fear and concern that this awful attack will cause in our communities. \"We have been speaking to people in the community today to listen to and understand their concerns and there will be an increased policing presence in the coming days.\" Anyone with information is asked to contact West Midlands Police on 101 or the live chat online, quoting log 4027 of 25 October."
    },
    {
        "title": "Former Bank of England governor Mervyn King criticises potential mansion tax",
        "description": "A former Bank of England governor has criticised potential proposals for a mansion tax, saying the government lacks a \"coherent strategy\" on the economy.",
        "url": "https://news.sky.com/story/mansion-tax-not-part-of-coherent-strategy-former-bank-of-england-governor-mervyn-king-says-13458026",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-london-knightsbridge_7062871.jpg?20251026155849",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-26 13:37:00",
        "Headline": "Lord King tells Sunday Morning With Trevor Phillips that ministers are guilty of writing up plans \"on the back of a fag packet\".",
        "Content": " A former Bank of England governor has criticised potential proposals for a mansion tax, saying the government lacks a \"coherent strategy\" on the economy. Chancellor Rachel Reeves is reportedly considering a mansion tax in next month's budget to help fill the multi-billion pound black hole in the public finances. But Lord King told Sunday Morning With Trevor Phillips that he could not identify an economic plan from the government and that adding another wealth tax would not solve the problem with the country's finances. Politics latest: UK in 'despair', warns Streeting - with NHS facing 'cultural challenges'  \"There's plenty of scope for reforming the tax system,\" he said. \"It hasn't, we haven't, seen a chancellor take a strategic look at the tax system for almost 40 years. \"It's been one kind of tinkering after another and that's created a mess - an excessively complex one.\" Last week, Ms Reeves admitted in an interview with Sky News that she was looking at both tax rises and spending cuts in the budget. The Mail On Sunday reported that one proposal being considered was a mansion tax which would hit owners of properties with an annual charge of 1% of the amount by which its value exceeds £2m - meaning a £10,000-a-year levy for homes worth £3m.  But Lord King said: \"Property taxes are an interaction between stamp duty, council tax, capital gains tax, inheritance tax. \"You don't solve that problem by just adding another wealth tax to it.\" The former Bank of England governor said the chancellor needed to look at \"all aspects\" of tax, not just on property, \"to come up with a coherent view to what it should look like\". He said this currently did not happen and that instead ministers tried to match a figure produced by the Office for Budget Responsibility (OBR), the fiscal and economic forecaster, just before the budget.  \"What happens is the OBR produces just before the budget, a number, one number, and then they look round for ideas - almost written on the back of a fag packet - about how you can raise an extra few billion or a few billion there,\" Lord King said. \"That is not a coherent tax strategy. And you could do a great deal by thinking it through first.\" Economists have indicated Ms Reeves will need to find between £20bn and £50bn to meet her goal of balancing day-to-day spending with tax receipts in 2029/30, and at least maintaining her current buffer of around £10bn against that target. The chancellor has hinted this will be more difficult to achieve due to the OBR downgrading its assessment of productivity growth. Another measure the chancellor is reportedly considering to accumulate extra revenue is a 2p hike to income tax - as reported by The Sun On Sunday. Read more:Reform UK's Zia Yusuf defends MP accused of 'racism'Twenty warnings for Sir Keir Starmer from new deputy leader The move would breach Labour's manifesto pledge not to increase national insurance, VAT and income tax. Asked whether Labour was unwise to stick with those general election promises on tax, Lord King said: \"Very unwise. \"I think the previous government was irresponsible to cut national insurance contributions when that was only remotely feasible, given unrealistic projections for public spending. \"And I think the Opposition didn't need to make a commitment not to reverse that. \"And honestly, I think that would be much better now just to say to people, 'this is where we are'. \"Be completely straight with people say, 'yeah, we made that pledge in the heat of an electoral battle, it was a mistake, we regret it, and we're going to unwind that'.\" In her Sky News interview, Ms Reeves said multiple challenges meant there was a fresh need to balance the books. She added: \"Of course, we're looking at tax and spending as well, but the numbers will always add up with me as chancellor because we saw just three years ago what happens when a government, where the Conservatives, lost control of the public finances: inflation and interest rates went through the roof.\" The Treasury has been approached for comment."
    },
    {
        "title": "Prosecutor furious as news leaks of Louvre heist gang arrests",
        "description": "Two men have been arrested following a robbery at the Louvre museum in Paris which saw thieves escape with priceless jewellery, including part of the French crown jewels.",
        "url": "https://news.sky.com/story/louvre-heist-two-arrested-after-robbery-at-paris-museum-french-media-13457886",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-louvre-heist_7059449.jpg?20251023133723",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-26 09:08:00",
        "Headline": "The audacious intruders entered the world-famous museum via a basket lift using a platform mounted on a lorry, breaking a window and making off with priceless French crown jewels.",
        "Content": " Two men have been arrested following a robbery at the Louvre museum in Paris which saw thieves escape with priceless jewellery, including part of the French crown jewels. Confirming arrests had been made on Saturday night, French public prosecutor Laure Beccuau appeared furious with the way the arrests were announced. She said: \"I deeply deplore the hasty disclosure of this information by informed individuals, without consideration for the investigation. \"This revelation can only harm the investigative efforts of the hundred or so investigators involved in the search for both the stolen jewellery and all the perpetrators.\"  While Ms Beccuau did not confirm the number of arrests, she said one man had been arrested as he was preparing to leave the country from Charles de Gaulle Airport. A second man was arrested on the same evening, also in the Paris region, according to French media. Ms Beccuau did not say whether jewels had been recovered. Both men are originally from Seine-Saint-Denis, a northern suburb of Paris, according to French daily paper Le Parisien. The operation is understood to have been swiftly launched after investigators, who had been monitoring the two individuals for days, realised that one of them was about to flee abroad. French media reported he was set to board a flight to Algeria. Ms Beccuau said it was too early to provide any further details, but would say more at the end of the period of police custody. Commenting on the arrests on social media, France's interior minister Laurent Nunez praised the investigators for \"working tirelessly\" and said \"the investigations must continue while respecting the confidentiality of the inquiry\". The suspects are now in pre-trial detention as part of investigations into the \"organised theft\" and \"criminal conspiracy to commit a crime\". They can be held for up to 96 hours. The men are suspected of being part of the group of criminals who used a cherry picker to reach a window in the Apollo Gallery of the Louvre, smashing display cases and making off with jewels worth £76m. They fled on motorbikes.  One of the world's most famous museums, attracting up to 30,000 visitors a day, the Louvre was forced to close last Sunday morning after thieves accessed a gallery containing the French crown jewels at around 9.30am local time (8.30am UK time). It took them less than eight minutes to steal eight \"priceless\" objects, including sapphire and emerald necklaces, and a diamond brooch containing 2,438 diamonds. A ninth item - the emerald crown of Napoleon III's wife, Empress Eugenie - was stolen but recovered, damaged at the scene. Read more:What will happen to stolen Louvre jewellery?  The Louvre reopened to visitors earlier this week. Sky News has contacted French police for comment."
    },
    {
        "title": "Reform UK's Zia Yusuf defends MP accused of 'racism'",
        "description": "Reform UK has defended one of its MPs who has been accused of \"racism\" after she complained about the number of black and Asian people in TV adverts.",
        "url": "https://news.sky.com/story/reform-uks-zia-yusuf-defends-mp-accused-of-racism-13457993",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sarah-pochin-conference_6969831.jpg?20251026135425",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-26 12:42:00",
        "Headline": "The party is being urged to take action against Sarah Pochin who was forced to apologise after she said \"it drives me mad when I see adverts full of black people, full of Asian people\".",
        "Content": "Reform UK has defended one of its MPs who has been accused of \"racism\" after she complained about the number of black and Asian people in TV adverts. Zia Yusuf, Reform UK's head of policy, described Sarah Pochin as a \"close friend\" and \"great MP\", and acknowledged she had made the \"poorly phrased\" comments and had apologised. However, speaking on Sunday Morning with Trevor Phillips, he said her comments had to be \"put into context\", adding people must be able to \"talk about\" representation in television advertising. Mr Yusuf said he believed the Talk TV caller who Ms Pochin was in conversation with was \"right to be upset about the massive under-representation of some groups in television advertising and significant overrepresentation of others - and we have to be able to talk about these things\". He added: \"I think is a very valid point. We must be able to talk about it.\"  Ms Pochin, the Reform MP for Runcorn and Helsby, is under fire after telling the viewer it \"drives me mad when I see adverts full of black people, full of Asian people\". She said such adverts did not \"reflect our society\" and added: \"I feel that your average white person, average white family is… not represented any more.\" Politics latest: UK in 'despair', warns Streeting Ms Pochin has since apologised for her comments, but Health Secretary Wes Streeting said her comments were \"a disgrace\" and hit out at Reform UK's leader Nigel Farage for not rebuking her. The Liberal Democrats have demanded that she lose the party whip, which would force her to sit as an independent MP in the Commons. In a statement issuing her apology, Ms Pochin said: \"My comments were phrased poorly, and I apologise for any offence caused, which was not my intention. \"The point I was trying to make is that the British advertising agency world have gone DEI [diversity, equity and inclusion] mad and many adverts are now unrepresentative of British society as a whole. \"I will endeavour to ensure my language is more accurate going forward.\" Max Wilkinson, the Liberal Democrat home affairs spokesperson, said her apology was \"nothing more than a shameless attempt to dodge responsibility for her own words\". \"Instead of showing a shred of remorse, she's doubled down and tried to excuse the inexcusable,\" he said. \"Nigel Farage keeps insisting that racism has no place in his party. Now is his chance to prove it - he must withdraw the whip or concede that Reform tolerates blatant racism.\" Read more:Prison error likened to 'Monty Python sketch'Caerphilly result likened to Hartlepool by-election loss Mr Streeting also condemned Ms Pochin's comments, telling the BBC's Sunday with Laura Kuenssberg: \"She's only sorry that she's been caught and called out. \"What we have seen on our streets in recent weeks and months is a return of 1970s, 1980s-style racism that I thought we had left in the history books. \"The only way we are going to defeat this racism is to call it out and confront it for what it is \"The deafening silence from her party leader says it all.\"  Earlier this year, Ms Pochin sparked controversy when she asked Prime Minister Sir Keir Starmer whether he would follow the lead of some European countries in banning the burka. Mr Yusuf resigned from the party later that day, but subsequently rejoined."
    },
    {
        "title": "Family of schoolgirl sexually assaulted by wrongly released migrant 'infuriated' by ordeal",
        "description": "The father of the 14-year-old schoolgirl sexually assaulted by Hadush Kebatu says his family feels \"massively let down and infuriated\" by the migrant's accidental release from prison.",
        "url": "https://news.sky.com/story/justice-secretary-highlights-sky-news-reporting-as-he-says-migrant-release-mistake-totally-unacceptable-13458157",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kebatu-finsbury-park_7062803.jpg?20251026151829",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-26 15:37:00",
        "Headline": "Hadush Kebatu, a convicted sex offender, was arrested on Sunday in London's Finsbury Park after spending just under 48 hours at large.",
        "Content": " The father of the 14-year-old schoolgirl sexually assaulted by Hadush Kebatu says his family feels \"massively let down and infuriated\" by the migrant's accidental release from prison. Kebatu, who was found guilty in September of sexually assaulting the girl and a woman in Epping, Essex, was arrested on Sunday morning in London's Finsbury Park after just under 48 hours at large. In a statement read by Epping Forest councillor Shane Yerrell on Sunday evening, the schoolgirl's father said Kebatu being released from HMP Chelmsford due to a system failure was \"unbelievably irresponsible\".   \"Myself and my family feel massively let down and infuriated by HMP Chelmsford, the police, the justice system and our Labour government. They have all failed,\" the statement read. \"Not just us as a family, but they have failed everyone in the country.\" Earlier on Sunday, Justice Secretary David Lammy said an exclusive Sky News interview will be used as part of an independent inquiry into the mistaken release. Speaking to Sky's national correspondent Tom Parmenter, a delivery driver who spoke to Kebatu at HMP Chelmsford described him as being \"confused\" as he was being guided to the railway station by prison staff. The migrant is said to have returned to the prison reception four or five times before leaving the area on a train.  Mr Lammy also said he would make a statement about the incident in parliament on Monday. He said: \"We need to get to the bottom of how this happened and why it happened, and, of course, on behalf of the public, I want to be reassured that it won't continue to happen and that the systems that we put in place, the checks and balances, are there to reassure the public.\" The schoolgirl's father said in the statement that he went to the Chelmsford prison to \"seek some answers\" after learning of Kebatu's accidental release but he was allegedly \"greeted with hostility and complete disregard for anything I said or asked\". The statement said: \"I really hope that nobody else's child has to experience what my daughter has. \"I hope he will be deported immediately, as the longer he was roaming the streets, the more threat he posed to women and children of this country. \"I had to find out from a reporter that my daughter's attacker was accidentally released in the day, then be sent images and videos of him walking around throughout the day before the police even alerted her mother.\"    Police are believed to be questioning Kebatu \"to get to the bottom of what's happened\" and to learn what his movements were between his accidental release from prison on Friday and his arrest. Mr Lammy called his accidental release from prison on Friday \"totally unacceptable\" and said Kebatu will be deported back to Ethiopia this coming week. Sky News understands the deportation will take place on Tuesday. Earlier on Sunday, Sir Keir Starmer said police officers had worked \"quickly and diligently to bring him back into custody\" and that the government had \"ordered an investigation to establish what went wrong\". Read more:Timeline of how manhunt for Hadush Kebatu unfoldedHMP Chelmsford released second person by mistake in 2023  Government has 'serious questions' to answer Opposition parties have said that the government has \"serious questions\" to answer over the incident. Chelmsford's Liberal Democrat MP Marie Goldman called for a \"rapid\" national inquiry, adding: \"The government has serious questions to answer and major work to do to make the system fit for purpose. It certainly isn't at the moment.\"  Speaking on Sunday Morning With Trevor Phillips, Zia Yusuf, Reform's head of policy, said that while he was \"relieved\" Kebatu had been re-arrested, the case was a sign of Britain's \"descent into a Monty Python sketch\". Referring to the earlier Sky News interview with the witness, he said: \"This is a man who the eyewitnesses said was actively trying to go back into prison after being accidentally let go.\" He said the case was \"absolutely shocking\" and questioned how victims of sexual assault could have confidence in the government. It is understood Kebatu, who crossed the Channel in a small boat to enter the UK on 29 June, left prison with an amount of personal money but was not given a discharge grant to cover subsistence costs. He was convicted of two counts of sexual assault, one count of attempted sexual assault, one count of inciting a girl to engage in sexual activity and one count of harassment without violence on 4 September."
    },
    {
        "title": "Father of boy, 2, who died from mould in flat hopes new law 'might be enough to protect others'",
        "description": "The father of a two-year-old boy who died from black mould in his social housing flat says he never wants anyone else to go through what they have  - as a new law brought in after his death comes into effect.",
        "url": "https://news.sky.com/story/father-of-boy-2-who-died-from-mould-in-flat-hopes-new-law-might-be-enough-to-protect-others-13458569",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-awaab-ishak-mould_7063450.jpg?20251026235017",
        "type": "UK",
        "Author": "Katie Barnfield",
        "Date Published": "2025-10-26 23:31:00",
        "Headline": "Awaab Ishak's death caused outrage and prompted the passage of Awaab's Law with a requirement for landlords to fix hazards in social housing more quickly and rehouse tenants if necessary.",
        "Content": "\n          North of England correspondent\n        The father of a two-year-old boy who died from black mould in his social housing flat says he never wants anyone else to go through what they have  - as a new law brought in after his death comes into effect. Awaab Ishak died in 2020 from a severe respiratory illness caused by prolonged exposure to the mould in his family's housing association flat in Rochdale, Greater Manchester. His throat, windpipe and other airways were swollen and congested. Fungus was found in his blood and lungs, with such severe inflammation that his official cause of death was given as \"environmental mould pollution\". His father, Faisal Ishak, had complained repeatedly to the housing provider, Rochdale Boroughwide Housing, about the mould in the three years leading up to his son's death - but nothing was done. The toddler's death caused outrage and prompted the passage of Awaab's Law with a requirement for landlords to fix reported hazards in social housing more speedily and rehouse tenants in safe accommodation if necessary. But as the rules come into force in England, a UK-wide survey found 23% of those who said they had issues such as damp, mould or condensation in their homes were social renters. Some 3,982 adults were surveyed by Censuswide earlier this month for the Health Equals campaign, which claims lives are being cut short across the UK, with damp, cold and mould in people's homes being part of the problem. \n                  David Lammy to face Commons grilling over wrongly released migrant sex offender\n                 \n                  Family of schoolgirl sexually assaulted by wrongly released migrant 'infuriated' by ordeal\n                 \n                  Timeline of how manhunt for wrongly released sex offender migrant Hadush Kebatu unfolded\n                 Speaking to Sky News, Mr Ishak said he was grateful there was now a new law protecting people going forward, and although it would \"never bring Awaab back... it might be enough to protect others\". Following Awaab's death, Rochdale Boroughwide Housing was eventually stripped of its funding, and its chief executive, Gareth Swarbrick, was sacked after it emerged that he earned £170,000 during the year of Awaab's death. Mr Ishak added: \"It was really hard for me. I lost my first child suddenly - it was really hard. \"We were very angry but couldn't do anything about it. We didn't get help. \"They have to learn from our case.\" The first phase of Awaab's Law takes effect today and will compel landlords to rectify all emergency hazards and hazardous damp and mould. For emergency hazards, an investigation and the work to fix the problem must take place within 24 hours of the landlord becoming aware of the issue. If they don't - tenants can take legal action. Read more on Sky News:Reform UK defends MP accused of 'racism'Potential mansion tax plan criticised Next year, the regulations will be extended to further issues like excess cold, fire and electrical hazards. Housing Secretary Steve Reed said: \"Everyone deserves a safe and decent home to live in and Awaab Ishak is a powerful reminder of how this can sadly be a matter of life or death. \"Awaab's family has fought hard for change and their work to protect millions of tenants' lives will live on as a legacy to their son. \"Our changes will give tenants a stronger voice and force landlords to act urgently when lives are at risk, ensuring such tragedies are never repeated.\" In 2027, the government plans to extend the law to cover all remaining health and safety hazards. There are also plans to eventually extend the rules to the private rented sector, although no date has been given for this as yet. While the government has committed to extending Awaab's Law, through the Renters' Rights Bill, which is currently awaiting royal assent, no firm timeframe has been given. The research by Health Equals also found people from the lowest-income households were almost twice as likely to live in homes with issues like damp or mould than the highest income households - 21% compared with 12%. 'It's getting worse' Some charities and campaign groups fear Awaab's Law will not go far - or fast - enough to offset this disparity. Kirby Hoyle of the Greater Manchester Tenants Union said: \"It's shocking - we've seen families coming forward whose children have been hospitalised with damp and mould. And this is even after Awaab's death \"I think it's getting worse\" Health Equals' chief campaigns officer Paul McDonald said while Awaab's Law was an \"important milestone\", its research also shows \"we need to go further\"."
    },
    {
        "title": "Woman raped in racially aggravated attack in Walsall, police say",
        "description": "Police are urgently searching for a man suspected of raping a woman in a racially motivated attack.&#160;",
        "url": "https://news.sky.com/story/woman-raped-in-racially-aggravated-attack-in-walsall-police-say-13458481",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rape-walsall_7063293.png?20251026204619",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-26 20:42:00",
        "Headline": "The suspect is described as white, in his 30s, with short hair, and was wearing dark clothing.",
        "Content": "Police are urgently searching for a man suspected of raping a woman in a racially motivated attack.  West Midlands police were called to the Park Hall area of Walsall just after 7.15pm on Saturday night after a woman was seen in distress in the street. The woman, in her 20s, had been raped and assaulted at a nearby property by a man she did not know, according to police.   The incident is being treated as \"racially aggravated\" and police have released CCTV footage of the suspect, asking anyone who knows his identity to call 999 immediately. The suspect is described as white, in his 30s, with short hair, and was wearing dark clothing. \"This was an absolutely appalling attack on a young woman, and we are doing absolutely everything we can to arrest the person responsible,\" said Detective Superintendent Ronan Tyrer. \"We have teams of officers recovering evidence and building a profile of the attacker so that he can be brought into custody as soon as possible. \"While we are following multiple lines of enquiry right now, it's vital that we get to hear from anyone who saw a man acting suspiciously in the area at the time. \"It may be that you were driving through the area and have dashcam footage, or you have CCTV that we have not yet recovered. Your information could be the vital breakthrough that we need. \"At this stage we are not linking this attack to any other offences.\" In September, a Sikh woman was raped in grassland in Tame Road, Oldbury, in an incident also treated as racially aggravated by police. Preet Kaur Gill MP, the Labour (Co-op) MP for Birmingham Edgbaston, posted on X: \"Deeply shocked and saddened that we are hearing of yet another racially aggravated rape this time in Walsall. \"West Midlands Police have reported a rape and assault of a young woman in her 20s in the Park Hall area, described as racially aggravated.\" Read more UK news:Family of girl sexually assaulted by released migrant 'infuriated'Former Bank of England governor criticises potential mansion taxClocks have gone back - but should daylight savings be scrapped? West Midlands Police confirmed officers from the public protection unit, local policing officers and forensic officers had worked overnight on the investigation. Chief Superintendent Phil Dolby said: \"Walsall is a diverse area and we know the fear and concern that this awful attack will cause in our communities. \"We have been speaking to people in the community today to listen to and understand their concerns and there will be an increased policing presence in the coming days.\" Anyone with information is asked to contact West Midlands Police on 101 or the live chat online, quoting log 4027 of 25 October."
    },
    {
        "title": "Former Bank of England governor Mervyn King criticises potential mansion tax",
        "description": "A former Bank of England governor has criticised potential proposals for a mansion tax, saying the government lacks a \"coherent strategy\" on the economy.",
        "url": "https://news.sky.com/story/mansion-tax-not-part-of-coherent-strategy-former-bank-of-england-governor-mervyn-king-says-13458026",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-london-knightsbridge_7062871.jpg?20251026155849",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-26 13:37:00",
        "Headline": "Lord King tells Sunday Morning With Trevor Phillips that ministers are guilty of writing up plans \"on the back of a fag packet\".",
        "Content": " A former Bank of England governor has criticised potential proposals for a mansion tax, saying the government lacks a \"coherent strategy\" on the economy. Chancellor Rachel Reeves is reportedly considering a mansion tax in next month's budget to help fill the multi-billion pound black hole in the public finances. But Lord King told Sunday Morning With Trevor Phillips that he could not identify an economic plan from the government and that adding another wealth tax would not solve the problem with the country's finances. Politics latest: UK in 'despair', warns Streeting - with NHS facing 'cultural challenges'  \"There's plenty of scope for reforming the tax system,\" he said. \"It hasn't, we haven't, seen a chancellor take a strategic look at the tax system for almost 40 years. \"It's been one kind of tinkering after another and that's created a mess - an excessively complex one.\" Last week, Ms Reeves admitted in an interview with Sky News that she was looking at both tax rises and spending cuts in the budget. The Mail On Sunday reported that one proposal being considered was a mansion tax which would hit owners of properties with an annual charge of 1% of the amount by which its value exceeds £2m - meaning a £10,000-a-year levy for homes worth £3m.  But Lord King said: \"Property taxes are an interaction between stamp duty, council tax, capital gains tax, inheritance tax. \"You don't solve that problem by just adding another wealth tax to it.\" The former Bank of England governor said the chancellor needed to look at \"all aspects\" of tax, not just on property, \"to come up with a coherent view to what it should look like\". He said this currently did not happen and that instead ministers tried to match a figure produced by the Office for Budget Responsibility (OBR), the fiscal and economic forecaster, just before the budget.  \"What happens is the OBR produces just before the budget, a number, one number, and then they look round for ideas - almost written on the back of a fag packet - about how you can raise an extra few billion or a few billion there,\" Lord King said. \"That is not a coherent tax strategy. And you could do a great deal by thinking it through first.\" Economists have indicated Ms Reeves will need to find between £20bn and £50bn to meet her goal of balancing day-to-day spending with tax receipts in 2029/30, and at least maintaining her current buffer of around £10bn against that target. The chancellor has hinted this will be more difficult to achieve due to the OBR downgrading its assessment of productivity growth. Another measure the chancellor is reportedly considering to accumulate extra revenue is a 2p hike to income tax - as reported by The Sun On Sunday. Read more:Reform UK's Zia Yusuf defends MP accused of 'racism'Twenty warnings for Sir Keir Starmer from new deputy leader The move would breach Labour's manifesto pledge not to increase national insurance, VAT and income tax. Asked whether Labour was unwise to stick with those general election promises on tax, Lord King said: \"Very unwise. \"I think the previous government was irresponsible to cut national insurance contributions when that was only remotely feasible, given unrealistic projections for public spending. \"And I think the Opposition didn't need to make a commitment not to reverse that. \"And honestly, I think that would be much better now just to say to people, 'this is where we are'. \"Be completely straight with people say, 'yeah, we made that pledge in the heat of an electoral battle, it was a mistake, we regret it, and we're going to unwind that'.\" In her Sky News interview, Ms Reeves said multiple challenges meant there was a fresh need to balance the books. She added: \"Of course, we're looking at tax and spending as well, but the numbers will always add up with me as chancellor because we saw just three years ago what happens when a government, where the Conservatives, lost control of the public finances: inflation and interest rates went through the roof.\" The Treasury has been approached for comment."
    },
    {
        "title": "Migrant sex offender release: A colossal reputational repair job is desperately needed after Kebatu debacle",
        "description": "Shoulders will have begun to fall in Number 10 today after the news broke that the convicted sex offender somehow released in error has been arrested and is back in custody.",
        "url": "https://news.sky.com/story/migrant-sex-offender-release-a-colossal-reputational-repair-job-is-desperately-needed-after-kebatu-debacle-13458025",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-starmer-labour_7062767.jpg?20251026145417",
        "type": "UK",
        "Author": "Mhari Aurora",
        "Date Published": "2025-10-26 13:39:00",
        "Headline": "Hadush Kebatu's mistaken release is bad news for Sir Keir Starmer, but it also speaks to a wider problem in the creaking criminal justice system.",
        "Content": "\n          Political correspondent\n              @MhariAurora\n Shoulders will have begun to fall in Number 10 today after the news broke that the convicted sex offender somehow released in error has been arrested and is back in custody. But whether Hadush Kebatu is behind bars or not, and whether he is deported or not, the political damage has been done. According to government figures from July, 262 prisoners were released in error in England and Wales between March 2024 and March 2025, up from 115 the previous year, a 128% increase. And there are several previous incidences of dangerous sex attackers being mistakenly released from prison and then going on to attack other women while still at large - just google William Fernandez or Joseph McCann.  Live updates on the arrest There is no suggestion he's committed major offences while he was freed, but the judge in his trial said there was a risk of him reoffending - making it all the more concerning he was released accidentally. Despite being a shocking and almost unbelievable turn of events - if you pitched this storyline you'd be laughed out the room for it being so far-fetched - these kinds of mistakes are far too common and speak to a wider problem in the creaking criminal justice system. Senior government sources admit to me that not only was this saga incredibly embarrassing for government, but it also feeds a narrative that Britain isn't working and the state cannot fulfil basic functions.  Read more:Kebatu is second person freed by mistake from HMP ChelmsfordWrongly-released migrant 'tried to return to prison 4 or 5 times' And it is this impression of state incompetency and political failure that reflects so poorly on Starmer's premiership when he promised an end to Tory chaos and to bolster and improve public services… prison system included. With 14 years in power, there is no denying the state of the prison system in the UK is the responsibility of the Conservative Party too. But the public want to see action now, and it is the Labour Party that is in government. And with small boats crossings at record levels this year already, a migrant sent to France on the one-in-one-out scheme coming back on a small boat for the second time, and a convicted sex offender on the loose for two days, a colossal reputational repair job is desperately needed. It took 48 hours to find Kebatu. It will take far longer to convince the public this government has a grip on public services and can be trusted to keep us all safe."
    },
    {
        "title": "Reform UK's Zia Yusuf defends MP accused of 'racism'",
        "description": "Reform UK has defended one of its MPs who has been accused of \"racism\" after she complained about the number of black and Asian people in TV adverts.",
        "url": "https://news.sky.com/story/reform-uks-zia-yusuf-defends-mp-accused-of-racism-13457993",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sarah-pochin-conference_6969831.jpg?20251026135425",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-26 12:42:00",
        "Headline": "The party is being urged to take action against Sarah Pochin who was forced to apologise after she said \"it drives me mad when I see adverts full of black people, full of Asian people\".",
        "Content": "Reform UK has defended one of its MPs who has been accused of \"racism\" after she complained about the number of black and Asian people in TV adverts. Zia Yusuf, Reform UK's head of policy, described Sarah Pochin as a \"close friend\" and \"great MP\", and acknowledged she had made the \"poorly phrased\" comments and had apologised. However, speaking on Sunday Morning with Trevor Phillips, he said her comments had to be \"put into context\", adding people must be able to \"talk about\" representation in television advertising. Mr Yusuf said he believed the Talk TV caller who Ms Pochin was in conversation with was \"right to be upset about the massive under-representation of some groups in television advertising and significant overrepresentation of others - and we have to be able to talk about these things\". He added: \"I think is a very valid point. We must be able to talk about it.\"  Ms Pochin, the Reform MP for Runcorn and Helsby, is under fire after telling the viewer it \"drives me mad when I see adverts full of black people, full of Asian people\". She said such adverts did not \"reflect our society\" and added: \"I feel that your average white person, average white family is… not represented any more.\" Politics latest: UK in 'despair', warns Streeting Ms Pochin has since apologised for her comments, but Health Secretary Wes Streeting said her comments were \"a disgrace\" and hit out at Reform UK's leader Nigel Farage for not rebuking her. The Liberal Democrats have demanded that she lose the party whip, which would force her to sit as an independent MP in the Commons. In a statement issuing her apology, Ms Pochin said: \"My comments were phrased poorly, and I apologise for any offence caused, which was not my intention. \"The point I was trying to make is that the British advertising agency world have gone DEI [diversity, equity and inclusion] mad and many adverts are now unrepresentative of British society as a whole. \"I will endeavour to ensure my language is more accurate going forward.\" Max Wilkinson, the Liberal Democrat home affairs spokesperson, said her apology was \"nothing more than a shameless attempt to dodge responsibility for her own words\". \"Instead of showing a shred of remorse, she's doubled down and tried to excuse the inexcusable,\" he said. \"Nigel Farage keeps insisting that racism has no place in his party. Now is his chance to prove it - he must withdraw the whip or concede that Reform tolerates blatant racism.\" Read more:Prison error likened to 'Monty Python sketch'Caerphilly result likened to Hartlepool by-election loss Mr Streeting also condemned Ms Pochin's comments, telling the BBC's Sunday with Laura Kuenssberg: \"She's only sorry that she's been caught and called out. \"What we have seen on our streets in recent weeks and months is a return of 1970s, 1980s-style racism that I thought we had left in the history books. \"The only way we are going to defeat this racism is to call it out and confront it for what it is \"The deafening silence from her party leader says it all.\"  Earlier this year, Ms Pochin sparked controversy when she asked Prime Minister Sir Keir Starmer whether he would follow the lead of some European countries in banning the burka. Mr Yusuf resigned from the party later that day, but subsequently rejoined."
    },
    {
        "title": "Tax hike could lead to higher food prices, supermarkets warn",
        "description": "The UK's largest supermarkets are calling on the chancellor to exclude stores from a new business rates surtax, warning that shoppers will bear the brunt of higher prices.",
        "url": "https://news.sky.com/story/supermarkets-warn-shoppers-could-face-higher-prices-if-business-rates-rise-13457822",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-money-file-generic_7023711.jpg?20250918091333",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-26 02:16:00",
        "Headline": "A letter signed by major retailers warns that shoppers will bear the brunt of higher prices as the sector faces a \"disproportionate tax burden\".",
        "Content": "The UK's largest supermarkets are calling on the chancellor to exclude stores from a new business rates surtax, warning that shoppers will bear the brunt of higher prices. Tesco, Sainsbury's, Marks & Spencer, Waitrose, Morrisons, Asda, Aldi and Lidl are among the stores that have signed a letter addressed to Rachel Reeves, arguing that easing taxes on grocers would help curb food inflation. Industry group the British Retail Consortium (BRC), which organised the letter, said large shops could face higher business rates if included in the government's proposed surtax on properties valued at more than £500,000. Smaller high street firms are expected to benefit from reduced business rates under the government's plans. \"If the industry faces higher taxes in the coming Budget - such as being included in the new surtax on business rates - our ability to deliver value for our customers will become even more challenging, and it will be households who inevitably feel the impact,\" the letter reads.  \"Large retail premises are a tiny proportion of all stores, yet account for a third of retail's total business rates bill - meaning another significant rise could push food inflation even higher.\" The supermarkets are asking Ms Reeves to \"address retail's disproportionate tax burden\", saying that doing so would \"send a strong signal of support for the industry and of the government's commitment to tackling food inflation\". \n                  Start-ups warn Reeves over budget tax bombshell\n                 \n                  Former Bank of England governor Mervyn King criticises potential mansion tax\n                 \n                  Cutting cash ISA allowance could backfire - and make mortgages more expensive, MPs warn \n                 The chancellor is widely expected to raise taxes after bleak economic forecasts and a string of reversals on welfare cuts, which have made it harder for her to stick to her borrowing limits. Read more from Sky News:Retail sales the highest in three years in a surprise to economistsOilfield services group Petrofac board on standby to handle collapse Helen Dickinson, the BRC's chief executive, said: \"Supermarkets are doing everything possible to keep food prices affordable, but it's an uphill battle, with over £7 billion in additional costs in 2025 alone. \"From higher national insurance contributions to new packaging taxes, the financial strain on the industry is immense.\" The Treasury has been contacted for comment."
    },
    {
        "title": "Israel allows Red Cross and Egyptian teams into Gaza as search for bodies of hostages widens",
        "description": "International teams searching for the bodies of hostages have been allowed to cross Israel's military boundary in Gaza, according to an Israeli government spokesperson.",
        "url": "https://news.sky.com/story/israel-allows-red-cross-and-egyptian-teams-into-gaza-as-search-for-bodies-of-hostages-widens-13458151",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gaza-bodies_7062843.jpg?20251026154221",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-26 15:28:00",
        "Headline": "On Saturday, the Egyptian team arrived with an excavator and bulldozers to help search for bodies, as part of efforts by international mediators to make sure the ceasefire holds.",
        "Content": " International teams searching for the bodies of hostages have been allowed to cross Israel's military boundary in Gaza, according to an Israeli government spokesperson. Hamas says it has expanded its search for the bodies of hostages in Gaza, a day after a team of Egyptian experts arrived to help retrieve them. The team is working with the Red Cross during the search. \"Israel is aware that Hamas knows where our deceased hostages are, in fact, located. If Hamas made more of an effort,they would be able to retrieve the remains of our hostages,\" the government spokesperson said on Sunday.  The military boundary, often referred to as the \"yellow line\", is a boundary for Israel Defence Forces (IDF) troops in Gaza, established by the ceasefire agreement. The fragile ceasefire, brokered by the US, relies on Hamas returning all the remains of Israeli hostages as soon as possible, but in the past five days, no bodies have been released. Read more: Revealed: The plan for a 'New Gaza' On Saturday, the Egyptian team arrived with an excavator and bulldozers to help search for bodies, as part of efforts by international mediators to make sure the ceasefire holds. The bodies of 13 hostages remain in Gaza, with Hamas chief Khalil al Hayya saying the group has started searching in new areas on Sunday morning.  As part of the ceasefire deal, Israel agreed to give back 15 bodies of Palestinians for every body of a hostage. Israel has now sent back the bodies of 195 Palestinians, while Hamas has returned 15 bodies of hostages. US President Donald Trump warned he is \"watching very closely\" to ensure Hamas returns more bodies. \"Some of the bodies are hard to reach, but others they can return now and, for some reason, they are not,\" he wrote on Truth Social. “Let’s see what they do over the next 48 hours. I am watching this very closely,” he said in his post on Saturday.  Last week, Hayya told an Egyptian media outlet that efforts to retrieve the bodies faced challenges because of the massive destruction, burying them deep underground. On Saturday night, Israeli forces struck the central Nuseirat refugee camp in Gaza for the second time in a week, according to Awda Hospital. Read more on Gaza:Videos show fresh evidence of Israeli support for Gaza militiaSky News reports from inside a Gaza City suburb The IDF claimed it was targeting militants associated with the Palestinian Islamic Jihad group who were planning to attack Israeli troops. Islamic Jihad, the second largest militant group in Gaza, denied it was preparing for an attack. Hamas called the strike a \"clear violation\" of the ceasefire and accused Benjamin Netanyahu of attempting to sabotage President Trump's efforts to end the war. The strike on Saturday came hours after US secretary of state Marco Rubio left Israel. He was the latest in a series of White House officials to visit Israel and visit a new centre for civilian and military coordination that is attempting to oversee the ceasefire. US vice president JD Vance was in Israel earlier this week, as were American envoys Steve Witkoff and Jared Kushner, the president’s son-in-law."
    },
    {
        "title": "Key city in Sudan on brink of falling to paramilitary group",
        "description": "After 18 months of surviving forced starvation and shelling by the paramilitary group the Rapid Support Forces (RSF), the regional capital and symbolic battleground of Al Fashir is on the verge of full military collapse.",
        "url": "https://news.sky.com/story/key-city-in-sudan-on-brink-of-falling-to-paramilitary-group-13458383",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sudan-al-fashir_7063210.jpg?20251026191635",
        "type": "World",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-10-26 18:36:00",
        "Headline": "The Rapid Support Forces (RSF) claims to have taken over the city of Al Fashir and completed its military control of Sudan's Darfur region.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  After 18 months of surviving forced starvation and shelling by the paramilitary group the Rapid Support Forces (RSF), the regional capital and symbolic battleground of Al Fashir is on the verge of full military collapse. On Sunday, the RSF advanced into the heart of the city and captured the 6th Infantry Division of the Sudanese Armed Forces (SAF) in central Al Fashir after three days of intensified ground battles. In propaganda videos shared on RSF social media channels, troops waved their assault rifles in the yard of the garrison and celebrated victory in front of a bullet-ridden wall marked with an emblem of the Sudanese military. They claim to have taken over the city and completed their military control of the Darfur region.  Sudanese army soldiers, civilian resistance fighters and first responders have denounced the RSF's declaration of full victory and say battles are ongoing to fend off the city's capture. A wedge of military-held territory remains on the western edge of Al Fashir where remaining civilians are squeezed in with troops fighting to push outwards and regain key sites lost to the RSF. \"I left because all the residents and forces have been intensely concentrated in Al-Daraja Owla neighbourhood. It was too much and people started fleeing,\" said aid worker and resident Adam al Rashid, who left Al Fashir on Saturday. \"The RSF was moving people out and attacking others. So many have been killed by gunfire and shelling from battles. It was clear this was coming. The RSF has been advancing on the 6th infantry division for three days.\" Around 5,000 people have fled Al Fashir since 23 October, according to initial assessments by the International Organisation for Migration (IOM). Videos shared on RSF channels show masses fleeing on foot - some filmed by an RSF surveillance drone scattered across a field and others left in long, sombre queues as RSF soldiers yelled at them from inside their trucks. Other videos show men of fighting age rounded up and kneeling on the ground as RSF troops yell at them, \"You are all army\". Sources tell Sky News that those fleeing are facing mass arrests and extra-judicial killings on their way out. There is currently a telecommunications blackout in Al Fashir. An ominous sign that has marked previous takeovers by the paramilitary group, including the city of Al Geneina where the United Nations (UN) accused the RSF of killing 10,000 to 15,000 people. Read more:'Massacre' in Sudan kills at least 53Sudanese militia leader convicted of war crimes \"I am very concerned about the life of my relatives, the journalists and the doctors inside the city of Al Fashir. All of us saw what happened in Al Geneina and we are scared that will happen in Al Fashir too,\" said Mohamed Zakarea, a journalist from Al Fashir who fled the city a year ago after five months of the RSF siege. \"The people are waiting for the Sudanese army - for the war planes and the air drops. If all of this doesn't happen, then I'm afraid to say that Al Fashir is falling.\""
    },
    {
        "title": "US warship arrives in Trinidad and Tobago - as Venezuela hits out at 'military provocation'",
        "description": "A US warship has docked in the capital of Trinidad and Tobago, as US President Donald Trump increases military pressure on Venezuela.",
        "url": "https://news.sky.com/story/us-warship-arrives-in-trinidad-and-tobago-as-venezuela-hits-out-at-military-provocation-13458445",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gravely-trinidad_7063251.jpg?20251026200142",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-26 19:46:00",
        "Headline": "Government officials in Trinidad and Tobago and from the US say the warship will remain in Trinidad until Thursday for training exercises. Meanwhile, Venezuela claims it captured a group of mercenaries who intended to carry out a false flag attack in the region.",
        "Content": "A US warship has docked in the capital of Trinidad and Tobago, as US President Donald Trump increases military pressure on Venezuela. The guided missile destroyer, USS Gravely, is in addition to the aircraft carrier USS Gerald R Ford, which is moving closer to Venezuela. President Trump has accused the country's president, Nicolas Maduro, of being the leader of an organised crime gang but has not offered any evidence. President Maduro has called the deployment of warships an attempt by the US government to \"invent a new eternal war\" against his country.  Government officials in Trinidad and Tobago and from the US said the warship will remain in Trinidad until Thursday for training exercises. Venezuela's government has since issued a statement condemning what it called a military provocation by Trinidad and Tobago and the US. The country claimed it captured a group of mercenaries \"with direct information of the American intelligence agency\" who intended to carry out a false flag attack in the region. The statement from vice president Delcy Rodriguez did not give any details or evidence of the alleged false flag attack.  Jenifer Neidhart de Ortiz, the US Embassy's charge d'affaires, said the exercises sought to \"address shared threats like transnational crime and build resilience through training, humanitarian missions, and security efforts\". A senior military official, speaking on condition of anonymity, said the move was only recently scheduled. Read more: Inside Pablo Escobar's home city where drugs are readily available The presence of the ship is controversial for some. \"This is a warship in Trinidad, which will be anchored here for several days just miles off Venezuela when there's a threat of war,\" said David Abdulah, leader of the Movement for Social Justice political party. \"That's an abomination.\" Read more:US accused of 'inventing a war'Survivors reported after boat strikeUS destroys 'drug smuggling submarine' Trinidad and Tobago's Prime Minister Kamla Persad-Bissessar is a supporter of the deadly US strikes on suspected drug boats in waters off Venezuela. On Friday, the US secretary of war claimed six \"narco-terrorists\" had been killed in a strike on an alleged drug smuggling boat in the Caribbean Sea. Chief correspondent The question is simple - is this really all about President Trump's war on drugs in South America? I doubt it. A sledgehammer to crack a nut that isn't even there. There are a few reasons to doubt the American government's stated aim of wiping out these so-called \"narco terrorist\" gangs threatening the US from Venezuela, even after one takes out of the equation the sort of equipment the military is deploying - which isn't what they would need for effective drug smuggling interdiction. While the president acknowledges that the synthetic opioid fentanyl is a huge killer in the US (which it is) and is supplied by drug gangs (which it is), to blame Venezuela for fentanyl production is simply incorrect. Mexican cartels produce fentanyl with precursors largely supplied from China, and it is from Mexico - America's neighbour - that the fentanyl is smuggled directly into the US across its southern border. Venezuela isn't involved in this fentanyl business in any meaningful way, and I know this because I have reported from the Sinaloa cartel's fentanyl production labs in Mexico. Read the full analysis here   Pete Hegseth said his military had bombed a vessel, which he claimed was operated by Tren de Aragua - a Venezuelan gang that was designated a terror group by Washington in February. Speaking during a White House news conference last week, Donald Trump argued the campaign against suspected smugglers from Venezuela would help tackle the opioid crisis in the US. \"Every boat that we knock out, we save 25,000 American lives. So every time you see a boat, and you feel badly you say, 'Wow, that's rough'. It is rough, but if you lose three people and save 25,000 people,\" he said.  Some Democratic politicians have expressed concerns that the strikes risk dragging the US into a war with Venezuela because of their proximity to the South American country's coast. Others have condemned the attacks as extrajudicial killings that would not stand up in a court of law."
    },
    {
        "title": "Prosecutor furious as news leaks of Louvre heist gang arrests",
        "description": "Two men have been arrested following a robbery at the Louvre museum in Paris which saw thieves escape with priceless jewellery, including part of the French crown jewels.",
        "url": "https://news.sky.com/story/louvre-heist-two-arrested-after-robbery-at-paris-museum-french-media-13457886",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-louvre-heist_7059449.jpg?20251023133723",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-26 09:08:00",
        "Headline": "The audacious intruders entered the world-famous museum via a basket lift using a platform mounted on a lorry, breaking a window and making off with priceless French crown jewels.",
        "Content": " Two men have been arrested following a robbery at the Louvre museum in Paris which saw thieves escape with priceless jewellery, including part of the French crown jewels. Confirming arrests had been made on Saturday night, French public prosecutor Laure Beccuau appeared furious with the way the arrests were announced. She said: \"I deeply deplore the hasty disclosure of this information by informed individuals, without consideration for the investigation. \"This revelation can only harm the investigative efforts of the hundred or so investigators involved in the search for both the stolen jewellery and all the perpetrators.\"  While Ms Beccuau did not confirm the number of arrests, she said one man had been arrested as he was preparing to leave the country from Charles de Gaulle Airport. A second man was arrested on the same evening, also in the Paris region, according to French media. Ms Beccuau did not say whether jewels had been recovered. Both men are originally from Seine-Saint-Denis, a northern suburb of Paris, according to French daily paper Le Parisien. The operation is understood to have been swiftly launched after investigators, who had been monitoring the two individuals for days, realised that one of them was about to flee abroad. French media reported he was set to board a flight to Algeria. Ms Beccuau said it was too early to provide any further details, but would say more at the end of the period of police custody. Commenting on the arrests on social media, France's interior minister Laurent Nunez praised the investigators for \"working tirelessly\" and said \"the investigations must continue while respecting the confidentiality of the inquiry\". The suspects are now in pre-trial detention as part of investigations into the \"organised theft\" and \"criminal conspiracy to commit a crime\". They can be held for up to 96 hours. The men are suspected of being part of the group of criminals who used a cherry picker to reach a window in the Apollo Gallery of the Louvre, smashing display cases and making off with jewels worth £76m. They fled on motorbikes.  One of the world's most famous museums, attracting up to 30,000 visitors a day, the Louvre was forced to close last Sunday morning after thieves accessed a gallery containing the French crown jewels at around 9.30am local time (8.30am UK time). It took them less than eight minutes to steal eight \"priceless\" objects, including sapphire and emerald necklaces, and a diamond brooch containing 2,438 diamonds. A ninth item - the emerald crown of Napoleon III's wife, Empress Eugenie - was stolen but recovered, damaged at the scene. Read more:What will happen to stolen Louvre jewellery?  The Louvre reopened to visitors earlier this week. Sky News has contacted French police for comment."
    },
    {
        "title": "How the Louvre investigation is unfolding – as police face 'a race against time'",
        "description": "A 100-strong specialist police unit is investigating the daring theft of French crown jewels from the Louvre - as officers face \"a race against time\" to recover the \"priceless\" objects.",
        "url": "https://news.sky.com/story/how-the-louvre-investigation-is-unfolding-8211-as-police-face-a-race-against-time-13454333",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-louvre-heist_7057157.jpg?20251021103413",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-26 12:00:00",
        "Headline": "As arrests are made, here's everything you need to know abut the audacious Paris heist that saw thieves escape with jewellery worth £76m.",
        "Content": " A 100-strong specialist police unit is investigating the daring theft of French crown jewels from the Louvre - as officers face \"a race against time\" to recover the \"priceless\" objects. On Sunday, four thieves stole nine items - one of which was dropped and recovered at the scene - in a heist pulled off while the world-famous Paris museum was open to visitors. The first arrests On Saturday night, two men were arrested, one as he was preparing to leave the country from Charles de Gaulle Airport. French media reported the men were originally from Seine-Saint-Denis, a northern suburb of Paris, and were both known to the police. French public prosecutor Laure Beccuau reacted furiously to the premature leak of information, saying: \"I deeply deplore the hasty disclosure of this information by informed individuals, without consideration for the investigation. \"This revelation can only harm the investigative efforts of the hundred or so investigators involved in the search for both the stolen jewellery and all the perpetrators.\" Investigators are understood to have been monitoring the men for days, moving swiftly into action when they realised that one of the men was about to flee abroad. French media reported he was set to board a flight to Algeria. Ms Beccuau did not say whether any jewels had been recovered.  What do we know about the police investigation?  After the robbery, a huge police operation rolled into action - with one expert describing the probe as \"one of the biggest manhunts in French history\". Paris prosecutors entrusted the investigation to a specialised unit known as the BRB (Brigade de répression du banditisme), an anti-organised crime squad which often deals with high-profile robberies. A former officer who served in the unit has said it handled the 2016 Kim Kardashian probe, after a gang stormed the reality TV star's Paris apartment, tied her up and escaped with jewellery worth an estimated $6m (£4.4m). Read more: What will happen to the stolen jewellery? Pascal Szkudlara said the BRB has around 100 agents, with over a dozen who specialise in museum thefts. Investigators are examining video evidence, telephone records and forensic evidence, while also speaking to informants. Mr Szkudlara said the BRB \"can have teams working on it 24/7 and for a long period\", adding he has \"100%\" confidence the thieves will be caught. Art detective Arthur Brand - who helps police across Europe with investigations into missing works - has said officers will also be reviewing security footage going back weeks, looking to identify suspicious people casing out the gallery.  What do we know about the culprits?  Only a small pool of criminals would be capable of a job as audacious as Sunday's heist and they may already be known to police, specialists say. Art theft expert Anthony Amore told Sky News the culprits are \"probably a European criminal gang\". \"The idea it's professional thieves like you see in Ocean's 11, it's not that,\" he told presenter Anna Botting. \"It's the sort of people who do this in all sorts of venues, so they are professional in that sense. They had this very well planned out.\" What did they take? The thieves made away with a total of eight objects, including a sapphire diadem (a jewelled headband), necklace and single earring from a set linked to 19th-century queens Marie-Amelie and Hortense. They also took an emerald necklace and earrings tied to Empress Marie-Louise, Napoleon Bonaparte's second wife, as well as a reliquary brooch. Empress Eugenie's diamond diadem and her large corsage-bow brooch - an imperial ensemble of rare craftsmanship - were also stolen. One piece - Eugenie's emerald-set imperial crown with more than 1,300 diamonds - was later found damaged outside the museum. What have officers found so far? As well as recovering one of the stolen items - a crown that once belonged to Napoleon III's wife, Empress Eugenie - at the scene, French culture minister Rachida Dati said police found \"motorcycles and a licence plate\". They have also recovered evidence from a cherry picker used by the thieves to access the first-floor Galerie d'Apollon, where the jewels were on display. Ms Dati said: \"I also want to pay tribute to the security officers who prevented the basket lift from being set on fire. \"One of the criminals tried to set it on fire, but they forced him to flee.\" Read more:The stolen items revealedWorkers 'repeatedly warned of security shortcomings' Police face 'a race against time'  Art detective Mr Brand told Sky News the likelihood of the loot being found intact is reducing every day. \"These crown jewels are so famous, you just cannot sell them,\" he said. \"The only thing they can do is melt the silver and gold down, dismantle the diamonds, try to cut them. That's the way they will probably disappear forever.\" He said officers will need to catch the thieves within the week to preserve any hopes of the jewels being recovered. \"If it takes longer, the loot is probably gone and dismantled,\" he said. \"It's a race against time.\""
    },
    {
        "title": "Trump says he's ended eight wars in eight months",
        "description": "US President Donald Trump has claimed he is now responsible for bringing to an end eight wars, as he visited Malaysia to oversee the signing of an expanded ceasefire deal between Thailand and Cambodia.",
        "url": "https://news.sky.com/story/trump-oversees-signing-of-historic-thailand-cambodia-ceasefire-deal-13457827",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-malaysia_7062338.jpg?20251026070528",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-26 04:29:00",
        "Headline": "The US president begins a week-long, high-profile trip to Asia which will include a meeting with Chinese leader Xi Jinping.",
        "Content": " US President Donald Trump has claimed he is now responsible for bringing to an end eight wars, as he visited Malaysia to oversee the signing of an expanded ceasefire deal between Thailand and Cambodia. \"This is one of eight wars that my administration has ended in just eight months - we are averaging one a month, there is only one left,\" Mr Trump said as he attended the signing of the peace deal. \"I can't think of any president that ever solved one war... they start wars they don't solve them.\" The US president, who this summer helped negotiate the ceasefire to resolve the border dispute between Cambodia and Thailand, went on to say: \"On behalf of the United States I am proud to help settle this conflict.\" The ceremony for the signing of the deal in Malaysia's capital Kuala Lumpur took place shortly after Mr Trump arrived for the ASEAN summit on Sunday, describing it as a \"momentous day\". \"There was a lot of killing. And then we got it stopped, very quickly,\" he said, before Cambodian Prime Minister Hun Manet and Thai Prime Minister Anutin Charnvirakul signed the agreement. \"We did something that a lot of people said couldn't be done,\" said Mr Trump. Mr Manet called it a \"historic day\" and Mr Charnvirakul said the agreement creates \"the building blocks for a lasting peace\". The ceasefire agreement calls for Thailand to release 18 Cambodian soldiers in captivity and for both countries to start withdrawing heavy weapons from the border. The US president said he had signed economic deals with both nations and was scheduled to finalise a trade agreement with Malaysia later in the day. During the ASEAN Summit, regional leaders are expected to work on stabilising ties with the US. Malaysia's Prime Minister Anwar Ibrahim and a troupe of ceremonial dancers greeted Mr Trump at Kuala Lumpur International Airport. He paused on the red carpet to dance with the performers before getting into his limousine. Kuala Lumpur is the first stop of Mr Trump's week-long trip to the region, which also includes visits to Japan and South Korea. This includes a meeting with Chinese President Xi Jinping on the sidelines of the APEC summit in South Korea. Asked by a reporter whether rare earths were discussed in the US-China talks that began on Saturday, US trade negotiator Jamieson Greer said a wide range of topics were covered, including extending the trade truce. \"I believe we are reaching a point where the leaders will have a very productive meeting,\" Mr Greer said. Mr Trump is also expected to discuss tariffs with Brazilian President Luiz Inacio Lula da Silva, who is among the leaders attending the APEC summit. Read more from Sky News:Trump '100% open' to meeting Kim Jong UnWinner declared in Irish presidential election East Timor, Asia's youngest nation, officially became ASEAN's 11th member on Sunday, fulfilling a vision its current president had nearly 50 years ago, when the country was still a Portuguese colony. Also known as Timor-Leste, the nation of 1.4 million is among Asia's poorest and hopes joining the bloc will strengthen its fledgling economy. At roughly $2bn, it represents only a small fraction of ASEAN's combined $3.8trn GDP. "
    },
    {
        "title": "Vladimir Putin tests new 'invincible' nuclear-powered missile",
        "description": "Russia has tested a new nuclear-powered cruise missile with an unlimited range, the country's top general said.",
        "url": "https://news.sky.com/story/vladimir-putin-tests-new-invincible-nuclear-powered-missile-13457838",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-vladimir-putin-russia_7062379.jpg?20251026090100",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-26 06:26:00",
        "Headline": "The weapon travelled 14,000km (8,700 miles) and was in the air for about 15 hours during the test on Tuesday.",
        "Content": "Russia has tested a new nuclear-powered cruise missile with an unlimited range, the country's top general said. The nuclear-capable missile travelled 14,000km (8,700 miles) and was in the air for about 15 hours during the test on Tuesday, Valery Gerasimov, chief of the general staff of Russia's armed forces, told President Vladimir Putin on Sunday. The Russian leader, whose full-scale invasion of Ukraine continues more than three years after it was launched, described the 9M730 Burevestnik (Storm Petrel) as \"invincible\" to current and future missile defences, with an almost unlimited range and unpredictable flight path. In remarks released by the Kremlin, Mr Putin said the \"crucial testing\" of the weapon had concluded and that work should start on the final stages before it is deployed. The missile is dubbed the SSC-X-9 Skyfall by NATO. On Wednesday Mr Putin oversaw a test of Russia's strategic nuclear forces on land, sea and air. \"The so-called modernity of our nuclear deterrent forces is at the highest level,\" the Russian president said. Sky News' military analyst Sean Bell said Mr Putin's comments about the Skyfall missile were \"all rhetoric\". \"It's absolutely no benefit to Russia whatsoever to get involved in a nuclear exchange. This is all trying to keep the West at bay as it continues to fight in its invasion in Ukraine,\" he said. Mr Bell outlined the situation on the ground and said: \"The front lines, they are moving. I mean, Russia is winning. It's just winning very, very slowly. \"And I think what's happening at the moment in the West is that even with the West's support for the last three and a half getting on for four years, Ukraine is still losing. So what does the West have to do differently? \"America's support looks a little bit more flaky now and therefore the onus is on the Europeans. \"What more should be done? Because if Ukraine was to fall all of a sudden - Poland, Lithuania, Latvia, Estonia, who next?… and that compromises European security.\"  Deadly drone strikes on Kyiv Three people were killed in a Russian overnight drone attack on Ukraine's capital Kyiv, which also injured 31, including six children. Fires caused by Russian drones broke out in two residential buildings in the Desnianskyi district, with emergency crews evacuating civilians from a nine-storey building and a 16-storey building. Ukraine's interior minister Ihor Klymenko said a woman, 19, and her mother, 46, were among the fatalities. Seven of the injured, including two children, were taken to the city's hospitals, Kyiv mayor Vitali Klitschko said on the Telegram messaging app. Read more from Sky News: Sanctions alone won't force Putin to end Ukraine warTrump '100% open' to meeting Kim Jong Un According to Ukraine's Air Force, Russia attacked Ukraine with 101 drones overnight on Sunday, of which 90 were shot down and neutralised by Ukrainian forces. Kyiv and its surrounding region were under air raid alerts for somewhere between 60 and 90 minutes before the air force called them off."
    },
    {
        "title": "Jamaica braces as Hurricane Melissa 'rapidly intensifies'",
        "description": "Hurricane Melissa has been strengthened into a Category 4 hurricane that threatens to unleash catastrophic flooding in the northern Caribbean. ",
        "url": "https://news.sky.com/story/jamaica-braces-as-hurricane-melissa-rapidly-intensifies-13457823",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hurricane-melissa-noaa-pic_7062323.jpg?20251026034659",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-26 03:41:00",
        "Headline": "The hurricane is expected to bring torrential rain of up to 25in (64cm) when it hits Jamaica.",
        "Content": " Hurricane Melissa has been strengthened into a Category 4 hurricane that threatens to unleash catastrophic flooding in the northern Caribbean.  Forecasters at the US National Hurricane Center warned the storm could be upgraded to a Category 5 storm on Sunday night. Melissa has already hit Haiti and the Dominican Republic. It is expected to reach the southern coast of Jamaica late on Monday or early Tuesday morning, with people living on the island warned to seek shelter immediately.   \"I urge Jamaicans to take this weather threat seriously,\" said Jamaican Prime Minister Andrew Holness. \"Take all measures to protect yourself.\" The hurricane is expected to bring torrential rain of up to 25in (64cm) when it hits Jamaica. A similar forecast was issued for the southern regions of Haiti and the Dominican Republic through to Monday. \n                  Number of dead in Dominican Republic nightclub roof collapse disaster rises to 225 \n                 \n                  Parents of US student missing in Dominican Republic 'ask police to declare her dead'\n                 \n                  Hurricane Beryl: Monstrous' storm heads towards Jamaica after six killed\n                 The visualisation above shows Hurricane Melissa's path on Sunday, according to the National Oceanic and Atmospheric Administration (NOAA). On Saturday evening, Melissa was centred about 125 miles (200km) southeast of Kingston, Jamaica, and about 280 miles (455km) southwest of Port-au-Prince, Haiti. It had maximum sustained winds of 115mph (185 kph) and was moving west at 3mph (6kph), the hurricane centre said. The storm has killed at least three people in Haiti and a fourth person in the Dominican Republic. In Les Cayes, Haiti, residents said the effects of Melissa were catastrophic. \"The sea took our house. We have no place to stay. We came to the high school, but we have nothing to give the children to eat. We ask for help and support. We are not asking for much,\" one woman, who did not want to provide her name, told the AP news agency. Other people in the area are in shelters. \"I would like to move, but I have no place to go. I packed everything. I don't have the means to go,\" another resident said. The storm has damaged nearly 200 homes in the Dominican Republic and knocked out water supply systems, affecting more than half a million customers. It also downed trees and traffic lights, unleashed small landslides and left more than two dozen communities isolated by floodwaters. Authorities in Jamaica said the Norman Manley International Airport in Kingston will be closed at 8pm local time on Sunday. They did not say whether it will close the Sangster airport in Montego Bay, on the western side of the island. More than 650 shelters have been set up in Jamaica. Officials said warehouses across the island were well-stocked and thousands of food packages prepositioned for quick distribution if needed. \"So I would urge all my fellow citizens, everyone who is now feeling nervous, anxious, uncertain, that now is the time to be prepared,\" the country's prime minister said. The Cuban government on Saturday issued a hurricane watch for the provinces of Granma, Santiago de Cuba, Guantanamo and Holguin. According to Cuban official television images, clean-up work is being carried out and fumigation of homes to prevent the spread of the epidemic outbreaks."
    },
    {
        "title": "Trump raises tariffs on Canada by 10% in response to Reagan advert",
        "description": "Donald Trump has announced he will be raising tariffs on imports of Canadian goods by an extra 10% because of an anti-tariff advert aired in Ontario.",
        "url": "https://news.sky.com/story/trump-raises-tariffs-on-canada-by-10-in-response-to-reagan-advert-13457860",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-white-house_7059349.jpg?20251023155335",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-26 08:18:00",
        "Headline": "The advert in Ontario featured former US president Ronald Reagan speaking negatively about tariffs and arguing they cause job losses and trade wars.",
        "Content": "Donald Trump has announced he will be raising tariffs on imports of Canadian goods by an extra 10% because of an anti-tariff advert aired in Ontario. The advert used the words of former US president Ronald Reagan to criticise US tariffs. A furious Mr Trump on Friday cancelled \"all trade negotiations\" with Canada. Doug Ford, Ontario's premier, said he would pull the advert from Monday, but it continued to run over the weekend, including during the first World Series game between the Toronto Blue Jays and Los Angeles Dodgers. Mr Trump wrote in a post on his Truth Social platform: \"Their Advertisement was to be taken down, IMMEDIATELY, but they let it run last night during the World Series, knowing that it was a FRAUD. \"Because of their serious misrepresentation of the facts, and hostile act, I am increasing the Tariff on Canada by 10% over and above what they are paying now.\"  Mr Trump claimed the advert misrepresented the position of Mr Reagan, a two-term president and a beloved figure in the Republican Party. Mr Reagan had used much of his 1987 address, featured in Ontario's ad, spelling out the case against tariffs. Mr Trump said the advert was intended to influence the US Supreme Court ahead of arguments scheduled for next month which could decide whether the president has the power to impose his sweeping tariffs. It was not immediately clear when the 10% hike would come into effect, or whether it would apply to all Canadian goods. Canada - which is America's closest ally, and one of their biggest trading partners - has been hit hard by US tariffs, and Canadian Prime Minister Mark Carney has been trying to work with Mr Trump to lower them. More than three-quarters of Canadian exports go to the US, and nearly 3.6bn Canadian dollars (2.7bn US dollars) worth of goods and services cross the border daily. Many Canadian products have been hit with a 35% tariff, while steel and aluminium face rates of 50%. Energy products have a lower rate of 10%, while other goods covered by the US-Canada-Mexico Agreement are exempt. That trade agreement is slated for review. Read more from Sky News:Migrant sex offender arrestedTwo arrested over Louvre heist  👉 Follow Trump100 on your podcast app 👈 Mr Trump negotiated the deal in his first term but has since soured on it. The US president and Mr Carney will both attend the ASEAN summit in Malaysia which started on Sunday, but Mr Trump has said he has no intention of meeting Mr Carney there."
    },
    {
        "title": "Start-ups warn Reeves over budget tax bombshell",
        "description": "A lobbying group representing UK start-ups will this week warn Rachel Reeves against a tax raid on limited liability partnerships (LLPs), arguing that it would hit the backers of Britain's most innovative companies.",
        "url": "https://news.sky.com/story/start-ups-warn-reeves-over-budget-tax-bombshell-13458237",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rachel-reeves-birmingham_7057202.jpg?20251021112203",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-26 16:32:00",
        "Headline": "In a letter seen by Sky News, the Startup Coalition will tell the chancellor that imposing employers' NICs on the venture capital sector risked making some fund launches \"commercially unviable\".",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A lobbying group representing UK start-ups will this week warn Rachel Reeves against a tax raid on limited liability partnerships (LLPs), arguing that it would hit the backers of Britain's most innovative companies. Sky News has seen a letter to be sent to the chancellor on Monday, in which the Startup Coalition will argue that imposing employers' National Insurance Contributions (NICs) on venture capital funds could make UK fund launches \"commercially unviable\". Venture capital firms, along with private equity firms, law firms and accountants were alarmed last week by speculation that Ms Reeves was planning to raise close to £2bn by taxing LLPs in this way. Treasury officials are said to be in talks about the move ahead of next month's crucial budget statement.   \"Combined with last year's carried interest reforms, this is the second budget where VC risks collateral damage from policies not designed for it - and the combination of these changes could raise VCs' overall tax burden by around 30%,\" Dom Hallas, executive director of the Startup Coalition, will say in the letter. \"Any additional tax on partnership profits directly reduces the working capital available to investment teams. \"For emerging managers, often operating at or below cost in their early funds, these changes could make UK fund launches commercially unviable. \"For more established funds, they would accelerate an existing trend: partners and decision-makers relocating to other jurisdictions. \"Fewer UK partners mean fewer meetings with British founders, fewer term sheets signed here, and less capital flowing into high-growth British companies.\" Read more:Cutting cash ISA allowance could backfire, MPs warnBe bold with tax hikes or risk 'groundhog day', chancellor told The group's intervention risks embarrassing the chancellor, given her pledge on Friday to \"supercharge innovation\" with a new unit aimed at so-called scale-up companies. Mr Hallas's letter will call on the chancellor to protect venture capital fund structures from new taxes \"while allowing the government to make changes to the wider LLP regime or similar areas\". He will also urge her to \"differentiate [venture capital] from private equity in the tax system, aligning treatment with its public-interest role in innovation\"."
    },
    {
        "title": "Tax hike could lead to higher food prices, supermarkets warn",
        "description": "The UK's largest supermarkets are calling on the chancellor to exclude stores from a new business rates surtax, warning that shoppers will bear the brunt of higher prices.",
        "url": "https://news.sky.com/story/supermarkets-warn-shoppers-could-face-higher-prices-if-business-rates-rise-13457822",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-money-file-generic_7023711.jpg?20250918091333",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-26 02:16:00",
        "Headline": "A letter signed by major retailers warns that shoppers will bear the brunt of higher prices as the sector faces a \"disproportionate tax burden\".",
        "Content": "The UK's largest supermarkets are calling on the chancellor to exclude stores from a new business rates surtax, warning that shoppers will bear the brunt of higher prices. Tesco, Sainsbury's, Marks & Spencer, Waitrose, Morrisons, Asda, Aldi and Lidl are among the stores that have signed a letter addressed to Rachel Reeves, arguing that easing taxes on grocers would help curb food inflation. Industry group the British Retail Consortium (BRC), which organised the letter, said large shops could face higher business rates if included in the government's proposed surtax on properties valued at more than £500,000. Smaller high street firms are expected to benefit from reduced business rates under the government's plans. \"If the industry faces higher taxes in the coming Budget - such as being included in the new surtax on business rates - our ability to deliver value for our customers will become even more challenging, and it will be households who inevitably feel the impact,\" the letter reads.  \"Large retail premises are a tiny proportion of all stores, yet account for a third of retail's total business rates bill - meaning another significant rise could push food inflation even higher.\" The supermarkets are asking Ms Reeves to \"address retail's disproportionate tax burden\", saying that doing so would \"send a strong signal of support for the industry and of the government's commitment to tackling food inflation\". \n                  Start-ups warn Reeves over budget tax bombshell\n                 \n                  Former Bank of England governor Mervyn King criticises potential mansion tax\n                 \n                  Cutting cash ISA allowance could backfire - and make mortgages more expensive, MPs warn \n                 The chancellor is widely expected to raise taxes after bleak economic forecasts and a string of reversals on welfare cuts, which have made it harder for her to stick to her borrowing limits. Read more from Sky News:Retail sales the highest in three years in a surprise to economistsOilfield services group Petrofac board on standby to handle collapse Helen Dickinson, the BRC's chief executive, said: \"Supermarkets are doing everything possible to keep food prices affordable, but it's an uphill battle, with over £7 billion in additional costs in 2025 alone. \"From higher national insurance contributions to new packaging taxes, the financial strain on the industry is immense.\" The Treasury has been contacted for comment."
    },
    {
        "title": "Family of schoolgirl sexually assaulted by wrongly released migrant 'infuriated' by ordeal",
        "description": "The father of the 14-year-old schoolgirl sexually assaulted by Hadush Kebatu says his family feels \"massively let down and infuriated\" by the migrant's accidental release from prison.",
        "url": "https://news.sky.com/story/justice-secretary-highlights-sky-news-reporting-as-he-says-migrant-release-mistake-totally-unacceptable-13458157",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kebatu-finsbury-park_7062803.jpg?20251026151829",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-26 15:37:00",
        "Headline": "Hadush Kebatu, a convicted sex offender, was arrested on Sunday in London's Finsbury Park after spending just under 48 hours at large.",
        "Content": " The father of the 14-year-old schoolgirl sexually assaulted by Hadush Kebatu says his family feels \"massively let down and infuriated\" by the migrant's accidental release from prison. Kebatu, who was found guilty in September of sexually assaulting the girl and a woman in Epping, Essex, was arrested on Sunday morning in London's Finsbury Park after just under 48 hours at large. In a statement read by Epping Forest councillor Shane Yerrell on Sunday evening, the schoolgirl's father said Kebatu being released from HMP Chelmsford due to a system failure was \"unbelievably irresponsible\".   \"Myself and my family feel massively let down and infuriated by HMP Chelmsford, the police, the justice system and our Labour government. They have all failed,\" the statement read. \"Not just us as a family, but they have failed everyone in the country.\" Earlier on Sunday, Justice Secretary David Lammy said an exclusive Sky News interview will be used as part of an independent inquiry into the mistaken release. Speaking to Sky's national correspondent Tom Parmenter, a delivery driver who spoke to Kebatu at HMP Chelmsford described him as being \"confused\" as he was being guided to the railway station by prison staff. The migrant is said to have returned to the prison reception four or five times before leaving the area on a train.  Mr Lammy also said he would make a statement about the incident in parliament on Monday. He said: \"We need to get to the bottom of how this happened and why it happened, and, of course, on behalf of the public, I want to be reassured that it won't continue to happen and that the systems that we put in place, the checks and balances, are there to reassure the public.\" The schoolgirl's father said in the statement that he went to the Chelmsford prison to \"seek some answers\" after learning of Kebatu's accidental release but he was allegedly \"greeted with hostility and complete disregard for anything I said or asked\". The statement said: \"I really hope that nobody else's child has to experience what my daughter has. \"I hope he will be deported immediately, as the longer he was roaming the streets, the more threat he posed to women and children of this country. \"I had to find out from a reporter that my daughter's attacker was accidentally released in the day, then be sent images and videos of him walking around throughout the day before the police even alerted her mother.\"    Police are believed to be questioning Kebatu \"to get to the bottom of what's happened\" and to learn what his movements were between his accidental release from prison on Friday and his arrest. Mr Lammy called his accidental release from prison on Friday \"totally unacceptable\" and said Kebatu will be deported back to Ethiopia this coming week. Sky News understands the deportation will take place on Tuesday. Earlier on Sunday, Sir Keir Starmer said police officers had worked \"quickly and diligently to bring him back into custody\" and that the government had \"ordered an investigation to establish what went wrong\". Read more:Timeline of how manhunt for Hadush Kebatu unfoldedHMP Chelmsford released second person by mistake in 2023  Government has 'serious questions' to answer Opposition parties have said that the government has \"serious questions\" to answer over the incident. Chelmsford's Liberal Democrat MP Marie Goldman called for a \"rapid\" national inquiry, adding: \"The government has serious questions to answer and major work to do to make the system fit for purpose. It certainly isn't at the moment.\"  Speaking on Sunday Morning With Trevor Phillips, Zia Yusuf, Reform's head of policy, said that while he was \"relieved\" Kebatu had been re-arrested, the case was a sign of Britain's \"descent into a Monty Python sketch\". Referring to the earlier Sky News interview with the witness, he said: \"This is a man who the eyewitnesses said was actively trying to go back into prison after being accidentally let go.\" He said the case was \"absolutely shocking\" and questioned how victims of sexual assault could have confidence in the government. It is understood Kebatu, who crossed the Channel in a small boat to enter the UK on 29 June, left prison with an amount of personal money but was not given a discharge grant to cover subsistence costs. He was convicted of two counts of sexual assault, one count of attempted sexual assault, one count of inciting a girl to engage in sexual activity and one count of harassment without violence on 4 September."
    },
    {
        "title": "Former Bank of England governor Mervyn King criticises potential mansion tax",
        "description": "A former Bank of England governor has criticised potential proposals for a mansion tax, saying the government lacks a \"coherent strategy\" on the economy.",
        "url": "https://news.sky.com/story/mansion-tax-not-part-of-coherent-strategy-former-bank-of-england-governor-mervyn-king-says-13458026",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-london-knightsbridge_7062871.jpg?20251026155849",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-26 13:37:00",
        "Headline": "Lord King tells Sunday Morning With Trevor Phillips that ministers are guilty of writing up plans \"on the back of a fag packet\".",
        "Content": " A former Bank of England governor has criticised potential proposals for a mansion tax, saying the government lacks a \"coherent strategy\" on the economy. Chancellor Rachel Reeves is reportedly considering a mansion tax in next month's budget to help fill the multi-billion pound black hole in the public finances. But Lord King told Sunday Morning With Trevor Phillips that he could not identify an economic plan from the government and that adding another wealth tax would not solve the problem with the country's finances. Politics latest: UK in 'despair', warns Streeting - with NHS facing 'cultural challenges'  \"There's plenty of scope for reforming the tax system,\" he said. \"It hasn't, we haven't, seen a chancellor take a strategic look at the tax system for almost 40 years. \"It's been one kind of tinkering after another and that's created a mess - an excessively complex one.\" Last week, Ms Reeves admitted in an interview with Sky News that she was looking at both tax rises and spending cuts in the budget. The Mail On Sunday reported that one proposal being considered was a mansion tax which would hit owners of properties with an annual charge of 1% of the amount by which its value exceeds £2m - meaning a £10,000-a-year levy for homes worth £3m.  But Lord King said: \"Property taxes are an interaction between stamp duty, council tax, capital gains tax, inheritance tax. \"You don't solve that problem by just adding another wealth tax to it.\" The former Bank of England governor said the chancellor needed to look at \"all aspects\" of tax, not just on property, \"to come up with a coherent view to what it should look like\". He said this currently did not happen and that instead ministers tried to match a figure produced by the Office for Budget Responsibility (OBR), the fiscal and economic forecaster, just before the budget.  \"What happens is the OBR produces just before the budget, a number, one number, and then they look round for ideas - almost written on the back of a fag packet - about how you can raise an extra few billion or a few billion there,\" Lord King said. \"That is not a coherent tax strategy. And you could do a great deal by thinking it through first.\" Economists have indicated Ms Reeves will need to find between £20bn and £50bn to meet her goal of balancing day-to-day spending with tax receipts in 2029/30, and at least maintaining her current buffer of around £10bn against that target. The chancellor has hinted this will be more difficult to achieve due to the OBR downgrading its assessment of productivity growth. Another measure the chancellor is reportedly considering to accumulate extra revenue is a 2p hike to income tax - as reported by The Sun On Sunday. Read more:Reform UK's Zia Yusuf defends MP accused of 'racism'Twenty warnings for Sir Keir Starmer from new deputy leader The move would breach Labour's manifesto pledge not to increase national insurance, VAT and income tax. Asked whether Labour was unwise to stick with those general election promises on tax, Lord King said: \"Very unwise. \"I think the previous government was irresponsible to cut national insurance contributions when that was only remotely feasible, given unrealistic projections for public spending. \"And I think the Opposition didn't need to make a commitment not to reverse that. \"And honestly, I think that would be much better now just to say to people, 'this is where we are'. \"Be completely straight with people say, 'yeah, we made that pledge in the heat of an electoral battle, it was a mistake, we regret it, and we're going to unwind that'.\" In her Sky News interview, Ms Reeves said multiple challenges meant there was a fresh need to balance the books. She added: \"Of course, we're looking at tax and spending as well, but the numbers will always add up with me as chancellor because we saw just three years ago what happens when a government, where the Conservatives, lost control of the public finances: inflation and interest rates went through the roof.\" The Treasury has been approached for comment."
    },
    {
        "title": "Migrant sex offender release: A colossal reputational repair job is desperately needed after Kebatu debacle",
        "description": "Shoulders will have begun to fall in Number 10 today after the news broke that the convicted sex offender somehow released in error has been arrested and is back in custody.",
        "url": "https://news.sky.com/story/migrant-sex-offender-release-a-colossal-reputational-repair-job-is-desperately-needed-after-kebatu-debacle-13458025",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-starmer-labour_7062767.jpg?20251026145417",
        "type": "Politics",
        "Author": "Mhari Aurora",
        "Date Published": "2025-10-26 13:39:00",
        "Headline": "Hadush Kebatu's mistaken release is bad news for Sir Keir Starmer, but it also speaks to a wider problem in the creaking criminal justice system.",
        "Content": "\n          Political correspondent\n              @MhariAurora\n Shoulders will have begun to fall in Number 10 today after the news broke that the convicted sex offender somehow released in error has been arrested and is back in custody. But whether Hadush Kebatu is behind bars or not, and whether he is deported or not, the political damage has been done. According to government figures from July, 262 prisoners were released in error in England and Wales between March 2024 and March 2025, up from 115 the previous year, a 128% increase. And there are several previous incidences of dangerous sex attackers being mistakenly released from prison and then going on to attack other women while still at large - just google William Fernandez or Joseph McCann.  Live updates on the arrest There is no suggestion he's committed major offences while he was freed, but the judge in his trial said there was a risk of him reoffending - making it all the more concerning he was released accidentally. Despite being a shocking and almost unbelievable turn of events - if you pitched this storyline you'd be laughed out the room for it being so far-fetched - these kinds of mistakes are far too common and speak to a wider problem in the creaking criminal justice system. Senior government sources admit to me that not only was this saga incredibly embarrassing for government, but it also feeds a narrative that Britain isn't working and the state cannot fulfil basic functions.  Read more:Kebatu is second person freed by mistake from HMP ChelmsfordWrongly-released migrant 'tried to return to prison 4 or 5 times' And it is this impression of state incompetency and political failure that reflects so poorly on Starmer's premiership when he promised an end to Tory chaos and to bolster and improve public services… prison system included. With 14 years in power, there is no denying the state of the prison system in the UK is the responsibility of the Conservative Party too. But the public want to see action now, and it is the Labour Party that is in government. And with small boats crossings at record levels this year already, a migrant sent to France on the one-in-one-out scheme coming back on a small boat for the second time, and a convicted sex offender on the loose for two days, a colossal reputational repair job is desperately needed. It took 48 hours to find Kebatu. It will take far longer to convince the public this government has a grip on public services and can be trusted to keep us all safe."
    },
    {
        "title": "Starmer says migrant sex offender will be deported - as prison error likened to 'Monty Python sketch'",
        "description": "The prime minister has said the migrant who was mistakenly released from prison and found again will be deported following an error that Reform UK likened to a \"Monty Python sketch\".",
        "url": "https://news.sky.com/story/starmer-says-migrant-sex-offender-will-be-deported-as-prison-error-likened-to-monty-python-sketch-13457924",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-hadush-kebatu-epping_7029360.jpg?20251025080729",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-26 10:34:00",
        "Headline": "Hadush Kebatu was arrested in London on Sunday morning following his erroneous release on Friday which sparked a manhunt for the convicted sex offender.",
        "Content": " The prime minister has said the migrant who was mistakenly released from prison and found again will be deported following an error that Reform UK likened to a \"Monty Python sketch\". Sir Keir Starmer said police officers had worked \"quickly and diligently to bring him back into custody\" and that the government had \"ordered an investigation to establish what went wrong\". Politics latest: UK in 'despair', warns Streeting Hadush Kebatu, who was found guilty in September of sexually assaulting a 14-year-old girl and a woman in Epping, was freed in error from HMP Chelmsford in Essex on Friday instead of being handed over to immigration officials for deportation. His accidental release sparked widespread alarm and a manhunt that resulted in him being found and arrested by the Metropolitan Police in the Finsbury Park area of London at around 8.30am on Sunday. The incident has sparked questions over how the man - whose crimes sparked protests in Epping over the use of asylum hotels - was able to be freed. Opposition parties have said the government has \"serious questions\" to answer over the incident.  Speaking on Sunday Morning with Trevor Phillips, Zia Yusuf, Reform's head of policy, said that while he was \"relieved\" Kebatu had been re-arrested, the case was a sign of Britain's \"descent into a Monty Python sketch\". He referred to a Sky News report detailing how the wanted migrant spoke to a delivery driver at Chelmsford prison and appeared \"confused\" at why he had been released. \"This is a man who the eyewitnesses said was actively trying to go back into prison after being accidentally let go,\" Mr Yusuf said. He said the case was \"absolutely shocking\" and questioned how victims of sexual assault could have confidence in the government. Chris Philp, the shadow home secretary, said Kebatu should \"never have been released in the first place\" and called on the home secretary and justice secretary to apologise. Pressed on the state of the prison system during the Conservatives' 14 years in power, Mr Philp said: \"They've been in charge now for almost a year and a half, so I think they do have to take responsibility for the system. \"This failing with the release of this man by accident happened under the Labour government and, as I say, I think the justice secretary and home secretary should apologise.\"  Their concerns were echoed by Marie Goldman, the Liberal Democrat MP for Chelmsford, who told Sky News the incident was a sign of \"systemic failure\". She said she had spoken to the prison service and had been told to expect the initial findings into what went wrong \"pretty quickly\". \"We had figures from His Majesty's Prison Probation Service saying that 262 prisoners were released in error in the year leading to March of this year,\" she said. \"That shows that it's a systemic failure. This is happening all over the country.\" Read more:Timeline of how manhunt for Hadush Kebatu unfolded20 warnings for Sir Keir Starmer from new deputy leader Commander James Conway praised the \"diligent and fast paced investigation\" that led to Kebatu's arrest and revealed it was information from the public that led officers to Finsbury Park, where he was discovered. Speaking on Sky News before Kebatu was found, Health Secretary Wes Streeting told Trevor Phillips that Justice Secretary David Lammy had commissioned an investigation into what had gone wrong. \"We know that one prison officer has been suspended already, but there does need to be accountability for such an egregious failure,\" he added."
    },
    {
        "title": "Reform UK's Zia Yusuf defends MP accused of 'racism'",
        "description": "Reform UK has defended one of its MPs who has been accused of \"racism\" after she complained about the number of black and Asian people in TV adverts.",
        "url": "https://news.sky.com/story/reform-uks-zia-yusuf-defends-mp-accused-of-racism-13457993",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sarah-pochin-conference_6969831.jpg?20251026135425",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-26 12:42:00",
        "Headline": "The party is being urged to take action against Sarah Pochin who was forced to apologise after she said \"it drives me mad when I see adverts full of black people, full of Asian people\".",
        "Content": "Reform UK has defended one of its MPs who has been accused of \"racism\" after she complained about the number of black and Asian people in TV adverts. Zia Yusuf, Reform UK's head of policy, described Sarah Pochin as a \"close friend\" and \"great MP\", and acknowledged she had made the \"poorly phrased\" comments and had apologised. However, speaking on Sunday Morning with Trevor Phillips, he said her comments had to be \"put into context\", adding people must be able to \"talk about\" representation in television advertising. Mr Yusuf said he believed the Talk TV caller who Ms Pochin was in conversation with was \"right to be upset about the massive under-representation of some groups in television advertising and significant overrepresentation of others - and we have to be able to talk about these things\". He added: \"I think is a very valid point. We must be able to talk about it.\"  Ms Pochin, the Reform MP for Runcorn and Helsby, is under fire after telling the viewer it \"drives me mad when I see adverts full of black people, full of Asian people\". She said such adverts did not \"reflect our society\" and added: \"I feel that your average white person, average white family is… not represented any more.\" Politics latest: UK in 'despair', warns Streeting Ms Pochin has since apologised for her comments, but Health Secretary Wes Streeting said her comments were \"a disgrace\" and hit out at Reform UK's leader Nigel Farage for not rebuking her. The Liberal Democrats have demanded that she lose the party whip, which would force her to sit as an independent MP in the Commons. In a statement issuing her apology, Ms Pochin said: \"My comments were phrased poorly, and I apologise for any offence caused, which was not my intention. \"The point I was trying to make is that the British advertising agency world have gone DEI [diversity, equity and inclusion] mad and many adverts are now unrepresentative of British society as a whole. \"I will endeavour to ensure my language is more accurate going forward.\" Max Wilkinson, the Liberal Democrat home affairs spokesperson, said her apology was \"nothing more than a shameless attempt to dodge responsibility for her own words\". \"Instead of showing a shred of remorse, she's doubled down and tried to excuse the inexcusable,\" he said. \"Nigel Farage keeps insisting that racism has no place in his party. Now is his chance to prove it - he must withdraw the whip or concede that Reform tolerates blatant racism.\" Read more:Prison error likened to 'Monty Python sketch'Caerphilly result likened to Hartlepool by-election loss Mr Streeting also condemned Ms Pochin's comments, telling the BBC's Sunday with Laura Kuenssberg: \"She's only sorry that she's been caught and called out. \"What we have seen on our streets in recent weeks and months is a return of 1970s, 1980s-style racism that I thought we had left in the history books. \"The only way we are going to defeat this racism is to call it out and confront it for what it is \"The deafening silence from her party leader says it all.\"  Earlier this year, Ms Pochin sparked controversy when she asked Prime Minister Sir Keir Starmer whether he would follow the lead of some European countries in banning the burka. Mr Yusuf resigned from the party later that day, but subsequently rejoined."
    },
    {
        "title": "'Terrible' Caerphilly result akin to Hartlepool by-election loss, says Wes Streeting",
        "description": "The health secretary has compared the collapse of Labour's vote in the Caerphilly by-election to the party's defeat in Hartlepool in 2021 - when Sir Keir Starmer considered resigning as leader.",
        "url": "https://news.sky.com/story/terrible-caerphilly-result-akin-to-hartlepool-by-election-loss-says-wes-streeting-13457867",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lindsay-whittle-plaid-cymru_7060349.jpg?20251024110938",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-26 08:54:00",
        "Headline": "The health secretary says the result in Wales suggests the government is not yet delivering  the \"change the public are crying out for\".",
        "Content": " The health secretary has compared the collapse of Labour's vote in the Caerphilly by-election to the party's defeat in Hartlepool in 2021 - when Sir Keir Starmer considered resigning as leader. Wes Streeting described the party's performance in the Senedd seat - where it took just 3,713 votes - as \"terrible\" and said it had to match Labour's response to the Hartlepool by-election defeat. Politics latest: UK in 'despair', warns Streeting Speaking to Sunday Morning with Trevor Phillips, Mr Streeting said the loss of Hartlepool to the Tories while the party was in opposition was a \"shock to Labour's core\" and prompted Sir Keir to \"change the Labour Party with a pace and scale of ambition\" that paved the way for its landslide election victory last year. The prime minister has admitted in several interviews that he considered resigning in the wake of the defeat. Asked whether he was providing \"withering criticism\" of Sir Keir and the direction of his government, Mr Streeting said he was not but acknowledged that the public was \"not yet feeling the change\" Labour had promised. \"If I have one criticism of us collectively as a team, we are not telling a compelling enough story about who we are, who we're for and what it is we are driving to do,\" he said. \"Take that result in Caerphilly on the chin, take it to heart and show the same level of ambition and drive and the scale of change within government that the public are crying out for.\"  Support for Labour in the Welsh town of Caerphilly slumped in the by-election on Thursday, where it came in third place behind winners Plaid Cymru, who won with 15,960 votes. While a defeat was denied to Reform UK, which came second with 12,113 votes, the result has prompted fear within Labour ranks that it is losing support to rival left-wing parties as well as those on the right. The result, which Sir Keir admitted was \"bad\" and \"disappointing\", came during another challenging week for the prime minister. On Saturday Lucy Powell, the former Commons leader who was sacked by Sir Keir in his most recent reshuffle, was elected Labour deputy leader in what has been interpreted as a repudiation of the prime minister's leadership.  And the day before, a nationwide manhunt was triggered after Hadush Kebatu, an Ethiopian migrant who was jailed for 12 months in September for sexually assaulting a 14-year-old girl and a woman in Essex, was accidentally released from HMP Chelmsford. The Metropolitan Police has confirmed it has now found Kebatu - whose crimes sparked protests outside the asylum hotel in Epping where he was staying - and that he was arrested in the Finsbury Park area of London at around 8.30am on Sunday morning. Read more:20 warnings for Sir Keir Starmer from new deputy leader Mr Streeting said there needed to be accountability for the \"egregious failure\" which resulted in Kebatu's release. He said he agreed the incident was an example of \"state failure\" that played into the \"sense of despair\" felt across the country about the state of the country's public services. \"There is a deep disillusionment in this country at the moment and, I'd say, growing sense of despair about whether anyone is capable of turning this country around,\" he said. \"Now, I am an optimist in politics. I think there are green shoots of recovery in the NHS, in the economy, in our public services, but there is also so much more to do and we've got to attack those challenges with the level of energy and focus that the scale of the challenge demands.\""
    },
    {
        "title": "Prosecutor furious as news leaks of Louvre heist gang arrests",
        "description": "Two men have been arrested following a robbery at the Louvre museum in Paris which saw thieves escape with priceless jewellery, including part of the French crown jewels.",
        "url": "https://news.sky.com/story/louvre-heist-two-arrested-after-robbery-at-paris-museum-french-media-13457886",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-louvre-heist_7059449.jpg?20251023133723",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-26 09:08:00",
        "Headline": "The audacious intruders entered the world-famous museum via a basket lift using a platform mounted on a lorry, breaking a window and making off with priceless French crown jewels.",
        "Content": " Two men have been arrested following a robbery at the Louvre museum in Paris which saw thieves escape with priceless jewellery, including part of the French crown jewels. Confirming arrests had been made on Saturday night, French public prosecutor Laure Beccuau appeared furious with the way the arrests were announced. She said: \"I deeply deplore the hasty disclosure of this information by informed individuals, without consideration for the investigation. \"This revelation can only harm the investigative efforts of the hundred or so investigators involved in the search for both the stolen jewellery and all the perpetrators.\"  While Ms Beccuau did not confirm the number of arrests, she said one man had been arrested as he was preparing to leave the country from Charles de Gaulle Airport. A second man was arrested on the same evening, also in the Paris region, according to French media. Ms Beccuau did not say whether jewels had been recovered. Both men are originally from Seine-Saint-Denis, a northern suburb of Paris, according to French daily paper Le Parisien. The operation is understood to have been swiftly launched after investigators, who had been monitoring the two individuals for days, realised that one of them was about to flee abroad. French media reported he was set to board a flight to Algeria. Ms Beccuau said it was too early to provide any further details, but would say more at the end of the period of police custody. Commenting on the arrests on social media, France's interior minister Laurent Nunez praised the investigators for \"working tirelessly\" and said \"the investigations must continue while respecting the confidentiality of the inquiry\". The suspects are now in pre-trial detention as part of investigations into the \"organised theft\" and \"criminal conspiracy to commit a crime\". They can be held for up to 96 hours. The men are suspected of being part of the group of criminals who used a cherry picker to reach a window in the Apollo Gallery of the Louvre, smashing display cases and making off with jewels worth £76m. They fled on motorbikes.  One of the world's most famous museums, attracting up to 30,000 visitors a day, the Louvre was forced to close last Sunday morning after thieves accessed a gallery containing the French crown jewels at around 9.30am local time (8.30am UK time). It took them less than eight minutes to steal eight \"priceless\" objects, including sapphire and emerald necklaces, and a diamond brooch containing 2,438 diamonds. A ninth item - the emerald crown of Napoleon III's wife, Empress Eugenie - was stolen but recovered, damaged at the scene. Read more:What will happen to stolen Louvre jewellery?  The Louvre reopened to visitors earlier this week. Sky News has contacted French police for comment."
    },
    {
        "title": "Jon Bon Jovi on bonds, biopics and becoming a grandad",
        "description": "2026 will see Bon Jovi take centre stage once again when they return for their Forever Tour, four years after Jon Bon Jovi's vocal cord surgery had the group's future up in the air.",
        "url": "https://news.sky.com/story/jon-bon-jovi-on-bonds-biopics-and-becoming-a-grandad-13457805",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-bon-jovi-bon-jovi-intv_7062321.jpg?20251026011106",
        "type": "Entertainment",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-10-26 01:09:00",
        "Headline": "Rock ’n’ roll group Bon Jovi is heading to Edinburgh, Dublin and London next year as part of their Forever Tour. Frontman Jon speaks with Sky News about how he’s feeling about getting back on stage.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n  2026 will see Bon Jovi take centre stage once again when they return for their Forever Tour, four years after Jon Bon Jovi's vocal cord surgery had the group's future up in the air. Speaking to Sky News, he says he's \"excited, humble and grateful\" to be back to full health. \"The band and even the crew, they showed me a whole other level of brotherhood and commitment and love for three plus years when, you know, there's no money coming in. And their families are waiting on that. And they never lost faith, which helped me to keep fighting,\" he adds. Starting their European leg of the tour at Murrayfield in Edinburgh on 28 August, the group will then play at Croke Park in Dublin on 30 August before concluding their tour at Wembley Stadium in London on 4 September. It is one of many reasons for the Grammy winner to celebrate recently. His son Jake and his wife, Stranger Things star Millie Bobby Brown, welcomed a baby girl via adoption earlier this year. \"It's crazy, it's a beautiful thing and you feel a responsibility for your kids' kids, and it's beautiful, and the holidays will be that much brighter this year, and we have a second one any day now. If I get the call, my wife is outta here now because the second one's coming next week.\" \n                  Millie Bobby Brown and Jake Bongiovi wedding details revealed\n                 \n                  AI and music: Billie Eilish, Sheryl Crow and Jon Bon Jovi among list of artists demanding more protection\n                 \n                  Bon Jovi: Rock band 'heartbroken' as it announces death of founding member and bassplayer Alec John Such\n                 On Bruce Springsteen Hailing from New Jersey, the 63-year-old has long credited Bruce Springsteen's rise to fame as something that opened the door to other local artists getting record contracts, including him. Now good friends for a few decades, this album marks the first time they blend their voices together on a track. \"We've sung together countless times over the years or had many [drinks], you know, but to actually call him up and have him on one of the records in an official capacity was wonderful. It was great. \"And it's a testament to our friendship. It's a testament to the song. And it's good for the fans too. You know, they wanted to hear it, you know, and a song like that that I'm so proud of as the writer was the right kind of song for me.\" Whether he'll follow in his friend's footsteps and agree to a biopic about his own life is another story. \"No, I have no idea about that. You know, I mean the story of me is still being written,\" he said, adding that he sat side by side with pride watching Springsteen: Deliver Me From Nowhere. \"It's really good. It's at a time in 1982 when I was very much alive and I wrote Runaway that year. I was playing two blocks over from where he was playing with that cover band every Sunday night. In fact, it competed with my playing it, so we would literally close our bar and go because we knew he'd be playing here on Sunday night. \"I mean, it was, I lived it and watching the movie sitting next to him in the movie theatre, kept punching him. We said it's like a time machine. It's a time machine. Because, you know, there was a part of all of our lives growing up in New Jersey and what he meant to or means to all of us.\" Evolving as an artist Best known for his big hits like Livin' On A Prayer, You Give Love A Bad Name and It's My Life, the artist has also written a number of songs reflecting on life in America and pivotal moments in the country like the death of George Floyd, the January 6 Capitol riots, 9/11 and the multiple news stories on gun violence. He says evolving as a songwriter and musician is his top priority for his career. \"I'm a grown man. I'm not chasing pop stardom. I've been doing this for 43 years and the opportunity to write for me is also kind of a way for me to think through a situation. It's soothing sometimes, you know, to work through it. And with an album like 2020, which I became, you know, a narrator while we were all locked down in COVID and no one could play in an arena like [Wembley], you put on your fedora and you become the reporter, and you're writing that story. \"But I loved it as a writer and if I didn't evolve, if I came to you now and say, Hey baby rockin' out we're playing, I would expect you to punch me in the nose. You know, if I didn't evolve. \"You know, people have been on this train with us for these 43 years. Some got off along the way to go and have a life. Others got on at that point and took it to the next destination, and they got off and they went and had a life. So this evolution is a part of my life. And where you get on the train and get off the train is all understood. But you know, the train kept going.\" Read more from Sky News:Lost In Space actress June Lockhart dies aged 100Kim Kardashian diagnosed with brain aneurysm One artist he had hoped to collaborate with on the updated \"Legends Edition\" of the Forever record was Ed Sheeran, after writing Living In Paradise together. On Ed Sheeran \"I wanted him very much on this and that would have been perfect. But Ed and I discussed it immediately and he said, I've done too many things. I need to put my record out before I can do anything else. And I said, 'alright, you little brat, it's fine'. But no, I love him.\" Regarding whether we may see Sheeran or another one of his collaborators show up at one of his upcoming concerts, he says, smiling: \"Who knows? Who knows who's in town on the day?\" Tickets for the Forever tour dates in Dublin, Edinburgh and London go on sale on Friday, 31 October."
    }
]