[
    {
        "title": "Trump could meet Putin as early as next week to discuss Ukraine ceasefire - White House official",
        "description": "Donald Trump could meet Vladimir Putin in person as early as next week to discuss a ceasefire in Ukraine, a White House official has said. ",
        "url": "https://news.sky.com/story/trump-could-meet-putin-as-early-as-next-week-to-discuss-ukraine-ceasefire-white-house-official-13407912",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-vladimir-putin_6921976.jpg?20250520080739",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-06 20:30:00",
        "Headline": "The official said the meeting would be conditional on the Russian president meeting his Ukrainian counterpart Volodymyr Zelenskyy, Sky News's US partner network NBC News reported.",
        "Content": " Donald Trump could meet Vladimir Putin in person as early as next week to discuss a ceasefire in Ukraine, a White House official has said.  They said the meeting would be conditional on the Russian president meeting his Ukrainian counterpart Volodymyr Zelenskyy, Sky News's US partner network NBC News reported. It came days before the White House's deadline for Russia to reach a peace deal with Ukraine or face severe economic penalties, which could also target countries buying its oil. Ukraine war latest Asked during a news conference at the White House if the talks would take place, Mr Trump said: \"There's a very good prospect that they will.\" He said it had not been determined where the talks would take place, but added: \"We had some very good talks with President Putin today.\" However, he said: \"I've been disappointed before with this one.\" Asked if Mr Putin made any kind of concession to lead to the development, Mr Trump did not give much away, but added: \"We've been working on this a long time. There are thousands of young people dying, mostly soldiers, but also, you know, missiles being hit into Kyiv and other places.\" US correspondent Seven hours is a long time in US politics. At 10am, Donald Trump accused Russia of posing a threat to America's national security. At 5pm, Trump said there was a \"good prospect\" of him meeting Vladimir Putin \"soon\". There had, he claimed, been \"great progress\" in talks between his special envoy Steve Witkoff and the Russian president. It's difficult to gauge the chances of a meeting between the two leaders without knowing what \"great progress\" means. Is Russia \"inclined\" towards agreeing a ceasefire, as Ukraine's president now claims? Is Putin prepared to meet with his Ukrainian foe Volodymyr Zelenskyy, too? The very fact that we're asking those questions suggests something shifted on a day when there was no expectation of breakthrough. Trump repeatedly vowed to end the war within 24 hours of becoming president. On day 198 of his presidency, he might, just might, be one step closer to achieving that. More tariffs 'could happen' Mr Trump also said he could announce further tariffs on China similar to the 25% he announced on India over its purchases of Russian oil. \"Could happen,\" he said, after saying he expected to announce more secondary sanctions intended to pressure Russia into ending its war with Ukraine. Earlier, he imposed an additional 25% tariff on Indian goods, on top of a previous 25% tariff, over its continued purchases of Russian oil. India's foreign ministry spokesperson said the additional tariffs were \"unfair, unjustified and unreasonable\". It came after Mr Putin held talks with Mr Trump's special envoy Steve Witkoff in Moscow, with the meeting lasting around three hours. In a post on Truth Social, Mr Trump said Mr Witkoff \"had a highly productive meeting\" with Mr Putin in which \"great progress was made\". He said he had updated America's European allies, and they will work towards an end to the Russia-Ukraine war \"in the days and weeks to come\".  'The war must end' Mr Zelenskyy later said he and Mr Trump spoke on the phone after the meeting. He said \"European leaders also participated in the conversation\" and \"we discussed what was said in Moscow\". He added: \"Our common position with our partners is absolutely clear: The war must end. We all need lasting and reliable peace. Russia must end the war that it started.\" Mr Zelenskyy later said: \"It seems that Russia is now more inclined to agree to a ceasefire.\" He added that the pressure on Moscow \"is working\", without elaborating, and stressed it was important to make sure Russia does not \"deceive us or the United States\" when it comes to \"the details\" of a potential agreement."
    },
    {
        "title": "Woman told she may have to lose leg to stay alive after liquid Brazilian butt lift",
        "description": "A woman from Bolton whose daughter nearly died after a liquid BBL (Brazilian butt lift) procedure says she is \"disappointed and upset\" that plans to regulate the aesthetics industry could take years to become law.",
        "url": "https://news.sky.com/story/woman-told-she-may-have-to-lose-leg-to-stay-alive-after-liquid-brazilian-butt-lift-13407906",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lancashire-bbl-cosmetic-surgery_6984399.jpg?20250806230432",
        "type": "Home",
        "Author": "Katie Barnfield",
        "Date Published": "2025-08-06 19:40:00",
        "Headline": "A scheme to curb so-called \"cowboy cosmetics\" is planned after procedures including liquid BBLs, involving large amounts of filler being injected into the buttocks, caused patients severe pain, disfigurement, and even death.",
        "Content": "\n          North of England correspondent\n        A woman from Bolton whose daughter nearly died after a liquid BBL (Brazilian butt lift) procedure says she is \"disappointed and upset\" that plans to regulate the aesthetics industry could take years to become law. Warning: This story contains pictures some may find distressing Janet Taylor's daughter, Louise, was told by doctors that they may have to amputate her leg to save her life. She was rushed to hospital for emergency surgery following the 2023 procedure, carried out by a non-medical practitioner. \"The sepsis was spreading fast, down her leg. They were preparing for amputation,\" Ms Taylor said. \"Louise was hysterical at this point. I got a call from her in the morning a few days after the procedure, explaining that she was going to die.\" Louise had travelled from Bolton to Essex to have the procedure. But when she arrived, she was told that the person to whom she had paid her deposit would not be carrying it out. She \"screamed in pain\" during the procedure, Ms Taylor said, and in the days afterwards had severe swelling and became unable to walk. Admitted to A&E, doctors found she had developed sepsis and would need life-saving surgery. Ministers have announced plans to change the law on the highest risk cosmetic procedures, including liquid BBLs, which involve large amounts of filler being injected into the buttocks. Such procedures have caused patients severe pain and disfigurement, and even death. Alice Webb, a 33-year-old mother-of-five, died from complications following a liquid BBL procedure in September. Under new rules, only qualified medical professionals will be able to carry them out. Currently, anyone can do them, even those without medical training. The government says any changes will first have to go through a consultation process that will begin next year. For Ms Taylor, that is not fast enough, leaving her \"disappointed, annoyed and upset that it's going to take them so long\". \"I'm sure years ago they said the same thing. I just feel it's history repeating itself,\" she said. \"I don't understand - why can't they do it now when there are hundreds of people being affected?\" A licensing scheme for procedures classed as lower risk, like botulinum toxins and lip fillers is part of the plan, drawn up by the Department of Health. The scheme will be managed by local councils, and the government will prioritise regulating high-risk procedures first. These lower-risk procedures can also cause serious complications, however. Last month, Sky News reported on several cases of botulism - a life-threatening illness - being caused by potentially illegal toxins being sold as Botox by non-medical practitioners. Campaign groups and medical organisations have welcomed the plans. Read more from Sky News:Trump could meet Putin next weekZoo feeds lions with baboons it killed Ashton Collins, director of Save Face, which campaigns for greater aesthetics regulation, said it was \"delighted\" by the move. \"I think this is the right way,\" said Ms Collins. \"They've taken on board the campaigning we have done over the last two years, warning about the highest risk treatments that are now being routinely performed on the high street. \"We warned in 2023 that there would be deaths without action. Unfortunately, that happened last year. So we are delighted that they are now restricting who can and can't do these surgical-type procedures.\" Health minister Karin Smyth said the cosmetics industry had been plagued by \"a Wild West of dodgy practitioners and procedures. There are countless horror stories of cosmetic cowboys causing serious, catastrophic damage\". She said the government's Plan for Change will \"protect those seeking treatments, support honest and competent practitioners, and root out the cowboys\". Ms Smyth added: \"This isn't about stopping anyone from getting treatments - it's about preventing rogue operators from exploiting people at the expense of their safety and keeping people safe. \"We're giving them peace of mind and reducing the cost to the NHS of fixing botched procedures.\""
    },
    {
        "title": "Diane's husband was killed by a reckless driver - the wait for justice was almost as painful",
        "description": "Diane Gall's husband, Martyn, had been out on a morning bike ride with his friends on their usual route one winter morning in November 2020 - when he was killed by a reckless driver.&#160;",
        "url": "https://news.sky.com/story/dianes-husband-was-killed-by-a-reckless-driver-the-wait-for-justice-was-almost-as-painful-13407838",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-diane-gall_6984267.png?20250806171107",
        "type": "Home",
        "Author": "Ashna Hurynag, Daniel Dunford and Eve Bennett ",
        "Date Published": "2025-08-06 15:41:00",
        "Headline": "Exclusive data collected for Sky News reveals widespread scepticism among lawyers about proposed reforms to the justice system, as families face years-long waits for justice amid huge backlogs in the courts.",
        "Content": "By Ashna Hurynag, Daniel Dunford and Eve Bennett    Diane Gall's husband, Martyn, had been out on a morning bike ride with his friends on their usual route one winter morning in November 2020 - when he was killed by a reckless driver.  Diane and her daughters had to wait almost three years for her husband's case to be heard in court. The case was postponed three times, often without warning. \"You just honestly lose faith in the system,\" she says. \"You feel there's a system there that should be there to help and protect victims, to be victims' voices, but the constant delays really take their toll on individuals and us as a family.\" The first trial date in April 2022 was cancelled on the day and pushed four months later. The day before the new date, the family were told it wasn't going ahead due to the barristers' strike. It was moved to November 2022, then postponed again, before eventually being heard in June the following year. \"You're building yourself up for all these dates, preparing yourself for what you're going to hear, reliving everything that has happened, and it's retraumatising,\" says Diane. 'Radical' reform needed Diane's wait for justice gives us an insight into what thousands of victims and their families are battling every day in a court system cracking under the weight of a record-high backlog. There are 76,957 cases waiting to be heard in Crown Courts across England and Wales, as of the end of March 2025. To relieve pressure on the system, an independent review by Sir Brian Leveson last month made a number of recommendations - including creating a new division of the Crown Court known as an intermediate court, made up of a judge and two magistrates, and allowing defendants to choose to be tried by judge alone. He said only \"radical\" reform would have an impact.  But according to exclusive data collected for Sky News by the Law Society, there is strong scepticism among the industry about some proposed plans. Before the review was published, we asked 545 criminal lawyers about the idea of a new tier to the Crown Court - 60% of them told us a type of Intermediate Court was unlikely to reduce the backlog. \"It's moving a problem from one place to another, like moving the deck chairs on the Titanic. It's not going to do anything,\" says Stuart Nolan, chair of the Law Society's criminal law committee. \"I think the problem with it is lack of resources or lack of will to give the proper resources. \"You can say we need more staff, but they're not just any staff, they are people with experience and training, and that doesn't come quickly or cheap.\" Instead, the lawyers told us creating an additional court would harm the quality of justice. Chloe Jay, senior partner at Shentons Solicitors, agrees the quality of justice will be impacted by a new court division that could sit without a jury for some offences. She says: \"The beauty of the Crown Court is that you have two separate bodies, one deciding the facts and one deciding law. \"So the jury doesn't hear the legal arguments about what evidence should be excluded, whether something should be considered as part of the trial, and that's what really gives you that really good, sound quality of justice, because you haven't got one person making all the decisions together. \"Potentially in an intermediate court, that is what will happen. The same three people will hear those legal arguments and make the finding of guilt or innocence.\" The most striking finding from the survey is that 73% of criminal lawyers surveyed are worried about offences no longer sitting in front of a jury. Casey Jenkins, president of London Criminal Court Solicitors' Association, says this could create unconscious bias. \"There's a real risk that people from minority backgrounds are negatively impacted by having a trial by a judge and not a jury of their peers who may have the same or similar social background to them,\" she says. \"A jury trial is protection against professional judicial decisions by the state. It's a fundamental right that can be invoked.\" Instead of moving some offences to a new Crown Court tier, our survey suggests criminal lawyers would be more in favour of moving cases to the magistrates instead. Under the Leveson proposals, trials for offences such as dangerous driving, possessing an offensive weapon and theft could be moved out of the Crown Courts. 'Catastrophic consequences' Richard Atkinson, president of the Law Society, says fixing the system will only work with fair funding. \"It's as important as the NHS, it's as important as the education system,\" he says. \"If it crumbles, there will be catastrophic consequences.\" Ms Jenkins agrees that for too long the system has been allowed to fail. \"Everyone deserves justice, this is just not the answer,\" she says. \"It's just the wrong solution to a problem that was caused by chronic, long-term under-investment in the criminal justice system, which is a vital public service. \"The only way to ensure that there's timely and fair justice for everybody is to invest in all parts of the system from the bottom up: local services, probation, restorative justice, more funding for lawyers so we can give early advice, more funding for the police so that cases are better prepared.\" Government vows 'bold and ambitious reform' In response to Sky News' findings, the minister for courts and legal services, Sarah Sackman KC MP, told Sky News: \"We inherited a record and rising court backlog, leaving many victims facing unacceptable delays to see justice done. \"We've already boosted funding in our courts system, but the only way out of this crisis is bold and ambitious reform. That is why we are carefully considering Sir Brian's bold recommendations for long-term change. \"I won't hesitate to do whatever needs to be done for the benefit of victims.\" The driver that killed Diane's husband was eventually convicted. She wants those making decisions about the court system to remember those impacted the most in every case. Every victim and every family. \"You do just feel like a cog in a big wheel that's out of your control,\" she says. \"Because you know justice delayed is justice denied.\""
    },
    {
        "title": "Zoo staff face death threats for feeding baboon remains to lions",
        "description": "Staff at a zoo in Germany which culled 12 baboons and fed some of their carcasses to the lions say they have received death threats.",
        "url": "https://news.sky.com/story/zoo-staff-face-death-threats-for-feeding-baboon-remains-to-lions-13407865",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lion-baboon_6984482.jpg?20250807004911",
        "type": "Home",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-08-06 17:04:00",
        "Headline": "The director of the German zoo tells Sky News his staff have not just faced death threats, but have also been compared to Nazis.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  Staff at a zoo in Germany which culled 12 baboons and fed some of their carcasses to the lions say they have received death threats. Tiergarten Nuremberg euthanised the healthy Guinea baboons at the end of July due to overcrowding in their enclosure. Some remains were used for research while the rest were fed to the zoo's carnivores. Plans to kill the baboons were first announced last year after the population exceeded 40, and protestors gathered outside the zoo to show their outrage. When the site closed last Tuesday to carry out the cull, several activists were arrested after climbing the fence. The director of the zoo defended the decision, saying efforts to sterilise and rehome some baboons had failed. \"We love these animals. We want to save a species. But for the sake of the species, we have to kill individuals otherwise we are not able to keep up a population in a restricted area,\" Dr Dag Encke told Sky News. 'The staff are suffering' He said police are investigating after he and the staff were sent death threats. \"The staff are really suffering, sorting out all these bad words, insults and threats,\" Dr Encke said. \"The normal threat is 'we will kill you, and we'll feed you to the lions'. \"But what is really disgusting is when they say that's worse than Dr Mengele from the National Socialists, who was one of the most cruel people in human history. \"That is really insulting all the victims of the Second World War and the Nazi regime.\" Josef Mengele was a Nazi officer who performed deadly experiments on prisoners at the Auschwitz concentration camp during the Second World War. Zoo animals 'treated as commodities' Culling animals and feeding them to predators isn't unheard of in zoos. In 2014, Copenhagen Zoo caused controversy by euthanizing an 18-month-old male giraffe called Marius and feeding his body to the lions. At the time, the zoo said it was due to a duty to avoid inbreeding. Dr Mark Jones, a vet and head of policy at Born Free Foundation, a charity which campaigns for animals to be kept in the wild, denounced the practice and said thousands of healthy animals are being destroyed by zoos each year. \"It reflects the fact animals in zoos are often treated as commodities that are disposable or replaceable,\" he said. Zoo asks for unwanted pets Earlier this week, a zoo in Denmark faced a backlash for asking for unwanted pets to be donated to be used as food for its predators. In a Facebook post, Aalborg Zoo said it could take smaller live animals such as chickens, rabbits and guinea pigs, as well as horses under 147cm. It said the animals would be euthanised by specially trained staff before being fed to carnivores like the European lynx. While some people supported the scheme, saying they had donated animals in the past, others are outraged. \"The very idea of a zoo offering to take unwanted pets in order to kill them and feed them to their predators will, I think, horrify most right-minded people,\" said Dr Jones. Read more from Sky News:Trump could meet Putin next weekWoman told she may lose leg after BBL Aalborg Zoo has now closed the post to comments and said in a statement: \"For many years at Aalborg Zoo, we have fed our carnivores with smaller livestock. \"When keeping carnivores, it is necessary to provide them with meat, preferably with fur, bones, etc., to give them as natural a diet as possible. \"Therefore, it makes sense to allow animals that need to be euthanised for various reasons to be of use in this way. \"In Denmark, this practice is common, and many of our guests and partners appreciate the opportunity to contribute.\""
    },
    {
        "title": "Trump announces yet more tariffs and praises 'significant step' from Apple",
        "description": "Donald Trump has announced 100% tariffs on computer chips and semiconductors made outside the US.",
        "url": "https://news.sky.com/story/trump-announces-huge-tech-tariffs-and-hails-significant-step-towards-an-ultimate-goal-13407946",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-tim-cook-trump_6984478.jpg?20250806233629",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-06 22:28:00",
        "Headline": "The US president - who memorably once referred to Tim Cook as Tim Apple - has previously criticised the tech boss and his company after it attempted to avoid his China tariffs by shifting iPhone production to India. ",
        "Content": "Donald Trump has announced 100% tariffs on computer chips and semiconductors made outside the US. The move threatens to increase the cost of electronics made outside the US, which covers everything from TVs and video game consoles to kitchen appliances and cars. The announcement came as Apple chief executive Tim Cook said his company would invest an extra $100bn (£74.9bn) in US manufacturing. Soon, all smartwatch and iPhone glass around the world will be made in Kentucky, according to Mr Cook, speaking from the Oval Office. \"This is a significant step toward the ultimate goal of ensuring that iPhones sold in the United States of America are also made in America,\" said Mr Trump. \"Today's announcement is one of the largest commitments in what has become among the greatest investment booms in our nation's history.\" Mr Cook also presented the president with a one-of-a-kind trophy made by Apple in the US. Trump's tariffs hit India hard Mr Trump has previously criticised Mr Cook and Apple after the company attempted to avoid his tariffs by shifting iPhone production from China to India. The president said he had a \"little problem\" with Apple and said he'd told Mr Cook: \"I don't want you building in India.\" India itself felt Mr Trump's wrath on Wednesday, as he issued an executive order hitting the country with an additional 25% tariff for its continued purchasing of Russian oil. Indian imports into the US will face a 50% tariff from 27 August as a result of the move, as the president seeks to increase the pressure on Russia to end the war in Ukraine. Mr Trump told reporters at the White House he \"could\" also hit China with more tariffs. Read more:Trump could meet Putin as early as next week  Apple's 'olive branch' Apple, meanwhile, plans to hire 20,000 people in the US to support its extra manufacturing in the country, which will total $600bn (around £449bn) worth of investment over four years. The \"vast majority\" of those jobs will be focused on a new end-to-end US silicon production line, research and development, software development, and artificial intelligence, according to the company. Apple's investment in the US caused the company's stock price to hike by nearly 6% in Wednesday's midday trading. The rise may reflect relief by investors that Mr Cook \"is extending an olive branch\" to Mr Trump, said Nancy Tengler, chief executive of money manager Laffer Tengler Investments, which owns Apple stock."
    },
    {
        "title": "British man charged with trying to drown his daughter-in-law in swimming pool on Florida holiday",
        "description": "A British man who allegedly tried to drown his daughter-in-law in a holiday swimming pool in Florida has been charged by police.",
        "url": "https://news.sky.com/story/british-man-charged-with-trying-to-drown-his-daughter-in-law-in-swimming-pool-on-florida-holiday-13407950",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-florida-mark-gibbon_6984481.jpg?20250807003824",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-06 23:33:00",
        "Headline": "\"Because Mr Gibbon couldn't control his anger, he may find himself spending a lot more time in Florida than he had anticipated,\" said the local sheriff.",
        "Content": "A British man who allegedly tried to drown his daughter-in-law in a holiday swimming pool in Florida has been charged by police. Mark Raymond Gibbon, 62, of Beaconsfield, Buckinghamshire, allegedly held the 33-year-old underwater repeatedly after they argued about his grandchildren. He allegedly only stopped when a pair of sisters staying next door called the Polk County sheriff's department. The victim's nine-year-old daughter also allegedly jumped into the pool to stop Gibbon from drowning her mother. The family were staying at a rental home in the Solterra Resort of Davenport, Florida, when the incident occurred on Sunday, according to Sheriff Grady Judd. Officers responded to reports of a disturbance in a pool at around 5.20pm local time. Read more on Sky News:UK airport reopens after plane incidentReeves told big tax rises neededHiroshima survivor's warning, 80 years on \"It's great that Polk County draws visitors from all across the world, but we expect vacationers to behave while they visit with us, just as we expect our lifelong residents to do the same,\" said the sheriff. \"Because Mr Gibbon couldn't control his anger, he may find himself spending a lot more time in Florida than he had anticipated.\" Gibbon was arrested and taken to Polk County Jail, where he was charged with attempted second-degree murder and battery."
    },
    {
        "title": "Ban asylum seekers who work illegally from gaining refugee status, Tories say",
        "description": "Asylum seekers who work in the UK without permission should be placed \"on the next plane home\", Tory leader Kemi Badenoch has said.",
        "url": "https://news.sky.com/story/ban-asylum-seekers-who-work-illegally-from-gaining-refugee-status-tories-say-13407886",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-france-gravelines-coast-guard_6966790.jpg?20250805144234",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-06 18:03:00",
        "Headline": "The Conservatives say the UK's informal working market is acting as a \"pull factor\" for small boat crossings in the Channel.",
        "Content": " Asylum seekers who work in the UK without permission should be placed \"on the next plane home\", Tory leader Kemi Badenoch has said. Ms Badenoch and her shadow home secretary Chris Philp criticised the UK as being a \"soft touch\" and that illegal working acts as a \"pull factor\" for those making the dangerous journey across the English Channel. While people who have asylum claims that are yet to be processed are not usually allowed to work, if they have been waiting for a year or longer for a decision they can apply for permission to work. Politics latest: PM responds to report suggesting tax rises needed Earlier in the summer, Mr Philp made an unannounced visit to an asylum hotel where he said he found \"clear evidence of illegal working for Deliveroo, Just Eat and Uber Eats\". There are reports that asylum seekers can rent legitimate delivery driver accounts within hours of arriving in the country - skipping employment legality checks. Uber Eats, Deliveroo, and Just Eat have previously told Sky News they are continuing to strengthen the technology they use to remove anyone working illegally. Last month, the Home Office struck an agreement with the firms to equip them with tools to identify patterns of misuse and riders who are not allowed to work in the UK. As part of the deal, the government will share the locations of asylum hotels. 'Rewards illegality, mocks taxpayers' However, the Conservatives have said asylum seekers who are caught working illegally should be barred from becoming a refugee. \"If you come here illegally, take advantage of our asylum system, and then break our laws by illegally working, your asylum claim must be rejected, and you should be on the next plane home,\" Ms Badenoch said. \"Under my leadership, the Conservatives will never allow Britain to become a soft touch for those who think they can break the rules and profit from it.\" She also said illegal working \"rewards illegality, protects perpetrators and mocks hard-working taxpayers\". Read more:Who says what on asylum hotelsFact-checking Farage's Afghan claimsInside crackdown on illegal moped delivery drivers 'Pull factor' Mr Philp added: \"Illegal working is a pull factor sold by smugglers as a reward to break in to our country and cross the Channel. \"That is why we are calling for new action: anyone who plays the system should have their status stripped, wages confiscated, and be deported.\" Yvette Cooper, the home secretary, previously said illegal working \"undermines honest business, exploits vulnerable individuals and fuels organised immigration crime\". She described the Home Office's data-sharing deal as \"decisive action to close loopholes and increase enforcement\", and added it sat alongside \"a 50% increase in raids and arrests for illegal working\". Ministers have also pointed to the Border Security Bill working its way through parliament, which could see companies fined £60,000 for each illegal worker discovered. Last month Angela Eagle, the border security and asylum minister, told Sky News arrests for illegal working were up over the past year by 51% from the year before, to more than 7,000. \"If we find you working, you can lose access to the hotel or the support you have [been] given under false pretences,\" she said. \"We are cracking down on that abuse, and we intend to keep doing so.\""
    },
    {
        "title": "Birmingham Airport runway reopened after 'aircraft incident'",
        "description": "Birmingham Airport has reopened its runway hours after a small plane made an emergency landing.",
        "url": "https://news.sky.com/story/birmingham-airport-runway-shut-after-aircraft-incident-13407796",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-birmingham-airport_6984196.jpg?20250806151427",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-06 13:51:00",
        "Headline": "Police say a small aircraft made an emergency landing and that one person suffered minor injuries.",
        "Content": " Birmingham Airport has reopened its runway hours after a small plane made an emergency landing. Three people from the aircraft, which was carrying two crew members and a passenger, were treated at the scene, with one suffering minor injuries from the incident, which happened at roughly 1.40pm on Wednesday, West Midlands Police said. Other emergency services, including fire and ambulance, attended the scene at the airport's runway.   The airport apologised to passengers for the disruption in a post on X, and said they should check flight details and follow advice from their airlines. It added: \"Our teams have worked as quickly as possible, in line with strict protocols, which must be followed to ensure a safe reopening of the runway following a prolonged closure.\" The number of flights affected and passengers whose journeys have been disrupted has not been confirmed, but at least 11 flights listed on the departures page of the airport's website to destinations across Europe had been cancelled. Transport Secretary Heidi Alexander said there was \"minimal\" disruption at the airport but she understood \"how frustrating\" the situation was for passengers. Travellers have been told to check the status of their flight before coming to the airport, with both check-in and security also temporarily shut. Birmingham Airport first shared that its runway was temporarily closed following the incident at around 2.40pm. In a post on the Birmingham Airport Police X account, the force said: \"We are at Birmingham Airport this afternoon after a small aircraft was involved in an emergency landing at around 1.40pm. \"Officers are among the emergency crews at the scene and one person has been reported to have minor injuries. \"The Civil Aviation Authority has been informed and the airport has suspended operations as an investigation is carried out.\" The airport said in a statement: \"Following an aircraft incident, the runway is temporarily closed. \"We apologise for the inconvenience this will cause. \"We will keep passengers already at the airport informed, and those due to travel later today are advised to check the status of their flight before coming to the airport.\" West Midlands Ambulance Service (WMAS) said it sent Hazardous Area Response Team (HART) paramedics and three paramedic officers, who assessed and discharged three patients from the aircraft. West Midlands Fire Service said on X two of its crews \"stood by to support airport firefighters\" and one remained on scene. Pictures posted online showed a white twin-propeller aircraft lying flat on the runway tarmac. Read more on Sky News:Reeves told big tax rises neededRunway shut after incidentHiroshima survivor's warning, 80 years on Woodgate Aviation said in a statement that one of its Beechcraft fixed-wing aircraft was involved in an emergency landing at Birmingham Airport on Wednesday. \"The turbo-prop aircraft was on a flight to Belfast International Airport when it developed landing gear problems. The aircraft returned to Birmingham and made an emergency landing and the main undercarriage collapsed on touchdown. \"Two crew members and a passenger were on board but were uninjured. \"The aircraft remains on the runway and Woodgate Aviation will be co-operating fully with air accident investigators and airport services. \"We would like to pay tribute to the professionalism of our colleagues and the emergency services at the airport for their prompt action.\" The Air Accidents Investigations Branch (AAIB) said it had started an investigation into the incident. Birmingham Airport is the seventh-largest airport in the UK and the third largest outside London, handling approximately 11.5 million passengers in 2023, according to its website. Home to around 30 airlines, it offers over 130 direct routes and over 450 one-stop destinations."
    },
    {
        "title": "Jess Phillips condemns 'idiot' councils that don't believe they have grooming gang problem",
        "description": "Safeguarding minister Jess Phillips has told Sky News that councils that believe they don't have a problem with grooming gangs are \"idiots\" - as she denied Elon Musk influenced the decision to have a national inquiry on the subject.&#160;",
        "url": "https://news.sky.com/story/jess-phillips-condemns-idiot-councils-that-dont-believe-they-have-grooming-gang-problem-13407809",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jess-phillips-grooming-gangs_6984282.jpg?20250806170642",
        "type": "Home",
        "Author": "Jason Farrell",
        "Date Published": "2025-08-06 14:20:00",
        "Headline": "Safeguarding minister Jess Phillips hits out at some local authorities - and denies Elon Musk's intervention sparked a national inquiry on the issue.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  Safeguarding minister Jess Phillips has told Sky News that councils that believe they don't have a problem with grooming gangs are \"idiots\" - as she denied Elon Musk influenced the decision to have a national inquiry on the subject.  The minister said: \"I don't follow Elon Musk's advice on anything although maybe I too would like to go to Mars. \"Before anyone even knew Elon Musk's name, I was working with the victims of these crimes.\" Politics latest: Starmer responds to report suggesting tax rises needed  Mr Musk had called Ms Phillips a \"rape genocide apologist\" in one of a series of inflammatory posts on X in January and said she should go to jail. Mr Musk, then a close aide of US President Donald Trump, sparked a significant political row with his comments - with the Conservative Party and Reform UK calling for a new public inquiry into grooming gangs. At the time, Ms Phillips denied a request for a public inquiry into child sexual exploitation in Oldham on the basis that it should be done at a local level. But the government announced a national inquiry after Baroness Casey's rapid audit on grooming gangs, which was published in June. Asked if she thought there was, in the words of Baroness Casey, \"over representation\" among suspects of Asian and Pakistani men, Ms Phillips replied: \"My own experience of working with many young girls in my area - yes there is a problem. There are different parts of the country where the problem will look different, organised crime has different flavours across the board. \"But I have to look at the evidence… and the government reacts to the evidence.\" Ms Phillips also said the home secretary has written to all police chiefs telling them that data collection on ethnicity \"has to change\", to ensure that it is always recorded, promising \"we will legislate to change the way this [collection] is done if necessary\". Read more:Chancellor warned 'substantial tax rises' neededMinister admits UK-France migrant returns could be 'frustrated' by legal challenges Operation Beaconport has since been established, led by the National Crime Agency (NCA), and will be reviewing more than 1,200 closed cases of child sexual exploitation. Ms Phillips revealed that at least \"five, six\" councils have asked to be a part of the national review - and denounced councils that believed they don't have a problem with grooming gangs as \"idiots\". \"I don't want [the inquiry] just to go over places that have already had inquiries and find things the Casey had already identified,\" she said. She confirmed that a shortlist for a chair has been drawn up, and she expects the inquiry to be finished within three years. Ms Phillips's comments come after she announced £426,000 of funding to roll out artificial intelligence tools across all 43 police forces in England and Wales to speed up investigations into modern slavery, child sex abuse and county lines gangs. Some 13 forces have access to the AI apps, which the Home Office says have saved more than £20m and 16,000 hours for investigators. The apps can translate large amounts of text in foreign languages and analyse data to find relationships between suspects."
    },
    {
        "title": "Diane's husband was killed by a reckless driver - the wait for justice was almost as painful",
        "description": "Diane Gall's husband, Martyn, had been out on a morning bike ride with his friends on their usual route one winter morning in November 2020 - when he was killed by a reckless driver.&#160;",
        "url": "https://news.sky.com/story/dianes-husband-was-killed-by-a-reckless-driver-the-wait-for-justice-was-almost-as-painful-13407838",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-diane-gall_6984267.png?20250806171107",
        "type": "UK",
        "Author": "Ashna Hurynag, Daniel Dunford and Eve Bennett ",
        "Date Published": "2025-08-06 15:41:00",
        "Headline": "Exclusive data collected for Sky News reveals widespread scepticism among lawyers about proposed reforms to the justice system, as families face years-long waits for justice amid huge backlogs in the courts.",
        "Content": "By Ashna Hurynag, Daniel Dunford and Eve Bennett    Diane Gall's husband, Martyn, had been out on a morning bike ride with his friends on their usual route one winter morning in November 2020 - when he was killed by a reckless driver.  Diane and her daughters had to wait almost three years for her husband's case to be heard in court. The case was postponed three times, often without warning. \"You just honestly lose faith in the system,\" she says. \"You feel there's a system there that should be there to help and protect victims, to be victims' voices, but the constant delays really take their toll on individuals and us as a family.\" The first trial date in April 2022 was cancelled on the day and pushed four months later. The day before the new date, the family were told it wasn't going ahead due to the barristers' strike. It was moved to November 2022, then postponed again, before eventually being heard in June the following year. \"You're building yourself up for all these dates, preparing yourself for what you're going to hear, reliving everything that has happened, and it's retraumatising,\" says Diane. 'Radical' reform needed Diane's wait for justice gives us an insight into what thousands of victims and their families are battling every day in a court system cracking under the weight of a record-high backlog. There are 76,957 cases waiting to be heard in Crown Courts across England and Wales, as of the end of March 2025. To relieve pressure on the system, an independent review by Sir Brian Leveson last month made a number of recommendations - including creating a new division of the Crown Court known as an intermediate court, made up of a judge and two magistrates, and allowing defendants to choose to be tried by judge alone. He said only \"radical\" reform would have an impact.  But according to exclusive data collected for Sky News by the Law Society, there is strong scepticism among the industry about some proposed plans. Before the review was published, we asked 545 criminal lawyers about the idea of a new tier to the Crown Court - 60% of them told us a type of Intermediate Court was unlikely to reduce the backlog. \"It's moving a problem from one place to another, like moving the deck chairs on the Titanic. It's not going to do anything,\" says Stuart Nolan, chair of the Law Society's criminal law committee. \"I think the problem with it is lack of resources or lack of will to give the proper resources. \"You can say we need more staff, but they're not just any staff, they are people with experience and training, and that doesn't come quickly or cheap.\" Instead, the lawyers told us creating an additional court would harm the quality of justice. Chloe Jay, senior partner at Shentons Solicitors, agrees the quality of justice will be impacted by a new court division that could sit without a jury for some offences. She says: \"The beauty of the Crown Court is that you have two separate bodies, one deciding the facts and one deciding law. \"So the jury doesn't hear the legal arguments about what evidence should be excluded, whether something should be considered as part of the trial, and that's what really gives you that really good, sound quality of justice, because you haven't got one person making all the decisions together. \"Potentially in an intermediate court, that is what will happen. The same three people will hear those legal arguments and make the finding of guilt or innocence.\" The most striking finding from the survey is that 73% of criminal lawyers surveyed are worried about offences no longer sitting in front of a jury. Casey Jenkins, president of London Criminal Court Solicitors' Association, says this could create unconscious bias. \"There's a real risk that people from minority backgrounds are negatively impacted by having a trial by a judge and not a jury of their peers who may have the same or similar social background to them,\" she says. \"A jury trial is protection against professional judicial decisions by the state. It's a fundamental right that can be invoked.\" Instead of moving some offences to a new Crown Court tier, our survey suggests criminal lawyers would be more in favour of moving cases to the magistrates instead. Under the Leveson proposals, trials for offences such as dangerous driving, possessing an offensive weapon and theft could be moved out of the Crown Courts. 'Catastrophic consequences' Richard Atkinson, president of the Law Society, says fixing the system will only work with fair funding. \"It's as important as the NHS, it's as important as the education system,\" he says. \"If it crumbles, there will be catastrophic consequences.\" Ms Jenkins agrees that for too long the system has been allowed to fail. \"Everyone deserves justice, this is just not the answer,\" she says. \"It's just the wrong solution to a problem that was caused by chronic, long-term under-investment in the criminal justice system, which is a vital public service. \"The only way to ensure that there's timely and fair justice for everybody is to invest in all parts of the system from the bottom up: local services, probation, restorative justice, more funding for lawyers so we can give early advice, more funding for the police so that cases are better prepared.\" Government vows 'bold and ambitious reform' In response to Sky News' findings, the minister for courts and legal services, Sarah Sackman KC MP, told Sky News: \"We inherited a record and rising court backlog, leaving many victims facing unacceptable delays to see justice done. \"We've already boosted funding in our courts system, but the only way out of this crisis is bold and ambitious reform. That is why we are carefully considering Sir Brian's bold recommendations for long-term change. \"I won't hesitate to do whatever needs to be done for the benefit of victims.\" The driver that killed Diane's husband was eventually convicted. She wants those making decisions about the court system to remember those impacted the most in every case. Every victim and every family. \"You do just feel like a cog in a big wheel that's out of your control,\" she says. \"Because you know justice delayed is justice denied.\""
    },
    {
        "title": "British man charged with trying to drown his daughter-in-law in swimming pool on Florida holiday",
        "description": "A British man who allegedly tried to drown his daughter-in-law in a holiday swimming pool in Florida has been charged by police.",
        "url": "https://news.sky.com/story/british-man-charged-with-trying-to-drown-his-daughter-in-law-in-swimming-pool-on-florida-holiday-13407950",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-florida-mark-gibbon_6984481.jpg?20250807003824",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-06 23:33:00",
        "Headline": "\"Because Mr Gibbon couldn't control his anger, he may find himself spending a lot more time in Florida than he had anticipated,\" said the local sheriff.",
        "Content": "A British man who allegedly tried to drown his daughter-in-law in a holiday swimming pool in Florida has been charged by police. Mark Raymond Gibbon, 62, of Beaconsfield, Buckinghamshire, allegedly held the 33-year-old underwater repeatedly after they argued about his grandchildren. He allegedly only stopped when a pair of sisters staying next door called the Polk County sheriff's department. The victim's nine-year-old daughter also allegedly jumped into the pool to stop Gibbon from drowning her mother. The family were staying at a rental home in the Solterra Resort of Davenport, Florida, when the incident occurred on Sunday, according to Sheriff Grady Judd. Officers responded to reports of a disturbance in a pool at around 5.20pm local time. Read more on Sky News:UK airport reopens after plane incidentReeves told big tax rises neededHiroshima survivor's warning, 80 years on \"It's great that Polk County draws visitors from all across the world, but we expect vacationers to behave while they visit with us, just as we expect our lifelong residents to do the same,\" said the sheriff. \"Because Mr Gibbon couldn't control his anger, he may find himself spending a lot more time in Florida than he had anticipated.\" Gibbon was arrested and taken to Polk County Jail, where he was charged with attempted second-degree murder and battery."
    },
    {
        "title": "Jess Phillips condemns 'idiot' councils that don't believe they have grooming gang problem",
        "description": "Safeguarding minister Jess Phillips has told Sky News that councils that believe they don't have a problem with grooming gangs are \"idiots\" - as she denied Elon Musk influenced the decision to have a national inquiry on the subject.&#160;",
        "url": "https://news.sky.com/story/jess-phillips-condemns-idiot-councils-that-dont-believe-they-have-grooming-gang-problem-13407809",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jess-phillips-grooming-gangs_6984282.jpg?20250806170642",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-08-06 14:20:00",
        "Headline": "Safeguarding minister Jess Phillips hits out at some local authorities - and denies Elon Musk's intervention sparked a national inquiry on the issue.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  Safeguarding minister Jess Phillips has told Sky News that councils that believe they don't have a problem with grooming gangs are \"idiots\" - as she denied Elon Musk influenced the decision to have a national inquiry on the subject.  The minister said: \"I don't follow Elon Musk's advice on anything although maybe I too would like to go to Mars. \"Before anyone even knew Elon Musk's name, I was working with the victims of these crimes.\" Politics latest: Starmer responds to report suggesting tax rises needed  Mr Musk had called Ms Phillips a \"rape genocide apologist\" in one of a series of inflammatory posts on X in January and said she should go to jail. Mr Musk, then a close aide of US President Donald Trump, sparked a significant political row with his comments - with the Conservative Party and Reform UK calling for a new public inquiry into grooming gangs. At the time, Ms Phillips denied a request for a public inquiry into child sexual exploitation in Oldham on the basis that it should be done at a local level. But the government announced a national inquiry after Baroness Casey's rapid audit on grooming gangs, which was published in June. Asked if she thought there was, in the words of Baroness Casey, \"over representation\" among suspects of Asian and Pakistani men, Ms Phillips replied: \"My own experience of working with many young girls in my area - yes there is a problem. There are different parts of the country where the problem will look different, organised crime has different flavours across the board. \"But I have to look at the evidence… and the government reacts to the evidence.\" Ms Phillips also said the home secretary has written to all police chiefs telling them that data collection on ethnicity \"has to change\", to ensure that it is always recorded, promising \"we will legislate to change the way this [collection] is done if necessary\". Read more:Chancellor warned 'substantial tax rises' neededMinister admits UK-France migrant returns could be 'frustrated' by legal challenges Operation Beaconport has since been established, led by the National Crime Agency (NCA), and will be reviewing more than 1,200 closed cases of child sexual exploitation. Ms Phillips revealed that at least \"five, six\" councils have asked to be a part of the national review - and denounced councils that believed they don't have a problem with grooming gangs as \"idiots\". \"I don't want [the inquiry] just to go over places that have already had inquiries and find things the Casey had already identified,\" she said. She confirmed that a shortlist for a chair has been drawn up, and she expects the inquiry to be finished within three years. Ms Phillips's comments come after she announced £426,000 of funding to roll out artificial intelligence tools across all 43 police forces in England and Wales to speed up investigations into modern slavery, child sex abuse and county lines gangs. Some 13 forces have access to the AI apps, which the Home Office says have saved more than £20m and 16,000 hours for investigators. The apps can translate large amounts of text in foreign languages and analyse data to find relationships between suspects."
    },
    {
        "title": "'Deeply loved' father shot dead in Stoke Newington named",
        "description": "A \"deeply loved\" father who was shot dead in north London has been named by police.",
        "url": "https://news.sky.com/story/deeply-loved-father-shot-dead-in-stoke-newington-named-13407937",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-erdal-ozmen-metropolitan-police_6984461.jpg?20250806222730",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-06 21:05:00",
        "Headline": "Erdal Ozmen was found with gunshot injuries by police who were called to an address in north London after midnight on Tuesday.",
        "Content": "A \"deeply loved\" father who was shot dead in north London has been named by police. Erdal Ozmen, 45, was found with gunshot injuries by Metropolitan Police officers who were called to Dynevor Road in Stoke Newington, a little after midnight on Tuesday and was pronounced dead at the scene. Mr Ozmen, was \"a father-of-one and was deeply loved by his family\", Detective Chief Inspector Dave Whellams, who is leading the murder investigation, said.   Appealing to the public, he added: \"Were you in the Dynevor Road area late on Monday night into early Tuesday morning? Did you see anyone acting out of the ordinary? \"Did you hear anything at all which perhaps seemed unusual - maybe people shouting, or a loud vehicle?\" A post-mortem examination has not yet been carried out and Mr Ozmen's family are being supported by specialist officers. The motive for the murder remains unclear, officers said. No arrests have been made. Residents said they woke to the sounds of gunshots. Liza Dodds, 58, a youth worker who lives opposite Dynevor Road, said: \"My husband woke up and said there was gunshots. The instant reaction was 'how do you know?' \"We both got up and had a look. A police officer was doing CPR where the person fell. It seemed like they were going forever.\" Another resident said: \"I heard a few gunshots and the first thing I thought was that it was fireworks, because you don't expect it to be a gun. \"I was trying to sleep but then later I heard sirens from the police cars.\" Read more on Sky News:UK airport reopens after plane incidentReeves told big tax rises neededHiroshima survivor's warning, 80 years on One resident, who asked to remain anonymous, said: \"We were out when it happened so we didn't hear or see anything. \"But when we came back at around 1am, the whole area was cordoned off and the police officers told us that it will be a crime scene for a couple of days.\""
    },
    {
        "title": "Woman told she may have to lose leg to stay alive after liquid Brazilian butt lift",
        "description": "A woman from Bolton whose daughter nearly died after a liquid BBL (Brazilian butt lift) procedure says she is \"disappointed and upset\" that plans to regulate the aesthetics industry could take years to become law.",
        "url": "https://news.sky.com/story/woman-told-she-may-have-to-lose-leg-to-stay-alive-after-liquid-brazilian-butt-lift-13407906",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lancashire-bbl-cosmetic-surgery_6984399.jpg?20250806230432",
        "type": "UK",
        "Author": "Katie Barnfield",
        "Date Published": "2025-08-06 19:40:00",
        "Headline": "A scheme to curb so-called \"cowboy cosmetics\" is planned after procedures including liquid BBLs, involving large amounts of filler being injected into the buttocks, caused patients severe pain, disfigurement, and even death.",
        "Content": "\n          North of England correspondent\n        A woman from Bolton whose daughter nearly died after a liquid BBL (Brazilian butt lift) procedure says she is \"disappointed and upset\" that plans to regulate the aesthetics industry could take years to become law. Warning: This story contains pictures some may find distressing Janet Taylor's daughter, Louise, was told by doctors that they may have to amputate her leg to save her life. She was rushed to hospital for emergency surgery following the 2023 procedure, carried out by a non-medical practitioner. \"The sepsis was spreading fast, down her leg. They were preparing for amputation,\" Ms Taylor said. \"Louise was hysterical at this point. I got a call from her in the morning a few days after the procedure, explaining that she was going to die.\" Louise had travelled from Bolton to Essex to have the procedure. But when she arrived, she was told that the person to whom she had paid her deposit would not be carrying it out. She \"screamed in pain\" during the procedure, Ms Taylor said, and in the days afterwards had severe swelling and became unable to walk. Admitted to A&E, doctors found she had developed sepsis and would need life-saving surgery. Ministers have announced plans to change the law on the highest risk cosmetic procedures, including liquid BBLs, which involve large amounts of filler being injected into the buttocks. Such procedures have caused patients severe pain and disfigurement, and even death. Alice Webb, a 33-year-old mother-of-five, died from complications following a liquid BBL procedure in September. Under new rules, only qualified medical professionals will be able to carry them out. Currently, anyone can do them, even those without medical training. The government says any changes will first have to go through a consultation process that will begin next year. For Ms Taylor, that is not fast enough, leaving her \"disappointed, annoyed and upset that it's going to take them so long\". \"I'm sure years ago they said the same thing. I just feel it's history repeating itself,\" she said. \"I don't understand - why can't they do it now when there are hundreds of people being affected?\" A licensing scheme for procedures classed as lower risk, like botulinum toxins and lip fillers is part of the plan, drawn up by the Department of Health. The scheme will be managed by local councils, and the government will prioritise regulating high-risk procedures first. These lower-risk procedures can also cause serious complications, however. Last month, Sky News reported on several cases of botulism - a life-threatening illness - being caused by potentially illegal toxins being sold as Botox by non-medical practitioners. Campaign groups and medical organisations have welcomed the plans. Read more from Sky News:Trump could meet Putin next weekZoo feeds lions with baboons it killed Ashton Collins, director of Save Face, which campaigns for greater aesthetics regulation, said it was \"delighted\" by the move. \"I think this is the right way,\" said Ms Collins. \"They've taken on board the campaigning we have done over the last two years, warning about the highest risk treatments that are now being routinely performed on the high street. \"We warned in 2023 that there would be deaths without action. Unfortunately, that happened last year. So we are delighted that they are now restricting who can and can't do these surgical-type procedures.\" Health minister Karin Smyth said the cosmetics industry had been plagued by \"a Wild West of dodgy practitioners and procedures. There are countless horror stories of cosmetic cowboys causing serious, catastrophic damage\". She said the government's Plan for Change will \"protect those seeking treatments, support honest and competent practitioners, and root out the cowboys\". Ms Smyth added: \"This isn't about stopping anyone from getting treatments - it's about preventing rogue operators from exploiting people at the expense of their safety and keeping people safe. \"We're giving them peace of mind and reducing the cost to the NHS of fixing botched procedures.\""
    },
    {
        "title": "Ban asylum seekers who work illegally from gaining refugee status, Tories say",
        "description": "Asylum seekers who work in the UK without permission should be placed \"on the next plane home\", Tory leader Kemi Badenoch has said.",
        "url": "https://news.sky.com/story/ban-asylum-seekers-who-work-illegally-from-gaining-refugee-status-tories-say-13407886",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-france-gravelines-coast-guard_6966790.jpg?20250805144234",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-06 18:03:00",
        "Headline": "The Conservatives say the UK's informal working market is acting as a \"pull factor\" for small boat crossings in the Channel.",
        "Content": " Asylum seekers who work in the UK without permission should be placed \"on the next plane home\", Tory leader Kemi Badenoch has said. Ms Badenoch and her shadow home secretary Chris Philp criticised the UK as being a \"soft touch\" and that illegal working acts as a \"pull factor\" for those making the dangerous journey across the English Channel. While people who have asylum claims that are yet to be processed are not usually allowed to work, if they have been waiting for a year or longer for a decision they can apply for permission to work. Politics latest: PM responds to report suggesting tax rises needed Earlier in the summer, Mr Philp made an unannounced visit to an asylum hotel where he said he found \"clear evidence of illegal working for Deliveroo, Just Eat and Uber Eats\". There are reports that asylum seekers can rent legitimate delivery driver accounts within hours of arriving in the country - skipping employment legality checks. Uber Eats, Deliveroo, and Just Eat have previously told Sky News they are continuing to strengthen the technology they use to remove anyone working illegally. Last month, the Home Office struck an agreement with the firms to equip them with tools to identify patterns of misuse and riders who are not allowed to work in the UK. As part of the deal, the government will share the locations of asylum hotels. 'Rewards illegality, mocks taxpayers' However, the Conservatives have said asylum seekers who are caught working illegally should be barred from becoming a refugee. \"If you come here illegally, take advantage of our asylum system, and then break our laws by illegally working, your asylum claim must be rejected, and you should be on the next plane home,\" Ms Badenoch said. \"Under my leadership, the Conservatives will never allow Britain to become a soft touch for those who think they can break the rules and profit from it.\" She also said illegal working \"rewards illegality, protects perpetrators and mocks hard-working taxpayers\". Read more:Who says what on asylum hotelsFact-checking Farage's Afghan claimsInside crackdown on illegal moped delivery drivers 'Pull factor' Mr Philp added: \"Illegal working is a pull factor sold by smugglers as a reward to break in to our country and cross the Channel. \"That is why we are calling for new action: anyone who plays the system should have their status stripped, wages confiscated, and be deported.\" Yvette Cooper, the home secretary, previously said illegal working \"undermines honest business, exploits vulnerable individuals and fuels organised immigration crime\". She described the Home Office's data-sharing deal as \"decisive action to close loopholes and increase enforcement\", and added it sat alongside \"a 50% increase in raids and arrests for illegal working\". Ministers have also pointed to the Border Security Bill working its way through parliament, which could see companies fined £60,000 for each illegal worker discovered. Last month Angela Eagle, the border security and asylum minister, told Sky News arrests for illegal working were up over the past year by 51% from the year before, to more than 7,000. \"If we find you working, you can lose access to the hotel or the support you have [been] given under false pretences,\" she said. \"We are cracking down on that abuse, and we intend to keep doing so.\""
    },
    {
        "title": "Spat between Prince Harry and Sentebale chair appears far from over despite Charity Commission's verdict",
        "description": "It was the most personal fall out: the vicious war of words and the 'he said, she said' of the Sentebale row between chair Sophie Chandauka and Prince Harry really hooking us all in back in April.",
        "url": "https://news.sky.com/story/no-outright-winner-from-charity-commissions-verdict-on-row-between-prince-harry-and-sentebale-chair-13407653",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-harry-sophie_6871303.jpg?20250806071708",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-08-06 08:57:00",
        "Headline": "The role of the Charity Commission was to play adjudicator, to try to assess what had fundamentally gone wrong to cause a catastrophic breakdown at the heart of Sentebale, and the collapse of the relationship between the chair, the patrons and the trustees. ",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  It was the most personal fall out: the vicious war of words and the 'he said, she said' of the Sentebale row between chair Sophie Chandauka and Prince Harry really hooking us all in back in April. But while the Charity Commission has now given everyone involved a significant slap on the wrist for allowing it to play out so publicly, has a line really been drawn under it all? I'm afraid it doesn't feel like it. The role of the Charity Commission was to play adjudicator, to try to assess what had fundamentally gone wrong to cause a catastrophic breakdown at the heart of Sentebale, and the collapse of the relationship between the chair, the patrons and the trustees. In the end there has been no outright winner from the regulator's verdict. All sides are blamed for airing the dirty laundry of this dispute through statements and interviews in the media, including Ms Chandauka's exclusive interview on Sky News, and ultimately allowing it to \"severely\" impact \"the charity's reputation\" and risking \"undermining public trust in charities more generally\". Read more: Prince Harry's charity row explained  Both sides can however reflect on partial victories. It is huge that Harry has been cleared over those allegations of racism or misogyny with no evidence found. Ms Chandauka also remains in place as chair of the charity. But despite the clear criticism from the charity regulator of the point scoring on both sides, this spat appears far from over when you look at the responding statements we've received since the report was released. \n                  Sentebale: Where does 'he said, she said' charity row leave Prince Harry?\n                 \n                  Prince Harry cleared of bullying claims by report into 'damaging dispute' at his charity\n                 \n                  Prince Harry denies having 'physical fight' with Prince Andrew\n                 Ms Chandauka continues to refer to the \"incalculable damage\" done by what she describes as the \"unexpected adverse media campaign\" from Prince Harry and Prince Seeiso. While sources close to Prince Harry are keen that we don't lose sight of how \"devastated\" he is, describing it as \"nothing short of a hostile takeover\" and saying the report \"falls troublingly short in many regards\". The former trustees say they continue to be \"gravely concerned for the future of the charity\". On the charity commission findings Sentebale were keen to add specifically, \"It provides Sentebale with some degree of reassurance that the Charity Commission has not identified widespread bullying within the charity, but the Commission has acknowledged the strong perception of ill treatment felt by a number of parties to the dispute and the impact this may have had on them personally.\" In many ways the strength of feeling isn't surprising when you step back and consider what really matters, the charity itself and its purpose. Ultimately, this was a passion project founded 19 years ago by two men to honour their mothers and help young people in Lesotho with AIDS and HIV who had previously just been left to fend for themselves - a charity that became a huge success and attracted global attention. Sentebale is now under a Regulatory Action Plan, which means they will be monitored by the Charity Commission and further action will be taken if the plan isn't followed. As for Prince Harry and the team around him, I'm told the young people of Lesotho and Botswana, and what he can do around HIV and AIDS, and mental health support, remains \"an absolute priority\", as they try to work out how he can best do that in a meaningful way. For now he must look back at what Sentebale once was, as the charity now moves forward without him."
    },
    {
        "title": "Birmingham Airport runway reopened after 'aircraft incident'",
        "description": "Birmingham Airport has reopened its runway hours after a small plane made an emergency landing.",
        "url": "https://news.sky.com/story/birmingham-airport-runway-shut-after-aircraft-incident-13407796",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-birmingham-airport_6984196.jpg?20250806151427",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-06 13:51:00",
        "Headline": "Police say a small aircraft made an emergency landing and that one person suffered minor injuries.",
        "Content": " Birmingham Airport has reopened its runway hours after a small plane made an emergency landing. Three people from the aircraft, which was carrying two crew members and a passenger, were treated at the scene, with one suffering minor injuries from the incident, which happened at roughly 1.40pm on Wednesday, West Midlands Police said. Other emergency services, including fire and ambulance, attended the scene at the airport's runway.   The airport apologised to passengers for the disruption in a post on X, and said they should check flight details and follow advice from their airlines. It added: \"Our teams have worked as quickly as possible, in line with strict protocols, which must be followed to ensure a safe reopening of the runway following a prolonged closure.\" The number of flights affected and passengers whose journeys have been disrupted has not been confirmed, but at least 11 flights listed on the departures page of the airport's website to destinations across Europe had been cancelled. Transport Secretary Heidi Alexander said there was \"minimal\" disruption at the airport but she understood \"how frustrating\" the situation was for passengers. Travellers have been told to check the status of their flight before coming to the airport, with both check-in and security also temporarily shut. Birmingham Airport first shared that its runway was temporarily closed following the incident at around 2.40pm. In a post on the Birmingham Airport Police X account, the force said: \"We are at Birmingham Airport this afternoon after a small aircraft was involved in an emergency landing at around 1.40pm. \"Officers are among the emergency crews at the scene and one person has been reported to have minor injuries. \"The Civil Aviation Authority has been informed and the airport has suspended operations as an investigation is carried out.\" The airport said in a statement: \"Following an aircraft incident, the runway is temporarily closed. \"We apologise for the inconvenience this will cause. \"We will keep passengers already at the airport informed, and those due to travel later today are advised to check the status of their flight before coming to the airport.\" West Midlands Ambulance Service (WMAS) said it sent Hazardous Area Response Team (HART) paramedics and three paramedic officers, who assessed and discharged three patients from the aircraft. West Midlands Fire Service said on X two of its crews \"stood by to support airport firefighters\" and one remained on scene. Pictures posted online showed a white twin-propeller aircraft lying flat on the runway tarmac. Read more on Sky News:Reeves told big tax rises neededRunway shut after incidentHiroshima survivor's warning, 80 years on Woodgate Aviation said in a statement that one of its Beechcraft fixed-wing aircraft was involved in an emergency landing at Birmingham Airport on Wednesday. \"The turbo-prop aircraft was on a flight to Belfast International Airport when it developed landing gear problems. The aircraft returned to Birmingham and made an emergency landing and the main undercarriage collapsed on touchdown. \"Two crew members and a passenger were on board but were uninjured. \"The aircraft remains on the runway and Woodgate Aviation will be co-operating fully with air accident investigators and airport services. \"We would like to pay tribute to the professionalism of our colleagues and the emergency services at the airport for their prompt action.\" The Air Accidents Investigations Branch (AAIB) said it had started an investigation into the incident. Birmingham Airport is the seventh-largest airport in the UK and the third largest outside London, handling approximately 11.5 million passengers in 2023, according to its website. Home to around 30 airlines, it offers over 130 direct routes and over 450 one-stop destinations."
    },
    {
        "title": "Trump could meet Putin as early as next week to discuss Ukraine ceasefire - White House official",
        "description": "Donald Trump could meet Vladimir Putin in person as early as next week to discuss a ceasefire in Ukraine, a White House official has said. ",
        "url": "https://news.sky.com/story/trump-could-meet-putin-as-early-as-next-week-to-discuss-ukraine-ceasefire-white-house-official-13407912",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-vladimir-putin_6921976.jpg?20250520080739",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-06 20:30:00",
        "Headline": "The official said the meeting would be conditional on the Russian president meeting his Ukrainian counterpart Volodymyr Zelenskyy, Sky News's US partner network NBC News reported.",
        "Content": " Donald Trump could meet Vladimir Putin in person as early as next week to discuss a ceasefire in Ukraine, a White House official has said.  They said the meeting would be conditional on the Russian president meeting his Ukrainian counterpart Volodymyr Zelenskyy, Sky News's US partner network NBC News reported. It came days before the White House's deadline for Russia to reach a peace deal with Ukraine or face severe economic penalties, which could also target countries buying its oil. Ukraine war latest Asked during a news conference at the White House if the talks would take place, Mr Trump said: \"There's a very good prospect that they will.\" He said it had not been determined where the talks would take place, but added: \"We had some very good talks with President Putin today.\" However, he said: \"I've been disappointed before with this one.\" Asked if Mr Putin made any kind of concession to lead to the development, Mr Trump did not give much away, but added: \"We've been working on this a long time. There are thousands of young people dying, mostly soldiers, but also, you know, missiles being hit into Kyiv and other places.\" US correspondent Seven hours is a long time in US politics. At 10am, Donald Trump accused Russia of posing a threat to America's national security. At 5pm, Trump said there was a \"good prospect\" of him meeting Vladimir Putin \"soon\". There had, he claimed, been \"great progress\" in talks between his special envoy Steve Witkoff and the Russian president. It's difficult to gauge the chances of a meeting between the two leaders without knowing what \"great progress\" means. Is Russia \"inclined\" towards agreeing a ceasefire, as Ukraine's president now claims? Is Putin prepared to meet with his Ukrainian foe Volodymyr Zelenskyy, too? The very fact that we're asking those questions suggests something shifted on a day when there was no expectation of breakthrough. Trump repeatedly vowed to end the war within 24 hours of becoming president. On day 198 of his presidency, he might, just might, be one step closer to achieving that. More tariffs 'could happen' Mr Trump also said he could announce further tariffs on China similar to the 25% he announced on India over its purchases of Russian oil. \"Could happen,\" he said, after saying he expected to announce more secondary sanctions intended to pressure Russia into ending its war with Ukraine. Earlier, he imposed an additional 25% tariff on Indian goods, on top of a previous 25% tariff, over its continued purchases of Russian oil. India's foreign ministry spokesperson said the additional tariffs were \"unfair, unjustified and unreasonable\". It came after Mr Putin held talks with Mr Trump's special envoy Steve Witkoff in Moscow, with the meeting lasting around three hours. In a post on Truth Social, Mr Trump said Mr Witkoff \"had a highly productive meeting\" with Mr Putin in which \"great progress was made\". He said he had updated America's European allies, and they will work towards an end to the Russia-Ukraine war \"in the days and weeks to come\".  'The war must end' Mr Zelenskyy later said he and Mr Trump spoke on the phone after the meeting. He said \"European leaders also participated in the conversation\" and \"we discussed what was said in Moscow\". He added: \"Our common position with our partners is absolutely clear: The war must end. We all need lasting and reliable peace. Russia must end the war that it started.\" Mr Zelenskyy later said: \"It seems that Russia is now more inclined to agree to a ceasefire.\" He added that the pressure on Moscow \"is working\", without elaborating, and stressed it was important to make sure Russia does not \"deceive us or the United States\" when it comes to \"the details\" of a potential agreement."
    },
    {
        "title": "Zoo staff face death threats for feeding baboon remains to lions",
        "description": "Staff at a zoo in Germany which culled 12 baboons and fed some of their carcasses to the lions say they have received death threats.",
        "url": "https://news.sky.com/story/zoo-staff-face-death-threats-for-feeding-baboon-remains-to-lions-13407865",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lion-baboon_6984482.jpg?20250807004911",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-08-06 17:04:00",
        "Headline": "The director of the German zoo tells Sky News his staff have not just faced death threats, but have also been compared to Nazis.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  Staff at a zoo in Germany which culled 12 baboons and fed some of their carcasses to the lions say they have received death threats. Tiergarten Nuremberg euthanised the healthy Guinea baboons at the end of July due to overcrowding in their enclosure. Some remains were used for research while the rest were fed to the zoo's carnivores. Plans to kill the baboons were first announced last year after the population exceeded 40, and protestors gathered outside the zoo to show their outrage. When the site closed last Tuesday to carry out the cull, several activists were arrested after climbing the fence. The director of the zoo defended the decision, saying efforts to sterilise and rehome some baboons had failed. \"We love these animals. We want to save a species. But for the sake of the species, we have to kill individuals otherwise we are not able to keep up a population in a restricted area,\" Dr Dag Encke told Sky News. 'The staff are suffering' He said police are investigating after he and the staff were sent death threats. \"The staff are really suffering, sorting out all these bad words, insults and threats,\" Dr Encke said. \"The normal threat is 'we will kill you, and we'll feed you to the lions'. \"But what is really disgusting is when they say that's worse than Dr Mengele from the National Socialists, who was one of the most cruel people in human history. \"That is really insulting all the victims of the Second World War and the Nazi regime.\" Josef Mengele was a Nazi officer who performed deadly experiments on prisoners at the Auschwitz concentration camp during the Second World War. Zoo animals 'treated as commodities' Culling animals and feeding them to predators isn't unheard of in zoos. In 2014, Copenhagen Zoo caused controversy by euthanizing an 18-month-old male giraffe called Marius and feeding his body to the lions. At the time, the zoo said it was due to a duty to avoid inbreeding. Dr Mark Jones, a vet and head of policy at Born Free Foundation, a charity which campaigns for animals to be kept in the wild, denounced the practice and said thousands of healthy animals are being destroyed by zoos each year. \"It reflects the fact animals in zoos are often treated as commodities that are disposable or replaceable,\" he said. Zoo asks for unwanted pets Earlier this week, a zoo in Denmark faced a backlash for asking for unwanted pets to be donated to be used as food for its predators. In a Facebook post, Aalborg Zoo said it could take smaller live animals such as chickens, rabbits and guinea pigs, as well as horses under 147cm. It said the animals would be euthanised by specially trained staff before being fed to carnivores like the European lynx. While some people supported the scheme, saying they had donated animals in the past, others are outraged. \"The very idea of a zoo offering to take unwanted pets in order to kill them and feed them to their predators will, I think, horrify most right-minded people,\" said Dr Jones. Read more from Sky News:Trump could meet Putin next weekWoman told she may lose leg after BBL Aalborg Zoo has now closed the post to comments and said in a statement: \"For many years at Aalborg Zoo, we have fed our carnivores with smaller livestock. \"When keeping carnivores, it is necessary to provide them with meat, preferably with fur, bones, etc., to give them as natural a diet as possible. \"Therefore, it makes sense to allow animals that need to be euthanised for various reasons to be of use in this way. \"In Denmark, this practice is common, and many of our guests and partners appreciate the opportunity to contribute.\""
    },
    {
        "title": "Government ministers among eight killed in Ghana helicopter crash",
        "description": "Ghana's defence and environment ministers are among eight killed when a military helicopter crashed, the government has said.",
        "url": "https://news.sky.com/story/government-ministers-among-eight-killed-in-ghana-helicopter-crash-13407887",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-edward-omane-boamah_6984372.jpg?20250806192531",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-06 18:05:00",
        "Headline": "The West African country's military said the helicopter took off in the morning from the capital Accra and was heading northwest into the interior to the town of Obuasi when it went off the radar.",
        "Content": "Ghana's defence and environment ministers are among eight killed when a military helicopter crashed, the government has said. The West African country's military said the helicopter took off in the morning from the capital Accra and was heading northwest into the interior to the town of Obuasi when it went off the radar. Footage of the crash site shows debris on fire in a forest as people circle around to help.   The cause of the crash was not immediately known. The military said an investigation was under way. Defence minister Edward Omane Boamah and environment minister Ibrahim Murtala Muhammed were killed, along with the vice-chair of the National Democratic Congress ruling party, a top national security adviser and the helicopter's three crew members. Read more from Sky News:Birmingham Airport runway shut after 'aircraft incident'Five soldiers injured in shooting at US Army base State media said the aircraft was a Z-9 helicopter, which is often used for transport and medical evacuation. It was one of the worst air disasters in Ghana in more than a decade. A service helicopter crashed off the coast in May 2014 and killed at least three people. And in 2012 a cargo plane overran the runway in Accra and crashed into a bus full of passengers, killing at least 10 people."
    },
    {
        "title": "The new space race? NASA accelerates plan to put nuclear reactor on the moon",
        "description": "NASA is accelerating plans to put a nuclear reactor on the moon, and they claim it could happen by 2030.",
        "url": "https://news.sky.com/story/the-new-space-race-nasa-accelerates-plan-to-put-nuclear-reactor-on-the-moon-13407804",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-nasa-space-nuclear-reactor_6984211.jpg?20250806153018",
        "type": "World",
        "Author": "Lauren Russell",
        "Date Published": "2025-08-06 14:12:00",
        "Headline": "NASA claimed it would be ready to launch a 100 kilowatt nuclear reactor to the moon by 2030. Sky News asked experts why and how it might work.",
        "Content": "\n          News reporter\n              @laurenvrussell\n NASA is accelerating plans to put a nuclear reactor on the moon, and they claim it could happen by 2030. In a directive - a written or oral instruction issued by the US government - to NASA staff earlier this month, Sean Duffy, US transport secretary and the new interim administrator of the space agency, said it should be ready to launch a 100 kilowatt nuclear reactor in five years. Plans to get a reactor on the lunar surface are not new. The NASA website states the space agency is working on the Fission Surface Power Project to create a system capable of generating at least 40 kilowatts of power - but that is less than half of what Mr Duffy has now proposed. He also stressed the importance of America's space agency deploying the technology before China and Russia. \"To properly advance this critical technology, to be able to support a future lunar economy, high power energy generation on Mars, and to strengthen our national security in space, it is imperative the agency move quickly,\" the directive, which was first reported on by Politico, states. A nuclear reactor on the moon would be considered a key step towards building a permanent base for humans to live on the lunar surface. But Mr Duffy warned that the first country to deploy a reactor \"could potentially declare a keep-out zone\" which he said could significantly inhibit NASA's Artemis mission - the lunar exploration programme which aims to land astronauts back on the moon in 2027. When quizzed about the plan on 5 August, he told reporters: \"We're in a race to the moon, in a race with China to the moon. And to have a base on the moon, we need energy.\" Why use a nuclear reactor? Unlike solar power, which is used on the International Space Station, a small nuclear reactor can operate continuously, Dr Sungwoo Lim, a senior lecturer in space applications, exploration and instrumentation at the University of Surrey told Sky News. This is critical for infrastructure on the moon, which spends two weeks in complete darkness as it slowly orbits the Earth. Nuclear reactors therefore diminish the need for sunlight, and can be used to power life support, communications and other critical science instruments, even in darkness. \"In practice, this means astronauts could use a reactor to establish sustainable bases and extend exploration to places where solar energy is impractical,\" Dr Lim adds, including in the moon's permanently shadowed region, where scientists believe ice water exists. Professor Mike Fitzpatrick, an expert in nuclear technology at Coventry University, adds that the proposal of a 100 kilowatt nuclear reactor, is relatively small compared to most that are built on Earth. To put it in real terms, it takes around three kilowatts to power the kettle in your home. But Prof Fitzpatrick says a smaller reactor could pose as \"demonstrator technology\", something small and compact that makes it easier to transport it to the moon. \"Then you can have a whole array of them,\" he says. So, what’s the catch? While scientists agree that nuclear energy seems like the necessary way to make progress on the moon, Prof Fitzpatrick says questions still remain about safety. \"Shipping the fuel to the moon is relatively safe, because at that point it is not particularly toxic, it is the highly reactive fission products that become the issue,\" he says. \"What's going to be the strategy for long-term storage and disposal on the moon after these plants have operated for certain periods of time? The sooner those conversations are had, and you have international consensus, the less likely it is you'll get future friction.\"  Dr Lim also questioned Mr Duffy's timescale of 2030, saying meeting the target depends heavily on the space agency's budget. NASA's future funding is currently unknown after Donald Trump's 2026 budget request sought a cut of $6bn (£4.5bn) and the termination of dozens of science programs and missions. Over 2,000 agency employees are also set to voluntarily leave NASA in the coming months under the Trump administration's \"deferred resignation\" programme. Is this the new space race? Last year, Russia's space agency Roscosmos said it was planning to build a lunar nuclear reactor alongside China's National Space Administration by 2035, in order to power the International Lunar Research Station (ILRS). The collaboration was never formally announced by China but the joint plan was included in a presentation by Chinese officials in April this year, which outlined the 2028 Chang'e-8 lunar mission which aims to lay the groundwork for the ILRS. \"Duffy explicitly described it as a competition,\" says Dr Lim, adding that the move towards lunar exploration signals a renewed moon or space race among major parties like China, Russia, India and the US to claim strategic lunar territory and technology. Read more:Permission granted for first-of-its-kind British rocket launchAstronauts arrive at International Space Station However, Rossana Deplano a professor of international space law at the University of Leicester, says there is a lot of misunderstanding around \"keep out\" or safety zones, which Mr Duffy's directive mentions. \"Safety zones are explicitly recognised in the Artemis Accords,\" she says. \"They are a notification and consultation zone to be declared in advance in order to avoid harmful interference. \"They must be temporary in nature and do not establish state jurisdiction, e.g. they cannot be enforced.\""
    },
    {
        "title": "If the IDF has nothing to hide with its military and aid operation, it should allow international journalists into Gaza",
        "description": "Escalating Israel's military operation in Gaza to the max - which is reportedly what Israel's prime minister is leaning towards - will stretch an already exhausted army.",
        "url": "https://news.sky.com/story/if-the-idf-has-nothing-to-hide-with-its-military-and-aid-operation-it-should-allow-international-journalists-into-gaza-13407766",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-israel-palestinian_6984003.jpg?20250806104706",
        "type": "World",
        "Author": "Diana Magnay",
        "Date Published": "2025-08-06 12:42:00",
        "Headline": "IDF spokesperson Lieutenant Colonel Nadav Shoshani was reluctant to flesh out the implications of an expanded operation or what a full military \"occupation\" will look like during an interview with Sky News.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n  Escalating Israel's military operation in Gaza to the max - which is reportedly what Israel's prime minister is leaning towards - will stretch an already exhausted army. No wonder Eyal Zamir, Israel's chief of staff, is reportedly reluctant to go down that route, however much of the messaging from the top has been that the Israel Defence Forces (IDF) will follow whatever the political echelon decides. No wonder, then, that IDF spokesperson Lieutenant Colonel Nadav Shoshani was reluctant to flesh out the implications of an expanded operation or what a full military \"occupation\" - touted now as having entered Benjamin Netanyahu's lexicon - will look like.    As he pointed out, Hamas benefits from international outrage over the spectre of famine in Gaza. It turns the tide of public opinion against Israel, taking the pressure off Hamas. That may be, in part, why the latest round of ceasefire talks collapsed. The IDF refuses to accept responsibility for Gaza being on the brink of famine, instead accusing the UN of failing to do their part in an ongoing war of words, although Lt Col Shoshani acknowledged that distributing aid in a war zone is \"not simple\". That is why it should have been left to experts in humanitarian aid distribution - the UN and its agencies, not to US military contractors.  Given the large number of aid-related deaths reported daily, not just by Gaza's health ministry but also by doctors who are treating the injured and tying up the body bags, there should be greater accountability. Lt Col Shoshani said the missing link is the proof that it is IDF soldiers doing the shooting. He is right. If international journalists were granted access to Gaza, to support Palestinian colleagues whose every day involves both the danger of operating in a war zone and the search for food and supplies for their families, then there might be greater accountability. Read more about Gaza:Full Israeli occupation of Gaza could massively backfireRow over checks for Gazans who've earned places at UK unisSky News unveils pattern of deadly Israeli attacks on families It is not sufficient to claim that the IDF operates \"in accordance with our values, with our procedures and with international law\", which is what Lt Col Shoshani told Sky News. That may suffice for Israeli audiences who see very little on their screens of the reality on the ground, but it is not enough for the rest of us - not after 61,000 deaths. If the IDF has nothing to hide, it should allow international journalists in. That would alleviate the burden of reporting on Palestinian journalists, at least 175 of whom have lost their lives since the war began. It would also allow a degree more clarity on what is happening and who is to blame for the hell inside Gaza now. More than 100 journalists, photographers and war correspondents have signed a petition demanding \"immediate and unsupervised foreign press access to the Gaza Strip\". Signatories include Sky News' special correspondent Alex Crawford. They are renewing calls for both Israel and Hamas to allow foreign journalists into Gaza to report independently on the war, something they have been barred from doing since the start of the latest conflict in 2023. The petition goes further to say if \"belligerent parties\" ignore the appeal, media professionals will be supported to enter Gaza without consent \"by any legitimate means, independently, collectively, or in coordination with humanitarian or civil society actors\". Read the full story here."
    },
    {
        "title": "One dead as 'hellish' wildfire burns across area the size of Paris in southern France",
        "description": "One person has died as France's biggest wildfire this summer sweeps through a southern region, forcing tourists and residents to flee.",
        "url": "https://news.sky.com/story/one-dead-as-hellish-wildfire-burns-across-area-the-size-of-paris-in-southern-france-13407794",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-france-wildfire_6984185.jpg?20250806145138",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-06 13:48:00",
        "Headline": "The wildfire remains \"very active\" and is reported to be spreading rapidly through forests and villages. It is the latest in a string of major blazes across southern Europe this summer.",
        "Content": " One person has died as France's biggest wildfire this summer sweeps through a southern region, forcing tourists and residents to flee. Officials called the scenes \"hellish\" after the blaze broke out in Ribaute in the region of Aude, close to the border with Spain. The victim died in their home in the village of Saint-Laurent-de-la-Cabrerisse, about 20 miles north of the city of Perpignan, officials said. Thirteen people have been injured, including 11 firefighters, since the wildfire started on Tuesday, authorities added. One person who was initially feared missing has been located and is safe. The French interior ministry said the fire remains \"very active\" and has already burned across 13,000 hectares (79,000 acres) - an area larger than Paris. At least 25 houses have been burnt down, while many roads have been closed. The blaze was said to be spreading rapidly through forests and villages, forcing residents and tourists to flee. About 2,000 firefighters and several water-bomber aircraft were tackling the blaze. The hot, dry and windy conditions have been making it difficult for firefighters to contain the blaze, officials added. Jacques Piraux, mayor of Jonquieres village, told broadcaster BFM TV: \"It's a scene of sadness and desolation. \"It looks like a lunar landscape, everything is burned. \"More than half or three-quarters of the village has burned down. It's hellish.\" Dutch national Renate Koot, who was on holiday in Saint-Laurent-de-la-Cabrerisse with her partner, said: \"One moment we were on the phone with our children ... thinking, 'look, a fire'. \"The next, we had to jump in the car and leave, while praying for protection. \"We didn't take anything with us and just left. We're okay, miraculously.\" Residents and tourists were advised to remain indoors unless told to evacuate by firefighters. Two campsites have been evacuated as a precaution. Drought conditions in Aude - which is a major wine-producing region - had forced officials to introduce restrictions on the use of water, the environment ministry said. The lack of rainfall in recent months had \"played a major role in the spreading of the fire, since the vegetation is very dry,\" it added. Last month, a wildfire that reached the southern port of Marseille, France's second-largest city, left around 300 people injured. There have also been major wildfires in other parts of the Mediterranean and southern Europe in recent weeks, including in Spain, Crete, Greece and Turkey. Read more:'Apocalyptic' wildfires break out in southeast EuropeTurkey faces 'truly great disaster' over wildfires - Erdogan Europe is the world's fastest-warming continent, with temperatures increasing at twice the speed of the global average since the 1980s, according to the European Union's Copernicus Climate Change Service. Scientists warn that climate change is exacerbating the frequency and intensity of heat and dryness, making the region more vulnerable to wildfires."
    },
    {
        "title": "Rwanda agrees to accept up to 250 migrants from the US",
        "description": "Rwanda has agreed to accept up to 250 migrants from the US in a deal agreed with President Donald Trump's administration.",
        "url": "https://news.sky.com/story/rwanda-agrees-to-accept-up-to-250-migrants-from-the-us-13407743",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-drc-congo-fm_6952272.jpg?20250628005534",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-06 11:51:00",
        "Headline": "A deal with the administration of President Donald Trump followed a similar agreement with the UK, which was ultimately abandoned.",
        "Content": "Rwanda has agreed to accept up to 250 migrants from the US in a deal agreed with President Donald Trump's administration. The decision makes Rwanda the third African country to agree to accept migrants as part of the United States's strategy to relocate migrants to countries with which they have no affiliation, in order to remove them from its territory. The East African nation would be able \"to approve each individual proposed for resettlement\", Rwandan government spokesperson Yolande Makolo said in a statement on Tuesday. Makolo did not provide a timeline for any deportees to arrive in Rwanda and said details were still being worked out.  Under the scheme, the deportees would be provided with work training, health care, and accommodation to start their lives in the new country, according to the Rwandan government. The State Department said the US \"works with Rwanda on a range of mutual priorities\" but did not provide further details on the deportation deal. \n                  Trump could meet Putin as early as next week to discuss Ukraine ceasefire - White House official\n                 \n                  Texas Governor threatens Democrats with arrest after politicians flee to block redistricting vote\n                 \n                  Some tourists and business travellers face up to $15,000 bond to enter US\n                 Last month, the US sent 13 men it described as dangerous criminals who were in the US illegally to South Sudan and Eswatini, saying their home countries refused to take them back. Washington has said it is pursuing additional agreements with African nations.The US has already deported hundreds of Venezuelans and others to Costa Rica, Panama, and El Salvador as part of Donald Trump's efforts to remove people he says entered the country illegally. In March, invoking an 18th century wartime law, the US deported over 200 Venezuelan immigrants to El Salvador, who were immediately sent to a large prison known as the Terrorism Confinement Center, which was originally designed to detain suspected gang members. Human rights groups say they have documented numerous deaths and cases of torture inside the facility.  Rwanda drew global attention and criticism in 2022 when it agreed to a similar deal with the UK. The controversial deal faced criticism from human rights groups and others, who deemed it unethical and impractical. It was eventually abandoned after the Labour government came into power in 2024. Britain's Supreme Court ruled the agreement illegal, stating Rwanda was not a safe third country for migrants. Rwanda, a relatively small nation with a population of around 15 million, has been notable in Africa for its recovery following the 1994 genocide that claimed over 800,000 lives. Under the leadership of longtime President Paul Kagame, the country has marketed itself as a model of stability and progress. However, human rights organisations accuse the government of harsh and sometimes lethal repression of any perceived opposition to Kagame, who has held power for 25 years. But the country's government has said it is welcoming the migrants from the US \"in part because nearly every Rwandan family has experienced the hardships of displacement, and our societal values are founded on reintegration and rehabilitation\"."
    },
    {
        "title": "Italy approves 'world's longest suspension bridge' ",
        "description": "Italy's government has approved the construction of what is tipped to become the world's longest suspension bridge.",
        "url": "https://news.sky.com/story/italy-approves-worlds-longest-suspension-bridge-13407756",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-messina-sicily-bridge_6984230.jpg?20250806154839",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-06 12:27:00",
        "Headline": "It is believed the €13.5bn (£11.7 bn) project, which became a priority for Prime Minister Giorgia Meloni's right-wing government, will help develop the impoverished south of Italy as it connects the mainland to Sicily.",
        "Content": "Italy's government has approved the construction of what is tipped to become the world's longest suspension bridge. The long-delayed bridge would connect mainland Italy to the island of Sicily, which is currently only reachable via ferry. It is believed the €13.5bn (£11.7bn) project, which became a priority for Prime Minister Giorgia Meloni's right-wing government, will help develop the impoverished south of Italy. The Interministerial Committee for Economic Planning and Sustainable Development (CIPESS) gave the final approval to the project at a meeting in Rome, the League party of deputy prime minister and transport minister Matteo Salvini said. It will have a total length of 3.67km (2.3 miles) and a suspended span of 3.3km (2.05 miles) and have two towers, each made entirely of highly resistant steel, standing 399m tall. That's despite concerns over the environmental impacts and the threat of mafia interference. There have also been concerns over such a bridge being built in an earthquake zone. The designers say the bridge's roadway platform, which will sit 72m above the sea, can stand wind speeds of 292km/h (181mph). The project has been awarded to a consortium led by WeBuild, an Italian infrastructure group, which initially won the bid to build the bridge in 2006 before the project was cancelled in 2013. Read more from Sky News:Clintons subpoenaed in Epstein probe in 'rare escalation'Titan sub report reveals contributing factors that led to implosion According to the Messina Strait Company overseeing the project, Wednesday's approval will allow the start of preliminary works, including archaeological and geological surveys. The company said the bridge will be completed in 2032. Preliminary work could begin later this summer with construction expected to start next year."
    },
    {
        "title": "Trump could meet Putin as early as next week to discuss Ukraine ceasefire - White House official",
        "description": "Donald Trump could meet Vladimir Putin in person as early as next week to discuss a ceasefire in Ukraine, a White House official has said. ",
        "url": "https://news.sky.com/story/trump-could-meet-putin-as-early-as-next-week-to-discuss-ukraine-ceasefire-white-house-official-13407912",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-vladimir-putin_6921976.jpg?20250520080739",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-06 20:30:00",
        "Headline": "The official said the meeting would be conditional on the Russian president meeting his Ukrainian counterpart Volodymyr Zelenskyy, Sky News's US partner network NBC News reported.",
        "Content": " Donald Trump could meet Vladimir Putin in person as early as next week to discuss a ceasefire in Ukraine, a White House official has said.  They said the meeting would be conditional on the Russian president meeting his Ukrainian counterpart Volodymyr Zelenskyy, Sky News's US partner network NBC News reported. It came days before the White House's deadline for Russia to reach a peace deal with Ukraine or face severe economic penalties, which could also target countries buying its oil. Ukraine war latest Asked during a news conference at the White House if the talks would take place, Mr Trump said: \"There's a very good prospect that they will.\" He said it had not been determined where the talks would take place, but added: \"We had some very good talks with President Putin today.\" However, he said: \"I've been disappointed before with this one.\" Asked if Mr Putin made any kind of concession to lead to the development, Mr Trump did not give much away, but added: \"We've been working on this a long time. There are thousands of young people dying, mostly soldiers, but also, you know, missiles being hit into Kyiv and other places.\" US correspondent Seven hours is a long time in US politics. At 10am, Donald Trump accused Russia of posing a threat to America's national security. At 5pm, Trump said there was a \"good prospect\" of him meeting Vladimir Putin \"soon\". There had, he claimed, been \"great progress\" in talks between his special envoy Steve Witkoff and the Russian president. It's difficult to gauge the chances of a meeting between the two leaders without knowing what \"great progress\" means. Is Russia \"inclined\" towards agreeing a ceasefire, as Ukraine's president now claims? Is Putin prepared to meet with his Ukrainian foe Volodymyr Zelenskyy, too? The very fact that we're asking those questions suggests something shifted on a day when there was no expectation of breakthrough. Trump repeatedly vowed to end the war within 24 hours of becoming president. On day 198 of his presidency, he might, just might, be one step closer to achieving that. More tariffs 'could happen' Mr Trump also said he could announce further tariffs on China similar to the 25% he announced on India over its purchases of Russian oil. \"Could happen,\" he said, after saying he expected to announce more secondary sanctions intended to pressure Russia into ending its war with Ukraine. Earlier, he imposed an additional 25% tariff on Indian goods, on top of a previous 25% tariff, over its continued purchases of Russian oil. India's foreign ministry spokesperson said the additional tariffs were \"unfair, unjustified and unreasonable\". It came after Mr Putin held talks with Mr Trump's special envoy Steve Witkoff in Moscow, with the meeting lasting around three hours. In a post on Truth Social, Mr Trump said Mr Witkoff \"had a highly productive meeting\" with Mr Putin in which \"great progress was made\". He said he had updated America's European allies, and they will work towards an end to the Russia-Ukraine war \"in the days and weeks to come\".  'The war must end' Mr Zelenskyy later said he and Mr Trump spoke on the phone after the meeting. He said \"European leaders also participated in the conversation\" and \"we discussed what was said in Moscow\". He added: \"Our common position with our partners is absolutely clear: The war must end. We all need lasting and reliable peace. Russia must end the war that it started.\" Mr Zelenskyy later said: \"It seems that Russia is now more inclined to agree to a ceasefire.\" He added that the pressure on Moscow \"is working\", without elaborating, and stressed it was important to make sure Russia does not \"deceive us or the United States\" when it comes to \"the details\" of a potential agreement."
    },
    {
        "title": "Trump announces yet more tariffs and praises 'significant step' from Apple",
        "description": "Donald Trump has announced 100% tariffs on computer chips and semiconductors made outside the US.",
        "url": "https://news.sky.com/story/trump-announces-huge-tech-tariffs-and-hails-significant-step-towards-an-ultimate-goal-13407946",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-tim-cook-trump_6984478.jpg?20250806233629",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-06 22:28:00",
        "Headline": "The US president - who memorably once referred to Tim Cook as Tim Apple - has previously criticised the tech boss and his company after it attempted to avoid his China tariffs by shifting iPhone production to India. ",
        "Content": "Donald Trump has announced 100% tariffs on computer chips and semiconductors made outside the US. The move threatens to increase the cost of electronics made outside the US, which covers everything from TVs and video game consoles to kitchen appliances and cars. The announcement came as Apple chief executive Tim Cook said his company would invest an extra $100bn (£74.9bn) in US manufacturing. Soon, all smartwatch and iPhone glass around the world will be made in Kentucky, according to Mr Cook, speaking from the Oval Office. \"This is a significant step toward the ultimate goal of ensuring that iPhones sold in the United States of America are also made in America,\" said Mr Trump. \"Today's announcement is one of the largest commitments in what has become among the greatest investment booms in our nation's history.\" Mr Cook also presented the president with a one-of-a-kind trophy made by Apple in the US. Trump's tariffs hit India hard Mr Trump has previously criticised Mr Cook and Apple after the company attempted to avoid his tariffs by shifting iPhone production from China to India. The president said he had a \"little problem\" with Apple and said he'd told Mr Cook: \"I don't want you building in India.\" India itself felt Mr Trump's wrath on Wednesday, as he issued an executive order hitting the country with an additional 25% tariff for its continued purchasing of Russian oil. Indian imports into the US will face a 50% tariff from 27 August as a result of the move, as the president seeks to increase the pressure on Russia to end the war in Ukraine. Mr Trump told reporters at the White House he \"could\" also hit China with more tariffs. Read more:Trump could meet Putin as early as next week  Apple's 'olive branch' Apple, meanwhile, plans to hire 20,000 people in the US to support its extra manufacturing in the country, which will total $600bn (around £449bn) worth of investment over four years. The \"vast majority\" of those jobs will be focused on a new end-to-end US silicon production line, research and development, software development, and artificial intelligence, according to the company. Apple's investment in the US caused the company's stock price to hike by nearly 6% in Wednesday's midday trading. The rise may reflect relief by investors that Mr Cook \"is extending an olive branch\" to Mr Trump, said Nancy Tengler, chief executive of money manager Laffer Tengler Investments, which owns Apple stock."
    },
    {
        "title": "Five soldiers injured in shooting at US Army base in Georgia",
        "description": "Five soldiers have been injured in a shooting at an army base in the US - with authorities placing the location in \"lockdown\".",
        "url": "https://news.sky.com/story/five-soldiers-injured-after-shooting-at-us-army-base-13407827",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-fort-stewart-georgia_6984331.jpg?20250806175804",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-06 15:09:00",
        "Headline": "The gunman has been arrested and there is \"no active threat to the community\", the base said.",
        "Content": "Five soldiers have been injured in a shooting at an army base in the US - with authorities placing the location in \"lockdown\". \"The installation was locked down at 11.04am and law enforcement is on the scene,\" the Fort Stewart base in Georgia wrote on Facebook. It said the incident took place at the 2nd Armoured Brigade Combat Team area and casualties had been reported.   The gunman has been arrested and there is \"no active threat to the community\", the base added. \"The incident remains under investigation and no additional information will be released until the investigation is complete,\" it said. The lockdown was lifted at 12.10pm local time. \n                  Man who claimed weedkiller caused cancer awarded $2.1bn by US jury\n                 \n                  Woman sues fertility clinic after giving birth to another couple's baby\n                 \n                  Georgia man sentenced to nearly 500 years over dog fighting\n                 Brigadier General John Lubas said three of the five injured soldiers needed surgery but all were in a stable condition. He named the alleged gunman as Sergeant Quornelius Radford, adding a personal handgun was used in the shooting and not a military weapon. The shooting took place at the 28-year-old soldier's place of work and involved his co-workers, the general added. \"We're still not certain about the motivations,\" he said. Governor Brian Kemp said he and his family were \"saddened by today's tragedy\". \"We are keeping the victims, their families, and all those who answer the call to serve in our hearts and prayers, and we ask that Georgians everywhere do the same,\" he wrote on X. Fort Stewart is around 25 miles (362km) southeast of Atlanta and is the largest US Army base east of the Mississippi River. It houses thousands of soldiers assigned to the army's 3rd Infantry Division and their family members. The fort's three schools, which have nearly 1,400 students, were also placed under lockdown. Three schools outside the base also took steps similar to a lockdown \"out of an abundance of caution\". Donald Trump has been briefed on the shooting and the US president is monitoring the situation, White House press secretary Karoline Leavitt said in a post on X."
    },
    {
        "title": "British man charged with trying to drown his daughter-in-law in swimming pool on Florida holiday",
        "description": "A British man who allegedly tried to drown his daughter-in-law in a holiday swimming pool in Florida has been charged by police.",
        "url": "https://news.sky.com/story/british-man-charged-with-trying-to-drown-his-daughter-in-law-in-swimming-pool-on-florida-holiday-13407950",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-florida-mark-gibbon_6984481.jpg?20250807003824",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-06 23:33:00",
        "Headline": "\"Because Mr Gibbon couldn't control his anger, he may find himself spending a lot more time in Florida than he had anticipated,\" said the local sheriff.",
        "Content": "A British man who allegedly tried to drown his daughter-in-law in a holiday swimming pool in Florida has been charged by police. Mark Raymond Gibbon, 62, of Beaconsfield, Buckinghamshire, allegedly held the 33-year-old underwater repeatedly after they argued about his grandchildren. He allegedly only stopped when a pair of sisters staying next door called the Polk County sheriff's department. The victim's nine-year-old daughter also allegedly jumped into the pool to stop Gibbon from drowning her mother. The family were staying at a rental home in the Solterra Resort of Davenport, Florida, when the incident occurred on Sunday, according to Sheriff Grady Judd. Officers responded to reports of a disturbance in a pool at around 5.20pm local time. Read more on Sky News:UK airport reopens after plane incidentReeves told big tax rises neededHiroshima survivor's warning, 80 years on \"It's great that Polk County draws visitors from all across the world, but we expect vacationers to behave while they visit with us, just as we expect our lifelong residents to do the same,\" said the sheriff. \"Because Mr Gibbon couldn't control his anger, he may find himself spending a lot more time in Florida than he had anticipated.\" Gibbon was arrested and taken to Polk County Jail, where he was charged with attempted second-degree murder and battery."
    },
    {
        "title": "The new space race? NASA accelerates plan to put nuclear reactor on the moon",
        "description": "NASA is accelerating plans to put a nuclear reactor on the moon, and they claim it could happen by 2030.",
        "url": "https://news.sky.com/story/the-new-space-race-nasa-accelerates-plan-to-put-nuclear-reactor-on-the-moon-13407804",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-nasa-space-nuclear-reactor_6984211.jpg?20250806153018",
        "type": "US",
        "Author": "Lauren Russell",
        "Date Published": "2025-08-06 14:12:00",
        "Headline": "NASA claimed it would be ready to launch a 100 kilowatt nuclear reactor to the moon by 2030. Sky News asked experts why and how it might work.",
        "Content": "\n          News reporter\n              @laurenvrussell\n NASA is accelerating plans to put a nuclear reactor on the moon, and they claim it could happen by 2030. In a directive - a written or oral instruction issued by the US government - to NASA staff earlier this month, Sean Duffy, US transport secretary and the new interim administrator of the space agency, said it should be ready to launch a 100 kilowatt nuclear reactor in five years. Plans to get a reactor on the lunar surface are not new. The NASA website states the space agency is working on the Fission Surface Power Project to create a system capable of generating at least 40 kilowatts of power - but that is less than half of what Mr Duffy has now proposed. He also stressed the importance of America's space agency deploying the technology before China and Russia. \"To properly advance this critical technology, to be able to support a future lunar economy, high power energy generation on Mars, and to strengthen our national security in space, it is imperative the agency move quickly,\" the directive, which was first reported on by Politico, states. A nuclear reactor on the moon would be considered a key step towards building a permanent base for humans to live on the lunar surface. But Mr Duffy warned that the first country to deploy a reactor \"could potentially declare a keep-out zone\" which he said could significantly inhibit NASA's Artemis mission - the lunar exploration programme which aims to land astronauts back on the moon in 2027. When quizzed about the plan on 5 August, he told reporters: \"We're in a race to the moon, in a race with China to the moon. And to have a base on the moon, we need energy.\" Why use a nuclear reactor? Unlike solar power, which is used on the International Space Station, a small nuclear reactor can operate continuously, Dr Sungwoo Lim, a senior lecturer in space applications, exploration and instrumentation at the University of Surrey told Sky News. This is critical for infrastructure on the moon, which spends two weeks in complete darkness as it slowly orbits the Earth. Nuclear reactors therefore diminish the need for sunlight, and can be used to power life support, communications and other critical science instruments, even in darkness. \"In practice, this means astronauts could use a reactor to establish sustainable bases and extend exploration to places where solar energy is impractical,\" Dr Lim adds, including in the moon's permanently shadowed region, where scientists believe ice water exists. Professor Mike Fitzpatrick, an expert in nuclear technology at Coventry University, adds that the proposal of a 100 kilowatt nuclear reactor, is relatively small compared to most that are built on Earth. To put it in real terms, it takes around three kilowatts to power the kettle in your home. But Prof Fitzpatrick says a smaller reactor could pose as \"demonstrator technology\", something small and compact that makes it easier to transport it to the moon. \"Then you can have a whole array of them,\" he says. So, what’s the catch? While scientists agree that nuclear energy seems like the necessary way to make progress on the moon, Prof Fitzpatrick says questions still remain about safety. \"Shipping the fuel to the moon is relatively safe, because at that point it is not particularly toxic, it is the highly reactive fission products that become the issue,\" he says. \"What's going to be the strategy for long-term storage and disposal on the moon after these plants have operated for certain periods of time? The sooner those conversations are had, and you have international consensus, the less likely it is you'll get future friction.\"  Dr Lim also questioned Mr Duffy's timescale of 2030, saying meeting the target depends heavily on the space agency's budget. NASA's future funding is currently unknown after Donald Trump's 2026 budget request sought a cut of $6bn (£4.5bn) and the termination of dozens of science programs and missions. Over 2,000 agency employees are also set to voluntarily leave NASA in the coming months under the Trump administration's \"deferred resignation\" programme. Is this the new space race? Last year, Russia's space agency Roscosmos said it was planning to build a lunar nuclear reactor alongside China's National Space Administration by 2035, in order to power the International Lunar Research Station (ILRS). The collaboration was never formally announced by China but the joint plan was included in a presentation by Chinese officials in April this year, which outlined the 2028 Chang'e-8 lunar mission which aims to lay the groundwork for the ILRS. \"Duffy explicitly described it as a competition,\" says Dr Lim, adding that the move towards lunar exploration signals a renewed moon or space race among major parties like China, Russia, India and the US to claim strategic lunar territory and technology. Read more:Permission granted for first-of-its-kind British rocket launchAstronauts arrive at International Space Station However, Rossana Deplano a professor of international space law at the University of Leicester, says there is a lot of misunderstanding around \"keep out\" or safety zones, which Mr Duffy's directive mentions. \"Safety zones are explicitly recognised in the Artemis Accords,\" she says. \"They are a notification and consultation zone to be declared in advance in order to avoid harmful interference. \"They must be temporary in nature and do not establish state jurisdiction, e.g. they cannot be enforced.\""
    },
    {
        "title": "US special envoy's visit to Moscow may get Putin to offer something, but likely not a ceasefire in Ukraine",
        "description": "The first footage of Steve Witkoff in Moscow probably won't fill Ukraine and its allies with confidence.",
        "url": "https://news.sky.com/story/us-special-envoys-visit-to-moscow-may-get-putin-to-offer-something-but-likely-not-a-ceasefire-in-ukraine-13407683",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-steve-witkoff-donald-trump_6983869.jpg?20250806074739",
        "type": "US",
        "Author": "Ivor Bennett",
        "Date Published": "2025-08-06 09:51:00",
        "Headline": "Despite the laid-back appearance of its emissary, there is a sense the Trump administration's stance towards Moscow has substantially hardened.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n The first footage of Steve Witkoff in Moscow probably won't fill Ukraine and its allies with confidence. The US Special Envoy can be seen strolling leisurely through a park near the Kremlin, alongside Russia's investment chief Kirill Dmitriev. Witkoff has his shades on and is in no obvious hurry. In another video, he is smiling and shaking hands with Vladimir Putin - not the look of a man who is supposedly in town to talk tough with the Russian president. Despite the laid-back appearance of its emissary, though, there is a sense the Trump administration's stance towards Moscow has substantially hardened.  The US president's rhetoric is the sharpest it's ever been. What's more, it's been consistent. Donald Trump has criticised Putin previously - in May, he called him \"crazy\" - but each time has swung back into friendlier territory. \n                  First volcano eruption in 600 years 'may be linked to huge earthquake in Russia's far east'\n                 \n                  India hints it will keep buying Russian oil - despite Trump threats\n                 \n                  Trump orders two nuclear subs to be moved closer to Russia\n                 In the past few weeks, however, his language has only got harsher, describing Russia's continued attacks as \"disgusting\" and shortening a deadline for Moscow to end the war from 50 days to 10. It expires on Friday. Read more from Sky News: What nuclear weapons look like today'Ketamine Queen' given trial date after Friends star's death If Trump doesn't get what he wants, he's threatened to impose sanctions on Russia, and secondary sanctions on countries that buy its exports. That could prove painful for the Kremlin if those secondary tariffs force countries like China and India to stop buying up Russian oil, which until now has provided an economic lifeline to Moscow. But will US pressure work? Will Witkoff be able to extract any meaningful concessions? I think it's unlikely Putin will agree to a full ceasefire. Russian forces continue to advance on the battlefield, so there's no military incentive to pause the fighting. And there's been no sign that he's willing to dilute his goal of seizing four eastern Ukrainian territories in their entirety. But he may offer Washington something, which can be presented as a concession, in order to stave off sanctions. We've seen that before when Trump's patience has worn thin. There was the three-day Easter truce, and the 30-day moratorium on strikes targeting energy infrastructure. This time, there are reports that Russia might agree to an air truce. But it's unclear if another pseudo-ceasefire will be enough to placate the American president."
    },
    {
        "title": "RFK Jr announces US is scrapping $500m of vaccine projects",
        "description": "America's vaccine-sceptic health secretary has announced $500m (&#163;375.8m) worth of cuts to their development in the country.",
        "url": "https://news.sky.com/story/rfk-jr-announces-us-is-scrapping-500m-of-vaccine-projects-13407583",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rfk-junior-vaccine_6983819.jpg?20250806044525",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-06 03:23:00",
        "Headline": "\"I don't think I've seen a more dangerous decision in public health in my 50 years in the business,\" said one health expert.",
        "Content": "America's vaccine-sceptic health secretary has announced $500m (£375.8m) worth of cuts to their development in the country. The US health department is cancelling contracts and pulling funding for jabs to fight viruses like COVID-19 and the flu, it was announced on Tuesday. Robert F Kennedy Jr, known as RFK Jr, said 22 projects developing mRNA vaccines will be halted. It is the latest in a series of decisions to reduce US vaccine programmes. Read more: Who is Donald Trump's health chief? The health secretary has fired the panel that makes vaccine recommendations, reduced recommendations for COVID-19 shots, and refused to endorse vaccines despite a worsening measles outbreak.  RFK Jr claims the US will now prioritise \"safer, broader vaccine strategies, like whole-virus vaccines and novel platforms that don't collapse when viruses mutate\". Responding to the announcement of cuts, Mike Osterholm, a University of Minnesota expert on infectious diseases and pandemic preparations, said: \"I don't think I've seen a more dangerous decision in public health in my 50 years in the business.\"  Dr Paul Offit, a vaccine expert at Children's Hospital of Philadelphia, said RFK Jr's move was short-sighted and that mRNA vaccines \"certainly saved millions of lives\", including during the pandemic. MRNA vaccines work by delivering a snippet of genetic code into the body that triggers an immune response, rather than introducing a real version of the virus. According to the UK Health Security Agency, the \"leading advantage of mRNA vaccines is that they can be designed and produced more quickly than traditional vaccines\". Moderna, which was studying a combo mRNA shot that can tackle COVID and flu for the US health department, previously said it believed mRNA could speed up production of flu jabs compared with traditional vaccines. Read more from Sky News:Harry criticises report into charityReeves told to find 'substantial' tax rises Scientists are also exploring how mRNA could be used in cancer immunotherapies and in other illnesses. At the White House earlier this year, billionaire tech entrepreneur Larry Ellison praised mRNA for its potential to treat cancer. RFK Jr touts 'effective' alternative The health department said the abandoned mRNA projects signal a \"shift in vaccine development priorities.\" \"Let me be absolutely clear, HHS supports safe, effective vaccines for every American who wants them,\" Mr Kennedy said in a statement. Later, he said work is underway on an alternative - a \"universal vaccine\" that mimics \"natural immunity\". \"It could be effective - we believe it's going to be effective - against not only coronaviruses, but also flu,\" he said."
    },
    {
        "title": "Sean 'Diddy' Combs 'seeks pardon from Trump'",
        "description": "Sean \"Diddy\" Combs has been in contact with Donald Trump about a pardon, a source close to the rapper's legal team has told Sky News' US partner network NBC News.",
        "url": "https://news.sky.com/story/sean-diddy-combs-seeks-pardon-from-trump-13407571",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sean-combs-diddy-2010_6983152.jpg?20250805092129",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-06 01:07:00",
        "Headline": "On Tuesday, the rapper was denied bail ahead of his sentencing in October, when he could face up to 20 years behind bars. Donald Trump has a history of pardoning convicted criminals, having done so for people involved in the Capitol riots in 2021.",
        "Content": " Sean \"Diddy\" Combs has been in contact with Donald Trump about a pardon, a source close to the rapper's legal team has told Sky News' US partner network NBC News. A White House spokesperson said it \"will not comment on the existence or nonexistence of any clemency request\". On Tuesday, the rapper was denied bail ahead of his sentencing in October, when he could face up to 20 years in prison after he was convicted of prostitution-related offences. The sentence will likely be much shorter than that, however. In July, he was found guilty of two counts of transportation for prostitution - but cleared of more serious charges of racketeering conspiracy and sex-trafficking, which carried potential life sentences. During an interview with news channel Newsmax last Friday, Mr Trump said \"they have talked to me about Sean\" but did not announce any decision. Read more:How the trial unfoldedThe rise and fall of Sean 'Diddy' Combs The president seemed to cast doubt that he would grant a pardon, however. \"You know, I was very friendly with him. I got along with him great. And seemed like a nice guy, I didn't know him well,\" Trump said. \"But when I ran for office, he was very hostile.\" \"I don't know,\" Trump said. \"It makes it more - I'm being honest, it makes it more difficult to do.\" Trump was then asked, \"more likely a 'no' for Combs?\" Trump responded: \"I would say so.\"  Combs, who co-founded Bad Boy Records and launched the career of the late Notorious BIG, was for decades a huge figure in pop culture, as well as a Grammy-winning hip-hop artist and business entrepreneur, who presided over an empire ranging from fashion to reality TV. Now, as well as the criminal conviction, he is also facing several civil lawsuits."
    },
    {
        "title": "Friends star's alleged 'Ketamine Queen' given trial date",
        "description": "A woman charged with selling Friends actor Matthew Perry the dose of ketamine that killed him will go on trial next month.",
        "url": "https://news.sky.com/story/friends-stars-alleged-ketamine-queen-given-trial-date-13407564",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-matthew-perry-jasveen-sangha_6658017.jpg?20240816125917",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-06 00:21:00",
        "Headline": "Matthew Perry died in October 2023 from a ketamine overdose. The Friends actor had been receiving the drug from his doctor to treat depression.",
        "Content": "A woman charged with selling Friends actor Matthew Perry the dose of ketamine that killed him will go on trial next month. The trial of Jasveen Sangha, allegedly known as the Ketamine Queen, will begin on 23 September after an order from a Los Angeles judge on Tuesday. She is the only defendant standing trial over Perry's death after four others reached plea agreements with prosecutors. The 42-year-old, who has pleaded not guilty, is charged with five counts of ketamine distribution, including one count of distribution resulting in death. Sangha's trial has been postponed four times after her lawyers said they needed longer to go through the prosecution's evidence and to finish their own investigation Perry died in his home in October 2023, aged 54, after getting ketamine from his regular doctor for treatment of depression, which is an increasingly common use for the surgical anaesthetic. The actor was taking ketamine six to eight times a day before he died, according to court documents. Read more from Sky News:Harry criticises report into charityReeves told to find 'substantial' tax rises Prosecutors say Perry illegally sought more ketamine from his doctor, Salvador Plasencia, after he wouldn't give him as much as he wanted. They allege he then sought more from Sangha, who allegedly presented herself as \"a celebrity drug dealer with high-quality goods\". Perry's assistant and friend admitted to buying large amounts of ketamine for him from Sangha, including 25 vials for $6,000 in cash, a few days before his death. Prosecutors allege that purchase included the doses that killed Perry. Plasencia pleaded guilty to ketamine distribution last month along with Perry's personal assistant, his friend, and another doctor. None have been sentenced yet."
    },
    {
        "title": "Trump announces yet more tariffs and praises 'significant step' from Apple",
        "description": "Donald Trump has announced 100% tariffs on computer chips and semiconductors made outside the US.",
        "url": "https://news.sky.com/story/trump-announces-huge-tech-tariffs-and-hails-significant-step-towards-an-ultimate-goal-13407946",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-tim-cook-trump_6984478.jpg?20250806233629",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-06 22:28:00",
        "Headline": "The US president - who memorably once referred to Tim Cook as Tim Apple - has previously criticised the tech boss and his company after it attempted to avoid his China tariffs by shifting iPhone production to India. ",
        "Content": "Donald Trump has announced 100% tariffs on computer chips and semiconductors made outside the US. The move threatens to increase the cost of electronics made outside the US, which covers everything from TVs and video game consoles to kitchen appliances and cars. The announcement came as Apple chief executive Tim Cook said his company would invest an extra $100bn (£74.9bn) in US manufacturing. Soon, all smartwatch and iPhone glass around the world will be made in Kentucky, according to Mr Cook, speaking from the Oval Office. \"This is a significant step toward the ultimate goal of ensuring that iPhones sold in the United States of America are also made in America,\" said Mr Trump. \"Today's announcement is one of the largest commitments in what has become among the greatest investment booms in our nation's history.\" Mr Cook also presented the president with a one-of-a-kind trophy made by Apple in the US. Trump's tariffs hit India hard Mr Trump has previously criticised Mr Cook and Apple after the company attempted to avoid his tariffs by shifting iPhone production from China to India. The president said he had a \"little problem\" with Apple and said he'd told Mr Cook: \"I don't want you building in India.\" India itself felt Mr Trump's wrath on Wednesday, as he issued an executive order hitting the country with an additional 25% tariff for its continued purchasing of Russian oil. Indian imports into the US will face a 50% tariff from 27 August as a result of the move, as the president seeks to increase the pressure on Russia to end the war in Ukraine. Mr Trump told reporters at the White House he \"could\" also hit China with more tariffs. Read more:Trump could meet Putin as early as next week  Apple's 'olive branch' Apple, meanwhile, plans to hire 20,000 people in the US to support its extra manufacturing in the country, which will total $600bn (around £449bn) worth of investment over four years. The \"vast majority\" of those jobs will be focused on a new end-to-end US silicon production line, research and development, software development, and artificial intelligence, according to the company. Apple's investment in the US caused the company's stock price to hike by nearly 6% in Wednesday's midday trading. The rise may reflect relief by investors that Mr Cook \"is extending an olive branch\" to Mr Trump, said Nancy Tengler, chief executive of money manager Laffer Tengler Investments, which owns Apple stock."
    },
    {
        "title": "Primark-owner ABF gets Hovis deal oven-ready",
        "description": "The London-listed parent of Primark was on Wednesday applying the finishing touches to a landmark transaction that will unite the Hovis and Kingsmill bread brands under common ownership.",
        "url": "https://news.sky.com/story/primark-owner-abf-gets-hovis-deal-oven-ready-13407820",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-hovis-bread_6904232.jpg?20250503064806",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-06 14:35:00",
        "Headline": "A deal to unite the Kingsmill and Hovis brands under common ownership is likely to be announced by London-listed Associated British Foods by the end of the week, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The London-listed parent of Primark was on Wednesday applying the finishing touches to a landmark transaction that will unite the Hovis and Kingsmill bread brands under common ownership. Sky News understands that a deal for Associated British Foods (ABF) to acquire Hovis from private equity firm Endless is likely to be announced by the end of the week. The timetable remains subject to delay, banking sources cautioned on Wednesday. Money latest - lottery winners has a week to claim prize The deal, which will see ABF paying about £75m to buy 135 year-old Hovis, is likely to trigger a lengthy review by competition regulators, given that it will bring together the second and third-largest suppliers of packaged bread to Britain's major supermarkets. ABF owns Kingsmill's immediate parent, Allied Bakeries, which has struggled in recent years amid persistent price inflation, changing consumer preferences and competition from larger rival Warburtons as well as new entrants to the market. Confirmation of the tie-up will come three months after Sky News revealed that ABF and Endless - Hovis's owner since 2020 - were in discussions. \n                  Trump announces yet more tariffs and praises 'significant step' from Apple\n                 \n                  Chancellor warned 'substantial tax rises' needed - as she faces 'impossible trilemma'\n                 \n                  Money blog: One week left for £1m lottery winner to claim prize - this is where in UK it was bought\n                 Industry sources have estimated that a combined group could benefit from up to £50m of annual cost savings from a merger. Allied Bakeries was founded in 1935 by Willard Garfield Weston, part of the family which continues to control ABF, while Hovis traces its history even further, having been created in 1890 when Herbert Grime scooped a £25 prize for coming up with the name Hovis, which was derived from the Latin 'Hominis Vis' - meaning 'strength of man\". The overall UK bakery market is estimated to be worth roughly £5bn in annual sales, with the equivalent of 11m loaves being sold each day. Critical to the prospects of a merger of Allied Bakeries, which also owns the Sunblest and Allinson's bread brands, and Hovis taking place will be the view of the Competition and Markets Authority (CMA) at a time when economic regulators are under intense pressure from the government to support growth. Warburtons, the family-owned business which is the largest bakery group in Britain, is estimated to have a 34% share of the branded wrapped sliced bread sector, with Hovis on 24% and Allied on 17%. A merger of Hovis and Kingsmill would give the combined group the largest share of that segment of the market, although one source said Warburtons' overall turnover would remain higher because of the breadth of its product range. Responding to Sky News' report in May of the talks, ABF said: \"Allied Bakeries continues to face a very challenging market. Read more on Sky News:Reeves told big tax rises neededRunway shut after incidentHiroshima survivor's warning, 80 years on \"We are evaluating strategic options for Allied Bakeries against this backdrop and we remain committed to increasing long-term shareholder value.\" Prior to its ownership by Endless, Hovis was owned by Mr Kipling-maker Premier Foods and the Gores family. At the time of the most recent takeover, High Wycombe-based Hovis employed about 2,700 people and operated eight bakery sites, as well as its own flour mill. Hovis's current chief executive, Jon Jenkins, is a former boss of Allied Milling and Baking. ABF declined to comment, while neither Endless nor Hovis could be reached for comment."
    },
    {
        "title": "214,000 parents missing out on child benefit and potentially thousands",
        "description": "More than 200,000 people are missing out on a benefit that could provide them with extra cash in their retirement, new data obtained by the Money team shows.&#160;",
        "url": "https://news.sky.com/story/214000-parents-missing-out-on-child-benefit-and-potentially-thousands-13407748",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-money-child-baby-toddler_6983826.jpg?20250806061414",
        "type": "Business",
        "Author": "Jess Sharp",
        "Date Published": "2025-08-06 12:03:00",
        "Headline": "You probably know about child benefit, but a hidden perk that comes with it could be worth thousands of pounds a year in retirement.",
        "Content": "\n          Money live reporter\n              @JournoJess97\n More than 200,000 people are missing out on a benefit that could provide them with extra cash in their retirement, new data obtained by the Money team shows.  At least 214,000 people are not claiming child benefit and the free national insurance credits that come with it, despite being eligible, according to HMRC data released after a Freedom of Information request. That's 66,000 people more than five years ago. Read all the latest Money news here Child benefit is worth £26.05 a week - or £1,354.60 a year - for the eldest or only child. It's worth £17.25 a week - or £897 a year - for each additional child. You can claim it if you are responsible for a child under the age of 16 or under 20 and still in education or training. \n                  Starmer defends suspending rebel MPs after backbench criticism\n                 \n                  'We're a team': Jess Phillips defends PM's decision to suspend Labour rebels\n                 \n                  Controversial welfare bill passes final Commons stage - but only after another concession\n                 It's automatically paid into your bank account every four weeks. The often overlooked retirement upside While many know about child benefit, they may not know about the free national insurance credits that come with it. If you claimed child benefit for a child under 12 on or after 6 April 2010, you'll get Class 3 credits, which count towards your state pension. To get a full state pension in retirement, you need to have 35 years of qualifying national insurance contributions. You can get these qualifying years through working and paying taxes on your earnings or national insurance credits. When you claim child benefit, you'll get these credits automatically until your youngest child is 12, even if you're not earning. How much could you be missing out on?  One year of national insurance contributions can increase your state pension by around £6.58 a week, or £342.16 a year (until you hit the maximum amount). This means if you take time off work to care for your child until they start school at the age of four, you could be missing out on £1,368 a year in your state pension. If you don't go back to work until they start secondary school at 11, you could be missing out on £3,763 a year. And if you don't claim at all while you're eligible, that amount can rise to around £4,105. But by claiming child benefit during that time, you are plugging the national insurance contribution gap in your record and keeping hold of that amount. \"If parents have multiple children the gap could be even longer, if they don't work for that entire period,\" Laura Suter, director of personal finance at AJ Bell, told Money. \"Getting a free credit for national insurance is a lucrative move. \"You can pay to voluntarily top up your national insurance record, but it would cost you £923 to do this for every year you want to do it.\" How can you claim? You can claim child benefit, and the national insurance credits that come with it, 48 hours after you have registered the birth of your child, or once they come to live with you. It can be backdated for up to three months from the date you make the claim. Only one person can claim the benefit per child, so you'll have to decide whether it's better for you or the other parent to claim (more on the reason why shortly). If you have more than one child, you can both claim for different children. The person who claims will get the national insurance credits, but these can be transferred to your partner at the end of each tax year, if necessary. You can file your claim online here. What do you need to be aware of? While everyone can claim child benefit, if you're earning more than £60,000 for the tax year, you might have to pay the high income child benefit charge. But you will still get the national insurance credits. The amount you're charged depends on how much you earn. If it's between £60,000 and £80,000, you have to pay back 1% of the child benefit for every £200 of income. So if you earn £65,000, you'll pay back 25% of the benefit. Once you get to £80,000 or more, that equals the full amount of the child benefit - so you repay it all. You pay the charge through a self-assessment tax return. \"As incomes have increased during a period of high inflation and wage growth, more people will be hitting the high income charge for child benefit,\" Suter added. \"The move to increase the upper limit from £60,000 up to £80,000 will help to mitigate some of this, but it still means that a couple with one higher earner won't be eligible to claim child benefit. \"However, they can still claim the national insurance credit without claiming the actual money.\" Read more from the Money team:'My seven-year-old pays rent''Here's how COVID changed our hair'Analysis: Motor finance operators can breathe sigh of relief Can you opt out of the benefit but keep the NI credits?  If you don't want to receive child benefit, but want to continue getting the national insurance credits, you can make that clear in a claim form. You can do that online here, by post or over the phone. If you're unsure about how many qualifying years you have on your National Insurance record, you can check that here."
    },
    {
        "title": "Jewellery retailer Claire's struggles to land bid for British chain",
        "description": "The jewellery retailer Claire's is struggling to find a buyer for its British high street operations, stoking fears over thousands more retail jobs.",
        "url": "https://news.sky.com/story/jewellery-retailer-claires-struggles-to-land-bid-for-british-chain-13407692",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-accessories-claires-accessories_6965200.jpg?20250720165751",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-06 10:01:00",
        "Headline": "Potential bidders have backed away from Claire's UK arm, stoking fears of a potential collapse as its US parent filed for bankruptcy protection in the US on Wednesday, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The jewellery retailer Claire's is struggling to find a buyer for its British high street operations, stoking fears over thousands more retail jobs. Sky News has learnt that advisers to Claire's Inc, which filed for Chapter 11 bankruptcy protection in the US on Wednesday, are not expected to land a solvent bid for its UK chain, which trades from close to 300 stores. The precise number of employees at its British operations is unclear, although one insider said the company had a 5,000-strong workforce across Europe, including the UK. Money latest: The £1,354 benefit that 214,000 Britons are failing to claim A filing for administration in the UK is said to be unlikely this week but is now regarded as increasingly possible as soon as this month, according to retail executives. Prospective bidders for Claire's British arm, including the Lakeland owner Hilco Capital, have backed away from making offers in recent weeks as the scale of the chain's challenges has become clear, a senior insolvency practitioner said. Interpath Advisory, the restructuring firm, was recently hired to find a buyer for the UK business and its wider European operations. One retail industry boss had speculated that as many as a third of the UK shops could be axed in a deal to salvage the rest of the chain, putting hundreds of jobs at risk. Read more from Sky News:British Land hires lawyers to scrutinise retail rescue dealsOfwat chief Black to step down ahead of watchdog's abolition Claire’s has been a fixture in British shopping centres and on high streets for decades, and is particularly popular among teenage shoppers. Houlihan Lokey, the investment bank, has been advising on the sale of the US arm. Founded in 1961, it is reported to trade from 2,750 stores globally. The company is owned by former creditors Elliott Management and Monarch Alternative Capital following a previous financial restructuring. Interpath declined to comment.  "
    },
    {
        "title": "Diane's husband was killed by a reckless driver - the wait for justice was almost as painful",
        "description": "Diane Gall's husband, Martyn, had been out on a morning bike ride with his friends on their usual route one winter morning in November 2020 - when he was killed by a reckless driver.&#160;",
        "url": "https://news.sky.com/story/dianes-husband-was-killed-by-a-reckless-driver-the-wait-for-justice-was-almost-as-painful-13407838",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-diane-gall_6984267.png?20250806171107",
        "type": "Politics",
        "Author": "Ashna Hurynag, Daniel Dunford and Eve Bennett ",
        "Date Published": "2025-08-06 15:41:00",
        "Headline": "Exclusive data collected for Sky News reveals widespread scepticism among lawyers about proposed reforms to the justice system, as families face years-long waits for justice amid huge backlogs in the courts.",
        "Content": "By Ashna Hurynag, Daniel Dunford and Eve Bennett    Diane Gall's husband, Martyn, had been out on a morning bike ride with his friends on their usual route one winter morning in November 2020 - when he was killed by a reckless driver.  Diane and her daughters had to wait almost three years for her husband's case to be heard in court. The case was postponed three times, often without warning. \"You just honestly lose faith in the system,\" she says. \"You feel there's a system there that should be there to help and protect victims, to be victims' voices, but the constant delays really take their toll on individuals and us as a family.\" The first trial date in April 2022 was cancelled on the day and pushed four months later. The day before the new date, the family were told it wasn't going ahead due to the barristers' strike. It was moved to November 2022, then postponed again, before eventually being heard in June the following year. \"You're building yourself up for all these dates, preparing yourself for what you're going to hear, reliving everything that has happened, and it's retraumatising,\" says Diane. 'Radical' reform needed Diane's wait for justice gives us an insight into what thousands of victims and their families are battling every day in a court system cracking under the weight of a record-high backlog. There are 76,957 cases waiting to be heard in Crown Courts across England and Wales, as of the end of March 2025. To relieve pressure on the system, an independent review by Sir Brian Leveson last month made a number of recommendations - including creating a new division of the Crown Court known as an intermediate court, made up of a judge and two magistrates, and allowing defendants to choose to be tried by judge alone. He said only \"radical\" reform would have an impact.  But according to exclusive data collected for Sky News by the Law Society, there is strong scepticism among the industry about some proposed plans. Before the review was published, we asked 545 criminal lawyers about the idea of a new tier to the Crown Court - 60% of them told us a type of Intermediate Court was unlikely to reduce the backlog. \"It's moving a problem from one place to another, like moving the deck chairs on the Titanic. It's not going to do anything,\" says Stuart Nolan, chair of the Law Society's criminal law committee. \"I think the problem with it is lack of resources or lack of will to give the proper resources. \"You can say we need more staff, but they're not just any staff, they are people with experience and training, and that doesn't come quickly or cheap.\" Instead, the lawyers told us creating an additional court would harm the quality of justice. Chloe Jay, senior partner at Shentons Solicitors, agrees the quality of justice will be impacted by a new court division that could sit without a jury for some offences. She says: \"The beauty of the Crown Court is that you have two separate bodies, one deciding the facts and one deciding law. \"So the jury doesn't hear the legal arguments about what evidence should be excluded, whether something should be considered as part of the trial, and that's what really gives you that really good, sound quality of justice, because you haven't got one person making all the decisions together. \"Potentially in an intermediate court, that is what will happen. The same three people will hear those legal arguments and make the finding of guilt or innocence.\" The most striking finding from the survey is that 73% of criminal lawyers surveyed are worried about offences no longer sitting in front of a jury. Casey Jenkins, president of London Criminal Court Solicitors' Association, says this could create unconscious bias. \"There's a real risk that people from minority backgrounds are negatively impacted by having a trial by a judge and not a jury of their peers who may have the same or similar social background to them,\" she says. \"A jury trial is protection against professional judicial decisions by the state. It's a fundamental right that can be invoked.\" Instead of moving some offences to a new Crown Court tier, our survey suggests criminal lawyers would be more in favour of moving cases to the magistrates instead. Under the Leveson proposals, trials for offences such as dangerous driving, possessing an offensive weapon and theft could be moved out of the Crown Courts. 'Catastrophic consequences' Richard Atkinson, president of the Law Society, says fixing the system will only work with fair funding. \"It's as important as the NHS, it's as important as the education system,\" he says. \"If it crumbles, there will be catastrophic consequences.\" Ms Jenkins agrees that for too long the system has been allowed to fail. \"Everyone deserves justice, this is just not the answer,\" she says. \"It's just the wrong solution to a problem that was caused by chronic, long-term under-investment in the criminal justice system, which is a vital public service. \"The only way to ensure that there's timely and fair justice for everybody is to invest in all parts of the system from the bottom up: local services, probation, restorative justice, more funding for lawyers so we can give early advice, more funding for the police so that cases are better prepared.\" Government vows 'bold and ambitious reform' In response to Sky News' findings, the minister for courts and legal services, Sarah Sackman KC MP, told Sky News: \"We inherited a record and rising court backlog, leaving many victims facing unacceptable delays to see justice done. \"We've already boosted funding in our courts system, but the only way out of this crisis is bold and ambitious reform. That is why we are carefully considering Sir Brian's bold recommendations for long-term change. \"I won't hesitate to do whatever needs to be done for the benefit of victims.\" The driver that killed Diane's husband was eventually convicted. She wants those making decisions about the court system to remember those impacted the most in every case. Every victim and every family. \"You do just feel like a cog in a big wheel that's out of your control,\" she says. \"Because you know justice delayed is justice denied.\""
    },
    {
        "title": "Fact-checking Farage: Are foreigners more likely than Britons to commit sexual offences?",
        "description": null,
        "url": "https://news.sky.com/story/fact-checking-farage-are-foreigners-more-likely-than-britons-to-commit-sexual-offences-13407866",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-farage-data-forensics_6983605.png?20250805184125",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-06 17:13:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "Ban asylum seekers who work illegally from gaining refugee status, Tories say",
        "description": "Asylum seekers who work in the UK without permission should be placed \"on the next plane home\", Tory leader Kemi Badenoch has said.",
        "url": "https://news.sky.com/story/ban-asylum-seekers-who-work-illegally-from-gaining-refugee-status-tories-say-13407886",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-france-gravelines-coast-guard_6966790.jpg?20250805144234",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-06 18:03:00",
        "Headline": "The Conservatives say the UK's informal working market is acting as a \"pull factor\" for small boat crossings in the Channel.",
        "Content": " Asylum seekers who work in the UK without permission should be placed \"on the next plane home\", Tory leader Kemi Badenoch has said. Ms Badenoch and her shadow home secretary Chris Philp criticised the UK as being a \"soft touch\" and that illegal working acts as a \"pull factor\" for those making the dangerous journey across the English Channel. While people who have asylum claims that are yet to be processed are not usually allowed to work, if they have been waiting for a year or longer for a decision they can apply for permission to work. Politics latest: PM responds to report suggesting tax rises needed Earlier in the summer, Mr Philp made an unannounced visit to an asylum hotel where he said he found \"clear evidence of illegal working for Deliveroo, Just Eat and Uber Eats\". There are reports that asylum seekers can rent legitimate delivery driver accounts within hours of arriving in the country - skipping employment legality checks. Uber Eats, Deliveroo, and Just Eat have previously told Sky News they are continuing to strengthen the technology they use to remove anyone working illegally. Last month, the Home Office struck an agreement with the firms to equip them with tools to identify patterns of misuse and riders who are not allowed to work in the UK. As part of the deal, the government will share the locations of asylum hotels. 'Rewards illegality, mocks taxpayers' However, the Conservatives have said asylum seekers who are caught working illegally should be barred from becoming a refugee. \"If you come here illegally, take advantage of our asylum system, and then break our laws by illegally working, your asylum claim must be rejected, and you should be on the next plane home,\" Ms Badenoch said. \"Under my leadership, the Conservatives will never allow Britain to become a soft touch for those who think they can break the rules and profit from it.\" She also said illegal working \"rewards illegality, protects perpetrators and mocks hard-working taxpayers\". Read more:Who says what on asylum hotelsFact-checking Farage's Afghan claimsInside crackdown on illegal moped delivery drivers 'Pull factor' Mr Philp added: \"Illegal working is a pull factor sold by smugglers as a reward to break in to our country and cross the Channel. \"That is why we are calling for new action: anyone who plays the system should have their status stripped, wages confiscated, and be deported.\" Yvette Cooper, the home secretary, previously said illegal working \"undermines honest business, exploits vulnerable individuals and fuels organised immigration crime\". She described the Home Office's data-sharing deal as \"decisive action to close loopholes and increase enforcement\", and added it sat alongside \"a 50% increase in raids and arrests for illegal working\". Ministers have also pointed to the Border Security Bill working its way through parliament, which could see companies fined £60,000 for each illegal worker discovered. Last month Angela Eagle, the border security and asylum minister, told Sky News arrests for illegal working were up over the past year by 51% from the year before, to more than 7,000. \"If we find you working, you can lose access to the hotel or the support you have [been] given under false pretences,\" she said. \"We are cracking down on that abuse, and we intend to keep doing so.\""
    },
    {
        "title": "Jess Phillips condemns 'idiot' councils that don't believe they have grooming gang problem",
        "description": "Safeguarding minister Jess Phillips has told Sky News that councils that believe they don't have a problem with grooming gangs are \"idiots\" - as she denied Elon Musk influenced the decision to have a national inquiry on the subject.&#160;",
        "url": "https://news.sky.com/story/jess-phillips-condemns-idiot-councils-that-dont-believe-they-have-grooming-gang-problem-13407809",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jess-phillips-grooming-gangs_6984282.jpg?20250806170642",
        "type": "Politics",
        "Author": "Jason Farrell",
        "Date Published": "2025-08-06 14:20:00",
        "Headline": "Safeguarding minister Jess Phillips hits out at some local authorities - and denies Elon Musk's intervention sparked a national inquiry on the issue.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  Safeguarding minister Jess Phillips has told Sky News that councils that believe they don't have a problem with grooming gangs are \"idiots\" - as she denied Elon Musk influenced the decision to have a national inquiry on the subject.  The minister said: \"I don't follow Elon Musk's advice on anything although maybe I too would like to go to Mars. \"Before anyone even knew Elon Musk's name, I was working with the victims of these crimes.\" Politics latest: Starmer responds to report suggesting tax rises needed  Mr Musk had called Ms Phillips a \"rape genocide apologist\" in one of a series of inflammatory posts on X in January and said she should go to jail. Mr Musk, then a close aide of US President Donald Trump, sparked a significant political row with his comments - with the Conservative Party and Reform UK calling for a new public inquiry into grooming gangs. At the time, Ms Phillips denied a request for a public inquiry into child sexual exploitation in Oldham on the basis that it should be done at a local level. But the government announced a national inquiry after Baroness Casey's rapid audit on grooming gangs, which was published in June. Asked if she thought there was, in the words of Baroness Casey, \"over representation\" among suspects of Asian and Pakistani men, Ms Phillips replied: \"My own experience of working with many young girls in my area - yes there is a problem. There are different parts of the country where the problem will look different, organised crime has different flavours across the board. \"But I have to look at the evidence… and the government reacts to the evidence.\" Ms Phillips also said the home secretary has written to all police chiefs telling them that data collection on ethnicity \"has to change\", to ensure that it is always recorded, promising \"we will legislate to change the way this [collection] is done if necessary\". Read more:Chancellor warned 'substantial tax rises' neededMinister admits UK-France migrant returns could be 'frustrated' by legal challenges Operation Beaconport has since been established, led by the National Crime Agency (NCA), and will be reviewing more than 1,200 closed cases of child sexual exploitation. Ms Phillips revealed that at least \"five, six\" councils have asked to be a part of the national review - and denounced councils that believed they don't have a problem with grooming gangs as \"idiots\". \"I don't want [the inquiry] just to go over places that have already had inquiries and find things the Casey had already identified,\" she said. She confirmed that a shortlist for a chair has been drawn up, and she expects the inquiry to be finished within three years. Ms Phillips's comments come after she announced £426,000 of funding to roll out artificial intelligence tools across all 43 police forces in England and Wales to speed up investigations into modern slavery, child sex abuse and county lines gangs. Some 13 forces have access to the AI apps, which the Home Office says have saved more than £20m and 16,000 hours for investigators. The apps can translate large amounts of text in foreign languages and analyse data to find relationships between suspects."
    },
    {
        "title": "Cabinet minister admits UK-France migrant returns could be 'frustrated' by legal challenges",
        "description": "A cabinet minister has said attempts to deport asylum seekers could be delayed in the courts, amid confusion over whether there is a human rights \"loophole\" in the UK's migration deal with France.",
        "url": "https://news.sky.com/story/cabinet-minister-admits-uk-france-migrant-returns-could-be-frustrated-by-legal-challenges-13407609",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-dover-small-boats-migrants_6979000.jpg?20250731140106",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-06 06:34:00",
        "Headline": "Critics have argued \"legal loopholes\" mean applications could be made to frustrate the deportation process and cause delays. But Lisa Nandy told Sky News this was \"not the case at all\".",
        "Content": " A cabinet minister has said attempts to deport asylum seekers could be delayed in the courts, amid confusion over whether there is a human rights \"loophole\" in the UK's migration deal with France. The \"one in, one out\" agreement will see migrants ineligible to stay in the UK sent back across the Channel. In exchange, the UK will take from France those who have links to Britain. Politics Live: Chancellor warned 'substantial tax rises' needed The treaty contains a clause that says in order for people to be returned, the UK must confirm they do not have an \"outstanding human rights claim\". Critics have argued this could risk bogus applications being made to frustrate the deportation process and cause delays. Chris Philp, the Conservative shadow home secretary, said it was an obvious \"loophole\" in the deal. However, Culture Secretary Lisa Nandy told Sky News this was \"not the case at all\". \"The deal that we've struck will allow people with us to send people back to France who have human rights claims. Those claims will be heard in France,\" she said. But despite denying there was a loophole, Ms Nandy admitted deportations could get held up in UK the courts. She said: \"Obviously there are people who will try to frustrate the process through the courts, but we're speeding up the court process to make sure that those delays will be minimal and we will be able to return people to France so that, if they have an asylum claim, for example, that claim can be heard in France if they've travelled through France on the way here on small boats.\" When asked for clarity, the Home Office insisted people can be removed from the UK if they have made a human rights claim which is \"clearly unfounded\" in UK law. It is understood that preparations have been made for judicial challenges against these decisions to be heard by UK courts from France, though sources suggested that once France has agreed to accept a return, there is no way back. The charity Care4Calais said it would consider its options, with a spokesperson telling Sky News: \"Care4Calais initiated legal challenges against the last government's Rwanda policy and their attempts to introduce 'pushbacks' in the Channel - and we won. \"We will consider all options open to us to oppose any plans that will put more lives at risk, and involve governments trading humans.\" The government is under pressure for the scheme to work as Channel crossings have risen to a record high under their watch, despite a promise in the Labour manifesto to \"smash the gangs\". Row as crossings continue A row broke out on Wednesday afternoon after Mr Philp shared footage from Calais showing migrants making the journey from France to England. The senior Tory claimed this showed the government's deal \"is not deterring anyone\". Dame Angela Eagle, the border security minister, accused him of being a \"hypocrite\", saying thousands of people crossed the Channel while the Tories tried and failed to get their Rwanda scheme going. She said the deal with France \"will take time and it will be hard\" but insisted it will \" make an important contribution to the all-out assault we are waging against the business model of the smuggling gangs, which was allowed to flourish and grow for six years while your government was in charge\". \"That is the difference between having a serious and comprehensive plan to fix this crisis, and just standing in a boat pointing at it. I hope you're getting a nice tan, though,\" she said. The deal with France is one of a number of measures the government has implemented to crack down on small boat crossings. Read more from Sky News:Explained: What is the UK-France migrant returns deal?Row over checks for Gazans who've earned places at UK unis Ministers have refused to say how many people could be sent back across the Channel, claiming that would benefit smuggling gangs. However, reports have suggested that about 50 a week could be sent to France - a small number compared to the 800 people every week on average who have arrived in the UK via small boats this year. Bruno Retailleau, France's interior minister, said the agreement \"establishes an experimental mechanism whose goal is clear: to smash the gangs\". The initial agreement will be in place until June 2026."
    },
    {
        "title": "Trump announces yet more tariffs and praises 'significant step' from Apple",
        "description": "Donald Trump has announced 100% tariffs on computer chips and semiconductors made outside the US.",
        "url": "https://news.sky.com/story/trump-announces-huge-tech-tariffs-and-hails-significant-step-towards-an-ultimate-goal-13407946",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-tim-cook-trump_6984478.jpg?20250806233629",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-06 22:28:00",
        "Headline": "The US president - who memorably once referred to Tim Cook as Tim Apple - has previously criticised the tech boss and his company after it attempted to avoid his China tariffs by shifting iPhone production to India. ",
        "Content": "Donald Trump has announced 100% tariffs on computer chips and semiconductors made outside the US. The move threatens to increase the cost of electronics made outside the US, which covers everything from TVs and video game consoles to kitchen appliances and cars. The announcement came as Apple chief executive Tim Cook said his company would invest an extra $100bn (£74.9bn) in US manufacturing. Soon, all smartwatch and iPhone glass around the world will be made in Kentucky, according to Mr Cook, speaking from the Oval Office. \"This is a significant step toward the ultimate goal of ensuring that iPhones sold in the United States of America are also made in America,\" said Mr Trump. \"Today's announcement is one of the largest commitments in what has become among the greatest investment booms in our nation's history.\" Mr Cook also presented the president with a one-of-a-kind trophy made by Apple in the US. Trump's tariffs hit India hard Mr Trump has previously criticised Mr Cook and Apple after the company attempted to avoid his tariffs by shifting iPhone production from China to India. The president said he had a \"little problem\" with Apple and said he'd told Mr Cook: \"I don't want you building in India.\" India itself felt Mr Trump's wrath on Wednesday, as he issued an executive order hitting the country with an additional 25% tariff for its continued purchasing of Russian oil. Indian imports into the US will face a 50% tariff from 27 August as a result of the move, as the president seeks to increase the pressure on Russia to end the war in Ukraine. Mr Trump told reporters at the White House he \"could\" also hit China with more tariffs. Read more:Trump could meet Putin as early as next week  Apple's 'olive branch' Apple, meanwhile, plans to hire 20,000 people in the US to support its extra manufacturing in the country, which will total $600bn (around £449bn) worth of investment over four years. The \"vast majority\" of those jobs will be focused on a new end-to-end US silicon production line, research and development, software development, and artificial intelligence, according to the company. Apple's investment in the US caused the company's stock price to hike by nearly 6% in Wednesday's midday trading. The rise may reflect relief by investors that Mr Cook \"is extending an olive branch\" to Mr Trump, said Nancy Tengler, chief executive of money manager Laffer Tengler Investments, which owns Apple stock."
    },
    {
        "title": "One dead as 'hellish' wildfire burns across area the size of Paris in southern France",
        "description": "One person has died as France's biggest wildfire this summer sweeps through a southern region, forcing tourists and residents to flee.",
        "url": "https://news.sky.com/story/one-dead-as-hellish-wildfire-burns-across-area-the-size-of-paris-in-southern-france-13407794",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-france-wildfire_6984185.jpg?20250806145138",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-06 13:48:00",
        "Headline": "The wildfire remains \"very active\" and is reported to be spreading rapidly through forests and villages. It is the latest in a string of major blazes across southern Europe this summer.",
        "Content": " One person has died as France's biggest wildfire this summer sweeps through a southern region, forcing tourists and residents to flee. Officials called the scenes \"hellish\" after the blaze broke out in Ribaute in the region of Aude, close to the border with Spain. The victim died in their home in the village of Saint-Laurent-de-la-Cabrerisse, about 20 miles north of the city of Perpignan, officials said. Thirteen people have been injured, including 11 firefighters, since the wildfire started on Tuesday, authorities added. One person who was initially feared missing has been located and is safe. The French interior ministry said the fire remains \"very active\" and has already burned across 13,000 hectares (79,000 acres) - an area larger than Paris. At least 25 houses have been burnt down, while many roads have been closed. The blaze was said to be spreading rapidly through forests and villages, forcing residents and tourists to flee. About 2,000 firefighters and several water-bomber aircraft were tackling the blaze. The hot, dry and windy conditions have been making it difficult for firefighters to contain the blaze, officials added. Jacques Piraux, mayor of Jonquieres village, told broadcaster BFM TV: \"It's a scene of sadness and desolation. \"It looks like a lunar landscape, everything is burned. \"More than half or three-quarters of the village has burned down. It's hellish.\" Dutch national Renate Koot, who was on holiday in Saint-Laurent-de-la-Cabrerisse with her partner, said: \"One moment we were on the phone with our children ... thinking, 'look, a fire'. \"The next, we had to jump in the car and leave, while praying for protection. \"We didn't take anything with us and just left. We're okay, miraculously.\" Residents and tourists were advised to remain indoors unless told to evacuate by firefighters. Two campsites have been evacuated as a precaution. Drought conditions in Aude - which is a major wine-producing region - had forced officials to introduce restrictions on the use of water, the environment ministry said. The lack of rainfall in recent months had \"played a major role in the spreading of the fire, since the vegetation is very dry,\" it added. Last month, a wildfire that reached the southern port of Marseille, France's second-largest city, left around 300 people injured. There have also been major wildfires in other parts of the Mediterranean and southern Europe in recent weeks, including in Spain, Crete, Greece and Turkey. Read more:'Apocalyptic' wildfires break out in southeast EuropeTurkey faces 'truly great disaster' over wildfires - Erdogan Europe is the world's fastest-warming continent, with temperatures increasing at twice the speed of the global average since the 1980s, according to the European Union's Copernicus Climate Change Service. Scientists warn that climate change is exacerbating the frequency and intensity of heat and dryness, making the region more vulnerable to wildfires."
    },
    {
        "title": "The new space race? NASA accelerates plan to put nuclear reactor on the moon",
        "description": "NASA is accelerating plans to put a nuclear reactor on the moon, and they claim it could happen by 2030.",
        "url": "https://news.sky.com/story/the-new-space-race-nasa-accelerates-plan-to-put-nuclear-reactor-on-the-moon-13407804",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-nasa-space-nuclear-reactor_6984211.jpg?20250806153018",
        "type": "Technology",
        "Author": "Lauren Russell",
        "Date Published": "2025-08-06 14:12:00",
        "Headline": "NASA claimed it would be ready to launch a 100 kilowatt nuclear reactor to the moon by 2030. Sky News asked experts why and how it might work.",
        "Content": "\n          News reporter\n              @laurenvrussell\n NASA is accelerating plans to put a nuclear reactor on the moon, and they claim it could happen by 2030. In a directive - a written or oral instruction issued by the US government - to NASA staff earlier this month, Sean Duffy, US transport secretary and the new interim administrator of the space agency, said it should be ready to launch a 100 kilowatt nuclear reactor in five years. Plans to get a reactor on the lunar surface are not new. The NASA website states the space agency is working on the Fission Surface Power Project to create a system capable of generating at least 40 kilowatts of power - but that is less than half of what Mr Duffy has now proposed. He also stressed the importance of America's space agency deploying the technology before China and Russia. \"To properly advance this critical technology, to be able to support a future lunar economy, high power energy generation on Mars, and to strengthen our national security in space, it is imperative the agency move quickly,\" the directive, which was first reported on by Politico, states. A nuclear reactor on the moon would be considered a key step towards building a permanent base for humans to live on the lunar surface. But Mr Duffy warned that the first country to deploy a reactor \"could potentially declare a keep-out zone\" which he said could significantly inhibit NASA's Artemis mission - the lunar exploration programme which aims to land astronauts back on the moon in 2027. When quizzed about the plan on 5 August, he told reporters: \"We're in a race to the moon, in a race with China to the moon. And to have a base on the moon, we need energy.\" Why use a nuclear reactor? Unlike solar power, which is used on the International Space Station, a small nuclear reactor can operate continuously, Dr Sungwoo Lim, a senior lecturer in space applications, exploration and instrumentation at the University of Surrey told Sky News. This is critical for infrastructure on the moon, which spends two weeks in complete darkness as it slowly orbits the Earth. Nuclear reactors therefore diminish the need for sunlight, and can be used to power life support, communications and other critical science instruments, even in darkness. \"In practice, this means astronauts could use a reactor to establish sustainable bases and extend exploration to places where solar energy is impractical,\" Dr Lim adds, including in the moon's permanently shadowed region, where scientists believe ice water exists. Professor Mike Fitzpatrick, an expert in nuclear technology at Coventry University, adds that the proposal of a 100 kilowatt nuclear reactor, is relatively small compared to most that are built on Earth. To put it in real terms, it takes around three kilowatts to power the kettle in your home. But Prof Fitzpatrick says a smaller reactor could pose as \"demonstrator technology\", something small and compact that makes it easier to transport it to the moon. \"Then you can have a whole array of them,\" he says. So, what’s the catch? While scientists agree that nuclear energy seems like the necessary way to make progress on the moon, Prof Fitzpatrick says questions still remain about safety. \"Shipping the fuel to the moon is relatively safe, because at that point it is not particularly toxic, it is the highly reactive fission products that become the issue,\" he says. \"What's going to be the strategy for long-term storage and disposal on the moon after these plants have operated for certain periods of time? The sooner those conversations are had, and you have international consensus, the less likely it is you'll get future friction.\"  Dr Lim also questioned Mr Duffy's timescale of 2030, saying meeting the target depends heavily on the space agency's budget. NASA's future funding is currently unknown after Donald Trump's 2026 budget request sought a cut of $6bn (£4.5bn) and the termination of dozens of science programs and missions. Over 2,000 agency employees are also set to voluntarily leave NASA in the coming months under the Trump administration's \"deferred resignation\" programme. Is this the new space race? Last year, Russia's space agency Roscosmos said it was planning to build a lunar nuclear reactor alongside China's National Space Administration by 2035, in order to power the International Lunar Research Station (ILRS). The collaboration was never formally announced by China but the joint plan was included in a presentation by Chinese officials in April this year, which outlined the 2028 Chang'e-8 lunar mission which aims to lay the groundwork for the ILRS. \"Duffy explicitly described it as a competition,\" says Dr Lim, adding that the move towards lunar exploration signals a renewed moon or space race among major parties like China, Russia, India and the US to claim strategic lunar territory and technology. Read more:Permission granted for first-of-its-kind British rocket launchAstronauts arrive at International Space Station However, Rossana Deplano a professor of international space law at the University of Leicester, says there is a lot of misunderstanding around \"keep out\" or safety zones, which Mr Duffy's directive mentions. \"Safety zones are explicitly recognised in the Artemis Accords,\" she says. \"They are a notification and consultation zone to be declared in advance in order to avoid harmful interference. \"They must be temporary in nature and do not establish state jurisdiction, e.g. they cannot be enforced.\""
    },
    {
        "title": "RFK Jr announces US is scrapping $500m of vaccine projects",
        "description": "America's vaccine-sceptic health secretary has announced $500m (&#163;375.8m) worth of cuts to their development in the country.",
        "url": "https://news.sky.com/story/rfk-jr-announces-us-is-scrapping-500m-of-vaccine-projects-13407583",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rfk-junior-vaccine_6983819.jpg?20250806044525",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-06 03:23:00",
        "Headline": "\"I don't think I've seen a more dangerous decision in public health in my 50 years in the business,\" said one health expert.",
        "Content": "America's vaccine-sceptic health secretary has announced $500m (£375.8m) worth of cuts to their development in the country. The US health department is cancelling contracts and pulling funding for jabs to fight viruses like COVID-19 and the flu, it was announced on Tuesday. Robert F Kennedy Jr, known as RFK Jr, said 22 projects developing mRNA vaccines will be halted. It is the latest in a series of decisions to reduce US vaccine programmes. Read more: Who is Donald Trump's health chief? The health secretary has fired the panel that makes vaccine recommendations, reduced recommendations for COVID-19 shots, and refused to endorse vaccines despite a worsening measles outbreak.  RFK Jr claims the US will now prioritise \"safer, broader vaccine strategies, like whole-virus vaccines and novel platforms that don't collapse when viruses mutate\". Responding to the announcement of cuts, Mike Osterholm, a University of Minnesota expert on infectious diseases and pandemic preparations, said: \"I don't think I've seen a more dangerous decision in public health in my 50 years in the business.\"  Dr Paul Offit, a vaccine expert at Children's Hospital of Philadelphia, said RFK Jr's move was short-sighted and that mRNA vaccines \"certainly saved millions of lives\", including during the pandemic. MRNA vaccines work by delivering a snippet of genetic code into the body that triggers an immune response, rather than introducing a real version of the virus. According to the UK Health Security Agency, the \"leading advantage of mRNA vaccines is that they can be designed and produced more quickly than traditional vaccines\". Moderna, which was studying a combo mRNA shot that can tackle COVID and flu for the US health department, previously said it believed mRNA could speed up production of flu jabs compared with traditional vaccines. Read more from Sky News:Harry criticises report into charityReeves told to find 'substantial' tax rises Scientists are also exploring how mRNA could be used in cancer immunotherapies and in other illnesses. At the White House earlier this year, billionaire tech entrepreneur Larry Ellison praised mRNA for its potential to treat cancer. RFK Jr touts 'effective' alternative The health department said the abandoned mRNA projects signal a \"shift in vaccine development priorities.\" \"Let me be absolutely clear, HHS supports safe, effective vaccines for every American who wants them,\" Mr Kennedy said in a statement. Later, he said work is underway on an alternative - a \"universal vaccine\" that mimics \"natural immunity\". \"It could be effective - we believe it's going to be effective - against not only coronaviruses, but also flu,\" he said."
    },
    {
        "title": "Sean 'Diddy' Combs 'seeks pardon from Trump'",
        "description": "Sean \"Diddy\" Combs has been in contact with Donald Trump about a pardon, a source close to the rapper's legal team has told Sky News' US partner network NBC News.",
        "url": "https://news.sky.com/story/sean-diddy-combs-seeks-pardon-from-trump-13407571",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sean-combs-diddy-2010_6983152.jpg?20250805092129",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-06 01:07:00",
        "Headline": "On Tuesday, the rapper was denied bail ahead of his sentencing in October, when he could face up to 20 years behind bars. Donald Trump has a history of pardoning convicted criminals, having done so for people involved in the Capitol riots in 2021.",
        "Content": " Sean \"Diddy\" Combs has been in contact with Donald Trump about a pardon, a source close to the rapper's legal team has told Sky News' US partner network NBC News. A White House spokesperson said it \"will not comment on the existence or nonexistence of any clemency request\". On Tuesday, the rapper was denied bail ahead of his sentencing in October, when he could face up to 20 years in prison after he was convicted of prostitution-related offences. The sentence will likely be much shorter than that, however. In July, he was found guilty of two counts of transportation for prostitution - but cleared of more serious charges of racketeering conspiracy and sex-trafficking, which carried potential life sentences. During an interview with news channel Newsmax last Friday, Mr Trump said \"they have talked to me about Sean\" but did not announce any decision. Read more:How the trial unfoldedThe rise and fall of Sean 'Diddy' Combs The president seemed to cast doubt that he would grant a pardon, however. \"You know, I was very friendly with him. I got along with him great. And seemed like a nice guy, I didn't know him well,\" Trump said. \"But when I ran for office, he was very hostile.\" \"I don't know,\" Trump said. \"It makes it more - I'm being honest, it makes it more difficult to do.\" Trump was then asked, \"more likely a 'no' for Combs?\" Trump responded: \"I would say so.\"  Combs, who co-founded Bad Boy Records and launched the career of the late Notorious BIG, was for decades a huge figure in pop culture, as well as a Grammy-winning hip-hop artist and business entrepreneur, who presided over an empire ranging from fashion to reality TV. Now, as well as the criminal conviction, he is also facing several civil lawsuits."
    },
    {
        "title": "Friends star's alleged 'Ketamine Queen' given trial date",
        "description": "A woman charged with selling Friends actor Matthew Perry the dose of ketamine that killed him will go on trial next month.",
        "url": "https://news.sky.com/story/friends-stars-alleged-ketamine-queen-given-trial-date-13407564",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-matthew-perry-jasveen-sangha_6658017.jpg?20240816125917",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-06 00:21:00",
        "Headline": "Matthew Perry died in October 2023 from a ketamine overdose. The Friends actor had been receiving the drug from his doctor to treat depression.",
        "Content": "A woman charged with selling Friends actor Matthew Perry the dose of ketamine that killed him will go on trial next month. The trial of Jasveen Sangha, allegedly known as the Ketamine Queen, will begin on 23 September after an order from a Los Angeles judge on Tuesday. She is the only defendant standing trial over Perry's death after four others reached plea agreements with prosecutors. The 42-year-old, who has pleaded not guilty, is charged with five counts of ketamine distribution, including one count of distribution resulting in death. Sangha's trial has been postponed four times after her lawyers said they needed longer to go through the prosecution's evidence and to finish their own investigation Perry died in his home in October 2023, aged 54, after getting ketamine from his regular doctor for treatment of depression, which is an increasingly common use for the surgical anaesthetic. The actor was taking ketamine six to eight times a day before he died, according to court documents. Read more from Sky News:Harry criticises report into charityReeves told to find 'substantial' tax rises Prosecutors say Perry illegally sought more ketamine from his doctor, Salvador Plasencia, after he wouldn't give him as much as he wanted. They allege he then sought more from Sangha, who allegedly presented herself as \"a celebrity drug dealer with high-quality goods\". Perry's assistant and friend admitted to buying large amounts of ketamine for him from Sangha, including 25 vials for $6,000 in cash, a few days before his death. Prosecutors allege that purchase included the doses that killed Perry. Plasencia pleaded guilty to ketamine distribution last month along with Perry's personal assistant, his friend, and another doctor. None have been sentenced yet."
    }
]