[
    {
        "title": "Manhunt for Epping hotel asylum seeker, jailed for sexually assaulting girl, after accidental release",
        "description": "A manhunt has been launched for an accidentally released asylum seeker who was jailed for 12 months earlier this year after he sexually assaulted a 14-year-old girl and a woman in Epping.",
        "url": "https://news.sky.com/story/manhunt-for-epping-hotel-asylum-seeker-jailed-for-sexually-assaulting-girl-after-accidental-release-13456674",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-epping-hadush-kebatu_7002838.jpg?20250904165341",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-24 15:55:00",
        "Headline": "Hadush Gerberslasie Kebatu had been staying at The Bell Hotel in the Essex town, with the incident fuelling weeks of protests at the site.",
        "Content": " A manhunt has been launched for an accidentally released asylum seeker who was jailed for 12 months earlier this year after he sexually assaulted a 14-year-old girl and a woman in Epping. Hadush Gerberslasie Kebatu had been staying at The Bell Hotel in the Essex town, with the incident fuelling weeks of protests at the site. The Ethiopian national was found guilty of two counts of sexual assault, attempted sexual assault, inciting a girl to engage in sexual activity and harassment without violence earlier this month. Follow the latest updates on the manhunt District judge Christopher Williams said Kebatu posed a \"significant risk of reoffending\" when he sentenced him to 12 months in prison in September. Sky News understands Kebatu was being released from HMP Chelmsford as he was due to be immediately deported. He was released on the expectation that he would be picked up by immigration enforcement, but it is currently unclear what happened next. It is understood that the Home Office was ready to take Kebatu to an immigration removal centre. Essex Police launched a manhunt for Kebatu after he was accidentally freed on Friday morning, and the force said in a statement that the asylum seeker boarded a train to London shortly after midday. \"We were informed by the prison service at 12.57pm today of an error this morning surrounding the release of an individual,\" Essex police said in a statement. The force added that \"fast-paced enquiries have shown that the man boarded a London-bound train at Chelmsford Railway Station at 12.41pm\". The Greater Anglia train stopped at Shenfield and Stratford before arriving at London Liverpool Street at 13.18pm, according to Trainline data. Deputy Prime Minister and Justice Secretary David Lammy said Kebatu was \"at large in London\", with three police forces - Essex Police, Metropolitan Police and British Transport Police - searching for the \"dangerous\" asylum seeker. \"I'm livid. I'm livid on behalf of the public that this individual who committed a sexual assault on a young minor and a woman is at large tonight,\" Mr Lammy said, adding: \"He should not have been released in this way.\"  The father of the 14-year-old girl who was assaulted by Kebatu was visibly upset as he turned up at Chelmsford jail asking for answers after his daughter's assailant was accidentally released. He told Sky News' home news correspondent Mollie Malone that he felt \"let down\" by every authority, and \"frustrated\" at the thought of Kebatu being able to escape prison custody, after attacking his daughter in the summer. \"The justice system has let us down,\" the girl's father said. Kebatu's lawyer, Molly Dyas, told Chelmsford Magistrates' Court during his trial that it was his \"firm wish\" to be deported. Under the UK Borders Act 2007, a deportation order must be made where a foreign national has been convicted of an offence and received a custodial sentence of at least 12 months. Sir Keir Starmer called the mistaken release of Kebatu \"totally unacceptable\" and urged that he \"must be caught\". The prime minister said he was \"appalled that it has happened\", adding: \"The police are working urgently to track him down, and my government is supporting them.\" Mr Lammy is also said to be furious and has ordered an investigation. He said in a post on X: \"Kebatu must be deported for his crimes, not on our streets.\" Reform UK leader Nigel Farage said: \"The Epping hotel migrant sex attacker has been accidentally freed rather than deported. He is now walking the streets of Essex. Britain is broken.\" Tory leader Kemi Badenoch said Kebatu was released as a result of \"the entire system collapsing under Labour\". Chelmsford MP Marie Goldman called the accidental release a \"cock-up\" that leaves \"huge questions to be answered\", adding: \"Once the manhunt is over, there must be a full, rapid public inquiry into how this happened. This is utterly unacceptable and has potentially put my constituents in danger. I expect answers from the Prison Service.\" The Prison Service said in a statement that it was \"urgently working with police to return an offender to custody following a release in error at HMP Chelmsford\" and launched an investigation into the incident. It is understood that releases in error are incredibly rare and are taken extremely seriously by the Prison Service. But policing and crime commentator Danny Shadow says that releases in error are actually not uncommon. \"Last year, there were 87 prisoners who were released in error. So that's around six or so every single month. Seventy were released from error from prisons and another 17 from the courts,\" the former Labour home affairs advisor told Sky News. An officer has been removed from duties to discharge prisoners while the investigation is ongoing. During his trial, the court heard that Kebatu had tried to kiss the teenager, put his hand on her thigh and brushed her hair after she offered him pizza. The asylum seeker also told the 14-year-old girl and her friend he wanted to have a baby with them and invited them back to the hotel. The incident happened on 7 July, about a week after he arrived in the UK on a boat. Read more from Sky News:Man who danced naked after murdering couple jailedAsylum seeker who killed hotel worker 'bored' during trial Kebatu was also found guilty of sexually assaulting a woman - putting his hand on her thigh and trying to kiss her - when she tried to intervene after seeing him talking to the girl again the following day. Sentencing Kebatu last month, a judge told him his behaviour \"really highlights the poor regard you must have for women\". The incidents sparked anti-migrant protests and counter-protests outside the former Bell Hotel in Epping - as well as at hotels housing asylum seekers across the country."
    },
    {
        "title": "US ramps up 'drug boats' operation by sending in aircraft carrier to region",
        "description": "The US has announced it is sending an aircraft carrier to the waters off South America as it ramps up an operation to target alleged drug smuggling boats.",
        "url": "https://news.sky.com/story/six-killed-in-strike-on-alleged-narco-terrorist-boat-says-us-secretary-of-war-13456647",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-uss-gerald-r-ford-aircraft-carrier_7060771.jpg?20251024175838",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-24 14:31:00",
        "Headline": "Secretary of War Pete Hegseth said that Washington would treat anyone smuggling drugs in the Western Hemisphere as if they were members of al Qaeda. But Democrats say such attacks risk war with Venezuela.",
        "Content": " The US has announced it is sending an aircraft carrier to the waters off South America as it ramps up an operation to target alleged drug smuggling boats. The Pentagon said in a statement that the USS Gerald R Ford would be deployed to the region, including the Caribbean Sea, to \"bolster US capacity to detect, monitor, and disrupt illicit actors and activities that compromise the safety and prosperity of the United States homeland and our security in the Western Hemisphere\". The vessel is the US Navy's largest aircraft carrier. It is currently deployed in the Mediterranean alongside three destroyers, and the group are expected to take around one week to make the journey. There are already eight US Navy ships in the central and South American region, along with a nuclear-powered submarine, adding up to about 6,000 sailors and marines, according to officials. It came as the US secretary of war claimed that six \"narco-terrorists\" had been killed in a strike on an alleged drug smuggling boat in the Caribbean Sea overnight. Pete Hegseth said his military had bombed a vessel which he claimed was operated by Tren de Aragua - a Venezuelan gang designated a terror group by Washington in February. Writing on X, he claimed that the boat was involved in \"illicit narcotics smuggling\" and was transiting along a \"known narco-trafficking route\" when it was struck during the night. All six men on board the boat, which was in international waters, were killed and no US forces were harmed, he said. Ten vessels have now been bombed in recent weeks, killing more than 40 people. Mr Hegseth added: \"If you are a narco-terrorist smuggling drugs in our hemisphere, we will treat you like we treat al Qaeda. Day or NIGHT, we will map your networks, track your people, hunt you down, and kill you.\" While he did not provide any evidence that the vessel was carrying drugs, he did share a 20-second video that appeared to show a boat being hit by a projectile before exploding.  Speaking during a White House press conference last week, Donald Trump argued that the campaign would help tackle the US's opioid crisis. \"Every boat that we knock out, we save 25,000 American lives. So every time you see a boat, and you feel badly you say, 'Wow, that's rough'. It is rough, but if you lose three people and save 25,000 people,\" he said. Read more:Survivors reported after boat strikeUS destroys 'drug smuggling submarine' On Thursday, appearing at a press conference with Mr Hegseth, Mr Trump said that it was necessary to kill the alleged smugglers, because if they were arrested they would only return to transport drugs \"again and again and again\". \"They don't fear that, they have no fear,\" he told reporters. The attacks at sea would soon be followed by operations on land against drug smuggling cartels, Mr Trump claimed. \"We're going to kill them,\" he added. \"They're going to be, like, dead.\" Some Democratic politicians have expressed concerns that the strikes risk dragging the US into a war with Venezuela because of their proximity to the South American country's coast. Others have condemned the attacks as extrajudicial killings that would not stand up in a court of law. Jim Himes, a member of the House of Representatives, told CBS News earlier this month: \"They are illegal killings because the notion that the United States - and this is what the administration says is their justification - is involved in an armed conflict with any drug dealers, any Venezuelan drug dealers, is ludicrous.\" He claimed that Congress had been told \"nothing\" about who was on the boats and how they were identified as a threat."
    },
    {
        "title": "Asylum seeker found guilty of hotel worker's murder",
        "description": "An asylum seeker has been found guilty of murdering a hotel worker at a train station in the West Midlands.",
        "url": "https://news.sky.com/story/asylum-seeker-found-guilty-over-hotel-workers-murder-13454957",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-deng-chol-majek-asylum-seeker_7060644.jpg?20251024144250",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-24 13:33:00",
        "Headline": "Deng Chol Majek, who is from Sudan and claims to be 19 years old, murdered Rhiannon Skye Whyte from the Park Inn hotel, in Walsall, where she worked, to a nearby station.",
        "Content": " An asylum seeker has been found guilty of murdering a hotel worker at a train station in the West Midlands. Deng Chol Majek was caught on CCTV following Rhiannon Skye Whyte from the Park Inn hotel, in Walsall, where he lived and she worked, to the nearby Bescot Stadium station. She was stabbed in the head with a screwdriver 19 times, and 23 times in total, on 20 October last year. Majek, who is from Sudan and claims to be 19 years old, had told Wolverhampton Crown Court he was at the hotel for asylum seekers at the time the 27-year-old was attacked. A two-week trial heard that Majek had previously been reported to security at the hotel after \"spookily\" staring at three female staff members for prolonged periods. Ms Whyte died in hospital three days after the attack, having been found injured in a shelter on the platform by the driver and guard of a train which pulled in about five minutes later. Majek, who is about ten inches taller than Ms Whyte, walked to the Caldmore Green area of Walsall after the attack to buy beer, and was recorded on CCTV apparently wiping blood from his trousers. Read more from Sky News:Man who danced naked after murdering couple jailedManhunt for Epping hotel asylum seeker He returned to the hotel at 12.13am, changed his bloodstained flip-flops for trainers, and was seen dancing with other residents in the car park, within sight of emergency vehicles called to the station. Asked by defence KC Gurdeep Garcha if he was at the train station when Ms Whyte was stabbed, Majek replied: \"No.\" He also denied being \"responsible for that fatal assault\" on the platform. Prosecutor Michelle Heeley KC said of Majek's behaviour after the murder: \"He is celebrating, his mood has changed from that prolonged scowl before the murder to dancing and joy after the murder. It is utterly callous.\" Majek said he had spent time in Libya, Italy and Germany before arriving in the UK to claim asylum in July last year. Mr Justice Soole remanded Majek in custody and ordered a pre-sentence report, and an age assessment report, to be prepared on the defendant. He will be sentenced on 15 December, when victim personal statements are expected to be read to the court. Addressing relatives of Ms Whyte sitting in the public gallery, the judge said: \"No one sitting in this court can have failed to be struck by the quiet dignity that you have all shown through this most demanding 10 days in this court. \"It is unimaginable for those who have not had to go through that. I thank you and admire you for it.\" 'Shocking' lack of remorse Giving a statement outside court, Detective Chief Inspector Paul Attwell, of British Transport Police, said Majek had shown no remorse since the murder. DCI Attwell said: \"It was a brutal, cowardly and unprovoked attack on a vibrant, selfless young woman who had her whole life ahead of her. \"It is truly shocking to me that at no point has Majek ever shown any remorse for taking Rhiannon's life in such a violent and cold-blooded way. \"In fact, he has appeared completely unbothered - bored even - throughout this trial, much to the distress of Rhiannon's poor family, who have had to face her killer in court every day. \"I would like to pay tribute to Rhiannon's family for the unbelievable strength and dignity they have shown in the most horrific of circumstances - and for their unwavering support given during the investigation and the court proceedings which followed. \"I have no doubt in my mind that Rhiannon would be immensely proud of them all.\" 'She was always happy' Rhiannon's sister, Alex Whyte, said her sibling \"always wanted to make everyone else around her happy\". She said: \"No matter what her day had been, she always wanted to make everyone else around her happy. She always prioritised family. That was the most important thing to Rhiannon. Obviously, she has a brother and three sisters. And my mum, who was her best friend. \"Rhiannon is the second youngest. But our baby sister would always say 'I'm your big little sister', because Rhiannon was very soft. \"So, no matter what, we always wanted to protect her. That was our priority most of our life, because Rhiannon never saw danger - Rhiannon never understood how scary the world really could be. \"But no matter what Rhiannon was just happy, always.\" 'Unimaginable pain' She added: \"I am raising Rhiannon's son, and I cannot express the unimaginable pain of having to sit down and explain to a five-year-old that the one person who loves him more than anything will not be coming home. \"The screams of pain from this beautiful little boy will haunt me for the rest of my life, but we will never let Majek haunt him. This child should never have had to experience the pain and misery that he has caused.\""
    },
    {
        "title": "Could the UK run out of drinking water? Experts say 'fast changes' needed",
        "description": "Experts are warning that without \"fast changes\" the UK could run out of drinking water in the future.",
        "url": "https://news.sky.com/story/could-the-uk-run-out-of-drinking-water-experts-say-fast-changes-needed-13456636",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-yorkshire-water_7060720.jpg?20251024163036",
        "type": "Home",
        "Author": "Lisa Dowd",
        "Date Published": "2025-10-24 23:01:00",
        "Headline": "The first seven months of 2025 were the driest since 1976, according to the Environment Agency. With the UK's summers predicted to only get hotter, is the country sleepwalking into a crisis?",
        "Content": "\n          Midlands correspondent\n              @LisaSkyNews\n  Experts are warning that without \"fast changes\" the UK could run out of drinking water in the future. The first seven months of 2025 were the driest since 1976, with reservoirs across England only 56.1% full on average, according to the Environment Agency. \"I think that we do need to worry about the fact that there is this possibility we could run out,\" Hannah Cloke, professor of hydrology from Reading University, told Sky News. \"It's only if we start thinking like that, that we're going to start conserving our water, otherwise we just take it completely for granted. \"It is all of our fault, we have not been paying attention to what's going on… we need some very fast changes to the way that we are using water and the way that we're storing water in order to stop this being a problem in the future, because our summers are only going to get hotter.\" By 2050, the government says that England could face a shortfall of five billion litres of water every day. 'Growing pressure' on water system A Department for Environment, Food and Rural Affairs spokesperson said: \"This government recognises the growing pressure on our water system and is taking decisive action. \"We're delivering over £104bn of private investment to fix leaking pipes, build nine new reservoirs and secure our water supply for the future.\" Latest figures suggest that around 2,690 megalitres of water is lost every day in England through leaks - the equivalent of 1,076 Olympic-sized swimming pools. Read more from Sky News:Scottish government 'utterly irresponsible' over bottle return schemeCow burps have a big impact on global warming 'We have invested an extra £10m'  \"Leaks are a really important issue for us. We have invested an extra £10m just to deal with the weather that we've seen this summer,\" said Dr Geoff Darch, head of strategic asset planning for Anglian Water. Anglian Water is also hoping to build two new reservoirs in the East of England. \"We don't want to stop people using water, it is absolutely essential for everything that we need it to do,\" Dr Darch said. \"But I think we've got to a point now where we have to realise that water is a precious resource, it's something that we all have to look after so that we have it for future generations and for the environment and with climate change and drought, we will need more reservoirs.\" Concerns about 'whole system starting to collapse' In August, the UK received just 62% of its average rainfall, according to the Met Office, which is leading a group of residents to monitor their water stocks closely. \"We collect all our own water from the rain, and so if we don't have the rain that's a significant issue,\" explained Simon Tilly, director of the Hockerton eco housing project in Nottinghamshire. He told Sky News they were working together to use less water. \"I suppose I'm most concerned about the whole system starting to collapse. There's potential for longer droughts and us having a lot of water stress, there's potential for a lot of floods when the drought finishes… and just generally that system going into random patterns where we're getting more droughts and more floods,\" he added."
    },
    {
        "title": "China 'enemy' reference removed from key witness statement for collapsed spy trial",
        "description": "A reference to China being an \"enemy\" of the UK was removed from key evidence for a collapsed spy trial in 2023 as it \"did not reflect government policy\" under the Conservatives at the time, according to the national security adviser.",
        "url": "https://news.sky.com/story/china-enemy-reference-removed-from-key-witness-statement-for-collapsed-spy-trial-13456616",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-uk-china_7060647.jpg?20251024144336",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-24 13:31:00",
        "Headline": "The publication of letters comes amid a political row over the collapse of the prosecution of two men accused of conducting espionage for China.",
        "Content": "A reference to China being an \"enemy\" of the UK was removed from key evidence for a collapsed spy trial in 2023 as it \"did not reflect government policy\" under the Conservatives at the time, according to the national security adviser. In the letter published by parliament's Joint Committee on National Security Strategy earlier on Friday, National Security Adviser (NSA) Jonathan Powell said Counter Terror Police and the Crown Prosecution Service were aware of the change made by Deputy National Security Adviser (DSNA) Matt Collins. This would mean the CPS knew the \"enemy\" reference had been removed before charging the two suspects, according to Mr Powell. In another letter published on Friday, the director of public prosecutions (DPP) Stephen Parkinson told the committee that it took DSNA Mr Collins more than a year to confirm to prosecutors he would not say China posed a threat to UK national security in court. Politics latest: Farage reacts after Reform defeated by Plaid The DPP said a High Court judge ruled in June last year that an \"enemy\" under law is a state which \"presently poses an active threat to the UK's national security\", prompting the CPS to ask the DNSA whether China fulfilled that criteria. He added prosecutors did not believe there would be \"any difficulty in obtaining evidence\" from Mr Collins that China was a national security threat, but added: \"This was a sticking point that could not be overcome.\" \n                  British citizens are volunteering to commit crimes for Russian state for money and 'glamour', says counter-terror chief \n                 \n                  Elon Musk launches personal attack on NASA boss - and says he isn't smart enough for the job\n                 \n                  Did Trump and Zelenskyy's meeting turn into a 'shouting match'?\n                 Mr Parkinson added that the DNSA's \"unwillingness\" to describe China as an active or current threat was \"fatal to the case\" because Christopher Cash and Christopher Berry's defence teams would have been entitled to call him as a witness. The DPP added: \"This factor is compounded by the fact that drafts of the first witness statement, reviewed by us in July 2025, showed that references to China being an 'enemy' or 'possible enemy' had been deleted. \"Those drafts would probably have been disclosable to the defence.\"  A final draft of Mr Collins' statement was sent to then-prime minister Rishi Sunak in December 2023, Mr Powell's letter said. \"Drafts of a statement provided to DNSA included the term 'enemy' but he removed this term from the final draft as it did not reflect government policy,\" the letter reads. Read more:MI5 boss on threats from ChinaThe three key questions about the China spy case that need to be answered It comes amid a political row over the collapse of the prosecution of Christopher Berry and Christopher Cash last month, who were accused of conducting espionage for China. Both individuals vehemently deny the claims. Because the CPS was pursuing charges under the Official Secrets Act 1911, prosecutors would have had to show the defendants were acting for an \"enemy\".  DPP Mr Parkinson has come under pressure to provide a fuller explanation for the abandonment of the case. He has blamed insufficient evidence being provided by the government that Beijing represented a threat to the UK at the time of the alleged offences. The Conservatives have accused Sir Keir Starmer of letting the case collapse, but Labour has said there was nothing more it could have done. The current government has insisted ministers did not intervene in the case or attempt to make representations to ensure the strength of evidence, for fear of interfering with the course of justice. The DNSA and DPP will face questions from the parliamentary committee on Monday afternoon. The current attorney general, Lord Hermer, and the chancellor of the duchy of Lancaster, Darren Jones, will be questioned on Wednesday. The PM's spokesman reiterated the government's position that \"what is relevant in a criminal case of this nature is the government's position at the time of the alleged offences\"."
    },
    {
        "title": "Arctic air to bring first significant cold snap of season to UK",
        "description": "Temperatures are set to drop this weekend, with the first snowfall of the season possible in some parts of the UK.",
        "url": "https://news.sky.com/story/arctic-air-to-bring-first-significant-cold-snap-of-season-to-uk-13456656",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-scotland-snow_7060728.jpg?20251024164937",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-24 15:09:00",
        "Headline": "There is a chance of snow if showers fall over high terrain, with a few centimetres possible over the highest ground in Scotland.",
        "Content": "Temperatures are set to drop this weekend, with the first snowfall of the season possible in some parts of the UK. There is a chance of snow if showers fall over high terrain, with the potential for a few centimetres over the highest ground in Scotland. Sky weather producer Kirsty McCabe said: \"This is the first significant cold snap of the season, but we're not expecting much in the way of snow. \"The biting cold northerly winds are bringing Arctic air, so we'll all feel cold with a significant wind chill, but the showers will be focused on windward coasts and hills. \"Any wintry showers of sleet or snow will tend to be over the mountain tops, above 400 metres or so.\" Read more from Sky News: Rapper charged after man killed in hit-and-runWoman has new 'game-changer' MS treatment  The clocks go back on Sunday, marking the end of the daylight-saving period. \n                  Scottish government 'utterly irresponsible' over bottle return scheme, former UK minister tells court\n                 \n                  Scottish Greens 'riding same wave' as Green Party as membership surge continues\n                 \n                  Jeremy Corbyn and Zarah Sultana's Your Party gains first Scottish representatives\n                 Weather warnings for strong winds and heavy downpours have been removed in some parts of the UK as Storm Benjamin heads eastwards. Four yellow weather warnings were issued by the forecaster for much of the day on Thursday for wind and rain across southern and eastern England, parts of Wales and Yorkshire. The Met Office's deputy chief meteorologist Chris Bulmer said: \"As Storm Benjamin clears the UK and heads towards Denmark late [on Friday] cold Arctic air will sweep across the country, bringing a noticeably chilly weekend as temperatures fall below average. \"Although many areas will see dry weather with sunny spells, it will feel cold in the brisk northerly winds. Showers are expected in the north and west, some of these falling as snow over Scottish mountains.\""
    },
    {
        "title": "Makers of lift used by Louvre thieves reveal tongue-in-cheek advert",
        "description": "The makers of the furniture lift used by the Louvre thieves have told Sky News the device is \"certainly not intended for burglaries\" after publishing a tongue-in-cheek advert making the most of the product's sudden fame.",
        "url": "https://news.sky.com/story/makers-of-lift-used-by-louvre-thieves-reveal-tongue-in-cheek-advert-13456490",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-louvre-robbery-paris-france_7055250.jpg?20251020202442",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-24 10:04:00",
        "Headline": "The manufacturer posted a picture of the lift cordoned off by police tape at the side of the Paris landmark with the tagline \"when you need to move fast\".",
        "Content": "The makers of the furniture lift used by the Louvre thieves have told Sky News the device is \"certainly not intended for burglaries\" after publishing a tongue-in-cheek advert making the most of the product's sudden fame. Bocker manufactures the Agilo furniture lift that was used in Sunday's daring daytime heist. The day after thieves made off with a haul of France's Crown Jewels worth €88m (£76m), the firm posted a photograph showing the lift inside the police cordon next to the Paris museum with the tagline \"when you need to move fast\". Posted on Instagram, Facebook and LinkedIn, it shows the vehicle's ladder propped up against the side of the building, telling prospective buyers the lift can carry \"up to 400kg of treasures at 42m per minute - as quiet as a whisper\". CEO Alexander Bocker told Sky News he and his wife, marketing manager Julia Scharwatz, realised their product had been used in the heist when they saw photos from the scene on Sunday afternoon. \"We were shocked that our lift had been completely misused for this robbery, as it is not approved for transporting people,\" he said. \"And certainly not intended for burglaries. \"Once the initial shock had subsided and it was clear that no one had been injured, black humour took over. \"We brainstormed a bit and played slogan ping pong. My wife finalised it with her marketing team on Monday morning.\"  Users have generally seen the funny side, with one Instagram comment saying the post \"might be the best ad I've seen this year\" and another suggesting the company deserves \"the Oscar for the cleverest advertising\". Mr Bocker said \"99% of the feedback \" has been \"thoroughly positive\". \"We understand that not everyone shares this sense of humour. Humour rarely, if ever, appeals to everyone, but the vast majority laughed heartily.\" As of Friday afternoon, more than 40,000 people had liked the post on Instagram. The CEO said his company has had enquiries from around the world and \"many congratulations on our successful marketing campaign\". The lift used by the thieves belonged to one of the firm's customers, who rents out furniture lifts in the Greater Paris area, he explained. \"During a demonstration on how to use the furniture lift, it was apparently stolen and reported as such by our customer,\" Mr Bocker said. \"It appears that the company's branding has been removed and the number plates replaced.\" Read more from Sky News:Louvre: UK museums could be nextWhat will happen to stolen jewels? The Louvre reopened to visitors on Wednesday, having shut shortly after the heist took place on Sunday morning. The eight stolen objects remain missing and the thieves, who escaped on motorbikes, are still at large.  Museum director Laurence des Cars offered to resign when she appeared before French senators on Wednesday, admitting that the four-minute raid was a \"terrible failure\" and that the site's security cameras, which do not offer full coverage of the building's facade, were inadequate. It came just months after employees went on strike, warning of chronic understaffing and under-resourcing, and saying there were too few eyes on too many rooms."
    },
    {
        "title": "Gang involved in arson attack on London warehouse for Wagner Group jailed",
        "description": "A gang involved in a Russian mercenary group-ordered arson attack on a London warehouse providing aid to Ukraine have been jailed.",
        "url": "https://news.sky.com/story/gang-involved-in-wagner-group-ordered-arson-attack-on-london-warehouse-jailed-13456322",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-arson-attack-warehouse_7060237.jpg?20251024093522",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-24 14:34:00",
        "Headline": "The attack targeted a warehouse used to supply humanitarian aid and StarLink satellite equipment to Ukraine.",
        "Content": " A gang involved in a Russian mercenary group-ordered arson attack on a London warehouse providing aid to Ukraine have been jailed. The attack was carried out at the behest of the Wagner Group - a private military organisation that acts on behalf of the Russian state - and caused around £1m of damage. Dylan Earl, along with Jake Reeves and four others, were sentenced for espionage, terrorism offences and arson at the Old Bailey on Friday for their involvement. Earl, 21, admitted planning the arson attack on industrial units in Leyton, east London, in March last year while working under the instruction of the Wagner group, proscribed as a terror group in the UK. He was jailed for a total of 23 years, of which 17 will be spent in prison and six on extended licence. Reeves was sentenced to 12 years, with a further year on licence. The court was told Earl, from Elmesthorpe, Leicestershire, and Reeves, 24, from Croydon, south London, targeted the site because it was being used to supply humanitarian aid and StarLink satellite equipment to Ukraine. He recruited Reeves to help him plot the arson attack. Reeves then recruited his friend Nii Kojo Mensah to carry out the attack. Mensah recruited his friend Jakeem Rose, while another person, Ugnius Asmena, was also recruited to take part. It took eight fire crews, with 60 firefighters, to get the fire under control. Read more: Britons 'volunteering to commit crimes for Russia', says counter-terror chief 'Planned campaign of terrorism' The gang had plotted further arson attacks on a restaurant and wine shop in Mayfair, central London and planned the attempted kidnapping of the owner, a wealthy Russian dissident, Evgeny Chichvarkin. The arson attack was part of a \"planned campaign of terrorism and sabotage\" in the interests of the Russian state, Mrs Justice Cheema-Grubb said in her sentencing remarks at the Old Bailey. \"This case is about the efforts of the Russian Federation to gain pernicious global influence using social media to enlist saboteurs vast distances from Moscow,\" she added. The judge said the arson attack was not an isolated incident, as a warehouse in Spain was hit 10 days later, and Earl has discussed another potential attack in the Czech Republic. She concluded that the attack had a \"terrorist connection\", regardless of whether the perpetrators were aware of that or not. Earl, who orchestrated the arson attack from his bedroom, told a Wagner Group operative he met on Telegram that he was keen to carry out a series of \"missions\", starting with the Leyton fire. 'Easy meat' for Wagner Group Paul Hynes KC, said in mitigation for Earl, said he was \"easy meat for the very sophisticated operatives of the Wagner Group acting as proxies for the Russian Federation\". He described Earl as an \"easy puppet in the hands of others\" who sought \"praise, importance and significance\" and saw the world through the \"prism of online gaming\". Henry Blaxland KC said in mitigation for Reeves that the evidence showed \"the extent to which the Russian state and agents of the Russian state have managed to penetrate the UK through taking advantage of adolescents buried in their computers\". He said Reeves' judgment was \"distorted\" by his excessive use of the drug ketamine.  Four others jailed Mensah, 23, from Thornton Heath, Rose, 23, of Croydon, and Asmena, 21, of no fixed address, were convicted of aggravated arson. Mensah was jailed for 10 years, Rose was jailed for nine years, and Asmena was jailed for eight years and ten months. They were each handed a further year on extended licence by the judge. Ashton Evans, who helped Earl supply drugs, was also charged as part of the investigation, as social media messages allegedly showed he was both aware of the arson attack and the planned offences in Mayfair. Evans, of Newport, was found not guilty of the first count - relating to the Leyton arson - but guilty of the second count related to the plot to damage businesses in Mayfair. The 20-year-old was jailed for nine years, with a further year on licence. Read more from Sky News:Asylum seeker guilty of hotel worker's murderMan who danced after murdering couple jailed Earl pleaded guilty to preparatory conduct, contrary to section 18 of the National Security Act (NSA) 2023, aggravated arson, possession with intent to supply Class A drugs and possession of criminal property. Reeves pleaded guilty to agreeing to accept a material benefit from a foreign intelligence service, contrary to section 17(2) and (11), NSA 2023, and aggravated arson. Earl and Reeves are the first people to be convicted of offences under the National Security Act, which came into legislation at the end of 2023. 'Hostile agents' for Russia Commander Dominic Murphy, the head of counter-terrorism at the Metropolitan Police, told Sky News's Sadiya Chowdhury that young British men are reaching out online to \"hostile\" foreign states such as Russia and China offering to commit crimes for them. He warned that incidents in which foreign agents attempted to recruit British citizens were becoming \"increasingly common\". Commander Murphy said those targeted tended to be men aged in their late teens to mid-20s, and that while some were approached, others were \"proactively reaching out\" to Iran or Russia. After the sentencing, he added: \"This case is a clear example of an organisation linked to the Russian state using 'proxies', in this case British men, to carry out very serious criminal activity in this country on their behalf. \"The ringleaders, Earl and Reeves, willingly acted as hostile agents on behalf of the Russian state.\" Sir Keir Starmer mentioned the case in his opening remarks for Friday's 'coalition of the willing' meeting in London, saying: \"Just a few moments ago, here in the United Kingdom, we saw the sentencing of six men for a Russian-sponsored arson attack on a warehouse in east London. \"This is a warehouse storing humanitarian aid and satellite equipment destined for Ukraine. We will not tolerate this hostile activity and it just underlines the point - your security is our security. \"What happens on the frontline today is shaping our collective future for years to come.\""
    },
    {
        "title": "Man who killed couple and took bodies in suitcases to Bristol Clifton Suspension Bridge jailed for minimum of 42 years",
        "description": "A man who murdered two people and took their bodies in suitcases to Bristol's Clifton Suspension Bridge has been sentenced to life imprisonment with a minimum term of 42 years. ",
        "url": "https://news.sky.com/story/man-who-killed-couple-and-took-bodies-in-suitcases-to-bristol-clifton-suspension-bridge-jailed-for-minimum-of-42-years-13455859",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-yostin-andres-mosquera_6970055.jpg?20250721155456",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-24 13:19:00",
        "Headline": "After killing Albert Alfonso and Paul Longworth in their west London flat last July, Yostin Andres Mosquera, from Colombia, took the bodies to Bristol to throw them off a bridge, but ran away when members of the public noticed blood leaking from the cases.",
        "Content": " A man who murdered two people and took their bodies in suitcases to Bristol's Clifton Suspension Bridge has been sentenced to life imprisonment with a minimum term of 42 years.  Warning: This article contains graphic descriptions of murders. Yostin Andres Mosquera, from Colombia, killed Albert Alfonso and Paul Longworth in west London on 8 July last year, carrying out what the judge described as \"premeditated and thoroughly wicked crimes\". The 35-year-old was caught when members of the public noticed blood leaking from the cases. He ran away but was caught a few days later. Mosquera had been flown to London by Mr Alfonso and Mr Longworth, who were civil partners he had struck up a friendship with. Mosquera and Mr Alfonso also engaged in extreme sexual acts at the couple's Shepherd's Bush flat. Mr Longworth, 71, was hit over the head with a hammer, shattering his skull, before his body was stuffed in a divan bed. The same evening, during sex, Mosquera repeatedly stabbed Mr Alfonso, 62, in the neck, torso and face, asking him \"Do you like it?\" as he struggled and screamed. The murder was caught on a bedroom camera, which also captured Mosquera singing and dancing as his victim lay dying. Seconds later, he used a computer to try to steal from his victims' bank accounts. He then decapitated their bodies and put the heads in a freezer that he had delivered the next day. The other remains were put in suitcases, and Mosquera hired a van to take him to Bristol on 10 July, where prosecutors said he planned to throw the remains off the bridge. When he arrived, people at a pub saw him struggling with the luggage, which he said contained car parts, and offered to drive him over the bridge.  'Is there a body in there?' They struggled to lift the cases into the car, joking: \"God, these are heavy, is there a body in there?\", so ordered the killer a taxi instead. He later told a cyclist, who spotted him on the bridge with a large red suitcase and a silver trunk, that they contained car parts. Bridge staff noticed something appeared to be leaking from the red suitcase, which Mosquera told them was oil. When they shone their torches on the suitcases, he fled. The trial at Woolwich Crown Court was told that Mosquera - who had been selling sexual images of himself online for years - was motivated by money. He repeatedly tried to find out the price of the couple's flat and stole money from Mr Alfonso after murdering him. The Colombian denied murdering both men, but admitted the manslaughter of Mr Alfonso by reason of loss of control. 'Premeditated and thoroughly wicked crimes' Mosquera claimed Mr Alfonso killed Mr Longworth, telling the jury he believed he was about to be killed when he stabbed Mr Alfonso. He was found guilty of the murders in July. Mr Justice Bennathan told the defendant, who wore a wooden crucifix necklace and appeared to be smiling as he left at the end of the hearing, that Paul Longworth and Albert Alfonso \"were a settled, affectionate couple\". He added: \"It was their tragedy that you, Yostin Mosquera, came into their lives. I now have to sentence you for these premeditated and thoroughly wicked crimes.\" The judge described Mr Alfonso as \"a hardworking man who had shown [Mosquera] kindness and generosity\", while Mr Longworth was a \"harmless, amiable person who had done [the defendant] no wrong\". He said he was \"sure\" Mosquera hoped to sell the couple's flat after killing them, and added that the attacks were \"undoubtedly murders committed for gain\". 'Traumatic and harrowing' Detective Chief Inspector Ollie Stride, who led the investigation, told reporters outside court that the \"traumatic\" case was \"one of the most harrowing murders my team and I have ever investigated\". Officers had, he said, watched the murder of Albert Alfonso \"numerous times\" and the images \"will stay with all of us for a very long time\". Mr Alfonso and Mr Longworth, who shared \"a loving, caring relationship,\" were murdered \"in the most brutal and callous of ways\", he said. He added: \"The couple had opened their door to a man so evil he would take advantage of their lively spirits and generosity and murder them to satisfy his own gains.\" Sentenced over indecent images Before being sentenced for the double murder, he was jailed for 16 months on Friday for possessing \"horrifying\" indecent images and videos of children. Three new charges were put to him prior to the sentencing and he pleaded guilty to three counts of possessing indecent photographs or pseudo-photographs of children. Read more from Sky News:Asylum seeker found guilty of hotel worker's murderSheffield Wednesday enters administrationNew Japanese PM vows to hike defence spending Mr Bennathan said that unlawful child abuse content was found on Mosquera's laptop. As he jailed the defendant, he told him: \"After you were arrested your laptop and other devices were seized. \"They were examined and in it were found at least 1,500 category A indecent photographs or pseudo-photographs, some of them moving images of children. \"They were very young children being subjected to a variety of sexual abuse really of horrifying detail and nature.\" The judge said the jail term for those offences would run concurrently to the sentence for the murders of Mr Alfonso and Mr Longworth."
    },
    {
        "title": "Manhunt for Epping hotel asylum seeker, jailed for sexually assaulting girl, after accidental release",
        "description": "A manhunt has been launched for an accidentally released asylum seeker who was jailed for 12 months earlier this year after he sexually assaulted a 14-year-old girl and a woman in Epping.",
        "url": "https://news.sky.com/story/manhunt-for-epping-hotel-asylum-seeker-jailed-for-sexually-assaulting-girl-after-accidental-release-13456674",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-epping-hadush-kebatu_7002838.jpg?20250904165341",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-24 15:55:00",
        "Headline": "Hadush Gerberslasie Kebatu had been staying at The Bell Hotel in the Essex town, with the incident fuelling weeks of protests at the site.",
        "Content": " A manhunt has been launched for an accidentally released asylum seeker who was jailed for 12 months earlier this year after he sexually assaulted a 14-year-old girl and a woman in Epping. Hadush Gerberslasie Kebatu had been staying at The Bell Hotel in the Essex town, with the incident fuelling weeks of protests at the site. The Ethiopian national was found guilty of two counts of sexual assault, attempted sexual assault, inciting a girl to engage in sexual activity and harassment without violence earlier this month. Follow the latest updates on the manhunt District judge Christopher Williams said Kebatu posed a \"significant risk of reoffending\" when he sentenced him to 12 months in prison in September. Sky News understands Kebatu was being released from HMP Chelmsford as he was due to be immediately deported. He was released on the expectation that he would be picked up by immigration enforcement, but it is currently unclear what happened next. It is understood that the Home Office was ready to take Kebatu to an immigration removal centre. Essex Police launched a manhunt for Kebatu after he was accidentally freed on Friday morning, and the force said in a statement that the asylum seeker boarded a train to London shortly after midday. \"We were informed by the prison service at 12.57pm today of an error this morning surrounding the release of an individual,\" Essex police said in a statement. The force added that \"fast-paced enquiries have shown that the man boarded a London-bound train at Chelmsford Railway Station at 12.41pm\". The Greater Anglia train stopped at Shenfield and Stratford before arriving at London Liverpool Street at 13.18pm, according to Trainline data. Deputy Prime Minister and Justice Secretary David Lammy said Kebatu was \"at large in London\", with three police forces - Essex Police, Metropolitan Police and British Transport Police - searching for the \"dangerous\" asylum seeker. \"I'm livid. I'm livid on behalf of the public that this individual who committed a sexual assault on a young minor and a woman is at large tonight,\" Mr Lammy said, adding: \"He should not have been released in this way.\"  The father of the 14-year-old girl who was assaulted by Kebatu was visibly upset as he turned up at Chelmsford jail asking for answers after his daughter's assailant was accidentally released. He told Sky News' home news correspondent Mollie Malone that he felt \"let down\" by every authority, and \"frustrated\" at the thought of Kebatu being able to escape prison custody, after attacking his daughter in the summer. \"The justice system has let us down,\" the girl's father said. Kebatu's lawyer, Molly Dyas, told Chelmsford Magistrates' Court during his trial that it was his \"firm wish\" to be deported. Under the UK Borders Act 2007, a deportation order must be made where a foreign national has been convicted of an offence and received a custodial sentence of at least 12 months. Sir Keir Starmer called the mistaken release of Kebatu \"totally unacceptable\" and urged that he \"must be caught\". The prime minister said he was \"appalled that it has happened\", adding: \"The police are working urgently to track him down, and my government is supporting them.\" Mr Lammy is also said to be furious and has ordered an investigation. He said in a post on X: \"Kebatu must be deported for his crimes, not on our streets.\" Reform UK leader Nigel Farage said: \"The Epping hotel migrant sex attacker has been accidentally freed rather than deported. He is now walking the streets of Essex. Britain is broken.\" Tory leader Kemi Badenoch said Kebatu was released as a result of \"the entire system collapsing under Labour\". Chelmsford MP Marie Goldman called the accidental release a \"cock-up\" that leaves \"huge questions to be answered\", adding: \"Once the manhunt is over, there must be a full, rapid public inquiry into how this happened. This is utterly unacceptable and has potentially put my constituents in danger. I expect answers from the Prison Service.\" The Prison Service said in a statement that it was \"urgently working with police to return an offender to custody following a release in error at HMP Chelmsford\" and launched an investigation into the incident. It is understood that releases in error are incredibly rare and are taken extremely seriously by the Prison Service. But policing and crime commentator Danny Shadow says that releases in error are actually not uncommon. \"Last year, there were 87 prisoners who were released in error. So that's around six or so every single month. Seventy were released from error from prisons and another 17 from the courts,\" the former Labour home affairs advisor told Sky News. An officer has been removed from duties to discharge prisoners while the investigation is ongoing. During his trial, the court heard that Kebatu had tried to kiss the teenager, put his hand on her thigh and brushed her hair after she offered him pizza. The asylum seeker also told the 14-year-old girl and her friend he wanted to have a baby with them and invited them back to the hotel. The incident happened on 7 July, about a week after he arrived in the UK on a boat. Read more from Sky News:Man who danced naked after murdering couple jailedAsylum seeker who killed hotel worker 'bored' during trial Kebatu was also found guilty of sexually assaulting a woman - putting his hand on her thigh and trying to kiss her - when she tried to intervene after seeing him talking to the girl again the following day. Sentencing Kebatu last month, a judge told him his behaviour \"really highlights the poor regard you must have for women\". The incidents sparked anti-migrant protests and counter-protests outside the former Bell Hotel in Epping - as well as at hotels housing asylum seekers across the country."
    },
    {
        "title": "Could the UK run out of drinking water? Experts say 'fast changes' needed",
        "description": "Experts are warning that without \"fast changes\" the UK could run out of drinking water in the future.",
        "url": "https://news.sky.com/story/could-the-uk-run-out-of-drinking-water-experts-say-fast-changes-needed-13456636",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-yorkshire-water_7060720.jpg?20251024163036",
        "type": "UK",
        "Author": "Lisa Dowd",
        "Date Published": "2025-10-24 23:01:00",
        "Headline": "The first seven months of 2025 were the driest since 1976, according to the Environment Agency. With the UK's summers predicted to only get hotter, is the country sleepwalking into a crisis?",
        "Content": "\n          Midlands correspondent\n              @LisaSkyNews\n  Experts are warning that without \"fast changes\" the UK could run out of drinking water in the future. The first seven months of 2025 were the driest since 1976, with reservoirs across England only 56.1% full on average, according to the Environment Agency. \"I think that we do need to worry about the fact that there is this possibility we could run out,\" Hannah Cloke, professor of hydrology from Reading University, told Sky News. \"It's only if we start thinking like that, that we're going to start conserving our water, otherwise we just take it completely for granted. \"It is all of our fault, we have not been paying attention to what's going on… we need some very fast changes to the way that we are using water and the way that we're storing water in order to stop this being a problem in the future, because our summers are only going to get hotter.\" By 2050, the government says that England could face a shortfall of five billion litres of water every day. 'Growing pressure' on water system A Department for Environment, Food and Rural Affairs spokesperson said: \"This government recognises the growing pressure on our water system and is taking decisive action. \"We're delivering over £104bn of private investment to fix leaking pipes, build nine new reservoirs and secure our water supply for the future.\" Latest figures suggest that around 2,690 megalitres of water is lost every day in England through leaks - the equivalent of 1,076 Olympic-sized swimming pools. Read more from Sky News:Scottish government 'utterly irresponsible' over bottle return schemeCow burps have a big impact on global warming 'We have invested an extra £10m'  \"Leaks are a really important issue for us. We have invested an extra £10m just to deal with the weather that we've seen this summer,\" said Dr Geoff Darch, head of strategic asset planning for Anglian Water. Anglian Water is also hoping to build two new reservoirs in the East of England. \"We don't want to stop people using water, it is absolutely essential for everything that we need it to do,\" Dr Darch said. \"But I think we've got to a point now where we have to realise that water is a precious resource, it's something that we all have to look after so that we have it for future generations and for the environment and with climate change and drought, we will need more reservoirs.\" Concerns about 'whole system starting to collapse' In August, the UK received just 62% of its average rainfall, according to the Met Office, which is leading a group of residents to monitor their water stocks closely. \"We collect all our own water from the rain, and so if we don't have the rain that's a significant issue,\" explained Simon Tilly, director of the Hockerton eco housing project in Nottinghamshire. He told Sky News they were working together to use less water. \"I suppose I'm most concerned about the whole system starting to collapse. There's potential for longer droughts and us having a lot of water stress, there's potential for a lot of floods when the drought finishes… and just generally that system going into random patterns where we're getting more droughts and more floods,\" he added."
    },
    {
        "title": "Asylum seeker found guilty of hotel worker's murder",
        "description": "An asylum seeker has been found guilty of murdering a hotel worker at a train station in the West Midlands.",
        "url": "https://news.sky.com/story/asylum-seeker-found-guilty-over-hotel-workers-murder-13454957",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-deng-chol-majek-asylum-seeker_7060644.jpg?20251024144250",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-24 13:33:00",
        "Headline": "Deng Chol Majek, who is from Sudan and claims to be 19 years old, murdered Rhiannon Skye Whyte from the Park Inn hotel, in Walsall, where she worked, to a nearby station.",
        "Content": " An asylum seeker has been found guilty of murdering a hotel worker at a train station in the West Midlands. Deng Chol Majek was caught on CCTV following Rhiannon Skye Whyte from the Park Inn hotel, in Walsall, where he lived and she worked, to the nearby Bescot Stadium station. She was stabbed in the head with a screwdriver 19 times, and 23 times in total, on 20 October last year. Majek, who is from Sudan and claims to be 19 years old, had told Wolverhampton Crown Court he was at the hotel for asylum seekers at the time the 27-year-old was attacked. A two-week trial heard that Majek had previously been reported to security at the hotel after \"spookily\" staring at three female staff members for prolonged periods. Ms Whyte died in hospital three days after the attack, having been found injured in a shelter on the platform by the driver and guard of a train which pulled in about five minutes later. Majek, who is about ten inches taller than Ms Whyte, walked to the Caldmore Green area of Walsall after the attack to buy beer, and was recorded on CCTV apparently wiping blood from his trousers. Read more from Sky News:Man who danced naked after murdering couple jailedManhunt for Epping hotel asylum seeker He returned to the hotel at 12.13am, changed his bloodstained flip-flops for trainers, and was seen dancing with other residents in the car park, within sight of emergency vehicles called to the station. Asked by defence KC Gurdeep Garcha if he was at the train station when Ms Whyte was stabbed, Majek replied: \"No.\" He also denied being \"responsible for that fatal assault\" on the platform. Prosecutor Michelle Heeley KC said of Majek's behaviour after the murder: \"He is celebrating, his mood has changed from that prolonged scowl before the murder to dancing and joy after the murder. It is utterly callous.\" Majek said he had spent time in Libya, Italy and Germany before arriving in the UK to claim asylum in July last year. Mr Justice Soole remanded Majek in custody and ordered a pre-sentence report, and an age assessment report, to be prepared on the defendant. He will be sentenced on 15 December, when victim personal statements are expected to be read to the court. Addressing relatives of Ms Whyte sitting in the public gallery, the judge said: \"No one sitting in this court can have failed to be struck by the quiet dignity that you have all shown through this most demanding 10 days in this court. \"It is unimaginable for those who have not had to go through that. I thank you and admire you for it.\" 'Shocking' lack of remorse Giving a statement outside court, Detective Chief Inspector Paul Attwell, of British Transport Police, said Majek had shown no remorse since the murder. DCI Attwell said: \"It was a brutal, cowardly and unprovoked attack on a vibrant, selfless young woman who had her whole life ahead of her. \"It is truly shocking to me that at no point has Majek ever shown any remorse for taking Rhiannon's life in such a violent and cold-blooded way. \"In fact, he has appeared completely unbothered - bored even - throughout this trial, much to the distress of Rhiannon's poor family, who have had to face her killer in court every day. \"I would like to pay tribute to Rhiannon's family for the unbelievable strength and dignity they have shown in the most horrific of circumstances - and for their unwavering support given during the investigation and the court proceedings which followed. \"I have no doubt in my mind that Rhiannon would be immensely proud of them all.\" 'She was always happy' Rhiannon's sister, Alex Whyte, said her sibling \"always wanted to make everyone else around her happy\". She said: \"No matter what her day had been, she always wanted to make everyone else around her happy. She always prioritised family. That was the most important thing to Rhiannon. Obviously, she has a brother and three sisters. And my mum, who was her best friend. \"Rhiannon is the second youngest. But our baby sister would always say 'I'm your big little sister', because Rhiannon was very soft. \"So, no matter what, we always wanted to protect her. That was our priority most of our life, because Rhiannon never saw danger - Rhiannon never understood how scary the world really could be. \"But no matter what Rhiannon was just happy, always.\" 'Unimaginable pain' She added: \"I am raising Rhiannon's son, and I cannot express the unimaginable pain of having to sit down and explain to a five-year-old that the one person who loves him more than anything will not be coming home. \"The screams of pain from this beautiful little boy will haunt me for the rest of my life, but we will never let Majek haunt him. This child should never have had to experience the pain and misery that he has caused.\""
    },
    {
        "title": "Gang involved in arson attack on London warehouse for Wagner Group jailed",
        "description": "A gang involved in a Russian mercenary group-ordered arson attack on a London warehouse providing aid to Ukraine have been jailed.",
        "url": "https://news.sky.com/story/gang-involved-in-wagner-group-ordered-arson-attack-on-london-warehouse-jailed-13456322",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-arson-attack-warehouse_7060237.jpg?20251024093522",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-24 14:34:00",
        "Headline": "The attack targeted a warehouse used to supply humanitarian aid and StarLink satellite equipment to Ukraine.",
        "Content": " A gang involved in a Russian mercenary group-ordered arson attack on a London warehouse providing aid to Ukraine have been jailed. The attack was carried out at the behest of the Wagner Group - a private military organisation that acts on behalf of the Russian state - and caused around £1m of damage. Dylan Earl, along with Jake Reeves and four others, were sentenced for espionage, terrorism offences and arson at the Old Bailey on Friday for their involvement. Earl, 21, admitted planning the arson attack on industrial units in Leyton, east London, in March last year while working under the instruction of the Wagner group, proscribed as a terror group in the UK. He was jailed for a total of 23 years, of which 17 will be spent in prison and six on extended licence. Reeves was sentenced to 12 years, with a further year on licence. The court was told Earl, from Elmesthorpe, Leicestershire, and Reeves, 24, from Croydon, south London, targeted the site because it was being used to supply humanitarian aid and StarLink satellite equipment to Ukraine. He recruited Reeves to help him plot the arson attack. Reeves then recruited his friend Nii Kojo Mensah to carry out the attack. Mensah recruited his friend Jakeem Rose, while another person, Ugnius Asmena, was also recruited to take part. It took eight fire crews, with 60 firefighters, to get the fire under control. Read more: Britons 'volunteering to commit crimes for Russia', says counter-terror chief 'Planned campaign of terrorism' The gang had plotted further arson attacks on a restaurant and wine shop in Mayfair, central London and planned the attempted kidnapping of the owner, a wealthy Russian dissident, Evgeny Chichvarkin. The arson attack was part of a \"planned campaign of terrorism and sabotage\" in the interests of the Russian state, Mrs Justice Cheema-Grubb said in her sentencing remarks at the Old Bailey. \"This case is about the efforts of the Russian Federation to gain pernicious global influence using social media to enlist saboteurs vast distances from Moscow,\" she added. The judge said the arson attack was not an isolated incident, as a warehouse in Spain was hit 10 days later, and Earl has discussed another potential attack in the Czech Republic. She concluded that the attack had a \"terrorist connection\", regardless of whether the perpetrators were aware of that or not. Earl, who orchestrated the arson attack from his bedroom, told a Wagner Group operative he met on Telegram that he was keen to carry out a series of \"missions\", starting with the Leyton fire. 'Easy meat' for Wagner Group Paul Hynes KC, said in mitigation for Earl, said he was \"easy meat for the very sophisticated operatives of the Wagner Group acting as proxies for the Russian Federation\". He described Earl as an \"easy puppet in the hands of others\" who sought \"praise, importance and significance\" and saw the world through the \"prism of online gaming\". Henry Blaxland KC said in mitigation for Reeves that the evidence showed \"the extent to which the Russian state and agents of the Russian state have managed to penetrate the UK through taking advantage of adolescents buried in their computers\". He said Reeves' judgment was \"distorted\" by his excessive use of the drug ketamine.  Four others jailed Mensah, 23, from Thornton Heath, Rose, 23, of Croydon, and Asmena, 21, of no fixed address, were convicted of aggravated arson. Mensah was jailed for 10 years, Rose was jailed for nine years, and Asmena was jailed for eight years and ten months. They were each handed a further year on extended licence by the judge. Ashton Evans, who helped Earl supply drugs, was also charged as part of the investigation, as social media messages allegedly showed he was both aware of the arson attack and the planned offences in Mayfair. Evans, of Newport, was found not guilty of the first count - relating to the Leyton arson - but guilty of the second count related to the plot to damage businesses in Mayfair. The 20-year-old was jailed for nine years, with a further year on licence. Read more from Sky News:Asylum seeker guilty of hotel worker's murderMan who danced after murdering couple jailed Earl pleaded guilty to preparatory conduct, contrary to section 18 of the National Security Act (NSA) 2023, aggravated arson, possession with intent to supply Class A drugs and possession of criminal property. Reeves pleaded guilty to agreeing to accept a material benefit from a foreign intelligence service, contrary to section 17(2) and (11), NSA 2023, and aggravated arson. Earl and Reeves are the first people to be convicted of offences under the National Security Act, which came into legislation at the end of 2023. 'Hostile agents' for Russia Commander Dominic Murphy, the head of counter-terrorism at the Metropolitan Police, told Sky News's Sadiya Chowdhury that young British men are reaching out online to \"hostile\" foreign states such as Russia and China offering to commit crimes for them. He warned that incidents in which foreign agents attempted to recruit British citizens were becoming \"increasingly common\". Commander Murphy said those targeted tended to be men aged in their late teens to mid-20s, and that while some were approached, others were \"proactively reaching out\" to Iran or Russia. After the sentencing, he added: \"This case is a clear example of an organisation linked to the Russian state using 'proxies', in this case British men, to carry out very serious criminal activity in this country on their behalf. \"The ringleaders, Earl and Reeves, willingly acted as hostile agents on behalf of the Russian state.\" Sir Keir Starmer mentioned the case in his opening remarks for Friday's 'coalition of the willing' meeting in London, saying: \"Just a few moments ago, here in the United Kingdom, we saw the sentencing of six men for a Russian-sponsored arson attack on a warehouse in east London. \"This is a warehouse storing humanitarian aid and satellite equipment destined for Ukraine. We will not tolerate this hostile activity and it just underlines the point - your security is our security. \"What happens on the frontline today is shaping our collective future for years to come.\""
    },
    {
        "title": "Man who killed couple and took bodies in suitcases to Bristol Clifton Suspension Bridge jailed for minimum of 42 years",
        "description": "A man who murdered two people and took their bodies in suitcases to Bristol's Clifton Suspension Bridge has been sentenced to life imprisonment with a minimum term of 42 years. ",
        "url": "https://news.sky.com/story/man-who-killed-couple-and-took-bodies-in-suitcases-to-bristol-clifton-suspension-bridge-jailed-for-minimum-of-42-years-13455859",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-yostin-andres-mosquera_6970055.jpg?20250721155456",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-24 13:19:00",
        "Headline": "After killing Albert Alfonso and Paul Longworth in their west London flat last July, Yostin Andres Mosquera, from Colombia, took the bodies to Bristol to throw them off a bridge, but ran away when members of the public noticed blood leaking from the cases.",
        "Content": " A man who murdered two people and took their bodies in suitcases to Bristol's Clifton Suspension Bridge has been sentenced to life imprisonment with a minimum term of 42 years.  Warning: This article contains graphic descriptions of murders. Yostin Andres Mosquera, from Colombia, killed Albert Alfonso and Paul Longworth in west London on 8 July last year, carrying out what the judge described as \"premeditated and thoroughly wicked crimes\". The 35-year-old was caught when members of the public noticed blood leaking from the cases. He ran away but was caught a few days later. Mosquera had been flown to London by Mr Alfonso and Mr Longworth, who were civil partners he had struck up a friendship with. Mosquera and Mr Alfonso also engaged in extreme sexual acts at the couple's Shepherd's Bush flat. Mr Longworth, 71, was hit over the head with a hammer, shattering his skull, before his body was stuffed in a divan bed. The same evening, during sex, Mosquera repeatedly stabbed Mr Alfonso, 62, in the neck, torso and face, asking him \"Do you like it?\" as he struggled and screamed. The murder was caught on a bedroom camera, which also captured Mosquera singing and dancing as his victim lay dying. Seconds later, he used a computer to try to steal from his victims' bank accounts. He then decapitated their bodies and put the heads in a freezer that he had delivered the next day. The other remains were put in suitcases, and Mosquera hired a van to take him to Bristol on 10 July, where prosecutors said he planned to throw the remains off the bridge. When he arrived, people at a pub saw him struggling with the luggage, which he said contained car parts, and offered to drive him over the bridge.  'Is there a body in there?' They struggled to lift the cases into the car, joking: \"God, these are heavy, is there a body in there?\", so ordered the killer a taxi instead. He later told a cyclist, who spotted him on the bridge with a large red suitcase and a silver trunk, that they contained car parts. Bridge staff noticed something appeared to be leaking from the red suitcase, which Mosquera told them was oil. When they shone their torches on the suitcases, he fled. The trial at Woolwich Crown Court was told that Mosquera - who had been selling sexual images of himself online for years - was motivated by money. He repeatedly tried to find out the price of the couple's flat and stole money from Mr Alfonso after murdering him. The Colombian denied murdering both men, but admitted the manslaughter of Mr Alfonso by reason of loss of control. 'Premeditated and thoroughly wicked crimes' Mosquera claimed Mr Alfonso killed Mr Longworth, telling the jury he believed he was about to be killed when he stabbed Mr Alfonso. He was found guilty of the murders in July. Mr Justice Bennathan told the defendant, who wore a wooden crucifix necklace and appeared to be smiling as he left at the end of the hearing, that Paul Longworth and Albert Alfonso \"were a settled, affectionate couple\". He added: \"It was their tragedy that you, Yostin Mosquera, came into their lives. I now have to sentence you for these premeditated and thoroughly wicked crimes.\" The judge described Mr Alfonso as \"a hardworking man who had shown [Mosquera] kindness and generosity\", while Mr Longworth was a \"harmless, amiable person who had done [the defendant] no wrong\". He said he was \"sure\" Mosquera hoped to sell the couple's flat after killing them, and added that the attacks were \"undoubtedly murders committed for gain\". 'Traumatic and harrowing' Detective Chief Inspector Ollie Stride, who led the investigation, told reporters outside court that the \"traumatic\" case was \"one of the most harrowing murders my team and I have ever investigated\". Officers had, he said, watched the murder of Albert Alfonso \"numerous times\" and the images \"will stay with all of us for a very long time\". Mr Alfonso and Mr Longworth, who shared \"a loving, caring relationship,\" were murdered \"in the most brutal and callous of ways\", he said. He added: \"The couple had opened their door to a man so evil he would take advantage of their lively spirits and generosity and murder them to satisfy his own gains.\" Sentenced over indecent images Before being sentenced for the double murder, he was jailed for 16 months on Friday for possessing \"horrifying\" indecent images and videos of children. Three new charges were put to him prior to the sentencing and he pleaded guilty to three counts of possessing indecent photographs or pseudo-photographs of children. Read more from Sky News:Asylum seeker found guilty of hotel worker's murderSheffield Wednesday enters administrationNew Japanese PM vows to hike defence spending Mr Bennathan said that unlawful child abuse content was found on Mosquera's laptop. As he jailed the defendant, he told him: \"After you were arrested your laptop and other devices were seized. \"They were examined and in it were found at least 1,500 category A indecent photographs or pseudo-photographs, some of them moving images of children. \"They were very young children being subjected to a variety of sexual abuse really of horrifying detail and nature.\" The judge said the jail term for those offences would run concurrently to the sentence for the murders of Mr Alfonso and Mr Longworth."
    },
    {
        "title": "Arctic air to bring first significant cold snap of season to UK",
        "description": "Temperatures are set to drop this weekend, with the first snowfall of the season possible in some parts of the UK.",
        "url": "https://news.sky.com/story/arctic-air-to-bring-first-significant-cold-snap-of-season-to-uk-13456656",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-scotland-snow_7060728.jpg?20251024164937",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-24 15:09:00",
        "Headline": "There is a chance of snow if showers fall over high terrain, with a few centimetres possible over the highest ground in Scotland.",
        "Content": "Temperatures are set to drop this weekend, with the first snowfall of the season possible in some parts of the UK. There is a chance of snow if showers fall over high terrain, with the potential for a few centimetres over the highest ground in Scotland. Sky weather producer Kirsty McCabe said: \"This is the first significant cold snap of the season, but we're not expecting much in the way of snow. \"The biting cold northerly winds are bringing Arctic air, so we'll all feel cold with a significant wind chill, but the showers will be focused on windward coasts and hills. \"Any wintry showers of sleet or snow will tend to be over the mountain tops, above 400 metres or so.\" Read more from Sky News: Rapper charged after man killed in hit-and-runWoman has new 'game-changer' MS treatment  The clocks go back on Sunday, marking the end of the daylight-saving period. \n                  Scottish government 'utterly irresponsible' over bottle return scheme, former UK minister tells court\n                 \n                  Scottish Greens 'riding same wave' as Green Party as membership surge continues\n                 \n                  Jeremy Corbyn and Zarah Sultana's Your Party gains first Scottish representatives\n                 Weather warnings for strong winds and heavy downpours have been removed in some parts of the UK as Storm Benjamin heads eastwards. Four yellow weather warnings were issued by the forecaster for much of the day on Thursday for wind and rain across southern and eastern England, parts of Wales and Yorkshire. The Met Office's deputy chief meteorologist Chris Bulmer said: \"As Storm Benjamin clears the UK and heads towards Denmark late [on Friday] cold Arctic air will sweep across the country, bringing a noticeably chilly weekend as temperatures fall below average. \"Although many areas will see dry weather with sunny spells, it will feel cold in the brisk northerly winds. Showers are expected in the north and west, some of these falling as snow over Scottish mountains.\""
    },
    {
        "title": "Caerphilly by-election: Just like that! In Tommy Cooper's birthplace, Farage nowhere to be seen as Reform loses",
        "description": "In a by-election in the birthplace of the comedian Tommy Cooper, it was Plaid Cymru that had the last laugh.",
        "url": "https://news.sky.com/story/caerphilly-by-election-with-farage-absent-reform-candidate-looked-neglected-and-dejected-13456263",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-reform-caerphilly_7057954.jpg?20251024071757",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-10-24 04:04:00",
        "Headline": "The joke among Plaid supporters at the count was that long before the declaration Mr Farage was halfway down the M4 on his way back to London, Jon Craig writes.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n In a by-election in the birthplace of the comedian Tommy Cooper, it was Plaid Cymru that had the last laugh. During the campaign, Nigel Farage and Reform UK's candidate Llyr Powell had posed for photos in front of the statue of the legendary comic in Caerphilly. But when the result was declared at 2.10am at the count in the town's leisure centre, Mr Farage - who'd been campaigning for Mr Powell on polling day - was nowhere to be seen. In fact, the joke among Plaid supporters at the count was that Mr Farage was halfway down the M4 on his way back to London - long before the declaration. It was one of those by-election counts when one party - in this case Reform UK - is expected to win as the polls close at 10pm, but within a few hours it becomes clear the other party looks like winning. After all, Reform UK threw everything at the campaign, Mr Farage had visited three times and a poll last week had suggested his party was ahead of Plaid Cymru by 42% to 38%. Plaid's by-election winner Lindsay Whittle, a cheerful extrovert dressed in a colourful crimson jacket, admitted in a Sky News interview that he'd fought parliamentary and Senedd elections in Caerphilly unsuccessfully 13 times previously. \n                  Caerphilly by-election: Will Plaid or Reform have last laugh in Tommy Cooper's birthplace?\n                 \n                  Migrant with AK-47 face tattoo who threatened to kill Nigel Farage shouts from dock as he's jailed\n                 \n                  Migrant with AK-47 face tattoo found guilty of threatening to kill Nigel Farage\n                 If at first you don't succeed... He was chipper from the moment he arrived at the count even before the polls closed, and was clearly pretty confident he was going to win. Contrast his body language with the forlorn figure of Mr Powell, who without Mr Farage or Reform UK's Zia Yusuf - who'd been at the count for an hour or so at the beginning but had left - appeared to arrive on his own and looked neglected by his party as well as dejected. As runner up, poor Mr Powell had the opportunity to make a speech after the declaration but chose not to, though some of the other losing candidates did. This result is a huge boost for Plaid, however, as the party aims to seize control of the Senedd in elections next year. But it's a big setback for Mr Farage's hopes of making inroads in Wales. But for Labour, whose vote crumbled like Caerphilly cheese, it's a disaster and will send many Labour MPs into a panic about their chances of holding their seat at the next general election. In the end, for all the talk of the result being close, it was a relatively comfortable win for Plaid, with a majority of nearly 4,000. In his Sky News interview, Labour's Huw Irranca-Davies, a former Westminster MP who's now deputy first minister in Wales, blamed Reform for cranking up immigration as an issue in the campaign for Labour's slump in support.  But this result shows that it isn't only Reform that poses a threat to Labour, but also parties on the left such as the nationalists. Caerphilly has sent Labour MPs to Westminster for more than a century and Labour Welsh assembly and Senedd members to Cardiff since devolution began in 1999. This was a Labour stronghold as impregnable as Caerphilly's mighty castle. Not any more though, it seems. The result will serve as a warning that Labour's dominance in the valleys and what might be described as \"old industrial Wales\" may be coming to an end. And just like a Tommy Cooper magic trick that goes wrong, that could happen just like that."
    },
    {
        "title": "British citizens are volunteering to commit crimes for Russian state for money and 'glamour', says counter-terror chief ",
        "description": "Young British men are reaching out online to \"hostile\" foreign states such as Russia and China offering to commit crimes for them,&#160;the head of counter-terrorism at the Metropolitan Police has told Sky News's Sadiya Chowdhury.",
        "url": "https://news.sky.com/story/british-citizens-are-volunteering-to-commit-crimes-for-russian-state-for-money-and-glamour-says-counter-terror-chief-13456527",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-dylan-earl-russia-wagner_7060521.jpg?20251024131014",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-24 10:56:00",
        "Headline": "Metropolitan Police Commander Dominic Murphy said incidents in which hostile states attempted to recruit young men in the UK were becoming \"increasingly common\".",
        "Content": " Young British men are reaching out online to \"hostile\" foreign states such as Russia and China offering to commit crimes for them, the head of counter-terrorism at the Metropolitan Police has told Sky News's Sadiya Chowdhury. Commander Dominic Murphy was speaking ahead of the sentencing of Dylan Earl, 21, a part-time drug dealer, Jake Reeves, 23, an aircraft cleaner at Gatwick Airport, and four others for espionage, terrorism offences and arson. On Thursday, the Old Bailey heard that Earl had been \"groomed\" by a chatbot operated by mercenaries to commit \"a sustained campaign of terrorism and sabotage on UK soil\". Earl and Reeves both pleaded guilty to offences under the National Security Act 2023, and became the UK's first offenders to be sentenced under this new counter-espionage law. The trial of their accomplices - Nii Kojo Mensah, Jakeem Rose, Ugnius Asmena and Ashton Evans - heard how Earl had been in contact with internet users believed to be Russian agents. Users called PrivetBot and L_U_C_K_Y_S_T_R_I_K_E had told him to collect details of Ukraine-linked businesses, warehouses and bank accounts. Earl was also instructed to watch the television spy series The Americans. UK authorities believe those accounts were agents of the Russian-backed Wagner group, a now-disbanded mercenary organisation. Commander Murphy warned that incidents in which foreign agents attempted to recruit British citizens were becoming \"increasingly common\". He said those targeted tended to be men aged in their late teens to mid-20s, and that while some were approached, others were \"proactively reaching out\" to Iran or Russia.  Commander Murphy said: \"They really are the definition of proxies on working on behalf of a foreign government here in this country to undertake their activity which directly harms us.\" The number of potential recruits available online to hostile state actors posed a \"challenge\" for the police, he added. In addition to the offer of a £9,000 payment, he said Earl had been motivated by the glamour of working for a foreign state. Read more from Sky News:Asylum seeker found guilty of hotel worker's murderSheffield Wednesday enters administrationNew Japanese PM vows to hike defence spending \"I think there was something about feeling like he was part of the Wagner group and then, as a result, part of the Russian state. \"So for Earl at least, it's not the case for everybody that we see... at least that did appear to be part of his motivation.\" Earl was \"attracted to Russia, a Russian way of life,\" the counter-terror chief said. \"He even talked in some of his chat about potentially moving to Russia for a new start. So I think it was about more than money for Earl.\" Commander Murphy said it was difficult to say how many people were potentially working for the Russian state across the UK, but added there were \"a number of investigations that are similar to this all over the country\". He said that the Kremlin had been forced to attempt to recruit Britons online because it was much harder for its operatives to work in the UK following the response to the Salisbury poisonings, in which former Russian military officer Sergei Skripal was targeted with a nerve agent. \"What they're doing is using social media, some encrypted social media to reach out to young people here,\" he said. \"They're mostly people involved in criminality or on the periphery of crime. And then enticing them into conducting activity on their behalf. \"But, as we saw with Earl, in this case he was a willing participant. In fact, he was going further trying to offer additional support to the Russian state for activity here in the UK but also in Europe.\" The Kremlin has denied engaging in sabotage in the UK and in EU countries. In a statement, Moscow's embassy in London said an \"aggressive campaign\" of anti-Russian scaremongering was designed to distract people in the UK from their country's domestic problems. It added: \"It is a political tool designed to desensitise the electorate to worsening socio-economic problems at home and to justify significant, though unnecessary hikes in military spending. \"By invoking the spectre of a Russian threat, European governments seek to forge a consensus for a more confrontational foreign policy towards Moscow and to undermine any efforts aimed at finding a diplomatic resolution of the Ukraine crisis.\""
    },
    {
        "title": " Turkey urges US to act after accusing Israel of breaching Gaza ceasefire",
        "description": "Turkey has urged the US to take action after accusing Israel of violating the Gaza ceasefire deal.",
        "url": "https://news.sky.com/story/turkey-urges-us-to-act-after-accusing-israel-of-breaching-gaza-ceasefire-13456611",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-erdogan_7060662.jpg?20251024145429",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-24 13:26:00",
        "Headline": "The country's president Recep Tayyip Erdogan said Washington should consider sanctions and halting arms sales to put pressure on Israel to abide by the truce's terms.",
        "Content": "Turkey has urged the US to take action after accusing Israel of violating the Gaza ceasefire deal. The country's president Recep Tayyip Erdogan said Washington and its allies should consider sanctions and halting arms sales to put pressure on Israel to abide by the agreement. Turkey, a NATO member, joined ceasefire negotiations as a mediator, and increased its role following a meeting between Mr Erdogan and Donald Trump at the White House last month. \"The Hamas side is abiding by the ceasefire. In fact, it is openly stating its commitment to this. Israel, meanwhile, is continuing to violate the ceasefire,\" Mr Erdogan told reporters. \"The international community, namely the United States, must do more to ensure Israel's full compliance to the ceasefire and agreement,\" he said. Mr Erdogan was also asked about comments from Israeli Prime Minister Benjamin Netanyahu, who hinted that he would be opposed to any peacekeeping role for Turkish security forces in the Gaza Strip. The Turkish president said talks on the issue were still underway, adding: \"As this is a multi-faceted issue, there are comprehensive negotiations. We are ready to provide Gaza any form of support on this issue.\" Israel has accused Hamas of breaching the truce and previously said its recent military action in Gaza was designed to uphold the agreement. Relations between former allies Israel and Turkey hit new lows during the Gaza war, with Ankara accusing Mr Netanyahu's government of committing genocide, an allegation Israel has repeatedly denied. Speaking during a visit to Israel on Friday, US Secretary of State Marco Rubio said that a planned international security force for Gaza would have to be made up of \"countries that Israel's comfortable with,\" but declined to comment specifically on Turkey's involvement. Around 200 US troops are working alongside the Israeli military and delegations from other countries, planning the stabilisation and reconstruction of Gaza. The US is seeking support from other allies, namely Gulf Arab nations, to build an international security force to be deployed to Gaza and train a Palestinian security force.  Mr Rubio said many nations had expressed interest, but decisions had yet to be made about the rules of engagement. He added that countries need to know what they were signing up for. \"Under what authority are they going to be operating? Who's going to be in charge? What is their job?\" said Mr Rubio. Read more:British troops deployed to Israel to 'monitor ceasefire'US takes centre stage in show of diplomatic power The secretary of state also reiterated his earlier warning to Israel not to annex the occupied West Bank, land that Palestinians want for part of an independent state. A bill applying Israeli law to the West Bank won preliminary approval from Israel's parliament on Wednesday. \"We don't think it's going to happen\", Mr Rubio said, adding that annexation \"would also threaten this whole process\". \"If [annexation] were to happen, a lot of the countries that are involved in working on this probably aren't going to want to be involved in this anymore. It's a threat to the peace process and everybody knows it\", he added."
    },
    {
        "title": "Sanctions alone won't force Putin to end Ukraine war",
        "description": "Donald Trump has swung like a pendulum between favouring Russia and less often sympathising with Ukraine. This week he has tilted more toward Kyiv.",
        "url": "https://news.sky.com/story/sanctions-alone-wont-force-putin-to-end-ukraine-war-13456819",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-putin-president-russia_7059931.jpg?20251024003815",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-10-24 19:29:00",
        "Headline": "President Donald Trump has imposed new restrictions on two leading Russian oil firms. But as long as the Kremlin believes it is winning, the impact of such measures may be limited.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Donald Trump has swung like a pendulum between favouring Russia and less often sympathising with Ukraine. This week he has tilted more toward Kyiv. Leaders in the coalition of the willing meeting in London on Friday were keen to add momentum to that shift. The US president has imposed sanctions on two leading Russian oil firms, doing what many had hoped America would do months ago.  European allies were quick to follow that lead. And some countries that have been trading Russian oil appear spooked enough to start backing away from doing so. But analysts are warning against overstating the impact of all this. Alexander Kolyandr, senior fellow at the Centre for European Policy Analysis, told Sky News that sanctions won't be enough on their own. \"There should be an understanding that sanctions alone would not force Putin to stop the war,\" he said. \"So Ukraine should get more arms, Ukraine should get more support, and Ukraine should get more guarantees.\" There appears to have been progress on sending more long-range weapons to Ukraine. It needs them to neutralise the threat of drones launched from miles behind Russia's border. And possibly towards unfreezing Russia assets to use the proceeds to help fund the Ukrainian war effort, though some nations still oppose the idea. But this week has seen an unusual level of alignment between the allies on both sides of the Atlantic. That will last as long as Trump does not change his mind.  The US president wants to broker an end to the war. Putin will not be serious about negotiating for peace as long as he thinks he has a chance of victory. Read more from Sky News:US sends its largest aircraft carrier to South AmericaTurkey accuses Israel of breaching Gaza ceasefire \"Putin and the Kremlin are pretty much sure that they are winning the war,\" Mr Kolyandr told Sky News, \"and that if they keep on pushing, Ukraine might collapse. \"And that's why I don't think that President Putin is ready to agree to any kind of compromise which would be acceptable for Ukraine or its European allies.\" It may take a lot more than sanctions on a handful of oil companies to persuade Putin it is not in his interest to continue this war."
    },
    {
        "title": "US ramps up 'drug boats' operation by sending in aircraft carrier to region",
        "description": "The US has announced it is sending an aircraft carrier to the waters off South America as it ramps up an operation to target alleged drug smuggling boats.",
        "url": "https://news.sky.com/story/six-killed-in-strike-on-alleged-narco-terrorist-boat-says-us-secretary-of-war-13456647",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-uss-gerald-r-ford-aircraft-carrier_7060771.jpg?20251024175838",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-24 14:31:00",
        "Headline": "Secretary of War Pete Hegseth said that Washington would treat anyone smuggling drugs in the Western Hemisphere as if they were members of al Qaeda. But Democrats say such attacks risk war with Venezuela.",
        "Content": " The US has announced it is sending an aircraft carrier to the waters off South America as it ramps up an operation to target alleged drug smuggling boats. The Pentagon said in a statement that the USS Gerald R Ford would be deployed to the region, including the Caribbean Sea, to \"bolster US capacity to detect, monitor, and disrupt illicit actors and activities that compromise the safety and prosperity of the United States homeland and our security in the Western Hemisphere\". The vessel is the US Navy's largest aircraft carrier. It is currently deployed in the Mediterranean alongside three destroyers, and the group are expected to take around one week to make the journey. There are already eight US Navy ships in the central and South American region, along with a nuclear-powered submarine, adding up to about 6,000 sailors and marines, according to officials. It came as the US secretary of war claimed that six \"narco-terrorists\" had been killed in a strike on an alleged drug smuggling boat in the Caribbean Sea overnight. Pete Hegseth said his military had bombed a vessel which he claimed was operated by Tren de Aragua - a Venezuelan gang designated a terror group by Washington in February. Writing on X, he claimed that the boat was involved in \"illicit narcotics smuggling\" and was transiting along a \"known narco-trafficking route\" when it was struck during the night. All six men on board the boat, which was in international waters, were killed and no US forces were harmed, he said. Ten vessels have now been bombed in recent weeks, killing more than 40 people. Mr Hegseth added: \"If you are a narco-terrorist smuggling drugs in our hemisphere, we will treat you like we treat al Qaeda. Day or NIGHT, we will map your networks, track your people, hunt you down, and kill you.\" While he did not provide any evidence that the vessel was carrying drugs, he did share a 20-second video that appeared to show a boat being hit by a projectile before exploding.  Speaking during a White House press conference last week, Donald Trump argued that the campaign would help tackle the US's opioid crisis. \"Every boat that we knock out, we save 25,000 American lives. So every time you see a boat, and you feel badly you say, 'Wow, that's rough'. It is rough, but if you lose three people and save 25,000 people,\" he said. Read more:Survivors reported after boat strikeUS destroys 'drug smuggling submarine' On Thursday, appearing at a press conference with Mr Hegseth, Mr Trump said that it was necessary to kill the alleged smugglers, because if they were arrested they would only return to transport drugs \"again and again and again\". \"They don't fear that, they have no fear,\" he told reporters. The attacks at sea would soon be followed by operations on land against drug smuggling cartels, Mr Trump claimed. \"We're going to kill them,\" he added. \"They're going to be, like, dead.\" Some Democratic politicians have expressed concerns that the strikes risk dragging the US into a war with Venezuela because of their proximity to the South American country's coast. Others have condemned the attacks as extrajudicial killings that would not stand up in a court of law. Jim Himes, a member of the House of Representatives, told CBS News earlier this month: \"They are illegal killings because the notion that the United States - and this is what the administration says is their justification - is involved in an armed conflict with any drug dealers, any Venezuelan drug dealers, is ludicrous.\" He claimed that Congress had been told \"nothing\" about who was on the boats and how they were identified as a threat."
    },
    {
        "title": "Makers of lift used by Louvre thieves reveal tongue-in-cheek advert",
        "description": "The makers of the furniture lift used by the Louvre thieves have told Sky News the device is \"certainly not intended for burglaries\" after publishing a tongue-in-cheek advert making the most of the product's sudden fame.",
        "url": "https://news.sky.com/story/makers-of-lift-used-by-louvre-thieves-reveal-tongue-in-cheek-advert-13456490",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-louvre-robbery-paris-france_7055250.jpg?20251020202442",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-24 10:04:00",
        "Headline": "The manufacturer posted a picture of the lift cordoned off by police tape at the side of the Paris landmark with the tagline \"when you need to move fast\".",
        "Content": "The makers of the furniture lift used by the Louvre thieves have told Sky News the device is \"certainly not intended for burglaries\" after publishing a tongue-in-cheek advert making the most of the product's sudden fame. Bocker manufactures the Agilo furniture lift that was used in Sunday's daring daytime heist. The day after thieves made off with a haul of France's Crown Jewels worth €88m (£76m), the firm posted a photograph showing the lift inside the police cordon next to the Paris museum with the tagline \"when you need to move fast\". Posted on Instagram, Facebook and LinkedIn, it shows the vehicle's ladder propped up against the side of the building, telling prospective buyers the lift can carry \"up to 400kg of treasures at 42m per minute - as quiet as a whisper\". CEO Alexander Bocker told Sky News he and his wife, marketing manager Julia Scharwatz, realised their product had been used in the heist when they saw photos from the scene on Sunday afternoon. \"We were shocked that our lift had been completely misused for this robbery, as it is not approved for transporting people,\" he said. \"And certainly not intended for burglaries. \"Once the initial shock had subsided and it was clear that no one had been injured, black humour took over. \"We brainstormed a bit and played slogan ping pong. My wife finalised it with her marketing team on Monday morning.\"  Users have generally seen the funny side, with one Instagram comment saying the post \"might be the best ad I've seen this year\" and another suggesting the company deserves \"the Oscar for the cleverest advertising\". Mr Bocker said \"99% of the feedback \" has been \"thoroughly positive\". \"We understand that not everyone shares this sense of humour. Humour rarely, if ever, appeals to everyone, but the vast majority laughed heartily.\" As of Friday afternoon, more than 40,000 people had liked the post on Instagram. The CEO said his company has had enquiries from around the world and \"many congratulations on our successful marketing campaign\". The lift used by the thieves belonged to one of the firm's customers, who rents out furniture lifts in the Greater Paris area, he explained. \"During a demonstration on how to use the furniture lift, it was apparently stolen and reported as such by our customer,\" Mr Bocker said. \"It appears that the company's branding has been removed and the number plates replaced.\" Read more from Sky News:Louvre: UK museums could be nextWhat will happen to stolen jewels? The Louvre reopened to visitors on Wednesday, having shut shortly after the heist took place on Sunday morning. The eight stolen objects remain missing and the thieves, who escaped on motorbikes, are still at large.  Museum director Laurence des Cars offered to resign when she appeared before French senators on Wednesday, admitting that the four-minute raid was a \"terrible failure\" and that the site's security cameras, which do not offer full coverage of the building's facade, were inadequate. It came just months after employees went on strike, warning of chronic understaffing and under-resourcing, and saying there were too few eyes on too many rooms."
    },
    {
        "title": "New Japanese Prime Minister Sanae Takaichi vows to bolsters defence spending",
        "description": "Japanese Prime Minister Sanae Takaichi has said in her first speech that defence is a priority for her country as the region experiences uncertainty with Russia, China and North Korea.",
        "url": "https://news.sky.com/story/new-japanese-prime-minister-sanae-takaichi-vows-to-bolsters-defence-spending-13456394",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sanae-takaichi-japan_7060536.jpg?20251024131755",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-24 08:24:00",
        "Headline": "In her first speech, Sanae Takaichi addressed the need to prioritise defence spending as regional tensions with China, North Korea, and Russia were a concern.",
        "Content": "Japanese Prime Minister Sanae Takaichi has said in her first speech that defence is a priority for her country as the region experiences uncertainty with Russia, China and North Korea. Japan's first female leader, an admirer of conservative prime minister Margaret Thatcher, took office on Tuesday, after being elected after months of political uncertainty. Ms Takaichi said that her government will spend a target of 2% of the gross domestic product by March 2026, instead of by 2027 as was first proposed. Although details of how the increased defence measures would be funded were not given. The early upgrade in its defence strategy in security has come as a result of the current situation with Russia's invasion of Ukraine and the conflict in the Middle East. Ms Takaichi said: \"The free, open and stable international order that we were accustomed to is violently shaken in the face of historic change of power balance and intensifying geopolitical competitions. \"In the region around Japan, military activities and other actions from our neighbours China, North Korea and Russia are causing grave concerns. \"Japan needs to proactively push for its fundamental build-up of its defence power.\" \n                   Turkey urges US to act after accusing Israel of breaching Gaza ceasefire\n                 \n                  Ukraine war latest: Putin 'only person' who doesn't want war to stop, Starmer says - as Macron hails 'turning point'\n                 \n                  Sanctions alone won't force Putin to end Ukraine war\n                 This announcement comes days ahead of US President Donald Trump's visit to Tokyo for a summit between 27-29 October, where Ms Takaichi is expected to face demands, including a further increase in defence spending and more purchases of American weapons. She said discussions with Mr Trump will include the strengthening of the Japan-US alliance while fostering the two sides' personal relationship based on trust. Ms Takaichi added her country needs to establish a constructive and stable relationship with China, but there are \"security concerns\" between the two. Experts say her hawkish politics of wartime history, as well as her past regular visits to Yasukuni Shrine, which Asian victims of Japan's colonial-era atrocities view as a lack of remorse, could undermine Tokyo's relations with Beijing. On the home front, Ms Takaichi's immediate concerns are to address the rising prices and stagnant salaries. Ms Takaichi said foreign workers are needed in Japan to make up for a national labour shortage. Read More:Makers of lift used by Louvre thieves reveal adStars of sumo arrive in London Japan has a rapidly ageing and declining population, which has resulted in a record increase in foreigners. \"It is a fact that unlawful activity and violation of rules by some foreigners are causing the sense of unease and unfairness among Japanese people,\" Ms Takaichi said. \"The government will respond decisively to these activities. It's not xenophobia.\" Ms Takaichi appointed Kimi Onoda as the economic security minister in an attempt to increase rules for foreigners in Japan. This is to \"enforce compliance\" and possible regulations on the purchase of Japanese land by foreigners, many of whom are Chinese. The move may appease some of the frustrated Japanese who are finding the far-right Sanseito party, \"Japanese First\", an attractive alternative. Crime rates among foreigners in Japan have fallen while their population has surged, according to government statistics."
    },
    {
        "title": "From Iron Maiden to the Iron Lady: Japan's first female prime minister",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>        ",
        "url": "https://news.sky.com/story/from-iron-maiden-to-the-iron-lady-japans-first-female-prime-minister-13456651",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sanae-takaichi_7060394.png?20251024113528",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-24 14:42:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈  A former television presenter and heavy metal drummer has become the first woman to be elected prime minister of Japan. Sanae Takaichi is known for her right-wing views and cites Margaret Thatcher as an inspiration. But it's not just her political beliefs that are controversial - Ms Takaichi has a love of hard rock and motorbikes, despite her deeply conservative background. Why has it taken so long for Japan to elect a female PM? And what challenges does she face domestically, as well as on the world stage? Niall is joined by Dr Kristin Surak, associate professor of political sociology at the London School of Economics and a leading expert on Japanese politics. Producers: Natalie Ktena & Tom Gillespie Editor: Mike Bovill"
    },
    {
        "title": "At least 25 killed as bus bursts into flames after crash with motorbike in India",
        "description": "A passenger bus burst into flames after a motorbike crashed into it, killing at least 25 people and injuring several others in southern India. ",
        "url": "https://news.sky.com/story/at-least-25-killed-as-bus-bursts-into-flames-after-crash-with-motorbike-in-india-13456331",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-bus-crash-india_7060198.jpg?20251024090150",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-24 07:23:00",
        "Headline": "Some managed to break windows and leap to safety with minor injuries, while others were charred to death. ",
        "Content": "A passenger bus burst into flames after a motorbike crashed into it, killing at least 25 people and injuring several others in southern India.  A fire ripped through the bus within minutes early on Friday, trapping dozens of passengers as it sped along a highway near Kurnool district in Andhra Pradesh state. Some people managed to break windows, leaping to safety with minor injuries, while others were charred to death, senior police official Vikrant Patil said. There were 44 passengers on board, most of whom were asleep at the time of the crash. The bus was gutted and the unidentified bike rider also died, Mr Patil said. The accident occurred in Chinnatekuru village near Kurnool, around 130 miles (210 kilometres) south of Hyderabad. The bus was travelling between the cities of Hyderabad in Telangana state and Bengaluru in Karnataka state. The motorbike rammed into the speeding bus from behind and became stuck, Mr Patil said. It was dragged for some distance, causing sparks that engulfed the bus's fuel tank.Read more from Sky News: Trump cancels 'all trade negotiations' with CanadaNBA stars arrested by FBI \"As the smoke started spreading, the driver stopped the bus and tried to put the fire out by using a fire extinguisher, but the fire was so intense he couldn't control it,\" Mr Patil said. A team of forensic experts was investigating the incident. India's Prime Minister Narendra Modi has offered his condolences to the bereaved families."
    },
    {
        "title": "Furious Trump cancels 'all trade negotiations' with Canada after TV advert",
        "description": "Donald Trump has announced that he is ending \"all trade negotiations\" with Canada.",
        "url": "https://news.sky.com/story/trump-terminates-all-trade-negotiations-with-canada-in-retaliation-for-fake-tv-advert-13456259",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-mark-carney-donald-trump_7060053.jpg?20251024044824",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-24 03:43:00",
        "Headline": "The advert in question had featured former president Ronald Reagan speaking negatively about tariffs - and arguing they cause job losses and trade wars.",
        "Content": " Donald Trump has announced that he is ending \"all trade negotiations\" with Canada. The move is in retaliation for a TV advert in Ontario that opposed US tariffs - and on Truth Social, the president claimed it was factually incorrect. He wrote: \"They only did this to interfere with the decision of the US Supreme Court, and other courts. \"TARIFFS ARE VERY IMPORTANT TO THE NATIONAL SECURITY, AND ECONOMY, OF THE U.S.A. \"Based on their egregious behaviour, ALL TRADE NEGOTIATIONS WITH CANADA ARE HEREBY TERMINATED.\" The advert in question had featured former president Ronald Reagan speaking negatively about tariffs - and arguing they cause job losses and trade wars. But the Ronald Reagan Presidential Foundation has since accused Ontario's government of \"using selective audio and video\" without permission - and warned it is considering legal options. \n                  Canadian TV advert pulled after angry Donald Trump 'terminates' trade talks\n                 \n                  Three men consent to being extradited from Scotland to Canada\n                 \n                  Canada's Marineland 'threatens to euthanise 30 beluga whales' in row with government\n                 Mr Trump's announcement could further inflame trade tensions between the neighbouring countries, which have already been building for months. 👉 Follow Trump100 on your podcast app 👈  Earlier this month, Canadian Prime Minister Mark Carney had held talks with the president to try and reach a deal. Read more US news:Putin criticises Trump's new sanctionsEntire East Wing of White House demolishedTrump pardons crypto billionaire US correspondent Trump turning once again on America's closest ally Canada just proves how flippant his trade decisions are. The smooth-talking confidence of Prime Minister Mark Carney persuaded Canadians to vote for him in this year's election. He certainly ran on a pitch to stand up to Trump, but his recent dealings with the US president have largely been diplomatic and cordial.  Carney was last in the Oval Office just over two weeks ago, and the pair laughed off Trump's obsession with Canada becoming the \"51st state\".  But now it's a single advert from the government of Ontario that has triggered Trump to pause all trade talks between the two, calling its anti-tariff stance \"egregious\" on his social media platform Truth Social.  The advert uses Ronald Reagan's voice to attack tariff policy - arguing trade barriers \"hurt every American worker and consumer… markets shrink, and collapse, businesses and industries shut down and millions of people lose their jobs\". But now, the Ronald Reagan Foundation has said the ad \"misrepresents\" his words - and they did not give their permission to use it.  Mere hours before Trump's post, Carney was prodding Trump jokingly to bet on the outcome of the baseball World Series.  Given this latest escalation by the President tonight, their next interaction will be far from a laughing matter. More than 75% of the country's exports go to the US - with C$3.6bn (£1.9bn) of Canadian goods crossing the border daily. The developments may have caught Mr Carney by surprise. Just hours earlier, he had challenged Mr Trump to a friendly bet on who would win the baseball world series between the Toronto Blue Jays and Los Angeles Dodgers."
    },
    {
        "title": "US ramps up 'drug boats' operation by sending in aircraft carrier to region",
        "description": "The US has announced it is sending an aircraft carrier to the waters off South America as it ramps up an operation to target alleged drug smuggling boats.",
        "url": "https://news.sky.com/story/six-killed-in-strike-on-alleged-narco-terrorist-boat-says-us-secretary-of-war-13456647",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-uss-gerald-r-ford-aircraft-carrier_7060771.jpg?20251024175838",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-24 14:31:00",
        "Headline": "Secretary of War Pete Hegseth said that Washington would treat anyone smuggling drugs in the Western Hemisphere as if they were members of al Qaeda. But Democrats say such attacks risk war with Venezuela.",
        "Content": " The US has announced it is sending an aircraft carrier to the waters off South America as it ramps up an operation to target alleged drug smuggling boats. The Pentagon said in a statement that the USS Gerald R Ford would be deployed to the region, including the Caribbean Sea, to \"bolster US capacity to detect, monitor, and disrupt illicit actors and activities that compromise the safety and prosperity of the United States homeland and our security in the Western Hemisphere\". The vessel is the US Navy's largest aircraft carrier. It is currently deployed in the Mediterranean alongside three destroyers, and the group are expected to take around one week to make the journey. There are already eight US Navy ships in the central and South American region, along with a nuclear-powered submarine, adding up to about 6,000 sailors and marines, according to officials. It came as the US secretary of war claimed that six \"narco-terrorists\" had been killed in a strike on an alleged drug smuggling boat in the Caribbean Sea overnight. Pete Hegseth said his military had bombed a vessel which he claimed was operated by Tren de Aragua - a Venezuelan gang designated a terror group by Washington in February. Writing on X, he claimed that the boat was involved in \"illicit narcotics smuggling\" and was transiting along a \"known narco-trafficking route\" when it was struck during the night. All six men on board the boat, which was in international waters, were killed and no US forces were harmed, he said. Ten vessels have now been bombed in recent weeks, killing more than 40 people. Mr Hegseth added: \"If you are a narco-terrorist smuggling drugs in our hemisphere, we will treat you like we treat al Qaeda. Day or NIGHT, we will map your networks, track your people, hunt you down, and kill you.\" While he did not provide any evidence that the vessel was carrying drugs, he did share a 20-second video that appeared to show a boat being hit by a projectile before exploding.  Speaking during a White House press conference last week, Donald Trump argued that the campaign would help tackle the US's opioid crisis. \"Every boat that we knock out, we save 25,000 American lives. So every time you see a boat, and you feel badly you say, 'Wow, that's rough'. It is rough, but if you lose three people and save 25,000 people,\" he said. Read more:Survivors reported after boat strikeUS destroys 'drug smuggling submarine' On Thursday, appearing at a press conference with Mr Hegseth, Mr Trump said that it was necessary to kill the alleged smugglers, because if they were arrested they would only return to transport drugs \"again and again and again\". \"They don't fear that, they have no fear,\" he told reporters. The attacks at sea would soon be followed by operations on land against drug smuggling cartels, Mr Trump claimed. \"We're going to kill them,\" he added. \"They're going to be, like, dead.\" Some Democratic politicians have expressed concerns that the strikes risk dragging the US into a war with Venezuela because of their proximity to the South American country's coast. Others have condemned the attacks as extrajudicial killings that would not stand up in a court of law. Jim Himes, a member of the House of Representatives, told CBS News earlier this month: \"They are illegal killings because the notion that the United States - and this is what the administration says is their justification - is involved in an armed conflict with any drug dealers, any Venezuelan drug dealers, is ludicrous.\" He claimed that Congress had been told \"nothing\" about who was on the boats and how they were identified as a threat."
    },
    {
        "title": "Child killer executed in Tennessee 'showed signs of life' two minutes after his 'death'",
        "description": "A convicted child killer executed in Tennessee showed signs of \"sustained cardiac activity\" two minutes after he was pronounced dead, his lawyer has claimed.",
        "url": "https://news.sky.com/story/child-killer-executed-in-tennessee-showed-signs-of-life-two-minutes-after-his-death-13456751",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-tennessee-inmate_7060830.jpg?20251024192400",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-24 18:08:00",
        "Headline": "Concerns surrounding the death of Byron Black, who was convicted of shooting dead his girlfriend and her two daughters, have been raised as part of a lawsuit challenging the US state's execution policies.",
        "Content": "A convicted child killer executed in Tennessee showed signs of \"sustained cardiac activity\" two minutes after he was pronounced dead, his lawyer has claimed. Byron Black, who shot dead his girlfriend Angela Clay and her two daughters, aged six and nine, in a jealous rage in 1988, was executed in August by a lethal injection. Alleged issues about his case were raised on Friday as part of a lawsuit challenging the US state's lethal injection policies, amid claims they violate both federal and state constitutional bans on cruel and unusual punishment. The latest proceedings in Nashville were held to consider whether attorneys representing death row inmates in the lawsuit will be allowed to depose key people involved in carrying out executions in Tennessee. The court heard that concerns had been raised before the execution that Black was being put to death with a working defibrillator implanted in his chest. There were fears that the device would shock his heart when the lethal chemicals took effect. The Death Penalty Information Center, which provides data on such matters, said it was unaware of any similar cases. Seven media witnesses said Black appeared to be in discomfort during the execution. He looked around the room as the execution began, and could be heard sighing and breathing heavily, the AP news agency reported at the time. An electrocardiogram monitoring his heart recorded cardiac activity after he was pronounced dead, his lawyer Kelley Henry told a judge on Friday. Read more from Sky News:Executed man took at least 15 minutes to dieUS ramps up 'drug boats' operation Ms Henry, who is leading a group of federal public defenders representing death row inmates in the US state, said only the people who were there would be able to answer the question of what went wrong during Black's execution. \"At one point, the blanket was pulled down to expose the IV,\" she told the court. \"Why? Did the IV come out? Is that the reason that Mr Black exclaimed 'it's hurting so bad'? Is the EKG (electrocardiogram) correct?\" A full trial in the case is scheduled to be heard in April."
    },
    {
        "title": "How much of the White House is Trump demolishing?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈&#160; </a>",
        "url": "https://news.sky.com/story/how-much-of-the-white-house-is-trump-demolishing-13456246",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump100-100_7029094.jpg?20250923092054",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-24 02:44:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈   Donald Trump begins bulldozing much of the White House as his plans to build a mega ballroom begin - without planning permission, nor true clarity as to how it's all being funded. There are aesthetic questions, historical questions and ethical questions. We dig into what they are. And - who is the young Democratic socialist about to become New York City's first Muslim mayor? We tell you everything you need to know about Zohran Mamdani. You can also watch all episodes on our YouTube channel - and watch David Blevins' digital video on the White House ballroom here. Email us on trump100@sky.uk with your comments and questions."
    },
    {
        "title": "Man executed in Alabama took at least 15 minutes to die",
        "description": "A man took at least 15 minutes to die during his execution by nitrogen gas in the US state of Alabama.",
        "url": "https://news.sky.com/story/man-executed-in-alabama-took-at-least-15-minutes-to-die-13456578",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-anthony-boyd-alabama-execution_7060578.jpg?20251024134956",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-24 12:27:00",
        "Headline": "Anthony Boyd, 54, was convicted of helping to burn a man alive in 1993 over a $200 (£150) cocaine debt.",
        "Content": "A man took at least 15 minutes to die during his execution by nitrogen gas in the US state of Alabama. Anthony Boyd, 54, was convicted of helping to burn a man alive in 1993 over a $200 (£150) cocaine debt. He was sentenced to death for his role in killing Gregory Huguley in Talladega County. Boyd used his final words to proclaim his innocence, saying: \"I didn't kill anybody. I didn't participate in killing anybody. \"There can be no justice until we change this system.\" He said he wanted to express love to those who were still fighting, adding: \"Let's get it.\" Boyd was pronounced dead at 6.33pm at William C Holman Correctional Facility on Thursday. While officials in Alabama did not reveal the exact time the gas began flowing, the execution appeared to take longer than previous cases using nitrogen gas, a method the state began using last year. It involves a gas mask being strapped over the inmate's face to replace breathable air with pure nitrogen gas, causing the person to die from a lack of oxygen. At around 5.57pm, he clenched his fist, raised his hand off the gurney slightly and began shaking. He then raised his legs off the gurney. Then at about 6.01pm, he began a long series of heavy breaths, which lasted at least 15 minutes, before he became still. The curtain to the execution chamber was closed at 6.27pm. The prison commissioner said the gas is typically kept flowing for five minutes after monitoring shows an inmate no longer has a heartbeat. Read more from Sky News:Disgraced singer died of stab wound - inquestRapper charged after fatal hit-and-run 'Absolutely incompetent' The reverend Jeff Hood, who stood by Boyd as he died, said the nitrogen gas execution was \"the worst one yet\". \"I think they are absolutely incompetent when it comes to carrying out these executions,\" he added. Mr Hood said authorities in Alabama had promised the method was a \"quick, painless, easy form of execution and this is by far nothing anywhere close to that.\" He said he believed Boyd planned to try to communicate through his leg movements. He said he believed there was \"some level of consciousness, in my opinion, for at least 16 minutes.\" However, Alabama Corrections Commissioner John Hamm said he believed Boyd's movements were involuntary. He said that while the execution took longer than previous ones, it was only by \"just a few minutes\". Jury recommended death sentence A prosecution witness at Boyd's trial testified as part of a plea agreement that Boyd taped Mr Huguley's feet together before another man doused him with petrol and set him on fire. Defence lawyers said he was at a party on the night Mr Huguley was killed and that the plea deal testimony was unreliable. However, a jury convicted Boyd of capital murder during a kidnapping and recommended he receive the death sentence by a vote of 10 to two. Alabama Attorney General Steve Marshall said: \"For more than 30 years, Boyd sought to delay justice through endless litigation, yet he never once presented evidence that the jury was wrong.\" Boyd, who had been on death row since 1995, was the latest chair of Project Hope to Abolish the Death Penalty, a campaign group founded by men on death row."
    },
    {
        "title": "Canadian TV advert pulled after angry Donald Trump 'terminates' trade talks",
        "description": "A Canadian anti-tariff TV advert which enraged Donald Trump is to be pulled from air - after the US president \"terminated\" trade talks with the country.",
        "url": "https://news.sky.com/story/canadian-tv-advert-pulled-after-angry-donald-trump-terminates-trade-talks-13456857",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-tariffs-canada_7060975.jpg?20251024211416",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-24 19:55:00",
        "Headline": "Ontario Premier Doug Ford, whose province sponsored the broadcast campaign, said it had achieved its aim of \"initiating a conversation\" about tariffs.",
        "Content": "A Canadian anti-tariff TV advert which enraged Donald Trump is to be pulled from air - after the US president \"terminated\" trade talks with the country. Mr Trump announced that he was ending \"all trade negotiations\" with Canada on Thursday in response to the broadcast campaign, sponsored by one of the country's provinces, featuring former US president Ronald Reagan speaking negatively about tariffs. \"They only did this to interfere with the decision of the US Supreme Court, and other courts,\" said Mr Trump in a social media post. He added: \"TARIFFS ARE VERY IMPORTANT TO THE NATIONAL SECURITY, AND ECONOMY, OF THE U.S.A. \"Based on their egregious behaviour, ALL TRADE NEGOTIATIONS WITH CANADA ARE HEREBY TERMINATED.\" Ontario Premier Doug Ford said on Friday that the advert would no longer be shown from Monday after it had \"initiated a conversation\" over tariffs. However, the commercials will continue to run this weekend, including during the first World Series games between the Toronto Blue Jays and Los Angeles Dodgers.  Mr Ford made the statement after talking with Canadian Prime Minister Mark Carney, who is hoping to strike a trade deal with the US and met Mr Trump at the White House earlier this month. More than 75% of the country's exports go to the US - with C$3.6bn (£1.9bn) of Canadian goods crossing the border daily. \"Our intention was always to initiate a conversation about the kind of economy that Americans want to build, and the impact of tariffs on workers and businesses,\" said Mr Ford. \"We've achieved our goal, having reached US audiences at the highest levels.\" Mr Trump claimed that the advert misrepresented the position of Reagan, ahead of a Supreme Court hearing scheduled for next month which could decide whether the president has the power to impose sweeping tariffs. Read more from Sky News:US ramps up 'drug boats' operationExecuted killer 'showed signs of life after death' \"CANADA CHEATED AND GOT CAUGHT!!!\" said Mr Trump on social media. \"They fraudulently took a big buy ad saying that Ronald Reagan did not like Tariffs, when actually he LOVED TARIFFS FOR OUR COUNTRY, AND ITS NATIONAL SECURITY. \"Canada is trying to illegally influence the United States Supreme Court in one of the most important rulings in the history of our country.\""
    },
    {
        "title": "New York attorney general claims fraud charge is Donald Trump's 'revenge'",
        "description": "New York&#8217;s attorney general accused Donald Trump of using the justice system for &#8220;revenge&#8221; as she pleaded not guilty to mortgage fraud charges.",
        "url": "https://news.sky.com/story/new-york-attorney-general-claims-fraud-charge-is-donald-trumps-revenge-13456743",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-letitia-james-donald-trump_7060819.jpg?20251024190419",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-24 17:55:00",
        "Headline": "Letitia James had previously secured a $450million (£337million) judgment against Donald Trump.",
        "Content": "New York’s attorney general accused Donald Trump of using the justice system for “revenge” as she pleaded not guilty to mortgage fraud charges. Letitia James, a Democrat and longtime critic of the US president, appeared in court today accused of lying on mortgage documents. Ms James, who last year secured a $450m (£338m) civil fraud judgment against Mr Trump, pleaded not guilty before giving a passionate speech to crowds and members of the media as she left the court. The attorney general, who Mr Trump had previously demanded be prosecuted, said: \"This is not about me. \"This is about all of us. About a justice system which has been weaponised. A justice system which has been used as a tool of revenge.\" 'There's no fear today' As the crowd shouted \"no fear\", she said: \"So there's no fear today. \"I believe our justice system will rain down like water and righteousness like a mighty stream.\" Mr Trump has promised to seek retribution against perceived enemies he alleges used the justice system against him in a bid to stop him returning to power. He has pressured Attorney General Pam Bondi to speed up the action. Read more:Trump cancels trade talks with CanadaPutin criticises US sanctions on oil firms Former FBI director, James Comey, and former National Security Advisor, John Bolton, have also had criminal charges brought against them from the Trump administration in the past month. All three have denied wrongdoing. Two more Mr Trump rivals, Democratic Senator Adam Schiff and Federal Reserve Board Governor, Lisa Cook, also remain under criminal investigation and have denied wrongdoing. Ms James successfully won the $450m penalty against Mr Trump after a judge ruled he had fraudulently overstated his net worth to dupe lenders. A New York state appeals court in August threw out the penalty, but upheld the trial judge's finding that Mr Trump was liable for fraud. A trial for Ms James has been set for 26 January 2026."
    },
    {
        "title": "Kim Kardashian diagnosed with brain aneurysm",
        "description": "Kim Kardashian has revealed that she has been diagnosed with a brain aneurysm. ",
        "url": "https://news.sky.com/story/kim-kardashian-diagnosed-with-brain-aneurysm-13456240",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kim-kardashian-brain_7060037.jpg?20251024015725",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-24 00:52:00",
        "Headline": "Research suggests brain aneurysms are most common in adults between the ages of 30 and 60 - with women disproportionately affected.",
        "Content": "Kim Kardashian has revealed that she has been diagnosed with a brain aneurysm.  Footage from the latest season of The Kardashians shows the reality TV star going for an imaging scan. The 45-year-old appears to suggest her small aneurysm may have stemmed from stress. Brain aneurysms are relatively common, with data suggesting they affect about one in every 50 people. In many cases, patients may be unaware that they have one - as they tend to cause few symptoms when unruptured. Should an unruptured aneurysm grow to a larger size, it can cause headaches, balance problems and speech issues. Those that burst are extremely dangerous and can prove fatal in some circumstances. \n                  'Tradwife', 'delulu' and 'skibidi' among new words added to Cambridge Dictionary\n                 \n                  'Grandpa robbers' found guilty over 'terrifying' Kim Kardashian heist at Paris hotel\n                 \n                  Kim Kardashian feared she was going to die during Paris heist - and tells robber she forgives him \n                 While aneurysms can emerge throughout the body, they are most typically found in the aorta, which carries blood out of the heart. Research suggests brain aneurysms are most common in adults between the ages of 30 and 60 - with women disproportionately affected. Read more entertainment news:Tess Daly and Claudia Winkleman to leave StrictlyBob Vylan's Manchester gig is postponed  Associate professor of neurology Dr Laura Stein told Sky's US partner NBC News: \" The most well-described risk factors include a predisposition [family history of aneurysm], high blood pressure, cigarette smoking and inflammation.\" She went on to explain that most fatal ruptured aneurysms are in the brain, killing about one in three patients. \"When it's a blood vessel that's in the head and it bleeds, there's a much higher risk of having a very bad problem just because the brain is enclosed in a fixed space,\" Dr Stein added. Low-risk aneurysms are monitored by doctors for growth or abnormalities, and there are a series of potential treatment options for those considered dangerous. Elsewhere in The Kardashians clip, Kim admitted that her ex-husband Kanye West will be in her life \"no matter what\" because of the four kids they share together."
    },
    {
        "title": "Changpeng Zhao: Donald Trump pardons billionaire crypto exchange founder",
        "description": "Donald Trump has pardoned the founder of the world's biggest cryptocurrency exchange - amid allegations of a conflict of interest.",
        "url": "https://news.sky.com/story/donald-trump-pardons-billionaire-crypto-exchange-founder-changpeng-zhao-13456083",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-binance-zhao_7059881.jpg?20251023202159",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-24 00:01:00",
        "Headline": "Donald Trump's decision to offer clemency has attracted criticism from some ethics experts, given the president's business empire includes a number of crypto ventures.",
        "Content": "Donald Trump has pardoned the founder of the world's biggest cryptocurrency exchange - amid allegations of a conflict of interest. Changpeng Zhao spent almost four months behind bars last year after admitting that Binance had failed to maintain an effective anti-money laundering programme. Prosecutors in the case had alleged that inadequate checks had meant criminals could move illicit funds using crypto - including child sex offenders, drug traffickers, terrorists and sanctioned countries. Mr Trump's decision to offer clemency has attracted criticism from some ethics experts, given the president's business empire includes several crypto ventures. White House Press Secretary Karoline Leavitt has rejected claims of a conflict of interest, and argued that Joe Biden's administration had prosecuted Zhao as part of a \"war on cryptocurrency\". She told reporters: \"The president and the White House have a very thorough examination of every pardon request that comes to the president's desk. \"I spoke with our great White House counsel about the pardon after it happened. This was an overly prosecuted case by the Biden administration.\" \n                   Turkey urges US to act after accusing Israel of breaching Gaza ceasefire\n                 \n                  Ukraine war latest: Putin 'only person' who doesn't want war to stop, Starmer says - as Macron hails 'turning point'\n                 \n                  Sanctions alone won't force Putin to end Ukraine war\n                 But Democratic Senator Elizabeth Warren - a vocal sceptic of the crypto space - has criticised the pardon. \"First, Changpeng Zhao pleaded guilty to a criminal money laundering charge. Then he boosted one of Donald Trump's crypto ventures and lobbied for a pardon. Today, Donald Trump did his part and pardoned him,\" she wrote on X. Binance has refused to respond to her claims.  Mr Trump's family is involved in a crypto venture called World Liberty Financial, which has launched a digital asset called USD1 - a stablecoin whose value is pegged to the dollar. Earlier this year, a Middle Eastern investment fund announced it was making a $2bn investment into Binance using USD1, creating a direct connection between the two men's businesses. Mr Trump's most recent financial disclosure report reveals he made more than $57m (£42.7m) in 2024 from World Liberty Financial. In a post on X, Zhao said that he was \"deeply grateful for today's pardon and to President Trump for upholding America's commitment to fairness, innovation, and justice\". He added: \"Will do everything we can to help make America the Capital of Crypto.\" Read more from Sky News:Trump's sanctions are no slap on the wristEast Wing of White House will be demolished Speaking to reporters, Mr Trump argued that Zhao had been recommended for a pardon repeatedly - and \"a lot of people say he wasn't guilty of anything\". The president added that he didn't believe he had ever met the entrepreneur personally."
    },
    {
        "title": "Sheffield Wednesday deducted 12 points after entering administration",
        "description": "Sheffield Wednesday have filed for administration, which has resulted in the already struggling side being hit with an immediate 12-point deduction.",
        "url": "https://news.sky.com/story/english-championship-side-sheffield-wednesday-file-for-administration-13456479",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sheffield-wednesday_7060500.jpg?20251024125838",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-24 09:58:00",
        "Headline": "The Owls, one of the oldest clubs in world football, have been deducted 12 points.",
        "Content": " Sheffield Wednesday have filed for administration, which has resulted in the already struggling side being hit with an immediate 12-point deduction. The South Yorkshire club currently sit bottom of the Championship, the second tier of English football. Known as The Owls, Wednesday are one of the oldest surviving clubs in world football, with more than 150 years of history. Court records confirm the club have filed for administration. A notice was filed at a specialist court at 10.01am. The EFL also confirmed on Friday that it had received formal notice of the decision. Before Friday's development, they had six points from 11 games. Now they have -6 points, sitting 15 away from safety in the division. What has happened? The Owls, who host Oxford United on Saturday, have been in turmoil for a long time. On 3 June, owner Dejphon Chansiri, a Thai canned fish magnate who took over the club in 2015, was charged with breaching EFL regulations regarding payment obligations. Weeks later, Mr Chansiri said he was willing to sell the club in a statement on their official website. Their crisis deepened just days later when another embargo was imposed on the club relating to payments owed to HMRC, before players and staff were not paid on time on 30 June. In the months that followed, forwards Josh Windass and Michael Smith left the club by mutual consent. Manager Danny Rohl, now at Rangers, also left by mutual consent.  The Owls were forced to close the 9,255-capacity North Stand at Hillsborough after a prohibition notice was issued by Sheffield City Council. The club's captain, Barry Bannan, said he was \"gutted\" after hearing the news. \"Hopefully, sometimes you have to be dropped to come back again. But if there's ever a club to do it, it's this club, because the fan base we've got is amazing,\" he said. Staff at Hillsborough Stadium could be seen removing seats in the stands that spelt out Mr Chansiri's name. 'First step to getting our Wednesday back' A statement from Sheffield Wednesday Supporters' Trust said: \"Today marks one of the most bittersweet days in our club's proud 158-year history. \"Entering administration was the inevitable outcome of years of financial mismanagement, a lack of accountability, and repeated failures to engage credible buyers. Administration is not something to be celebrated. It needn't have ended this way. But we are overjoyed to have Dejphon Chansiri out of our club for good. \"Administration represents a necessary turning point. With the club now totally out of Chansiri's hands, this may be the first step to getting our Wednesday back. It closes an era defined by poor decisions and deep divisions, both on and off the pitch. Once Hillsborough is recovered from his ownership, Chansiri's influence will finally be consigned to history, a regrettable chapter in Sheffield Wednesday's long and storied history.\" 'League table updated with immediate effect' In a statement, the EFL said: \"The EFL can confirm that it has now received formal notice that Dejphon Chansiri, the director of Sheffield Wednesday Football Club, has taken the necessary steps to appoint administrators to both the club and also the company which owns Hillsborough. It added that the \"Championship league table will be updated with immediate effect\". 'No interruption to fixture schedule' Paul Stanley, joint administrator along with Julian Pitts and Kris Wigfield, said there would be no interruption to the Owls' forthcoming fixtures. Mr Stanley said: \"Sheffield Wednesday are a massive, historic club with a loyal fan base in a city that lives and breathes football. If more fans return to Hillsborough, the club can cover its day-to-day costs and move towards a viable sale to a new ownership capable of restoring long-term stability. \"With the right ownership structure, we are confident that the club has a bright future and will meet all EFL regulatory obligations.\" There is a hope in government that the new independent football regulator would in future be able to act sooner to intervene to prevent clubs going on the brink. The regulator would assess new owners and subject clubs to ongoing financial scrutiny. An Independent Football Regulator spokesperson said: \"We understand this is a difficult time for the fans and staff of Sheffield Wednesday Football Club. \"We are working closely with the Government to bring forward our powers as quickly as possible, to be in a position to take action against owners and directors who are not acting in the interests of their club. \"It is unacceptable that fans of football clubs face this level of uncertainty. Our regime will work to prevent instability and protect clubs for the benefit of supporters and their communities.\" Last season, Wednesday finished 12th. They had already been placed under registration embargoes in the last two seasons after being hit by a six-point deduction during the 2020/21 campaign, for breaching profit and sustainability rules. Read more from Sky News:Strong gold demand behind surprising rise in retail salesMost influential black people in the UK named Owls manager, Henrik Pedersen, said: \"It's a sad situation that a club with our history has to go into administration. \"But this is one side of the bread, the other side is this is also the beginning of a new era, we can get a fresh restart and we can start to look into the future and create something positive again.\""
    },
    {
        "title": "Reeves kicks off hunt for £314,000-a-year-bank watchdog chief",
        "description": "Rachel Reeves has fired the starting gun on the hunt for Britain's next top bank regulator - and is calling on senior financiers to enter the race as candidates.",
        "url": "https://news.sky.com/story/reeves-kicks-off-hunt-for-163314000-a-year-bank-watchdog-chief-13456652",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-bank-of-england-city_7056648.jpg?20251020172701",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-24 14:50:00",
        "Headline": "The chancellor has invited candidates with \"senior executive experience in a major bank, insurer or other financial institution\" to apply to succeed Sam Woods at the helm of the PRA, Sky News can reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Rachel Reeves has fired the starting gun on the hunt for Britain's next top bank regulator - and is calling on senior financiers to enter the race as candidates. Sky News can reveal that the chancellor has formally initiated a search for the next chief executive of the Prudential Regulation Authority (PRA), which sits within the Bank of England. In a recruitment advertisement which went live on Friday, the Treasury said \"senior executive experience in a major bank, insurer or other financial institution\" was one of two \"desirable criteria\" for the eventual appointee. The government is seeking a chief executive to serve for five years, in line with the term of the Financial Conduct Authority's (FCA) boss, Nikhil Rathi. Sam Woods, who will step down in June next year, has served for two five-year terms. His successor will earn £314,000-a-year, according to the recruitment ad, roughly in line with Mr Woods' pay package. Last month, Sky News revealed that Ms Reeves was keen to recruit a heavyweight outsider to run the PRA, with Katharine Braddick, a senior Barclays executive who previously worked at the Treasury, among the expected contenders. \n                  Brexit impact on UK economy 'negative for foreseeable future', Bank of England chief says\n                 \n                  Bank of England warns of 'sharp correction' for markets if AI bubble bursts - and IMF agrees\n                 \n                  Reeves seeks outsider to run Britain's banking watchdog\n                 The wording of the job spec may lengthen the odds on the appointment of an internal candidate such as David Bailey, the Bank of England's executive director for prudential policy. Ms Reeves's desire for an outsider with industry experience comes amid a wider push for Britain's economic watchdogs to remove red tape and reorient themselves towards growth-focused policies. A Treasury insider said the chancellor regarded the PRA chief executive recruitment process to be a key component of the government's drive to jumpstart economic growth. Next month, she will present her Budget, a fiscal event on which the government's economic credibility is likely to rest. Candidates to replace Mr Woods are expected to be interviewed in the new year, with an appointment likely by the spring. Mr Woods has been viewed as a potential candidate to succeed Andrew Bailey when the Bank of England governor's term runs out in 2028, although it is unclear whether he covets the job. As CEO of the PRA, Mr Woods is also a deputy governor of the Bank of England, a member of the Bank's Court of Directors, and a director of the FCA. The chancellor has already shown a willingness to recruit outsiders to senior roles at the Treasury, appointing Bank of America investment banking veteran Jim O'Neil as second permanent secretary to the Treasury earlier this year. Mr O'Neil had also served as the head of UK Financial Investments, the agency set up to manage taxpayers' stakes in Britain's bailed-out banks. The Treasury declined to comment further."
    },
    {
        "title": " Jaguar Land Rover cyber attack pushes overall UK car production down more than a quarter",
        "description": "UK car production fell by more than a quarter (27.1%) last month as a cyber attack at Jaguar Land Rover halted manufacturing at the plant, industry figures show.",
        "url": "https://news.sky.com/story/jaguar-land-rover-cyber-attack-pushes-overall-uk-car-production-down-more-than-a-quarter-13456363",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-land-rover-jaguar_7034427.jpg?20250928013820",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-24 08:00:00",
        "Headline": "The attack has been described as \"the most financially damaging\" as the manufacturing was paused for five weeks. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n UK car production fell by more than a quarter (27.1%) last month as a cyber attack at Jaguar Land Rover halted manufacturing at the plant, industry figures show. The total number of vehicles coming off assembly lines - including cars and vans - fell an even sharper 35.9%, according to September data from the Society of Motor Manufacturers and Traders (SMMT).  \"Largely responsible\" for the drop was the five-week pause in production at Jaguar Land Rover (JLR) due to a malicious cyber attack, as other car makers reported growth. Money latest: Restaurant sends bitter message to customers JLR's assembly lines in the West Midlands and Halewood on Merseyside were paused from late August to early October as a result. During this time, not a single vehicle was made. Production has since restarted, but the attack is believed to have been the \"most financially damaging\" in UK history at an estimated cost of £1.9bn, according to the security body the Cyber Monitoring Centre. It was the lowest number of cars made in any September in the UK since 1952, including during the COVID-19 lockdown. \n                  Government contractor Capita fined £14m after more than six million people had data stolen in cyber attack\n                 \n                  China poses 'highly sophisticated' cyber threat to UK, NCSC warns\n                 \n                  Discord hack shows risks of online age checks as internet policing hopes put to the test\n                  Despite the restart, the sector remains \"under immense pressure\", the SMMT's chief executive Mike Hawes said.  The phased restart of operations led to a small boost in manufacturing output this month, according to a closely watched survey. Of the cars that were made, nearly half (47.8%) were battery electric, plug-in hybrid or hybrid. The vast majority, 76% of the total vehicles output, were made for export.   The top destinations are the European Union, US, Turkey, Japan and South Korea. JLR was just the latest business to be the subject of a cyber attack. Harrods, the Co-Op, and Marks and Spencer, are among the companies that have struggled in the past year with such attacks. "
    },
    {
        "title": "Retail sales the highest in three years in a surprise to economists",
        "description": "Retail sales are at the highest level in more than three years, in the latest measure of the UK economy to confound economists.",
        "url": "https://news.sky.com/story/retail-sales-the-highest-in-three-years-in-a-surprise-to-economists-13456287",
        "image_url": "https://e3.365dm.com/18/11/1920x1080/skynews-uk-winter-weather-rain-winchester_4501267.jpg?20181127125320",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-24 05:41:00",
        "Headline": "Computer and telecommunications retailers did well as the iPhone 17 launched in the month.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Retail sales are at the highest level in more than three years, in the latest measure of the UK economy to confound economists. The amounts bought in shops rose 0.5% in September, far above the 0.2% contraction anticipated by economists polled by Reuters. It was the fourth monthly rise in a row and brought volumes to their highest level since July 2022. Money latest: Restaurant sends bitter message to customers Doing well were computer and telecommunications retailers as the iPhone 17 launched in the month, while online jewellers reported strong demand for gold despite the price hovering around record highs. Gold has been in demand, and in recent days reached a record high, as some investors moved money out of the US dollar and government bonds amid the ongoing government shutdown. It came despite a rainy month - which typically keeps shoppers at home - and a five-day tube strike in London. The impact of the rain could be seen, however, in the boost to online spending, which rose to one of the highest levels since the end of the pandemic. A fall was recorded in food shop sales from August to September, signalling a response to high food price inflation. A good week for the economy? Retail sales figures are significant as they measure household consumption, the largest expenditure in the UK economy. Growing retail sales can mean economic growth, which the government has repeatedly said is its top priority. Earlier this week, another key economic measure came in better than expected. Inflation remained at 3.8% rather than rising to the widely expected 4% - double the target rate set by the interest rate-setters at the Bank of England. Read more from Sky News:Spotify hikes UK subscription pricesPost Office compensation 'worse than original injustice' Consumers were feeling better about their finances, a closely watched measure of consumer confidence showed on Friday. Buying sentiment is up from last month, according to market research company GFK, as intentions to buy big-ticket items like electrical goods and furniture rose. Combined, it suggests people are not feeling too gloomy in the run-up to the November budget."
    },
    {
        "title": "Tesco rolls out body cams to delivery staff 'vulnerable to attack' due to expanded age checks",
        "description": "The UK's most popular supermarket is rolling out body cameras to thousands of its delivery drivers who feel at increased risk of attack due to the expansion of age verification checks. ",
        "url": "https://news.sky.com/story/tesco-rolls-out-body-cams-to-delivery-staff-vulnerable-to-attack-due-to-expanded-age-checks-13456502",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-tesco-body-camera-shop-worker_7060393.png?20251024113423",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-24 10:19:00",
        "Headline": "The retailer has said delivery drivers should be included in the standalone offence against shop worker attacks.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The UK's most popular supermarket is rolling out body cameras to thousands of its delivery drivers who feel at increased risk of attack due to the expansion of age verification checks.  Tesco has said 5,000 of its workers who deliver shopping to customers' homes will be provided with body-worn cameras by the end of the year. The move is in response to \"escalating levels of threats and violence\" towards drivers in recent years, the supermarket said. Money latest: Restaurant sends bitter message to customers A trial run by the retailer showed the cameras act as a deterrent and reduce serious incidents against drivers by 50%, it said. The cameras are only turned on if a driver feels unsafe, and there are plans for a wider rollout next year, Tesco said.  \n                  New York attorney general claims fraud charge is Donald Trump's 'revenge'\n                 \n                  Man who killed couple and took bodies in suitcases to Bristol Clifton Suspension Bridge jailed for minimum of 42 years\n                 \n                  Shaine March: Convicted killer admits to stabbing pregnant girlfriend to death\n                 The company delivers 1.45 million online grocery orders a week. An increased threat  Delivery workers are \"particularly\" vulnerable retail staff, said the Union of Shop, Distributive and Allied Workers (USDAW), who welcomed the move. The expansion of age verification to knives has been a new issue for the employees to deal with.  Under the age check laws, delivery drivers are legally required to verify the age of the people receiving a delivery of restricted goods like alcohol, tobacco and, recently, knives. \"Our members tell us this can be very problematic and they feel vulnerable to attack,\" USDAW said. A survey of 300 workers from the union indicated 77% had been a victim of abuse, 13% were assaulted, and 26% had refused a delivery due to fear for their own personal safety in the past year.  More to do While a new standalone offence of assaulting a retail worker is being introduced via the government's Crime and Policing Bill, delivery drivers are not included. Both USDAW and Tesco have called for this category of staff to be included in the offence, \"particularly as they work alone without the protection that comes with being in a store\", the retailer added. Such an addition would bring England and Wales in line with Scotland, where delivery drivers are within scope. Tesco said the law has brought down reported cases, compared to the rest of the UK. "
    },
    {
        "title": "Furious Trump cancels 'all trade negotiations' with Canada after TV advert",
        "description": "Donald Trump has announced that he is ending \"all trade negotiations\" with Canada.",
        "url": "https://news.sky.com/story/trump-terminates-all-trade-negotiations-with-canada-in-retaliation-for-fake-tv-advert-13456259",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-mark-carney-donald-trump_7060053.jpg?20251024044824",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-24 03:43:00",
        "Headline": "The advert in question had featured former president Ronald Reagan speaking negatively about tariffs - and arguing they cause job losses and trade wars.",
        "Content": " Donald Trump has announced that he is ending \"all trade negotiations\" with Canada. The move is in retaliation for a TV advert in Ontario that opposed US tariffs - and on Truth Social, the president claimed it was factually incorrect. He wrote: \"They only did this to interfere with the decision of the US Supreme Court, and other courts. \"TARIFFS ARE VERY IMPORTANT TO THE NATIONAL SECURITY, AND ECONOMY, OF THE U.S.A. \"Based on their egregious behaviour, ALL TRADE NEGOTIATIONS WITH CANADA ARE HEREBY TERMINATED.\" The advert in question had featured former president Ronald Reagan speaking negatively about tariffs - and arguing they cause job losses and trade wars. But the Ronald Reagan Presidential Foundation has since accused Ontario's government of \"using selective audio and video\" without permission - and warned it is considering legal options. \n                  Canadian TV advert pulled after angry Donald Trump 'terminates' trade talks\n                 \n                  Three men consent to being extradited from Scotland to Canada\n                 \n                  Canada's Marineland 'threatens to euthanise 30 beluga whales' in row with government\n                 Mr Trump's announcement could further inflame trade tensions between the neighbouring countries, which have already been building for months. 👉 Follow Trump100 on your podcast app 👈  Earlier this month, Canadian Prime Minister Mark Carney had held talks with the president to try and reach a deal. Read more US news:Putin criticises Trump's new sanctionsEntire East Wing of White House demolishedTrump pardons crypto billionaire US correspondent Trump turning once again on America's closest ally Canada just proves how flippant his trade decisions are. The smooth-talking confidence of Prime Minister Mark Carney persuaded Canadians to vote for him in this year's election. He certainly ran on a pitch to stand up to Trump, but his recent dealings with the US president have largely been diplomatic and cordial.  Carney was last in the Oval Office just over two weeks ago, and the pair laughed off Trump's obsession with Canada becoming the \"51st state\".  But now it's a single advert from the government of Ontario that has triggered Trump to pause all trade talks between the two, calling its anti-tariff stance \"egregious\" on his social media platform Truth Social.  The advert uses Ronald Reagan's voice to attack tariff policy - arguing trade barriers \"hurt every American worker and consumer… markets shrink, and collapse, businesses and industries shut down and millions of people lose their jobs\". But now, the Ronald Reagan Foundation has said the ad \"misrepresents\" his words - and they did not give their permission to use it.  Mere hours before Trump's post, Carney was prodding Trump jokingly to bet on the outcome of the baseball World Series.  Given this latest escalation by the President tonight, their next interaction will be far from a laughing matter. More than 75% of the country's exports go to the US - with C$3.6bn (£1.9bn) of Canadian goods crossing the border daily. The developments may have caught Mr Carney by surprise. Just hours earlier, he had challenged Mr Trump to a friendly bet on who would win the baseball world series between the Toronto Blue Jays and Los Angeles Dodgers."
    },
    {
        "title": "Spotify hikes UK subscription prices",
        "description": "Spotify is increasing the cost of its UK premium subscription, the Money blog has revealed.",
        "url": "https://news.sky.com/story/spotify-hikes-uk-subscription-prices-13456304",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-app-spotify-money_7060121.jpg?20251024073949",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-24 06:27:00",
        "Headline": "Spotify's student discount, making a subscription £5.99, appears to be unchanged.",
        "Content": "Spotify is increasing the cost of its UK premium subscription, the Money blog has revealed. Emails have started going out to subscribers informing them the cost for an individual subscription will rise from £11.99 to £12.99 a month. It equates to an 8.3% increase. Money latest: Restaurant sends bitter message to customers Spotify says subscribers will get a one-month grace period. It had announced earlier this year that prices would go up in various territories - but it had not been clear if this included the UK. The last hike, also of £1, was introduced in the spring of 2024. Read more from Sky News Money:UK retail sales hit surprising highApple users could get 'significant' compensation'I lent my neighbour £1k and they won't give it back' Spotify told the Money blog: \"As we continue innovating and enhancing the value we deliver, we periodically update our pricing to reflect local market conditions and economic factors, ensuring our service remains unparalleled.\" Subscribers who do not want to pay the extra £1 can cancel at any time before their next billing date. Spotify's student discount, making a subscription £5.99, appears to be unchanged. Spotify, based in Sweden, is said to be the biggest music subscription service in the UK with 15.3 million subscribers - almost half the market."
    },
    {
        "title": "Blackstone among suitors for UnitedHealth-owned Optum UK",
        "description": "The company which supplies the electronic patient record system used by the majority of GPs in Britain is being circled by a pack of potential buyers, just two years after it last changed hands.",
        "url": "https://news.sky.com/story/blackstone-among-suitors-for-unitedhealth-owned-optum-uk-13456471",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-gp-surgery-nhs_6030998.jpg?20230121065450",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-24 09:52:00",
        "Headline": "The New York-listed healthcare giant is keen to recoup the £1.2bn it paid to buy the supplier of the electronic patient record system to most GP surgeries just two years ago, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The company which supplies the electronic patient record system used by the majority of GPs in Britain is being circled by a pack of potential buyers, just two years after it last changed hands. Sky News has learnt that Blackstone is among a group of private equity firms exploring potential offers for Optum's UK operation, which is owned by the New York-listed healthcare giant UnitedHealth Group. Optum UK's business includes EMIS, which was taken over by the UnitedHealth subsidiary in 2023 in a deal worth about £1.2bn. Money latest: Restaurant sends bitter message to customers The takeover was engineered under the stewardship of Sir Andrew Witty, the former GlaxoSmithKline boss who recently stepped down as UnitedHealth's chief executive. The US-listed company's stock has fallen by more than a third over the last year, leaving it with a market capitalisation at Thursday's close of just under $331bn. Bank of America is understood to have been engaged to advise on the sale process. \n                  Sheffield Wednesday deducted 12 points after entering administration\n                 \n                  Money latest: Restaurant posts spiky message to customers after closure\n                 \n                  Reeves kicks off hunt for £314,000-a-year-bank watchdog chief\n                 One private equity source said that UnitedHealth was keen to recoup the 2023 purchase price. The prospective sale formed part of efforts by Sir Andrew's successor, Stephen Hemsley, to arrest the company's alarming valuation decline, they added. Optum's takeover of EMIS deal was approved in September 2023 by British competition regulators following an in-depth Phase 2 investigation A spokesperson for Optum said: \"We do not comment on market speculation or rumours.\" Several other major financial investors are also understood to be in the early stages of exploring bids for the business. Blackstone declined to comment."
    },
    {
        "title": "China 'enemy' reference removed from key witness statement for collapsed spy trial",
        "description": "A reference to China being an \"enemy\" of the UK was removed from key evidence for a collapsed spy trial in 2023 as it \"did not reflect government policy\" under the Conservatives at the time, according to the national security adviser.",
        "url": "https://news.sky.com/story/china-enemy-reference-removed-from-key-witness-statement-for-collapsed-spy-trial-13456616",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-uk-china_7060647.jpg?20251024144336",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-24 13:31:00",
        "Headline": "The publication of letters comes amid a political row over the collapse of the prosecution of two men accused of conducting espionage for China.",
        "Content": "A reference to China being an \"enemy\" of the UK was removed from key evidence for a collapsed spy trial in 2023 as it \"did not reflect government policy\" under the Conservatives at the time, according to the national security adviser. In the letter published by parliament's Joint Committee on National Security Strategy earlier on Friday, National Security Adviser (NSA) Jonathan Powell said Counter Terror Police and the Crown Prosecution Service were aware of the change made by Deputy National Security Adviser (DSNA) Matt Collins. This would mean the CPS knew the \"enemy\" reference had been removed before charging the two suspects, according to Mr Powell. In another letter published on Friday, the director of public prosecutions (DPP) Stephen Parkinson told the committee that it took DSNA Mr Collins more than a year to confirm to prosecutors he would not say China posed a threat to UK national security in court. Politics latest: Farage reacts after Reform defeated by Plaid The DPP said a High Court judge ruled in June last year that an \"enemy\" under law is a state which \"presently poses an active threat to the UK's national security\", prompting the CPS to ask the DNSA whether China fulfilled that criteria. He added prosecutors did not believe there would be \"any difficulty in obtaining evidence\" from Mr Collins that China was a national security threat, but added: \"This was a sticking point that could not be overcome.\" \n                  British citizens are volunteering to commit crimes for Russian state for money and 'glamour', says counter-terror chief \n                 \n                  Elon Musk launches personal attack on NASA boss - and says he isn't smart enough for the job\n                 \n                  Did Trump and Zelenskyy's meeting turn into a 'shouting match'?\n                 Mr Parkinson added that the DNSA's \"unwillingness\" to describe China as an active or current threat was \"fatal to the case\" because Christopher Cash and Christopher Berry's defence teams would have been entitled to call him as a witness. The DPP added: \"This factor is compounded by the fact that drafts of the first witness statement, reviewed by us in July 2025, showed that references to China being an 'enemy' or 'possible enemy' had been deleted. \"Those drafts would probably have been disclosable to the defence.\"  A final draft of Mr Collins' statement was sent to then-prime minister Rishi Sunak in December 2023, Mr Powell's letter said. \"Drafts of a statement provided to DNSA included the term 'enemy' but he removed this term from the final draft as it did not reflect government policy,\" the letter reads. Read more:MI5 boss on threats from ChinaThe three key questions about the China spy case that need to be answered It comes amid a political row over the collapse of the prosecution of Christopher Berry and Christopher Cash last month, who were accused of conducting espionage for China. Both individuals vehemently deny the claims. Because the CPS was pursuing charges under the Official Secrets Act 1911, prosecutors would have had to show the defendants were acting for an \"enemy\".  DPP Mr Parkinson has come under pressure to provide a fuller explanation for the abandonment of the case. He has blamed insufficient evidence being provided by the government that Beijing represented a threat to the UK at the time of the alleged offences. The Conservatives have accused Sir Keir Starmer of letting the case collapse, but Labour has said there was nothing more it could have done. The current government has insisted ministers did not intervene in the case or attempt to make representations to ensure the strength of evidence, for fear of interfering with the course of justice. The DNSA and DPP will face questions from the parliamentary committee on Monday afternoon. The current attorney general, Lord Hermer, and the chancellor of the duchy of Lancaster, Darren Jones, will be questioned on Wednesday. The PM's spokesman reiterated the government's position that \"what is relevant in a criminal case of this nature is the government's position at the time of the alleged offences\"."
    },
    {
        "title": "Who is Lindsay Whittle? The man who stood unsuccessfully in Caerphilly 13 times, then won on the 14th try",
        "description": "Lindsay Whittle stood for election in Caerphilly 13 times since 1983 - and on the 14th attempt, he finally succeeded.",
        "url": "https://news.sky.com/story/who-is-lindsay-whittle-the-man-who-stood-unsuccessfully-in-caerphilly-13-times-then-won-on-the-14th-13456482",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lindsay-whittle-plaid-cymru_7060349.jpg?20251024110938",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-24 09:58:00",
        "Headline": "A lifelong Plaid Cymru activist, Lindsay Whittle has ended Labour's domination in the South Wales constituency.",
        "Content": " Lindsay Whittle stood for election in Caerphilly 13 times since 1983 - and on the 14th attempt, he finally succeeded. In the process, the 72-year-old local boy - nicknamed \"Mr Caerphilly\" - humiliated the Labour Party, which had held the Senedd seat since its creation in 1999 and the Westminster constituency for over a century. Born in the miner's hospital, Mr Whittle lived in a council house and grew up in the town, located to the north of Cardiff, that he now represents. A lifelong Plaid Cymru activist, his interest in politics was first piqued in the 1960s. He said he even missed an O Level (GCSE) exam in the 1970s because he was out canvassing for the party.  Mr Whittle was first elected in 1976 to represent the Penyrheol and Trecenydd ward on Rhymney Valley district council, and he was re-elected repeatedly until the council was abolished in 1996. He then contested the Penyrheol ward on the new Caerphilly County Borough Council, created in 1995, and was elected to represent it seven times. He served as the council's leader for two periods between 1999 and 2004, and has also served as Plaid Cymru's group leader on the council since 2022.  But, despite his success at the local level, Mr Whittle was only able to secure election to the then Welsh Assembly once in six attempts since its creation in 1999, becoming an MS on the South Wales East list 2011, before losing his seat in 2016. In those five years in Cardiff, he was appointed Plaid Cymru's spokesperson for Social Services, Children, and Equal Opportunities, and he was able to work on his key political interests of housing and local government, as well as combating homelessness. Read more from Sky News:Reform beaten by Plaid Cymru in Caerphilly by-electionAnalysis: Farage nowhere to be seen as Reform loses by-election Election by the people of his hometown of Caerphilly has always eluded him, however, having lost the 13 other elections for Westminster and the Senedd that he has stood in throughout a lifetime in Welsh politics. But that all changed last night when he was elected with a majority of nearly 4,000 votes to take over from the late Hefin David, the beloved Labour representative to whom he paid tribute in his victory speech. Speaking to our chief political correspondent Jon Craig as dawn broke over the town he was born in and now represents, Mr Whittle said: \"I would need to be a poet to put into words how I genuinely feel about the honour that all the people of Caerphilly have bestowed upon me. \"Almost half of the people who went out to vote, just 2% short of half of the people, put their confidence in Lindsay Whittle and Plaid Cymru. I cannot tell you what an honour that is.\" He added: \"Retirement is not for me. I'm not the sort of guy who relaxes on beaches. In fact, I don't think I ever relax. It's people. It's people that make me carry on.\""
    },
    {
        "title": "Jeremy Corbyn and Zarah Sultana's Your Party gains first Scottish representatives",
        "description": "Jeremy Corbyn and Zarah Sultana's Your Party gained its first Scottish councillors after three Green councillors and one of the party's top candidates in Glasgow defected.",
        "url": "https://news.sky.com/story/jeremy-corbyn-and-zarah-sultanas-your-party-gains-first-scottish-representitives-13456512",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-your-party-gomersall_7060436.jpg?20251024120213",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-24 10:36:00",
        "Headline": "The defections of a top Scottish Green candidate and three councillors will be seen as a success for Jeremy Corbyn and Zarah Sultana's Your Party.",
        "Content": "Jeremy Corbyn and Zarah Sultana's Your Party gained its first Scottish councillors after three Green councillors and one of the party's top candidates in Glasgow defected. Ellie Gomersall, who was Glasgow's second top candidate on the Greens regional list, is joined by councillors Dan Hutchison, Seonad Hoy, and Leodhas Massie. Ms Gomersall - who failed in her attempt to unseat former Scottish Greens co-leader Patrick Harvie in August - has been outspoken about her issues with the leadership of the party. \"Where every single one of the existing Holyrood parties is complicit in passing on brutal cuts to public services, it's clear to me that only Your Party can be taken seriously to stand firm against austerity and work to materially improve the lives of the working class,\" she said in a statement.  Read more:Corbyn and Sultana friends againGreen Party leader reveals defection She urged other Greens to follow suit, saying: \"If you want to see socialists elected to our parliaments, city chambers and town halls across Scotland and the UK, join me in Your Party.\" Mr Hutchison - who represents the Govan ward on Glasgow City Council - said: \"I'm proud to be joining a truly socialist party who will not accept the status quo, will actually involve ordinary people in the politics that impacts their lives, and won't be accepting brutal cuts in exchange for scraps off the table.\" The news comes as party co-founder Ms Sultana prepares to hold a rally in Glasgow on Friday. A Scottish Greens spokesperson said: \"We're disappointed to hear that they have decided to leave our party and Glasgow's largest group of socialist councillors. We thank them for the work they have done as Green councillors\".  What's next for Your Party? The defections will be seen as a high point for Your Party, after the early months of its creation were marred by an apparent split between Ms Sultana and former Labour leader and co-founder Mr Corbyn over how members will be able to sign up. Ms Sultana threatened legal action, but later backed away, saying it was \"for the sake of the party\". Corbyn didn't directly address the row, but previously said the new party had faced some \"fraught days\" and hadn't \"covered ourselves in glory\". The pair are said to have since made up - in a reconciliation jokingly compared to that of the Gallagher brothers of Oasis. Read more from Sky News:What we know about row between Corbyn and Sultana The new party is in the process of hashing out policies and processes for fielding candidates so it can be ready to fight the local elections in May 2026. Local branches are being set up across the country by volunteers, with next steps expected to be formally agreed at their founding conference in November. It also faces a decision on its formal name, with Your Party being used in the meantime until a decision is made at the conference."
    },
    {
        "title": "Harriet Harman: Jess Phillips can repair relations with grooming gang survivors so inquiry can go ahead",
        "description": "Safeguarding minister Jess Phillips can repair relations with grooming gang survivors so the inquiry can go ahead, Harriet Harman has said.",
        "url": "https://news.sky.com/story/harriet-harman-jess-phillips-can-repair-relations-with-grooming-gang-survivors-so-inquiry-can-go-ahead-13455891",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-electoral-dysfunction_7059622.png?20251023154734",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-24 04:00:00",
        "Headline": "Four survivors have quit the panel and called for the safeguarding minister's resignation over claims she wants to expand the scope of the inquiry - which she denies.",
        "Content": "Safeguarding minister Jess Phillips can repair relations with grooming gang survivors so the inquiry can go ahead, Harriet Harman has said. A row over who chairs and oversees the long-awaited inquiry into grooming gangs has seen four of about 30 survivors on the panel quit and say they will only return if Ms Phillips resigns. The women, who are overseeing the setting up of the inquiry, have accused her of wanting to expand the inquiry's scope so it focuses on more than grooming gangs - something Ms Phillips denies. Baroness Harman, a former Labour home secretary, told Beth Rigby on the Electoral Dysfunction podcast she thinks there has been miscommunication with some survivors which \"can be solved if there is underlying trust and confidence\". 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 She said this situation has happened before, with the Grenfell fire inquiry when friends and family of those killed were not happy about the original chair or scope, but came around and were satisfied with the outcome. It also happened, she said, when murdered teenager Stephen Lawrence's parents did not trust then-home secretary Jack Straw to set up an inquiry into the handling of the police investigation. \n                  PM has 'confidence' in Jess Phillips after grooming survivors demanded her resignation\n                 \n                  Candidates to lead grooming gangs inquiry may now think twice about role\n                 \n                  Men able to abuse children in Rotherham for years after police had their names, watchdog finds\n                 \"Actually, that trust was built, although at the outset of the [Lawrence] inquiry their lawyers stood up and asked for it to be adjourned and suspended indefinitely,\" she said. \"And that happened before it actually got going and became a really important landmark inquiry.\" Five other survivors invited on to the child sexual exploitation inquiry panel have written to Sir Keir Starmer to say they will continue working with the investigation only if the safeguarding minister stays. They say they believe Phillips has remained impartial and they want her to \"remain in position for the duration of the process for consistency\". Sir Keir has backed Ms Phillips to continue in her position. Baroness Harman said Ms Phillips was \"wrong to attack the people that are coming after her\" after the minister gave a fiery rebuke in the Commons over criticism of the inquiry, including about its scope and about two potential chairs - an ex-senior police officer and a former social worker - who have both now withdrawn. One of the survivors, Ellie Reynolds, said she felt an inquiry had become \"less about the truth and more about a cover-up\". Ms Phillips, who previously managed Women's Aid refuges for domestic abuse victims, denied this and insisted the government was \"committed to exposing the failures\". Read more:Why are abuse survivors losing faith in the grooming gangs inquiry?Why Jim Gamble quit grooming gang inquiry  Baroness Harman said the minister's \"attack... made the situation far more difficult\". But she added: \"It must be exasperating for Jess Phillips to have her credibility, her commitment, her integrity questioned by people who've made no commitment to the struggles that she's given her life's work to. \"But although it must be exasperating, she can't afford to be exasperated because this is about answering the questions that have been put. \"Because watching this is not just the 30 who are on the panel that have been chosen by the government to help with the inquiry, but it's the thousands of other girls who've been abused and for whom this inquiry matters enormously.\""
    },
    {
        "title": "Scottish government 'utterly irresponsible' over bottle return scheme, former UK minister tells court",
        "description": "The Scottish government was \"utterly irresponsible\" in the way it attempted to implement its bottle return scheme, a former UK government minister has claimed.",
        "url": "https://news.sky.com/story/scottish-government-utterly-irresponsible-over-bottle-return-scheme-former-uk-minister-tells-court-13456649",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-alister-jack-edinburgh_7060702.jpg?20251024154745",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-24 14:38:00",
        "Headline": "Biffa Waste Services is suing the Scottish government, seeking £166m of reparations over the decision to delay the deposit return scheme (DRS).",
        "Content": "The Scottish government was \"utterly irresponsible\" in the way it attempted to implement its bottle return scheme, a former UK government minister has claimed. Giving evidence at the Court of Session in Edinburgh on Friday, former Scottish secretary Lord Alister Jack said the Scottish government had withheld \"commercial information\" from businesses about a risk the deposit return scheme (DRS) would be blocked. Lord Jack was Scottish secretary when the UK government refused to grant the DRS an exemption for glass bottles under the Internal Market Act (IMA). This led to the Scottish government changing its plans for the scheme in 2023. A UK-wide DRS is planned but it is not expected to begin before 2027. Biffa Waste Services is suing the Scottish government, seeking £166m of reparations over the decision to delay the scheme. Lord Jack said he was \"appalled\" by a letter sent to firms about the scheme by then circular economy minister Lorna Slater in May 2022, which he said \"misled\" businesses about the true commercial picture. \n                  Arctic air to bring first significant cold snap of season to UK\n                 \n                  Scottish Greens 'riding same wave' as Green Party as membership surge continues\n                 \n                  Jeremy Corbyn and Zarah Sultana's Your Party gains first Scottish representatives\n                 \"I am staggered that a letter was produced by officials and signed by a minister and sent out to companies that were investing their shareholders money or their own money - and lots of it - and not knowing the inherent risks of the whole picture,\" he said. He added: \"It was, for me, irresponsible not to tell companies that are spending money what the whole story is, and explain to them the risks. \"There was a high level of risk and it was utterly irresponsible to send this letter, and that's my opinion.\" Read more:Lorna Slater gave 'emphatic' assurance about DRS, court told Lord Jack said the letters were sent after the government had been made aware it would need to apply for an exclusion from the IMA, which he claimed had been made clear by the UK government in March 2022. He said an exclusion from the IMA had a \"high bar\" and required impact assessments to be carried out. However, he said the government had done \"nothing\" to advance this work or to warn businesses of the risks before it formally applied for an exclusion in March 2023. As soon as they knew this was required, he said \"they should have sharpened up, got their exclusion request in, told their partners it was what they were doing, told their partner companies there was massive commercial risk for them\". Lord Jack said that as Scottish secretary he had a number of \"concerns\" about the scheme, including the impact it would have on companies and consumers, and its impact on inflation at a time of the cost of living crisis. He said more than 1,000 businesses and stakeholders had written to him \"saying it was going to seriously impact and damage their business, supermarkets telling me it was going to damage their business, consumers and so on\". He dismissed the suggestion his concerns were politically motivated, insisting it was \"beholden\" to him as Scottish secretary to \"ensure our businesses and our consumers were protected\". The Conservative peer said the fact the Scottish government was still working out how the scheme would work when it applied for an IMA exclusion in 2023 was \"farcical\". He said: \"It was a comedy of errors. Farcical. The whole thing was farcical.\""
    },
    {
        "title": "How did the grooming gangs inquiry get so toxic?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/electoral-dysfunction/id1613562765' target='_blank'> 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/how-did-the-grooming-gangs-inquiry-get-so-toxic-13455668",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-electoral-dysfunction_7039456.png?20251002190858",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-24 04:00:00",
        "Headline": "No subtitle found",
        "Content": " 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Sir Keir Starmer has backed safeguarding minister Jess Phillips, as a fifth abuse survivor calls on her to quit to restore trust in the grooming gangs inquiry. Beth, Ruth and Harriet explain why the national inquiry into the sexual exploitation of children by grooming gangs in England and Wales has become so poisonous and why the victims are so unhappy. Plus, as the government faces growing calls to formally strip Prince Andrew of his dukedom - what's the relationship between politics and royalty? And as membership for the Green Party surges, what's the appeal of the leader Zack Polanski? Remember, you can also watch Beth Rigby, Harriet Harman and Ruth Davidson on YouTube."
    },
    {
        "title": "Police Scotland investigating report of 'irregularities' in Alba Party finances",
        "description": "Police Scotland is investigating \"irregularities\" in the finances of the Alba Party.",
        "url": "https://news.sky.com/story/police-scotland-investigating-report-of-irregularities-in-alba-party-finances-13456435",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-alex-salmond-alba-party_6714472.jpg?20251024102756",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-10-24 09:18:00",
        "Headline": "A review of operations and finances was instigated by former first minister Alex Salmond while he was still alive as he had \"concerns with the management of the party\".",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Police Scotland is investigating \"irregularities\" in the finances of the Alba Party. The force said a complaint was lodged by the pro-independence party on 26 May, exactly two months after Kenny MacAskill won its leadership contest in light of Alex Salmond's death. The party said a review of its operations and finances was instigated by the former first minister while he was still alive as he had \"concerns with the management of the party\". An Alba Party spokesperson added: \"This review was undertaken with the full support of the Alba Party NEC. \"Subsequently a number of internal financial and administrative irregularities have come to light. \"In line with our legal and fiduciary duties these concerns have now been passed to the relevant authorities. \"The party formally reported its concerns to Police Scotland. As there is now a live police investigation we are unable to comment further at this time.\" \n                  Arctic air to bring first significant cold snap of season to UK\n                 \n                  Scottish government 'utterly irresponsible' over bottle return scheme, former UK minister tells court\n                 \n                  Scottish Greens 'riding same wave' as Green Party as membership surge continues\n                 A Police Scotland spokesperson said: \"On 26 May 2025, we received a complaint from the Alba Party in relation to irregularities within their finances. \"The investigation into this matter is ongoing.\" Read more from Sky News:Farage nowhere to be seen as Reform loses by-electionWhy are abuse survivors losing faith in grooming gang inquiry? The Alba Party was founded in 2021 and was led by Mr Salmond until his death in 2024. On 26 March, Mr MacAskill was elected the new leader of the party and vowed to deliver his predecessor's \"dream of independence\" for Scotland. The former MP and MSP saw off competition from rival candidate MSP Ash Regan. Earlier this month, Ms Regan quit as the party's sole MSP and is now sitting as an independent for the Edinburgh Eastern constituency."
    },
    {
        "title": "Could the UK run out of drinking water? Experts say 'fast changes' needed",
        "description": "Experts are warning that without \"fast changes\" the UK could run out of drinking water in the future.",
        "url": "https://news.sky.com/story/could-the-uk-run-out-of-drinking-water-experts-say-fast-changes-needed-13456636",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-yorkshire-water_7060720.jpg?20251024163036",
        "type": "Technology",
        "Author": "Lisa Dowd",
        "Date Published": "2025-10-24 23:01:00",
        "Headline": "The first seven months of 2025 were the driest since 1976, according to the Environment Agency. With the UK's summers predicted to only get hotter, is the country sleepwalking into a crisis?",
        "Content": "\n          Midlands correspondent\n              @LisaSkyNews\n  Experts are warning that without \"fast changes\" the UK could run out of drinking water in the future. The first seven months of 2025 were the driest since 1976, with reservoirs across England only 56.1% full on average, according to the Environment Agency. \"I think that we do need to worry about the fact that there is this possibility we could run out,\" Hannah Cloke, professor of hydrology from Reading University, told Sky News. \"It's only if we start thinking like that, that we're going to start conserving our water, otherwise we just take it completely for granted. \"It is all of our fault, we have not been paying attention to what's going on… we need some very fast changes to the way that we are using water and the way that we're storing water in order to stop this being a problem in the future, because our summers are only going to get hotter.\" By 2050, the government says that England could face a shortfall of five billion litres of water every day. 'Growing pressure' on water system A Department for Environment, Food and Rural Affairs spokesperson said: \"This government recognises the growing pressure on our water system and is taking decisive action. \"We're delivering over £104bn of private investment to fix leaking pipes, build nine new reservoirs and secure our water supply for the future.\" Latest figures suggest that around 2,690 megalitres of water is lost every day in England through leaks - the equivalent of 1,076 Olympic-sized swimming pools. Read more from Sky News:Scottish government 'utterly irresponsible' over bottle return schemeCow burps have a big impact on global warming 'We have invested an extra £10m'  \"Leaks are a really important issue for us. We have invested an extra £10m just to deal with the weather that we've seen this summer,\" said Dr Geoff Darch, head of strategic asset planning for Anglian Water. Anglian Water is also hoping to build two new reservoirs in the East of England. \"We don't want to stop people using water, it is absolutely essential for everything that we need it to do,\" Dr Darch said. \"But I think we've got to a point now where we have to realise that water is a precious resource, it's something that we all have to look after so that we have it for future generations and for the environment and with climate change and drought, we will need more reservoirs.\" Concerns about 'whole system starting to collapse' In August, the UK received just 62% of its average rainfall, according to the Met Office, which is leading a group of residents to monitor their water stocks closely. \"We collect all our own water from the rain, and so if we don't have the rain that's a significant issue,\" explained Simon Tilly, director of the Hockerton eco housing project in Nottinghamshire. He told Sky News they were working together to use less water. \"I suppose I'm most concerned about the whole system starting to collapse. There's potential for longer droughts and us having a lot of water stress, there's potential for a lot of floods when the drought finishes… and just generally that system going into random patterns where we're getting more droughts and more floods,\" he added."
    },
    {
        "title": "Rapper Ghetts charged after man killed in hit-and-run",
        "description": "The rapper Ghetts has been charged after a man was killed in a hit-and-run in northeast London.",
        "url": "https://news.sky.com/story/rapper-ghetts-charged-after-man-killed-in-hit-and-run-13456389",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ghetts-justin-clarke-samuel_7060257.jpg?20251024094910",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-24 08:15:00",
        "Headline": "The musician, whose real name is Justin Clarke-Samuel, was charged with causing serious injury by dangerous driving.",
        "Content": "The rapper Ghetts has been charged after a man was killed in a hit-and-run in northeast London. The musician, whose real name is Justin Clarke-Samuel, was charged with causing serious injury by dangerous driving. He allegedly failed to stop after hitting a 20-year-old man in Ilford last Saturday, the Met Police said. The 41-year-old appeared at Stratford Magistrates' Court on Monday - the same day the man died in hospital. The indictment is expected to change from causing serious injury to causing death by dangerous driving at the next hearing. Ghetts was remanded into custody and is due to appear at Barkingside Magistrates' Court on 27 October. The police are appealing for witnesses to the crash to come forward. Read more from Sky News:Two charged in connection with arson attack on mosqueFurious Trump cancels 'all trade negotiations' with Canada Ghetts is a grime rapper who played at Glastonbury last year and has collaborated with Ed Sheeran, Stormzy and Skepta. He also had a role in the Netflix drama Supacell. Last year, he received the Mobo Pioneer Award for his significant contribution to British black culture."
    },
    {
        "title": "Kim Kardashian diagnosed with brain aneurysm",
        "description": "Kim Kardashian has revealed that she has been diagnosed with a brain aneurysm. ",
        "url": "https://news.sky.com/story/kim-kardashian-diagnosed-with-brain-aneurysm-13456240",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kim-kardashian-brain_7060037.jpg?20251024015725",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-24 00:52:00",
        "Headline": "Research suggests brain aneurysms are most common in adults between the ages of 30 and 60 - with women disproportionately affected.",
        "Content": "Kim Kardashian has revealed that she has been diagnosed with a brain aneurysm.  Footage from the latest season of The Kardashians shows the reality TV star going for an imaging scan. The 45-year-old appears to suggest her small aneurysm may have stemmed from stress. Brain aneurysms are relatively common, with data suggesting they affect about one in every 50 people. In many cases, patients may be unaware that they have one - as they tend to cause few symptoms when unruptured. Should an unruptured aneurysm grow to a larger size, it can cause headaches, balance problems and speech issues. Those that burst are extremely dangerous and can prove fatal in some circumstances. \n                  'Tradwife', 'delulu' and 'skibidi' among new words added to Cambridge Dictionary\n                 \n                  'Grandpa robbers' found guilty over 'terrifying' Kim Kardashian heist at Paris hotel\n                 \n                  Kim Kardashian feared she was going to die during Paris heist - and tells robber she forgives him \n                 While aneurysms can emerge throughout the body, they are most typically found in the aorta, which carries blood out of the heart. Research suggests brain aneurysms are most common in adults between the ages of 30 and 60 - with women disproportionately affected. Read more entertainment news:Tess Daly and Claudia Winkleman to leave StrictlyBob Vylan's Manchester gig is postponed  Associate professor of neurology Dr Laura Stein told Sky's US partner NBC News: \" The most well-described risk factors include a predisposition [family history of aneurysm], high blood pressure, cigarette smoking and inflammation.\" She went on to explain that most fatal ruptured aneurysms are in the brain, killing about one in three patients. \"When it's a blood vessel that's in the head and it bleeds, there's a much higher risk of having a very bad problem just because the brain is enclosed in a fixed space,\" Dr Stein added. Low-risk aneurysms are monitored by doctors for growth or abnormalities, and there are a series of potential treatment options for those considered dangerous. Elsewhere in The Kardashians clip, Kim admitted that her ex-husband Kanye West will be in her life \"no matter what\" because of the four kids they share together."
    }
]