[
    {
        "title": "London-born rabbi Eli Schlanger and 10-year-old girl among 15 killed in Bondi Beach terror attack ",
        "description": "A London-born rabbi and a 10-year-old girl are among 15 innocent people killed in the Bondi Beach terror attack. ",
        "url": "https://news.sky.com/story/london-born-rabbi-eli-schlanger-and-10-year-old-girl-among-16-killed-in-bondi-beach-terror-attack-13483323",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rabbi-eli-eli-schlanger_7110098.png?20251214165953",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-14 15:15:00",
        "Headline": "The father-of-five, 41, was described by his cousin as as \"vivacious, optimistic and full of energy and life\". ",
        "Content": "A London-born rabbi and a 10-year-old girl are among 15 innocent people killed in the Bondi Beach terror attack.  Rabbi Eli Schlanger, 41, died when two gunmen - a father and son - targeted a Hanukkah celebration at a park next to the beach on the first day of the Jewish festival of lights on Sunday evening. One of the attackers, a 50-year-old man, was killed along with 15 innocent people, aged between 10 and 87 years old. The other gunman, who has been named as 24-year-old Naveed Akram, is in a critical condition, police said. A 10-year-old girl died in hospital following the attack, while Israel's foreign ministry has said one of the country's citizens is also among the dead. Follow live: 15 people and gunman killed at event celebrating Hanukkah French President Emmanuel Macron announced a French citizen, Dan Elkayam, was among those killed. \n                  Photographer 'locked eyes' with gunman, as witness describes Bondi 'warzone' \n                 \n                  Hero who tackled and disarmed Bondi Beach gunman is Sydney fruit shop owner\n                 \n                  What we know so far about mass shooting at Sydney's Bondi Beach\n                 Larisa Kleytman told reporters outside St Vincent's Hospital her husband, Alexander Kleytman, was among the dead, according to The Australian newspaper. The couple were both Holocaust survivors.  Mr Schlanger was assistant rabbi at Chabad of Bondi, a Jewish cultural centre. His cousin, Rabbi Dovid Lewis, of the South Manchester Synagogue, told Sky News their great-uncle, the late Reverend Leslie Olsberg, served as a rabbi at the Heaton Park Synagogue in the city, where two people were killed in a terror attack on 2 October. He said his cousin had \"dedicated his life to adding light and to spreading Torah and Judaism\" and in the wake of the Manchester attack sent a post on social media saying: \"We will respond with light.\" \"There's a feeling of numbness, but there's also a feeling he lived,\" he said. \"I'm not going to wallow in pity, I'm going to do something in his memory.\" He said his cousin \"lit a light\", adding: \"I'm now obliged to pick up that light and become a torchbearer.\" He added: \"We have got to say darkness can only be combatted with light. It's what he did, it's what I will do, it's what we ask everyone else to do as well.\" Mr Schlanger was a father of five who, along with his wife Chayala, celebrated the birth of their youngest child, a boy, two months ago, and grew up in Temple Fortune, north London, according to Jewish News. Another one of his cousins, Brighton-based Rabbi Zalman Lewis, described Mr Schlanger to Sky News as an \"incredibly vivacious, energetic, positive guy\" who had \"dedicated his life to helping people\". Read more:What we know so far about Bondi Beach shooting He said his initial reaction was one of \"deep pain and confusion\" but he quickly knew he had to respond with a \"positive message of hope and light and positivity\". \"The world is a good place,\" he said. \"There is some evil. There is some darkness. But, overwhelmingly, there is goodness in the world. And, overwhelmingly, there are good people in the world. And I came home, and I said to myself, I need to create a positive energy for myself, for my family, for my community.\""
    },
    {
        "title": "Photographer 'locked eyes' with gunman, as witness describes Bondi 'warzone' ",
        "description": "Messages were sweeping across Sydney within minutes of the attack at Bondi Beach.",
        "url": "https://news.sky.com/story/photographer-locked-eyes-with-gunman-as-witness-describes-bondi-warzone-13483330",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nicole-johnston-bondi_7110017.jpg?20251214155147",
        "type": "Home",
        "Author": "Nicole Johnston",
        "Date Published": "2025-12-14 15:34:00",
        "Headline": "Lifeguards helped the injured, using surfboards to carry them away. ",
        "Content": "\n          News correspondent\n              @nicole_reporter\n  Messages were sweeping across Sydney within minutes of the attack at Bondi Beach. Parents messaged their children and teenagers, who had been enjoying a late afternoon swim at Bondi. Witnesses said police were on the scene quickly, and the streets of Sydney's eastern suburbs were full of police cars and ambulances on their way to Bondi. Follow live: 15 people killed at event celebrating Hanukkah When we arrived, there were still dozens of people processing what had happened, and everywhere - shock. Witnesses told us that when the gunfire started some people took cover in the North Bondi Surf Life Saving Club. Once the threat was over, lifeguards helped the injured and used surfboards to carry them out. Some people were clearly traumatised and provided graphic detail of witnessing the shooting and seeing people killed in front of them. \n                  London-born rabbi Eli Schlanger and 10-year-old girl among 15 killed in Bondi Beach terror attack \n                 \n                  Hero who tackled and disarmed Bondi Beach gunman is Sydney fruit shop owner\n                 \n                  What we know so far about mass shooting at Sydney's Bondi Beach\n                 A photographer, Danny, was covering the Jewish holiday event. Read more: What we know so far He said he \"locked eyes\" with one of the gunmen, who then fired towards him. Danny said he was grazed by a bullet. He kept filming during the shooting, while taking cover. Sam, from France, was working at Bondi. He went to the scene of the attack and saw almost a dozen people lying on the ground covered in blood. Sam described it as like a \"war zone\". Rabbi Lei Wolff, from Central Synagogue in Sydney, went to Bondi as soon as he heard about the mass shooting. A dear friend of his, Rabbi Eli Schlanger, was killed in the attack. Rabbi Wolff has called on people around the world to stand with Australia's Jewish community against terrorism."
    },
    {
        "title": "What we know so far about mass shooting at Sydney's Bondi Beach",
        "description": "At least 16 people have been killed, including a 10-year-old girl, after a mass shooting at Bondi Beach in Sydney.",
        "url": "https://news.sky.com/story/what-we-know-so-far-about-mass-shooting-at-sydneys-bondi-beach-13483200",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bondi-beach-shooting_7109641.jpg?20251214104304",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-14 09:37:00",
        "Headline": "At least 16 people were killed, including one of two gunmen who opened fire at a Hanukkah event at Bondi Beach. The other suspect is in custody and remains in a critical condition.",
        "Content": " At least 16 people have been killed, including a 10-year-old girl, after a mass shooting at Bondi Beach in Sydney. Here is what we know so far about what happened in the Australian coastal city. Latest updates on shooting How many people were killed or injured? Among the 16 fatalities are a 10-year-old girl. Those killed range in age between 10 and 87, according to New South Wales police. Another 40 people remain in hospital, including three children. Five people are critically ill, with the others either in serious or stable condition. These police figures include the two suspects, one of whom was killed at the scene, while the other is in custody in a critical condition. Only one victim has been identified so far. The family of British-born Rabbi Eli Schlanger, an assistant rabbi at Chabad of Bondi, have paid tribute to him. Israel's foreign ministry also said an Israeli citizen had been killed. How did the shooting unfold? More than 1,000 people were at an event celebrating the Jewish festival of Hanukkah at the time of the shooting, police said. Officers were called at about 6.47pm on Sunday (7.47am UK time), as they responded to reports of shots being fired at Archer Park, Bondi Beach. New South Wales Premier Chris Minns said two individuals fired on a \"crowded group of families\" at the park in a \"cowardly act of terrifying violence\". Officers have declared the attack a terrorist incident. One video showed two gunmen appearing to open fire from a small bridge overlooking the beach, while another showed fleeing crowds running on the beach. In a third video, a bystander can be seen wrestling a rifle from one of the gunmen. Ahmed al Ahmed, 43, who was shot twice in the incident, then aims the weapon at the attacker, who seems to run towards his accomplice on a bridge.  Who are the suspected gunmen? One of the suspected gunmen is 24-year-old Naveed Akram, who was critically injured. His driver's licence says he lives in Bonnyrigg, a suburb of Sydney. The identity of the other suspected attacker, who died at the scene, is not known but police say he was 50-years-old. What have witnesses said? Witnesses have described the terror and confusion as masses of people fled the beach. Arsen Ostrovsky was injured and said the shooting was an \"absolute bloodbath\". He said he had also \"survived October 7th\" - the Hamas attack on Israel two years ago.  He told Sky News Australia he had only been in Australia for a fortnight. Mr Ostrovsky said: \"I lived in Israel the last 13 years. We came here only two weeks ago to work in the Jewish community, to fight antisemitism, to fight this bloodthirsty, ravaging hatred. That's why I'm here. You know, we've lived through worse. We're going to get through this.\" He added: \"I saw at least one gunman firing. Looked like a shotgun, firing randomly in all directions. I saw children falling to the floor, elderly, I saw invalids… it was just an absolute bloodbath.\" Elodie Obkircher told Sky News she and her boyfriend were at the nearby North Bondi RSL club when the shooting happened. She said: \"We heard 10 gunshots. So everyone dropped down to the ground. A lot of us were crying and shaking. It was very traumatic. \"It was absolute chaos. \"We could hear the rounds of shots. At first, everyone thought it was fireworks, but I saw people running along the beach. I've never seen so many people running. \"We could see everyone hiding behind their cars. And then as soon as we heard the shots, 10 rounds go, we knew it was a gunman.\"  Another witness told 9News there were \"thousands of people just like running\". \"And I opened up the back gate to my friend's cafe and just let everyone in. Pregnant women, women with kids, just everyone's running. \"It was pandemonium.\" Meanwhile, Rabbi Levi Wolff, of Central Synagogue Sydney, went to the scene when he was informed about the shooting. He told Sky News: \"We are on the eve of the Jewish holiday of Hanukkah, known as the Festival of Lights, and there was about to be a public menorah lighting for the first night of the Jewish holiday. \"And the gunmen were just shooting at those who were there present for the menorah lighting.\"  Rabbi Wolff went on to say that his colleague and friend, Rabbi Eli Schlanger, was killed in the terror attack. He said he was \"full of light, full of unbelievable energy\" and \"gave so much of himself to this very community\". Jewish News, speaking to Mr Schlanger's cousin, reports that he was born in London. What have police said? Police said their operation was \"ongoing\" and a \"number of suspicious items located in the vicinity\" were being examined by specialist officers. An exclusion zone was in place, they added. They later said a police bomb disposal unit was working on a suspected improvised explosive device in one of the suspects' cars. Police also raided the home of a suspect in the suburb of Bonnyrigg. How have world leaders reacted? New South Wales Premier Chris Minns called it a \"horrifying evil attack\" while the country's prime minister Anthony Albanese said it was a \"devastating\" terrorist attack that struck at the heart of the nation. Donald Trump said it was \"terrible\" and \"antisemitic\", but also praised the \"very brave\" man who tackled one of the gunman.  King Charles said he and Queen Camilla were \"appalled and saddened\" while Sir Keir Starmer described the shooting as \"sickening\". Israeli PM Benjamin Netanyahu said it was \"cold-blooded murder\", but also pointed out that he had previously warned Anthony Albanese about growing antisemitism in Australia."
    },
    {
        "title": "Hero who tackled and disarmed Bondi Beach gunman is Sydney fruit shop owner",
        "description": "A bystander hailed a hero after he tackled and disarmed one of the gunmen in the Bondi Beach shooting is a shop owner.",
        "url": "https://news.sky.com/story/hero-who-tackled-and-disarmed-bondi-beach-gunman-is-sydney-fruit-shop-owner-13483314",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bondi-beach-attack_7109976.jpg?20251214153232",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-14 14:58:00",
        "Headline": "In a video, the bystander was seen running up to the attacker from behind and then grabbing the shotgun from him before pointing the weapon back at him.",
        "Content": " A bystander hailed a hero after he tackled and disarmed one of the gunmen in the Bondi Beach shooting is a shop owner. The man, named by a relative as 43-year-old Ahmed al Ahmed, was seen in a video running up to the attacker from behind and then grabbing the shotgun from his hands before pointing the weapon back at him. The footage then showed the terrorist heading towards a bridge where another gunman was located, while the bystander placed the gun beside a tree. Live updates on Sydney shooting Mr Ahmed, who was wearing a white T-shirt, was shot twice in the incident and was due to have surgery, his cousin, Mustafa, has revealed. In a video on 7News, Mr Ahmed appeared to have a bloodied arm and hand, and was helped by other people near the scene in the Australian city. At least 16 people were killed, including one of the gunmen, and 40 others were injured in the attack. Two gunmen opened fire from a bridge on crowds at a Jewish event around 6pm local time on Sunday evening. More than 1,000 people had been at the gathering which was celebrating the festival of Hanukkah. A gunman was killed and another was in a critical condition following the shooting. One of the suspects was 24-year-old Naveed Akram. His driver's licence says he lives in Bonnyrigg, a suburb of Sydney. The identity of the other suspected attacker is not known. Mustafa said father-of-two Mr Ahmed, who owns a fruit shop in the Sydney suburb of Sutherland, did not have any experience with guns but was just walking past when he decided to step in. He told 7News: \"He's in hospital and we don't know exactly what's going on inside. \"We do hope he will be fine. He's a hero, 100%.\" Read more:What we know about mass shooting  The footage of the bystander's actions spread quickly on social media as people praised the man for his bravery, saying his actions had potentially saved many lives. \"Australian hero (random civilian) wrestles gun off attacker and disarms him. Some people are brave and then some people are... whatever this is,\" one person said on X, sharing the video. \"This Australian man saved countless lives by stripping the gun off one of the terrorists at Bondi beach. HERO,\" another said. Chris Minns, the premier of New South Wales state, where Sydney is located, said it was the \"most unbelievable scene I've ever seen\". \"A man walking up to a gunman who had fired on the community and single-handedly disarming him, putting his own life at risk to save the lives of countless other people.\" \"That man is a genuine hero, and I've got no doubt that there are many, many people alive tonight as a result of his bravery,\" he added. The country's prime minister Anthony Albanese praised the actions of Australians who had \"run towards danger in order to help others\". \"These Australians are heroes and their bravery has saved lives,\" he told a news conference."
    },
    {
        "title": "Everyone in UK 'must step up' to deter Russian threat of wider war, armed forces chief to warn",
        "description": "The whole of the UK - not just its armed forces - needs to step up to deter the threat posed by Russia of a wider war in Europe, Britain's military chief will say.",
        "url": "https://news.sky.com/story/everyone-in-uk-must-step-up-to-deter-russian-threat-of-wider-war-armed-forces-chief-to-warn-13483508",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-uk-soldiers-army-nato-training-exercise_7110416.jpg?20251215000018",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-12-14 23:16:00",
        "Headline": "The chief of the defence staff, Sir Richard Knighton, will say Russia's war in Ukraine shows that Vladimir Putin's willingness to target his neighbours \"threatens the whole of NATO, including the UK\".",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n The whole of the UK - not just its armed forces - needs to step up to deter the threat posed by Russia of a wider war in Europe, Britain's military chief will say. In the kind of nation-wide call to action that has not been heard since the height of the Cold War, Air Chief Marshal Sir Richard Knighton will use a speech in London on Monday evening to urge the British public to make defence and resilience \"a higher priority\". He will say Russia's war in Ukraine shows that Vladimir Putin's willingness to target his neighbours \"threatens the whole of NATO, including the UK. The Russian leadership has made clear that it wishes to challenge, limit, divide and ultimately destroy NATO\". Yet there was nothing in excerpts of the speech - released in advance by the Ministry of Defence - that pointed to any push by Sir Keir Starmer's government to increase defence spending faster than planned, despite the flashing warning signs and concerns among senior military officers that the budget is currently set to grow too slowly. In a further articulation of the threat, Blaise Metreweli, the new head of MI6, will use a separate speech on Monday to warn that the \"front line is everywhere\" in a new \"age of uncertainty\". \"The export of chaos is a feature not a bug in the Russian approach to international engagement,\" she will say, in her first public comments since becoming the first female chief of the Secret Intelligence Service in October. \"We should be ready for this to continue until Putin is forced to change his calculus.\"  \n                  MI6: 'No evidence' Putin wants to negotiate peace in Ukraine\n                 \n                  MI6 launches new drive to recruit spies - including Russians\n                 \n                  MI6 gets its first female chief - but here's 4 top UK jobs that a woman has never done\n                 Read more:Head of MI6: 'Never seen the world in a more dangerous state'NATO chief calls for 400% increase in air and missile defence Defence and security chiefs across the NATO alliance are increasingly sounding the alarm about the potential for Russia's war in Ukraine to ignite a much wider conflict.  Mark Rutte, the head of NATO, last week said Europe must ready itself for a confrontation with Russia on the kind of scale \"our grandparents and great-grandparents endured\" - a reference to the First and Second World Wars. At the same time, Al Carns, the UK's armed forces minister, said Britain is \"rapidly developing\" plans to ready the entire country for the possible outbreak of war. Sky News revealed last year that the UK had no national plan for the defence of the country or the mobilisation of its people. By contrast, a detailed blueprint for the transition from a state of peace to one of war existed throughout the Cold War, setting out not just what the armed forces, emergency services and local governments had to do in the event of conflict, but also wider society, including people working in industry, schools and public transport.  However, this Government War Book was quietly shelved after the Soviet Union collapsed and successive governments took a so-called \"peace dividend\", shifting investment out of defence and into other priorities such as health and welfare. Sky News and Tortoise have documented the hollowing out of the UK's armed forces and wider national resilience in a podcast series called The Wargame. The expected comments by Air Chief Marshal Knighton in an annual lecture at the Royal United Services Institute (RUSI) appear to signal an attempt by the government to put the country back on more of a war footing in the face of rising threats. But military insiders have warned that a timeline set out by the government of 10 years to boost defence spending to 3.5% of GDP from 2.3% is far too slow. 👉 Click here to listen to The Wargame on your podcast app 👈 The chief of the defence staff will say: \"The situation is more dangerous than I have known during my career and the response requires more than simply strengthening our armed forces. A new era for defence doesn't just mean our military and government stepping up - as we are - it means our whole nation stepping up.\" He will nod to the planned uplift in spending, noting \"the price of peace is increasing\". He is set to say: \"The war in Ukraine shows that Putin's willingness to target neighbouring states, including their civilian populations, potentially with such novel and destructive weapons, threatens the whole of NATO, including the UK.\" This is a threat that wider society needs to prepare for as well as the military.  \"Our armed forces always need to be ready to fight and win - that's why readiness is such a priority,\" Air Chief Marshal Knighton will say. \"But deterrence is also about our resilience to these threats, it's about how we harness all our national power, from universities, to industry, the rail network to the NHS. It's about our defence and resilience being a higher national priority for all of us. An 'all-in' mentality.\" It is a highly unusual intervention that has echoes of the Cold War when the UK last involved all of society in a programme of national defence and resilience against the threat of World War Three and potential nuclear Armageddon posed by the then Soviet Union. \"We are heading into uncertainty, and that uncertainty is becoming more profound, both as our adversaries become more capable and unpredictable, and as unprecedented technology change manifests itself,\" Air Chief Marshal Knighton will say."
    },
    {
        "title": "Thailand destroys bridge as fighting with Cambodia over disputed region continues",
        "description": "Thailand has announced a curfew as fighting with Cambodia spread to more areas of a disputed border region.",
        "url": "https://news.sky.com/story/thailand-destroys-bridge-as-fighting-with-cambodia-over-disputed-region-continues-13483166",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-cambodia-thailand_7109579.jpg?20251214082116",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-14 13:09:00",
        "Headline": "Fighting has flared up several times this year since a Cambodian soldier was killed in a May skirmish, as decades-old tensions over the border territory persist.",
        "Content": "Thailand has announced a curfew as fighting with Cambodia spread to more areas of a disputed border region. Renewed conflict between the southeast Asian neighbours has stretched into a second week, despite claims of a ceasefire by would-be peacemaker, US President Donald Trump. On Sunday, Thailand's government said a rocket attack from Cambodia killed a 63-year-old villager, its first civilian death reported as a direct result of combat over the past week. Fighting has flared up several times this year since a Cambodian soldier was killed in a May skirmish, as decades-old tensions over the border territory persist. Thailand and Cambodia have exchanged heavy-weapons fire at multiple locations along their 508-mile border since Monday. Thai forces said on Saturday that they had destroyed a bridge that Cambodia used to deliver heavy weapons and other equipment to the region. Meanwhile, Cambodia accused Thailand of striking civilian infrastructure. Thailand's curfew covers five districts of Trat province that neighbour Koh Kong, excluding the tourist islands of Koh Chang and Koh Kood. This is in addition to the curfew the military previously imposed in the eastern Sakeo province, which remains in force. Around two dozen people have been killed in the past week, according to official reports. Read more:Tens of thousands flee fresh fighting The renewed fighting ended a July ceasefire that was brokered by Malaysia and pushed through under pressure from Mr Trump, who threatened to withhold trade privileges unless the two sides agreed. On Friday, Mr Trump said the two countries \"agreed to CEASE all shooting effective this evening, and go back to the original Peace Accord made with me\" on his Truth Social platform. However, fighting has continued this weekend.  Why are Thai and Cambodian troops fighting? The roots of the Thai-Cambodian border conflict lie in a history of enmity over competing territorial claims. These claims largely stem from a 1907 map created while Cambodia was under French colonial rule, which Thailand argues is inaccurate. Tensions were heightened by a 1962 International Court of Justice ruling that awarded sovereignty to Cambodia, which still angers many Thais."
    },
    {
        "title": "Everyone in UK 'must step up' to deter Russian threat of wider war, armed forces chief to warn",
        "description": "The whole of the UK - not just its armed forces - needs to step up to deter the threat posed by Russia of a wider war in Europe, Britain's military chief will say.",
        "url": "https://news.sky.com/story/everyone-in-uk-must-step-up-to-deter-russian-threat-of-wider-war-armed-forces-chief-to-warn-13483508",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-uk-soldiers-army-nato-training-exercise_7110416.jpg?20251215000018",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2025-12-14 23:16:00",
        "Headline": "The chief of the defence staff, Sir Richard Knighton, will say Russia's war in Ukraine shows that Vladimir Putin's willingness to target his neighbours \"threatens the whole of NATO, including the UK\".",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n The whole of the UK - not just its armed forces - needs to step up to deter the threat posed by Russia of a wider war in Europe, Britain's military chief will say. In the kind of nation-wide call to action that has not been heard since the height of the Cold War, Air Chief Marshal Sir Richard Knighton will use a speech in London on Monday evening to urge the British public to make defence and resilience \"a higher priority\". He will say Russia's war in Ukraine shows that Vladimir Putin's willingness to target his neighbours \"threatens the whole of NATO, including the UK. The Russian leadership has made clear that it wishes to challenge, limit, divide and ultimately destroy NATO\". Yet there was nothing in excerpts of the speech - released in advance by the Ministry of Defence - that pointed to any push by Sir Keir Starmer's government to increase defence spending faster than planned, despite the flashing warning signs and concerns among senior military officers that the budget is currently set to grow too slowly. In a further articulation of the threat, Blaise Metreweli, the new head of MI6, will use a separate speech on Monday to warn that the \"front line is everywhere\" in a new \"age of uncertainty\". \"The export of chaos is a feature not a bug in the Russian approach to international engagement,\" she will say, in her first public comments since becoming the first female chief of the Secret Intelligence Service in October. \"We should be ready for this to continue until Putin is forced to change his calculus.\"  \n                  MI6: 'No evidence' Putin wants to negotiate peace in Ukraine\n                 \n                  MI6 launches new drive to recruit spies - including Russians\n                 \n                  MI6 gets its first female chief - but here's 4 top UK jobs that a woman has never done\n                 Read more:Head of MI6: 'Never seen the world in a more dangerous state'NATO chief calls for 400% increase in air and missile defence Defence and security chiefs across the NATO alliance are increasingly sounding the alarm about the potential for Russia's war in Ukraine to ignite a much wider conflict.  Mark Rutte, the head of NATO, last week said Europe must ready itself for a confrontation with Russia on the kind of scale \"our grandparents and great-grandparents endured\" - a reference to the First and Second World Wars. At the same time, Al Carns, the UK's armed forces minister, said Britain is \"rapidly developing\" plans to ready the entire country for the possible outbreak of war. Sky News revealed last year that the UK had no national plan for the defence of the country or the mobilisation of its people. By contrast, a detailed blueprint for the transition from a state of peace to one of war existed throughout the Cold War, setting out not just what the armed forces, emergency services and local governments had to do in the event of conflict, but also wider society, including people working in industry, schools and public transport.  However, this Government War Book was quietly shelved after the Soviet Union collapsed and successive governments took a so-called \"peace dividend\", shifting investment out of defence and into other priorities such as health and welfare. Sky News and Tortoise have documented the hollowing out of the UK's armed forces and wider national resilience in a podcast series called The Wargame. The expected comments by Air Chief Marshal Knighton in an annual lecture at the Royal United Services Institute (RUSI) appear to signal an attempt by the government to put the country back on more of a war footing in the face of rising threats. But military insiders have warned that a timeline set out by the government of 10 years to boost defence spending to 3.5% of GDP from 2.3% is far too slow. 👉 Click here to listen to The Wargame on your podcast app 👈 The chief of the defence staff will say: \"The situation is more dangerous than I have known during my career and the response requires more than simply strengthening our armed forces. A new era for defence doesn't just mean our military and government stepping up - as we are - it means our whole nation stepping up.\" He will nod to the planned uplift in spending, noting \"the price of peace is increasing\". He is set to say: \"The war in Ukraine shows that Putin's willingness to target neighbouring states, including their civilian populations, potentially with such novel and destructive weapons, threatens the whole of NATO, including the UK.\" This is a threat that wider society needs to prepare for as well as the military.  \"Our armed forces always need to be ready to fight and win - that's why readiness is such a priority,\" Air Chief Marshal Knighton will say. \"But deterrence is also about our resilience to these threats, it's about how we harness all our national power, from universities, to industry, the rail network to the NHS. It's about our defence and resilience being a higher national priority for all of us. An 'all-in' mentality.\" It is a highly unusual intervention that has echoes of the Cold War when the UK last involved all of society in a programme of national defence and resilience against the threat of World War Three and potential nuclear Armageddon posed by the then Soviet Union. \"We are heading into uncertainty, and that uncertainty is becoming more profound, both as our adversaries become more capable and unpredictable, and as unprecedented technology change manifests itself,\" Air Chief Marshal Knighton will say."
    },
    {
        "title": "Strawberry fields forever? The West Sussex farm growing berries in December",
        "description": "Acres of sweet, red strawberries are ripening in West Sussex this winter ready to be sold in UK supermarkets.",
        "url": "https://news.sky.com/story/a-berry-good-idea-the-west-sussex-farm-growing-strawberries-in-december-13483104",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-strawberries-winter_7109406.jpg?20251213201711",
        "type": "UK",
        "Author": "Emma Birchley",
        "Date Published": "2025-12-14 00:01:00",
        "Headline": "LED lighting in vast greenhouses is enabling the fruit to be grown all year long on a commercial scale for the first time ever.",
        "Content": "\n          News correspondent\n        Acres of sweet, red strawberries are ripening in West Sussex this winter ready to be sold in UK supermarkets. LED lighting in vast glasshouses is enabling berries to be grown all year on a commercial scale for the first time ever. It means less reliance on fruit flown in from countries like Egypt. \"The LED lighting is the prime reason for successful growing,\" said Bartosz Pinkosz, operations director of The Summer Berry. \"If it was not a sunny day, the LED lighting would create enough energy for leaves to absorb that energy, take it in and deliver the energy to the berries. \"We are able to have the right sweetness in the berries and the right shape, right size.\" There are 36,000 square metres of the greenhouses at the site in Chichester, partially powered by renewable energy and buzzing with bees as pollinators. And the new strand to the business means year-round work for 50 people. But while it might cut the food miles dramatically, there's still an inevitable environmental impact when a colossal space is created warm enough for pickers to wear short sleeves in winter. Dr Tara Garnett, director of food systems platform TABLE, said: \"You're going to need a lot of heat and you're going to need a lot of light in order to reproduce those summer growing conditions so everything hinges on the energy source you're going to be using. \"And when we look at the UK self sufficiency levels in fruit and vegetables they are appalling - 16% of the fruit we consume is UK-grown, so the vast majority is imported, and when it comes to vegetables we're looking more at 50% or so, so there's a lot more we can do to build up, and should be doing.\" Around 1.5 million punnets of strawberries are expected to be picked on the site over the full stretch of winter, allowing British strawberries to be eaten this Christmas. But for some, it's simple - strawberries should be saved for summer, even if it is a much shorter journey from plant to plate."
    },
    {
        "title": "Paul Lim makes darts history as he becomes oldest player to win match at PDC World Championship",
        "description": "Paul Lim has become the oldest player ever to win a match at the PDC World Darts Championship.",
        "url": "https://news.sky.com/story/paul-lim-makes-darts-history-as-he-becomes-oldest-player-to-win-match-at-pdc-world-championship-13483175",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-paul-lim-darts-jeffrey-de-graaf_7109584.jpg?20251214083534",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-14 09:46:00",
        "Headline": "The 71-year-old will next face 2024 world champion Luke Humphries who he beat in the tournament five years ago.",
        "Content": "Paul Lim has become the oldest player ever to win a match at the PDC World Darts Championship. The 71-year-old defeated Dutch-born Swede Jeffrey de Graaf 3-1 in the opening round as the Singapore veteran was roared on by the crowd at Alexander Palace in north London. Lim beat the previous record held by Northern Irishman John MaGowan, who was 67 when he knocked out Englishman Chris Mason in round one in December 2008. Lim, known as the 'Singapore Slinger', will face 2024 world champion Luke Humphries in the second round. Humphries, 30, had progressed with a 3-1 win over fellow Englishman Ted Evetts in his opening match on Saturday. Lim beat Humphries in the tournament five years ago, when the older player, then aged 66, won 3-2 in the first round. The darts rematch will see a different Humphries altogether take on Lim with a raft of major titles to his name. \n                  Luke Littler: 16-year-old has 'worked hard' to reach semi-final, says best friend\n                 \n                  Luke Littler: 16-year-old through to semi-final of World Darts Championship\n                 \n                  Luke Littler: 16-year-old darts sensation books place in quarter-finals of World Darts Championship\n                 However, he knows the crowd may not be on his side in his latest battle. On facing Lim, Humphries said: \"It's amazing. He's a legend. The hardest thing for me is that he loves me to bits. \"I talk to Paul a lot and he always says to me, 'you're my favourite player'. It's hard to go and play him - the crowd are going to be against me, so it will be a tough game.\" Read more from Sky News:King 'deeply touched' by reaction to cancer updateThe Sussex farm growing berries in December Lim said after his own win: \"First and foremost, I'm thankful to be here and I'm thankful to this crowd behind me. Just to make it here is an achievement. \"No matter how good you are, there are times where you can miss a shot, and you've just got to take advantage. \"I just took the advantage and I'm glad. \"Luke Humphries, I've been watching the last few years and he puts so much effort and time into what he's doing. \"He's a good guy, a gentleman and a great player. I just hope on a given day it can happen again. He's good but can be beaten.\""
    },
    {
        "title": "Photographer 'locked eyes' with gunman, as witness describes Bondi 'warzone' ",
        "description": "Messages were sweeping across Sydney within minutes of the attack at Bondi Beach.",
        "url": "https://news.sky.com/story/photographer-locked-eyes-with-gunman-as-witness-describes-bondi-warzone-13483330",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nicole-johnston-bondi_7110017.jpg?20251214155147",
        "type": "World",
        "Author": "Nicole Johnston",
        "Date Published": "2025-12-14 15:34:00",
        "Headline": "Lifeguards helped the injured, using surfboards to carry them away. ",
        "Content": "\n          News correspondent\n              @nicole_reporter\n  Messages were sweeping across Sydney within minutes of the attack at Bondi Beach. Parents messaged their children and teenagers, who had been enjoying a late afternoon swim at Bondi. Witnesses said police were on the scene quickly, and the streets of Sydney's eastern suburbs were full of police cars and ambulances on their way to Bondi. Follow live: 15 people killed at event celebrating Hanukkah When we arrived, there were still dozens of people processing what had happened, and everywhere - shock. Witnesses told us that when the gunfire started some people took cover in the North Bondi Surf Life Saving Club. Once the threat was over, lifeguards helped the injured and used surfboards to carry them out. Some people were clearly traumatised and provided graphic detail of witnessing the shooting and seeing people killed in front of them. \n                  London-born rabbi Eli Schlanger and 10-year-old girl among 15 killed in Bondi Beach terror attack \n                 \n                  Hero who tackled and disarmed Bondi Beach gunman is Sydney fruit shop owner\n                 \n                  What we know so far about mass shooting at Sydney's Bondi Beach\n                 A photographer, Danny, was covering the Jewish holiday event. Read more: What we know so far He said he \"locked eyes\" with one of the gunmen, who then fired towards him. Danny said he was grazed by a bullet. He kept filming during the shooting, while taking cover. Sam, from France, was working at Bondi. He went to the scene of the attack and saw almost a dozen people lying on the ground covered in blood. Sam described it as like a \"war zone\". Rabbi Lei Wolff, from Central Synagogue in Sydney, went to Bondi as soon as he heard about the mass shooting. A dear friend of his, Rabbi Eli Schlanger, was killed in the attack. Rabbi Wolff has called on people around the world to stand with Australia's Jewish community against terrorism."
    },
    {
        "title": "Hero who tackled and disarmed Bondi Beach gunman is Sydney fruit shop owner",
        "description": "A bystander hailed a hero after he tackled and disarmed one of the gunmen in the Bondi Beach shooting is a shop owner.",
        "url": "https://news.sky.com/story/hero-who-tackled-and-disarmed-bondi-beach-gunman-is-sydney-fruit-shop-owner-13483314",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bondi-beach-attack_7109976.jpg?20251214153232",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-14 14:58:00",
        "Headline": "In a video, the bystander was seen running up to the attacker from behind and then grabbing the shotgun from him before pointing the weapon back at him.",
        "Content": " A bystander hailed a hero after he tackled and disarmed one of the gunmen in the Bondi Beach shooting is a shop owner. The man, named by a relative as 43-year-old Ahmed al Ahmed, was seen in a video running up to the attacker from behind and then grabbing the shotgun from his hands before pointing the weapon back at him. The footage then showed the terrorist heading towards a bridge where another gunman was located, while the bystander placed the gun beside a tree. Live updates on Sydney shooting Mr Ahmed, who was wearing a white T-shirt, was shot twice in the incident and was due to have surgery, his cousin, Mustafa, has revealed. In a video on 7News, Mr Ahmed appeared to have a bloodied arm and hand, and was helped by other people near the scene in the Australian city. At least 16 people were killed, including one of the gunmen, and 40 others were injured in the attack. Two gunmen opened fire from a bridge on crowds at a Jewish event around 6pm local time on Sunday evening. More than 1,000 people had been at the gathering which was celebrating the festival of Hanukkah. A gunman was killed and another was in a critical condition following the shooting. One of the suspects was 24-year-old Naveed Akram. His driver's licence says he lives in Bonnyrigg, a suburb of Sydney. The identity of the other suspected attacker is not known. Mustafa said father-of-two Mr Ahmed, who owns a fruit shop in the Sydney suburb of Sutherland, did not have any experience with guns but was just walking past when he decided to step in. He told 7News: \"He's in hospital and we don't know exactly what's going on inside. \"We do hope he will be fine. He's a hero, 100%.\" Read more:What we know about mass shooting  The footage of the bystander's actions spread quickly on social media as people praised the man for his bravery, saying his actions had potentially saved many lives. \"Australian hero (random civilian) wrestles gun off attacker and disarms him. Some people are brave and then some people are... whatever this is,\" one person said on X, sharing the video. \"This Australian man saved countless lives by stripping the gun off one of the terrorists at Bondi beach. HERO,\" another said. Chris Minns, the premier of New South Wales state, where Sydney is located, said it was the \"most unbelievable scene I've ever seen\". \"A man walking up to a gunman who had fired on the community and single-handedly disarming him, putting his own life at risk to save the lives of countless other people.\" \"That man is a genuine hero, and I've got no doubt that there are many, many people alive tonight as a result of his bravery,\" he added. The country's prime minister Anthony Albanese praised the actions of Australians who had \"run towards danger in order to help others\". \"These Australians are heroes and their bravery has saved lives,\" he told a news conference."
    },
    {
        "title": "Bondi Beach shooting: At least 15 killed in terror attack on Australia's Jewish community",
        "description": "At least 15 people, aged between 10 and 87 years old, have been killed in a terror attack on Bondi Beach. ",
        "url": "https://news.sky.com/story/police-responding-to-developing-incident-at-bondi-beach-after-reports-of-multiple-shots-13483172",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bondi-beach-shooting_7109653.jpg?20251214103140",
        "type": "World",
        "Author": "Michael Drummond",
        "Date Published": "2025-12-14 08:09:00",
        "Headline": "Police said the gunmen were a 50-year-old father, who was a licensed firearms holder, and his 24-year-old son. ",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n  At least 15 people, aged between 10 and 87 years old, have been killed in a terror attack on Bondi Beach.  Two men - a father and son - opened fire as more than a thousand people gathered to mark the first day of Hanukkah at the tourist hotspot on Sunday evening, with video from the scene showing people running for their lives. One of the attackers, a 50-year-old man, was shot dead by police, while 15 innocent victims were also killed. Police said the father was a licensed firearms holder for the past 10 years, and six licensed guns had been recovered from the scene and searches at addresses in the Sydney suburbs of Bonnyrigg and Campsie. Follow live: 15 people and gunman killed in shooting  His son, who has been identified as 24-year-old Naveed Akram, suffered critical injuries and was taken to hospital under police guard. Police said 14 people died at the scene, with another 42, including four children, taken to hospitals across the city. A 10-year-old girl and a 40-year-old man later died in hospital. London-born Rabbi Eli Schlanger, 41, has been named by his family as one of those who were killed, while two police officers - a constable and probationary constable - were among those injured after suffering gunshot wounds. It is the worst mass shooting in Australia for nearly 30 years.  Prime Minister Anthony Albanese said the terror incident at the Hanukkah by the Sea celebration was \"an act of pure evil\" and a \"dark day in our nation's history\". \"What we saw yesterday was an act of pure evil, an act of antisemitism, an act of terrorism on our shores in an iconic Australian location, Bondi Beach, that is associated with joy, associated with families gathering, associated with celebrations. And it is forever tarnished by what has occurred last evening,\" he said. \"The Jewish community are hurting today. Today, all Australians wrap arms around them. And so we stand with you. We will do whatever is necessary to stamp out antisemitism. It is a scourge and we will eradicate it together.\" Australia, a country of 28 million people, is home to about 117,000 Jews. Antisemitic incidents, including assaults, vandalism, threats and intimidation more than tripled in the country during the year after Hamas attack on Israel.  Rabbi Levi Wolff, of Central Synagogue Sydney, said he rushed to the scene when he was told about the shooting. \"We are on the eve of the Jewish holiday of Hanukkah, known as the Festival of Lights, and there was about to be a public menorah lighting,\" he told Sky News. \"And the gunmen were just shooting at those who were there present for the menorah lighting.\" He called on the global Jewish community to light their candles tonight \"for those who were killed\". One Israeli citizen is among the dead, according to Israel's foreign ministry. Read more: What we know so far about Bondi Beach shooting What happened at Bondi Beach? Emergency services were called to Campbell Parade around 6.45pm local time after reports of shots being fired. Two men opened fire in the attack on the Hanukkah by the Sea celebration, where more than a thousand people had gathered to mark the start of the Jewish holiday.  Dramatic footage apparently filmed by a member of the public showed a man, named by a relative as 43-year-old shop owner Ahmed al Ahmed, disarming the older gunman, before pointing the man's weapon at him. A weapons expert said he appears to have been using a semi-automatic shotgun with a red dot sight, while his son appears to be using a Ruger sporting rifle with a red dot sight.Two \"fairly basic\" improvised explosive devices (IEDs) which were found at Bondi Beach were removed and made safe, New South Wales Police commissioner Mal Lanyon told a press conference. Eyewitnesses describe blood and chaos One of the world's most famous beaches, Bondi is typically crowded with locals and tourists, especially on warm weekend evenings. It is currently summer in Australia. \"I saw at least 10 people on the ground and blood everywhere,\" 30-year-old local Harry Wilson, who witnessed the shooting, told the Sydney Morning Herald. Lachlan Moran, 32, from Melbourne, was waiting for his family nearby when he heard shots. He dropped the beer he was carrying for his brother and ran. He said: \"You heard a few pops, and I freaked out and ran away... I started sprinting. I just had that intuition. I sprinted as quickly as I could,\" he said. He said he heard shooting off and on for about five minutes."
    },
    {
        "title": "London-born rabbi Eli Schlanger and 10-year-old girl among 15 killed in Bondi Beach terror attack ",
        "description": "A London-born rabbi and a 10-year-old girl are among 15 innocent people killed in the Bondi Beach terror attack. ",
        "url": "https://news.sky.com/story/london-born-rabbi-eli-schlanger-and-10-year-old-girl-among-16-killed-in-bondi-beach-terror-attack-13483323",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rabbi-eli-eli-schlanger_7110098.png?20251214165953",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-14 15:15:00",
        "Headline": "The father-of-five, 41, was described by his cousin as as \"vivacious, optimistic and full of energy and life\". ",
        "Content": "A London-born rabbi and a 10-year-old girl are among 15 innocent people killed in the Bondi Beach terror attack.  Rabbi Eli Schlanger, 41, died when two gunmen - a father and son - targeted a Hanukkah celebration at a park next to the beach on the first day of the Jewish festival of lights on Sunday evening. One of the attackers, a 50-year-old man, was killed along with 15 innocent people, aged between 10 and 87 years old. The other gunman, who has been named as 24-year-old Naveed Akram, is in a critical condition, police said. A 10-year-old girl died in hospital following the attack, while Israel's foreign ministry has said one of the country's citizens is also among the dead. Follow live: 15 people and gunman killed at event celebrating Hanukkah French President Emmanuel Macron announced a French citizen, Dan Elkayam, was among those killed. \n                  Photographer 'locked eyes' with gunman, as witness describes Bondi 'warzone' \n                 \n                  Hero who tackled and disarmed Bondi Beach gunman is Sydney fruit shop owner\n                 \n                  What we know so far about mass shooting at Sydney's Bondi Beach\n                 Larisa Kleytman told reporters outside St Vincent's Hospital her husband, Alexander Kleytman, was among the dead, according to The Australian newspaper. The couple were both Holocaust survivors.  Mr Schlanger was assistant rabbi at Chabad of Bondi, a Jewish cultural centre. His cousin, Rabbi Dovid Lewis, of the South Manchester Synagogue, told Sky News their great-uncle, the late Reverend Leslie Olsberg, served as a rabbi at the Heaton Park Synagogue in the city, where two people were killed in a terror attack on 2 October. He said his cousin had \"dedicated his life to adding light and to spreading Torah and Judaism\" and in the wake of the Manchester attack sent a post on social media saying: \"We will respond with light.\" \"There's a feeling of numbness, but there's also a feeling he lived,\" he said. \"I'm not going to wallow in pity, I'm going to do something in his memory.\" He said his cousin \"lit a light\", adding: \"I'm now obliged to pick up that light and become a torchbearer.\" He added: \"We have got to say darkness can only be combatted with light. It's what he did, it's what I will do, it's what we ask everyone else to do as well.\" Mr Schlanger was a father of five who, along with his wife Chayala, celebrated the birth of their youngest child, a boy, two months ago, and grew up in Temple Fortune, north London, according to Jewish News. Another one of his cousins, Brighton-based Rabbi Zalman Lewis, described Mr Schlanger to Sky News as an \"incredibly vivacious, energetic, positive guy\" who had \"dedicated his life to helping people\". Read more:What we know so far about Bondi Beach shooting He said his initial reaction was one of \"deep pain and confusion\" but he quickly knew he had to respond with a \"positive message of hope and light and positivity\". \"The world is a good place,\" he said. \"There is some evil. There is some darkness. But, overwhelmingly, there is goodness in the world. And, overwhelmingly, there are good people in the world. And I came home, and I said to myself, I need to create a positive energy for myself, for my family, for my community.\""
    },
    {
        "title": "What we know so far about mass shooting at Sydney's Bondi Beach",
        "description": "At least 16 people have been killed, including a 10-year-old girl, after a mass shooting at Bondi Beach in Sydney.",
        "url": "https://news.sky.com/story/what-we-know-so-far-about-mass-shooting-at-sydneys-bondi-beach-13483200",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bondi-beach-shooting_7109641.jpg?20251214104304",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-14 09:37:00",
        "Headline": "At least 16 people were killed, including one of two gunmen who opened fire at a Hanukkah event at Bondi Beach. The other suspect is in custody and remains in a critical condition.",
        "Content": " At least 16 people have been killed, including a 10-year-old girl, after a mass shooting at Bondi Beach in Sydney. Here is what we know so far about what happened in the Australian coastal city. Latest updates on shooting How many people were killed or injured? Among the 16 fatalities are a 10-year-old girl. Those killed range in age between 10 and 87, according to New South Wales police. Another 40 people remain in hospital, including three children. Five people are critically ill, with the others either in serious or stable condition. These police figures include the two suspects, one of whom was killed at the scene, while the other is in custody in a critical condition. Only one victim has been identified so far. The family of British-born Rabbi Eli Schlanger, an assistant rabbi at Chabad of Bondi, have paid tribute to him. Israel's foreign ministry also said an Israeli citizen had been killed. How did the shooting unfold? More than 1,000 people were at an event celebrating the Jewish festival of Hanukkah at the time of the shooting, police said. Officers were called at about 6.47pm on Sunday (7.47am UK time), as they responded to reports of shots being fired at Archer Park, Bondi Beach. New South Wales Premier Chris Minns said two individuals fired on a \"crowded group of families\" at the park in a \"cowardly act of terrifying violence\". Officers have declared the attack a terrorist incident. One video showed two gunmen appearing to open fire from a small bridge overlooking the beach, while another showed fleeing crowds running on the beach. In a third video, a bystander can be seen wrestling a rifle from one of the gunmen. Ahmed al Ahmed, 43, who was shot twice in the incident, then aims the weapon at the attacker, who seems to run towards his accomplice on a bridge.  Who are the suspected gunmen? One of the suspected gunmen is 24-year-old Naveed Akram, who was critically injured. His driver's licence says he lives in Bonnyrigg, a suburb of Sydney. The identity of the other suspected attacker, who died at the scene, is not known but police say he was 50-years-old. What have witnesses said? Witnesses have described the terror and confusion as masses of people fled the beach. Arsen Ostrovsky was injured and said the shooting was an \"absolute bloodbath\". He said he had also \"survived October 7th\" - the Hamas attack on Israel two years ago.  He told Sky News Australia he had only been in Australia for a fortnight. Mr Ostrovsky said: \"I lived in Israel the last 13 years. We came here only two weeks ago to work in the Jewish community, to fight antisemitism, to fight this bloodthirsty, ravaging hatred. That's why I'm here. You know, we've lived through worse. We're going to get through this.\" He added: \"I saw at least one gunman firing. Looked like a shotgun, firing randomly in all directions. I saw children falling to the floor, elderly, I saw invalids… it was just an absolute bloodbath.\" Elodie Obkircher told Sky News she and her boyfriend were at the nearby North Bondi RSL club when the shooting happened. She said: \"We heard 10 gunshots. So everyone dropped down to the ground. A lot of us were crying and shaking. It was very traumatic. \"It was absolute chaos. \"We could hear the rounds of shots. At first, everyone thought it was fireworks, but I saw people running along the beach. I've never seen so many people running. \"We could see everyone hiding behind their cars. And then as soon as we heard the shots, 10 rounds go, we knew it was a gunman.\"  Another witness told 9News there were \"thousands of people just like running\". \"And I opened up the back gate to my friend's cafe and just let everyone in. Pregnant women, women with kids, just everyone's running. \"It was pandemonium.\" Meanwhile, Rabbi Levi Wolff, of Central Synagogue Sydney, went to the scene when he was informed about the shooting. He told Sky News: \"We are on the eve of the Jewish holiday of Hanukkah, known as the Festival of Lights, and there was about to be a public menorah lighting for the first night of the Jewish holiday. \"And the gunmen were just shooting at those who were there present for the menorah lighting.\"  Rabbi Wolff went on to say that his colleague and friend, Rabbi Eli Schlanger, was killed in the terror attack. He said he was \"full of light, full of unbelievable energy\" and \"gave so much of himself to this very community\". Jewish News, speaking to Mr Schlanger's cousin, reports that he was born in London. What have police said? Police said their operation was \"ongoing\" and a \"number of suspicious items located in the vicinity\" were being examined by specialist officers. An exclusion zone was in place, they added. They later said a police bomb disposal unit was working on a suspected improvised explosive device in one of the suspects' cars. Police also raided the home of a suspect in the suburb of Bonnyrigg. How have world leaders reacted? New South Wales Premier Chris Minns called it a \"horrifying evil attack\" while the country's prime minister Anthony Albanese said it was a \"devastating\" terrorist attack that struck at the heart of the nation. Donald Trump said it was \"terrible\" and \"antisemitic\", but also praised the \"very brave\" man who tackled one of the gunman.  King Charles said he and Queen Camilla were \"appalled and saddened\" while Sir Keir Starmer described the shooting as \"sickening\". Israeli PM Benjamin Netanyahu said it was \"cold-blooded murder\", but also pointed out that he had previously warned Anthony Albanese about growing antisemitism in Australia."
    },
    {
        "title": "Thailand destroys bridge as fighting with Cambodia over disputed region continues",
        "description": "Thailand has announced a curfew as fighting with Cambodia spread to more areas of a disputed border region.",
        "url": "https://news.sky.com/story/thailand-destroys-bridge-as-fighting-with-cambodia-over-disputed-region-continues-13483166",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-cambodia-thailand_7109579.jpg?20251214082116",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-14 13:09:00",
        "Headline": "Fighting has flared up several times this year since a Cambodian soldier was killed in a May skirmish, as decades-old tensions over the border territory persist.",
        "Content": "Thailand has announced a curfew as fighting with Cambodia spread to more areas of a disputed border region. Renewed conflict between the southeast Asian neighbours has stretched into a second week, despite claims of a ceasefire by would-be peacemaker, US President Donald Trump. On Sunday, Thailand's government said a rocket attack from Cambodia killed a 63-year-old villager, its first civilian death reported as a direct result of combat over the past week. Fighting has flared up several times this year since a Cambodian soldier was killed in a May skirmish, as decades-old tensions over the border territory persist. Thailand and Cambodia have exchanged heavy-weapons fire at multiple locations along their 508-mile border since Monday. Thai forces said on Saturday that they had destroyed a bridge that Cambodia used to deliver heavy weapons and other equipment to the region. Meanwhile, Cambodia accused Thailand of striking civilian infrastructure. Thailand's curfew covers five districts of Trat province that neighbour Koh Kong, excluding the tourist islands of Koh Chang and Koh Kood. This is in addition to the curfew the military previously imposed in the eastern Sakeo province, which remains in force. Around two dozen people have been killed in the past week, according to official reports. Read more:Tens of thousands flee fresh fighting The renewed fighting ended a July ceasefire that was brokered by Malaysia and pushed through under pressure from Mr Trump, who threatened to withhold trade privileges unless the two sides agreed. On Friday, Mr Trump said the two countries \"agreed to CEASE all shooting effective this evening, and go back to the original Peace Accord made with me\" on his Truth Social platform. However, fighting has continued this weekend.  Why are Thai and Cambodian troops fighting? The roots of the Thai-Cambodian border conflict lie in a history of enmity over competing territorial claims. These claims largely stem from a 1907 map created while Cambodia was under French colonial rule, which Thailand argues is inaccurate. Tensions were heightened by a 1962 International Court of Justice ruling that awarded sovereignty to Cambodia, which still angers many Thais."
    },
    {
        "title": "Blackrock arm in talks to back Six Nations Rugby investor",
        "description": "A division of Blackrock, the world's biggest asset manager, is in talks to provide hundreds of millions of pounds of funding to a company which owns stakes in Six Nations Rugby and the women's professional tennis tour.",
        "url": "https://news.sky.com/story/blackrock-arm-in-talks-to-back-six-nations-rugby-investor-13483227",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-six-nations-england_7109701.jpg?20251214113417",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-14 11:34:00",
        "Headline": "HPS, which is owned by the world's biggest asset manager, is among the parties in discussions with CVC Capital's Global Sports Group about a major debt financing deal, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A division of Blackrock, the world's biggest asset manager, is in talks to provide hundreds of millions of pounds of funding to a company which owns stakes in Six Nations Rugby and the women's professional tennis tour. Sky News has learnt that HPS, the global private credit giant, is among the parties negotiating with CVC Capital Partners over the financing of its Global Sports Group (GSG) holding company. The talks, which are not exclusive, would see HPS help provide firepower for the CVC-backed vehicle to make further acquisitions to expand its portfolio. Chaired by Marc Allera, the former BT Group consumer boss, GSG holds stakes in Premiership Rugby, the top flights of French and Spanish football and the international volleyball tour. In recent weeks, Mr Allera has outlined his ambitions to acquire further global sports properties. HPS, which was acquired by Blackrock for $12bn late last year, is said to be serious about becoming involved in GSG. Other parties with whom CVC is in discussions include Ares Management, which is interested in providing both debt and equity to GSG, according to insiders. \n                  Next plots swoop on family-owned shoe chain Russell & Bromley\n                 \n                  Why there's a 'genuine risk' we won't have coffee in the future | Money blog\n                 \n                  UK economy shrank by 0.1% in October, official figures show\n                 Any new financing package was expected to be secured on favourable terms for the CVC-controlled group because of the underlying credit quality of the assets in the portfolio. Sky News revealed during the summer that CVC had engaged a trio of banks to explore plans for a refinancing of what was at the time referred to internally as SportsCo and which has since been renamed Global Sport Group. The portfolio also includes an Indian Premier League cricket franchise, several of which are currently exploring sales at valuations of well over $1bn. Goldman Sachs, PJT Partners and Raine Group are advising on the refinancing of GSG, which has been set up to optimise CVC's investments in the sector. The deal is expected to allow CVC to remain invested in its sports portfolio for longer, while also paving the way for the sale of a minority stake in SportsCo or a future initial public offering. Having made billions of dollars from its ownership of Formula One motor racing - one of the most lucrative deals in the history of sport - CVC has bought stakes in leagues and other assets spanning a spectrum of elite sporting assets over the last two decades. Its investment in the media rights to La Liga - Spain's equivalent of the Premier League - is expected to generate a handsome return for the firm, although a comparable deal in France has faced significant challenges amid broadcasters' financial challenges in the country. CVC's backing of global sports properties is intended to position it to maximise their commercial potential through new media and sponsorship rights deals, as well as their expansion into new formats aimed at drawing wider audiences amid rapid shifts in media consumption. In rugby union, its acquisition of a stake in Premiership Rugby's commercial rights was hit by the pandemic and the subsequent financial pressures on clubs which saw a number of the league's teams forced into insolvency. CVC, which bought into Premiership Rugby in 2019, owns a 27% stake in the league. Its sporting assets will continue to remain autonomous and independent of one another, despite the new umbrella holding entity. One expected benefit of the SportsCo approach would be the sourcing of new investment opportunities, with CVC being linked to a bid for one of the new European NBA basketball franchises which is expected to be sold in the coming months. Global sports properties have become one of the hottest growth areas for private capital in recent years, with firms such as Ares, Silver Lake Partners and Bridgepoint all investing substantial sums in teams, leagues and other assets across the industry. CVC and Blackrock declined to comment."
    },
    {
        "title": "Strawberry fields forever? The West Sussex farm growing berries in December",
        "description": "Acres of sweet, red strawberries are ripening in West Sussex this winter ready to be sold in UK supermarkets.",
        "url": "https://news.sky.com/story/a-berry-good-idea-the-west-sussex-farm-growing-strawberries-in-december-13483104",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-strawberries-winter_7109406.jpg?20251213201711",
        "type": "Technology",
        "Author": "Emma Birchley",
        "Date Published": "2025-12-14 00:01:00",
        "Headline": "LED lighting in vast greenhouses is enabling the fruit to be grown all year long on a commercial scale for the first time ever.",
        "Content": "\n          News correspondent\n        Acres of sweet, red strawberries are ripening in West Sussex this winter ready to be sold in UK supermarkets. LED lighting in vast glasshouses is enabling berries to be grown all year on a commercial scale for the first time ever. It means less reliance on fruit flown in from countries like Egypt. \"The LED lighting is the prime reason for successful growing,\" said Bartosz Pinkosz, operations director of The Summer Berry. \"If it was not a sunny day, the LED lighting would create enough energy for leaves to absorb that energy, take it in and deliver the energy to the berries. \"We are able to have the right sweetness in the berries and the right shape, right size.\" There are 36,000 square metres of the greenhouses at the site in Chichester, partially powered by renewable energy and buzzing with bees as pollinators. And the new strand to the business means year-round work for 50 people. But while it might cut the food miles dramatically, there's still an inevitable environmental impact when a colossal space is created warm enough for pickers to wear short sleeves in winter. Dr Tara Garnett, director of food systems platform TABLE, said: \"You're going to need a lot of heat and you're going to need a lot of light in order to reproduce those summer growing conditions so everything hinges on the energy source you're going to be using. \"And when we look at the UK self sufficiency levels in fruit and vegetables they are appalling - 16% of the fruit we consume is UK-grown, so the vast majority is imported, and when it comes to vegetables we're looking more at 50% or so, so there's a lot more we can do to build up, and should be doing.\" Around 1.5 million punnets of strawberries are expected to be picked on the site over the full stretch of winter, allowing British strawberries to be eaten this Christmas. But for some, it's simple - strawberries should be saved for summer, even if it is a much shorter journey from plant to plate."
    }
]