[
    {
        "title": "Trump's claim US airstrikes in Nigeria hit ISIS targets 'sketchy', presidential adviser tells Sky News",
        "description": "A special adviser to the Nigerian president has told Sky News details about who the US hit in Christmas Day strikes in the country were \"sketchy\" - despite Donald Trump's claims.",
        "url": "https://news.sky.com/story/trumps-claims-isis-targeted-in-nigeria-sketchy-presidential-adviser-tells-sky-news-13487637",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nigeria-jabo-airstrike_7119504.jpg?20251226152436",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-26 20:23:00",
        "Headline": "The US, working in cooperation with the Nigerian government, hit parts of the country late on Christmas Day with airstrikes. It claimed to have targeted Islamic State militants, but an adviser to the country's president told Sky News details on who was actually hit were \"sketchy\".",
        "Content": "A special adviser to the Nigerian president has told Sky News details about who the US hit in Christmas Day strikes in the country were \"sketchy\" - despite Donald Trump's claims. The US president, in a Truth Social post announcing the attack, said that \"ISIS terrorist scum\" had been targeted with \"powerful and deadly strikes\". In a series of attacks on 25 December, the US hit areas of northwestern Nigeria, working in cooperation with the country's government. However, Bola Tinubu, adviser to the president in Abuja, told Sky News that he wasn't sure who exactly was targeted in Washington's strikes. Instead, Mr Tinubu said that details were \"sketchy\" and he hoped more information would emerge in the coming hours and days. He also said he hoped his country's cooperation with the US would continue. Mr Tinubu added that it could have been Lakurawa, Boko Haram or the so-called Islamic State - or affiliated groups - that were targeted. Trump's claims of Christian persecution The attacks came about after persistent claims from the White House and Mr Trump in recent months that Christians were being persecuted and attacked in Nigeria. It is true that Christian communities have suffered in the country - where multiple armed groups operate and pose challenges to the government - but data suggests violence against Muslim communities has been reported at a similar rate. When it comes to attacks on religious sites, more have been reported at mosques over the past year than at churches. Before 2025, incidents at churches were more common. It's been suggested to Sky News, including by the Nigerian president's adviser, that Mr Trump's claims of Christian persecution were more for his domestic support base. 'My family is afraid' On the ground in Nigeria, locals were left rattled by the attacks. So far, strikes have been confirmed to have taken place in Jabo, in the Sokoto region, and in Offa, in the Kwara region. In Jabo, Balira Sa'idu said the strikes \"changed everything\". The 17-year-old added: \"I am supposed to be thinking about my wedding, but right now I am panicking. The strike has changed everything. My family is afraid, and I don't even know if it is safe to continue with the wedding plan in Jabo.\" Read more from Sky News:Three women stabbed in Paris metro stationsSky News correspondents look back at 2025This 56-year conflict still pauses for Christmas Sanusi Madabo, a 40-year-old farmer, said he was preparing for bed in the same village when he heard a loud noise that sounded like a plane crashing. He said he and his wife rushed outside to see the sky glowing red. The light from the fire burned bright for hours, Madabo said, adding: \"It was almost like daytime.\" He only learned later that he had witnessed the US attack on an alleged IS camp. After the strikes were announced on Christmas Day, US defence secretary Pete Hegseth said in a social media post: \"More to come...\""
    },
    {
        "title": "Zelenskyy 'doesn't have anything until I've approved it', says Donald Trump - as peace talks loom",
        "description": "Donald Trump said President Zelenskyy \"doesn't have anything until I approve it\", ahead of a meeting with the Ukrainian leader on Sunday.",
        "url": "https://news.sky.com/story/zelenskyy-doesnt-have-anything-until-ive-approved-it-says-donald-trump-as-peace-talks-loom-13487427",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-152nd-jaeger-brigade_7119385.jpg?20251226112128",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-26 13:25:00",
        "Headline": "A revised 20-point plan was made public on Wednesday and follows recent US-Ukraine talks in Miami.",
        "Content": "Donald Trump said President Zelenskyy \"doesn't have anything until I approve it\", ahead of a meeting with the Ukrainian leader on Sunday. The US president told Politico: \"He doesn't have anything until I ‌approve it, so we'll see what he's ‍got.\" The two leaders will discuss details of the 20-point peace plan that is \"about 90% ready\", according to President Zelenskyy. The Ukrainian president told Axios that he is open to putting the plan to his country's people, with a referendum, as long as Russia agrees to a 60-day ceasefire to allow Ukraine to prepare for and hold such a vote. Sunday's meeting is the latest development in an extensive US-led diplomatic push to close the nearly four-year Russia-Ukraine war, but efforts have run into sharply conflicting demands by Moscow and Kyiv. Mr Zelenskyy said Ukraine \"would like the Europeans to be involved\", but doubted it would be possible at short notice. Sir Keir Starmer spoke to the leaders of France and Germany on Friday afternoon and confirmed they would all \"continue coordinating\" to \"achieve a lasting peace\" in Ukraine, according to a Downing Street spokesperson. Researchers in the US have told Reuters that Russia is likely stationing its new nuclear-capable hypersonic ballistic missiles at a former airbase in eastern Belarus. Although President Putin has been open about his intention to place the Oreshnik missiles in Belarus, the exact location had not been previously reported. Researchers Jeffrey Lewis of the Middlebury Institute of International Studies and Decker Eveleth ‍of the CNA research and analysis organisation said their findings were based on imagery from Planet Labs, a commercial satellite firm, that showed features consistent with a Russian strategic missile base. Putin plans to deploy the weapon \"in Belarus to extend its range further into Europe,\" said John Foreman, an expert with the Chatham House who served as a British defence attache in Moscow and Kyiv. The state-run Belta news agency in Belarus quoted defence ​minister Viktor Khrenin on Wednesday as saying that the Oreshnik's deployment would not alter the balance of power in Europe and was \"our response\" ​to the West's \"aggressive actions.\" Read more:Ukraine hits major Russian oil refinery with British missiles, officials sayUkraine and US agree updated 20-point peace plan Earlier on Friday, Russia said it had downed seven British-supplied Storm Shadow missiles over the past week. The Russian defence ministry said its forces were able to destroy the missiles, Russian media reported. Meanwhile, Russian overnight drone strikes damaged Slovakia-, Palau- and Liberia-flagged vessels in ports in the Odesa and Mykolaiv regions, Ukraine's deputy prime minister said on Friday. In recent weeks, Russia has intensified attacks on the southern Odesa region, and Ukrainian officials said Moscow aimed to cut Ukraine off from the Black Sea and sow chaos among civilians. Ukraine's General Staff said its forces hit the Novoshakhtinsk refinery in Russia's Rostov region. Rostov regional governor Yuri Slyusar said a firefighter was wounded when extinguishing the fire. Ukraine's long-range drone strikes on Russian refineries aim to deprive Moscow of the oil export revenue it needs to pursue its full-scale invasion. Russian troops have also taken control of the settlement of Kosivstseve in the Zaporizhzhia region in eastern Ukraine, Reuters reported on Friday. Mr Zelenskyy said on Tuesday he would be willing to withdraw troops from the country's eastern industrial heartland as part of a plan to end the war, if Russia also pulls back and the area becomes a demilitarised zone monitored by international forces. Though Russian Foreign Ministry spokeswoman Maria Zakharova said on Thursday there had been \"slow but steady progress\" in talks to end the war, Moscow has given no indication it will agree to any kind of withdrawal from land it has seized. In fact, Russia has insisted that Ukraine relinquish the remaining territory it still holds in the Donbas - an ultimatum Kyiv has rejected. Russia has captured most of Luhansk and about 70% of Donetsk - the two areas that make up the Donbas."
    },
    {
        "title": "One of the men who went missing in sea off Devon coast named",
        "description": "One of the victims has been named after a search was launched for two people who went missing in stormy seas off a beach in Devon.",
        "url": "https://news.sky.com/story/one-of-the-men-who-went-missing-in-sea-off-devon-coast-named-13487433",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-matthew-upham-devon_7119631.jpg?20251226174353",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-26 12:39:00",
        "Headline": "Coastguard rescue teams and RNLI lifeboat teams were called to Budleigh Salterton at 10.25am on Christmas Day after the alarm was raised.",
        "Content": "One of the victims has been named after a search was launched for two people who went missing in stormy seas off a beach in Devon. The family of Matthew Upham said in a statement on his Instagram page that they are \"heartbroken by the loss of our beloved family member... who was lost on Christmas morning\". \"Matthew is deeply loved and will be forever missed,\" the statement adds. It was posted on the Matthew Upham Antiques Instagram account, an antiques shop in Budleigh Salterton. Coastguard rescue teams and RNLI lifeboat teams were called to Budleigh Salterton at 10.25am on Christmas Day after the alarm was raised. Minutes earlier a woman was rescued from the sea in the same area. In footage she is seen grabbing onto a pole held by a member of the RNLI and being pulled aboard. More videos filmed yesterday morning showed scores of swimmers running into the sea at Budleigh Salterton and battling huge waves crashing on to the shore. \n                  TUC leader: Sir Keir Starmer must tackle cost of living crisis to counter 'real danger' of Reform\n                 \n                  Used pyjamas anyone? UK's worst Christmas presents unwrapped\n                 \n                  Scotland's 'most boring town' Alloa was once the 'beating heart of the Central Belt'\n                 A number of people were rescued from the water and checked by paramedics or taken to hospital by the emergency crews. But two men, aged in their 40s and 60s, have not been found, police said. The search for them was ended on Thursday night. A spokesman for the coastguard said: \"After extensive shoreline and offshore searches, the HM Coastguard part of the search was stood down at 5pm.\" \"We would like to express our sincere and heartfelt thanks to the emergency services who responded, particularly the RNLI and coastguard, for their dedication, professionalism, and tireless efforts during this extremely difficult time,\" said Mr Upham's family. \"We are profoundly grateful for their compassion and support.\" \"As we grieve and support one another, we kindly ask that our family's privacy is respected. We thank everyone for their understanding, kindness, and condolences.\" Devon and Cornwall Police said the families of the men were being kept informed. RNLI Torbay and RNLI Teignmouth, involved in the search, described the conditions at sea as \"punishing\". They urged swimmers to take account of weather conditions and to know the limits of their abilities. Police urged people not to go swimming in the sea on Boxing Day after weather warnings were put into place."
    },
    {
        "title": "Used pyjamas anyone? UK's worst Christmas presents unwrapped",
        "description": "It wouldn't be Christmas without at least one gift so misguided we question whether our loved ones know us at all.  ",
        "url": "https://news.sky.com/story/used-pyjamas-anyone-uks-worst-christmas-presents-unwrapped-13487663",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-pyjamas-gift-present_7119816.jpg?20251227014216",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-26 23:09:00",
        "Headline": "From marmite-scented deodorant to rotten fruit, here are some of the worst gifts the British public has been given.",
        "Content": "It wouldn't be Christmas without at least one gift so misguided we question whether our loved ones know us at all.   Now a survey by Which? has revealed the most disappointing Christmas presents received in the UK, with used pyjamas and rotten fruit among the underwhelming gifts reported. The consumer group surveyed more than 2,000 members of the public in January 2025 about their gifts last Christmas, and also asked them about the worst gifts they had ever received. The latter question led to answers like the used PJs, a rotten coconut and pineapple, marmite-scented deodorant and a Tottenham Hotspur book for a Chelsea fan. One respondent said their daughter had gifted them a helicopter ride, despite them having vertigo and a fear of flying. Generally, Which? found that roughly one in five people had received an unwanted or unsuitable gift for Christmas 2024. Asked what they did with the unwanted gift, 33% said they kept it and would use it and 15% said they would keep it but wouldn't use it. \n                  TUC leader: Sir Keir Starmer must tackle cost of living crisis to counter 'real danger' of Reform\n                 \n                  One of the men who went missing in sea off Devon coast named\n                 \n                  Scotland's 'most boring town' Alloa was once the 'beating heart of the Central Belt'\n                 34% admitted they got rid of the gift - 12% gave it to a friend or family member, 11% gave it to a charity shop and 8% sold it on an online marketplace. Read more:Sky News correspondents look back at 2025Some schools opting for mixed-faith Christmas shows over traditional nativity Which? said nearly half of those who tried to return their gift said they experienced an issue. Lisa Webb, consumer law expert, said: \"It's hard to think of a more disappointing present than used pyjamas or rotten fruit but our research shows that a fifth of us have been left wondering what to do with an unwanted gift. \"It's always worth getting a gift receipt so your loved one has the option to return their gift if needed. \"Sometimes, for online orders, only the buyer can request a refund or exchange. But if the item was marked as a gift when ordered, the retailer's returns policy may enable a recipient to return or exchange it.\""
    },
    {
        "title": "Three women stabbed in Paris metro stations",
        "description": "Three women have been stabbed in Paris, according to the capital's prosecutor's office.",
        "url": "https://news.sky.com/story/three-women-stabbed-in-paris-metro-stations-13487619",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-paris-metro_7119707.jpg?20251226183817",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-26 18:18:00",
        "Headline": "The suspect fled the scene and was then arrested at his home, according to local media.",
        "Content": "Three women have been stabbed in Paris, according to the capital's prosecutor's office. French police detained a man suspected of carrying out the attacks in three different stations of the Paris Metro on Friday evening. The three women were ‌stabbed at Republique, Arts ‌et Metiers and Opera stations at around ​4pm local time. They were given medical attention by firefighters and sustained only minor injuries, two of them to their backs and thighs, according to Le Parisien. \"The young woman was injured in the thigh,\" a witness told the newspaper. She was at the Republique station at the time of the attack. \"There was quite a lot of blood; it was a pretty deep cut.\" The prosecutor's office said their wounds were not life-threatening. \n                  Paris Saint-Germain ordered to pay Kylian Mbappe €60m  French court rules\n                 \n                  Hundreds of books at the Louvre damaged in water leak just weeks after £76m heist\n                 \n                  Louvre closes gallery as structure in a 'dire state' - weeks after jewel heist \n                 Read more from Sky News:Police warn sea swimmers as two still missingHealth alert still in force as cold weather set to continue The suspect, a man in his mid-20s, fled the scene and was then arrested at his home, according to C News. The prosecutor's office said he was previously known to police and he was identified thanks to CCTV. \"Thanks to the immediate action\" of the emergency services, \"the suspected individual has been apprehended\", posted the official Parisian police account on X. \"I extend all my wishes for a prompt recovery to the 3 victims who were slightly injured and taken in charge by the emergency services, whom I also salute.\" The possibility of terrorism has been ruled out, according to local media."
    },
    {
        "title": "Three unaccounted for after Boxing Day house fire",
        "description": "Three people are unaccounted for after a house fire in the early hours of Boxing Day, police have said.",
        "url": "https://news.sky.com/story/three-unaccounted-for-after-boxing-day-house-fire-13487469",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-brimscombe-hil-stroud_7119508.jpg?20251226152601",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-26 15:58:00",
        "Headline": "Efforts continue to locate three people who were inside a house near Stroud that caught fire, as authorities launch an investigation into the cause of the blaze.",
        "Content": "Three people are unaccounted for after a house fire in the early hours of Boxing Day, police have said. Emergency teams were called to a property on Brimscombe Hill, near Stroud, at around 3am, a Gloucestershire Police spokesperson said. One person managed to escape the property and was taken to Gloucestershire Royal Hospital for treatment. \"Three other people, who are believed to have been inside the property, have not yet been accounted for and efforts to locate them are ongoing,\" the spokesperson added. Gloucestershire Police said officers attended the scene alongside crews from Gloucestershire Fire and Rescue Service and the ambulance service. Read more from Sky News:Police warn sea swimmers as two still missingHealth alert still in force as cold weather set to continue An investigation has been launched to determine the cause of the fire. \n                  TUC leader: Sir Keir Starmer must tackle cost of living crisis to counter 'real danger' of Reform\n                 \n                  One of the men who went missing in sea off Devon coast named\n                 \n                  Used pyjamas anyone? UK's worst Christmas presents unwrapped\n                 Roads around Brimscombe Hill remain closed while emergency services continue to work at the scene. Members of the public are advised to avoid the area."
    },
    {
        "title": "British-Egyptian activist Alaa Abd El-Fattah returns to the UK and reunites with family after prison release",
        "description": "British-Egyptian pro-democracy activist Alaa Abd El-Fattah has returned to the UK for the first time since his release after spending six years in prison in Egypt.",
        "url": "https://news.sky.com/story/british-egyptian-activist-alaa-abd-el-fattah-returns-to-the-uk-and-reunites-with-family-after-prison-release-13487651",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-alaa-abd-el-fattah_7119783.jpg?20251226214756",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-26 21:35:00",
        "Headline": "The activist's family said he flew back on Boxing Day after his travel ban was lifted by Egyptian authorities on 20 December. He was released in September after serving six years in prison.",
        "Content": "British-Egyptian pro-democracy activist Alaa Abd El-Fattah has returned to the UK for the first time since his release after spending six years in prison in Egypt. Mr Abd El-Fattah, 44, was released in September after being granted a presidential pardon for his charges of spreading false news, but a travel ban was in place until 20 December. He had become one of Egypt's most prominent political prisoners after spending much of his life in and out of detention due to his activism. His latest sentence came amid a far-reaching crackdown under president Abdel Fattah al Sisi. Mr Abd El-Fattah has dual nationality through his mother, Laila Soueif, with whom he has now been reunited in the UK. In a statement, his family said he would shortly be reunited with his 14-year-old son Khaled, who lives in Brighton with his mother. Prime Minister Sir Keir Starmer welcomed Mr Abd El-Fattah's return, writing on X: \"I'm delighted that Alaa Abd El-Fattah is back in the UK and has been reunited with his loved ones, who must be feeling profound relief. \"I want to pay tribute to Alaa's family, and to all those that have worked and campaigned for this moment. \n                  British-Egyptian activist Alaa Abd El Fattah released from prison after being pardoned\n                 \n                  Laila Soueif: It's a 'miracle' mother of jailed activist is alive on day 245 of hunger strike, family says\n                 \n                  'We are being ignored': Rishi Sunak urged to prioritise case of jailed writer Alaa Abd El-Fattah\n                 \"Alaa's case has been a top priority for my government since we came to office. I'm grateful to President Sisi for his decision to grant the pardon.\" Read more:One of the men who went missing in sea off Devon coast namedUS talk show host targets Trump in alternative Christmas message Mr Abd El-Fattah became a prominent campaigner during protests in Cairo in 2011 that led to the ousting of former president Hosni Mubarak. In 2014, he was sentenced to 15 years in prison - later reduced to five - for protesting without permission. He was released in 2019 but arrested again for sharing a Facebook post about human rights abuses in Egyptian prisons."
    },
    {
        "title": "The Cure's guitarist and keyboard player Perry Bamonte dies",
        "description": "The guitarist and keyboard player for The Cure, Perry Bamonte, has died.",
        "url": "https://news.sky.com/story/the-cures-guitarist-and-keyboard-player-perry-bamonte-dies-13487647",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-perry-bamonte_7119770.jpg?20251226212023",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-26 21:02:00",
        "Headline": "The band said Bamonte, who joined the band in the early 1990s, died aged 65 \"after a short illness at home\", in a statement on their website, which they said was posted with \"enormous sadness\".",
        "Content": "The guitarist and keyboard player for The Cure, Perry Bamonte, has died. The band said Bamonte died aged 65 \"after a short illness at home\", in a statement on their website, which they said was posted with \"enormous sadness\". The statement said: \"Quiet, intensive, intuitive, constant and hugely creative, 'Teddy' was a warm hearted and vital part of The Cure story. \"Looking after the band from 1984 through 1989, he became a full member of The Cure in 1990, playing guitar, six string bass and keyboard on the Wish (1992), Wild Mood Swings (1996), Bloodflowers (2000), Acoustic Hits (2001), and The Cure (2004) albums, as well as performing more than 400 shows over 14 years. \"He re-joined The Cure in 2022, playing another 90 shows, some of the best in the band's history, culminating with The Show Of A Lost World concert in London, (on) November 1, 2024. \"Our thoughts and condolences are with all his family, he will be very greatly missed.\" Born in London in 1960, Bamonte had originally been part of the band's roadcrew from 1984, alongside his younger brother Daryl, who worked ‌as tour manager for The Cure. \n                  TUC leader: Sir Keir Starmer must tackle cost of living crisis to counter 'real danger' of Reform\n                 \n                  One of the men who went missing in sea off Devon coast named\n                 \n                  Used pyjamas anyone? UK's worst Christmas presents unwrapped\n                 He worked as an assistant ‌to co-founder and lead vocalist Robert Smithwas and was then asked to join the band following the departure of keyboardist Roger O'Donnell. Thereafter, he played on some of the band's best-known tracks, including Friday I'm In Love, High and A Letter To Elise. He also featured on The Cure's 1983 live albums Paris and Show. His ex-bandmate, drummer Lol Tolhurst, said in a personal tribute posted on Instagram: \"So sad to hear about Perry Bamonte passing. Cindy (Tolhurst's wife) and I send our condolences to all that knew him. Farewell Teddy.\" Bamonte was also the bass player in supergroup Love Amongst Ruin, alongside former Placebo drummer Steve Hewitt and Julian Cope collaborator Donald Ross Skinner. He was known to have a keen interest in fly fishing and built a career as an illustrator, contributing to the magazine Fly Culture. He also had a number of film acting roles, including in Judge Dredd, About Time and The Crow. Formed in 1976 by lead singer Robert Smith and Tolhurst in Crawley, The Cure have seen regularly changes in line-up. They are widely regarded as among the most influential 1980s bands in the indie/goth scene and were inducted into the Rock and Roll Hall of Fame in 2019."
    },
    {
        "title": "One of the men who went missing in sea off Devon coast named",
        "description": "One of the victims has been named after a search was launched for two people who went missing in stormy seas off a beach in Devon.",
        "url": "https://news.sky.com/story/one-of-the-men-who-went-missing-in-sea-off-devon-coast-named-13487433",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-matthew-upham-devon_7119631.jpg?20251226174353",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-26 12:39:00",
        "Headline": "Coastguard rescue teams and RNLI lifeboat teams were called to Budleigh Salterton at 10.25am on Christmas Day after the alarm was raised.",
        "Content": "One of the victims has been named after a search was launched for two people who went missing in stormy seas off a beach in Devon. The family of Matthew Upham said in a statement on his Instagram page that they are \"heartbroken by the loss of our beloved family member... who was lost on Christmas morning\". \"Matthew is deeply loved and will be forever missed,\" the statement adds. It was posted on the Matthew Upham Antiques Instagram account, an antiques shop in Budleigh Salterton. Coastguard rescue teams and RNLI lifeboat teams were called to Budleigh Salterton at 10.25am on Christmas Day after the alarm was raised. Minutes earlier a woman was rescued from the sea in the same area. In footage she is seen grabbing onto a pole held by a member of the RNLI and being pulled aboard. More videos filmed yesterday morning showed scores of swimmers running into the sea at Budleigh Salterton and battling huge waves crashing on to the shore. \n                  TUC leader: Sir Keir Starmer must tackle cost of living crisis to counter 'real danger' of Reform\n                 \n                  Used pyjamas anyone? UK's worst Christmas presents unwrapped\n                 \n                  Scotland's 'most boring town' Alloa was once the 'beating heart of the Central Belt'\n                 A number of people were rescued from the water and checked by paramedics or taken to hospital by the emergency crews. But two men, aged in their 40s and 60s, have not been found, police said. The search for them was ended on Thursday night. A spokesman for the coastguard said: \"After extensive shoreline and offshore searches, the HM Coastguard part of the search was stood down at 5pm.\" \"We would like to express our sincere and heartfelt thanks to the emergency services who responded, particularly the RNLI and coastguard, for their dedication, professionalism, and tireless efforts during this extremely difficult time,\" said Mr Upham's family. \"We are profoundly grateful for their compassion and support.\" \"As we grieve and support one another, we kindly ask that our family's privacy is respected. We thank everyone for their understanding, kindness, and condolences.\" Devon and Cornwall Police said the families of the men were being kept informed. RNLI Torbay and RNLI Teignmouth, involved in the search, described the conditions at sea as \"punishing\". They urged swimmers to take account of weather conditions and to know the limits of their abilities. Police urged people not to go swimming in the sea on Boxing Day after weather warnings were put into place."
    },
    {
        "title": "Used pyjamas anyone? UK's worst Christmas presents unwrapped",
        "description": "It wouldn't be Christmas without at least one gift so misguided we question whether our loved ones know us at all.  ",
        "url": "https://news.sky.com/story/used-pyjamas-anyone-uks-worst-christmas-presents-unwrapped-13487663",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-pyjamas-gift-present_7119816.jpg?20251227014216",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-26 23:09:00",
        "Headline": "From marmite-scented deodorant to rotten fruit, here are some of the worst gifts the British public has been given.",
        "Content": "It wouldn't be Christmas without at least one gift so misguided we question whether our loved ones know us at all.   Now a survey by Which? has revealed the most disappointing Christmas presents received in the UK, with used pyjamas and rotten fruit among the underwhelming gifts reported. The consumer group surveyed more than 2,000 members of the public in January 2025 about their gifts last Christmas, and also asked them about the worst gifts they had ever received. The latter question led to answers like the used PJs, a rotten coconut and pineapple, marmite-scented deodorant and a Tottenham Hotspur book for a Chelsea fan. One respondent said their daughter had gifted them a helicopter ride, despite them having vertigo and a fear of flying. Generally, Which? found that roughly one in five people had received an unwanted or unsuitable gift for Christmas 2024. Asked what they did with the unwanted gift, 33% said they kept it and would use it and 15% said they would keep it but wouldn't use it. \n                  TUC leader: Sir Keir Starmer must tackle cost of living crisis to counter 'real danger' of Reform\n                 \n                  One of the men who went missing in sea off Devon coast named\n                 \n                  Scotland's 'most boring town' Alloa was once the 'beating heart of the Central Belt'\n                 34% admitted they got rid of the gift - 12% gave it to a friend or family member, 11% gave it to a charity shop and 8% sold it on an online marketplace. Read more:Sky News correspondents look back at 2025Some schools opting for mixed-faith Christmas shows over traditional nativity Which? said nearly half of those who tried to return their gift said they experienced an issue. Lisa Webb, consumer law expert, said: \"It's hard to think of a more disappointing present than used pyjamas or rotten fruit but our research shows that a fifth of us have been left wondering what to do with an unwanted gift. \"It's always worth getting a gift receipt so your loved one has the option to return their gift if needed. \"Sometimes, for online orders, only the buyer can request a refund or exchange. But if the item was marked as a gift when ordered, the retailer's returns policy may enable a recipient to return or exchange it.\""
    },
    {
        "title": "British-Egyptian activist Alaa Abd El-Fattah returns to the UK and reunites with family after prison release",
        "description": "British-Egyptian pro-democracy activist Alaa Abd El-Fattah has returned to the UK for the first time since his release after spending six years in prison in Egypt.",
        "url": "https://news.sky.com/story/british-egyptian-activist-alaa-abd-el-fattah-returns-to-the-uk-and-reunites-with-family-after-prison-release-13487651",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-alaa-abd-el-fattah_7119783.jpg?20251226214756",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-26 21:35:00",
        "Headline": "The activist's family said he flew back on Boxing Day after his travel ban was lifted by Egyptian authorities on 20 December. He was released in September after serving six years in prison.",
        "Content": "British-Egyptian pro-democracy activist Alaa Abd El-Fattah has returned to the UK for the first time since his release after spending six years in prison in Egypt. Mr Abd El-Fattah, 44, was released in September after being granted a presidential pardon for his charges of spreading false news, but a travel ban was in place until 20 December. He had become one of Egypt's most prominent political prisoners after spending much of his life in and out of detention due to his activism. His latest sentence came amid a far-reaching crackdown under president Abdel Fattah al Sisi. Mr Abd El-Fattah has dual nationality through his mother, Laila Soueif, with whom he has now been reunited in the UK. In a statement, his family said he would shortly be reunited with his 14-year-old son Khaled, who lives in Brighton with his mother. Prime Minister Sir Keir Starmer welcomed Mr Abd El-Fattah's return, writing on X: \"I'm delighted that Alaa Abd El-Fattah is back in the UK and has been reunited with his loved ones, who must be feeling profound relief. \"I want to pay tribute to Alaa's family, and to all those that have worked and campaigned for this moment. \n                  British-Egyptian activist Alaa Abd El Fattah released from prison after being pardoned\n                 \n                  Laila Soueif: It's a 'miracle' mother of jailed activist is alive on day 245 of hunger strike, family says\n                 \n                  'We are being ignored': Rishi Sunak urged to prioritise case of jailed writer Alaa Abd El-Fattah\n                 \"Alaa's case has been a top priority for my government since we came to office. I'm grateful to President Sisi for his decision to grant the pardon.\" Read more:One of the men who went missing in sea off Devon coast namedUS talk show host targets Trump in alternative Christmas message Mr Abd El-Fattah became a prominent campaigner during protests in Cairo in 2011 that led to the ousting of former president Hosni Mubarak. In 2014, he was sentenced to 15 years in prison - later reduced to five - for protesting without permission. He was released in 2019 but arrested again for sharing a Facebook post about human rights abuses in Egyptian prisons."
    },
    {
        "title": "Three unaccounted for after Boxing Day house fire",
        "description": "Three people are unaccounted for after a house fire in the early hours of Boxing Day, police have said.",
        "url": "https://news.sky.com/story/three-unaccounted-for-after-boxing-day-house-fire-13487469",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-brimscombe-hil-stroud_7119508.jpg?20251226152601",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-26 15:58:00",
        "Headline": "Efforts continue to locate three people who were inside a house near Stroud that caught fire, as authorities launch an investigation into the cause of the blaze.",
        "Content": "Three people are unaccounted for after a house fire in the early hours of Boxing Day, police have said. Emergency teams were called to a property on Brimscombe Hill, near Stroud, at around 3am, a Gloucestershire Police spokesperson said. One person managed to escape the property and was taken to Gloucestershire Royal Hospital for treatment. \"Three other people, who are believed to have been inside the property, have not yet been accounted for and efforts to locate them are ongoing,\" the spokesperson added. Gloucestershire Police said officers attended the scene alongside crews from Gloucestershire Fire and Rescue Service and the ambulance service. Read more from Sky News:Police warn sea swimmers as two still missingHealth alert still in force as cold weather set to continue An investigation has been launched to determine the cause of the fire. \n                  TUC leader: Sir Keir Starmer must tackle cost of living crisis to counter 'real danger' of Reform\n                 \n                  One of the men who went missing in sea off Devon coast named\n                 \n                  Used pyjamas anyone? UK's worst Christmas presents unwrapped\n                 Roads around Brimscombe Hill remain closed while emergency services continue to work at the scene. Members of the public are advised to avoid the area."
    },
    {
        "title": "Health alert still in force as cold weather set to continue",
        "description": "Cold temperatures are set to continue beyond Boxing Day - with a health alert still in force for parts of the UK.",
        "url": "https://news.sky.com/story/health-alert-still-in-force-as-cold-weather-set-to-continue-13487411",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-beach-cold_7119376.jpg?20251226105927",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-26 11:16:00",
        "Headline": "The UK Health Security Agency has issued a yellow cold health alert, which lasts until noon on 27 December for southwest England.",
        "Content": "Cold temperatures are set to continue beyond Boxing Day - with a health alert still in force for parts of the UK. The UK Health Security Agency (UKHSA) has issued a yellow cold health alert, which lasts until noon on 27 December for southwest England. It comes as beachgoers have been urged not to swim, with two men in their 40s and 60s still missing after getting into difficulty off the coast of Devon on Christmas Day. Low temperatures are likely to have minor impacts on health and social care services, including \"increased use of healthcare services by vulnerable people\" and a \"greater risk to life of vulnerable people\", the UKHSA said. Met Office meteorologist Zoe Hutin said: \"Boxing Day we're going to see some good spells of sunshine, we will see a little in the way of cloud for the South and North West, some light rain, but for the vast majority it's going to be dry. \"While it will still be breezy, it won't be as windy as Christmas Day. \"It's still going to feel chilly, top temperatures between 6-7C, in the south it's going to feel closer to 4-5C. \"A low chance of snow, it's not expected at all.\" The weather will be similar on Saturday and Sunday, Ms Hutin said, adding drizzle may occur where the cloud is thicker, and it will stay fairly breezy. Temperatures will be around average, between 6-7C. Read more from Sky News: Comedian urges public to nominate historic buildings to saveSky News correspondents look back at 2025 Ms Hutin said: \"It's good news for people who have got the week off and want to go on walks.\" On Christmas Day, emergency services were called to Budleigh Salterton at 10.25am following reports of people in the water. Two men remain missing at sea. Detective Superintendent Hayley Costar, of Devon and Cornwall Police, said: \"There have been weather warnings in place this week and a number of official and unofficial swims have already been cancelled. \"While there are no official warnings in place for tomorrow, we urge anyone with plans to go swimming in the sea on Boxing Day not to.\""
    },
    {
        "title": "The Cure's guitarist and keyboard player Perry Bamonte dies",
        "description": "The guitarist and keyboard player for The Cure, Perry Bamonte, has died.",
        "url": "https://news.sky.com/story/the-cures-guitarist-and-keyboard-player-perry-bamonte-dies-13487647",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-perry-bamonte_7119770.jpg?20251226212023",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-26 21:02:00",
        "Headline": "The band said Bamonte, who joined the band in the early 1990s, died aged 65 \"after a short illness at home\", in a statement on their website, which they said was posted with \"enormous sadness\".",
        "Content": "The guitarist and keyboard player for The Cure, Perry Bamonte, has died. The band said Bamonte died aged 65 \"after a short illness at home\", in a statement on their website, which they said was posted with \"enormous sadness\". The statement said: \"Quiet, intensive, intuitive, constant and hugely creative, 'Teddy' was a warm hearted and vital part of The Cure story. \"Looking after the band from 1984 through 1989, he became a full member of The Cure in 1990, playing guitar, six string bass and keyboard on the Wish (1992), Wild Mood Swings (1996), Bloodflowers (2000), Acoustic Hits (2001), and The Cure (2004) albums, as well as performing more than 400 shows over 14 years. \"He re-joined The Cure in 2022, playing another 90 shows, some of the best in the band's history, culminating with The Show Of A Lost World concert in London, (on) November 1, 2024. \"Our thoughts and condolences are with all his family, he will be very greatly missed.\" Born in London in 1960, Bamonte had originally been part of the band's roadcrew from 1984, alongside his younger brother Daryl, who worked ‌as tour manager for The Cure. \n                  TUC leader: Sir Keir Starmer must tackle cost of living crisis to counter 'real danger' of Reform\n                 \n                  One of the men who went missing in sea off Devon coast named\n                 \n                  Used pyjamas anyone? UK's worst Christmas presents unwrapped\n                 He worked as an assistant ‌to co-founder and lead vocalist Robert Smithwas and was then asked to join the band following the departure of keyboardist Roger O'Donnell. Thereafter, he played on some of the band's best-known tracks, including Friday I'm In Love, High and A Letter To Elise. He also featured on The Cure's 1983 live albums Paris and Show. His ex-bandmate, drummer Lol Tolhurst, said in a personal tribute posted on Instagram: \"So sad to hear about Perry Bamonte passing. Cindy (Tolhurst's wife) and I send our condolences to all that knew him. Farewell Teddy.\" Bamonte was also the bass player in supergroup Love Amongst Ruin, alongside former Placebo drummer Steve Hewitt and Julian Cope collaborator Donald Ross Skinner. He was known to have a keen interest in fly fishing and built a career as an illustrator, contributing to the magazine Fly Culture. He also had a number of film acting roles, including in Judge Dredd, About Time and The Crow. Formed in 1976 by lead singer Robert Smith and Tolhurst in Crawley, The Cure have seen regularly changes in line-up. They are widely regarded as among the most influential 1980s bands in the indie/goth scene and were inducted into the Rock and Roll Hall of Fame in 2019."
    },
    {
        "title": "Three women stabbed in Paris metro stations",
        "description": "Three women have been stabbed in Paris, according to the capital's prosecutor's office.",
        "url": "https://news.sky.com/story/three-women-stabbed-in-paris-metro-stations-13487619",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-paris-metro_7119707.jpg?20251226183817",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-26 18:18:00",
        "Headline": "The suspect fled the scene and was then arrested at his home, according to local media.",
        "Content": "Three women have been stabbed in Paris, according to the capital's prosecutor's office. French police detained a man suspected of carrying out the attacks in three different stations of the Paris Metro on Friday evening. The three women were ‌stabbed at Republique, Arts ‌et Metiers and Opera stations at around ​4pm local time. They were given medical attention by firefighters and sustained only minor injuries, two of them to their backs and thighs, according to Le Parisien. \"The young woman was injured in the thigh,\" a witness told the newspaper. She was at the Republique station at the time of the attack. \"There was quite a lot of blood; it was a pretty deep cut.\" The prosecutor's office said their wounds were not life-threatening. \n                  Paris Saint-Germain ordered to pay Kylian Mbappe €60m  French court rules\n                 \n                  Hundreds of books at the Louvre damaged in water leak just weeks after £76m heist\n                 \n                  Louvre closes gallery as structure in a 'dire state' - weeks after jewel heist \n                 Read more from Sky News:Police warn sea swimmers as two still missingHealth alert still in force as cold weather set to continue The suspect, a man in his mid-20s, fled the scene and was then arrested at his home, according to C News. The prosecutor's office said he was previously known to police and he was identified thanks to CCTV. \"Thanks to the immediate action\" of the emergency services, \"the suspected individual has been apprehended\", posted the official Parisian police account on X. \"I extend all my wishes for a prompt recovery to the 3 victims who were slightly injured and taken in charge by the emergency services, whom I also salute.\" The possibility of terrorism has been ruled out, according to local media."
    },
    {
        "title": "Zelenskyy 'doesn't have anything until I've approved it', says Donald Trump - as peace talks loom",
        "description": "Donald Trump said President Zelenskyy \"doesn't have anything until I approve it\", ahead of a meeting with the Ukrainian leader on Sunday.",
        "url": "https://news.sky.com/story/zelenskyy-doesnt-have-anything-until-ive-approved-it-says-donald-trump-as-peace-talks-loom-13487427",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-152nd-jaeger-brigade_7119385.jpg?20251226112128",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-26 13:25:00",
        "Headline": "A revised 20-point plan was made public on Wednesday and follows recent US-Ukraine talks in Miami.",
        "Content": "Donald Trump said President Zelenskyy \"doesn't have anything until I approve it\", ahead of a meeting with the Ukrainian leader on Sunday. The US president told Politico: \"He doesn't have anything until I ‌approve it, so we'll see what he's ‍got.\" The two leaders will discuss details of the 20-point peace plan that is \"about 90% ready\", according to President Zelenskyy. The Ukrainian president told Axios that he is open to putting the plan to his country's people, with a referendum, as long as Russia agrees to a 60-day ceasefire to allow Ukraine to prepare for and hold such a vote. Sunday's meeting is the latest development in an extensive US-led diplomatic push to close the nearly four-year Russia-Ukraine war, but efforts have run into sharply conflicting demands by Moscow and Kyiv. Mr Zelenskyy said Ukraine \"would like the Europeans to be involved\", but doubted it would be possible at short notice. Sir Keir Starmer spoke to the leaders of France and Germany on Friday afternoon and confirmed they would all \"continue coordinating\" to \"achieve a lasting peace\" in Ukraine, according to a Downing Street spokesperson. Researchers in the US have told Reuters that Russia is likely stationing its new nuclear-capable hypersonic ballistic missiles at a former airbase in eastern Belarus. Although President Putin has been open about his intention to place the Oreshnik missiles in Belarus, the exact location had not been previously reported. Researchers Jeffrey Lewis of the Middlebury Institute of International Studies and Decker Eveleth ‍of the CNA research and analysis organisation said their findings were based on imagery from Planet Labs, a commercial satellite firm, that showed features consistent with a Russian strategic missile base. Putin plans to deploy the weapon \"in Belarus to extend its range further into Europe,\" said John Foreman, an expert with the Chatham House who served as a British defence attache in Moscow and Kyiv. The state-run Belta news agency in Belarus quoted defence ​minister Viktor Khrenin on Wednesday as saying that the Oreshnik's deployment would not alter the balance of power in Europe and was \"our response\" ​to the West's \"aggressive actions.\" Read more:Ukraine hits major Russian oil refinery with British missiles, officials sayUkraine and US agree updated 20-point peace plan Earlier on Friday, Russia said it had downed seven British-supplied Storm Shadow missiles over the past week. The Russian defence ministry said its forces were able to destroy the missiles, Russian media reported. Meanwhile, Russian overnight drone strikes damaged Slovakia-, Palau- and Liberia-flagged vessels in ports in the Odesa and Mykolaiv regions, Ukraine's deputy prime minister said on Friday. In recent weeks, Russia has intensified attacks on the southern Odesa region, and Ukrainian officials said Moscow aimed to cut Ukraine off from the Black Sea and sow chaos among civilians. Ukraine's General Staff said its forces hit the Novoshakhtinsk refinery in Russia's Rostov region. Rostov regional governor Yuri Slyusar said a firefighter was wounded when extinguishing the fire. Ukraine's long-range drone strikes on Russian refineries aim to deprive Moscow of the oil export revenue it needs to pursue its full-scale invasion. Russian troops have also taken control of the settlement of Kosivstseve in the Zaporizhzhia region in eastern Ukraine, Reuters reported on Friday. Mr Zelenskyy said on Tuesday he would be willing to withdraw troops from the country's eastern industrial heartland as part of a plan to end the war, if Russia also pulls back and the area becomes a demilitarised zone monitored by international forces. Though Russian Foreign Ministry spokeswoman Maria Zakharova said on Thursday there had been \"slow but steady progress\" in talks to end the war, Moscow has given no indication it will agree to any kind of withdrawal from land it has seized. In fact, Russia has insisted that Ukraine relinquish the remaining territory it still holds in the Donbas - an ultimatum Kyiv has rejected. Russia has captured most of Luhansk and about 70% of Donetsk - the two areas that make up the Donbas."
    },
    {
        "title": "British-Egyptian activist Alaa Abd El-Fattah returns to the UK and reunites with family after prison release",
        "description": "British-Egyptian pro-democracy activist Alaa Abd El-Fattah has returned to the UK for the first time since his release after spending six years in prison in Egypt.",
        "url": "https://news.sky.com/story/british-egyptian-activist-alaa-abd-el-fattah-returns-to-the-uk-and-reunites-with-family-after-prison-release-13487651",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-alaa-abd-el-fattah_7119783.jpg?20251226214756",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-26 21:35:00",
        "Headline": "The activist's family said he flew back on Boxing Day after his travel ban was lifted by Egyptian authorities on 20 December. He was released in September after serving six years in prison.",
        "Content": "British-Egyptian pro-democracy activist Alaa Abd El-Fattah has returned to the UK for the first time since his release after spending six years in prison in Egypt. Mr Abd El-Fattah, 44, was released in September after being granted a presidential pardon for his charges of spreading false news, but a travel ban was in place until 20 December. He had become one of Egypt's most prominent political prisoners after spending much of his life in and out of detention due to his activism. His latest sentence came amid a far-reaching crackdown under president Abdel Fattah al Sisi. Mr Abd El-Fattah has dual nationality through his mother, Laila Soueif, with whom he has now been reunited in the UK. In a statement, his family said he would shortly be reunited with his 14-year-old son Khaled, who lives in Brighton with his mother. Prime Minister Sir Keir Starmer welcomed Mr Abd El-Fattah's return, writing on X: \"I'm delighted that Alaa Abd El-Fattah is back in the UK and has been reunited with his loved ones, who must be feeling profound relief. \"I want to pay tribute to Alaa's family, and to all those that have worked and campaigned for this moment. \n                  British-Egyptian activist Alaa Abd El Fattah released from prison after being pardoned\n                 \n                  Laila Soueif: It's a 'miracle' mother of jailed activist is alive on day 245 of hunger strike, family says\n                 \n                  'We are being ignored': Rishi Sunak urged to prioritise case of jailed writer Alaa Abd El-Fattah\n                 \"Alaa's case has been a top priority for my government since we came to office. I'm grateful to President Sisi for his decision to grant the pardon.\" Read more:One of the men who went missing in sea off Devon coast namedUS talk show host targets Trump in alternative Christmas message Mr Abd El-Fattah became a prominent campaigner during protests in Cairo in 2011 that led to the ousting of former president Hosni Mubarak. In 2014, he was sentenced to 15 years in prison - later reduced to five - for protesting without permission. He was released in 2019 but arrested again for sharing a Facebook post about human rights abuses in Egyptian prisons."
    },
    {
        "title": "Trump's claim US airstrikes in Nigeria hit ISIS targets 'sketchy', presidential adviser tells Sky News",
        "description": "A special adviser to the Nigerian president has told Sky News details about who the US hit in Christmas Day strikes in the country were \"sketchy\" - despite Donald Trump's claims.",
        "url": "https://news.sky.com/story/trumps-claims-isis-targeted-in-nigeria-sketchy-presidential-adviser-tells-sky-news-13487637",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nigeria-jabo-airstrike_7119504.jpg?20251226152436",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-26 20:23:00",
        "Headline": "The US, working in cooperation with the Nigerian government, hit parts of the country late on Christmas Day with airstrikes. It claimed to have targeted Islamic State militants, but an adviser to the country's president told Sky News details on who was actually hit were \"sketchy\".",
        "Content": "A special adviser to the Nigerian president has told Sky News details about who the US hit in Christmas Day strikes in the country were \"sketchy\" - despite Donald Trump's claims. The US president, in a Truth Social post announcing the attack, said that \"ISIS terrorist scum\" had been targeted with \"powerful and deadly strikes\". In a series of attacks on 25 December, the US hit areas of northwestern Nigeria, working in cooperation with the country's government. However, Bola Tinubu, adviser to the president in Abuja, told Sky News that he wasn't sure who exactly was targeted in Washington's strikes. Instead, Mr Tinubu said that details were \"sketchy\" and he hoped more information would emerge in the coming hours and days. He also said he hoped his country's cooperation with the US would continue. Mr Tinubu added that it could have been Lakurawa, Boko Haram or the so-called Islamic State - or affiliated groups - that were targeted. Trump's claims of Christian persecution The attacks came about after persistent claims from the White House and Mr Trump in recent months that Christians were being persecuted and attacked in Nigeria. It is true that Christian communities have suffered in the country - where multiple armed groups operate and pose challenges to the government - but data suggests violence against Muslim communities has been reported at a similar rate. When it comes to attacks on religious sites, more have been reported at mosques over the past year than at churches. Before 2025, incidents at churches were more common. It's been suggested to Sky News, including by the Nigerian president's adviser, that Mr Trump's claims of Christian persecution were more for his domestic support base. 'My family is afraid' On the ground in Nigeria, locals were left rattled by the attacks. So far, strikes have been confirmed to have taken place in Jabo, in the Sokoto region, and in Offa, in the Kwara region. In Jabo, Balira Sa'idu said the strikes \"changed everything\". The 17-year-old added: \"I am supposed to be thinking about my wedding, but right now I am panicking. The strike has changed everything. My family is afraid, and I don't even know if it is safe to continue with the wedding plan in Jabo.\" Read more from Sky News:Three women stabbed in Paris metro stationsSky News correspondents look back at 2025This 56-year conflict still pauses for Christmas Sanusi Madabo, a 40-year-old farmer, said he was preparing for bed in the same village when he heard a loud noise that sounded like a plane crashing. He said he and his wife rushed outside to see the sky glowing red. The light from the fire burned bright for hours, Madabo said, adding: \"It was almost like daytime.\" He only learned later that he had witnessed the US attack on an alleged IS camp. After the strikes were announced on Christmas Day, US defence secretary Pete Hegseth said in a social media post: \"More to come...\""
    },
    {
        "title": "US judge blocks detention of British free speech campaigner amid 'censorship' row",
        "description": "A US judge has temporarily blocked the Donald Trump administration from detaining British anti-disinformation campaigner Imran Ahmed. ",
        "url": "https://news.sky.com/story/us-judge-blocks-detention-of-british-free-speech-campaigner-amid-censorship-row-13487386",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-imran-ahmed-united-states_7119285.jpg?20251226074635",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-26 10:00:00",
        "Headline": "Washington launched visa bans this week on Imran Ahmed, 47, and four Europeans, including French former EU commissioner Thierry Breton.",
        "Content": "A US judge has temporarily blocked the Donald Trump administration from detaining British anti-disinformation campaigner Imran Ahmed.  It comes after the US permanent resident sued officials over an entry ban for the part he played in what the US government argues is online censorship. Washington issued visa bans on Tuesday on Mr Ahmed, 47, and four Europeans, including French former EU commissioner Thierry Breton. It accuses them of working to censor freedom of speech or unfairly hitting US tech giants with regulation. Nigeria latest: US warns 'more to come' after claiming strikes on IS targets Mr Ahmed is CEO of the US-based Center for Countering Digital Hate, which aims to protect human rights and civil liberties online. He is a New York resident and is believed to be the only one of the five targeted by the visa ban currently in the country. The move angered European governments, who argue regulations and the work of monitoring groups made the internet safer by highlighting false information and pushing tech giants to do more to tackle illegal content, including child sexual abuse material and hate speech. For Mr Ahmed, it also sparked fears of imminent deportation that would separate him from his wife and child, both US citizens, according to a lawsuit he filed on Wednesday in the Southern District of New York. When announcing the visa restrictions, Secretary of State Marco Rubio said he had determined the presence of the five people in the US had potentially serious adverse foreign policy consequences for the nation, which meant they could be deported. Read more:Why Trump administration is so annoyed with Europe's online rulesMan reveals what it's like celebrating Christmas in country where it's banned Mr Ahmed named Mr Rubio, Homeland Security Secretary Kristi Noem and other Trump officials in his lawsuit. He argued officials were violating his rights to free speech and due process by threatening deportation. US District Judge Vernon Broderick issued a temporary restraining order on Thursday, instructing officials not to arrest, detain or transfer Mr Ahmed before he has an opportunity for his case to be heard, and scheduled a conference between the parties for 29 December. Mr Ahmed praised the US legal system's checks and balances in a statement provided by a representative and said he was proud to call the country his home. \"I will not be bullied away from my life's work of fighting to keep children safe from social media's harm and stopping antisemitism online,\" he said. In response to questions about the case, a State Department spokesperson said: \"The Supreme Court and Congress have repeatedly made clear: the United States is under no obligation to allow foreign aliens to come to our country or reside here.\" The Department of Homeland Security has been contacted for comment. Legal permanent residents, known as green card holders, do not require a visa to stay in the US, but the Trump administration has tried to deport at least one already this year. Mahmoud Khalil was detained in March after his prominent involvement in pro-Palestinian demonstrations at Columbia University. He was released by a judge who argued punishing someone over a civil immigration matter was unconstitutional. A US immigration judge in September ordered Mr Khalil to be deported over claims he left out information from his green card application, but he appealed that ruling and separate orders blocking his deportation are still in place."
    },
    {
        "title": "'Tyranny is booming': Jimmy Kimmel targets Trump in alternative Christmas message",
        "description": "American talk show host Jimmy Kimmel delivered an alternative Christmas message this year, taking aim what he said was the rise of fascism under Donald Trump's government.",
        "url": "https://news.sky.com/story/tyranny-is-booming-jimmy-kimmel-targets-trump-in-alternative-christmas-message-13487379",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel-late-night_7030017.jpg?20250924071631",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-26 04:35:00",
        "Headline": "Kimmel said it had been a \"great year\" for fascism in the US under Donald Trump, as he warned UK viewers about the threat of censorship.",
        "Content": "American talk show host Jimmy Kimmel delivered an alternative Christmas message this year, taking aim what he said was the rise of fascism under Donald Trump's government. Kimmel has a long-running feud with the US president which has escalated since his show was suspended in September by broadcaster ABC due to criticism he launched at Mr Trump and his \"MAGA gang\" over their handling of Charlie Kirk's death. Mr Trump celebrated the suspension, saying Kimmel was \"not a talented person\", and was \"fired for lack of talent,\" before calling for other left-wing hosts, Jimmy Fallon and Seth Meyers, to face the same fate. The show was reinstated the following week after Disney-owned ABC faced backlash from celebrities, fans and free speech advocates. Speaking in his Christmas message for Channel 4, a spoof of the official royal message on Christmas Day, Kimmel said: \"From a fascism perspective, this has been a really great year. Tyranny is booming over here.\" He reflected on the cancellation and reinstatement of his show, saying: \"We won, the president lost - and now I'm back on the air every night, giving the most powerful politician on Earth a right, and richly deserved, b****cking.\" He referred to the president as \"King Donny the Eighth\" and suggested he was \"calling for executions\". \n                  Jimmy Kimmel's show back on Sinclair and Nexstar thanks to viewer feedback\n                 \n                  Jessica Chastain criticises decision to delay release of The Savant after Charlie Kirk killing\n                 \n                  Trump makes major shift in Ukraine policy\n                 Read more:Trump tells children about 'beautiful' coal in Christmas callsPowerball lottery winner lands $1.8bn Christmas jackpot He added: \"Here in the United States right now, we are both figuratively and literally tearing down the structures of our democracy. From the free press, to science, to medicine, to judicial independence, to the actual White House itself, we are a right mess. \"And we know this is also affecting you, and I just wanted to say sorry,\" he said with a shrug. \"And we want you to know or, at least I want you to know, that we're not all like him. We're not all like that.\" Towards the end of the broadcast, he said: \"We are not bright. We're Americans. No one knows better than you we're always just a little bit late to the game, but do we come through in the end? Maybe. Give us about three years. Please.\" First airing in 1993, the annual broadcast has served as an alternative to the monarch's annual televised address and aims to bring viewers a message about the year's events. Comedian Chris McCausland, Sir Stephen Fry and actor Danny Dyer have delivered the speech in recent years."
    },
    {
        "title": "California battles 'life-threatening' storms over Christmas as floods, high surf and avalanches threaten state",
        "description": "Stormy conditions are expected to persist across California, with authorities warning that the risks of flooding, high surf and avalanches remain.",
        "url": "https://news.sky.com/story/california-battles-life-threatening-storms-over-christmas-as-floods-high-surf-and-avalanches-threaten-state-13487421",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-mud-wrightwood-california_7119329.jpg?20251226090649",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-26 12:21:00",
        "Headline": "A powerful storm system, which has prompted states of emergency in six counties and brought the wettest Christmas season to downtown Los Angeles in 54 years, has been blamed for at least two deaths.",
        "Content": "Stormy conditions are expected to persist across California, with authorities warning that the risks of flooding, high surf and avalanches remain. Waves near the San Francisco Bay Area were expected to reach up to 25 feet (7.6 metres), while flood risks remained in parts of Southern California and avalanche conditions threatened the Lake Tahoe region. The storms were blamed for at least two deaths earlier in the week as they hit the area during the busiest travel weeks of the year. A falling tree killed a San Diego man on Christmas Eve, while farther north, a Sacramento sheriff's deputy died in what appeared to be a weather-related crash. The US National Weather Service had said \"life-threatening atmospheric river conditions\" would continue throughout Christmas Day. Atmospheric rivers are long, narrow regions in the atmosphere - like rivers in the sky - that carry water vapour in the atmosphere from tropical regions. When making landfall, water vapour is released in the form of rain or snow. Atmospheric rivers form worldwide but are particularly impactful along the US West Coast, where they account for roughly 30% to 50% of yearly rainfall. \n                  Nigeria latest: Trump's claims ISIS targeted in Nigeria 'sketchy', presidential adviser tells Sky News\n                 \n                  Watch US airstrikes on ISIS in Nigeria\n                 \n                  'Tyranny is booming': Jimmy Kimmel targets Trump in alternative Christmas message\n                 The National Weather Service said the system brought the wettest Christmas season to downtown Los Angeles in 54 years. 'A crazy Christmas' Residents in the mountain town of Wrightwood, about 80 miles (130 kilometres) northeast of Los Angeles, were told to be ready to evacuate due to the threat of mudslides. On Christmas Day, the streets in the town were covered with rocks, debris, and heavy mud. After the power went out, a gas station and a coffee shop running on generators served as meeting places for residents and visitors. \"It's really a crazy Christmas,\" said Jill Jenkins, who was spending the holiday with her 13-year-old grandson. The family nearly evacuated the day before after water washed away part of their backyard, but they chose to stay and celebrate the holiday. Davey Schneider hiked about a mile and a half (1.6 kilometres) from his home in Wrightwood on Wednesday, wading through rain and shin-deep floodwaters to rescue cats from his grandfather's house. \"I wanted to help them out because I wasn't confident that they were going to live,\" Schneider said. \"Fortunately, they all lived. They're all okay - just a little bit scared.\" Arlene Corte said roads in the town turned into rivers, but her house was not damaged. \"It could be a whole lot worse,\" she said. \"We're here talking.\" Read more from Sky News:Cold weather health alert stays in place for Boxing DayUkraine hits major Russian oil refinery with British missiles San Bernardino County Fire spokesman Shawn Millerick said that with additional rain expected, over 150 firefighters were deployed in the area. \"We're ready,\" he said. \"It's all hands on deck at this point.\" State of emergency Governor Gavin Newsom has declared a state of emergency in six California counties to enable state assistance. Areas along the coast, including Malibu, were under a flood watch until Friday afternoon, and wind and flood advisories were issued for much of the Sacramento Valley and the San Francisco Bay Area. Southern California usually receives 0.5 to 1 inch (1.3 to 2.5 cm) of rain at this time of year, but many areas could see 4 to 8 inches (10 to 20 cm) this week, with even higher amounts in the mountains. Additional wind and heavy snowfall were forecast for the Sierra Nevada, where strong gusts caused \"near white-out conditions\" and made travel through mountain passes dangerous. The California National Guard has been put on standby to assist first responders."
    },
    {
        "title": "US judge blocks detention of British free speech campaigner amid 'censorship' row",
        "description": "A US judge has temporarily blocked the Donald Trump administration from detaining British anti-disinformation campaigner Imran Ahmed. ",
        "url": "https://news.sky.com/story/us-judge-blocks-detention-of-british-free-speech-campaigner-amid-censorship-row-13487386",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-imran-ahmed-united-states_7119285.jpg?20251226074635",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-26 10:00:00",
        "Headline": "Washington launched visa bans this week on Imran Ahmed, 47, and four Europeans, including French former EU commissioner Thierry Breton.",
        "Content": "A US judge has temporarily blocked the Donald Trump administration from detaining British anti-disinformation campaigner Imran Ahmed.  It comes after the US permanent resident sued officials over an entry ban for the part he played in what the US government argues is online censorship. Washington issued visa bans on Tuesday on Mr Ahmed, 47, and four Europeans, including French former EU commissioner Thierry Breton. It accuses them of working to censor freedom of speech or unfairly hitting US tech giants with regulation. Nigeria latest: US warns 'more to come' after claiming strikes on IS targets Mr Ahmed is CEO of the US-based Center for Countering Digital Hate, which aims to protect human rights and civil liberties online. He is a New York resident and is believed to be the only one of the five targeted by the visa ban currently in the country. The move angered European governments, who argue regulations and the work of monitoring groups made the internet safer by highlighting false information and pushing tech giants to do more to tackle illegal content, including child sexual abuse material and hate speech. For Mr Ahmed, it also sparked fears of imminent deportation that would separate him from his wife and child, both US citizens, according to a lawsuit he filed on Wednesday in the Southern District of New York. When announcing the visa restrictions, Secretary of State Marco Rubio said he had determined the presence of the five people in the US had potentially serious adverse foreign policy consequences for the nation, which meant they could be deported. Read more:Why Trump administration is so annoyed with Europe's online rulesMan reveals what it's like celebrating Christmas in country where it's banned Mr Ahmed named Mr Rubio, Homeland Security Secretary Kristi Noem and other Trump officials in his lawsuit. He argued officials were violating his rights to free speech and due process by threatening deportation. US District Judge Vernon Broderick issued a temporary restraining order on Thursday, instructing officials not to arrest, detain or transfer Mr Ahmed before he has an opportunity for his case to be heard, and scheduled a conference between the parties for 29 December. Mr Ahmed praised the US legal system's checks and balances in a statement provided by a representative and said he was proud to call the country his home. \"I will not be bullied away from my life's work of fighting to keep children safe from social media's harm and stopping antisemitism online,\" he said. In response to questions about the case, a State Department spokesperson said: \"The Supreme Court and Congress have repeatedly made clear: the United States is under no obligation to allow foreign aliens to come to our country or reside here.\" The Department of Homeland Security has been contacted for comment. Legal permanent residents, known as green card holders, do not require a visa to stay in the US, but the Trump administration has tried to deport at least one already this year. Mahmoud Khalil was detained in March after his prominent involvement in pro-Palestinian demonstrations at Columbia University. He was released by a judge who argued punishing someone over a civil immigration matter was unconstitutional. A US immigration judge in September ordered Mr Khalil to be deported over claims he left out information from his green card application, but he appealed that ruling and separate orders blocking his deportation are still in place."
    },
    {
        "title": "Trump's claim US airstrikes in Nigeria hit ISIS targets 'sketchy', presidential adviser tells Sky News",
        "description": "A special adviser to the Nigerian president has told Sky News details about who the US hit in Christmas Day strikes in the country were \"sketchy\" - despite Donald Trump's claims.",
        "url": "https://news.sky.com/story/trumps-claims-isis-targeted-in-nigeria-sketchy-presidential-adviser-tells-sky-news-13487637",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nigeria-jabo-airstrike_7119504.jpg?20251226152436",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-26 20:23:00",
        "Headline": "The US, working in cooperation with the Nigerian government, hit parts of the country late on Christmas Day with airstrikes. It claimed to have targeted Islamic State militants, but an adviser to the country's president told Sky News details on who was actually hit were \"sketchy\".",
        "Content": "A special adviser to the Nigerian president has told Sky News details about who the US hit in Christmas Day strikes in the country were \"sketchy\" - despite Donald Trump's claims. The US president, in a Truth Social post announcing the attack, said that \"ISIS terrorist scum\" had been targeted with \"powerful and deadly strikes\". In a series of attacks on 25 December, the US hit areas of northwestern Nigeria, working in cooperation with the country's government. However, Bola Tinubu, adviser to the president in Abuja, told Sky News that he wasn't sure who exactly was targeted in Washington's strikes. Instead, Mr Tinubu said that details were \"sketchy\" and he hoped more information would emerge in the coming hours and days. He also said he hoped his country's cooperation with the US would continue. Mr Tinubu added that it could have been Lakurawa, Boko Haram or the so-called Islamic State - or affiliated groups - that were targeted. Trump's claims of Christian persecution The attacks came about after persistent claims from the White House and Mr Trump in recent months that Christians were being persecuted and attacked in Nigeria. It is true that Christian communities have suffered in the country - where multiple armed groups operate and pose challenges to the government - but data suggests violence against Muslim communities has been reported at a similar rate. When it comes to attacks on religious sites, more have been reported at mosques over the past year than at churches. Before 2025, incidents at churches were more common. It's been suggested to Sky News, including by the Nigerian president's adviser, that Mr Trump's claims of Christian persecution were more for his domestic support base. 'My family is afraid' On the ground in Nigeria, locals were left rattled by the attacks. So far, strikes have been confirmed to have taken place in Jabo, in the Sokoto region, and in Offa, in the Kwara region. In Jabo, Balira Sa'idu said the strikes \"changed everything\". The 17-year-old added: \"I am supposed to be thinking about my wedding, but right now I am panicking. The strike has changed everything. My family is afraid, and I don't even know if it is safe to continue with the wedding plan in Jabo.\" Read more from Sky News:Three women stabbed in Paris metro stationsSky News correspondents look back at 2025This 56-year conflict still pauses for Christmas Sanusi Madabo, a 40-year-old farmer, said he was preparing for bed in the same village when he heard a loud noise that sounded like a plane crashing. He said he and his wife rushed outside to see the sky glowing red. The light from the fire burned bright for hours, Madabo said, adding: \"It was almost like daytime.\" He only learned later that he had witnessed the US attack on an alleged IS camp. After the strikes were announced on Christmas Day, US defence secretary Pete Hegseth said in a social media post: \"More to come...\""
    },
    {
        "title": "Used pyjamas anyone? UK's worst Christmas presents unwrapped",
        "description": "It wouldn't be Christmas without at least one gift so misguided we question whether our loved ones know us at all.  ",
        "url": "https://news.sky.com/story/used-pyjamas-anyone-uks-worst-christmas-presents-unwrapped-13487663",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-pyjamas-gift-present_7119816.jpg?20251227014216",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-26 23:09:00",
        "Headline": "From marmite-scented deodorant to rotten fruit, here are some of the worst gifts the British public has been given.",
        "Content": "It wouldn't be Christmas without at least one gift so misguided we question whether our loved ones know us at all.   Now a survey by Which? has revealed the most disappointing Christmas presents received in the UK, with used pyjamas and rotten fruit among the underwhelming gifts reported. The consumer group surveyed more than 2,000 members of the public in January 2025 about their gifts last Christmas, and also asked them about the worst gifts they had ever received. The latter question led to answers like the used PJs, a rotten coconut and pineapple, marmite-scented deodorant and a Tottenham Hotspur book for a Chelsea fan. One respondent said their daughter had gifted them a helicopter ride, despite them having vertigo and a fear of flying. Generally, Which? found that roughly one in five people had received an unwanted or unsuitable gift for Christmas 2024. Asked what they did with the unwanted gift, 33% said they kept it and would use it and 15% said they would keep it but wouldn't use it. \n                  TUC leader: Sir Keir Starmer must tackle cost of living crisis to counter 'real danger' of Reform\n                 \n                  One of the men who went missing in sea off Devon coast named\n                 \n                  Scotland's 'most boring town' Alloa was once the 'beating heart of the Central Belt'\n                 34% admitted they got rid of the gift - 12% gave it to a friend or family member, 11% gave it to a charity shop and 8% sold it on an online marketplace. Read more:Sky News correspondents look back at 2025Some schools opting for mixed-faith Christmas shows over traditional nativity Which? said nearly half of those who tried to return their gift said they experienced an issue. Lisa Webb, consumer law expert, said: \"It's hard to think of a more disappointing present than used pyjamas or rotten fruit but our research shows that a fifth of us have been left wondering what to do with an unwanted gift. \"It's always worth getting a gift receipt so your loved one has the option to return their gift if needed. \"Sometimes, for online orders, only the buyer can request a refund or exchange. But if the item was marked as a gift when ordered, the retailer's returns policy may enable a recipient to return or exchange it.\""
    },
    {
        "title": "The Cure's guitarist and keyboard player Perry Bamonte dies",
        "description": "The guitarist and keyboard player for The Cure, Perry Bamonte, has died.",
        "url": "https://news.sky.com/story/the-cures-guitarist-and-keyboard-player-perry-bamonte-dies-13487647",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-perry-bamonte_7119770.jpg?20251226212023",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-26 21:02:00",
        "Headline": "The band said Bamonte, who joined the band in the early 1990s, died aged 65 \"after a short illness at home\", in a statement on their website, which they said was posted with \"enormous sadness\".",
        "Content": "The guitarist and keyboard player for The Cure, Perry Bamonte, has died. The band said Bamonte died aged 65 \"after a short illness at home\", in a statement on their website, which they said was posted with \"enormous sadness\". The statement said: \"Quiet, intensive, intuitive, constant and hugely creative, 'Teddy' was a warm hearted and vital part of The Cure story. \"Looking after the band from 1984 through 1989, he became a full member of The Cure in 1990, playing guitar, six string bass and keyboard on the Wish (1992), Wild Mood Swings (1996), Bloodflowers (2000), Acoustic Hits (2001), and The Cure (2004) albums, as well as performing more than 400 shows over 14 years. \"He re-joined The Cure in 2022, playing another 90 shows, some of the best in the band's history, culminating with The Show Of A Lost World concert in London, (on) November 1, 2024. \"Our thoughts and condolences are with all his family, he will be very greatly missed.\" Born in London in 1960, Bamonte had originally been part of the band's roadcrew from 1984, alongside his younger brother Daryl, who worked ‌as tour manager for The Cure. \n                  TUC leader: Sir Keir Starmer must tackle cost of living crisis to counter 'real danger' of Reform\n                 \n                  One of the men who went missing in sea off Devon coast named\n                 \n                  Used pyjamas anyone? UK's worst Christmas presents unwrapped\n                 He worked as an assistant ‌to co-founder and lead vocalist Robert Smithwas and was then asked to join the band following the departure of keyboardist Roger O'Donnell. Thereafter, he played on some of the band's best-known tracks, including Friday I'm In Love, High and A Letter To Elise. He also featured on The Cure's 1983 live albums Paris and Show. His ex-bandmate, drummer Lol Tolhurst, said in a personal tribute posted on Instagram: \"So sad to hear about Perry Bamonte passing. Cindy (Tolhurst's wife) and I send our condolences to all that knew him. Farewell Teddy.\" Bamonte was also the bass player in supergroup Love Amongst Ruin, alongside former Placebo drummer Steve Hewitt and Julian Cope collaborator Donald Ross Skinner. He was known to have a keen interest in fly fishing and built a career as an illustrator, contributing to the magazine Fly Culture. He also had a number of film acting roles, including in Judge Dredd, About Time and The Crow. Formed in 1976 by lead singer Robert Smith and Tolhurst in Crawley, The Cure have seen regularly changes in line-up. They are widely regarded as among the most influential 1980s bands in the indie/goth scene and were inducted into the Rock and Roll Hall of Fame in 2019."
    },
    {
        "title": "'Tyranny is booming': Jimmy Kimmel targets Trump in alternative Christmas message",
        "description": "American talk show host Jimmy Kimmel delivered an alternative Christmas message this year, taking aim what he said was the rise of fascism under Donald Trump's government.",
        "url": "https://news.sky.com/story/tyranny-is-booming-jimmy-kimmel-targets-trump-in-alternative-christmas-message-13487379",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel-late-night_7030017.jpg?20250924071631",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-26 04:35:00",
        "Headline": "Kimmel said it had been a \"great year\" for fascism in the US under Donald Trump, as he warned UK viewers about the threat of censorship.",
        "Content": "American talk show host Jimmy Kimmel delivered an alternative Christmas message this year, taking aim what he said was the rise of fascism under Donald Trump's government. Kimmel has a long-running feud with the US president which has escalated since his show was suspended in September by broadcaster ABC due to criticism he launched at Mr Trump and his \"MAGA gang\" over their handling of Charlie Kirk's death. Mr Trump celebrated the suspension, saying Kimmel was \"not a talented person\", and was \"fired for lack of talent,\" before calling for other left-wing hosts, Jimmy Fallon and Seth Meyers, to face the same fate. The show was reinstated the following week after Disney-owned ABC faced backlash from celebrities, fans and free speech advocates. Speaking in his Christmas message for Channel 4, a spoof of the official royal message on Christmas Day, Kimmel said: \"From a fascism perspective, this has been a really great year. Tyranny is booming over here.\" He reflected on the cancellation and reinstatement of his show, saying: \"We won, the president lost - and now I'm back on the air every night, giving the most powerful politician on Earth a right, and richly deserved, b****cking.\" He referred to the president as \"King Donny the Eighth\" and suggested he was \"calling for executions\". \n                  Jimmy Kimmel's show back on Sinclair and Nexstar thanks to viewer feedback\n                 \n                  Jessica Chastain criticises decision to delay release of The Savant after Charlie Kirk killing\n                 \n                  Trump makes major shift in Ukraine policy\n                 Read more:Trump tells children about 'beautiful' coal in Christmas callsPowerball lottery winner lands $1.8bn Christmas jackpot He added: \"Here in the United States right now, we are both figuratively and literally tearing down the structures of our democracy. From the free press, to science, to medicine, to judicial independence, to the actual White House itself, we are a right mess. \"And we know this is also affecting you, and I just wanted to say sorry,\" he said with a shrug. \"And we want you to know or, at least I want you to know, that we're not all like him. We're not all like that.\" Towards the end of the broadcast, he said: \"We are not bright. We're Americans. No one knows better than you we're always just a little bit late to the game, but do we come through in the end? Maybe. Give us about three years. Please.\" First airing in 1993, the annual broadcast has served as an alternative to the monarch's annual televised address and aims to bring viewers a message about the year's events. Comedian Chris McCausland, Sir Stephen Fry and actor Danny Dyer have delivered the speech in recent years."
    }
]