[
    {
        "title": "Volodymyr Zelenskyy says 'Ukraine most interested in peace' as he confirms US talks next week",
        "description": "Volodymyr Zelenskyy has said Ukraine is \"most interested in peace\" and confirmed officials will hold talks with US partners in Saudi Arabia next week about ending the war with Russia.",
        "url": "https://news.sky.com/story/zelenskyy-says-ukraine-most-interested-in-peace-as-he-confirms-us-talks-as-starmer-to-hold-talks-with-european-leaders-13323094",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-zelenskyy-ukraine-europe_6848538.jpg?20250306231501",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-06 22:58:00",
        "Headline": "Efforts to achieve peace in Ukraine appeared to take a major blow last week following Volodymyr Zelenskyy's disastrous visit to the White House.",
        "Content": "Volodymyr Zelenskyy has said Ukraine is \"most interested in peace\" and confirmed officials will hold talks with US partners in Saudi Arabia next week about ending the war with Russia. It comes as Sir Keir Starmer is due to hold talks with European leaders on Friday about Ukraine. The prime minister and French President Emmanuel Macron are seeking countries willing to supply troops for a peacekeeping force to defend a potential deal. The suggested agreement has already been rejected by Russia. In his nightly address on Thursday, the Ukrainian president said his country was \"most interested in peace\". He also appeared to signal relations between the US and Ukraine were getting back on track after his disastrous White House visit - saying talks will take place in Saudi Arabia, but suggested he would not be part of those discussions. The Ukrainian president said: \"I am scheduled to visit Saudi Arabia to meet with the crown prince. \"After that, my team will stay in Saudi Arabia to work with American partners. Ukraine is most interested in peace.\" \n                  Russia wants 'quick peace' in Ukraine and London is 'head of those resisting it', ambassador to UK tells Sky News\n                 \n                  What you need to know from a monumental week in Ukraine\n                 \n                  Day 46: Why is Trump blindfolding Ukraine? \n                 He added: \"As we told President Trump, Ukraine is working and will work exclusively constructively for a quick and reliable peace.\" It comes around a week after the public row between the two men in the Oval Office. It has been followed this week by America freezing military aid to Ukraine. Meanwhile, in an exchange with reporters on Thursday, the US president said his administration had made \"a lot of progress\" in recent days with both Ukraine and Russia, but did not specify further. \"I think what's going to happen is Ukraine wants to make a deal, because I don't think they have a choice,\" Mr Trump said. \"I also think that Russia wants to make a deal because in a certain different way - a different way that only I know, only I know - they have no choice either.\" More on this story:Zelenskyy's olive branch offering to TrumpUS 'destroying' world order trying to meet Russia 'halfway' Earlier on Thursday, Steve Witkoff, a senior US official, praised a letter sent from Mr Zelenskyy to Mr Trump as a \"positive first step\" following their unsuccessful meeting. \"We are now in discussions to coordinate a meeting with the Ukrainians in Riyadh or even potentially Jeddah,\" he said. \"The city is moving around a little bit, but it will be Saudi Arabia.\" Mr Witkoff said Washington was trying to agree on a framework for a possible peace agreement in Ukraine. It has also been pushing for the signing of a critical minerals deal with Ukraine - but it is unclear if that will be part of the talks next week. Read more: The 'coalition of the willing' that could secure peace in Ukraine US-UK defence secretaries meet Defence Secretary John Healey said Mr Trump has \"asked Europe to step up, and we are\" as he started talks in Washington with his US counterpart Pete Hegseth on Thursday. Mr Hegseth said it was \"very encouraging\" to see France and the UK say they are prepared to take a leading role. Sir Keir has been seeking to support Ukraine and show Mr Trump the UK is committed to stepping up its defence efforts - while mooting plans for a peacekeeping force. Russian foreign minister Sergei Lavrov said the move would amount to the \"direct, official and unveiled involvement of NATO members in the war against Russia\". While Andrei Kelin, Russian ambassador to the UK, said in an interview with Sky News' The World With Yalda Hakim, that Russia wanted \"quick peace\" in Ukraine and the UK was at the \"head of those resisting\" it.  European leaders meanwhile backed new defence spending plans aimed at freeing billions for the continent's security. The 27 leaders signed off on a move to loosen budget restrictions so that willing EU countries can increase their spending. On Thursday evening, Russia launched a mass drone attack on the Black Sea port of Odesa, damaging energy infrastructure and starting fires, according to a local governor."
    },
    {
        "title": "Pope Francis' voice heard for first time since entering hospital in new audio message",
        "description": "Pope Francis' voice has been heard for the first time since being admitted to hospital last month in a newly released audio message.",
        "url": "https://news.sky.com/story/pope-francis-voice-heard-for-first-time-since-entering-hospital-in-new-audio-message-13322965",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pope-francis-vatican_6840246.jpg?20250303143700",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-06 19:44:00",
        "Headline": "The recording was played at the start of the evening Rosary prayer in St Peter's Square, where worshippers broke into applause.",
        "Content": " Pope Francis' voice has been heard for the first time since being admitted to hospital last month in a newly released audio message. In the recording, shared with worshippers at the start of the evening Rosary prayer in St Peter's Square, he said: \"I thank you from the bottom of my heart for your prayers for my health from the Square, I am with you from here. \"May God bless you and the Virgin protect you. Thank you.\" The cardinal presiding over the prayer told the crowd he had \"beautiful news, a beautiful gift\" to share. The clearly surprised worshippers broke into applause as the message was played. The Pope recorded the audio message in his native Spanish from Rome's Gemelli Hospital, where he has been receiving treatment for double pneumonia since being admitted last month. While the 88-year-old has shared written messages via the Vatican since entering hospital on 14 February, this is the first time his voice has been heard. The audio recording comes after the Vatican said the Pope's condition has today been stable \"compared to previous days\". He has not had a fever and his blood tests remain stable, it said. International correspondent It is now the 21st night that the Pope has spent in Rome's Gemelli Hospital. He clearly remains very sick, but the release of the voice recording, in which he thanks people for praying for him, is a positive sign at a very worrying time. The message is short and is in his native language of Spanish. He sounds very weak and tired in the recording - ordinarily he is known for his strength and vigour. It is also interesting that the Vatican has decided not to release a picture of him. During Pope Francis' last stay in hospital, they did distribute a photograph. But the fact that he has felt well enough to release a message at all will fill Catholics around the world with hope that he recovers. The Pope is 88 years old and has a history of lung-related conditions. The team of doctors treating him remain \"guarded\" about his prognosis, describing his condition as \"complex\".\n\n The Vatican has been giving updates on the pontiff's health at least once a day since he was admitted to hospital - but in a sign of his progress, these are being paused. \"Considering the stability of the clinical picture, the next medical bulletin will be released on Saturday,\" it said this evening.  More from Sky News:Denmark postal service to stop delivering lettersGirl who died in sports pitch crash named The Pope - who has chronic lung disease and had part of one lung removed as a young man - has been sleeping with a non-invasive mechanical ventilator to help his recovery and ensure his lungs expand properly overnight. He has been transitioning to receiving high-flow oxygen via nasal tubes during the day. The Pope's daily routine now includes physical and respiratory therapy alongside treatment for double pneumonia, the Vatican said. This has become the longest public absence of the Pope's 12-year papacy."
    },
    {
        "title": "Post Office scandal victim died days before compensation letter arrived - as widow says offer an 'utter disgrace'",
        "description": "The widow of a Post Office scandal victim, who received a compensation offer days after his death, has described the situation as an \"utter disgrace\".",
        "url": "https://news.sky.com/story/post-office-scandal-victim-died-days-before-compensation-letter-arrived-as-widow-says-offer-an-utter-disgrace-13322799",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-janet-terry-walters_6848131.jpg?20250306151115",
        "type": "Home",
        "Author": "Adele Robinson",
        "Date Published": "2025-03-06 14:49:00",
        "Headline": "Terry Walters - whose funeral is taking place today - was one of 555 sub-postmasters who won a legal battle against the Post Office in 2019. A year-long delay in the compensation process meant he died before he received the money. ",
        "Content": "\n          Business correspondent\n              @SkyNewsAdele\n  The widow of a Post Office scandal victim, who received a compensation offer days after his death, has described the situation as an \"utter disgrace\". Janet Walters, 68, lost her husband Terry in February - a week before a letter arrived offering \"less than half\" of his original claim for financial redress. Terry Walters - whose funeral is taking place today - was one of 555 sub-postmasters who won a legal battle against the Post Office in 2019. Hundreds were falsely accused, and many wrongly convicted, of stealing from their branches between 1999 and 2015. Janet has described the length of time many victims have had to wait for offers of compensation as another \"scandal\". \"I've told them I will not accept [the offer],\" Janet tells Sky News. \"I think it's an utter disgrace. \"Not when I look at him and I think, no, what you've been through - I won't just take anything and go away. \n                  Post Office chair warns postmasters on pay uplift amid Whitehall funding talks\n                 \n                  Victims of second Post Office scandal criticise 'grinding wheels of bureaucracy' as they try to get compensation\n                 \n                  Post Office scandal: 21 ‘Capture’ cases now being investigated for miscarriages of justice\n                 \"It's a scandal what they did with the Horizon system, it's a scandal now because of the length of time it's taken [on redress].\" Terry, who died aged 74, was part of the GLO (Group Litigation Order) Scheme established after the 2019 High Court win. Its aim is to restore sub-postmasters to the financial position they would have been in had they not become victims of faulty Horizon software which caused false accounting shortfalls. Terry had his Post Office contract terminated in 2008. He and Janet lost their business and then their family home. They moved in to rented accommodation where they lived for the past 15 years. Janet said Terry's claim was put forward in February 2024 and it has taken a year to receive an offer for redress from the government. \"It should have been a 40-day turnaround of an offer,\" she says. \"And it's taken 12 months to receive an offer, an offer which came after Terry had passed away. \"They wanted a stroke report back in September to drag it out a bit more, to see if it's being caused by all the stress from the Post Office.\" \"I think it contributed considerably to the whole state of him,\" she added. Postmasters should be given 'the benefit of the doubt', says campaigner Lord Beamish, a prominent campaigner for justice for Post Office victims, says the redress offer process should \"err on the side of the postmaster rather than the Post Office\". \"I think it has been bureaucratic in the past, and I think it's been trying to get information which is difficult to actually obtain,\" he says. \"I think in those cases the benefit of the doubt should be put on the postmaster.\" Lord Beamish is also critical of the 40-working-day turnaround for offers. \"I think individual cases should be dealt with on an individual basis,\" he says. \"That 40 days shouldn't be sacrosanct. If you think it can be turned around within two days or a day, do it.\" He also says \"getting people around a table and trying to get a resolution should be the main aim… If it's questioning about more information - that shouldn't be a reason for undue delay.\" More from Sky News:Victims of new scandal face compensation struggleSub-postmasters still going through hell, says Alan Bates More than 3,500 sub-postmasters still waiting for compensation Lord Beamish also highlights concerns over the fact more than 60 victims are yet to submit any claims for redress because they are \"very damaged by this process\". The Department for Business and Trade (DBT) said: \"We are sorry to hear of Terry's death and our thoughts are with Janet and the rest of his family and friends.\" They added they have now issued 407 offers to the 425 GLO claimants \"who have submitted full claims\" and are \"making offers to 89% of GLO claimants within 40 working days of receipt of a full claim, with over half of eligible claimants having now settled their claim.\" The DBT also said it has \"doubled\" the amount of payments under the Labour government to \"provide postmasters with full and fair redress\". The latest government data shows that out of the 425 GLO claimants, 265 have had their claims paid, with 160 waiting. According to the figures for the HSS (Horizon Shortfall Scheme), 2,090 out of 2,417 eligible claims made before their original deadline in 2020 have been paid - leaving over 300 still waiting. Out of the 4,665 \"late\" claims, 1,260 have been paid, with more than 3,400 now waiting."
    },
    {
        "title": "King Charles reveals his favourite artists as he shares personal playlist",
        "description": "The King has shared his personal playlist of tracks that bring him joy &#8211; featuring everything from reggae and Afrobeats to contemporary pop hits.",
        "url": "https://news.sky.com/story/king-charles-reveals-his-favourite-artists-as-he-shares-personal-playlist-13322845",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-king-charles_6848212.jpg?20250306163224",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-06 16:26:00",
        "Headline": "A recent Brit Award winner, a Nigerian-American singer-songwriter and an Australian chart-topper all feature on the King's personal playlist.",
        "Content": "The King has shared his personal playlist of tracks that bring him joy – featuring everything from reggae and Afrobeats to contemporary pop hits. Bob Marley, Kylie Minogue, and Grace Jones all feature on the King's top tracks from across the Commonwealth, alongside the likes of Nigerian-American singer-songwriter Davido and recent Brit Award winner Raye. King Charles recorded his Apple Music radio show, named The King's Music Room, in his office at Buckingham Palace. The show is named after one of the state rooms at the royal residence, in which a baby Prince Charles was christened in 1948. The broadcast will feature the monarch sharing anecdotes about meeting some of the artists, and reveals his chosen songs formed the soundtrack to his life. The King also discusses the impact music has had on him, including how it helps spark happy memories and provide comfort in sad times. Announcing the one-off show - which Apple Music says also reveals Charles is a fan of \"1930s crooners\" - the King said: \"Throughout my life, music has meant a great deal to me. I know that is also the case for so many others. \"It has that remarkable ability to bring happy memories flooding back from the deepest recesses of our memory, to comfort us in times of sadness, and to take us to distant places. \"But perhaps, above all, it can lift our spirits to such a degree, and all the more so when it brings us together in celebration. In other words, it brings us joy.\" The King's Music Room will be broadcast on Apple Music 1 to mark Commonwealth Day on Monday, 10 March. In a new picture released to celebrate the collaboration, the King can be seen at his desk in the palace during the recording with an illuminated \"On Air\" sign next to him. More from Sky News:King pulls pints on brewery visitCharles and Camilla host celebs at Highgrove In 2021, Charles revealed songs by The Three Degrees, Diana Ross and Edith Piaf were among his favourites. The King is not the only royal to have opened up on his musical taste. The late Queen's favourite hits are said to have included Oklahoma from the Rodgers and Hammerstein musical of the same name, Anything You Can Do from Annie Get Your Gun and ukulele-playing George Formby's Leaning On A Lamp-Post, as revealed by her friends and family. While the Prince of Wales joined Prince George and Princess Charlotte at a Taylor Swift concert last year, and has said he listens to a \"bit of everything\"."
    },
    {
        "title": "Trump pauses tariffs on most goods from Mexico and some from Canada",
        "description": "Donald Trump has announced that most goods imported from Mexico and some from Canada are to be exempt from his trade tariff regime for at least four weeks, just days after the charges were imposed.",
        "url": "https://news.sky.com/story/trump-agrees-further-tariff-concessions-but-april-threat-remains-13322861",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-white-house_6848453.jpg?20250306212512",
        "type": "Home",
        "Author": "James Sillars",
        "Date Published": "2025-03-06 16:54:00",
        "Headline": "The climbdown marks the second delay the president has made to his trade war with Mexico and Canada but the clock is ticking again on even higher charges from 2 April.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has announced that most goods imported from Mexico and some from Canada are to be exempt from his trade tariff regime for at least four weeks, just days after the charges were imposed. \"We are working hard, together, on the border, both in terms of stopping illegal aliens from entering the United States and, likewise, stopping fentanyl,\" the president posted on his Truth Social platform after first relaxing his sanctions against Mexico. He often gives both issues as reasons for the tariffs. The latest climbdown came after he surprised financial markets 24 hours earlier by waiving tariffs against carmakers following pleas from motor industry bosses. Money latest: Why are there no bananas in Tesco? The White House said that 62% of Canadian imports would still be subject to 25% tariffs because they were not compliant with a trade deal - USMCA (US Mexico and Canada) - struck in 2020. News that Canadian goods which met the USMCA criteria were being spared tariffs until 2 April followed hours after the same concession was agreed between Mr Trump and his Mexican counterpart. A tariff of 10% was to remain on potash - a fertiliser used by farmers - and Mr Trump added that the auto tariffs would definitely return next month. The White House revealed some details. Parts due to flow into the US from Mexico and Canada as part of the manufacturing supply chain would not qualify for tariffs so long as they complied with the USMCA deal. 'Rules of origin' guidelines under the agreement allow goods to move between the three countries tariff-free if they qualify with a designation that they were made in North America. US commerce secretary Howard Lutnick told Sky's US partner network CNBC that, taken together, more than half of usual cross border trade volumes would be exempt under the expanded concessions.  He too signalled there were signs of progress in the dispute with America's closest trading partners, saying each had worked hard to make progress in tackling imports of Fentanyl - blamed for high crime and deaths in US communities. But Mr Lutnick explained that, as things stand, the reprieve would only last until 2 April when the Trump administration plans to impose reciprocal tariffs - on top of the 25% charges that came into force on Tuesday. At the same time, Mr Trump is under intense pressure to relax his tariff regime permanently amid a backlash from US firms and financial market investors who fear it is self defeating. Read more from Sky News:Millions in compensation expected over Bank IT failuresPoundland up for sale as budget tax hikes loom A closely-watched forecast has even suggested that the threats of a trade war were enough to push the US economy into recession before Mr Trump took office. The dollar has sunk in value and US government borrowing costs have risen on the back of the turmoil. US stock markets were also feeling the pressure again with the tech-heavy Nasdaq on course to fall by more than 3% on the day. It is widely expected that the European Union will be next to face tariffs - possibly from 2 April - after Mr Trump threatened action \"very soon\" just last week. Commenting on the threat to the eurozone from such a move, the president of the European Central Bank Christine Lagarde said on Thursday: \"Just the threat of those tariff increases and potential retaliations are putting a brake on - on investment, on consumption decisions, on employment, hiring, all the rest of it.\" While Mr Trump has not issued a specific threat against the UK, her counterpart at the Bank of England Andrew Bailey told a committee of MPs on Wednesday that the US should work \"multi-laterally\" rather than bilaterally to resolve its disputes."
    },
    {
        "title": "Rachel Reeves says welfare system 'letting people down' ahead of expected cuts",
        "description": "Rachel Reeves has said the welfare system is \"letting down taxpayers\", while she again committed to reaching 2.5% in defence spending by 2027 due to the \"enormity of the situation\" facing European security.",
        "url": "https://news.sky.com/story/rachel-reeves-says-welfare-system-letting-people-down-ahead-of-expected-cuts-13322820",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rachel-reeves-electoral-dysfunction_6847952.jpg?20250306120803",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-06 15:25:00",
        "Headline": "The chancellor is expected to make billions of pounds in spending cuts in her spring statement in order to keep to her self-imposed fiscal rules.",
        "Content": " Rachel Reeves has said the welfare system is \"letting down taxpayers\", while she again committed to reaching 2.5% in defence spending by 2027 due to the \"enormity of the situation\" facing European security. The chancellor told Sky's political editor Beth Rigby on the Electoral Dysfunction podcast, out on Friday, that there needs to be \"better value for money\" for what people pay in taxes. Politics Live: PM issues warning over Putin and peace deal It comes ahead of the spring statement on 26 March, in which Ms Reeves is expected to make billions of pounds of cuts including to the benefits bill. The chancellor said there needs to be welfare reform because the system is \"letting down taxpayers because it's costing too much\". \"It's letting down our economy because there's too many people trapped on out-of-work benefits, and it's letting down the people who are recipients of benefits because they are trapped on benefits rather than actively supported back into work,\" she said. Pressed that she has to find savings to meet her self-imposed fiscal rules, Ms Reeves said she was \"not going to provide a running commentary\" on what could be in the spring statement but insisted the reforms were necessary regardless of what could be in the upcoming forecast from the Office for Budget Responsibility (OBR). \n                  Politics latest: Nigel Farage hits back at one of his own Reform MPs\n                 \n                  Robert Jenrick says new sentencing guidelines have 'blatant bias against Christians and straight white men'\n                 \n                  A UK-conducted fatal drone strike confirmed for first time since Starmer became PM\n                 She said there are a million young people not in education, employment or training and \"the majority of those people should be working\". \"Under the plans that we're going to bring in, they will be working and crucially, they will be given support to get back to work,\" she added. 👉 Click here to follow Electoral Dysfunction wherever you get your podcasts 👈 The spring statement will be in response to the latest updates from the OBR, which is required to do a forecast twice a year on the economy and public finances. The chancellor previously committed to just one single major fiscal event each year to give stability and certainty on upcoming tax changes, unlike previous governments that typically delivered budgets in the spring and autumn. However, the poor economic climate since her October 2024 budget is forcing her hand, with inflation hitting a 10-month high of 3% in January, a sharp rise in government bond yields, and growth has not been as high as expected. This has eaten into the £10bn fiscal headroom Ms Reeves was previously estimated to have - a figure the Treasury wants to maintain. Ms Reeves insisted her spring statement would not be another package of tax rises, saying the October budget \"was a sort of a once in a generation, once in a parliament type budget\". Read More:Poundland up for sale as budget tax hike loomsJobcentre reforms at heart of Labour's plan to 'get Britain working'  She added that Labour committed in its manifesto not to increase income tax, VAT or national insurance and \"we're not going to renege on that\". 'World has changed' Elsewhere in the podcast, Ms Reeves defended the government's decision to cut foreign aid to fund an increase in defence spending. Labour's manifesto committed to restoring development spending at the level of 0.7% of gross national income \"as soon as fiscal circumstances allow\". However around £6bn per year will now be taken out of the aid budget and transferred over to pay for defence. That amounts to a reduction in aid spending from 0.5% of GDP to 0.3%. Ms Reeves said the decision had to be made to fund another manifesto pledge - which was to raise defence spending to 2.5% of GPD, up from the 2.3% it is at now. \"The decision was made not just to get to 2.5%, but to get to 2.5% in 2027,\" she said. \"I think that was the most significant bit, really of the announcement. \"Everyone knew we were going to get to 2.5% in this parliament. That was a commitment from us in our manifesto that we would get there, but we're actually going to get there in two years because we recognise that the world has changed the enormity of the situation.\" Listen to the full interview with Rachel Reeves on the Electoral Dysfunction podcast, out Friday at 5am."
    },
    {
        "title": "Russia wants 'quick peace' in Ukraine and London is 'head of those resisting it', ambassador to UK tells Sky News",
        "description": "Russia wants \"quick peace\" in Ukraine and London is at the \"head of those resisting\" it, the Russian ambassador to the UK has told Sky News.",
        "url": "https://news.sky.com/story/russia-wants-quick-peace-in-ukraine-and-london-is-head-of-those-resisting-it-ambassador-to-uk-tells-sky-news-13322750",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-russian-ambassador_6847998.jpg?20250306144239",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-06 13:24:00",
        "Headline": "In an interview on The World With Yalda Hakim, Andrei Kelin says Moscow told Washington it believes its territorial advances in Ukraine \"should be recognised\" as part of any peace deal.",
        "Content": " Russia wants \"quick peace\" in Ukraine and London is at the \"head of those resisting\" it, the Russian ambassador to the UK has told Sky News. In an interview on The World With Yalda Hakim, Andrei Kelin accused the UK, France and other European nations of not wanting to end the war in Ukraine. \"We are prepared to negotiate and to talk,\" he said. \"We have our position. If we can strike a negotiated settlement... we need a very serious approach to that and a very serious agreement about all of that - and about security in Europe.\" US President Donald Trump held a surprise phone call with his Russian counterpart Vladimir Putin last month, shocking America's European allies. He went on to call Ukrainian President Volodymyr Zelenskyy a \"dictator\" and relations between the pair were left in tatters after a meeting in the Oval Office descended into a shouting match. Days later, the US leader suspended military aid to Ukraine, though there were signs the relationship between the two leaders appeared to be on the mend following the contentious White House meeting last week, with Mr Trump saying he \"appreciated\" a letter from Mr Zelenskyy saying Kyiv was ready to sign a minerals agreement with Washington \"at any time\". In his interview with Sky News' Yalda Hakim, Mr Kelin said he was \"not surprised\" the US has changed its position on Russia's full-scale invasion of Ukraine, which began in 2022, claiming Mr Trump \"knows the history of the conflict\". \"He knows history and is very different from European leaders,\" he added. Lead world news presenter I've interviewed the Russian ambassador to the UK, Andrei Kelin, on a number of occasions, at times the conversation has been tense and heated. But today, I found a diplomat full of confidence and cautiously optimistic. The optics of course have suddenly changed in Russia’s favour since Donald Trump was elected. I asked him if Russia couldn't believe its luck. \"I would not exaggerate this too much,\" he quipped. Mr Kelin also \"categorically\" ruled out European troops on the ground and said the flurry of diplomatic activity and summits over the course of the past few weeks is not because Europeans want to talk to Moscow but because they want to present something to Mr Trump. He appeared to relish the split the world is witnessing in transatlantic relations. Of course the ambassador remained cagey about the conversations that have taken place between President Trump and Vladimir Putin. There is no doubt however that Russia is welcoming what Mr Kelin says is a shift in the world order. Peace deal 'should recognise Russian advances' The Russian ambassador said Moscow had told Washington it believed its territorial advances in Ukraine \"should be recognised\" as part of any peace deal. \"What we will need is a new Ukraine as a neutral, non-nuclear state,\" he said. \"The territorial situation should be recognised. These territories have been included in our constitution and we will continue to push that all forces of the Ukrainian government will leave these territories.\" Asked if he thought the Americans would agree to give occupied Ukrainian land to Russia, he said: \"I don't think we have discussed it seriously. [From] what I have read, the Americans actually understand the reality.\" Read more:What you need to know from a monumental week in UkraineUS 'destroying' world order by trying to meet Russia 'halfway'  Moscow rules out NATO peacekeepers in Ukraine He said Russia \"categorically ruled out\" the prospect of NATO peacekeepers on the ground in Ukraine - a proposal made by UK Prime Minister Sir Keir Starmer and French President Emmanuel Macron - saying \"they have no rules of engagement\" and so would just be \"sitting in cities\". \"It's senseless\" and \"not for reality,\" Mr Kelin added. He branded the temporary ceasefire raised by Mr Zelenskyy \"a crazy idea\", and said: \"We will never accept it and they perfectly are aware of that. \"We will only accept the final version, when we are going to sign it. Until then things are very shaky.\" He added: \"We're trying to find a resolution on the battlefield, until the US administration suggest something constructive.\""
    },
    {
        "title": "Athena lander does not appear to be standing upright on moon",
        "description": "A privately built spacecraft sent to the moon does not appear to be upright on the surface, says the US company that operates it.",
        "url": "https://news.sky.com/story/athena-lander-does-not-appear-to-be-standing-upright-on-moon-13322998",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-space-moon-nasa-athena_6848400.jpg?20250306202846",
        "type": "Home",
        "Author": "Thomas Moore",
        "Date Published": "2025-03-06 20:20:00",
        "Headline": "The spacecraft, of Intuitive Machines, has landed on the moon with the aim of finding water.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  A privately built spacecraft sent to the moon does not appear to be upright on the surface, says the US company that operates it. The Intuitive Machines lander, called Athena, seems to have survived the perilous descent in a game-changing mission to find water. It slowed from more than 4,000mph to touch down on the Mons Mouton, a ridge just 100 miles from the lunar south pole. But Intuitive Machines chief executive Steve Altemus said at a news conference: \"We don't believe we're in the correct attitude on the surface of the moon, yet again.\" Last year, an Intuitive Machines spacecraft toppled over on landing after tripping over on a rock. Although it responded to commands sent by mission control, it failed to send back images immediately after landing, as expected. Shares in the company tumbled while engineers tried to establish full communication. \n                  Second-ever privately funded space craft touches down on moon\n                 \n                  Katy Perry set to travel to space as part of all-female mission\n                 \n                  Odin probe blasts off on SpaceX rocket to survey asteroid for possible mining mission\n                 The south pole region is the destination for NASA astronauts due to land on the surface in just two years' time. But Athena's descent on to a rugged terrain, sometimes out of communication with listening stations on Earth, underlines the risks they will face. If Athena is able to power up its systems and operate normally, it should release the first privately built robotic rover on to the lunar surface. As it trundles across the terrain, it will build a 3D map and test the first high-speed mobile communications network on the moon. The search for water But the mission's main purpose is to find water. Athena has a drill to take samples a metre below the surface. And it will release a small 'hopper' that will bounce into a deep crater that is permanently in shadow, where there could be ice. Professor Katherine Joy, a planetary geologist at the University of Manchester who is advising the NASA Artemis mission, said orbiting spacecraft have spotted signs of water in the craters. But that needs to be confirmed on the ground. Read more from Sky News:Denmark postal service to stop delivering lettersPope Francis heard again in new messageTriple killer convicted of raping ex-girlfriend She told Sky News: \"These craters are incredibly cold, down to about -230C (-382F). Ice could be maintained there for thousands, millions and maybe even billions of years. \"So there may be quite a lot of ice present. \"It would mean that we could mine these deposits to convert into water to drink, to make oxygen to breathe, and even create rocket fuel.\""
    },
    {
        "title": "Post Office scandal victim died days before compensation letter arrived - as widow says offer an 'utter disgrace'",
        "description": "The widow of a Post Office scandal victim, who received a compensation offer days after his death, has described the situation as an \"utter disgrace\".",
        "url": "https://news.sky.com/story/post-office-scandal-victim-died-days-before-compensation-letter-arrived-as-widow-says-offer-an-utter-disgrace-13322799",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-janet-terry-walters_6848131.jpg?20250306151115",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2025-03-06 14:49:00",
        "Headline": "Terry Walters - whose funeral is taking place today - was one of 555 sub-postmasters who won a legal battle against the Post Office in 2019. A year-long delay in the compensation process meant he died before he received the money. ",
        "Content": "\n          Business correspondent\n              @SkyNewsAdele\n  The widow of a Post Office scandal victim, who received a compensation offer days after his death, has described the situation as an \"utter disgrace\". Janet Walters, 68, lost her husband Terry in February - a week before a letter arrived offering \"less than half\" of his original claim for financial redress. Terry Walters - whose funeral is taking place today - was one of 555 sub-postmasters who won a legal battle against the Post Office in 2019. Hundreds were falsely accused, and many wrongly convicted, of stealing from their branches between 1999 and 2015. Janet has described the length of time many victims have had to wait for offers of compensation as another \"scandal\". \"I've told them I will not accept [the offer],\" Janet tells Sky News. \"I think it's an utter disgrace. \"Not when I look at him and I think, no, what you've been through - I won't just take anything and go away. \n                  Post Office chair warns postmasters on pay uplift amid Whitehall funding talks\n                 \n                  Victims of second Post Office scandal criticise 'grinding wheels of bureaucracy' as they try to get compensation\n                 \n                  Post Office scandal: 21 ‘Capture’ cases now being investigated for miscarriages of justice\n                 \"It's a scandal what they did with the Horizon system, it's a scandal now because of the length of time it's taken [on redress].\" Terry, who died aged 74, was part of the GLO (Group Litigation Order) Scheme established after the 2019 High Court win. Its aim is to restore sub-postmasters to the financial position they would have been in had they not become victims of faulty Horizon software which caused false accounting shortfalls. Terry had his Post Office contract terminated in 2008. He and Janet lost their business and then their family home. They moved in to rented accommodation where they lived for the past 15 years. Janet said Terry's claim was put forward in February 2024 and it has taken a year to receive an offer for redress from the government. \"It should have been a 40-day turnaround of an offer,\" she says. \"And it's taken 12 months to receive an offer, an offer which came after Terry had passed away. \"They wanted a stroke report back in September to drag it out a bit more, to see if it's being caused by all the stress from the Post Office.\" \"I think it contributed considerably to the whole state of him,\" she added. Postmasters should be given 'the benefit of the doubt', says campaigner Lord Beamish, a prominent campaigner for justice for Post Office victims, says the redress offer process should \"err on the side of the postmaster rather than the Post Office\". \"I think it has been bureaucratic in the past, and I think it's been trying to get information which is difficult to actually obtain,\" he says. \"I think in those cases the benefit of the doubt should be put on the postmaster.\" Lord Beamish is also critical of the 40-working-day turnaround for offers. \"I think individual cases should be dealt with on an individual basis,\" he says. \"That 40 days shouldn't be sacrosanct. If you think it can be turned around within two days or a day, do it.\" He also says \"getting people around a table and trying to get a resolution should be the main aim… If it's questioning about more information - that shouldn't be a reason for undue delay.\" More from Sky News:Victims of new scandal face compensation struggleSub-postmasters still going through hell, says Alan Bates More than 3,500 sub-postmasters still waiting for compensation Lord Beamish also highlights concerns over the fact more than 60 victims are yet to submit any claims for redress because they are \"very damaged by this process\". The Department for Business and Trade (DBT) said: \"We are sorry to hear of Terry's death and our thoughts are with Janet and the rest of his family and friends.\" They added they have now issued 407 offers to the 425 GLO claimants \"who have submitted full claims\" and are \"making offers to 89% of GLO claimants within 40 working days of receipt of a full claim, with over half of eligible claimants having now settled their claim.\" The DBT also said it has \"doubled\" the amount of payments under the Labour government to \"provide postmasters with full and fair redress\". The latest government data shows that out of the 425 GLO claimants, 265 have had their claims paid, with 160 waiting. According to the figures for the HSS (Horizon Shortfall Scheme), 2,090 out of 2,417 eligible claims made before their original deadline in 2020 have been paid - leaving over 300 still waiting. Out of the 4,665 \"late\" claims, 1,260 have been paid, with more than 3,400 now waiting."
    },
    {
        "title": "Triple killer convicted of raping ex-girlfriend 'in act of spite' before murdering her",
        "description": "A former soldier has been found guilty of raping his ex-girlfriend during a four-hour attack in which he killed her, her mother and her sister.",
        "url": "https://news.sky.com/story/triple-killer-convicted-of-raping-ex-girlfriend-in-act-of-spite-before-murdering-her-13322683",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-kyle-clifford-trial_6848050.jpg?20250306154510",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-03-06 11:39:00",
        "Headline": "Kyle Clifford tricked his way into Louise Hunt's family home after being \"enraged by her rejection of him\", carried out \"a brutal knife attack\" on her mother Carol, then raped and murdered his ex-girlfriend, before killing her sister Hannah with a crossbow.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  A former soldier has been found guilty of raping his ex-girlfriend during a four-hour attack in which he killed her, her mother and her sister. Warning: This article contains distressing details. Kyle Clifford, 26, previously admitted murdering BBC racing commentator John Hunt's wife Carol Hunt, 61, and their daughters Louise, 25, and Hannah, 28. He also pleaded guilty to false imprisonment of Louise, who was tied and gagged with duct tape, and possession of the crossbow used to kill her and her sister, and the 10-inch butcher's knife he stabbed their mother to death with. Prosecutors said he raped Louise in an \"act of spite\" during the attack in the Hunt family home in Bushey, Hertfordshire, on 9 July last year after she broke up with him 13 days earlier. Clifford, who refused to attend the four-day trial at Cambridge Crown Court, claimed DNA evidence found on her body was from a consensual sexual encounter 16 days before the attack. But he was found guilty by a jury after the court heard his explanation was \"completely untenable\". There was applause from the public gallery and cries of \"yes!\", with one woman pumping her fists and another woman crying as the guilty verdict was heard. The court was told Clifford began planning the murders after Louise, who told a friend he had a \"nasty temper\", ended their 18-month relationship in a message on 26 June. Judge pays tribute to family of the victims Mr Justice Joel Bennathan said he will sentence Clifford on Tuesday for his \"dreadful\" and \"almost unspeakable\" crimes. The judge paid tribute to the family of the deceased, adding: \"They conducted themselves with huge dignity and restraint and I pay tribute to them.\" Detective Chief Inspector Nick Gardner said Clifford's failure to attend his trial was an \"absolute act of cowardice\". He pointed out that the trial had been held in Cambridge to meet Clifford's accessibility needs - he required a wheelchair after he shot himself with the crossbow. \"He has put the family through the ordeal of the trial, he has created everything that's happened over this past week and failing to show his face is completely cowardly,\" he added. Clifford 'planned a terrible attack' Louise's friends and family, who had described Clifford as \"odd\", and \"disrespectful, rude and arrogant\", backed her decision to end the relationship, sparked by his behaviour at a friend's wedding. Prosecutor Alison Morgan KC said Clifford, who had hidden relationships with two other women from Louise, was \"angered\" that she rebuffed his attempts to get back together. \"The defendant planned a terrible attack on Louise Hunt and her family, enraged by her rejection of him,\" she told jurors during the trial. \"That attack included an act of sexual violence, committed out of spite, when she was restrained and unable to escape him.\" Read moreCCTV released shows timeline of crossbow and knife killerKyle Clifford pleads guilty to murders of racing commentator's wife and daughtersViolent misogyny of kind promoted by Andrew Tate 'fuelled rape and triple murder' She said the murders were \"carefully planned and executed\", with Clifford tricking his way inside the family home on the pretext of returning Louise's belongings and delivering a \"thank you\" card to her parents after checking Mr Hunt was not home. He carried out \"a brutal knife attack\" on Carol, then waited for his ex-girlfriend to return home from working at her dog grooming business in a pod in the garden, the court heard. It was added that customers of Louise's business were using the gate at the side of the house, \"not realising what was happening\" when Carol was attacked and killed. Louise was held for hours before Clifford shot her with the crossbow moments before her sister Hannah, a beautician, came home from work.  Hannah is heard on audio at the Hunt family home saying: \"Kyle, I swear to God,\" after finding him inside the house, the court heard. The prosecution said Hannah messaged her partner, Alex Klein, telling him to \"call police... immediately. To mine. Now. Kyle here. Police now. He's tying us up\". Clifford's own sister messaged him on the day of the attacks when she realised he had taken the crossbow, asking: \"What are you playing at?\" A loud whooshing sound was caught on a doorbell camera as the weapon was fired, while Hannah could be heard to shout, \"Oh my god\", as she found her mother and sister. She was also shot but managed to call police, and emergency services found her collapsed in the doorway, but she died soon after. Clifford, who served in the army from 2019 to 2022, shot himself in the chest with a crossbow as armed police found him in a cemetery the next day after a manhunt and is now paralysed from the chest downwards. Violent misogyny promoted by the likes of Andrew Tate fuelled Clifford's attack, prosecutors argued in court. He also had been searching YouTube for the controversial influencer's podcast the day before he carried out the four-hour attack, it was said in legal argument ahead of his trial. It can only now be reported because the judge excluded the evidence from the trial, saying that it was of \"limited relevance\" and too prejudicial."
    },
    {
        "title": "Kendal: Girl who died in sports pitch crash named - as family pay tribute",
        "description": "A girl who died after she was hit by a car on a sports pitch has been named as 10-year-old Poppy Atkinson.",
        "url": "https://news.sky.com/story/kendal-10-year-old-girl-died-in-sports-pitch-crash-as-police-say-no-indication-it-was-deliberate-13322480",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-poppy-atkinson-kendal_6848140.jpg?20250306151347",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-06 06:26:00",
        "Headline": "The driver of a black BMW i40 has been arrested on suspicion of causing death by dangerous driving and remains in police custody.",
        "Content": "A girl who died after she was hit by a car on a sports pitch has been named as 10-year-old Poppy Atkinson. Paying tribute, the child's family said: \"Poppy was the focal point of our lives, everything for us revolved around Poppy's love for football. \"Poppy touched so many lives, it was easy to see why, her energy, character, spirit and passion for football was infectious and touched huge numbers of people. \"Poppy was 100% determined to be a professional footballer. Many who know her, and who know her determination to improve and win, had no doubt she would achieve her goal to one day to play for Manchester United.\" Her family said she idolised United and England players Ella Toone and Kobbie Mainoo as well as Lioness Georgia Stanway and former Barcelona superstar Lionel Messi \"to name a few\". They said she was \"a small, petite and beautiful 10-year-old, yet she played up an age group and proudly represented the Kendal United and county U12 teams\". Officers were called to the incident at Kendal Rugby Club in Cumbria shortly before 5pm on Wednesday. A second child, an eight-year-old girl also from Kendal, was taken to hospital, with injuries said to be not life-threatening. The driver of a black BMW i40, a 40-year-old man from Lancaster, has been arrested on suspicion of causing death by dangerous driving and remains in police custody. 'She was so special' In their statement, Poppy's family added: \"Poppy was sister to seven-year-old Edward. Edward worshipped the ground Poppy walked on, he only ever wanted to be like her. Poppy would coach and support Edward with his football, it was so beautiful to see. \"The hole in our lives and so many around us that Poppy leaves is enormous, we will never be whole again. This world has lost a spirit like no other, she was a force of nature. She was so special, she was too good for this world.\" 'Incident not deliberate act' In an earlier statement, Cumbria Police said: \"At this time, there is no indication to suggest that this incident was a deliberate act. \"Investigative inquiries are continuing to establish the full circumstances of this incident and to inform a future coronial process. \"A multi-agency response will continue today to support people affected by this incident.\" 'Incredibly sad time' Players and coaches from Kendal United Football Club saw the \"horrific event\". In a statement, the club said: \"We know that some Kendal United players and coaches witnessed this horrific event and as a club we would ask anyone affected to contact the committee who will offer support and help, where needed, at this incredibly sad time.\" Kendal Rugby Club said: \"We are co-operating fully with the authorities as they conduct their investigation - the club and all facilities are temporarily closed while this is carried out.\" Man Utd pays tribute Manchester United also paid tribute to the young girl. In a statement, the Premier League club said: \"On behalf of Ella, Kobbie and everyone at Manchester United, we send our heartfelt condolences to Poppy's family and friends for their devastating loss. \"Rest in peace Poppy.\" MP Tim Farron, whose constituency includes Kendal, said the community was \"stunned and in mourning\". \"This is devastating, utterly heartbreaking news,\" he said on X. \"I'm praying for the children and for their families and friends.\""
    },
    {
        "title": "King Charles reveals his favourite artists as he shares personal playlist",
        "description": "The King has shared his personal playlist of tracks that bring him joy &#8211; featuring everything from reggae and Afrobeats to contemporary pop hits.",
        "url": "https://news.sky.com/story/king-charles-reveals-his-favourite-artists-as-he-shares-personal-playlist-13322845",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-king-charles_6848212.jpg?20250306163224",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-06 16:26:00",
        "Headline": "A recent Brit Award winner, a Nigerian-American singer-songwriter and an Australian chart-topper all feature on the King's personal playlist.",
        "Content": "The King has shared his personal playlist of tracks that bring him joy – featuring everything from reggae and Afrobeats to contemporary pop hits. Bob Marley, Kylie Minogue, and Grace Jones all feature on the King's top tracks from across the Commonwealth, alongside the likes of Nigerian-American singer-songwriter Davido and recent Brit Award winner Raye. King Charles recorded his Apple Music radio show, named The King's Music Room, in his office at Buckingham Palace. The show is named after one of the state rooms at the royal residence, in which a baby Prince Charles was christened in 1948. The broadcast will feature the monarch sharing anecdotes about meeting some of the artists, and reveals his chosen songs formed the soundtrack to his life. The King also discusses the impact music has had on him, including how it helps spark happy memories and provide comfort in sad times. Announcing the one-off show - which Apple Music says also reveals Charles is a fan of \"1930s crooners\" - the King said: \"Throughout my life, music has meant a great deal to me. I know that is also the case for so many others. \"It has that remarkable ability to bring happy memories flooding back from the deepest recesses of our memory, to comfort us in times of sadness, and to take us to distant places. \"But perhaps, above all, it can lift our spirits to such a degree, and all the more so when it brings us together in celebration. In other words, it brings us joy.\" The King's Music Room will be broadcast on Apple Music 1 to mark Commonwealth Day on Monday, 10 March. In a new picture released to celebrate the collaboration, the King can be seen at his desk in the palace during the recording with an illuminated \"On Air\" sign next to him. More from Sky News:King pulls pints on brewery visitCharles and Camilla host celebs at Highgrove In 2021, Charles revealed songs by The Three Degrees, Diana Ross and Edith Piaf were among his favourites. The King is not the only royal to have opened up on his musical taste. The late Queen's favourite hits are said to have included Oklahoma from the Rodgers and Hammerstein musical of the same name, Anything You Can Do from Annie Get Your Gun and ukulele-playing George Formby's Leaning On A Lamp-Post, as revealed by her friends and family. While the Prince of Wales joined Prince George and Princess Charlotte at a Taylor Swift concert last year, and has said he listens to a \"bit of everything\"."
    },
    {
        "title": "Lesma-Rose Wibier: Tributes to girl who died in Manchester house fire - as woman arrested",
        "description": "A four-year-old girl who died in a house fire in Manchester has been named.",
        "url": "https://news.sky.com/story/lesma-rose-wibier-tributes-to-girl-who-died-in-manchester-house-fire-as-woman-arrested-13322940",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-manchester-fire-lesma-rose-wibier_6848346.png?20250306193307",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-06 19:28:00",
        "Headline": "A 44-year-old woman, who police say knew the child, was initially arrested on suspicion of arson with intent to endanger life, but has now been rearrested on suspicion of murder.",
        "Content": "A four-year-old girl who died in a house fire in Manchester has been named. Lesma-Rose Wibier was pulled from the blaze at the property on Gateshead Close, Rusholme, on Sunday afternoon, Greater Manchester Police said. She later died from her injuries in hospital. A 44-year-old woman, who police say knew the child, was arrested on suspicion of arson with the intent to endanger life, and has been rearrested on suspicion of murder. She has been detained under the Mental Health Act and is awaiting further assessment, Greater Manchester Police said. 'Star of the family' Paying tribute, the girl's family said: \"Lesma-Rose was the star of the family. \"Anyone who knew her knew she was the most beautiful girl inside and out. \"She always had a smile on her face and could put the same on others. \"She was such a smart and intelligent girl in her own unique ways, and she will be deeply missed by anyone who was blessed to meet her.\" Read more from Sky News:Girl who died in sports pitch crash namedPoundland up for sale as budget tax hike loomsFIFA considers 64-team men's World Cup Previously, detective chief inspector Charlotte Whalley described the death as an \"awful incident\", and extended her condolences to the young girl's friends and family. \"Numerous emergency services attended the scene and all did their utmost best to save her,\" she added."
    },
    {
        "title": "Rachel Reeves says welfare system 'letting people down' ahead of expected cuts",
        "description": "Rachel Reeves has said the welfare system is \"letting down taxpayers\", while she again committed to reaching 2.5% in defence spending by 2027 due to the \"enormity of the situation\" facing European security.",
        "url": "https://news.sky.com/story/rachel-reeves-says-welfare-system-letting-people-down-ahead-of-expected-cuts-13322820",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rachel-reeves-electoral-dysfunction_6847952.jpg?20250306120803",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-06 15:25:00",
        "Headline": "The chancellor is expected to make billions of pounds in spending cuts in her spring statement in order to keep to her self-imposed fiscal rules.",
        "Content": " Rachel Reeves has said the welfare system is \"letting down taxpayers\", while she again committed to reaching 2.5% in defence spending by 2027 due to the \"enormity of the situation\" facing European security. The chancellor told Sky's political editor Beth Rigby on the Electoral Dysfunction podcast, out on Friday, that there needs to be \"better value for money\" for what people pay in taxes. Politics Live: PM issues warning over Putin and peace deal It comes ahead of the spring statement on 26 March, in which Ms Reeves is expected to make billions of pounds of cuts including to the benefits bill. The chancellor said there needs to be welfare reform because the system is \"letting down taxpayers because it's costing too much\". \"It's letting down our economy because there's too many people trapped on out-of-work benefits, and it's letting down the people who are recipients of benefits because they are trapped on benefits rather than actively supported back into work,\" she said. Pressed that she has to find savings to meet her self-imposed fiscal rules, Ms Reeves said she was \"not going to provide a running commentary\" on what could be in the spring statement but insisted the reforms were necessary regardless of what could be in the upcoming forecast from the Office for Budget Responsibility (OBR). \n                  Politics latest: Nigel Farage hits back at one of his own Reform MPs\n                 \n                  Robert Jenrick says new sentencing guidelines have 'blatant bias against Christians and straight white men'\n                 \n                  A UK-conducted fatal drone strike confirmed for first time since Starmer became PM\n                 She said there are a million young people not in education, employment or training and \"the majority of those people should be working\". \"Under the plans that we're going to bring in, they will be working and crucially, they will be given support to get back to work,\" she added. 👉 Click here to follow Electoral Dysfunction wherever you get your podcasts 👈 The spring statement will be in response to the latest updates from the OBR, which is required to do a forecast twice a year on the economy and public finances. The chancellor previously committed to just one single major fiscal event each year to give stability and certainty on upcoming tax changes, unlike previous governments that typically delivered budgets in the spring and autumn. However, the poor economic climate since her October 2024 budget is forcing her hand, with inflation hitting a 10-month high of 3% in January, a sharp rise in government bond yields, and growth has not been as high as expected. This has eaten into the £10bn fiscal headroom Ms Reeves was previously estimated to have - a figure the Treasury wants to maintain. Ms Reeves insisted her spring statement would not be another package of tax rises, saying the October budget \"was a sort of a once in a generation, once in a parliament type budget\". Read More:Poundland up for sale as budget tax hike loomsJobcentre reforms at heart of Labour's plan to 'get Britain working'  She added that Labour committed in its manifesto not to increase income tax, VAT or national insurance and \"we're not going to renege on that\". 'World has changed' Elsewhere in the podcast, Ms Reeves defended the government's decision to cut foreign aid to fund an increase in defence spending. Labour's manifesto committed to restoring development spending at the level of 0.7% of gross national income \"as soon as fiscal circumstances allow\". However around £6bn per year will now be taken out of the aid budget and transferred over to pay for defence. That amounts to a reduction in aid spending from 0.5% of GDP to 0.3%. Ms Reeves said the decision had to be made to fund another manifesto pledge - which was to raise defence spending to 2.5% of GPD, up from the 2.3% it is at now. \"The decision was made not just to get to 2.5%, but to get to 2.5% in 2027,\" she said. \"I think that was the most significant bit, really of the announcement. \"Everyone knew we were going to get to 2.5% in this parliament. That was a commitment from us in our manifesto that we would get there, but we're actually going to get there in two years because we recognise that the world has changed the enormity of the situation.\" Listen to the full interview with Rachel Reeves on the Electoral Dysfunction podcast, out Friday at 5am."
    },
    {
        "title": "What is the UK's nuclear umbrella – and could it be expanded?",
        "description": "French President Emmanuel Macron has said he is considering opening France's \"nuclear umbrella\" to the rest of Europe - amid uncertainties over US security guarantees.",
        "url": "https://news.sky.com/story/what-is-the-uks-nuclear-umbrella-8211-and-could-it-be-expanded-13322505",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nuclear-graphic-nuclear-umbrella_6848185.jpg?20250306185641",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-06 07:45:00",
        "Headline": "The UK and France are among five internationally recognised nuclear powers. The UK has \"assigned\" its nuclear capabilities to any other NATO country should it come under nuclear attack.",
        "Content": " French President Emmanuel Macron has said he is considering opening France's \"nuclear umbrella\" to the rest of Europe - amid uncertainties over US security guarantees. Ahead of EU leaders meeting in Brussels on Thursday, Mr Macron said he would \"open the debate\" around sharing France's nuclear deterrent with other European and NATO allies. It comes after President Donald Trump withdrew military aid from Ukraine - and amid fears he could withdraw US involvement in NATO. This has seen leaders in Germany, Canada, and elsewhere suggest that both France and the UK could help bolster their security as the sole nuclear powers in Europe. What is a nuclear 'umbrella' and how does the UK's differ from France's? There are only five recognised nuclear powers under the Nuclear Proliferation Treaty (NPT), an international agreement established during the Cold War to avoid nuclear destruction. They are the UK, US, France, China, and Russia. Other countries, including North Korea, India, and Pakistan, are believed to have nuclear weapons too - but they are not part of the NPT. The US and Russian nuclear capabilities are by far the biggest, with America having around 1,700 nuclear warheads, compared with the UK's estimated 250 and France's 300. The UK's Trident programme is a single deterrent system - the only one in the NPT - which operates on a strategy of 'continued at-sea deterrence' (CASD). This consists of four nuclear submarines, each capable of carrying missiles armed with nuclear warheads. There is always at least one patrolling UK waters at any one time - ready to respond to any foreign nuclear attack - acting as a deterrent. Read more from Sky NewsWhat is Starmer's 'coalition of the willing?'US is 'destroying international rules-based order'Trump tells Hamas it's 'dead' if hostages aren't returned The UK Trident programme is \"assigned\" to NATO. As military analyst Sean Bell says, this means: \"In principle, although only three members of NATO are nuclear powers (the US, France, and the UK), should any NATO country suffer a nuclear attack they would still benefit from the 'umbrella' of protection from the collective nuclear capability of NATO.\" France, however, has not assigned its nuclear arsenal to NATO and remains independent. Unlike the UK - as well as submarines, it also has airborne nuclear capabilities. Both Prime Minister Sir Keir Starmer and President Macron are the only people who have the power to 'pull the trigger' on their respective countries using their nuclear weapons. What has been said? Since Donald Trump re-entered the White House, world leaders have expressed strategic security concerns. Mr Trump has long voiced his dislike of NATO, describing it as \"obsolete\", and saying he would \"encourage\" Russian President Vladimir Putin to attack any NATO country that fails to pay its contributions to the alliance. He has also suspended military aid to Ukraine, leaving many fearing that without US support, Mr Putin may be emboldened to take complete control of the country - and other former Soviet nations nearby. Ahead of Germany's elections, expectant chancellor Friedrich Merz said he wanted to \"discuss with the British and the French whether their nuclear protection could be extended\" - and \"apply to us\". This week, Chrystia Freeland, Canada's former deputy prime minister who is running to replace Justin Trudeau as prime minister, indicated she would try to get assurances from the UK and France after Donald Trump's suggestion Canada could become America's '51st state'. She said that Mr Trump is \"clearly threatening our sovereignty\" and that to \"guarantee our security\" she would build closer partnerships with Western allies. \"I would be sure that France and Britain were there, who possess nuclear weapons,\" she added. Ahead of the latest EU summit in Brussels, Mr Macron reiterated earlier comments that he would discuss extending France's nuclear commitments amid the uncertainties around America's. \"I want to believe that the US will stand by our side, but we have to be ready for that not to be the case,\" he said. Sir Keir Starmer has not been drawn on the debate. Could the umbrella be extended? In principle, the UK's nuclear umbrella already extends to the other 31 NATO countries - and so does America's. However, since Mr Trump's re-election, the US is being seen as a \"potentially unreliable partner\", former RAF pilot Sean Bell says. This puts more pressure on both the UK and France, as Europe's sole nuclear powers, to act as deterrents to further Russian aggression, which many fear could see countries like Latvia, Lithuania, Estonia, or Moldova invaded. \"Nuclear weapons are abhorrent by their very nature - but they are the ultimate deterrence and should never actually need to be used,\" Bell says. \"Any potential adversary has to believe that the cost of any offensive attack would far outweigh any benefits. \"It is increasingly unclear whether the US policy regarding NATO and European defence has changed, raising concerns over the credibility of NATO's nuclear deterrent capability as a result, Europe recognises that it needs a Plan B.\" The easiest way to bolster this would be for France to share its nuclear arsenal with NATO in the same way Britain does. \"If you've got two countries [assigned to NATO], you've got double the commitment - and therefore more resilience and more credibility,\" Bell says.  Mr Macron said he would discuss the French umbrella with European leaders in Brussels on Thursday. But Bell says: \"It looks unlikely that France will announce a significant change to its long-held nuclear policy at today's meeting. \"But it does highlight just how seriously European nations are taking this change in security approach by the Trump administration.\""
    },
    {
        "title": "Glastonbury 2025 line-up revealed ",
        "description": "The 1975 and Olivia Rodrigo will be among the stars headlining Glastonbury Festival this year.",
        "url": "https://news.sky.com/story/glastonbury-2025-line-up-revealed-13322509",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-matty-healy-1975-olivia-rodrigo_6847741.jpg?20250306083225",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-06 07:55:00",
        "Headline": "Matty Healy's 1975 will be headlining for the first time, having made their Glastonbury debut in 2014, while US pop sensation Olivia Rodrigo is set to make her Pyramid Stage debut to close out the festival.",
        "Content": " The 1975 and Olivia Rodrigo will be among the stars headlining Glastonbury Festival this year. Glastonbury organisers have revealed the line-up for this summer's event, taking place between 25 June and 29 June, after months of speculation. The 1975 will take to the iconic Pyramid Stage on Friday to headline, Neil Young will perform on Saturday and Olivia Rodrigo on Sunday. Other big names include British pop sensation Charli XCX, rapper Loyle Carner and electronic group The Prodigy. The announcement comes after Sir Rod Stewart was booked for the Sunday teatime legend slot and Young was confirmed as a headliner earlier this year. Young's announcement in January came amid some confusion, as he had days before told fans he was pulling out of the festival because the BBC's involvement was a \"corporate turn-off\". The Canadian singer-songwriter later said this decision was down to \"an error in the information I received\". Glastonbury, which takes place at Worthy Farm in Somerset in the summer, has worked closely with the BBC - its exclusive broadcast partner - since 1997. The 1975 will be headlining for the first time, having made their Glastonbury debut in 2014. The Cheshire pop band, known for hits such as Somebody Else and Chocolate, have regularly made headlines due to the antics of frontman Matty Healy. Last month, the band was found not liable after a Malaysian festival was closed in 2023 because Healy kissed a male bandmate on stage. The festival's organisers tried to sue the band for £2m, claiming they had received a \"pre-show written assurance\" that their performance would adhere to all laws in Malaysia, where homosexuality is a crime. Read more:Sabrina Carpenter's BRIT performance sparks Ofcom complaintsMalta's Eurovision entry censored over song's 'appropriateness' Healy was also handed a cease-and-desist letter by US rapper Azealia Banks in December after a heated exchange on X in which he suggested he would slap her. Fellow headliner Rodrigo, 22, first took to the Glastonbury's Other stage in 2022 after the release of her mega-successful debut album, Sour. The American pop star played a string of arena shows in the UK, Asia, the US and Australia last year as part of the tour for her second chart-topping album, Guts. Other highlights for this year's Glastonbury include Scottish rock band Biffy Clyro, Canadian singer-songwriter Alanis Morissette, US chart-topper Noah Kahan, English rock band Wolf Alice, British indie rockers Wet Leg and recently reformed US pop group Scissor Sisters. Entertainment reporter It’s one of the largest music festivals in the world, previously boasting headliners such as Sir Elton John, Stormzy and Sir Paul McCartney on its infamous Pyramid Stage. The announcement today, however, suggests organisers are steering away from having a main stage and looking to spread out the festival crowd across the site. Despite her recent big wins at the Brit Awards and Grammys, Charli XCX will bring her Brat set to the Other Stage on Saturday night, at the same time as Neil Young on the Pyramid Stage. Meanwhile, one of the fastest growing new artists of 2025, Doechii, will headline the West Holts stage on the same evening. Looking at listenership figures alone, it seems as though it’ll be a race to guarantee a spot to watch Charli XCX and Doechii, as their stages have a 70,000 and 35,000 capacity respectively.  Charli XCX boasts over 32 million monthly listeners on Spotify, Doechii has 39 million whilst their headliner competitor Neil Young has around 6 million listeners per month on the streaming platform. The 1975 and Olivia Rodrigo round out the headliners this year, with the latter becoming the second youngest headliner at Worthy Farm and the first to have released her debut single in the 2020s. With more to be announced, the Glastonbury line-up looks to please all generations attending, but the question is, will it be possible? Appetite for the iconic festival saw standard tickets sell out in 35 minutes in November. They cost £373.50 plus a £5 booking fee, up £18.50 from the price from the 2024 festival, and were sold exclusively through the See Tickets website. The date for the resale - where tickets not fully paid for are put back up for sale - is set for some time in spring. The headliners last summer on the iconic Pyramid Stage were Dua Lipa, SZA and Coldplay, who made history as the first act to headline the festival five times. 2026 is likely to be a year off for Glastonbury, with the festival traditionally taking place four out of every five years, and the fifth year reserved for rehabilitation of the land."
    },
    {
        "title": "Volodymyr Zelenskyy says 'Ukraine most interested in peace' as he confirms US talks next week",
        "description": "Volodymyr Zelenskyy has said Ukraine is \"most interested in peace\" and confirmed officials will hold talks with US partners in Saudi Arabia next week about ending the war with Russia.",
        "url": "https://news.sky.com/story/zelenskyy-says-ukraine-most-interested-in-peace-as-he-confirms-us-talks-as-starmer-to-hold-talks-with-european-leaders-13323094",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-zelenskyy-ukraine-europe_6848538.jpg?20250306231501",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-06 22:58:00",
        "Headline": "Efforts to achieve peace in Ukraine appeared to take a major blow last week following Volodymyr Zelenskyy's disastrous visit to the White House.",
        "Content": "Volodymyr Zelenskyy has said Ukraine is \"most interested in peace\" and confirmed officials will hold talks with US partners in Saudi Arabia next week about ending the war with Russia. It comes as Sir Keir Starmer is due to hold talks with European leaders on Friday about Ukraine. The prime minister and French President Emmanuel Macron are seeking countries willing to supply troops for a peacekeeping force to defend a potential deal. The suggested agreement has already been rejected by Russia. In his nightly address on Thursday, the Ukrainian president said his country was \"most interested in peace\". He also appeared to signal relations between the US and Ukraine were getting back on track after his disastrous White House visit - saying talks will take place in Saudi Arabia, but suggested he would not be part of those discussions. The Ukrainian president said: \"I am scheduled to visit Saudi Arabia to meet with the crown prince. \"After that, my team will stay in Saudi Arabia to work with American partners. Ukraine is most interested in peace.\" \n                  Russia wants 'quick peace' in Ukraine and London is 'head of those resisting it', ambassador to UK tells Sky News\n                 \n                  What you need to know from a monumental week in Ukraine\n                 \n                  Day 46: Why is Trump blindfolding Ukraine? \n                 He added: \"As we told President Trump, Ukraine is working and will work exclusively constructively for a quick and reliable peace.\" It comes around a week after the public row between the two men in the Oval Office. It has been followed this week by America freezing military aid to Ukraine. Meanwhile, in an exchange with reporters on Thursday, the US president said his administration had made \"a lot of progress\" in recent days with both Ukraine and Russia, but did not specify further. \"I think what's going to happen is Ukraine wants to make a deal, because I don't think they have a choice,\" Mr Trump said. \"I also think that Russia wants to make a deal because in a certain different way - a different way that only I know, only I know - they have no choice either.\" More on this story:Zelenskyy's olive branch offering to TrumpUS 'destroying' world order trying to meet Russia 'halfway' Earlier on Thursday, Steve Witkoff, a senior US official, praised a letter sent from Mr Zelenskyy to Mr Trump as a \"positive first step\" following their unsuccessful meeting. \"We are now in discussions to coordinate a meeting with the Ukrainians in Riyadh or even potentially Jeddah,\" he said. \"The city is moving around a little bit, but it will be Saudi Arabia.\" Mr Witkoff said Washington was trying to agree on a framework for a possible peace agreement in Ukraine. It has also been pushing for the signing of a critical minerals deal with Ukraine - but it is unclear if that will be part of the talks next week. Read more: The 'coalition of the willing' that could secure peace in Ukraine US-UK defence secretaries meet Defence Secretary John Healey said Mr Trump has \"asked Europe to step up, and we are\" as he started talks in Washington with his US counterpart Pete Hegseth on Thursday. Mr Hegseth said it was \"very encouraging\" to see France and the UK say they are prepared to take a leading role. Sir Keir has been seeking to support Ukraine and show Mr Trump the UK is committed to stepping up its defence efforts - while mooting plans for a peacekeeping force. Russian foreign minister Sergei Lavrov said the move would amount to the \"direct, official and unveiled involvement of NATO members in the war against Russia\". While Andrei Kelin, Russian ambassador to the UK, said in an interview with Sky News' The World With Yalda Hakim, that Russia wanted \"quick peace\" in Ukraine and the UK was at the \"head of those resisting\" it.  European leaders meanwhile backed new defence spending plans aimed at freeing billions for the continent's security. The 27 leaders signed off on a move to loosen budget restrictions so that willing EU countries can increase their spending. On Thursday evening, Russia launched a mass drone attack on the Black Sea port of Odesa, damaging energy infrastructure and starting fires, according to a local governor."
    },
    {
        "title": "Russia wants 'quick peace' in Ukraine and London is 'head of those resisting it', ambassador to UK tells Sky News",
        "description": "Russia wants \"quick peace\" in Ukraine and London is at the \"head of those resisting\" it, the Russian ambassador to the UK has told Sky News.",
        "url": "https://news.sky.com/story/russia-wants-quick-peace-in-ukraine-and-london-is-head-of-those-resisting-it-ambassador-to-uk-tells-sky-news-13322750",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-russian-ambassador_6847998.jpg?20250306144239",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-06 13:24:00",
        "Headline": "In an interview on The World With Yalda Hakim, Andrei Kelin says Moscow told Washington it believes its territorial advances in Ukraine \"should be recognised\" as part of any peace deal.",
        "Content": " Russia wants \"quick peace\" in Ukraine and London is at the \"head of those resisting\" it, the Russian ambassador to the UK has told Sky News. In an interview on The World With Yalda Hakim, Andrei Kelin accused the UK, France and other European nations of not wanting to end the war in Ukraine. \"We are prepared to negotiate and to talk,\" he said. \"We have our position. If we can strike a negotiated settlement... we need a very serious approach to that and a very serious agreement about all of that - and about security in Europe.\" US President Donald Trump held a surprise phone call with his Russian counterpart Vladimir Putin last month, shocking America's European allies. He went on to call Ukrainian President Volodymyr Zelenskyy a \"dictator\" and relations between the pair were left in tatters after a meeting in the Oval Office descended into a shouting match. Days later, the US leader suspended military aid to Ukraine, though there were signs the relationship between the two leaders appeared to be on the mend following the contentious White House meeting last week, with Mr Trump saying he \"appreciated\" a letter from Mr Zelenskyy saying Kyiv was ready to sign a minerals agreement with Washington \"at any time\". In his interview with Sky News' Yalda Hakim, Mr Kelin said he was \"not surprised\" the US has changed its position on Russia's full-scale invasion of Ukraine, which began in 2022, claiming Mr Trump \"knows the history of the conflict\". \"He knows history and is very different from European leaders,\" he added. Lead world news presenter I've interviewed the Russian ambassador to the UK, Andrei Kelin, on a number of occasions, at times the conversation has been tense and heated. But today, I found a diplomat full of confidence and cautiously optimistic. The optics of course have suddenly changed in Russia’s favour since Donald Trump was elected. I asked him if Russia couldn't believe its luck. \"I would not exaggerate this too much,\" he quipped. Mr Kelin also \"categorically\" ruled out European troops on the ground and said the flurry of diplomatic activity and summits over the course of the past few weeks is not because Europeans want to talk to Moscow but because they want to present something to Mr Trump. He appeared to relish the split the world is witnessing in transatlantic relations. Of course the ambassador remained cagey about the conversations that have taken place between President Trump and Vladimir Putin. There is no doubt however that Russia is welcoming what Mr Kelin says is a shift in the world order. Peace deal 'should recognise Russian advances' The Russian ambassador said Moscow had told Washington it believed its territorial advances in Ukraine \"should be recognised\" as part of any peace deal. \"What we will need is a new Ukraine as a neutral, non-nuclear state,\" he said. \"The territorial situation should be recognised. These territories have been included in our constitution and we will continue to push that all forces of the Ukrainian government will leave these territories.\" Asked if he thought the Americans would agree to give occupied Ukrainian land to Russia, he said: \"I don't think we have discussed it seriously. [From] what I have read, the Americans actually understand the reality.\" Read more:What you need to know from a monumental week in UkraineUS 'destroying' world order by trying to meet Russia 'halfway'  Moscow rules out NATO peacekeepers in Ukraine He said Russia \"categorically ruled out\" the prospect of NATO peacekeepers on the ground in Ukraine - a proposal made by UK Prime Minister Sir Keir Starmer and French President Emmanuel Macron - saying \"they have no rules of engagement\" and so would just be \"sitting in cities\". \"It's senseless\" and \"not for reality,\" Mr Kelin added. He branded the temporary ceasefire raised by Mr Zelenskyy \"a crazy idea\", and said: \"We will never accept it and they perfectly are aware of that. \"We will only accept the final version, when we are going to sign it. Until then things are very shaky.\" He added: \"We're trying to find a resolution on the battlefield, until the US administration suggest something constructive.\""
    },
    {
        "title": "Pope Francis' voice heard for first time since entering hospital in new audio message",
        "description": "Pope Francis' voice has been heard for the first time since being admitted to hospital last month in a newly released audio message.",
        "url": "https://news.sky.com/story/pope-francis-voice-heard-for-first-time-since-entering-hospital-in-new-audio-message-13322965",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pope-francis-vatican_6840246.jpg?20250303143700",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-06 19:44:00",
        "Headline": "The recording was played at the start of the evening Rosary prayer in St Peter's Square, where worshippers broke into applause.",
        "Content": " Pope Francis' voice has been heard for the first time since being admitted to hospital last month in a newly released audio message. In the recording, shared with worshippers at the start of the evening Rosary prayer in St Peter's Square, he said: \"I thank you from the bottom of my heart for your prayers for my health from the Square, I am with you from here. \"May God bless you and the Virgin protect you. Thank you.\" The cardinal presiding over the prayer told the crowd he had \"beautiful news, a beautiful gift\" to share. The clearly surprised worshippers broke into applause as the message was played. The Pope recorded the audio message in his native Spanish from Rome's Gemelli Hospital, where he has been receiving treatment for double pneumonia since being admitted last month. While the 88-year-old has shared written messages via the Vatican since entering hospital on 14 February, this is the first time his voice has been heard. The audio recording comes after the Vatican said the Pope's condition has today been stable \"compared to previous days\". He has not had a fever and his blood tests remain stable, it said. International correspondent It is now the 21st night that the Pope has spent in Rome's Gemelli Hospital. He clearly remains very sick, but the release of the voice recording, in which he thanks people for praying for him, is a positive sign at a very worrying time. The message is short and is in his native language of Spanish. He sounds very weak and tired in the recording - ordinarily he is known for his strength and vigour. It is also interesting that the Vatican has decided not to release a picture of him. During Pope Francis' last stay in hospital, they did distribute a photograph. But the fact that he has felt well enough to release a message at all will fill Catholics around the world with hope that he recovers. The Pope is 88 years old and has a history of lung-related conditions. The team of doctors treating him remain \"guarded\" about his prognosis, describing his condition as \"complex\".\n\n The Vatican has been giving updates on the pontiff's health at least once a day since he was admitted to hospital - but in a sign of his progress, these are being paused. \"Considering the stability of the clinical picture, the next medical bulletin will be released on Saturday,\" it said this evening.  More from Sky News:Denmark postal service to stop delivering lettersGirl who died in sports pitch crash named The Pope - who has chronic lung disease and had part of one lung removed as a young man - has been sleeping with a non-invasive mechanical ventilator to help his recovery and ensure his lungs expand properly overnight. He has been transitioning to receiving high-flow oxygen via nasal tubes during the day. The Pope's daily routine now includes physical and respiratory therapy alongside treatment for double pneumonia, the Vatican said. This has become the longest public absence of the Pope's 12-year papacy."
    },
    {
        "title": "US 'destroying' international rules-based order by trying to meet Russia 'halfway', Ukraine's UK ambassador warns",
        "description": "The United States is \"finally destroying\" the international rules-based order by trying to meet Russia \"halfway\", Ukraine's ambassador to the UK has warned.",
        "url": "https://news.sky.com/story/us-destroying-international-rules-based-order-by-trying-to-meet-russia-halfway-ukraines-uk-ambassador-warns-13322700",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-firefighters-ukraine_6847728.jpg?20250306080553",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-06 12:06:00",
        "Headline": "Valerii Zaluzhnyi says Washington's recent actions in relation to Moscow could lead to the collapse of NATO and that Europe could become Vladimir Putin's next target.",
        "Content": "The United States is \"finally destroying\" the international rules-based order by trying to meet Russia \"halfway\", Ukraine's ambassador to the UK has warned. Valerii Zaluzhnyi said Washington's recent actions in relation to Moscow could lead to the collapse of NATO - with Europe becoming Russian President Vladimir Putin's next target. \"The failure to qualify actions of Russia as an aggression is a huge challenge for the entire world and Europe, in particular,\" he told a conference at the Chatham House think tank. Ukraine latest: 'Watershed moment' as Kremlin blasts Macron \"We see that it is not just the axis of evil and Russia trying to revise the world order, but the US is finally destroying this order.\" Mr Zaluzhnyi, who took over as Kyiv's ambassador to London in 2024 following three years as commander-in-chief of the Ukrainian armed forces, also warned that the White House had \"questioned the unity of the whole Western world\" - suggesting NATO could cease to exist as a result. It comes as Ukrainian President Volodymyr Zelenskyy scrambles to repair relations with US President Donald Trump following a dramatic row between the two men in the Oval Office last week. 👉 Follow Trump 100 on your podcast app 👈 Mr Trump signalled on Tuesday that tensions could be easing, telling Congress he had received a letter from Mr Zelenskyy saying he was ready to sign a peace deal \"at any time\". Read more:New Zealand fires UK envoy for Trump commentsUS stops sharing all intelligence with Ukraine But on the same day, the US president ordered a sudden freeze on shipments of US military aid to Ukraine, and Washington has since paused intelligence sharing with Kyiv and halted cyber operations against Russia. Mr Zaluzhnyi said the pause in cyber operations and an earlier decision by the US to oppose a UN resolution condemning Russian aggression in Ukraine were \"a huge challenge for the entire world\". He added that talks between the US and Russia - \"headed by a war criminal\" - showed the White House \"makes steps towards the Kremlin, trying to meet them halfway\", warning Moscow's next target \"could be Europe\"."
    },
    {
        "title": "What you need to know from a monumental week in Ukraine",
        "description": "It's been a week like no other for Ukraine and the attempts being made at a diplomatic level to end the war with Russia.",
        "url": "https://news.sky.com/story/what-you-need-to-know-from-a-monumental-week-in-ukraine-13322615",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-volodymyr-zelenskyy_6847919.jpg?20250306113822",
        "type": "World",
        "Author": "Mark Wyatt, live news reporter",
        "Date Published": "2025-03-06 10:08:00",
        "Headline": "Volodymyr Zelenskyy has met with presidents, prime ministers, cabinet ministers and kings in the last seven days - all in front of the world's cameras. Here's what has happened in a week like no other. ",
        "Content": "By Mark Wyatt, live news reporter  It's been a week like no other for Ukraine and the attempts being made at a diplomatic level to end the war with Russia. Volodymyr Zelenskyy has met with presidents, prime ministers, cabinet ministers and kings in the last seven days - all in front of the world's cameras. Here, we break down what's been happening on each day over the last week for Mr Zelenskyy, Ukraine and the wider international quest to bring the war with Russia to a permanent end. Starmer heads to Washington - Thursday 27 February After weeks of preparation, Sir Keir Starmer made his first visit to the White House to meet Donald Trump. The meeting went smoothly and actually contained some wins for the prime minister. Ukraine latest: Europe must beat Russia in arms race, Poland warns Mr Trump fangled the prospect of a \"very good\" trade deal and looked genuinely pleased with the invitation for an \"unprecedented\" second state visit. But the biggest prize, that of US security guarantees for a Ukraine peace deal, remained elusive. An unprecedented row - Friday 28 February The much-anticipated visit of Mr Zelenskyy to the White House came a day after Sir Keir's visit, and the meltdown that ensued in the Oval Office will surely go down in history. Mr Trump and vice president JD Vance publicly berated Mr Zelenskyy on everything - from his apparent lack of gratitude for US support during the war, right down to the clothes he chose *not* to wear. In a warning shot to Mr Zelenskyy, Mr Trump said at one point: \"You're either going to make a deal or we're out, and if we're out, you'll fight it out. I don't think it's going to be pretty.\" Mr Zelenskyy ended up leaving the White House before a planned news conference and, crucially, without signing a critical minerals deal. He took to social media soon after his exit, expressing his thanks to Mr Trump, America and its people for support to Ukraine. Mr Trump also posted online, describing the meeting as \"very meaningful\", and saying he was \"determined\" that Mr Zelenskyy \"is not ready for peace if America is involved\". Zelenskyy welcomed in London - Saturday 1 March Russia's response to the White House drama was simple, labelling it a political and diplomatic \"failure\". Mr Zelenskyy himself didn't have much time to dwell on the Oval Office disaster, heading to London to meet with the prime minister a day later. 👉 Follow Trump 100 on your podcast app 👈  The Ukrainian looked visibly moved by the crowds lining the streets outside Downing Street to welcome his convoy and when Sir Keir embraced him on the steps of Number 10. Inside, Sir Keir told Mr Zelenskyy he has \"full backing across the United Kingdom\" and later announced £2.6bn in loans to support Ukraine. In the evening, Sir Keir had \"constructive\" calls with Mr Trump and French President Emmanuel Macron before saying Ukraine's allies were \"at a turning point\" in the conflict. King Charles and the four-point plan - Sunday 2 March Ending the weekend in the UK, Mr Zelenskyy met with King Charles ahead of a meeting of world leaders for a security summit on Ukraine. The Ukrainian flew by helicopter to the monarch's Sandringham residence in Norfolk, where the two held talks. After his royal meeting, Mr Zelenskyy was back in London where Sir Keir declared that a \"coalition of the willing\" will come together and draw up a peace plan to end the war. The prime minister said this would enforce any peace deal in Ukraine and the plan would be presented to Mr Trump for his support, with four key points for peace unveiled. Those four points, agreed by attendees of the summit, included guarantees over Ukraine's sovereignty and security, promises over the supply of military aid and to defend any deal to ensure a lasting peace. After the summit, Mr Zelenskyy gave interviews to reporters in which he said a deal to end the war with Russia was \"still very, very far away\".  US-Ukraine relations on a knife edge - Monday 3 March It's fair to say those comments didn't go down well across the pond, with Mr Trump calling it \"the worst statement that could have been made\". \"America will not put up with it for much longer!\" he posted. Later, Mr Zelenskyy said in a statement that Ukraine was \"counting on America's support on the path to peace\". More from Sky News:Russia wants 'quick peace' in Ukraine, ambassador tells Sky NewsBritish man who 'fought for Ukraine' jailed for 19 years in Russia Aid cuts and olive branches - Tuesday 4 March Europe woke up on Tuesday to the news that Trump had paused US military aid to Ukraine, with no indication on how long the pause would last. The move marked a significant shift in US foreign policy, one previously considered unthinkable, with some analysts noting the American president was treading a fine line between dealmaking and blackmailing. The Kremlin described the pause as the \"best contribution to the cause of peace\", but there were fears in Ukraine that the \"catastrophic\" decision could kill \"thousands\".  A statement from Mr Zelenskyy came a few hours later, describing his disastrous meeting with Mr Trump as \"regrettable\" and saying Kyiv was \"ready to come to the negotiating table as soon as possible\". Crucially, he said: \"We are ready to work fast to end the war, and the first stages could be the release of prisoners and truce in the sky - ban on missiles, long-ranged drones, bombs on energy and other civilian infrastructure - and truce in the sea immediately, if Russia will do the same.\" Appealing to the US president's ego, he praised Mr Trump's \"strong leadership\" and repeated his gratitude for past American support, adding that Kyiv was ready to sign its minerals deal with Washington. That statement made its way straight to the hands of Mr Trump in the form of a letter, which he gladly presented to Congress during his record-breaking address to lawmakers.  Intelligence sharing paused - Wednesday 5 March Despite the seemingly more positive tones being struck in Washington surrounding Ukraine following Mr Zelenskyy's letter, the US announced yesterday it was stopping sharing intelligence with Kyiv. CIA director John Ratcliffe said the pause \"will go away\" eventually, adding Mr Trump wanted to give Mr Zelenskyy a \"chance to think\" about whether he was committed to the peace process. A few hours later, Mr Zelenskyy said there has been \"positive movement\" in cooperation with Washington, with his aide saying a US-Ukraine meeting will take place in the \"near future\". Back in the UK, Sir Keir addressed the House of Commons, where he received widespread, cross-party praise for his response to the developing Ukraine picture. Former Foreign Secretary James Cleverly said of the PM: \"Whilst I often take great delight in criticism of the government, I think this weekend he has not really put a foot wrong.\" In France, Mr Macron addressed his countrymen, saying the nation needs to prepare for when the US no longer stands by its side."
    },
    {
        "title": "Athena lander does not appear to be standing upright on moon",
        "description": "A privately built spacecraft sent to the moon does not appear to be upright on the surface, says the US company that operates it.",
        "url": "https://news.sky.com/story/athena-lander-does-not-appear-to-be-standing-upright-on-moon-13322998",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-space-moon-nasa-athena_6848400.jpg?20250306202846",
        "type": "World",
        "Author": "Thomas Moore",
        "Date Published": "2025-03-06 20:20:00",
        "Headline": "The spacecraft, of Intuitive Machines, has landed on the moon with the aim of finding water.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  A privately built spacecraft sent to the moon does not appear to be upright on the surface, says the US company that operates it. The Intuitive Machines lander, called Athena, seems to have survived the perilous descent in a game-changing mission to find water. It slowed from more than 4,000mph to touch down on the Mons Mouton, a ridge just 100 miles from the lunar south pole. But Intuitive Machines chief executive Steve Altemus said at a news conference: \"We don't believe we're in the correct attitude on the surface of the moon, yet again.\" Last year, an Intuitive Machines spacecraft toppled over on landing after tripping over on a rock. Although it responded to commands sent by mission control, it failed to send back images immediately after landing, as expected. Shares in the company tumbled while engineers tried to establish full communication. \n                  Second-ever privately funded space craft touches down on moon\n                 \n                  Katy Perry set to travel to space as part of all-female mission\n                 \n                  Odin probe blasts off on SpaceX rocket to survey asteroid for possible mining mission\n                 The south pole region is the destination for NASA astronauts due to land on the surface in just two years' time. But Athena's descent on to a rugged terrain, sometimes out of communication with listening stations on Earth, underlines the risks they will face. If Athena is able to power up its systems and operate normally, it should release the first privately built robotic rover on to the lunar surface. As it trundles across the terrain, it will build a 3D map and test the first high-speed mobile communications network on the moon. The search for water But the mission's main purpose is to find water. Athena has a drill to take samples a metre below the surface. And it will release a small 'hopper' that will bounce into a deep crater that is permanently in shadow, where there could be ice. Professor Katherine Joy, a planetary geologist at the University of Manchester who is advising the NASA Artemis mission, said orbiting spacecraft have spotted signs of water in the craters. But that needs to be confirmed on the ground. Read more from Sky News:Denmark postal service to stop delivering lettersPope Francis heard again in new messageTriple killer convicted of raping ex-girlfriend She told Sky News: \"These craters are incredibly cold, down to about -230C (-382F). Ice could be maintained there for thousands, millions and maybe even billions of years. \"So there may be quite a lot of ice present. \"It would mean that we could mine these deposits to convert into water to drink, to make oxygen to breathe, and even create rocket fuel.\""
    },
    {
        "title": "FIFA considers proposal for 64-team men's World Cup in 2030",
        "description": "FIFA is considering whether to expand the men's World Cup to include 64 teams in 2030, a spokesperson has confirmed. ",
        "url": "https://news.sky.com/story/fifa-considers-proposal-for-64-team-mens-world-cup-in-2030-13322884",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-argentina-world-cup_6848297.jpg?20250306181943",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-06 17:55:00",
        "Headline": "The idea to have 64 teams compete as a one-off for the World Cup's centenary year in 2030 was put forward this week.",
        "Content": " FIFA is considering whether to expand the men's World Cup to include 64 teams in 2030, a spokesperson has confirmed.  The football tournament has already expanded ahead of next year's edition, with 48 teams set to compete - instead of the usual 32 - as the United States, Mexico and Canada share hosting duties. The idea to have 64 teams compete as a one-off for the World Cup's centenary year in 2030 was put forward this week. The proposal was \"spontaneously raised by a FIFA council member\" near the end of a meeting held by world football's governing body on Wednesday, a FIFA spokesperson said. \"The idea was acknowledged as FIFA has a duty to analyse any proposal from one of its council members,\" they added. It was suggested by the elected delegate from Uruguay, Ignacio Alonso, two people familiar with the situation told The Associated Press. They spoke on condition of anonymity because the discussion was confidential. The 2026 World Cup will be the biggest edition of the tournament so far, with 104 games being played across 16 host cities in a six-week period. \n                  Top FIFA official says it's harder than ever to be a football referee due to abuse\n                 \n                  FIFA president Gianni Infantino defends 'critical' alliance with Donald Trump\n                 \n                  British man who works for FIFA arrested on suspicion of having sex with underage boy in US\n                 Supersizing it even further would likely present fresh logistical challenges. Also, it would mean hundreds more players going to the World Cup at a time when player unions have criticised a relentless expansion of games and competitions without consulting their members. However, FIFA president Gianni Infantino has said expansion raises revenue and gives more teams the chance to qualify, citing a need to develop football globally. Football Association chief executive Mark Bullingham told Sky News: \"I know that a huge amount of countries around the world have never had the opportunity to play in the World Cup finals and would like the opportunity to do that, but then you've got to balance that up with the tournament itself. \"So let's see what the ideas are and then we can judge them.\" Planning is already well under way for the 2030 tournament, set to be hosted in six countries across three continents. To mark 100 years since the first World Cup took place in Uruguay, the first match of the tournament will be played in Montevideo, the Uruguayan capital. More from Sky News:FIFA boss defends Trump allianceSaudi Arabia lands 2034 World Cup Argentina, runners up in the first World Cup, and Paraguay - where South America's football confederation, Conmebol, is based - will also host one match each to open the tournament. The contest will then move east, with Spain and Portugal and Morocco serving as the main co-hosts. On Wednesday, it was announced the four nations of the UK are planning a joint bid to host the 2035 Women's World Cup. Expansion could also be coming to the women's competition with FIFA bidding documents revealing a potential jump from 32 teams. Sky News revealed plans last year to expand to 48 countries. \"We know those conversations about potentially growing,\" Mr Bullingham said. \"From our point of view we'd be ready to do either (32 or 48). It's up to whatever FIFA needs.\""
    },
    {
        "title": "Denmark postal service to stop delivering letters",
        "description": "Denmark's postal service has announced it will stop delivering letters.",
        "url": "https://news.sky.com/story/denmark-postal-service-to-stop-delivering-letters-13322922",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-denmark-sweden-post_6848337.jpg?20250306190604",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-06 18:57:00",
        "Headline": "Around a third of PostNord's employees are set to lose their jobs in the changes.",
        "Content": "Denmark's postal service has announced it will stop delivering letters. PostNord, which serves Denmark and Sweden, said it would deliver its last letter on 30 December this year, as it announced a raft of changes to its services that it said would meet shifting demand. This included making around one-third of its workforce of 4,600 people redundant - with 1,500 jobs set to be cut. According to the company, the volume of letters it has delivered has decreased 90% since 2000, and is continuing to trend downward. As of 2024, according to PostNord figures, there were over 100 million letters sent annually. But it said that Danes were shopping online \"like never before,\" and it would seek to make parcels the new heart of its business. The decision brings to an end 400 years of delivering letters, and from June it will also begin closing 1,500 mailboxes. \"For 400 years, we have continuously adapted to social developments and the needs of the Danes, and we must do the same now. The reality is that Danes today send very few letters,\" PostNord deputy chief executive Kim Pedersen said. Read more from Sky News:The Rohingya boys 'taken by force'South Korea accidentally bombs homesNew Zealand fires UK envoy over Trump comments PostNord's activities will continue unchanged in Sweden. The dominance of digital communications has helped lead to the change."
    },
    {
        "title": "Trump pauses tariffs on most goods from Mexico and some from Canada",
        "description": "Donald Trump has announced that most goods imported from Mexico and some from Canada are to be exempt from his trade tariff regime for at least four weeks, just days after the charges were imposed.",
        "url": "https://news.sky.com/story/trump-agrees-further-tariff-concessions-but-april-threat-remains-13322861",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-white-house_6848453.jpg?20250306212512",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-03-06 16:54:00",
        "Headline": "The climbdown marks the second delay the president has made to his trade war with Mexico and Canada but the clock is ticking again on even higher charges from 2 April.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has announced that most goods imported from Mexico and some from Canada are to be exempt from his trade tariff regime for at least four weeks, just days after the charges were imposed. \"We are working hard, together, on the border, both in terms of stopping illegal aliens from entering the United States and, likewise, stopping fentanyl,\" the president posted on his Truth Social platform after first relaxing his sanctions against Mexico. He often gives both issues as reasons for the tariffs. The latest climbdown came after he surprised financial markets 24 hours earlier by waiving tariffs against carmakers following pleas from motor industry bosses. Money latest: Why are there no bananas in Tesco? The White House said that 62% of Canadian imports would still be subject to 25% tariffs because they were not compliant with a trade deal - USMCA (US Mexico and Canada) - struck in 2020. News that Canadian goods which met the USMCA criteria were being spared tariffs until 2 April followed hours after the same concession was agreed between Mr Trump and his Mexican counterpart. A tariff of 10% was to remain on potash - a fertiliser used by farmers - and Mr Trump added that the auto tariffs would definitely return next month. The White House revealed some details. Parts due to flow into the US from Mexico and Canada as part of the manufacturing supply chain would not qualify for tariffs so long as they complied with the USMCA deal. 'Rules of origin' guidelines under the agreement allow goods to move between the three countries tariff-free if they qualify with a designation that they were made in North America. US commerce secretary Howard Lutnick told Sky's US partner network CNBC that, taken together, more than half of usual cross border trade volumes would be exempt under the expanded concessions.  He too signalled there were signs of progress in the dispute with America's closest trading partners, saying each had worked hard to make progress in tackling imports of Fentanyl - blamed for high crime and deaths in US communities. But Mr Lutnick explained that, as things stand, the reprieve would only last until 2 April when the Trump administration plans to impose reciprocal tariffs - on top of the 25% charges that came into force on Tuesday. At the same time, Mr Trump is under intense pressure to relax his tariff regime permanently amid a backlash from US firms and financial market investors who fear it is self defeating. Read more from Sky News:Millions in compensation expected over Bank IT failuresPoundland up for sale as budget tax hikes loom A closely-watched forecast has even suggested that the threats of a trade war were enough to push the US economy into recession before Mr Trump took office. The dollar has sunk in value and US government borrowing costs have risen on the back of the turmoil. US stock markets were also feeling the pressure again with the tech-heavy Nasdaq on course to fall by more than 3% on the day. It is widely expected that the European Union will be next to face tariffs - possibly from 2 April - after Mr Trump threatened action \"very soon\" just last week. Commenting on the threat to the eurozone from such a move, the president of the European Central Bank Christine Lagarde said on Thursday: \"Just the threat of those tariff increases and potential retaliations are putting a brake on - on investment, on consumption decisions, on employment, hiring, all the rest of it.\" While Mr Trump has not issued a specific threat against the UK, her counterpart at the Bank of England Andrew Bailey told a committee of MPs on Wednesday that the US should work \"multi-laterally\" rather than bilaterally to resolve its disputes."
    },
    {
        "title": "US 'destroying' international rules-based order by trying to meet Russia 'halfway', Ukraine's UK ambassador warns",
        "description": "The United States is \"finally destroying\" the international rules-based order by trying to meet Russia \"halfway\", Ukraine's ambassador to the UK has warned.",
        "url": "https://news.sky.com/story/us-destroying-international-rules-based-order-by-trying-to-meet-russia-halfway-ukraines-uk-ambassador-warns-13322700",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-firefighters-ukraine_6847728.jpg?20250306080553",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-06 12:06:00",
        "Headline": "Valerii Zaluzhnyi says Washington's recent actions in relation to Moscow could lead to the collapse of NATO and that Europe could become Vladimir Putin's next target.",
        "Content": "The United States is \"finally destroying\" the international rules-based order by trying to meet Russia \"halfway\", Ukraine's ambassador to the UK has warned. Valerii Zaluzhnyi said Washington's recent actions in relation to Moscow could lead to the collapse of NATO - with Europe becoming Russian President Vladimir Putin's next target. \"The failure to qualify actions of Russia as an aggression is a huge challenge for the entire world and Europe, in particular,\" he told a conference at the Chatham House think tank. Ukraine latest: 'Watershed moment' as Kremlin blasts Macron \"We see that it is not just the axis of evil and Russia trying to revise the world order, but the US is finally destroying this order.\" Mr Zaluzhnyi, who took over as Kyiv's ambassador to London in 2024 following three years as commander-in-chief of the Ukrainian armed forces, also warned that the White House had \"questioned the unity of the whole Western world\" - suggesting NATO could cease to exist as a result. It comes as Ukrainian President Volodymyr Zelenskyy scrambles to repair relations with US President Donald Trump following a dramatic row between the two men in the Oval Office last week. 👉 Follow Trump 100 on your podcast app 👈 Mr Trump signalled on Tuesday that tensions could be easing, telling Congress he had received a letter from Mr Zelenskyy saying he was ready to sign a peace deal \"at any time\". Read more:New Zealand fires UK envoy for Trump commentsUS stops sharing all intelligence with Ukraine But on the same day, the US president ordered a sudden freeze on shipments of US military aid to Ukraine, and Washington has since paused intelligence sharing with Kyiv and halted cyber operations against Russia. Mr Zaluzhnyi said the pause in cyber operations and an earlier decision by the US to oppose a UN resolution condemning Russian aggression in Ukraine were \"a huge challenge for the entire world\". He added that talks between the US and Russia - \"headed by a war criminal\" - showed the White House \"makes steps towards the Kremlin, trying to meet them halfway\", warning Moscow's next target \"could be Europe\"."
    },
    {
        "title": "Lesotho minister calls Trump 'insulting' for saying nobody has heard of country",
        "description": "Lesotho's foreign minister has said it is \"insulting\" for Donald Trump to say nobody has heard of the country.&#160;",
        "url": "https://news.sky.com/story/lesotho-minister-calls-trump-insulting-for-saying-nobody-has-heard-of-country-13322496",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-congress_6847695.jpg?20250306073505",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-06 07:28:00",
        "Headline": "While listing countries where the US has cut foreign spending, Donald Trump singled out Lesotho as a place \"nobody has ever heard of\" - drawing ire from the country's government. ",
        "Content": "Lesotho's foreign minister has said it is \"insulting\" for Donald Trump to say nobody has heard of the country.  In his address to the US Congress on Tuesday, the US president mentioned Lesotho while listing some of the foreign spending he had cut as \"appalling waste\". \"Eight million dollars to promote LGBTQI+ in the African nation of Lesotho, which nobody has ever heard of,\" Mr Trump said, drawing laughs in the Congress. The president also appeared to struggle to pronounce the country's name. Lesotho's foreign minister, Lejone Mpotjoane, said: \"I'm really shocked that my country can be referred to like that by the head of state. \"Lesotho is such a significant and unique country in the whole world. I would be happy to invite the president, as well as the rest of the world, to come to Lesotho,\" Mr Mpotjoane told the Reuters news agency. He later told The Associated Press: \"It is surprising and disappointing that he claimed no one knows Lesotho, especially given that the US has an embassy here. \"He should speak for himself and not generalise.\" The Trump administration has cut billions of dollars in foreign aid worldwide as part of the president's America First policy. Lesotho, which has a population of around 2.3 million people, has received American assistance for nearly 20 years through USAID, which gave it more than $44m (£34.1m) last year. Mr Mpotjoane said while civil society organisations funded by the US embassy in Lesotho did work to support the LGBT+ community, the US also provided important funding to the country's health and agriculture sectors. The cuts have forced Lesotho's HIV programme to lay off at least 1,500 health workers - about 7% of the country's health staff - in what the government has described as a severe blow. US aid has been credited with helping Lesotho provide life-saving treatment to more than 200,000 people living with HIV. Mr Mpotjoane said the government was looking at how to become more self-sufficient. \"The decision by the president to cut the aid... it is [his] prerogative to do that. We have to accept that. But to refer to my country like that, it is quite unfortunate.\" This wasn't the first time Mr Trump has reportedly been disparaging about Africa. During his first term, it was reported that he referred to African nations, as well as Haiti and El Salvador, as \"shithole countries\" - though Mr Trump denied this. Elon Musk, a key adviser to Mr Trump and proponent of the foreign aid cuts in his role as head of the new department of government efficiency, has been trying to do business in Lesotho in recent months. Read more:Trump makes US tariff concessions to carmakersPolitical division in US has never looked like this Mr Musk's Starlink internet satellite service, a subsidiary of SpaceX, has applied for a license to operate in Lesotho. It is one of several African countries where the company is bidding to win contracts. The Lesotho Communications Authority said last month it recently received Starlink's bid for a 10-year license. Prince Harry also co-founded the charity Sentebale to support children who live in extreme poverty or suffer from HIV/AIDS in Lesotho."
    },
    {
        "title": "Trump pauses tariffs on most goods from Mexico and some from Canada",
        "description": "Donald Trump has announced that most goods imported from Mexico and some from Canada are to be exempt from his trade tariff regime for at least four weeks, just days after the charges were imposed.",
        "url": "https://news.sky.com/story/trump-agrees-further-tariff-concessions-but-april-threat-remains-13322861",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-white-house_6848453.jpg?20250306212512",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-03-06 16:54:00",
        "Headline": "The climbdown marks the second delay the president has made to his trade war with Mexico and Canada but the clock is ticking again on even higher charges from 2 April.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has announced that most goods imported from Mexico and some from Canada are to be exempt from his trade tariff regime for at least four weeks, just days after the charges were imposed. \"We are working hard, together, on the border, both in terms of stopping illegal aliens from entering the United States and, likewise, stopping fentanyl,\" the president posted on his Truth Social platform after first relaxing his sanctions against Mexico. He often gives both issues as reasons for the tariffs. The latest climbdown came after he surprised financial markets 24 hours earlier by waiving tariffs against carmakers following pleas from motor industry bosses. Money latest: Why are there no bananas in Tesco? The White House said that 62% of Canadian imports would still be subject to 25% tariffs because they were not compliant with a trade deal - USMCA (US Mexico and Canada) - struck in 2020. News that Canadian goods which met the USMCA criteria were being spared tariffs until 2 April followed hours after the same concession was agreed between Mr Trump and his Mexican counterpart. A tariff of 10% was to remain on potash - a fertiliser used by farmers - and Mr Trump added that the auto tariffs would definitely return next month. The White House revealed some details. Parts due to flow into the US from Mexico and Canada as part of the manufacturing supply chain would not qualify for tariffs so long as they complied with the USMCA deal. 'Rules of origin' guidelines under the agreement allow goods to move between the three countries tariff-free if they qualify with a designation that they were made in North America. US commerce secretary Howard Lutnick told Sky's US partner network CNBC that, taken together, more than half of usual cross border trade volumes would be exempt under the expanded concessions.  He too signalled there were signs of progress in the dispute with America's closest trading partners, saying each had worked hard to make progress in tackling imports of Fentanyl - blamed for high crime and deaths in US communities. But Mr Lutnick explained that, as things stand, the reprieve would only last until 2 April when the Trump administration plans to impose reciprocal tariffs - on top of the 25% charges that came into force on Tuesday. At the same time, Mr Trump is under intense pressure to relax his tariff regime permanently amid a backlash from US firms and financial market investors who fear it is self defeating. Read more from Sky News:Millions in compensation expected over Bank IT failuresPoundland up for sale as budget tax hikes loom A closely-watched forecast has even suggested that the threats of a trade war were enough to push the US economy into recession before Mr Trump took office. The dollar has sunk in value and US government borrowing costs have risen on the back of the turmoil. US stock markets were also feeling the pressure again with the tech-heavy Nasdaq on course to fall by more than 3% on the day. It is widely expected that the European Union will be next to face tariffs - possibly from 2 April - after Mr Trump threatened action \"very soon\" just last week. Commenting on the threat to the eurozone from such a move, the president of the European Central Bank Christine Lagarde said on Thursday: \"Just the threat of those tariff increases and potential retaliations are putting a brake on - on investment, on consumption decisions, on employment, hiring, all the rest of it.\" While Mr Trump has not issued a specific threat against the UK, her counterpart at the Bank of England Andrew Bailey told a committee of MPs on Wednesday that the US should work \"multi-laterally\" rather than bilaterally to resolve its disputes."
    },
    {
        "title": "PizzaExpress shareholders to inject fresh dough into chain",
        "description": "Shareholders in PizzaExpress are preparing to inject tens of millions of pounds into its parent company to help secure a refinancing of its debt amid tough trading in Britain&#8217;s casual dining sector.",
        "url": "https://news.sky.com/story/pizzaexpress-shareholders-to-inject-fresh-dough-into-chain-13322808",
        "image_url": "https://e3.365dm.com/20/08/1920x1080/skynews-pizza-express-restaurant_5057768.jpg?20200804102544",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-06 15:06:00",
        "Headline": "Bain Capital Special Situations is among the shareholders in Wheel Topco, PizzaExpress's parent company, to help secure a refinancing of its balance sheet, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Shareholders in PizzaExpress are preparing to inject tens of millions of pounds into its parent company to help secure a refinancing of its debt amid tough trading in Britain’s casual dining sector. Sky News understands that Bain Capital Special Situations, which is understood to be the largest shareholder in Wheel Topco, is expected to stump up in the region of £30m as part of a refinancing of the company's balance sheet. City sources said on Thursday that a deal had yet to be finalised, and that the figures were subject to further negotiations. Money latest: Why are there no bananas in Tesco? The arm of Bain Capital, one of the world's biggest buyout firms, and Cyrus Capital Partners were part of a group of bondholders which took control of PizzaExpress following a financial restructuring. Last autumn, Sky News revealed that Wheel Topco was lining up bankers from PJT Partners to advise on the refinancing. PizzaExpress trades from roughly 350 sites in the UK and Ireland, and is one of Britain's most prominent restaurant chains. \n                  Trump pauses tariffs on most goods from Mexico and some from Canada\n                 \n                  Money blog: Trump rows back on some tariffs with postponement after US stocks endure heavy losses\n                 \n                  Millions in compensation expected for customers hit by Barclays outages\n                 The parent company has a £335m bond which matures in July 2026. Its refinancing talks come 18 months after PizzaExpress explored a takeover bid for The Restaurant Group, which counts Wagamama as its main asset. Read more from Sky News:Millions in compensation expected over bank IT failuresPoundland up for sale as budget tax hikes loom The company ultimately declined to bid, citing market conditions. PizzaExpress is chaired by Allan Leighton, one of Britain's most prominent businessmen and recently installed as chairman of Asda. A spokesman for Bain Capital Special Situations declined to comment."
    },
    {
        "title": "Millions in compensation expected for customers hit by Barclays outages",
        "description": "Barclays is expected to pay millions of pounds in compensation for recent IT outages which prevented customers from banking, a new letter to MPs has revealed.",
        "url": "https://news.sky.com/story/millions-in-compensation-expected-for-those-impacted-by-barclays-outages-13322482",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-barclays-app-file_6816172.jpg?20250201120435",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-03-06 06:38:00",
        "Headline": "Barclays is expected to pay the largest amount of compensation of any bank in the last two years. More reports of fraud are expected, the bank said, as it saw \"some instances\" where people attempted to take advantage of the incident. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Barclays is expected to pay millions of pounds in compensation for recent IT outages which prevented customers from banking, a new letter to MPs has revealed. The lender said it expects to pay out between £5m and £7.5m to customers for \"inconvenience or distress\" caused by days of disruption earlier this year, according to the influential Treasury Committee of MPs. The glitch began at the end of January and lasted several days. It coincided with payday for many and the deadline for self-assessment tax returns. Money blog: Tourists banned from driving in Spanish town This was caused by \"severe degradation\" in the performance of their mainframe computer, a large computer used by big organisations for bulk data processing. It resulted in the failure of 56% of Barclays' online payments, the bank told the committee. To solve the problem, a software fix from Barclays' mainframe provider is \"undergoing comprehensive testing\". Up to £12.5m, however, could be paid when all outages over the last two years from January 2023 to February 2025 are factored in, the committee said. \n                  Muslim charities still being debanked despite Farage furore \n                 \n                  Former City minister Afolami to return to HSBC in board role\n                 \n                  Barclays in talks with Brookfield about deal for UK payments division\n                 It would be by far the biggest amount of compensation paid by a firm in the last two years. Bank of Ireland would be the second, having issued £350,000 in compensation. And customers don't necessarily have to do anything to get their money. Some will get an automated refund, while others will be contacted for additional information.  Outstanding unknowns But Barclays was unable to say how many customers were hit by the disturbance, adding it was working to identify all those affected. Higher instances of fraud are expected as a result of the outage, Barclays told the committee chair Meg Hillier. Reporting incidents can take a few weeks, it said. It has already seen \"some instances\" where people attempted to take advantage of the incident. The Treasury Committee is investigating IT problems at all banks that prevent or limit customer access. A recurring problem The nine top banks and building societies written to by the Treasury Committee had a total of 803 hours of unplanned outages over the last two years, they said, equivalent to 33 days. These hours were comprised of 158 individual IT failures. As a result, the bank with the longest outages was NatWest with 194 hours of failures. The second longest period of services being down was at HSBC which logged 176 hours of disruption. Why does this keep happening? As part of their inquiries, banks said common reasons for IT failures included problems with third-party suppliers, disruption caused by systems changes and internal software malfunctions. The responses were received before last Friday's online banking failures, which caused difficulties for millions on payday, but the committee said it would request data on the latest disruption. Barclays' recent payday failure is also not captured in the numbers."
    },
    {
        "title": "Poundland up for sale as budget tax hike looms",
        "description": "Poundland, the discount retail chain, appears on course to be sold as its owner rues an \"increasingly challenging\" retail landscape in the UK.",
        "url": "https://news.sky.com/story/poundland-up-for-sale-as-budget-tax-hike-looms-13322725",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-poundland-shop_6283516.jpg?20230913142842",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-03-06 12:36:00",
        "Headline": "The discount retailer has been battling weak sales and rising costs and says it has attracted bid interest from a number of parties.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Poundland, the discount retail chain, appears on course to be sold as its owner rues an \"increasingly challenging\" retail landscape in the UK. Poland-based Pepco Group said on Wednesday that it was examining all options for the 825-strong chain, including a sale. But the company later told the Reuters news agency that it had received interest from potential buyers. Money latest: Why are there no bananas in Tesco? Sky News revealed in January that Pepco had drafted in City advisers to explore options for the Poundland business amid strong competition in a crowded bargain space and weak demand for its product ranges. Last year, the British discounter - which employs roughly 18,000 people - recorded €2bn (£1.7bn) of sales. In December, Pepco revealed a £642m (€775m) charge to Poundland citing several major headwinds including rising costs. \n                  Trump pauses tariffs on most goods from Mexico and some from Canada\n                 \n                  PizzaExpress shareholders to inject fresh dough into chain\n                 \n                  Money blog: Trump rows back on some tariffs with postponement after US stocks endure heavy losses\n                 The company said it was being made worse by the government's hikes to employer national insurance contributions from April. Chief executive Stephan Borchert told Reuters: \"There are definitely interested parties for this business.\" He declined to comment on the type of interest, what stage talks had reached, or what Poundland was worth, but said he was confident its future would be decided by September this year. The company told investors that the wider business across central and eastern Europe, under the Pepco and Dealz brands, was moving away from fast-moving consumer goods to focus on its higher-margin clothing and general merchandise proposition. Shares in Pepco Group rose by up to 7.2%."
    },
    {
        "title": "Stamp duty rules are changing from April - here's what you need to know",
        "description": "From 1 April, changes will be made to stamp duty, meaning more first-time buyers will be forced to pay it and other home movers face a higher bill.",
        "url": "https://news.sky.com/story/stamp-duty-rules-are-changing-from-april-heres-what-you-need-to-know-13322702",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-for-sale-house-houses_6823857.jpg?20250209124915",
        "type": "Business",
        "Author": "Jess Sharp",
        "Date Published": "2025-03-06 12:12:00",
        "Headline": "Changes to stamp duty are coming in soon - which means you could end up paying thousands of pounds more. Here we break down what the changes are and what they will mean for home buyers. ",
        "Content": "\n          Money live reporter\n              @JournoJess97\n From 1 April, changes will be made to stamp duty, meaning more first-time buyers will be forced to pay it and other home movers face a higher bill. So what is it, what's changing and what impact will it have? Here's everything you need to know. Read all the latest Money news here What is stamp duty?  Put simply, it is a tax you pay when you purchase a property over a certain price in England and Northern Ireland. The amount you pay is calculated based on the purchase price of your home. When you start paying stamp duty varies depending on whether you are a first-time buyer or not. \n                  Low-paid jobs at risk from Labour's tax increases on businesses\n                 \n                  Transport Secretary Louise Haigh downplays risk of empty shelves if farmers strike over inheritance tax\n                 \n                  Budget 2024: Minister refuses to rule out tax rises for people earning more than £100,000\n                 How much is it at the moment?  Stamp duty is currently operating at reduced rates - the last Tory government temporarily implemented this and it has always been due to end. The lower amount means buyers do not have to pay any stamp duty on the first £250,000 of the purchase price - meaning all homes bought under this amount are exempt. They then have to pay 5% on the portion of the property price between £250,001 and £925,000, and 10% on anything between £925,001 and £1.5m. Anything over that is charged at 12%. Here's an example: If you buy a house for £295,000. The stamp duty you owe will be calculated as follows: First-time buyers do not have to pay stamp duty on purchases up to £425,000, and then pay 5% on the portion of the price from £425,001 to £625,000. Anything over that is charged at the standard rates of stamp duty, as explained above. What is changing? From 1 April, the threshold at which first-time buyers start paying the tax will return to previous levels, dropping to £300,000 - meaning many more will be liable. The rate is then 5% on the portion of the house price from £300,001 to £500,000. There's no discount offered on the portion over £500,000. Here's an example: You are a first-time buyer and purchase a property for £500,000. The stamp duty you owe will be calculated as: The stamp duty threshold for all other buyers is also reverting back - the nil rate level will fall to £125,000 from £250,000. They will then have to pay 2% on the portion between £125,001 and £250,000 and 5% on anything between £250,001 and £925,000. This increases to 10% on the portion between £925,001 and £1.5m, and even further to 12% on the remaining amount. Here's an example: If you buy a house for £295,000. The stamp duty you owe will be calculated as follows: There is a tool you can use to work out the exact amount of stamp duty you will pay - you can find it here. Property website Rightmove's analysis found that 74,000 buyers are expected to miss the 31 March deadline - at a collective cost of £142m. What region will be the worst affected?  The impact of this change will be greatest in southern England, property website Zoopla found, with first-time buyers in London, the South East and the East of England hardest hit. The London boroughs of Camden, Hammersmith and Fulham, and Islington will see stamp duty increase by an average of £15,000. Just 5% of first-time buyers in northern England and the Midlands will be affected due to lower property prices. What about second homes?  If you are buying a second home, you will be charged an extra 5% on top of the standard stamp duty rates. The 5% surcharge also applies if your main home is abroad and your second home is in the UK, and if your second home is bought through a limited company. Can you add stamp duty to your mortgage?  Yes you can, but it's important to know that it could affect the loan-to-value ratio of your mortgage and incur interest charges."
    },
    {
        "title": "Train performance stats to be displayed at stations in new 'era of accountability'",
        "description": "Rail passengers in England are being shown how often trains are cancelled and delayed at each station in a new \"accountability drive\".",
        "url": "https://news.sky.com/story/train-performance-stats-to-be-displayed-at-stations-in-new-era-of-accountability-13322143",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-uk-train-station-delay_6847310.jpg?20250305181021",
        "type": "Business",
        "Author": "Faye Brown",
        "Date Published": "2025-03-06 00:01:00",
        "Headline": "The government hopes that in holding train operators to account, they will be encouraged to drive up efficiency and productivity - providing better value for money.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Rail passengers in England are being shown how often trains are cancelled and delayed at each station in a new \"accountability drive\". The data, broken down by operator, will go live at 1,700 stations on Thursday for the first time. Politics Live: Reform voters turn on Farage's friend Trump The performance stats will show the percentage of trains cancelled and how punctual trains are. They will be displayed at major stations through digital screens, while passengers at smaller stations will be able to scan a QR code to see the data online. Transport Secretary Heidi Alexander said the announcement \"marks the beginning of a new era of rail accountability\". \"These displays are a step towards rebuilding trust with passengers using our railways, as we continue to tackle the root causes of frustrating delays and cancellations,\" she added. The government hopes that in holding train operators to account, they will be encouraged to drive up efficiency and productivity - providing better value for money. In February, it was reported that rail reliability across Britain was at a record low, with the equivalent of more than one in 25 services cancelled in the year to 1 February. Analysis by the PA news agency found Ealing Broadway in west London was the major station with the worst reliability of services in the four weeks to the start of February. That was out of 77 stations with more than 10,000 scheduled services in that period. The equivalent of 7.9% of services at Ealing Broadway - which is used by Elizabeth Line and Great Western Railway trains - were cancelled. Elizabeth line stations make up seven of the 10 worst for cancellations, including Bond Street (7.4%), Farringdon (6.5%) and Paddington (5.6%). The other three stations are all on Merseyside's Merseyrail network, which has suffered problems with trains being unable to draw electricity from the third rail during wintry weather. Read more from Sky News:Tesla charging stations set on fireBoy shot dead near Tube station named Experts told Sky News that infrastructure problems are part of the reasons for delay and poor performance, as well as operational factors like driver availability and issues on trains themselves. Independent rail consultant William Barter said it was \"good\" that punctuality data will now be presented with respect to individual stations, rather than arrivals at destinations, as there is \"a tendency to pad timetables out with slack time immediately before the terminus\". \"This tends to make performance look good even though a train may have been late at every station until then,\" he said. Jacqueline Starr, chief executive of the Rail Delivery Group, which represents operators, said the transparency drive sends \"a clear message to customers the rail sector is committed to improving punctuality and to find solutions to make train services more reliable\". The decline in train reliability comes at a time of rising rail fares, which will go up again by 4.6% next week, while rail cards will also become more expensive. Labour pledged in its manifesto to nationalise passenger rail services, with the first coming into public ownership in May 2025. However, experts have previously told Sky News that the plan is unlikely to reduce fares, while ministers have admitted that the aim of nationalisation is to improve reliability rather than to reduce ticket costs."
    },
    {
        "title": "Chef on giving pizza to homeless and why you shouldn't throw away citrus peel",
        "description": "Every Thursday we interview chefs from around the UK, hearing about their cheap food hacks and more. Today we chat to chef Diego Jacquet, patron and chef at Zoilo and the Florencio pizzeria in London.",
        "url": "https://news.sky.com/story/chef-reveals-why-you-should-never-throw-away-citrus-peel-13322687",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-peel-cheap-eats_6847941.jpg?20250306115612",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-06 11:40:00",
        "Headline": "Chef Diego Jacquet sat down with the Money blog to talk about giving pizza to the homeless, his brine recipe, and why you should never throw away citrus peel.",
        "Content": "Every Thursday we interview chefs from around the UK, hearing about their cheap food hacks and more. Today we chat to chef Diego Jacquet, patron and chef at Zoilo and the Florencio pizzeria in London. My pet hate in restaurants is... when kitchen staff don't say \"backs\" or \"behind\" when passing by behind you. At the least it can result in having to re-do the dish you have just spent time doing, and at worst it can be very dangerous when operating with sharp knives and hot equipment. The biggest mistake I see in kitchens is... a lack of communication between front of house and kitchen. It is essential to communicate as much as possible. You absolutely need to be working as one team in order to provide good service for our guests. Read features like this and more in the award-winning Money blog My one piece of advice for an aspiring chef is... find a good kitchen, keep your head down, pay attention, focus, always be available, don't take feedback personally, and don't make your choices based on money. That's more than one piece of advice but I think it's all essential! With meat, such as poultry or pork, brine it before cooking it... to add flavour and make the meat more tender. To do so, put 1kg of water to 100g of salt into a saucepan (you may need to amend these quantities depending on how much meat you're brining, of course), put the meat into the saucepan, and bring to the boil. How big your piece of meat is will determine how long to brine it for - there is a lot of information you can find online to help with your particular piece of meat. My favourite cookbook is... White Heat by Marco Pierre White. It was the first time I saw a chef that looks like a rock star! For me, he paved the way with an age of new cookbooks and made cooking cool. I also like that it's part autobiography, part cookbook. \n                  Chef reveals his pet hate from customers and cheaper olive oil substitute\n                 \n                  Chef reveals the one thing you should never buy - and his favourite cheap substitutes\n                 \n                  Head chef shares his mince and tatties recipe and tip for preventing waste\n                 My go-to cheap eat at home is... crisp Spanish tortilla... Ingredients Put a frying pan on medium heat and add oil. Slice the onions and caramelise in the pan until golden brown. Beat the eggs in a bowl and then add the caramelised onions and your choice of flavoured crisps. Michelin-starred chefs pick favourite cheap restaurants across every part of UK - with famous burger chain making list Heat some oil in a non-stick pan. Add the egg mixture to the pan and leave to cook on a low heat for approximately 7-8 minutes. When the egg mixture is about two thirds set, slide it on to a plate and immediately flip the plate so the mixture lands back in the pan, cooked side up. Place the non-stick pan back on the low heat for another few minutes until it is cooked through. Season and serve on toast! I've cut costs for my restaurant by... buying things more often, rather than big purchases. This helps with our general cash flow in the business. My favourite cheap substitute is... ox tongue - it is very versatile and is great cold or even grilled! My tip for preventing waste is... citrus skin. Don't throw these away, just discard the white part using a sharp knife. Slice the skin thinly and then you can make candied citrus peel, or you can keep it in syrup. These can then be used in desserts or as a pretty decoration for cakes. You can even use them to garnish a fancy cocktail. I've given free meals... I usually give pizza away to those sleeping rough around our restaurant - it's the least I can do to help."
    },
    {
        "title": "Robert Jenrick says new sentencing guidelines have 'blatant bias against Christians and straight white men'",
        "description": "Shadow justice secretary Robert Jenrick has accused new sentencing guidelines of having \"blatant bias\" against Christians and straight white men.",
        "url": "https://news.sky.com/story/anger-over-two-tier-sentencing-as-justice-secretary-shabana-mahmood-rejects-new-guidelines-13322444",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-shabana-mahmood-justice_6756107.jpg?20250306031400",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-06 01:24:00",
        "Headline": "The chair of the body behind the sentencing reforms has defended the changes by saying a punishment tailored to individual offenders had the \"greatest likelihood\" of being effective.",
        "Content": "Shadow justice secretary Robert Jenrick has accused new sentencing guidelines of having \"blatant bias\" against Christians and straight white men. The Sentencing Council, which sets out recommendations to courts in England and Wales, is advising a pre-sentence report (PSR) \"will normally be considered necessary\" before sentencing a criminal from an ethnic, cultural or faith minority. Justice Secretary Shabana Mahmood has said she will be registering her \"displeasure\" and will be recommending the guidance is reversed - however, as the Sentencing Council is independent, she cannot order them to do so. Politics latest: Starmer notes 'turbulence' in UK leadership Mr Jenrick told Wilfred Frost on Sky News Breakfast it was evidence of \"two-tier justice\" and will be \"very corrosive to public trust and confidence in the criminal justice system\". \"To me, this seems like blatant bias, particularly against Christians, and against straight white men,\" he said. \"Either this was the policy of the justice secretary - she's changed her mind, but this was her policy - or she was asleep at the wheel.\" \n                  Man jailed for using drones to fly drugs and phones into UK prisons\n                 \n                  Prison officer who kissed inmate and sent 'sexualised' messages jailed\n                 \n                  Early release of hundreds of prisoners in Scotland begins\n                 He accused the council of setting rules which make \"a custodial sentence less likely for those from an ethnic minority, cultural minority, and/or faith minority community\". Read more: What are pre-sentence reports and the controversial changes?  A PSR assessment would also be expected for people from the transgender community and certain other groups, such as young adults aged 18 to 25, women and pregnant women. In setting out the changes, Lord Justice William Davis said the reforms, set to come into play from April, reflect evidence of disparities in sentencing outcomes, disadvantages faced within the criminal justice system and complexities in the circumstances of individual offenders. The chair of the Sentencing Council for England and Wales said: \"PSRs provide the court with information about the offender; they are not an indication of sentence. Sentences are decided by the independent judiciary\". He added that a punishment tailored to the offender had the \"greatest likelihood\" of being effective. According to the most recent government statistics, since 2018 white defendants are more likely to have a shorter jail sentence than any other ethnic group. Read more from Sky News:Released prisoners left homelessPrisoners fear being sent back to jailEarly release scheme Scotland begins The Sentencing Council is also advising judges and magistrates to consider rehabilitative sentences, or community sentences. It points out they can be more effective in reducing re-offending than a short term behind bars. Among the fresh guidance is also a recommendation for courts to \"avoid\" sending pregnant women or mothers of babies to prison.  Janey Starling, co-director of feminist campaign group Level Up called the changes a \"huge milestone\". Meanwhile Liz Forrester, from No Births Behind Bars, said it finally recognises the \"deadly impact\" of prison on babies and pregnant women. Pregnancy, childbirth and post-natal care had already been introduced in April 2024 as a new mitigating factor in England and Wales."
    },
    {
        "title": "A UK-conducted fatal drone strike confirmed for first time since Starmer became PM",
        "description": "A fatal drone strike carried out by the UK has been publicly acknowledged by the government for the first time since Labour came to power.",
        "url": "https://news.sky.com/story/a-uk-conducted-fatal-drone-strike-confirmed-for-first-time-since-starmer-became-pm-13322751",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-reaper-drone-isis_6848065.jpg?20250306140619",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-03-06 13:20:00",
        "Headline": "The government has said a Reaper drone killed a \"known Daesh terrorist\" in the Aleppo region of Syria last week. While the decision would not have been signed off by Sir Keir Starmer, he agreed to the rules of engagement.",
        "Content": "\n          Political reporter\n       A fatal drone strike carried out by the UK has been publicly acknowledged by the government for the first time since Labour came to power. The precision strike in Syria took place on Tuesday 25 February targeting a \"known Daesh terrorist\". Daesh is another name for the Islamic State, often shortened to ISIS. There have been concerns about the terrorist group gaining ground in the wake of the revolution in Syria. Politics latest: Starmer sends warning to Putin According to a Ministry of Defence statement today, the terrorist was tracked across the Aleppo region of Syria by a Reaper drone. The drone's remote crew \"kept a close watch\" on the ISIS member until they were \"alone on foot\", and could be \"struck with minimal risk to any civilians\". The drone then \"successfully targeted the terrorist using the Reaper's Hellfire missile system\". \n                  The return of ISIS: A global threat we can't ignore?\n                 \n                  US says it has killed Islamic State leader Abu Yusif in Syria airstrike\n                 \n                  Counter-terror police on high alert for jihadi attacks from potential British ISIS supporters returning from Syria\n                 The UK mission to combat ISIS is known as Operation Shader, and was something that Sir Keir Starmer said should continue when he became prime minister. However, the operational decisions are made by the military and Number 10 would not have signed off on the strike. The UK last confirmed it had launched a strike in Syria on 18 June 2024, when Rishi Sunak was prime minister. Read more:Trump says US killed 'many' ISIS terroristsUS allies halting anti-ISIS operations  Following the fall of Syrian leader Bashar al Assad, the United States confirmed it had killed the leader of ISIS in the region, Abu Yusif. ISIS controlled swathes of Syria and neighbouring Iraq from 2014, with millions of people living under the Islamist group at the peak of its powers. The militants enforced an extremist interpretation of Islamic law and carried out mass killings of minority groups. 👉Listen to The World With Richard Engel And Yalda Hakim on your podcast app👈 However, they were pushed back by a coalition of forces that included the UK and US and had lost control of all of their Middle East territory by 2019. In December, after Assad's regime was defeated by a fighting force led by Ahmad al Sharaa, he has made efforts to bring together many of Syria's warring factions. But in the disorder created by years of fighting, there are fears that ISIS fighters will be able to regroup. They have continued insurgency efforts in parts of Syria, Iraq, and Afghanistan, while their affiliates still have a presence in parts of Africa."
    },
    {
        "title": "Rachel Reeves says welfare system 'letting people down' ahead of expected cuts",
        "description": "Rachel Reeves has said the welfare system is \"letting down taxpayers\", while she again committed to reaching 2.5% in defence spending by 2027 due to the \"enormity of the situation\" facing European security.",
        "url": "https://news.sky.com/story/rachel-reeves-says-welfare-system-letting-people-down-ahead-of-expected-cuts-13322820",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rachel-reeves-electoral-dysfunction_6847952.jpg?20250306120803",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-06 15:25:00",
        "Headline": "The chancellor is expected to make billions of pounds in spending cuts in her spring statement in order to keep to her self-imposed fiscal rules.",
        "Content": " Rachel Reeves has said the welfare system is \"letting down taxpayers\", while she again committed to reaching 2.5% in defence spending by 2027 due to the \"enormity of the situation\" facing European security. The chancellor told Sky's political editor Beth Rigby on the Electoral Dysfunction podcast, out on Friday, that there needs to be \"better value for money\" for what people pay in taxes. Politics Live: PM issues warning over Putin and peace deal It comes ahead of the spring statement on 26 March, in which Ms Reeves is expected to make billions of pounds of cuts including to the benefits bill. The chancellor said there needs to be welfare reform because the system is \"letting down taxpayers because it's costing too much\". \"It's letting down our economy because there's too many people trapped on out-of-work benefits, and it's letting down the people who are recipients of benefits because they are trapped on benefits rather than actively supported back into work,\" she said. Pressed that she has to find savings to meet her self-imposed fiscal rules, Ms Reeves said she was \"not going to provide a running commentary\" on what could be in the spring statement but insisted the reforms were necessary regardless of what could be in the upcoming forecast from the Office for Budget Responsibility (OBR). \n                  Politics latest: Nigel Farage hits back at one of his own Reform MPs\n                 \n                  Robert Jenrick says new sentencing guidelines have 'blatant bias against Christians and straight white men'\n                 \n                  A UK-conducted fatal drone strike confirmed for first time since Starmer became PM\n                 She said there are a million young people not in education, employment or training and \"the majority of those people should be working\". \"Under the plans that we're going to bring in, they will be working and crucially, they will be given support to get back to work,\" she added. 👉 Click here to follow Electoral Dysfunction wherever you get your podcasts 👈 The spring statement will be in response to the latest updates from the OBR, which is required to do a forecast twice a year on the economy and public finances. The chancellor previously committed to just one single major fiscal event each year to give stability and certainty on upcoming tax changes, unlike previous governments that typically delivered budgets in the spring and autumn. However, the poor economic climate since her October 2024 budget is forcing her hand, with inflation hitting a 10-month high of 3% in January, a sharp rise in government bond yields, and growth has not been as high as expected. This has eaten into the £10bn fiscal headroom Ms Reeves was previously estimated to have - a figure the Treasury wants to maintain. Ms Reeves insisted her spring statement would not be another package of tax rises, saying the October budget \"was a sort of a once in a generation, once in a parliament type budget\". Read More:Poundland up for sale as budget tax hike loomsJobcentre reforms at heart of Labour's plan to 'get Britain working'  She added that Labour committed in its manifesto not to increase income tax, VAT or national insurance and \"we're not going to renege on that\". 'World has changed' Elsewhere in the podcast, Ms Reeves defended the government's decision to cut foreign aid to fund an increase in defence spending. Labour's manifesto committed to restoring development spending at the level of 0.7% of gross national income \"as soon as fiscal circumstances allow\". However around £6bn per year will now be taken out of the aid budget and transferred over to pay for defence. That amounts to a reduction in aid spending from 0.5% of GDP to 0.3%. Ms Reeves said the decision had to be made to fund another manifesto pledge - which was to raise defence spending to 2.5% of GPD, up from the 2.3% it is at now. \"The decision was made not just to get to 2.5%, but to get to 2.5% in 2027,\" she said. \"I think that was the most significant bit, really of the announcement. \"Everyone knew we were going to get to 2.5% in this parliament. That was a commitment from us in our manifesto that we would get there, but we're actually going to get there in two years because we recognise that the world has changed the enormity of the situation.\" Listen to the full interview with Rachel Reeves on the Electoral Dysfunction podcast, out Friday at 5am."
    },
    {
        "title": "What are pre-sentence reports and what are the controversial changes to them?",
        "description": "A row over pre-sentence reports has erupted after guidelines were changed to recommend them for criminals from an ethnic, cultural or faith minority.",
        "url": "https://news.sky.com/story/what-are-pre-sentence-reports-and-the-controversial-changes-13322644",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-courtroom-ashna-hurynag_6711396.jpg?20241009123913",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-06 10:48:00",
        "Headline": "Guidelines for pre-sentence reports have changed, kicking off an argument over which criminals should get one and who should not.",
        "Content": "\n          Political reporter\n              @alixculbertson\n A row over pre-sentence reports has erupted after guidelines were changed to recommend them for criminals from an ethnic, cultural or faith minority. The Sentencing Council has set out the recommendations to courts in England and Wales, but Justice Secretary Shabana Mahmood said she does not agree with them and wants them to be reversed. However, the council is independent, so she cannot order them to change the guidance. Politics latest: Change the law to stop major scandal, Jenrick says Conservative shadow justice secretary Robert Jenrick called it \"two-tier justice\" and said there was \"blatant bias\" against Christians and straight white men as they are not on the list for a pre-sentencing report. He also accused Ms Mahmood of knowing about the policy and either changing her mind or being \"asleep at the wheel\". Sky News looks at what pre-sentence reports are and the recommended changes. \n                  Politics latest: Nigel Farage hits back at one of his own Reform MPs\n                 \n                  Robert Jenrick says new sentencing guidelines have 'blatant bias against Christians and straight white men'\n                 \n                  A UK-conducted fatal drone strike confirmed for first time since Starmer became PM\n                  What are pre-sentence reports? When someone is convicted of a crime the court can use a pre-sentence report (PSR) to help them determine a custodial sentence or community order. A PSR must be obtained unless the court considers it unnecessary. A defence lawyer can also request a report if they believe there are significant mitigating circumstances. A probation officer from the Probation Service, an impartial government body, prepares and writes up the report following an interview with the defendant. What is included in a PSR? A PSR will include a defendant's personal history, including their age, education, family background, employment status, living conditions, mental health concerns and any drug or alcohol dependencies. Any previous criminal convictions will also be included, as well as if the defendant is currently subject to probation intervention through a community order or suspended sentence, or licence. Their current or previous compliance with the Probation Service will be revealed. A detailed account of the offence and any aggravating or mitigating circumstances must be included. Read more:Released prisoners left homelessPrisoners fear being sent back to jail The report will consider the risk a defendant poses to the victim, children, the public and themselves. An assessment of the defendant's mental health can be included and any substance misuse history so the court can better understand their circumstances. A defendant's thought process while committing the crime is vital for the report as it helps the court demonstrate the level of remorse, culpability and motivation to comply with the Probation Services. The final part of the report consists of a recommended sentence, which takes into account sentence guidelines as well as the individual's needs. Why wouldn't a PSR be obtained? A judge can decide a report is unnecessary in certain cases, especially if the offence is minor, the offender has a clean criminal record or the circumstances make the potential sentence clear. Do judges always accept PSR sentencing advice? They do not have to adhere to the PSR's recommended sentence, however, a magistrates' court nearly always accepts the recommendation. It is quite common for Crown Court judges to pass a completely different sentence.  What are the guideline changes? The Sentencing Council changed its guidelines following public consultation on 5 March, to come into effect on 1 April. It says a PSR should \"normally be considered\" if the offender belongs to one, or more, of these groups: • Is at risk of first custodial sentence and/or at risk of a custodial sentence of two years or less• Is a young adult (18-25 years)• Is female• Is from an ethnic minority, cultural minority, and/or faith minority• Is pregnant or post-natal• Is a sole or primary carer for dependent relatives• Has disclosed they are transgender• Has or may have addiction issues• Has or may have a serious chronic medical condition, physical disability, mental ill health, learning disabilities or brain injury• The offender is considered to be a victim of domestic abuse, physical/sexual abuse, violent/threatening behaviour, coercive/controlling behaviour, other abuse, modern slavery, coercion, grooming, intimidation or exploitation. The council says the list is non-exhaustive and PSR can be necessary if the defendant is not in one of those categories"
    },
    {
        "title": "It's a critical time for the MoD - so who is Defence Secretary John Healey?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/its-a-critical-time-for-the-mod-so-who-is-defence-secretary-john-healey-13322842",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/2372503060323084407_6847936.jpg?20250306114841",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-06 16:19:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 After just eight months in his role, Defence Secretary John Healey is dealing with one of the most challenging in-trays in the cabinet.  He is meeting US counterpart Pete Hegseth in Washington on Thursday, as he works to bridge the gap on how to reach a Ukraine peace deal. On today's podcast, Niall Paterson talks to ex-armed forces minister James Heappey who worked with Mr Healey when he was in opposition, and to Malcolm Chalmers who focuses on UK defence and security at the thinktank RUSI about the challenges the defence secretary faces. Producer: Soila ApparicioAssistant Producer: Millie GibsonEditor: Wendy Parker "
    },
    {
        "title": "Train performance stats to be displayed at stations in new 'era of accountability'",
        "description": "Rail passengers in England are being shown how often trains are cancelled and delayed at each station in a new \"accountability drive\".",
        "url": "https://news.sky.com/story/train-performance-stats-to-be-displayed-at-stations-in-new-era-of-accountability-13322143",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-uk-train-station-delay_6847310.jpg?20250305181021",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-03-06 00:01:00",
        "Headline": "The government hopes that in holding train operators to account, they will be encouraged to drive up efficiency and productivity - providing better value for money.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Rail passengers in England are being shown how often trains are cancelled and delayed at each station in a new \"accountability drive\". The data, broken down by operator, will go live at 1,700 stations on Thursday for the first time. Politics Live: Reform voters turn on Farage's friend Trump The performance stats will show the percentage of trains cancelled and how punctual trains are. They will be displayed at major stations through digital screens, while passengers at smaller stations will be able to scan a QR code to see the data online. Transport Secretary Heidi Alexander said the announcement \"marks the beginning of a new era of rail accountability\". \"These displays are a step towards rebuilding trust with passengers using our railways, as we continue to tackle the root causes of frustrating delays and cancellations,\" she added. The government hopes that in holding train operators to account, they will be encouraged to drive up efficiency and productivity - providing better value for money. In February, it was reported that rail reliability across Britain was at a record low, with the equivalent of more than one in 25 services cancelled in the year to 1 February. Analysis by the PA news agency found Ealing Broadway in west London was the major station with the worst reliability of services in the four weeks to the start of February. That was out of 77 stations with more than 10,000 scheduled services in that period. The equivalent of 7.9% of services at Ealing Broadway - which is used by Elizabeth Line and Great Western Railway trains - were cancelled. Elizabeth line stations make up seven of the 10 worst for cancellations, including Bond Street (7.4%), Farringdon (6.5%) and Paddington (5.6%). The other three stations are all on Merseyside's Merseyrail network, which has suffered problems with trains being unable to draw electricity from the third rail during wintry weather. Read more from Sky News:Tesla charging stations set on fireBoy shot dead near Tube station named Experts told Sky News that infrastructure problems are part of the reasons for delay and poor performance, as well as operational factors like driver availability and issues on trains themselves. Independent rail consultant William Barter said it was \"good\" that punctuality data will now be presented with respect to individual stations, rather than arrivals at destinations, as there is \"a tendency to pad timetables out with slack time immediately before the terminus\". \"This tends to make performance look good even though a train may have been late at every station until then,\" he said. Jacqueline Starr, chief executive of the Rail Delivery Group, which represents operators, said the transparency drive sends \"a clear message to customers the rail sector is committed to improving punctuality and to find solutions to make train services more reliable\". The decline in train reliability comes at a time of rising rail fares, which will go up again by 4.6% next week, while rail cards will also become more expensive. Labour pledged in its manifesto to nationalise passenger rail services, with the first coming into public ownership in May 2025. However, experts have previously told Sky News that the plan is unlikely to reduce fares, while ministers have admitted that the aim of nationalisation is to improve reliability rather than to reduce ticket costs."
    },
    {
        "title": "Fire alarm in the classroom",
        "description": "<strong><a href='https://podfollow.com/politics-at-jack-and-sams'>👉Listen to Politics At Jack And Sam's on your podcast app👈</a></strong>",
        "url": "https://news.sky.com/story/fire-alarm-in-the-classroom-13322470",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-pjas-politics-at-jack-and-sams_6709400.png?20250306172841",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-06 05:52:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics At Jack And Sam's on your podcast app👈 Sky News' deputy political editor Sam Coates and Politico's Anne McElvoy have their guide to the day ahead in British politics.  As Matt Wrack, a former hard-left firefighter is endorsed as the the next leader of one of the two main teaching unions, Sam and Anne discuss the fallout for the government. Mr Wrack, who is the preferred candidate for the NASUWT is a former general secretary of the fire brigade's union, but he has no professional educational background. They also discuss the ongoing conversations about defence spending and how Europe will protect itself as both Rachel Reeves and Sir Keir Starmer spend their day on defence visits. Plus, are there plans to remove President Zelenskyy from office? Anne has been speaking to members of the Ukrainian government. You can send us a WhatsApp on 07511 867 633 or email us: jackandsam@sky.uk"
    },
    {
        "title": "Athena lander does not appear to be standing upright on moon",
        "description": "A privately built spacecraft sent to the moon does not appear to be upright on the surface, says the US company that operates it.",
        "url": "https://news.sky.com/story/athena-lander-does-not-appear-to-be-standing-upright-on-moon-13322998",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-space-moon-nasa-athena_6848400.jpg?20250306202846",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-03-06 20:20:00",
        "Headline": "The spacecraft, of Intuitive Machines, has landed on the moon with the aim of finding water.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  A privately built spacecraft sent to the moon does not appear to be upright on the surface, says the US company that operates it. The Intuitive Machines lander, called Athena, seems to have survived the perilous descent in a game-changing mission to find water. It slowed from more than 4,000mph to touch down on the Mons Mouton, a ridge just 100 miles from the lunar south pole. But Intuitive Machines chief executive Steve Altemus said at a news conference: \"We don't believe we're in the correct attitude on the surface of the moon, yet again.\" Last year, an Intuitive Machines spacecraft toppled over on landing after tripping over on a rock. Although it responded to commands sent by mission control, it failed to send back images immediately after landing, as expected. Shares in the company tumbled while engineers tried to establish full communication. \n                  Second-ever privately funded space craft touches down on moon\n                 \n                  Katy Perry set to travel to space as part of all-female mission\n                 \n                  Odin probe blasts off on SpaceX rocket to survey asteroid for possible mining mission\n                 The south pole region is the destination for NASA astronauts due to land on the surface in just two years' time. But Athena's descent on to a rugged terrain, sometimes out of communication with listening stations on Earth, underlines the risks they will face. If Athena is able to power up its systems and operate normally, it should release the first privately built robotic rover on to the lunar surface. As it trundles across the terrain, it will build a 3D map and test the first high-speed mobile communications network on the moon. The search for water But the mission's main purpose is to find water. Athena has a drill to take samples a metre below the surface. And it will release a small 'hopper' that will bounce into a deep crater that is permanently in shadow, where there could be ice. Professor Katherine Joy, a planetary geologist at the University of Manchester who is advising the NASA Artemis mission, said orbiting spacecraft have spotted signs of water in the craters. But that needs to be confirmed on the ground. Read more from Sky News:Denmark postal service to stop delivering lettersPope Francis heard again in new messageTriple killer convicted of raping ex-girlfriend She told Sky News: \"These craters are incredibly cold, down to about -230C (-382F). Ice could be maintained there for thousands, millions and maybe even billions of years. \"So there may be quite a lot of ice present. \"It would mean that we could mine these deposits to convert into water to drink, to make oxygen to breathe, and even create rocket fuel.\""
    },
    {
        "title": "Elgol dinosaur fossil found in 1973 finally extracted from base of cliff on Isle of Skye",
        "description": "A Jurassic dinosaur fossil that was first spotted more than 50 years ago has been extracted from the base of a cliff on Skye and formally identified.",
        "url": "https://news.sky.com/story/elgol-dinosaur-fossil-found-in-1973-finally-extracted-from-base-of-cliff-on-isle-of-skye-13322588",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-dinosaur-dinosaur-fossil_6847793.jpg?20250306093755",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-06 09:31:00",
        "Headline": "Analysis of the bone structure indicates the Elgol dinosaur, which would have been roughly the size of a pony, was at least eight years old. It means the earliest recorded dinosaur find in Scotland has now been confirmed and fully described.",
        "Content": "A Jurassic dinosaur fossil that was first spotted more than 50 years ago has been extracted from the base of a cliff on Skye and formally identified. The fossil was discovered near to Elgol in 1973 and is Scotland's earliest recorded dinosaur find. National Museums Scotland (NMS) said it remained uncollected until a team led by Dr Elsa Panciroli returned in 2018. Known as the Elgol dinosaur, the fossil is preserved in fragments, but experts have identified part of the spine, ribs and hipbones - making it the most complete dinosaur skeleton found to date in Scotland. Bone analysis has led researchers to believe it is an ornithopod dinosaur, a group which includes notable later dinosaurs such as Iguanodon, Parasaurolophus and Edmontosaurus. It is believed to date from around 166 million years ago, in the Middle Jurassic, making it one of the oldest known ornithopod body fossils, from a group of dinosaurs that became far more prominent in the later Cretaceous period. Dinosaur finds are rare in Scotland and much of the rock that is exposed at the surface across the country is not from the period when the animals ruled the earth - the Triassic, Jurassic and Cretaceous periods, jointly known as the Mesozoic era. Dinosaur finds are more common in southern England where more of the exposed rock is geologically newer. \n                  Hundreds of dinosaur footprints discovered in Oxfordshire\n                 \n                  Tyrannosaurus rex could have been even bigger than previously thought, study suggests\n                 \n                  Nearly complete dinosaur fossil sells for record £34m\n                 Analysis of the bone structure indicates the Elgol dinosaur, which would have been roughly the size of a pony, was at least eight years old. The new description of the dinosaur is published in the Earth and Environmental Science Transactions of the Royal Society of Edinburgh. Lead author Dr Panciroli, Natural Environment Research Council (NERC) independent research fellow at NMS, said: \"This was a really challenging extraction. \"In fact, we'd previously felt it was too difficult to collect the fossil, but I thought it was really important to study it. \"I was able to persuade the team to give it a try. It took a lot of hard work from a lot of people, but we did it: finally we can confirm and publish Scotland's first recorded and most complete dinosaur, and that makes it all worthwhile.\" Read more from Sky News:Hundreds of dinosaur footprints discovered in OxfordshireT. rex 'could have been even bigger than previously thought' The excavation was made possible with the support of a specialist team from Research Casting International, based in Canada, while a crew from Elgol's Bella Jane Boat Trips piloted the rigid inflatable boat and dinghy to the shore at the foot of the cliff, where the specimen was loaded and taken back to port. Other Jurassic discoveries from Skye include descriptions of adult and juvenile mammals of the same species, Krusatodon, which revealed the animals grew more slowly than the mammals of today, and the world's largest Jurassic pterosaur (flying reptile) fossil, Dearc sgiathanach. Hundreds of dinosaur tracks have also been discovered across Skye in recent years. Dr Stig Walsh, from NMS, said: \"This is a wonderful addition to the rapidly growing set of Jurassic finds from the Isle of Skye which are enabling us to learn more and more about the rich ecosystem of the time. \"We've known there were dinosaurs there for a while, most obviously from the famous footprints at An Corran, Brother's Point and Duntulm and from individual bones, but it's exciting to see a more complete, if still partial, skeleton. \"We're delighted to add it to the other amazing finds now in the national collection.\" The earliest scientifically described dinosaur find in the UK was in Oxfordshire in the mid to late 17th century - a now-lost piece of bone from the Megalosaurus. But it wasn't until the early 19th century that after another find from the same animal in the same area, the Megalosaurus was the first dinosaur to be named, according to the Oxford Museum of Natural History."
    },
    {
        "title": "What is the difference between a cyclone, typhoon and hurricane? And why are storms given names?",
        "description": "Cyclones, typhoons, hurricanes: these extreme tropical storms often make headlines as they disrupt lives and leave&#160;devastation in their wake.",
        "url": "https://news.sky.com/story/what-is-the-difference-between-a-cyclone-typhoon-and-hurricane-and-why-are-storms-given-names-13322831",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-bomb-cyclone-pacific_6752914.jpg?20241120145521",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-06 15:53:00",
        "Headline": "More than 1,900 disasters have been attributed to tropical cyclones worldwide since 1970, resulting in more than 790,000 deaths. But what are they exactly, and is there a difference between cyclones, typhoons and hurricanes?",
        "Content": "Cyclones, typhoons, hurricanes: these extreme tropical storms often make headlines as they disrupt lives and leave devastation in their wake. But what is the difference between them, and what causes them? Plus - why are storms given names? What's the difference? Typhoons, cyclones and hurricanes are actually all technically the same thing: a tropical cyclone. They are just referred to by different names based on where they form. The term cyclone is used when the storms occur in the South Pacific and Indian Ocean. They are referred to as typhoons when they appear in the Northwest Pacific. And they are hurricanes when they appear in the North Atlantic, central North Pacific and eastern North Pacific. What is a tropical cyclone? A tropical cyclone is a rapidly rotating storm that begins over tropical oceans. It can vary in speed, size, and intensity. The term tropical cyclone is used once a storm reaches maximum sustained winds of 74mph or higher. They are measured by their winds, but they have other characteristics which can be severely damaging. These include: More than 1,900 disasters have been attributed to tropical cyclones worldwide since 1970, according to the World Meteorological Organisation, resulting in more than 790,000 deaths and $1.4trn of damages. What causes a tropical cyclone? They develop in tropical oceans at least 5 degree to 30 degree latitude north or south of the equator, where the sea temperature is at least 27C. They can of course be devastating if they reach land, but they are important on Earth for transferring heat and energy between the equator and the poles. The Met Office says the following conditions are needed for a tropical cyclone to form: Why are storms given names? Storms across the world are assigned names throughout the year to help make them easily identifiable for those affected by them. Weather forecasters such as the Met Office say it means there is consistency in messages through the media and the government, making the public better placed to protect themselves, their property and businesses. Every country is different, though many work together to name their storms for consistency, as they can hit multiple countries. In Europe, for example, the UK, Ireland and the Netherlands work together as the western storm naming group. Read more:What we know about cyclone nearing Australian coastVast 'megaberg' the size of Gloucestershire runs aground How are they named? In the UK, the Met Office issues a new list of names which runs from early September to late August the following year, to coincide with the start of autumn and the end of summer, which is when they see the likelihood of low-pressure systems and with that, storms. The list works its way down the alphabet - this year it started with Ashley, Bert, then Conall. Every storm naming group has its own methods of choosing names, but the Met Office says it takes into account suggestions from the public which are sent in via email to nameourstorms@metoffice.gov.uk or through its online form, plus suggestions from its Ireland and Netherlands counterparts, Met Eireann and KNMI. It says it has been choosing some of the more popular names from the public, as well as names which reflect diversity in the countries involved."
    },
    {
        "title": "Glastonbury 2025 line-up revealed ",
        "description": "The 1975 and Olivia Rodrigo will be among the stars headlining Glastonbury Festival this year.",
        "url": "https://news.sky.com/story/glastonbury-2025-line-up-revealed-13322509",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-matty-healy-1975-olivia-rodrigo_6847741.jpg?20250306083225",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-06 07:55:00",
        "Headline": "Matty Healy's 1975 will be headlining for the first time, having made their Glastonbury debut in 2014, while US pop sensation Olivia Rodrigo is set to make her Pyramid Stage debut to close out the festival.",
        "Content": " The 1975 and Olivia Rodrigo will be among the stars headlining Glastonbury Festival this year. Glastonbury organisers have revealed the line-up for this summer's event, taking place between 25 June and 29 June, after months of speculation. The 1975 will take to the iconic Pyramid Stage on Friday to headline, Neil Young will perform on Saturday and Olivia Rodrigo on Sunday. Other big names include British pop sensation Charli XCX, rapper Loyle Carner and electronic group The Prodigy. The announcement comes after Sir Rod Stewart was booked for the Sunday teatime legend slot and Young was confirmed as a headliner earlier this year. Young's announcement in January came amid some confusion, as he had days before told fans he was pulling out of the festival because the BBC's involvement was a \"corporate turn-off\". The Canadian singer-songwriter later said this decision was down to \"an error in the information I received\". Glastonbury, which takes place at Worthy Farm in Somerset in the summer, has worked closely with the BBC - its exclusive broadcast partner - since 1997. The 1975 will be headlining for the first time, having made their Glastonbury debut in 2014. The Cheshire pop band, known for hits such as Somebody Else and Chocolate, have regularly made headlines due to the antics of frontman Matty Healy. Last month, the band was found not liable after a Malaysian festival was closed in 2023 because Healy kissed a male bandmate on stage. The festival's organisers tried to sue the band for £2m, claiming they had received a \"pre-show written assurance\" that their performance would adhere to all laws in Malaysia, where homosexuality is a crime. Read more:Sabrina Carpenter's BRIT performance sparks Ofcom complaintsMalta's Eurovision entry censored over song's 'appropriateness' Healy was also handed a cease-and-desist letter by US rapper Azealia Banks in December after a heated exchange on X in which he suggested he would slap her. Fellow headliner Rodrigo, 22, first took to the Glastonbury's Other stage in 2022 after the release of her mega-successful debut album, Sour. The American pop star played a string of arena shows in the UK, Asia, the US and Australia last year as part of the tour for her second chart-topping album, Guts. Other highlights for this year's Glastonbury include Scottish rock band Biffy Clyro, Canadian singer-songwriter Alanis Morissette, US chart-topper Noah Kahan, English rock band Wolf Alice, British indie rockers Wet Leg and recently reformed US pop group Scissor Sisters. Entertainment reporter It’s one of the largest music festivals in the world, previously boasting headliners such as Sir Elton John, Stormzy and Sir Paul McCartney on its infamous Pyramid Stage. The announcement today, however, suggests organisers are steering away from having a main stage and looking to spread out the festival crowd across the site. Despite her recent big wins at the Brit Awards and Grammys, Charli XCX will bring her Brat set to the Other Stage on Saturday night, at the same time as Neil Young on the Pyramid Stage. Meanwhile, one of the fastest growing new artists of 2025, Doechii, will headline the West Holts stage on the same evening. Looking at listenership figures alone, it seems as though it’ll be a race to guarantee a spot to watch Charli XCX and Doechii, as their stages have a 70,000 and 35,000 capacity respectively.  Charli XCX boasts over 32 million monthly listeners on Spotify, Doechii has 39 million whilst their headliner competitor Neil Young has around 6 million listeners per month on the streaming platform. The 1975 and Olivia Rodrigo round out the headliners this year, with the latter becoming the second youngest headliner at Worthy Farm and the first to have released her debut single in the 2020s. With more to be announced, the Glastonbury line-up looks to please all generations attending, but the question is, will it be possible? Appetite for the iconic festival saw standard tickets sell out in 35 minutes in November. They cost £373.50 plus a £5 booking fee, up £18.50 from the price from the 2024 festival, and were sold exclusively through the See Tickets website. The date for the resale - where tickets not fully paid for are put back up for sale - is set for some time in spring. The headliners last summer on the iconic Pyramid Stage were Dua Lipa, SZA and Coldplay, who made history as the first act to headline the festival five times. 2026 is likely to be a year off for Glastonbury, with the festival traditionally taking place four out of every five years, and the fifth year reserved for rehabilitation of the land."
    },
    {
        "title": "King Charles reveals his favourite artists as he shares personal playlist",
        "description": "The King has shared his personal playlist of tracks that bring him joy &#8211; featuring everything from reggae and Afrobeats to contemporary pop hits.",
        "url": "https://news.sky.com/story/king-charles-reveals-his-favourite-artists-as-he-shares-personal-playlist-13322845",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-king-charles_6848212.jpg?20250306163224",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-06 16:26:00",
        "Headline": "A recent Brit Award winner, a Nigerian-American singer-songwriter and an Australian chart-topper all feature on the King's personal playlist.",
        "Content": "The King has shared his personal playlist of tracks that bring him joy – featuring everything from reggae and Afrobeats to contemporary pop hits. Bob Marley, Kylie Minogue, and Grace Jones all feature on the King's top tracks from across the Commonwealth, alongside the likes of Nigerian-American singer-songwriter Davido and recent Brit Award winner Raye. King Charles recorded his Apple Music radio show, named The King's Music Room, in his office at Buckingham Palace. The show is named after one of the state rooms at the royal residence, in which a baby Prince Charles was christened in 1948. The broadcast will feature the monarch sharing anecdotes about meeting some of the artists, and reveals his chosen songs formed the soundtrack to his life. The King also discusses the impact music has had on him, including how it helps spark happy memories and provide comfort in sad times. Announcing the one-off show - which Apple Music says also reveals Charles is a fan of \"1930s crooners\" - the King said: \"Throughout my life, music has meant a great deal to me. I know that is also the case for so many others. \"It has that remarkable ability to bring happy memories flooding back from the deepest recesses of our memory, to comfort us in times of sadness, and to take us to distant places. \"But perhaps, above all, it can lift our spirits to such a degree, and all the more so when it brings us together in celebration. In other words, it brings us joy.\" The King's Music Room will be broadcast on Apple Music 1 to mark Commonwealth Day on Monday, 10 March. In a new picture released to celebrate the collaboration, the King can be seen at his desk in the palace during the recording with an illuminated \"On Air\" sign next to him. More from Sky News:King pulls pints on brewery visitCharles and Camilla host celebs at Highgrove In 2021, Charles revealed songs by The Three Degrees, Diana Ross and Edith Piaf were among his favourites. The King is not the only royal to have opened up on his musical taste. The late Queen's favourite hits are said to have included Oklahoma from the Rodgers and Hammerstein musical of the same name, Anything You Can Do from Annie Get Your Gun and ukulele-playing George Formby's Leaning On A Lamp-Post, as revealed by her friends and family. While the Prince of Wales joined Prince George and Princess Charlotte at a Taylor Swift concert last year, and has said he listens to a \"bit of everything\"."
    },
    {
        "title": "Malta's Eurovision entry censored over song's 'appropriateness'",
        "description": "Malta's Eurovision entry has been ordered to change its song Kant - allegedly due to the likeness with the C-word.&#160;",
        "url": "https://news.sky.com/story/malta-told-to-change-eurovision-entry-over-songs-similarity-to-c-word-13322613",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-miriana-conte-malta_6847888.png?20250306110735",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-06 10:06:00",
        "Headline": "The song, performed by 24-year-old Miriana Conte, includes the lyric \"serving kant\" several times in its chorus. Kant means \"singing\" in Maltese - but its pronunciation is similar to the English swear word. ",
        "Content": "Malta's Eurovision entry has been ordered to change its song Kant - allegedly due to the likeness with the C-word.  The country's representative, 24-year-old Miriana Conte, wrote on Instagram: \"We've just been notified that @ebu_hq [the European Broadcasting Union] has decided against using the Maltese word Kant in our entry in the Eurovision Song Contest. \"While I'm shocked and disappointed, especially since we have less than a week to submit the song, I promise you this: the show will go on - Diva NOT down,\" she said. Kant means singing in Maltese but its pronunciation is similar to the C-word in English. Ms Conte also says \"serving kant\" several times in the chorus - a play on the phrase used in queer and drag culture meaning to be bold and extravagant in a positive way. The Times of Malta reported that the BBC had complained to the EBU about the song's appropriateness, but the corporation told Sky News it had no comment on the matter. Ms Conte told a Maltese television channel last month that the EBU accepted the song with its original title and lyrics. Read more from Sky News:Glastonbury 2025 line-up revealedArtist abandons plan to starve piglets to death Malta has never won the Eurovision but has finished as the runner-up twice - in 2002 and 2005. This year's song contest is being held in Basel, Switzerland between 13 and 17 May. In a statement to Sky News, the EBU said: \"All participating broadcasters have until 10 March to formally submit their entries for the 2025 Eurovision Song Contest. If a song is deemed unacceptable for any reason, broadcasters are given the opportunity to modify it, or select a new one, before the deadline as per the rules of the Contest.\""
    },
    {
        "title": "Elaine C Smith grazes cows on Glasgow Green to mark receiving city's highest honour",
        "description": "Comedian&#160;Elaine C Smith has grazed cattle on Glasgow Green - a right that comes with being awarded the&#160;Freedom of Glasgow.&#160;",
        "url": "https://news.sky.com/story/elaine-c-smith-grazes-cows-on-glasgow-green-to-mark-receiving-citys-highest-honour-13322756",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-elaine-c-smith-cows_6848111.jpg?20250306155051",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-06 13:36:00",
        "Headline": "The Rab C Nesbitt and Two Doors Down star has been given the city's highest honour - which also gives her the right to fish in the River Clyde and graze cattle on common ground. ",
        "Content": "Comedian Elaine C Smith has grazed cattle on Glasgow Green - a right that comes with being awarded the Freedom of Glasgow.  The city's highest honour, which she is one of the few women to receive, also allows her to fish in the River Clyde. The Rab C Nesbitt and Two Doors Down star said it was \"quite the honour\" to be granted the award in recognition of her contribution to the arts and her embodiment as an advocate for women's rights and values. The official civic reception will take place on Friday, on the eve of International Women's Day. Smith exercised some of her new rights by grazing cattle borrowed from Pollok Park on Glasgow Green on Thursday. She said: \"As a newly minted freeman of Glasgow, I must say, it's quite the honour. \"But let's be clear, while I may be a 'freeman' by title, I am, and always will be, a free woman at heart. \"So, if you see me grazing Highland cattle on Glasgow Green or fishing in the Clyde, just remember, I'm exercising my rights as a free woman.\" Freemen traditionally have the right to graze their cows on the common land (Glasgow Green) and also have the duty to \"patrol and guard the town\" and to defend it by arms. If freemen do not perform this duty, they could be prosecuted for perjury of their oath and, if convicted, have a right to a prison cell of their own. Others granted the Freedom of the City of Glasgow include Sir Billy Connolly, Sir Kenny Dalglish, Sir Alex Ferguson and the late Nelson Mandela. Only a handful of women have been awarded the honour, which has included scientist Marie Curie, who was the first woman to win a Nobel Prize. Read more from Sky News:Glastonbury 2025 line-up revealedEurovision entry censored over song's 'appropriateness' Smith's career has spanned more than 40 years in radio, television, film, and theatre. She is a regular on the Glasgow pantomime scene, and on stage she has starred in shows including Calendar Girls, Annie and the Susan Boyle musical I Dreamed A Dream, which she co-wrote. Smith is also a charity campaigner and political activist, particularly on issues such as poverty and women's rights. Glasgow's lord provost, councillor Jacqueline McLaren, said: \"Elaine's dedication to advocating for and supporting women, and her successful and impactful work in the arts, makes her a deserving recipient of the Freedom of the City. \"In her own way, Elaine has highlighted that while she holds the title of 'freeman', she proudly identifies as a free woman, and I think this playful, yet profound sentiment perfectly captures the essence of the values we celebrate on International Women's Day.\""
    },
    {
        "title": "Elaine C Smith grazes cows on Glasgow Green to mark receiving city's highest honour",
        "description": "Comedian&#160;Elaine C Smith has grazed cattle on Glasgow Green - a right that comes with being awarded the&#160;Freedom of Glasgow.&#160;",
        "url": "https://news.sky.com/story/elaine-c-smith-grazes-cows-on-glasgow-green-to-mark-receiving-citys-highest-honour-13322756",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-elaine-c-smith-cows_6848111.jpg?20250306155051",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-03-06 13:36:00",
        "Headline": "The Rab C Nesbitt and Two Doors Down star has been given the city's highest honour - which also gives her the right to fish in the River Clyde and graze cattle on common ground. ",
        "Content": "Comedian Elaine C Smith has grazed cattle on Glasgow Green - a right that comes with being awarded the Freedom of Glasgow.  The city's highest honour, which she is one of the few women to receive, also allows her to fish in the River Clyde. The Rab C Nesbitt and Two Doors Down star said it was \"quite the honour\" to be granted the award in recognition of her contribution to the arts and her embodiment as an advocate for women's rights and values. The official civic reception will take place on Friday, on the eve of International Women's Day. Smith exercised some of her new rights by grazing cattle borrowed from Pollok Park on Glasgow Green on Thursday. She said: \"As a newly minted freeman of Glasgow, I must say, it's quite the honour. \"But let's be clear, while I may be a 'freeman' by title, I am, and always will be, a free woman at heart. \"So, if you see me grazing Highland cattle on Glasgow Green or fishing in the Clyde, just remember, I'm exercising my rights as a free woman.\" Freemen traditionally have the right to graze their cows on the common land (Glasgow Green) and also have the duty to \"patrol and guard the town\" and to defend it by arms. If freemen do not perform this duty, they could be prosecuted for perjury of their oath and, if convicted, have a right to a prison cell of their own. Others granted the Freedom of the City of Glasgow include Sir Billy Connolly, Sir Kenny Dalglish, Sir Alex Ferguson and the late Nelson Mandela. Only a handful of women have been awarded the honour, which has included scientist Marie Curie, who was the first woman to win a Nobel Prize. Read more from Sky News:Glastonbury 2025 line-up revealedEurovision entry censored over song's 'appropriateness' Smith's career has spanned more than 40 years in radio, television, film, and theatre. She is a regular on the Glasgow pantomime scene, and on stage she has starred in shows including Calendar Girls, Annie and the Susan Boyle musical I Dreamed A Dream, which she co-wrote. Smith is also a charity campaigner and political activist, particularly on issues such as poverty and women's rights. Glasgow's lord provost, councillor Jacqueline McLaren, said: \"Elaine's dedication to advocating for and supporting women, and her successful and impactful work in the arts, makes her a deserving recipient of the Freedom of the City. \"In her own way, Elaine has highlighted that while she holds the title of 'freeman', she proudly identifies as a free woman, and I think this playful, yet profound sentiment perfectly captures the essence of the values we celebrate on International Women's Day.\""
    },
    {
        "title": "Artist abandons plan to starve piglets to death after animals stolen",
        "description": "An artist who tried to starve three piglets to death as part of a controversial exhibition says he has changed his plan after the animals were stolen.",
        "url": "https://news.sky.com/story/artist-abandons-plan-to-starve-piglets-to-death-after-animals-stolen-13322612",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-piglets-denmark_6847835.jpg?20250306102719",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-03-06 10:01:00",
        "Headline": "The artist's friend helped animal rights activists break into the gallery and free the piglets after his 10-year-old daughter begged him to \"make sure the piggies won't die\".",
        "Content": "An artist who tried to starve three piglets to death as part of a controversial exhibition says he has changed his plan after the animals were stolen. Chilean-born Marco Evaristti said he had wanted to raise awareness of the suffering caused by mass meat production with his art installation that opened last week in Copenhagen, Denmark. The piglets were being denied food and water and would have been allowed to starve to death. But Mr Evaristti said the piglets - dubbed Lucia, Simon and Benjamin - were taken by animal rights activists who were assisted by his friend, Caspar Steffensen. \"I called up police on Saturday to report the piglets stolen and I had to shut down the entire exhibition because of that - so I was very disappointed when Caspar told me on Tuesday that he was involved in the theft,\" said Mr Evaristti, who also claimed to have received hate mail. \"But then I thought about it for a few hours and realised that at least this way the piglets would have a happy life.\" Copenhagen police said they had received reports \"that the pigs had been stolen from the exhibition\". Mr Evaristti's exhibition, And Now You Care, involved a makeshift cage created with shopping trolleys containing the three piglets. He said the intention was to raise awareness about the cruelties of modern pig production in Denmark. The Animal Protection Denmark welfare group says sows are bred in the Danish pig industry to produce about 20 piglets at a time - but with only 14 teats, piglets are forced to compete for milk and often starve. However, several animal rights groups voiced concern about Mr Evaristti's exhibition, saying while they welcomed initiatives to raise awareness, they did not condone animal abuse. Mr Steffensen said he could not allow the three animals to face a painful death after his 10-year-old daughter had begged him to \"make sure the piggies won't die\". \"So when I was approached by an activist to help free the animals, I let them into the gallery secretively on Saturday,\" he said. Read more:Artwork recovered after museum employee threw piece in binPainting of nude woman with legs open prompts police visit However, Mr Evaristti said he will revive the exhibition and hopes to somehow get dead piglets from meat processing plants and present them to the public. \"I'm in the process of acquiring animals that have died of starvation or other terrible circumstances in agriculture. I want to display them in a transparent refrigerator,\" he told Denmark's Ekstra Bladet. He said his aim was to fill the transparent refrigerator to bursting point with dead animals to show how animals in agriculture are squeezed into small cages. Having acquired the refrigerator, he said he now just needed the dead animals. \"I'm willing to pay a high price,\" he added."
    }
]