[
    {
        "title": "Donald Trump hits back at 'terrible' Volodymyr Zelenskyy and calls him a 'dictator' amid US-Russia talks",
        "description": "Donald Trump has said Volodymyr Zelenskyy \"better move fast or he is not going to have a country left\" as peace talks between the US and Russia continue &#8211; without Ukraine at the table.",
        "url": "https://news.sky.com/story/donald-trump-hits-back-at-terrible-volodymyr-zelenskyy-and-calls-him-a-dictator-amid-us-russia-talks-13312719",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-president_6833230.jpg?20250219002234",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-19 16:05:00",
        "Headline": "Donald Trump's comments come after Volodymyr Zelenskyy said the US president is living in a Russian-made \"disinformation space\". ",
        "Content": "Donald Trump has said Volodymyr Zelenskyy \"better move fast or he is not going to have a country left\" as peace talks between the US and Russia continue – without Ukraine at the table. Officials from the White House and the Kremlin have this week begun holding discussions in Saudi Arabia. The decision for the talks to take place without representatives from Kyiv or Europe has caused concern, and sparked an emergency meeting of European leaders in France earlier this week. Mr Trump's latest comments - in which he also calls Mr Zelenskyy \"a dictator without elections\" - come after the Ukrainian president accused him of living in a Russian-made \"disinformation space\" as a result of his administration's discussions with Kremlin officials.  Ukraine latest: Follow updates as Putin makes peace talks claim In a post on his social media platform TruthSocial, the US president said Mr Zelenskyy had \"talked the United States of America into spending $350 billion dollars, to go into a war that couldn't be won, that never had to start\". \"The only thing he was good at was playing Biden 'like a fiddle',\" he added. Mr Trump continued: \"Zelenskyy better move fast or he is not going to have a country left. \"In the meantime, we are successfully negotiating an end to the War with Russia, something all admit only 'TRUMP,' and the Trump Administration, can do. \"Biden never tried, Europe has failed to bring peace, and Zelenskyy probably wants to keep the 'gravy train' going.\" \"I love Ukraine, but Zelenskyy has done a terrible job, his country is shattered, and MILLIONS have unnecessarily died - And so it continues,\" he wrote. Mr Trump later repeated his comments in a rambling speech to a Saudi-run investment forum in Miami. Top end estimates suggest hundreds of thousands of people, most of them soldiers, have died in the Russia-Ukraine conflict. Millions of Ukrainians have fled their country as refugees. Mr Trump also repeated his claim that the Ukrainian president has low approval ratings - which has already been dismissed by Mr Zelenskyy as Russian disinformation - and claimed American aid money had been misused. The latest poll, carried out by the Kyiv International Institute of Sociology in early February, found 57% of Ukrainians trust their leader. Ukraine's general election, scheduled for April 2024, were delayed because of Russia's invasion in February 2022.  Speaking after Mr Trump's comments, Mr Zelenskyy called for pragmatism from the US. He said in his nightly address: \"We are standing strong on our own two feet. I am counting on Ukrainian unity, our courage… on the unity of Europe and the pragmatism of America.\" Meanwhile, German Chancellor Olaf Scholz said the US president labelling Mr Zelenskyy a \"dictator\" is \"false and dangerous\", German newspaper Spiegel reported. \"It is simply wrong and dangerous to deny President Zelenskyy his democratic legitimacy,\" Mr Scholz said. Putin: 'No one is excluding Ukraine from talks'  Mr Trump's latest post comes after Vladimir Putin insisted Kyiv could have a seat at the negotiating table. The Russian president said earlier on Wednesday: \"No one is excluding Ukraine from peace talks.\" \"We are ready, I have already said this a hundred times - if they want, please let these negotiations take place and we will be ready to return to the table,\" he said. More from Sky News:Analysis: Ukraine is fighting war on two frontsTrump 'disappointed' by Ukraine  Referencing Mr Zelenskyy's 2022 decree that rejected talks with Moscow, he added: \"The Europeans have stopped contacts with Russia. The Ukrainian side has forbidden itself to negotiate.\" According to the Russian leader, the \"goal and subject\" of Tuesday's talks in Saudi Arabia \"was the restoration of Russia-US relations\". Mr Zelenskyy is expected to meet later with Keith Kellogg, the US special envoy for Ukraine and Russia, who arrived in Kyiv on Wednesday. 👉 Follow Trump 100 on your podcast app 👈 Russia launches assault on Odesa Overnight, Russian forces launched a drone attack on Ukraine's Black Sea port city of Odesa, injuring four people including a child, Mr Zelenskyy said. At least 160,000 people were left without heating in sub-zero temperatures, he added. \"Rescue operations are under way in Odesa after another Russian attack on the energy infrastructure,\" Mr Zelenskyy said on the Telegram app. \"It is civilian energy facilities against which the Russian army has not spared neither missiles nor attack drones for almost three years.\""
    },
    {
        "title": "Starmer backs 'democratically elected' Zelenskyy after Trump 'dictator' jibe at Ukrainian leader",
        "description": "Prime Minister Sir Keir Starmer has spoken with Volodymyr Zelenskyy to give the Ukrainian president his backing after Donald Trump called him a \"dictator\".",
        "url": "https://news.sky.com/story/kemi-badenoch-defends-volodymyr-zelenskyy-after-donald-trump-calls-him-a-dictator-13312728",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/219d65253d2ae70e49f3931d883052bb44c7d27dbd4316f610e50275a3d65472_6831919.jpg?20250217192628",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2025-02-19 16:17:00",
        "Headline": "The prime minister's show of support for Volodymyr Zelenskyy comes after Tory leader Kemi Badenoch refuted Mr Trump's comment but said the US leader was right that Europe \"needs to pull its weight\". ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Prime Minister Sir Keir Starmer has spoken with Volodymyr Zelenskyy to give the Ukrainian president his backing after Donald Trump called him a \"dictator\". A Downing Street spokesperson said Sir Keir called Mr Zelenskyy this evening and shared his support for him \"as Ukraine's democratically elected leader\". The prime minister \"said that it was perfectly reasonable to suspend elections during war time as the UK did during World War II\", the statement continued. He also \"reiterated his support for the US-led efforts to get a lasting peace in Ukraine that deterred Russia from any future aggression\".  Politics Live: Johnson responds to Trump's 'shock' Ukraine claims In a post on X about the call, Mr Zelenskyy said: \"The United Kingdom's role in fortifying Europe's defense and security is important for us.\" \n                  Why all roads lead through Riyadh - as Saudi Arabia emerges as key global power broker\n                 \n                  Kemi Badenoch breaks her silence on Ukraine – finally\n                 \n                  Starmer meets Trump - but how does he prepare?\n                 The \"UK's support matters indeed, and we will never forget the respect the British people have shown for Ukraine and our citizens\", he added. The call was held after Mr Trump took aim at the Ukrainian president in a post on his Truth Social platform. It is likely the war of words will come up again when Sir Keir meets Mr Trump in Washington next week, to discuss security and Ukraine. Conservative leader Kemi Badenoch, who had been under pressure to condemn Mr Trump's attacks, earlier said Mr Zelenskyy \"is not a dictator. He is the democratically elected leader of Ukraine who bravely stood up to Putin's illegal invasion\". However, she said that Mr Trump \"is right that Europe needs to pull its weight - and that includes the UK\". She added: \"We need to get serious. The PM will have my support to increase defence spending - there is a fully funded plan to get to 2.5% sitting on his desk. \"That should be the bare minimum. Starmer should get on with it, get on a plane to Washington and show some leadership. We cannot afford to get this wrong.\" Labour has pledged to raise defence spending to 2.5% of GDP, from about 2.3% now, but there is no timeline as to when. This week Ms Badenoch admitted the Tories tried to increase the funding to 3% while they were in office but there \"wasn't enough money to do so\". It comes against the backdrop of a war of words between Mr Trump and Mr Zelenskyy, after officials from the US and Russia met in Saudi Arabia for talks to end the war - without representatives from Kyiv or Europe present. Read more from Sky News:Analysis: Badenoch breaks her silence on Ukraine - finallyAnalysis: Ukraine is fighting war on two frontsTrump 'disappointed' by Ukraine 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 After Mr Zelenskyy complained of being excluded from the discussions, Mr Trump suggested the conflict could have been \"settled very easily\" and said \"you [Ukraine] should have never started it\". In response, Mr Zelenskyy said on Wednesday the American leader is living in a \"disinformation space\" created by Russia, which has repeatedly sought to blame Ukraine for the war.  Mr Trump has since hit back, saying Mr Zelenskyy \"better move fast or he is not going to have a country left\" and branding him a \"dictator\". Mr Zelenskyy was elected as president of Ukraine in May 2019. Elections were previously scheduled to go ahead in 2024, but they were not held as a result of martial law being in place. Ex-PM: Trump's comments intended to 'shock Europeans into action' Ms Badenoch's remarks come after reports that Tory MPs wanted her to take a stand on Ukraine since Mr Trump's interventions. Ukraine latest: Trump calls Zelenskyy a 'dictator ' Europe is scrambling to respond to a US shift in foreign policy - with Mr Trump making clear that Washington no longer sees the defence of the continent as its primary concern. Earlier on Wednesday, former prime minister Boris Johnson, who was in office when the war began, claimed Mr Trump's statements are \"not intended to be historically accurate but to shock Europeans into action\". He asked when Europeans will \"stop being scandalised about Donald Trump and start helping him to end this war?\" However on the other end of the political spectrum, Liberal Democrat leader Sir Ed Davey said that \"calling Mr Zelenskyy a 'dictator' must be where the line is drawn\". \"It is my sincere hope that the whole political spectrum in the United Kingdom will speak with one voice in opposition to Trump's lies.\" However defence secretary John Healey earlier reacted to the US president's claim that Ukraine started the war. The cabinet minister told reporters on a visit to Norway, near the border with Russia: \"Three years ago, one country illegally invaded another, and since then, the Ukrainians have been fighting for their freedom. \"They've been fighting for their future, and they still are. So whilst all the focus may be on talks, not even negotiations, our concern as defence ministers is that we're not jeopardising the peace by forgetting about the war.\""
    },
    {
        "title": "What causes sinkholes and why are they popping up in the UK?",
        "description": "A major incident has been declared in a village in Surrey after a large sinkhole opened up.",
        "url": "https://news.sky.com/story/what-causes-sinkholes-and-why-are-they-popping-up-in-the-uk-13312658",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-godstone-surrey-sinkhole_6832803.jpg?20250218182830",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-19 14:23:00",
        "Headline": "A sinkhole in the Surrey village of Godstone has led to evacuations, disrupted water supplies and the declaration of a major incident. It is not the first sinkhole to have opened up in the UK and around the world in the last few months, so what's causing them?",
        "Content": " A major incident has been declared in a village in Surrey after a large sinkhole opened up. At least one garden in Godstone has been swallowed by the hole - which is believed to measure up to 62ft (19m) - and around 30 homes have been evacuated. Carl Bussey, assistant director of safer communities at Surrey County Council, said on Wednesday that the site continues to be \"assessed by structural experts, in order to manage the risk and understand what needs to be done to make safe and repair\". What actually caused the hole to open up, remains unknown.  Provider SES Water said the sinkhole caused a water pipe to burst, leading to some residents losing their supply - which have now all been restored. Residents in the area are no strangers to sinkholes, having also experienced one in 2019 - albeit this was only \"slight\" and did not cause the same extent of damage. The most recent Surrey sinkhole also occurred mere months after a large sinkhole appeared in Merthyr Tydfil, South Wales, which ate up the driveway of former Love Island winner Liam Reardon's family home. Back in September last year, AFC Wimbledon had to postpone a Carabao Cup third-round rematch after severe flooding caused what appeared to be a large sinkhole on the pitch at Cherry Red Records Stadium. So what is causing these sinkholes, and why have more seemingly started to appear in the UK?  What is a sinkhole? Sinkholes are often saucer-shaped holes that occur as the result of a collapse or removal of an underlying layer of rocks that is used to support the materials on the surface, the British Geological Survey (BGS) says. The shape of a sinkhole depends on the composition of the rocks underneath the surface and the different interacting processes taking place, according to the BGS. Sinkholes that result from the removal of a soluble rock such as chalk, gypsum or limestone are called solution sinkholes. Streams or rivers that enter a sinkhole and disappear underground are known as shallow holes. What causes a sinkhole? \"The main trigger for sinkholes is water,\" Dr Clive Edmonds, a geotechnical specialist who has studied sinkholes for 30 years, told The Institution of Civil Engineers (ICE). He said in 90% of cases, water saturating the ground is the main cause of collapse. Dr Edmonds adds that geology is also a main factor in the development of a sinkhole. The more soluble the rock, the more likely a sinkhole is to occur. Soluble rocks that are broken down by water form karst, a type of landscape that is characterised by sinkholes and underground caves. Building works, changes in water table level and mining can also trigger sinkholes, the BGS says. Commenting specifically on Godstone, Dr Philip Collins, deputy dean at Brunel University's College of Engineering, said the land immediately west of where the sinkhole appears was formerly used as a sand quarry. \"Sand can be strong when compacted as the particles are packed together, but weak when it becomes wet, and particularly if there is a lot of water under pressure,\" he said, suggesting the local geology contributed to the formation of the sinkhole. He added that in this case the sinkhole appears to have been caused by a \"washout of soil from beneath the road as a result of a burst water mains\". \"This burst would have pumped a large volume of water into the soil in a short period of time, overcoming its strength and turning it to a slurry which was then washed away. It isn't clear where the soil went yet, but it is likely to have gone into the sewers, which may cause problems elsewhere,\" he said. Andrew Farrant, a regional geologist for the BGS agreed. He said the \"cross-bedded sands\" and \"weakly cemented sandstones\" that Godstone is build upon are \"prone to erosion and flushing by running water\". But adds that this would normally not be a problem \"unless there is a sudden change in the hydrogeology, for example by digging a large hole below the local water table or due to a sudden ingress of water, from say a burst pipe, or heavy rainfall or flooding. \"It is probable that a burst water main has flushed out weak sandstone bedrock, creating a void which has then collapsed,\" Mr Farrant said. He noted the \"actual cause\" of the sinkhole cannot be defined without further information. SES Water, which provides water in the area, maintains the burst main was caused after the sinkhole occurred and not the other way around. Tandridge district council confirmed in a statement on Wednesday that there are \"historical sandpits in the area\" and the southern building control partnership has visited the site to establish homes around the sinkhole are structurally sound. What areas of the UK are prone to sinkholes? The BGS says most sinkholes are relatively small and occur in upland or rural areas. Areas like the Mendip Hills in Somerset, parts of Wales, the Peak District and the Yorkshire Dales are susceptible because they are built on Carboniferous limestone - a hard sedimentary rock made largely of calcium carbonate. The most sinkhole-susceptible area in the UK, is the Permian gypsum deposits of northeast England, particularly around Ripon, the BGS says. Sinkholes also occur over salt deposits, commonly in areas such as Cheshire. While on the west coast of Scotland, parts of Assynt are prone to sinkholes due to the underlying Cambrian Durness Limestone. Can you predict or prevent a sinkhole? Often the first indicators of a sinkhole are dips and depressions on ground surfaces, Dr Edmonds told The Institution of Civil Engineers. When these leaks and cracks fill with water it can potentially lead to buildings moving, leaks in water mains or sewer water leaking on to the ground. Geobear, a ground and structural engineering company based in the UK, says strengthening the ground in high-risk areas prone to sinkholes may help to prevent them from opening up. They do that by injecting geopolymer resin into the affected area, which binds with the soil and allows properties to withstand any sinkholes far more effectively. The company adds that homeowners worried about sinkholes forming can help prevent them by calling professionals, installing proper drainage systems and planting vegetation around a property to help absorb rainwater run off, instead of it collecting in pools. Not just a UK problem... Sinkholes are not just a problem in the UK, and recent examples from across the globe show just how dangerous the phenomena can be. At the beginning of the year, a rescue mission was launched in Yashio, Japan, after a truck and its driver were swallowed by a swimming pool-sized sinkhole. Aerial footage shown by local broadcaster Nippon TV showed at least 12 fire engines trying to free the driver, who was reportedly trapped in his vehicle after it filled with sand and mud. The search went on for two weeks before being called off by officials, who were worried the ground would further collapse, Japanese news agency Kyodo News reported on 10 February. In December 2024, the body of Elizabeth Pollard, 64, was found in a sinkhole in Pennsylvania. The grandmother was last seen searching for her cat Pepper in the village of Marguerite, about 40 miles east of Pittsburgh, before she was found days later where a sinkhole had recently opened up above an area where coal was mined 70 years prior. Sinkholes are also not uncommon in China. In 2020, nine people died after a sinkhole swallowed an entire bus outside a hospital in the city of Xining, in Qinghai province. Another 17 people were injured in the event. And in 2010, a giant sinkhole opened up in Guatemala City, caused by the rains of Tropical Storm Agatha and making for some jaw-dropping pictures."
    },
    {
        "title": "Woman, 74, first to be charged in Scotland under abortion buffer zone law",
        "description": "A pensioner has become the first person in Scotland to be charged for allegedly breaching the nation's new abortion buffer zones law.",
        "url": "https://news.sky.com/story/woman-74-first-to-be-charged-in-scotland-under-abortion-buffer-zone-law-13312725",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-holyrood-abortion-buffer-zones_6833912.jpg?20250219170827",
        "type": "Home",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-02-19 16:15:00",
        "Headline": "The legislation came into force last September and aims to prevent anti-abortion protesters from gathering within 200 metres of the 30 clinics across the nation where terminations are carried out.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A pensioner has become the first person in Scotland to be charged for allegedly breaching the nation's new abortion buffer zones law. Police Scotland was told about a group of protesters outside Glasgow's Queen Elizabeth University Hospital at around 2.05pm on Wednesday. Officers attended and a 74-year-old woman was arrested and charged in connection with an alleged breach of the exclusion zone in Hardgate Road. A force spokesperson said: \"She will be reported to the procurator fiscal.\" This is the first arrest and charge in Scotland under the Abortion Services (Safe Access Zones) (Scotland) Act 2024. The legislation was created to prevent anti-abortion protesters from gathering within 200 metres of the 30 hospitals and medical facilities across the nation where terminations are carried out. It came into force last September. \n                  Female prankster pretending to be marshal sends Glasgow runners on 2.5km detour during race\n                 \n                  Inquiry begins into death of baby at Royal Hospital for Children in Glasgow\n                 \n                  Pharmacist jailed for abusing two women during medical examinations\n                 Scottish Greens MSP Gillian Mackay, who introduced the bill, condemned the demonstrators. She said: \"The protests that have taken place outside the Queen Elizabeth University Hospital have been utterly shameful and I am grateful to Police Scotland for acting so quickly. \"This kind of intimidation has no place in a modern or progressive Scotland. \"Everybody deserves to have access to healthcare without harassment. That is why I introduced my act, and why these disgraceful protests are now illegal. \"We know the awful impact that these protests have had. Some of the testimonies from women who have had to endure them have been heartbreaking.\" The protest comes just days after US vice president JD Vance was criticised for spreading misinformation about the legislation. Donald Trump's deputy alleged that residents within the safe access zones had been sent letters by the Scottish government \"warning them that even private prayer within their own homes may amount to breaking the law\". He claimed the government \"urged readers to report any fellow citizens suspected guilty of thought crime\". Mr Vance added: \"In Britain and across Europe, free speech, I fear, is in retreat.\" 👉 Follow Trump 100 on your podcast app 👈 In response, Health Secretary Neil Gray branded the claim \"ludicrous\". The Scottish government also said it was \"incorrect\", adding: \"Private prayer at home is not prohibited within safe access zones and no letter has ever suggested it was.\" Read more from Sky News:Inside social media's illicit abortion trade'Without pro-life activists, my beautiful daughter wouldn't be here today'Anti-abortion group defend protest Ms Mackay urged all those considering future demonstrations to \"think again, as they will be stopped and there will be consequences\". She added: \"It's no coincidence that this has happened so soon after JD Vance and his supporters have spread toxic misinformation about Scotland. \"It is vital that we stand up for reproductive rights and against those who are working to undermine them.\""
    },
    {
        "title": "Emma Raducanu posts update after becoming visibly upset during tennis match",
        "description": "Emma Raducanu has said she will \"be okay\" after being approached by a man displaying \"fixated behaviour\".",
        "url": "https://news.sky.com/story/emma-raducanu-visibly-distressed-after-being-approached-by-man-displaying-fixated-behaviour-at-dubai-tennis-championships-13312406",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-emma-raducanu-tennis_6833366.jpg?20250219084047",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-19 07:45:00",
        "Headline": "Raducanu previously had a stalker - who in 2022 was handed a five-year restraining order, after a court heard she was \"constantly looking over her shoulder\".",
        "Content": " Emma Raducanu has said she will \"be okay\" after being approached by a man displaying \"fixated behaviour\". The British tennis star was later visibly upset during a game at the Dubai Tennis Championships after the man was among the crowds in the first few rows. On Instagram on Wednesday, she wrote: \"Thank you for the messages of support. Difficult experience yesterday but I'll be okay and proud of how I came back and competed despite what happened at the start of the match. \"Thank you to Karolina [Muchova] for being a great sport and best of luck to her for the rest of the tournament.\" Along with her message she posted an image of the Jane Austen novel Emma and a cup of coffee. The 22-year-old was in tears as she went to the umpire's chair after the second game of her rain-delayed second-round match on Tuesday. The man was subsequently removed from the tennis court by security. Raducanu went on to lose 7-6 (8-6) 6-4 to 14th seed Karolina Muchova. The Women's Tennis Association (WTA) statement said: \"On Monday, February 17, Emma Raducanu was approached in a public area by a man who exhibited fixated behaviour. \"This same individual was identified in the first few rows during Emma's match on Tuesday at the Dubai Duty Free Tennis Championships and subsequently ejected. \"He will be banned from all WTA events pending a threat assessment. \"Player safety is our top priority, and tournaments are advised on security best practices for international sporting events.\" The WTA added it was \"actively working\" with Raducanu to ensure her well-being and will provide any \"necessary support\". In 2022, a 35-year-old man was handed a five-year restraining order - after a court heard Raducanu was \"constantly looking over her shoulder\" and no longer felt \"safe in her own home\". Amrit Magar had walked 23 miles to Emma's home and had stolen her father's shoe as a souvenir. Read more on Sky News:Trump blames Ukraine for war against RussiaInflation hits 10-month highVatican update on Pope's health Bromley Magistrates' Court heard how Magar went to Raducanu's home on three separate occasions, loitered outside, left unwanted gifts and cards, and stole property from their porch. The court also heard from Raducanu through a victim impact statement read by prosecutors - which said that her parents were \"reluctant\" to let her go out on her own. The restraining order, handed to Magar by District Judge Sushil Kumar, bans him from contacting Raducanu and her parents."
    },
    {
        "title": "KFC to TFC? Famous fast food chain leaves Kentucky for Texas",
        "description": "KFC is leaving Kentucky.",
        "url": "https://news.sky.com/story/kfc-to-tfc-famous-fast-food-chain-leaves-kentucky-for-texas-13312968",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kfc-fast-food_6834179.jpg?20250219222252",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-19 22:20:00",
        "Headline": "KFC's ties to the US state of Kentucky run almost a century deep, when at a service station in Corbin, Colonel Harland Sanders began feeding customers.",
        "Content": "KFC is leaving Kentucky. The fast food giant, once known as Kentucky Fried Chicken, is relocating its corporate office to Texas in a shake-up announced earlier this week. Started by Colonel Harland Sanders, KFC will be based in Plano, Texas, moving forward. Around 100 corporate employees will be relocated in the next six months, Yum Brands, KFC's parent company which also owns Taco Bell and Pizza Hut, said.  In recent years, other companies have also relocated to Texas, a popular destination thanks to its low-tax and business-friendly policies, according to a 2023 report by the CBRE investment firm. Governor of Kentucky Andy Beshear was quick to respond to the news. He said: \"I am disappointed by this decision and believe the company's founder would be, too. \"This company's name starts with Kentucky, and it has marketed our state's heritage and culture in the sale of its product.\" Yum Brands said the move was part of wider plans to set up two brand headquarters in the US - in Texas and in Irvine, California. KFC and Pizza Hut will be based in Texas and Taco Bell and Habit Burger & Grill will remain based in California, the company said. Yum Brands and KFC will maintain offices in Louisville. \"These changes position us for sustainable growth and will help us better serve our customers, employees, franchisees and shareholders,\" Yum Brands chief executive David Gibbs said in a statement. Read more from Sky News:What causes sinkholes in the UK?Odds of asteroid hitting Earth rise againPrankster sends runners on 2.5km detour KFC's Kentucky ties run almost a century deep. In 1930, at a service station in Corbin, Kentucky, Mr Sanders began feeding customers, according to the company's website. It added there are now over 24,000 KFC outlets in more than 145 countries and territories around the world."
    },
    {
        "title": "Funeral held for Irish jockey Michael O'Sullivan who died after fall aged 24",
        "description": "Leading figures from the world of horseracing joined hundreds of mourners at the funeral of Irish jockey Michael O'Sullivan, who died after falling from his horse earlier this month.",
        "url": "https://news.sky.com/story/michael-osullivan-willie-mullins-and-ruby-walsh-join-mourners-at-funeral-of-jockey-24-who-died-after-fall-13312793",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-michael-o-sullivan_6833932.jpg?20250219172502",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-19 17:29:00",
        "Headline": "O'Sullivan, who died from injuries sustained earlier this month, \"made a lasting impression on everyone and won the hearts of the Irish people\", mourners were told.",
        "Content": "Leading figures from the world of horseracing joined hundreds of mourners at the funeral of Irish jockey Michael O'Sullivan, who died after falling from his horse earlier this month. Racehorse trainer Willie Mullins and his son, jockey, Patrick Mullins, and former jockey Ruby Walsh, were among those at the service at John the Baptist Church in Glantane, in County Cork, on Wednesday. O'Sullivan, 24, died in hospital on Sunday from injuries he suffered in a fall at Thurles Racecourse in County Tipperary on 6 February.   Priest Father Gerard Coleman said the jockey lived life to the full in a requiem mass, adding that he packed more into his 24 years than most people do in two lifetimes. O'Sullivan had maturity beyond his years, he said, and a \"tremendous understanding\". \"He understood his horses and that's why he was such a great rider. But he also understood people and that is why he made a lasting impression on everyone and won the hearts of the Irish people,\" said Father Coleman. \"Everyone loved him. He was an incredibly talented and dedicated sportsman and will never be forgotten.\" The jockey was riding the horse Wee Charlie, for trainer Gerard O'Leary, when he sustained the fatal injuries. He was one of three fallers at the final fence in a two-mile handicap chase at Thurles and the rest of the meeting was abandoned. He was airlifted to the intensive care unit at Cork University Hospital, where he died surrounded by his family in the early hours of Sunday. O'Sullivan shot to prominence on the opening day of the 2023 Cheltenham Festival, headlined by his Supreme Novices' Hurdle win on Marine Nationale, just months after turning professional. His coffin was brought to the church from his home in nearby Lombardstown. Young members of the Duhallow Pony Club formed a guard of honour as the cortege passed by in pouring rain. Read more:'Home Alone' burglar jailedPope 'joking around' in hospitalOdds of asteroid hitting Earth rise again O'Sullivan's riding whip, and a jersey of his local GAA club Kilshannig were put at the front of the church, along with his university degree parchment and family photo albums. The jockey's partner Charlotte spoke of her endless love for him in a poem she read to the church. After the funeral, a horse led the procession to St John's Cemetery for the burial. A minute's silence was held at the afternoon meetings at Ludlow and Doncaster."
    },
    {
        "title": "Oliver White: Man convicted over £1.38m robbery that 'led to store manager ending his own life'",
        "description": "A man has been found guilty of conspiring to commit a &#163;1.38m watch robbery that prosecutors said led to the manager of the jewellery shop taking his own life.",
        "url": "https://news.sky.com/story/oliver-white-man-convicted-over-163138m-robbery-that-led-to-store-manager-ending-his-own-life-13312828",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-watch-dealer-death_6569095.jpg?20240529202524",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-19 18:52:00",
        "Headline": "More than 70 \"high-value\" watches were taken - none of which were insured, jurors were told. None of the watches have been recovered.",
        "Content": "A man has been found guilty of conspiring to commit a £1.38m watch robbery that prosecutors said led to the manager of the jewellery shop taking his own life. Oliver White, 27, was tied up and put a headlock during the raid at the 247 Kettles store in Richmond, southwest London, in May last year, Woolwich Crown Court heard. Mr White was said to be \"extremely upset\" after the incident and took his own life the next day \"as a direct result\" of the robbery, prosecutors said.   A jury has now found Mannix Pedro, 37, guilty of being \"closely involved in the planning and execution\" of the raid. The jury gave a majority verdict of 10 to one after more than 23 hours of deliberation. \n                  Woman, 66, charged over 1978 death of five-year-old girl in south London\n                 \n                  Chiltern Firehouse: Fire at luxury London hotel 'started from pizza oven'\n                 \n                  Fire breaks out at Chiltern Firehouse two days before Netflix BAFTA party\n                 More than 70 \"high-value\" watches were taken - none of which were insured despite the business being a victim of theft three years prior, jurors were told. None of the watches have been recovered. Pedro did not go into the shop during the robbery but instead organised the use of a stolen Audi as one of two getaway cars, prosecutors said. A second man - Junior Kunu, 30, from Mitcham, southwest London - remains on trial charged with the same offence. The trial resumes on Friday. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Northumberland: Burglar who triggered 'Home Alone-style trap' is jailed",
        "description": "A burglar who was caught after triggering a Home Alone-style trap at a house in Northumberland has been jailed.",
        "url": "https://news.sky.com/story/northumberland-burglar-who-triggered-home-alone-style-trap-is-jailed-13312638",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-paul-howell-cctv-northumbria-police_6833779.png?20250219151532",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-19 13:41:00",
        "Headline": "The householders set the trap following reports of a number of attempted burglaries and their efforts led to the arrest of 56-year-old Paul Howell who police described as a \"prolific offender\".",
        "Content": " A burglar who was caught after triggering a Home Alone-style trap at a house in Northumberland has been jailed. Paul Howell, 56, was attempting to break into a property in Blyth - but fled when a bucket of water soaked his feet after tripping a hidden line of string just before 3am on 9 November last year, police said. The householders set the trap following reports of a number of attempted burglaries. Northumbria Police said Howell, of Blyth, was arrested and charged with attempted burglary after the occupants checked their CCTV footage. In the 1990 movie Home Alone, eight-year-old Kevin McCallister, played by Macaulay Culkin, set a series of elaborate traps for two bungling burglars after his family accidentally left him by himself in their Chicago house at Christmas. Howell was also charged in connection with two separate burglary offences the following week at another address in Blyth, when he forced entry into a property before stealing items including jewellery and bikes. Much of these items were recovered at Howell's house in the town. The force said Howell pleaded guilty to all charges at Newcastle Crown Court in December. He was jailed for three years and seven months on Tuesday. Read more on Sky News:Vatican issues Pope health updateOdds of asteroid hitting Earth rise again Detective Constable Jon Mullen, who led the investigation, said: \"Burglary is an invasive crime which sadly leaves people feeling unsafe in their own homes. \"Howell is a prolific offender who is now facing a lengthy spell behind bars following this sentence.\""
    },
    {
        "title": "Emma Raducanu posts update after becoming visibly upset during tennis match",
        "description": "Emma Raducanu has said she will \"be okay\" after being approached by a man displaying \"fixated behaviour\".",
        "url": "https://news.sky.com/story/emma-raducanu-visibly-distressed-after-being-approached-by-man-displaying-fixated-behaviour-at-dubai-tennis-championships-13312406",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-emma-raducanu-tennis_6833366.jpg?20250219084047",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-19 07:45:00",
        "Headline": "Raducanu previously had a stalker - who in 2022 was handed a five-year restraining order, after a court heard she was \"constantly looking over her shoulder\".",
        "Content": " Emma Raducanu has said she will \"be okay\" after being approached by a man displaying \"fixated behaviour\". The British tennis star was later visibly upset during a game at the Dubai Tennis Championships after the man was among the crowds in the first few rows. On Instagram on Wednesday, she wrote: \"Thank you for the messages of support. Difficult experience yesterday but I'll be okay and proud of how I came back and competed despite what happened at the start of the match. \"Thank you to Karolina [Muchova] for being a great sport and best of luck to her for the rest of the tournament.\" Along with her message she posted an image of the Jane Austen novel Emma and a cup of coffee. The 22-year-old was in tears as she went to the umpire's chair after the second game of her rain-delayed second-round match on Tuesday. The man was subsequently removed from the tennis court by security. Raducanu went on to lose 7-6 (8-6) 6-4 to 14th seed Karolina Muchova. The Women's Tennis Association (WTA) statement said: \"On Monday, February 17, Emma Raducanu was approached in a public area by a man who exhibited fixated behaviour. \"This same individual was identified in the first few rows during Emma's match on Tuesday at the Dubai Duty Free Tennis Championships and subsequently ejected. \"He will be banned from all WTA events pending a threat assessment. \"Player safety is our top priority, and tournaments are advised on security best practices for international sporting events.\" The WTA added it was \"actively working\" with Raducanu to ensure her well-being and will provide any \"necessary support\". In 2022, a 35-year-old man was handed a five-year restraining order - after a court heard Raducanu was \"constantly looking over her shoulder\" and no longer felt \"safe in her own home\". Amrit Magar had walked 23 miles to Emma's home and had stolen her father's shoe as a souvenir. Read more on Sky News:Trump blames Ukraine for war against RussiaInflation hits 10-month highVatican update on Pope's health Bromley Magistrates' Court heard how Magar went to Raducanu's home on three separate occasions, loitered outside, left unwanted gifts and cards, and stole property from their porch. The court also heard from Raducanu through a victim impact statement read by prosecutors - which said that her parents were \"reluctant\" to let her go out on her own. The restraining order, handed to Magar by District Judge Sushil Kumar, bans him from contacting Raducanu and her parents."
    },
    {
        "title": "Northumberland: Burglar who triggered 'Home Alone-style trap' is jailed",
        "description": "A burglar who was caught after triggering a Home Alone-style trap at a house in Northumberland has been jailed.",
        "url": "https://news.sky.com/story/northumberland-burglar-who-triggered-home-alone-style-trap-is-jailed-13312638",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-paul-howell-cctv-northumbria-police_6833779.png?20250219151532",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-19 13:41:00",
        "Headline": "The householders set the trap following reports of a number of attempted burglaries and their efforts led to the arrest of 56-year-old Paul Howell who police described as a \"prolific offender\".",
        "Content": " A burglar who was caught after triggering a Home Alone-style trap at a house in Northumberland has been jailed. Paul Howell, 56, was attempting to break into a property in Blyth - but fled when a bucket of water soaked his feet after tripping a hidden line of string just before 3am on 9 November last year, police said. The householders set the trap following reports of a number of attempted burglaries. Northumbria Police said Howell, of Blyth, was arrested and charged with attempted burglary after the occupants checked their CCTV footage. In the 1990 movie Home Alone, eight-year-old Kevin McCallister, played by Macaulay Culkin, set a series of elaborate traps for two bungling burglars after his family accidentally left him by himself in their Chicago house at Christmas. Howell was also charged in connection with two separate burglary offences the following week at another address in Blyth, when he forced entry into a property before stealing items including jewellery and bikes. Much of these items were recovered at Howell's house in the town. The force said Howell pleaded guilty to all charges at Newcastle Crown Court in December. He was jailed for three years and seven months on Tuesday. Read more on Sky News:Vatican issues Pope health updateOdds of asteroid hitting Earth rise again Detective Constable Jon Mullen, who led the investigation, said: \"Burglary is an invasive crime which sadly leaves people feeling unsafe in their own homes. \"Howell is a prolific offender who is now facing a lengthy spell behind bars following this sentence.\""
    },
    {
        "title": "What causes sinkholes and why are they popping up in the UK?",
        "description": "A major incident has been declared in a village in Surrey after a large sinkhole opened up.",
        "url": "https://news.sky.com/story/what-causes-sinkholes-and-why-are-they-popping-up-in-the-uk-13312658",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-godstone-surrey-sinkhole_6832803.jpg?20250218182830",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-19 14:23:00",
        "Headline": "A sinkhole in the Surrey village of Godstone has led to evacuations, disrupted water supplies and the declaration of a major incident. It is not the first sinkhole to have opened up in the UK and around the world in the last few months, so what's causing them?",
        "Content": " A major incident has been declared in a village in Surrey after a large sinkhole opened up. At least one garden in Godstone has been swallowed by the hole - which is believed to measure up to 62ft (19m) - and around 30 homes have been evacuated. Carl Bussey, assistant director of safer communities at Surrey County Council, said on Wednesday that the site continues to be \"assessed by structural experts, in order to manage the risk and understand what needs to be done to make safe and repair\". What actually caused the hole to open up, remains unknown.  Provider SES Water said the sinkhole caused a water pipe to burst, leading to some residents losing their supply - which have now all been restored. Residents in the area are no strangers to sinkholes, having also experienced one in 2019 - albeit this was only \"slight\" and did not cause the same extent of damage. The most recent Surrey sinkhole also occurred mere months after a large sinkhole appeared in Merthyr Tydfil, South Wales, which ate up the driveway of former Love Island winner Liam Reardon's family home. Back in September last year, AFC Wimbledon had to postpone a Carabao Cup third-round rematch after severe flooding caused what appeared to be a large sinkhole on the pitch at Cherry Red Records Stadium. So what is causing these sinkholes, and why have more seemingly started to appear in the UK?  What is a sinkhole? Sinkholes are often saucer-shaped holes that occur as the result of a collapse or removal of an underlying layer of rocks that is used to support the materials on the surface, the British Geological Survey (BGS) says. The shape of a sinkhole depends on the composition of the rocks underneath the surface and the different interacting processes taking place, according to the BGS. Sinkholes that result from the removal of a soluble rock such as chalk, gypsum or limestone are called solution sinkholes. Streams or rivers that enter a sinkhole and disappear underground are known as shallow holes. What causes a sinkhole? \"The main trigger for sinkholes is water,\" Dr Clive Edmonds, a geotechnical specialist who has studied sinkholes for 30 years, told The Institution of Civil Engineers (ICE). He said in 90% of cases, water saturating the ground is the main cause of collapse. Dr Edmonds adds that geology is also a main factor in the development of a sinkhole. The more soluble the rock, the more likely a sinkhole is to occur. Soluble rocks that are broken down by water form karst, a type of landscape that is characterised by sinkholes and underground caves. Building works, changes in water table level and mining can also trigger sinkholes, the BGS says. Commenting specifically on Godstone, Dr Philip Collins, deputy dean at Brunel University's College of Engineering, said the land immediately west of where the sinkhole appears was formerly used as a sand quarry. \"Sand can be strong when compacted as the particles are packed together, but weak when it becomes wet, and particularly if there is a lot of water under pressure,\" he said, suggesting the local geology contributed to the formation of the sinkhole. He added that in this case the sinkhole appears to have been caused by a \"washout of soil from beneath the road as a result of a burst water mains\". \"This burst would have pumped a large volume of water into the soil in a short period of time, overcoming its strength and turning it to a slurry which was then washed away. It isn't clear where the soil went yet, but it is likely to have gone into the sewers, which may cause problems elsewhere,\" he said. Andrew Farrant, a regional geologist for the BGS agreed. He said the \"cross-bedded sands\" and \"weakly cemented sandstones\" that Godstone is build upon are \"prone to erosion and flushing by running water\". But adds that this would normally not be a problem \"unless there is a sudden change in the hydrogeology, for example by digging a large hole below the local water table or due to a sudden ingress of water, from say a burst pipe, or heavy rainfall or flooding. \"It is probable that a burst water main has flushed out weak sandstone bedrock, creating a void which has then collapsed,\" Mr Farrant said. He noted the \"actual cause\" of the sinkhole cannot be defined without further information. SES Water, which provides water in the area, maintains the burst main was caused after the sinkhole occurred and not the other way around. Tandridge district council confirmed in a statement on Wednesday that there are \"historical sandpits in the area\" and the southern building control partnership has visited the site to establish homes around the sinkhole are structurally sound. What areas of the UK are prone to sinkholes? The BGS says most sinkholes are relatively small and occur in upland or rural areas. Areas like the Mendip Hills in Somerset, parts of Wales, the Peak District and the Yorkshire Dales are susceptible because they are built on Carboniferous limestone - a hard sedimentary rock made largely of calcium carbonate. The most sinkhole-susceptible area in the UK, is the Permian gypsum deposits of northeast England, particularly around Ripon, the BGS says. Sinkholes also occur over salt deposits, commonly in areas such as Cheshire. While on the west coast of Scotland, parts of Assynt are prone to sinkholes due to the underlying Cambrian Durness Limestone. Can you predict or prevent a sinkhole? Often the first indicators of a sinkhole are dips and depressions on ground surfaces, Dr Edmonds told The Institution of Civil Engineers. When these leaks and cracks fill with water it can potentially lead to buildings moving, leaks in water mains or sewer water leaking on to the ground. Geobear, a ground and structural engineering company based in the UK, says strengthening the ground in high-risk areas prone to sinkholes may help to prevent them from opening up. They do that by injecting geopolymer resin into the affected area, which binds with the soil and allows properties to withstand any sinkholes far more effectively. The company adds that homeowners worried about sinkholes forming can help prevent them by calling professionals, installing proper drainage systems and planting vegetation around a property to help absorb rainwater run off, instead of it collecting in pools. Not just a UK problem... Sinkholes are not just a problem in the UK, and recent examples from across the globe show just how dangerous the phenomena can be. At the beginning of the year, a rescue mission was launched in Yashio, Japan, after a truck and its driver were swallowed by a swimming pool-sized sinkhole. Aerial footage shown by local broadcaster Nippon TV showed at least 12 fire engines trying to free the driver, who was reportedly trapped in his vehicle after it filled with sand and mud. The search went on for two weeks before being called off by officials, who were worried the ground would further collapse, Japanese news agency Kyodo News reported on 10 February. In December 2024, the body of Elizabeth Pollard, 64, was found in a sinkhole in Pennsylvania. The grandmother was last seen searching for her cat Pepper in the village of Marguerite, about 40 miles east of Pittsburgh, before she was found days later where a sinkhole had recently opened up above an area where coal was mined 70 years prior. Sinkholes are also not uncommon in China. In 2020, nine people died after a sinkhole swallowed an entire bus outside a hospital in the city of Xining, in Qinghai province. Another 17 people were injured in the event. And in 2010, a giant sinkhole opened up in Guatemala City, caused by the rains of Tropical Storm Agatha and making for some jaw-dropping pictures."
    },
    {
        "title": "Oliver White: Man convicted over £1.38m robbery that 'led to store manager ending his own life'",
        "description": "A man has been found guilty of conspiring to commit a &#163;1.38m watch robbery that prosecutors said led to the manager of the jewellery shop taking his own life.",
        "url": "https://news.sky.com/story/oliver-white-man-convicted-over-163138m-robbery-that-led-to-store-manager-ending-his-own-life-13312828",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-watch-dealer-death_6569095.jpg?20240529202524",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-19 18:52:00",
        "Headline": "More than 70 \"high-value\" watches were taken - none of which were insured, jurors were told. None of the watches have been recovered.",
        "Content": "A man has been found guilty of conspiring to commit a £1.38m watch robbery that prosecutors said led to the manager of the jewellery shop taking his own life. Oliver White, 27, was tied up and put a headlock during the raid at the 247 Kettles store in Richmond, southwest London, in May last year, Woolwich Crown Court heard. Mr White was said to be \"extremely upset\" after the incident and took his own life the next day \"as a direct result\" of the robbery, prosecutors said.   A jury has now found Mannix Pedro, 37, guilty of being \"closely involved in the planning and execution\" of the raid. The jury gave a majority verdict of 10 to one after more than 23 hours of deliberation. \n                  Woman, 66, charged over 1978 death of five-year-old girl in south London\n                 \n                  Chiltern Firehouse: Fire at luxury London hotel 'started from pizza oven'\n                 \n                  Fire breaks out at Chiltern Firehouse two days before Netflix BAFTA party\n                 More than 70 \"high-value\" watches were taken - none of which were insured despite the business being a victim of theft three years prior, jurors were told. None of the watches have been recovered. Pedro did not go into the shop during the robbery but instead organised the use of a stolen Audi as one of two getaway cars, prosecutors said. A second man - Junior Kunu, 30, from Mitcham, southwest London - remains on trial charged with the same offence. The trial resumes on Friday. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Anas Sarwar admits Keir Starmer's time in power has been tough - but he's confident Scottish Labour will oust SNP",
        "description": "Scottish Labour leader Anas Sarwar has said the last seven months of Sir Keir Starmer's government have been hard - but he is confident his party will oust the SNP from power next year.",
        "url": "https://news.sky.com/story/sarwar-admits-starmers-time-in-power-has-been-hard-but-hes-confident-scottish-labour-will-oust-snp-from-power-13312829",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sarwar-scotland-starmer_6833991.jpg?20250219185419",
        "type": "UK",
        "Author": "Connor Gillies",
        "Date Published": "2025-02-19 18:52:00",
        "Headline": "A dramatic change in fortunes now leaves Scottish Labour potentially battling for second place at Holyrood amid a turbulent time with winter fuel payment woes and a row over the treatment of Waspi women.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n  Scottish Labour leader Anas Sarwar has said the last seven months of Sir Keir Starmer's government have been hard - but he is confident his party will oust the SNP from power next year. Mr Sarwar, a close ally of the Sir Keir, was speaking to Sky News ahead of his party's conference in Glasgow this weekend - which the prime minister is expected to attend. The polls had Labour on course to form the next Scottish government at the Holyrood elections in 2026 after capitalising on the SNP's misfortunes amid a bitter leadership contest, and senior figures being involved in a police embezzlement investigation. The PM stormed to victory in last year's general election, securing 37 of the 57 Scottish seats. They only had one MP at the beginning of the previous parliament. Politics latest: Lammy urged to call out Trump's attack on Zelenskyy  However, a dramatic change in fortunes now leaves Scottish Labour potentially battling for second place at Holyrood amid a turbulent time with winter fuel payment woes and a row over the treatment of Waspi women. A recent Notstat poll, commissioned for The Sunday Times, suggested Mr Sarwar may struggle to overtake the Scottish Conservatives as the official opposition in Edinburgh. \n                  Big chains like Wetherspoons will be able absorb extra costs - but frustrations at government are palpable \n                 \n                  Labour needs to 'rearm Britain' with 'more muscular defence', defence secretary warns\n                 \n                  Extra two million NHS appointments in Labour's first five months, government claims\n                 Striking an optimistic tone of the challenges he faces in the coming months, Mr Sarwar said he is \"confident\" there will be a Scottish Labour government next year.  Mr Sarwar said: \"There's no secret there have been challenges in the last seven months, but there hasn't really been a focus on what the choice is in May 2026 and that fundamental choice in 2026 is going to be more decline, more incompetence with the SNP. \"I've been really open with Keir in private and in public that my objective, my plan of course was to help get rid of the Tories, of course was to help elect a UK Labour government - but my ambition was to use the general election as a stepping stone to electing a Scottish Labour government here in 2026, and I'm still confident that is exactly what will happen. \"I have proven the pollsters and the pundits and the commentators wrong many times over the last four years, and I'm confident that we'll prove them wrong again.\" Read more:Starmer confronts reality of Trump and Putin's emerging new world order Scottish Labour has been heavily criticised over its handling of the impending closure of the Grangemouth oil refinery this summer. Mr Sarwar pledged to voters ahead of the general election that his party would \"step in and save the jobs\" by \"investing hundreds of millions of pounds\". Some 400 workers, who face unemployment, have started receiving their redundancy notices in recent weeks as the political promises fail to come to fruition. Asked repeatedly by Sky News whether it was a \"mistake\" to make pledges that could not be delivered, Mr Sarwar said: \"Look. I'm deeply frustrated about this. \"We need further action both, and let me emphasise this, not just from the Scottish government, it requires more urgent action from a UK Labour government too.\""
    },
    {
        "title": "Female prankster pretending to be marshal sends Glasgow runners on 2.5km detour during race",
        "description": "Runners at a 10k trail race in Glasgow were sent in the wrong direction by a prankster pretending to be a marshal and who buried arrow signs marking the course.",
        "url": "https://news.sky.com/story/female-prankster-pretending-to-be-marshal-sends-glasgow-runners-on-25km-detour-during-race-13312466",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-castlemilk-woodland_6833529.jpg?20250219115219",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-02-19 10:06:00",
        "Headline": "The organisers of the event said it is \"hard to laugh off the incident\" as the prank led the runners away from medical help had it been needed.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Runners at a 10k trail race in Glasgow were sent in the wrong direction by a prankster pretending to be a marshal and who buried arrow signs marking the course. Acorn Trails said about 30 of the 115 participants at the event on Sunday were sent on a 2.5km (1.5 mile) detour by the woman. Organisers Alex Osborne and Michelle Sinsheimer told Sky News it is \"hard to laugh off the incident\" as the prank led the runners away from medical help had it been needed. Mr Osborne said: \"It's hard to laugh off the incident when you consider the possible implications had things not panned out as lightly as they did. \"There's a fine line between it being a humorous prank and an incident had one of the runners, not all of whom were local, got more lost when their warm clothing, refreshments and first aid were at the finish line. \"I'd ask the saboteur, who we were told is female, to consider the above, which I'd like to think they hadn't thought of on Sunday.\" The competitors affected by the \"mischievous\" interference have been offered a 50% discount on their entry to the next event. \n                  Woman, 74, first to be charged in Scotland under abortion buffer zone law\n                 \n                  Inquiry begins into death of baby at Royal Hospital for Children in Glasgow\n                 \n                  Pharmacist jailed for abusing two women during medical examinations\n                 The near 10k race starts and finishes at the old golf clubhouse within Linn Park following two laps of Castlemilk Woodland. Marshals had been positioned at several turning points, but the woman was able to direct runners towards Linn Park Bridge from an unmanned spot. Read more from Sky News:Tennis star visibly distressed after spotting man in crowd at matchBritish journalist missing in Brazil Acorn Trails has held multiple events at the park, with at least three going into Castlemilk Woodland. Mr Osborne said: \"We've never had issues before. Maybe the odd sign tossed into a hedge, but never a course alteration or pretending to be part of the event staff. \"In terms of stewards at future events, we rely on volunteers giving up their own time and can only deploy the people we have available. \"We target spots where we think runners might get lost and where they appreciate the vocal support our amazing hi-vis heroes provide. \"It's not practical to have marshals in the place of every arrow sign as that would require a huge volume of people.\" Acorn Trails hosts a number of events throughout the year, with both runners and volunteers invited to get involved."
    },
    {
        "title": "Woman, 74, first to be charged in Scotland under abortion buffer zone law",
        "description": "A pensioner has become the first person in Scotland to be charged for allegedly breaching the nation's new abortion buffer zones law.",
        "url": "https://news.sky.com/story/woman-74-first-to-be-charged-in-scotland-under-abortion-buffer-zone-law-13312725",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-holyrood-abortion-buffer-zones_6833912.jpg?20250219170827",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-02-19 16:15:00",
        "Headline": "The legislation came into force last September and aims to prevent anti-abortion protesters from gathering within 200 metres of the 30 clinics across the nation where terminations are carried out.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A pensioner has become the first person in Scotland to be charged for allegedly breaching the nation's new abortion buffer zones law. Police Scotland was told about a group of protesters outside Glasgow's Queen Elizabeth University Hospital at around 2.05pm on Wednesday. Officers attended and a 74-year-old woman was arrested and charged in connection with an alleged breach of the exclusion zone in Hardgate Road. A force spokesperson said: \"She will be reported to the procurator fiscal.\" This is the first arrest and charge in Scotland under the Abortion Services (Safe Access Zones) (Scotland) Act 2024. The legislation was created to prevent anti-abortion protesters from gathering within 200 metres of the 30 hospitals and medical facilities across the nation where terminations are carried out. It came into force last September. \n                  Female prankster pretending to be marshal sends Glasgow runners on 2.5km detour during race\n                 \n                  Inquiry begins into death of baby at Royal Hospital for Children in Glasgow\n                 \n                  Pharmacist jailed for abusing two women during medical examinations\n                 Scottish Greens MSP Gillian Mackay, who introduced the bill, condemned the demonstrators. She said: \"The protests that have taken place outside the Queen Elizabeth University Hospital have been utterly shameful and I am grateful to Police Scotland for acting so quickly. \"This kind of intimidation has no place in a modern or progressive Scotland. \"Everybody deserves to have access to healthcare without harassment. That is why I introduced my act, and why these disgraceful protests are now illegal. \"We know the awful impact that these protests have had. Some of the testimonies from women who have had to endure them have been heartbreaking.\" The protest comes just days after US vice president JD Vance was criticised for spreading misinformation about the legislation. Donald Trump's deputy alleged that residents within the safe access zones had been sent letters by the Scottish government \"warning them that even private prayer within their own homes may amount to breaking the law\". He claimed the government \"urged readers to report any fellow citizens suspected guilty of thought crime\". Mr Vance added: \"In Britain and across Europe, free speech, I fear, is in retreat.\" 👉 Follow Trump 100 on your podcast app 👈 In response, Health Secretary Neil Gray branded the claim \"ludicrous\". The Scottish government also said it was \"incorrect\", adding: \"Private prayer at home is not prohibited within safe access zones and no letter has ever suggested it was.\" Read more from Sky News:Inside social media's illicit abortion trade'Without pro-life activists, my beautiful daughter wouldn't be here today'Anti-abortion group defend protest Ms Mackay urged all those considering future demonstrations to \"think again, as they will be stopped and there will be consequences\". She added: \"It's no coincidence that this has happened so soon after JD Vance and his supporters have spread toxic misinformation about Scotland. \"It is vital that we stand up for reproductive rights and against those who are working to undermine them.\""
    },
    {
        "title": "Starmer backs 'democratically elected' Zelenskyy after Trump 'dictator' jibe at Ukrainian leader",
        "description": "Prime Minister Sir Keir Starmer has spoken with Volodymyr Zelenskyy to give the Ukrainian president his backing after Donald Trump called him a \"dictator\".",
        "url": "https://news.sky.com/story/kemi-badenoch-defends-volodymyr-zelenskyy-after-donald-trump-calls-him-a-dictator-13312728",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/219d65253d2ae70e49f3931d883052bb44c7d27dbd4316f610e50275a3d65472_6831919.jpg?20250217192628",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-02-19 16:17:00",
        "Headline": "The prime minister's show of support for Volodymyr Zelenskyy comes after Tory leader Kemi Badenoch refuted Mr Trump's comment but said the US leader was right that Europe \"needs to pull its weight\". ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Prime Minister Sir Keir Starmer has spoken with Volodymyr Zelenskyy to give the Ukrainian president his backing after Donald Trump called him a \"dictator\". A Downing Street spokesperson said Sir Keir called Mr Zelenskyy this evening and shared his support for him \"as Ukraine's democratically elected leader\". The prime minister \"said that it was perfectly reasonable to suspend elections during war time as the UK did during World War II\", the statement continued. He also \"reiterated his support for the US-led efforts to get a lasting peace in Ukraine that deterred Russia from any future aggression\".  Politics Live: Johnson responds to Trump's 'shock' Ukraine claims In a post on X about the call, Mr Zelenskyy said: \"The United Kingdom's role in fortifying Europe's defense and security is important for us.\" \n                  Why all roads lead through Riyadh - as Saudi Arabia emerges as key global power broker\n                 \n                  Kemi Badenoch breaks her silence on Ukraine – finally\n                 \n                  Starmer meets Trump - but how does he prepare?\n                 The \"UK's support matters indeed, and we will never forget the respect the British people have shown for Ukraine and our citizens\", he added. The call was held after Mr Trump took aim at the Ukrainian president in a post on his Truth Social platform. It is likely the war of words will come up again when Sir Keir meets Mr Trump in Washington next week, to discuss security and Ukraine. Conservative leader Kemi Badenoch, who had been under pressure to condemn Mr Trump's attacks, earlier said Mr Zelenskyy \"is not a dictator. He is the democratically elected leader of Ukraine who bravely stood up to Putin's illegal invasion\". However, she said that Mr Trump \"is right that Europe needs to pull its weight - and that includes the UK\". She added: \"We need to get serious. The PM will have my support to increase defence spending - there is a fully funded plan to get to 2.5% sitting on his desk. \"That should be the bare minimum. Starmer should get on with it, get on a plane to Washington and show some leadership. We cannot afford to get this wrong.\" Labour has pledged to raise defence spending to 2.5% of GDP, from about 2.3% now, but there is no timeline as to when. This week Ms Badenoch admitted the Tories tried to increase the funding to 3% while they were in office but there \"wasn't enough money to do so\". It comes against the backdrop of a war of words between Mr Trump and Mr Zelenskyy, after officials from the US and Russia met in Saudi Arabia for talks to end the war - without representatives from Kyiv or Europe present. Read more from Sky News:Analysis: Badenoch breaks her silence on Ukraine - finallyAnalysis: Ukraine is fighting war on two frontsTrump 'disappointed' by Ukraine 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 After Mr Zelenskyy complained of being excluded from the discussions, Mr Trump suggested the conflict could have been \"settled very easily\" and said \"you [Ukraine] should have never started it\". In response, Mr Zelenskyy said on Wednesday the American leader is living in a \"disinformation space\" created by Russia, which has repeatedly sought to blame Ukraine for the war.  Mr Trump has since hit back, saying Mr Zelenskyy \"better move fast or he is not going to have a country left\" and branding him a \"dictator\". Mr Zelenskyy was elected as president of Ukraine in May 2019. Elections were previously scheduled to go ahead in 2024, but they were not held as a result of martial law being in place. Ex-PM: Trump's comments intended to 'shock Europeans into action' Ms Badenoch's remarks come after reports that Tory MPs wanted her to take a stand on Ukraine since Mr Trump's interventions. Ukraine latest: Trump calls Zelenskyy a 'dictator ' Europe is scrambling to respond to a US shift in foreign policy - with Mr Trump making clear that Washington no longer sees the defence of the continent as its primary concern. Earlier on Wednesday, former prime minister Boris Johnson, who was in office when the war began, claimed Mr Trump's statements are \"not intended to be historically accurate but to shock Europeans into action\". He asked when Europeans will \"stop being scandalised about Donald Trump and start helping him to end this war?\" However on the other end of the political spectrum, Liberal Democrat leader Sir Ed Davey said that \"calling Mr Zelenskyy a 'dictator' must be where the line is drawn\". \"It is my sincere hope that the whole political spectrum in the United Kingdom will speak with one voice in opposition to Trump's lies.\" However defence secretary John Healey earlier reacted to the US president's claim that Ukraine started the war. The cabinet minister told reporters on a visit to Norway, near the border with Russia: \"Three years ago, one country illegally invaded another, and since then, the Ukrainians have been fighting for their freedom. \"They've been fighting for their future, and they still are. So whilst all the focus may be on talks, not even negotiations, our concern as defence ministers is that we're not jeopardising the peace by forgetting about the war.\""
    },
    {
        "title": "'Most dangerous' time to be Muslim in UK as Islamophobic incidents reach record level, monitoring organisation says",
        "description": "It is now the \"most dangerous\" time to be a Muslim living in the UK, a monitoring organisation has told Sky News.",
        "url": "https://news.sky.com/story/most-dangerous-time-to-be-muslim-in-uk-as-islamophobic-incidents-reach-record-level-monitoring-organisation-says-13312705",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-islamophobia-muslim_6833807.jpg?20250219155411",
        "type": "UK",
        "Author": "Sabah Choudhry",
        "Date Published": "2025-02-19 15:49:00",
        "Headline": "Tell Mama says the Southport murders, the UK general election and tensions in the Middle East have contributed to the sharp rise in anti-Muslim hate cases.",
        "Content": "\n          News correspondent\n       It is now the \"most dangerous\" time to be a Muslim living in the UK, a monitoring organisation has told Sky News. Tell Mama, which tracks anti-Muslim hatred, also said Islamophobic incidents have reached a record level. It said 5,837 reports of anti-Muslim hate were made in 2024 - the most it has received in a single year. The figure compares to 3,767 in 2023 and 2,201 in 2022, according to the organisation. This is a rise of 165% in two years. It also said Islamophobic assaults surged by 73% in 2024 - with men targeted more than women. In a new report, Tell Mama said that specific events, including the Southport stabbings, the UK general election, the Hamas-led attacks on October 7 in 2023 and the subsequent war in Gaza contributed to the \"notable spikes\". The latter, it said, resulted in \"record levels of reports\" - including over 2,000 cases in the first 100 days following October 7. The impact of Israel's assault on Gaza \"has left some people questioning their safety and sense of belonging in the UK\", the report added. Tell Mama said that anti-Muslim hate and extremism \"continue to be on a sharp upward trend in our country\". Its report said: \"We cannot and should never be complacent or dismissive of anti-Muslim hate as some social and political commentators are. \"Nor should we forget the very basic fact that Muslim communities should never be dehumanised or marginalised because of their identity.\" Read more on Sky News:Female British journalist missing in BrazilBanking giant confirms plans to axe UK jobsLarge sinkhole forces closure of Surrey street In response to these figures, the Muslim Council of Britain (MCB) told Sky News that it is \"deeply troubled\" by the sharp increase of Islamophobic assaults in 2024 - describing it as \"an unprecedented crisis culminating in last summer's violent riots\". The MCB warned: \"Our decision makers face a stark choice: ignore this hatred or confront it properly.\" The council is calling on the government to tackle \"anti-Muslim bigotry\" through a \"comprehensive national strategy\", and on everyday Britons to \"stand together\" against this \"alarming trend\" of anti-Muslim violence. A government spokesperson has described Tell Mama's report findings as \"extremely concerning\". They said: \"Attacks on and hatred against Muslim communities are completely unacceptable and have no place in our society. \"We will seek to stamp out anti-Muslim hatred and racism wherever it occurs. \"We are absolutely determined to bridge divisions between communities and are working closely with community groups, charities, and public sector partners to tackle hatred in all its forms.\""
    },
    {
        "title": "Parts of UK brace for 70mph gusts and heavy rain as weather warnings issued",
        "description": "Gusts of up to 70mph and heavy rain will bring potentially \"dangerous\" conditions and travel disruption to parts of the UK later this week, forecasters have warned.",
        "url": "https://news.sky.com/story/parts-of-uk-brace-for-70mph-gusts-and-heavy-rain-as-weather-warnings-issued-13312699",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-waves-weather-kent_6833835.jpg?20250219161744",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-19 15:39:00",
        "Headline": "The Met Office says after Friday's conditions, Saturday is expected to be a drier day but there is still the potential for further warnings on Sunday amid more wind and rain.",
        "Content": "Gusts of up to 70mph and heavy rain will bring potentially \"dangerous\" conditions and travel disruption to parts of the UK later this week, forecasters have warned. Warmer weather is also on the way and temperatures could peak at 16C (60.8F) in some places on Friday, the Met Office said. Yellow warnings have been issued for strong winds on Friday from 6am to 10am for eastern parts of Northern Ireland, and from 8am until 3pm for southwest Scotland and parts of Wales. Gusts of up to 70mph are expected, said the Met Office.  Find out the forecast for your area There is also a yellow warning for rain on Friday from 6am until 6pm for southwest and northeast Scotland, with the forecaster warning travel disruption, power cuts, and flooding are \"likely\". The Met Office said: \"Friday's warnings highlight potential travel disruption, dangerous conditions near coasts and the possibility of power cuts for some.\" Met Office deputy chief meteorologist Mike Silverstone said: \"The weather will be turning milder for much of the country from Thursday, but this transition heralds the start of some potentially more impactful wind and rain. \"While Thursday will see blustery winds and rain for many, it's Friday when we could see more impacts, with warnings issued for wind and rain.\" He said there would be winds of around 70mph on \"exposed coasts\" and 60mph \"more widely\" within the warning areas. \"Rain is an additional hazard, with 30-40mm likely in parts of Scotland over a six-hour period, and up to around 70mm possible over higher ground within the warning areas,\" he added. Read more from Sky News:EastEnders' best bits as soap turns 40Odds of asteroid hitting Earth rise again  Saturday is expected to be a drier day across the country, but those in the South East may see the remnants of Friday's rain drifting through the day. More rain and wind is expected from Sunday, according to the Met Office. Forecasters said there is the \"potential for further warnings\" on Sunday as details are \"firmed up\" in the days ahead."
    },
    {
        "title": "Donald Trump hits back at 'terrible' Volodymyr Zelenskyy and calls him a 'dictator' amid US-Russia talks",
        "description": "Donald Trump has said Volodymyr Zelenskyy \"better move fast or he is not going to have a country left\" as peace talks between the US and Russia continue &#8211; without Ukraine at the table.",
        "url": "https://news.sky.com/story/donald-trump-hits-back-at-terrible-volodymyr-zelenskyy-and-calls-him-a-dictator-amid-us-russia-talks-13312719",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-president_6833230.jpg?20250219002234",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-19 16:05:00",
        "Headline": "Donald Trump's comments come after Volodymyr Zelenskyy said the US president is living in a Russian-made \"disinformation space\". ",
        "Content": "Donald Trump has said Volodymyr Zelenskyy \"better move fast or he is not going to have a country left\" as peace talks between the US and Russia continue – without Ukraine at the table. Officials from the White House and the Kremlin have this week begun holding discussions in Saudi Arabia. The decision for the talks to take place without representatives from Kyiv or Europe has caused concern, and sparked an emergency meeting of European leaders in France earlier this week. Mr Trump's latest comments - in which he also calls Mr Zelenskyy \"a dictator without elections\" - come after the Ukrainian president accused him of living in a Russian-made \"disinformation space\" as a result of his administration's discussions with Kremlin officials.  Ukraine latest: Follow updates as Putin makes peace talks claim In a post on his social media platform TruthSocial, the US president said Mr Zelenskyy had \"talked the United States of America into spending $350 billion dollars, to go into a war that couldn't be won, that never had to start\". \"The only thing he was good at was playing Biden 'like a fiddle',\" he added. Mr Trump continued: \"Zelenskyy better move fast or he is not going to have a country left. \"In the meantime, we are successfully negotiating an end to the War with Russia, something all admit only 'TRUMP,' and the Trump Administration, can do. \"Biden never tried, Europe has failed to bring peace, and Zelenskyy probably wants to keep the 'gravy train' going.\" \"I love Ukraine, but Zelenskyy has done a terrible job, his country is shattered, and MILLIONS have unnecessarily died - And so it continues,\" he wrote. Mr Trump later repeated his comments in a rambling speech to a Saudi-run investment forum in Miami. Top end estimates suggest hundreds of thousands of people, most of them soldiers, have died in the Russia-Ukraine conflict. Millions of Ukrainians have fled their country as refugees. Mr Trump also repeated his claim that the Ukrainian president has low approval ratings - which has already been dismissed by Mr Zelenskyy as Russian disinformation - and claimed American aid money had been misused. The latest poll, carried out by the Kyiv International Institute of Sociology in early February, found 57% of Ukrainians trust their leader. Ukraine's general election, scheduled for April 2024, were delayed because of Russia's invasion in February 2022.  Speaking after Mr Trump's comments, Mr Zelenskyy called for pragmatism from the US. He said in his nightly address: \"We are standing strong on our own two feet. I am counting on Ukrainian unity, our courage… on the unity of Europe and the pragmatism of America.\" Meanwhile, German Chancellor Olaf Scholz said the US president labelling Mr Zelenskyy a \"dictator\" is \"false and dangerous\", German newspaper Spiegel reported. \"It is simply wrong and dangerous to deny President Zelenskyy his democratic legitimacy,\" Mr Scholz said. Putin: 'No one is excluding Ukraine from talks'  Mr Trump's latest post comes after Vladimir Putin insisted Kyiv could have a seat at the negotiating table. The Russian president said earlier on Wednesday: \"No one is excluding Ukraine from peace talks.\" \"We are ready, I have already said this a hundred times - if they want, please let these negotiations take place and we will be ready to return to the table,\" he said. More from Sky News:Analysis: Ukraine is fighting war on two frontsTrump 'disappointed' by Ukraine  Referencing Mr Zelenskyy's 2022 decree that rejected talks with Moscow, he added: \"The Europeans have stopped contacts with Russia. The Ukrainian side has forbidden itself to negotiate.\" According to the Russian leader, the \"goal and subject\" of Tuesday's talks in Saudi Arabia \"was the restoration of Russia-US relations\". Mr Zelenskyy is expected to meet later with Keith Kellogg, the US special envoy for Ukraine and Russia, who arrived in Kyiv on Wednesday. 👉 Follow Trump 100 on your podcast app 👈 Russia launches assault on Odesa Overnight, Russian forces launched a drone attack on Ukraine's Black Sea port city of Odesa, injuring four people including a child, Mr Zelenskyy said. At least 160,000 people were left without heating in sub-zero temperatures, he added. \"Rescue operations are under way in Odesa after another Russian attack on the energy infrastructure,\" Mr Zelenskyy said on the Telegram app. \"It is civilian energy facilities against which the Russian army has not spared neither missiles nor attack drones for almost three years.\""
    },
    {
        "title": "Ukraine's president is fighting a war on two fronts - against Russian forces on the ground and against American assaults over the airwaves",
        "description": "Ukraine's president appears to be fighting a war on two fronts - against Russian forces on the ground and against American assaults over the airwaves.",
        "url": "https://news.sky.com/story/ukraines-president-is-fighting-a-war-on-two-fronts-against-russian-forces-on-the-ground-and-against-american-assaults-over-the-airwaves-13312629",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-volodymyr-zelenskyy_6833510.jpg?20250219140707",
        "type": "World",
        "Author": "Deborah Haynes, security and defence editor, and Ivor Bennett, Moscow correspondent",
        "Date Published": "2025-02-19 13:28:00",
        "Headline": "Ukraine's President Volodymyr Zelenskyy has accused US President Donald Trump of being \"trapped in a disinformation bubble\".",
        "Content": "By Deborah Haynes, security and defence editor, and Ivor Bennett, Moscow correspondent  Ukraine's president appears to be fighting a war on two fronts - against Russian forces on the ground and against American assaults over the airwaves. View from Ukraine by Deborah Haynes, security and defence editor With Donald Trump openly attacking him, Ukraine's president is dispensing with the diplomatic niceties towards a crucial partner and is instead fighting back. It is a risky move given the heavy reliance of Volodymyr Zelenskyy on American military support to fight Russia's invasion and the US leader's dislike of criticism. But the past week of disruptive, strongman diplomacy from the White House - upending traditional assumptions about US support for European and Ukrainian security - has clearly been too much for Kyiv to stomach without speaking back, and bluntly. Mr Zelenskyy used a press conference inside the presidential compound on Wednesday to say the American commander in chief is surrounded by a circle of disinformation after Mr Trump falsely claimed Ukraine was to blame for Russia's war and that Mr Zelenskyy has a public approval rating of just 4%.  The US president is pushing for elections in Ukraine - something that would be very difficult to conduct while the country is still under Russian missile and drone attack and with hundreds of thousands of Ukrainians fighting on the frontline. \n                  Why all roads lead through Riyadh - as Saudi Arabia emerges as key global power broker\n                 \n                  Kemi Badenoch breaks her silence on Ukraine – finally\n                 \n                  Starmer backs 'democratically elected' Zelenskyy after Trump 'dictator' jibe at Ukrainian leader\n                 Mr Zelenskyy said the most recent surveys showed 57% of the population supported him - a similar rating to Mr Trump. He also issued his strongest criticism yet of an attempt by the Trump administration to make Kyiv sign away half of the wealth it has from rare minerals and other natural resources - equal in value to about $500bn. Mr Zelenskyy said he could not \"sell our state\", adding this was not a \"serious\" conversation. But he knows that he does need to have serious dialogue with Washington even after President Trump picked up the phone to Vladimir Putin a week ago, kicking off a thawing of ties between Moscow and Washington that led to a meeting of top US and Russian officials in Saudi Arabia on Tuesday and plans for a summit between the American and Russian presidents. A first step will be engaging with Keith Kellogg, a retired lieutenant general currently Mr Trump's envoy to Ukraine and Russia, who arrived in Kyiv on Wednesday morning - though was curiously absent from the Saudi Arabia talks despite his job title. Ukraine's president said he will talk with Mr Kellogg and would like to take him to visit the frontline and speak to soldiers to understand their view, while also talking to members of the public in the capital to hear what they have to say about the war, Mr Zelenskyy's efforts and also the comments by Mr Trump. The envoy, speaking to a small group of journalists when he stepped on the train, said he was there to listen and report back to Mr Trump.  Asked how confident he was that he would be able to bring Mr Zelenskyy to the negotiating table, Mr Kellogg said: \"I'm always confident.\" The coming days will tell whether that confidence is well placed. Read more:Trump's diplomacy does not look good for UkraineTrump 'disappointed' by Ukraine's reaction to talks View from Russia by Ivor Bennett, Moscow correspondent Volodymyr Zelenskyy had the appearance of a beleaguered leader who knows he is now fighting a war on two fronts - against Russian forces on the ground and against American assaults over the airwaves. Ukraine's leader looked almost shell-shocked from Donald Trump's verbal volleys last night, in which the US president accused Kyiv of starting the war. What has been Ukraine's biggest supporter now suddenly poses an existential threat. But for now, Mr Zelenskyy is fighting back. He accused Mr Trump of being \"trapped in a disinformation bubble\" - that he has not just drunk the Kremlin's Kool-Aid, but is now bathing in it. He pushed back on Mr Trump's spurious claims of only having a 4% approval rating, calling it propaganda from Russia. Moscow has repeatedly tried to portray Mr Zelenskyy as an illegitimate leader, due to his term expiring under martial law. In reality, his numbers are similar to Mr Trump's, which should resonate with a man who became obsessed with TV ratings during his first term. But it seems that facts do not always matter now to the White House. And he was extremely dismissive - to the point of ridicule, almost - of the proposed US/Ukraine mineral deal. \"Not a serious conversation\", he said, rejecting Mr Trump's business-first approach. Mr Zelenskyy still wants the focus on Ukraine's scorched earth, not rare earths. His messages and manner are in stark contrast to those of Vladimir Putin. Ever since the US election in November, the Russian president has sought to flatter Mr Trump, sympathise with him and be deferential, even when responding to barbs. And in Riyadh yesterday, Moscow began reaping the rewards. But Mr Zelenskyy's position is different, of course. Once the man of the moment, he's now struggling to stay relevant - in danger of being run down by the Donald Trump deal-making juggernaut. For now, he's standing in the road trying to stop it. But any hope that it will change course or hit the brakes may be misplaced."
    },
    {
        "title": "Why all roads lead through Riyadh - as Saudi Arabia emerges as key global power broker",
        "description": "At the Faena Hotel on Miami Beach, at breakfast, I overheard the conversation on the next table.",
        "url": "https://news.sky.com/story/why-all-roads-lead-through-riyadh-as-saudi-arabia-emerges-as-key-global-power-broker-13312894",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-saudi-arabia-sergei-lavrov_6834106.jpg?20250219211130",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-02-19 20:37:00",
        "Headline": "Since Donald Trump was last president, the kingdom has matured and emboldened its geopolitical clout. Back in his first term, Mr Trump recognised the value in Saudi Arabia. This time, Saudi Arabia is harnessing Mr Trump's power.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n At the Faena Hotel on Miami Beach, at breakfast, I overheard the conversation on the next table. \"Trump is creating instability,\" one man said to the other, who disagreed. It was a good natured but forthright debate that cut to the heart of a global divide right now about the language and actions of the world's most powerful man. The two men were guests at a Saudi-run investment forum taking place over the next three days here in Miami. The Future Investment Initiative (FII) is sometimes described as 'Davos in the desert'. The principal conference takes place every year in Saudi Arabia. It's run by the Saudi Sovereign Wealth Fund and describes itself as \"an annual event bringing people together to invest in the most promising solutions\". This Miami event is an offshoot of the Riyadh conference and it draws the very wealthiest from the world of finance, tech, innovation, politics, philanthropy and beyond. \n                  Kemi Badenoch breaks her silence on Ukraine – finally\n                 \n                  Starmer backs 'democratically elected' Zelenskyy after Trump 'dictator' jibe at Ukrainian leader\n                 \n                  Starmer meets Trump - but how does he prepare?\n                 I recognised one of the men at breakfast as a billionaire philanthropist. I'll protect his identity given his conversation was private. But, safe to say, Mr Trump is the talk of the conference. The seminars over the next three days - or 'invite-only conclaves' as they are described - hit all the notes of the moment. \"Do states own the oceans?\", \"The end of multilateralism and what it means for the world\", \"How to create resilient economies for uncertain times\", and \"Is a new era of US-Middle East economic cooperation dawning?\" were among the topics being discussed. That last event bills Trump's point man/dealmaker for the Middle East (and Russia-Ukraine), Steve Witkoff as the main speaker. The moderator is Jared Kushner, Trump's son-in-law and the man who first raised the prospect of a 'Gaza Riviera'. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 The first speaker at the event was the American president himself. Donald Trump is determined to see massive Saudi investment in America to the tune of $1trn (£794bn). In return, he is investing in Riyadh too. Saudi Arabia, the host of this glitzy event, has emerged as a key global power broker. The Tuesday Russia-US talks were in Riyadh. The expected Trump-Putin meeting will be there too. Since Donald Trump was last president, the kingdom has matured and emboldened its geopolitical clout. Back in his first term, Mr Trump recognised the value (literally) in Saudi Arabia. This time, Saudi Arabia is harnessing Mr Trump's power. They know money talks and that he likes to be kept close. Saudi Arabia is playing a strategic geopolitical game and it's plainly transactional. Essentially, it is saying \"we want to invest, we want you to, but we also have our own agenda in regional diplomacy\". On the Middle East, Saudi red lines over Gaza and the prospects of Arab diplomatic normalisation with Israel are a backstop to a total Trump-Netanyahu wipeout of the Palestinians. More from Sky News:Starmer backs ZelenskyyUkraine is 'fighting on two fronts'Trump 'disappointed' by Ukraine On Ukraine-Russia, the Saudis are more than happy to host as mediators. It puts them centre stage. On Iran, they have buried the hatchet with the supreme leader and could play a key role in any new nuclear deal. There was a time when the diplomatic roads ran through the obvious places; Washington, London, Brussels, Berlin, Paris. Now, it's Florida and Saudi Arabia. Brussels, London, Berlin, Paris and even the opposition in Washington are wholly left out."
    },
    {
        "title": "Tomb of Egyptian pharaoh found in 'remarkable discovery' - the first since Tutankhamun",
        "description": "The tomb of an Egyptian pharaoh has been found for the first time since Tutankhamun was discovered in 1922.",
        "url": "https://news.sky.com/story/tomb-of-egyptian-pharaoh-found-in-remarkable-discovery-the-first-since-tutankhamun-13312871",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-egypt-tomb-thutmose-ii_6834092.jpg?20250219210350",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-19 20:00:00",
        "Headline": "The tomb was uncovered by a joint British-Egyptian mission, about 1.5 miles west of the Valley of the Kings in Luxor's western mountain region.",
        "Content": "The tomb of an Egyptian pharaoh has been found for the first time since Tutankhamun was discovered in 1922. In what has been dubbed a \"remarkable discovery\", the tomb of Thutmose II, the last missing royal tomb of the 18th dynasty, was found in the Western Valleys of the Theban Necropolis in Egypt. The tomb was uncovered by a joint British-Egyptian mission, about 1.5 miles west of the Valley of the Kings in Luxor's western mountain region. Objects recovered from the mission included fragments of alabaster jars (used to store perfumes, oils, and ointments) inscribed with the name Pharaoh Thutmose II, as well as inscriptions bearing the name of his wife Queen Hatshepsut - who became one of Egypt's few female pharaohs who ruled in her own right. For the first time ever, funeral furniture belonging to the pharaoh was found, according to Egypt's Ministry of Tourism and Antiquities. No funeral furniture of Thutmose II currently exists in any museum worldwide. The mission was formed by the New Kingdom Research Foundation (NKRF), a British independent academic foundation, and the Ministry of Tourism and Antiquities, a project affiliated to the McDonald Institute for Archaeological Research at the University of Cambridge. \"This discovery solves a great mystery of Ancient Egypt: the location of the tombs of the early 18th dynasty kings,\" said mission leader and field director Piers Litherland. \"The tomb of this ancestor of Tutankhamun had never been found because it was always thought to be at the other end of the mountain near the Valley of the Kings. \"Initially we thought we might have found the tomb of a royal wife, but the wide staircase and the large doorway suggested something more important. \"The discovery that the burial chamber had been decorated with scenes from the Amduat, a religious text which is reserved for kings, was immensely exciting and was the first indication that this was a king's tomb.\" Thutmose II died 3,500 years ago. He is believed to have ruled for around 14 years, from about 1493 to 1479 BCE, and fathered one child, Thutmose III. Read more from Sky News:Odds of asteroid hitting Earth rise againFather 'very concerned' as British journalist missing in BrazilPope Francis 'jokes around' with Giorgia Meloni Mohamed Abdel Badi, head of the Egyptian antiquities sector and co-leader of the mission, said the tomb was discovered in a poor state due to flooding that occurred shortly after the pharaoh's death. Archaeological evidence suggests the contents were moved to a second tomb due to the flood. Mohsen Kamel, assistant field director, said: \"The possible existence of a second, and most likely intact, tomb of Thutmose II is an astonishing possibility.\""
    },
    {
        "title": "Odds of 2024 YR4 asteroid hitting Earth rise again",
        "description": "The risk of the 2024 YR4 asteroid hitting Earth at the end of 2032 has increased again, according to NASA data.",
        "url": "https://news.sky.com/story/odds-of-2024-yr4-asteroid-hitting-earth-rise-again-13312577",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-asteroid-earth-space_6826746.jpg?20250212165816",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-19 12:04:00",
        "Headline": "Data shows the asteroid is the most threatening to Earth in modern forecasting and would cause \"severe damage\" to a region if it makes impact - while scientists have just a few more weeks to observe the asteroid before it disappears from view until 2028.",
        "Content": "The risk of the 2024 YR4 asteroid hitting Earth at the end of 2032 has increased again, according to NASA data. Latest calculations have shown a 3.1% chance of the space rock making impact in just under eight years. It is a significant change since the European Space Agency (ESA) estimated in January there was 1.2% chance of a direct hit. More recent calculations showed the odds had fallen 2.3%. In comparison, astronomers say the chance of winning big on the lottery is about one in 14 million. The increased odds mean the asteroid - which is around the size of a football pitch - is the most threatening to Earth in modern asteroid forecasting and would cause \"severe damage\" to a region if it makes impact. Scientists continue to stress there is no need for alarm and that the odds of an impact will fluctuate. They are working to gather a better understanding of the asteroid's trajectory. NASA and the ESA's Webb Space Telescope will observe the asteroid for a few more weeks before it disappears from view as it heads towards Jupiter. It will not be able to be viewed again until 2028.  NASA calculations show possible 'risk corridor' Data also currently shows if the rock enters the Earth's atmosphere on 22 December 2032, it is likely to head along a large central belt of our planet and over numerous major cities. Estimates say the rock would travel \"somewhere\" along a \"risk corridor\" above areas which are home to millions of people - but NASA data does not currently say which cities and major towns would be in this zone. NASA scientists said: \"In the unlikely event that 2024 YR4 is on an impact trajectory, the impact would occur somewhere along a risk corridor which extends across the eastern Pacific Ocean, northern South America, the Atlantic Ocean, Africa, the Arabian Sea, and South Asia.\" Asteroids are space rocks that scientists believe are the leftovers from the solar system's formation 4.6 billion years ago. Read more:What we know about the asteroidNuclear weapon 'could deflect asteroid' There are millions of rocks orbiting between Mars and Jupiter in a region known as the main asteroid belt. They sometimes get pushed out of the belt and pick up a new course, such as this one. Experts have already said it will be no surprise to them if the impact probability eventually drops to zero \"at some point\"."
    },
    {
        "title": "Pope Francis 'jokes around' with Giorgia Meloni after 'tranquil' fifth night in hospital",
        "description": "Pope Francis&#160;\"joked around\" with Giorgia Meloni after spending a \"tranquil\" fifth night in hospital, where he is undergoing treatment for pneumonia, Italy's prime minister has said.",
        "url": "https://news.sky.com/story/vatican-issues-update-on-popes-health-13312383",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pope-francis-pope_6833354.jpg?20250219081843",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-19 06:48:00",
        "Headline": "The pontiff, who was admitted to hospital on Friday, has been receiving treatment for bilateral pneumonia.",
        "Content": " Pope Francis \"joked around\" with Giorgia Meloni after spending a \"tranquil\" fifth night in hospital, where he is undergoing treatment for pneumonia, Italy's prime minister has said. After visiting the pontiff on Wednesday, Ms Meloni's office said in a statement the 88-year-old was \"alert and responsive\" and they \"joked around as always,\" adding he had \"not lost his proverbial sense of humour\". In an update on Wednesday evening, the Vatican said the pontiff has shown \"slight improvement\" in results from recent blood tests. Ms Meloni was the Pope's first confirmed visitor who wasn't a secretary or part of his medical team since he was taken to Rome's Gemelli hospital on Friday to be treated for bronchitis. Francis slept well, got out of bed, and ate breakfast on Wednesday, the Vatican said after tests confirmed he had developed bilateral pneumonia - which means both lungs are infected. Officials cancelled his weekend engagements. As a young adult, he had part of one of his lungs removed after contracting pleurisy. \n                  Donald Trump hits back at 'terrible' Volodymyr Zelenskyy and calls him a 'dictator' amid US-Russia talks\n                 \n                  Ukraine's president is fighting a war on two fronts - against Russian forces on the ground and against American assaults over the airwaves\n                 \n                  Why all roads lead through Riyadh - as Saudi Arabia emerges as key global power broker\n                 The Vatican said tests, X-rays and the Pope's clinical condition continued to present \"a complex picture\". Matteo Bruni, director of the Holy See press office, said Pope Francis was in good spirits and was grateful for people's prayers. The Pope is said to have been reading newspapers and doing some work from his hospital room during his stay. Concerns have been growing about the pontiff's increasingly frail health. Francis, who has been pontiff since 2013, has had influenza and other health problems several times over the past two years. Pilgrims arriving at the Vatican this week have offered their prayers that the Pope would recover soon. Bilateral pneumonia is a serious condition which can affect breathing, after causing inflammation and scarring of the lungs. Read more from Sky News:EastEnders' best bits as soap turns 40The Jam drummer Rick Buckler dies The Vatican has so far not given any indication of how long the Pope will have to stay in hospital. A spokesperson said the clinical picture had required several changes in his drug regimen and he would require an \"adequate\" stay."
    },
    {
        "title": "Emma Raducanu posts update after becoming visibly upset during tennis match",
        "description": "Emma Raducanu has said she will \"be okay\" after being approached by a man displaying \"fixated behaviour\".",
        "url": "https://news.sky.com/story/emma-raducanu-visibly-distressed-after-being-approached-by-man-displaying-fixated-behaviour-at-dubai-tennis-championships-13312406",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-emma-raducanu-tennis_6833366.jpg?20250219084047",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-19 07:45:00",
        "Headline": "Raducanu previously had a stalker - who in 2022 was handed a five-year restraining order, after a court heard she was \"constantly looking over her shoulder\".",
        "Content": " Emma Raducanu has said she will \"be okay\" after being approached by a man displaying \"fixated behaviour\". The British tennis star was later visibly upset during a game at the Dubai Tennis Championships after the man was among the crowds in the first few rows. On Instagram on Wednesday, she wrote: \"Thank you for the messages of support. Difficult experience yesterday but I'll be okay and proud of how I came back and competed despite what happened at the start of the match. \"Thank you to Karolina [Muchova] for being a great sport and best of luck to her for the rest of the tournament.\" Along with her message she posted an image of the Jane Austen novel Emma and a cup of coffee. The 22-year-old was in tears as she went to the umpire's chair after the second game of her rain-delayed second-round match on Tuesday. The man was subsequently removed from the tennis court by security. Raducanu went on to lose 7-6 (8-6) 6-4 to 14th seed Karolina Muchova. The Women's Tennis Association (WTA) statement said: \"On Monday, February 17, Emma Raducanu was approached in a public area by a man who exhibited fixated behaviour. \"This same individual was identified in the first few rows during Emma's match on Tuesday at the Dubai Duty Free Tennis Championships and subsequently ejected. \"He will be banned from all WTA events pending a threat assessment. \"Player safety is our top priority, and tournaments are advised on security best practices for international sporting events.\" The WTA added it was \"actively working\" with Raducanu to ensure her well-being and will provide any \"necessary support\". In 2022, a 35-year-old man was handed a five-year restraining order - after a court heard Raducanu was \"constantly looking over her shoulder\" and no longer felt \"safe in her own home\". Amrit Magar had walked 23 miles to Emma's home and had stolen her father's shoe as a souvenir. Read more on Sky News:Trump blames Ukraine for war against RussiaInflation hits 10-month highVatican update on Pope's health Bromley Magistrates' Court heard how Magar went to Raducanu's home on three separate occasions, loitered outside, left unwanted gifts and cards, and stole property from their porch. The court also heard from Raducanu through a victim impact statement read by prosecutors - which said that her parents were \"reluctant\" to let her go out on her own. The restraining order, handed to Magar by District Judge Sushil Kumar, bans him from contacting Raducanu and her parents."
    },
    {
        "title": "Father 'very concerned' as British journalist Charlotte Peet missing in Brazil",
        "description": "The father of a British journalist who is missing in Brazil has said her disappearance is \"very worrying\" and he is \"very concerned\".",
        "url": "https://news.sky.com/story/british-journalist-charlotte-peet-missing-in-brazil-13312420",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-charlotte-peet-missing_6833365.jpg?20250219104019",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-19 08:33:00",
        "Headline": "The freelance correspondent was last known to have been in Sao Paulo before losing contact with her family. ",
        "Content": "The father of a British journalist who is missing in Brazil has said her disappearance is \"very worrying\" and he is \"very concerned\". Derek Peet told Sky News his daughter Charlotte Alice Peet, 32, flew to the South American country, where she had worked as a freelance correspondent, without telling her family. \"I wouldn't say that it was normal, there was something on her mind obviously otherwise she would have let us know,\" he said. Ms Peet told a friend she was in Sao Paulo on 8 February but was planning to go to Rio de Janeiro before she disappeared. Days later her family contacted the friend saying they had lost contact with the journalist and her mother reported her missing to police. \"She was then traced to Gatwick Airport and was found to have boarded a plane to Sao Paulo and then the trail went cold,\" said Mr Peet. \"It's very worrying but I don't have any more to say, I'm very concerned but I just don't know what's going on, we're just trying to pick up the pieces really.\" \n                  Jair Bolsonaro: Former Brazilian president charged over alleged coup plot to poison successor\n                 \n                  Brazil: Indigenous man returns to tribe after rare encounter in Amazon village\n                 \n                  Two dead after plane crashes into vehicles on busy road in Sao Paulo\n                 Ms Peet has worked as a foreign correspondent in Brazil, for organisations including broadcaster Al Jazeera and The Times newspaper, according to her LinkedIn profile. The ACIE, the association of foreign press correspondents in Brazil, has issued a statement expressing concern about her disappearance, and to express sympathy for her family and friends. It said the case was initially registered with police in Rio on Monday but referred to Sao Paulo, the last place she was known to have been before disappearing. The Sao Paulo Public Security Secretariat said that the state department of homicide and protection of the person would assist in the case, according to the statement. Read more from Sky News:Vatican issues update on Pope's healthFormer Brazilian president charged over alleged coup Charlotte worked in Rio more than two years ago as a freelance correspondent, then went back to London before returning to Brazil in November last year. She is said to have contacted a friend in Rio on WhatsApp saying she needed a place to stay but was told the friend could not host her. Ms Peet's family have provided information about her flight to Brazil and a photo of her passport to help with the search. \"The ACIE and its board of directors call on the competent authorities to intensify the search in order to find the British journalist as soon as possible,\" a statement on behalf of its president Edmar Figueiredo and its board of directors said. A Foreign Office spokesperson said: \"We are supporting the family of a British woman who has been reported as missing in Brazil and are in contact with the local authorities.\""
    },
    {
        "title": "Alice Weidel: The woman at the top of Germany's far-right AfD party",
        "description": "Alice Weidel may not be the person you would imagine at the top of Germany's far-right political movement.",
        "url": "https://news.sky.com/story/alice-weidel-the-woman-at-the-top-of-germanys-far-right-afd-party-13312517",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-alice-weidel-germany_6827640.png?20250213133320",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-02-19 10:57:00",
        "Headline": "Alice Weidel might not be what you would expect as leader of the far-right Alternative for Germany party. She's gay with a Sri Lankan partner and is not a full-time resident of the country. Here's what to know about her.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n Alice Weidel may not be the person you would imagine at the top of Germany's far-right political movement. She's gay with a Sri Lankan partner, the film-maker Sarah Bossard. And Ms Weidel, the leader of a party that obsesses about its love for Germany, is not even a full-time resident of the country. Instead, she splits her time between Berlin and Switzerland, along with her partner and their two sons. What's more, she's a West German at the top of the AfD, which is, and has always been, far stronger in East Germany. In a party that is often accused of harbouring extremists, she comes across as more reasoned and less obsessive. Ms Weidel, it is said, is the AfD's key to reaching Germans from three crucial areas - the middle classes, the politically unsure, and the country's West. But it would be wrong to consider her a moderate. She may have joined the AfD because of its economic policies, but she has enthusiastically endorsed the party's move to focus more on migration and German nationalism. Immigrants, she once said, were made up of \"burqas, girls in headscarves, knife-wielding men on government benefits and other good-for-nothing people\". It was a phrase that earned her censure from rivals in the centre, and respect from those on the right who see migration as a national threat. \n                  Is Germany turning to the far-right? Inside the country's battle for power\n                 \n                  Sir Keir Starmer joins Europe in confronting reality of Trump and Putin's emerging new world order\n                 \n                  German elections are usually dull affairs - but it's different this time\n                 As a speaker, she is strident, radical and unapologetic. She describes herself as a \"liberal conservative\" but, when I saw her speak at her party conference earlier this year, she demanded the \"large scale repatriation of foreigners\" - a policy once seen as toxic, but now spelt out by her in syllables - \"re-mi-gra-tion\", Ms Weidel said, emphatically, to the sound of cheers.  Ms Weidel, a gay parent, has endorsed the definition of a family as being specifically mother, father and children. She says legalising gay marriage is unimportant. She has claimed that Germany is the real victim of the war in Ukraine, due to the economic damage it has, and will, suffer. The war, she said, \"is not our issue at all\" and claims that, when it ends, Ukraine should be held to account. Ms Weidel was born in Gutersloh, a town of around 100,000 people roughly halfway between Dortmund and Hanover, where she said she was repeatedly insulted and abused by immigrants from the Middle East. She studied in Germany's east, in Bayreuth, then worked for Goldman Sachs and the Bank of China, spending six years living in China. Read more:German elections are usually dull affairs - this time is differentMother and daughter die after car ramming attack She is a fan of economic liberalism - declaring Margaret Thatcher to be her role model, and championing, for example, low taxes and the abolition of inheritance tax. Only recently, grudgingly, has she accepted it is no longer practical for Germany to stop using the Euro as its currency, but her Euroscepticism remains. The past of her country and her own family sit over her role as the AfD's leader. Ms Weidel's grandfather, Hans Weidel, was a Nazi judge, appointed by Adolf Hitler, a fact of which she claims to have been oblivious until researchers revealed it to her. During a live chat with Elon Musk, since viewed millions of times online, she claimed the Nazis were \"not right-wing\" and said Hitler was \"a communist, socialist guy\". In fact, Hitler loathed communists and socialists; they were some of the first people sent to concentration camps. She has questioned the point of Covid vaccines, doubted the evidence of global warming and echoed the \"great replacement\" theory of so many conspiracy theorists. For some, she is a dangerous, even ominous presence. For others, she is a refreshing and radical change."
    },
    {
        "title": "Donald Trump hits back at 'terrible' Volodymyr Zelenskyy and calls him a 'dictator' amid US-Russia talks",
        "description": "Donald Trump has said Volodymyr Zelenskyy \"better move fast or he is not going to have a country left\" as peace talks between the US and Russia continue &#8211; without Ukraine at the table.",
        "url": "https://news.sky.com/story/donald-trump-hits-back-at-terrible-volodymyr-zelenskyy-and-calls-him-a-dictator-amid-us-russia-talks-13312719",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-president_6833230.jpg?20250219002234",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-19 16:05:00",
        "Headline": "Donald Trump's comments come after Volodymyr Zelenskyy said the US president is living in a Russian-made \"disinformation space\". ",
        "Content": "Donald Trump has said Volodymyr Zelenskyy \"better move fast or he is not going to have a country left\" as peace talks between the US and Russia continue – without Ukraine at the table. Officials from the White House and the Kremlin have this week begun holding discussions in Saudi Arabia. The decision for the talks to take place without representatives from Kyiv or Europe has caused concern, and sparked an emergency meeting of European leaders in France earlier this week. Mr Trump's latest comments - in which he also calls Mr Zelenskyy \"a dictator without elections\" - come after the Ukrainian president accused him of living in a Russian-made \"disinformation space\" as a result of his administration's discussions with Kremlin officials.  Ukraine latest: Follow updates as Putin makes peace talks claim In a post on his social media platform TruthSocial, the US president said Mr Zelenskyy had \"talked the United States of America into spending $350 billion dollars, to go into a war that couldn't be won, that never had to start\". \"The only thing he was good at was playing Biden 'like a fiddle',\" he added. Mr Trump continued: \"Zelenskyy better move fast or he is not going to have a country left. \"In the meantime, we are successfully negotiating an end to the War with Russia, something all admit only 'TRUMP,' and the Trump Administration, can do. \"Biden never tried, Europe has failed to bring peace, and Zelenskyy probably wants to keep the 'gravy train' going.\" \"I love Ukraine, but Zelenskyy has done a terrible job, his country is shattered, and MILLIONS have unnecessarily died - And so it continues,\" he wrote. Mr Trump later repeated his comments in a rambling speech to a Saudi-run investment forum in Miami. Top end estimates suggest hundreds of thousands of people, most of them soldiers, have died in the Russia-Ukraine conflict. Millions of Ukrainians have fled their country as refugees. Mr Trump also repeated his claim that the Ukrainian president has low approval ratings - which has already been dismissed by Mr Zelenskyy as Russian disinformation - and claimed American aid money had been misused. The latest poll, carried out by the Kyiv International Institute of Sociology in early February, found 57% of Ukrainians trust their leader. Ukraine's general election, scheduled for April 2024, were delayed because of Russia's invasion in February 2022.  Speaking after Mr Trump's comments, Mr Zelenskyy called for pragmatism from the US. He said in his nightly address: \"We are standing strong on our own two feet. I am counting on Ukrainian unity, our courage… on the unity of Europe and the pragmatism of America.\" Meanwhile, German Chancellor Olaf Scholz said the US president labelling Mr Zelenskyy a \"dictator\" is \"false and dangerous\", German newspaper Spiegel reported. \"It is simply wrong and dangerous to deny President Zelenskyy his democratic legitimacy,\" Mr Scholz said. Putin: 'No one is excluding Ukraine from talks'  Mr Trump's latest post comes after Vladimir Putin insisted Kyiv could have a seat at the negotiating table. The Russian president said earlier on Wednesday: \"No one is excluding Ukraine from peace talks.\" \"We are ready, I have already said this a hundred times - if they want, please let these negotiations take place and we will be ready to return to the table,\" he said. More from Sky News:Analysis: Ukraine is fighting war on two frontsTrump 'disappointed' by Ukraine  Referencing Mr Zelenskyy's 2022 decree that rejected talks with Moscow, he added: \"The Europeans have stopped contacts with Russia. The Ukrainian side has forbidden itself to negotiate.\" According to the Russian leader, the \"goal and subject\" of Tuesday's talks in Saudi Arabia \"was the restoration of Russia-US relations\". Mr Zelenskyy is expected to meet later with Keith Kellogg, the US special envoy for Ukraine and Russia, who arrived in Kyiv on Wednesday. 👉 Follow Trump 100 on your podcast app 👈 Russia launches assault on Odesa Overnight, Russian forces launched a drone attack on Ukraine's Black Sea port city of Odesa, injuring four people including a child, Mr Zelenskyy said. At least 160,000 people were left without heating in sub-zero temperatures, he added. \"Rescue operations are under way in Odesa after another Russian attack on the energy infrastructure,\" Mr Zelenskyy said on the Telegram app. \"It is civilian energy facilities against which the Russian army has not spared neither missiles nor attack drones for almost three years.\""
    },
    {
        "title": "Ukraine's president is fighting a war on two fronts - against Russian forces on the ground and against American assaults over the airwaves",
        "description": "Ukraine's president appears to be fighting a war on two fronts - against Russian forces on the ground and against American assaults over the airwaves.",
        "url": "https://news.sky.com/story/ukraines-president-is-fighting-a-war-on-two-fronts-against-russian-forces-on-the-ground-and-against-american-assaults-over-the-airwaves-13312629",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-volodymyr-zelenskyy_6833510.jpg?20250219140707",
        "type": "US",
        "Author": "Deborah Haynes, security and defence editor, and Ivor Bennett, Moscow correspondent",
        "Date Published": "2025-02-19 13:28:00",
        "Headline": "Ukraine's President Volodymyr Zelenskyy has accused US President Donald Trump of being \"trapped in a disinformation bubble\".",
        "Content": "By Deborah Haynes, security and defence editor, and Ivor Bennett, Moscow correspondent  Ukraine's president appears to be fighting a war on two fronts - against Russian forces on the ground and against American assaults over the airwaves. View from Ukraine by Deborah Haynes, security and defence editor With Donald Trump openly attacking him, Ukraine's president is dispensing with the diplomatic niceties towards a crucial partner and is instead fighting back. It is a risky move given the heavy reliance of Volodymyr Zelenskyy on American military support to fight Russia's invasion and the US leader's dislike of criticism. But the past week of disruptive, strongman diplomacy from the White House - upending traditional assumptions about US support for European and Ukrainian security - has clearly been too much for Kyiv to stomach without speaking back, and bluntly. Mr Zelenskyy used a press conference inside the presidential compound on Wednesday to say the American commander in chief is surrounded by a circle of disinformation after Mr Trump falsely claimed Ukraine was to blame for Russia's war and that Mr Zelenskyy has a public approval rating of just 4%.  The US president is pushing for elections in Ukraine - something that would be very difficult to conduct while the country is still under Russian missile and drone attack and with hundreds of thousands of Ukrainians fighting on the frontline. \n                  Why all roads lead through Riyadh - as Saudi Arabia emerges as key global power broker\n                 \n                  Kemi Badenoch breaks her silence on Ukraine – finally\n                 \n                  Starmer backs 'democratically elected' Zelenskyy after Trump 'dictator' jibe at Ukrainian leader\n                 Mr Zelenskyy said the most recent surveys showed 57% of the population supported him - a similar rating to Mr Trump. He also issued his strongest criticism yet of an attempt by the Trump administration to make Kyiv sign away half of the wealth it has from rare minerals and other natural resources - equal in value to about $500bn. Mr Zelenskyy said he could not \"sell our state\", adding this was not a \"serious\" conversation. But he knows that he does need to have serious dialogue with Washington even after President Trump picked up the phone to Vladimir Putin a week ago, kicking off a thawing of ties between Moscow and Washington that led to a meeting of top US and Russian officials in Saudi Arabia on Tuesday and plans for a summit between the American and Russian presidents. A first step will be engaging with Keith Kellogg, a retired lieutenant general currently Mr Trump's envoy to Ukraine and Russia, who arrived in Kyiv on Wednesday morning - though was curiously absent from the Saudi Arabia talks despite his job title. Ukraine's president said he will talk with Mr Kellogg and would like to take him to visit the frontline and speak to soldiers to understand their view, while also talking to members of the public in the capital to hear what they have to say about the war, Mr Zelenskyy's efforts and also the comments by Mr Trump. The envoy, speaking to a small group of journalists when he stepped on the train, said he was there to listen and report back to Mr Trump.  Asked how confident he was that he would be able to bring Mr Zelenskyy to the negotiating table, Mr Kellogg said: \"I'm always confident.\" The coming days will tell whether that confidence is well placed. Read more:Trump's diplomacy does not look good for UkraineTrump 'disappointed' by Ukraine's reaction to talks View from Russia by Ivor Bennett, Moscow correspondent Volodymyr Zelenskyy had the appearance of a beleaguered leader who knows he is now fighting a war on two fronts - against Russian forces on the ground and against American assaults over the airwaves. Ukraine's leader looked almost shell-shocked from Donald Trump's verbal volleys last night, in which the US president accused Kyiv of starting the war. What has been Ukraine's biggest supporter now suddenly poses an existential threat. But for now, Mr Zelenskyy is fighting back. He accused Mr Trump of being \"trapped in a disinformation bubble\" - that he has not just drunk the Kremlin's Kool-Aid, but is now bathing in it. He pushed back on Mr Trump's spurious claims of only having a 4% approval rating, calling it propaganda from Russia. Moscow has repeatedly tried to portray Mr Zelenskyy as an illegitimate leader, due to his term expiring under martial law. In reality, his numbers are similar to Mr Trump's, which should resonate with a man who became obsessed with TV ratings during his first term. But it seems that facts do not always matter now to the White House. And he was extremely dismissive - to the point of ridicule, almost - of the proposed US/Ukraine mineral deal. \"Not a serious conversation\", he said, rejecting Mr Trump's business-first approach. Mr Zelenskyy still wants the focus on Ukraine's scorched earth, not rare earths. His messages and manner are in stark contrast to those of Vladimir Putin. Ever since the US election in November, the Russian president has sought to flatter Mr Trump, sympathise with him and be deferential, even when responding to barbs. And in Riyadh yesterday, Moscow began reaping the rewards. But Mr Zelenskyy's position is different, of course. Once the man of the moment, he's now struggling to stay relevant - in danger of being run down by the Donald Trump deal-making juggernaut. For now, he's standing in the road trying to stop it. But any hope that it will change course or hit the brakes may be misplaced."
    },
    {
        "title": "Why all roads lead through Riyadh - as Saudi Arabia emerges as key global power broker",
        "description": "At the Faena Hotel on Miami Beach, at breakfast, I overheard the conversation on the next table.",
        "url": "https://news.sky.com/story/why-all-roads-lead-through-riyadh-as-saudi-arabia-emerges-as-key-global-power-broker-13312894",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-saudi-arabia-sergei-lavrov_6834106.jpg?20250219211130",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-02-19 20:37:00",
        "Headline": "Since Donald Trump was last president, the kingdom has matured and emboldened its geopolitical clout. Back in his first term, Mr Trump recognised the value in Saudi Arabia. This time, Saudi Arabia is harnessing Mr Trump's power.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n At the Faena Hotel on Miami Beach, at breakfast, I overheard the conversation on the next table. \"Trump is creating instability,\" one man said to the other, who disagreed. It was a good natured but forthright debate that cut to the heart of a global divide right now about the language and actions of the world's most powerful man. The two men were guests at a Saudi-run investment forum taking place over the next three days here in Miami. The Future Investment Initiative (FII) is sometimes described as 'Davos in the desert'. The principal conference takes place every year in Saudi Arabia. It's run by the Saudi Sovereign Wealth Fund and describes itself as \"an annual event bringing people together to invest in the most promising solutions\". This Miami event is an offshoot of the Riyadh conference and it draws the very wealthiest from the world of finance, tech, innovation, politics, philanthropy and beyond. \n                  Kemi Badenoch breaks her silence on Ukraine – finally\n                 \n                  Starmer backs 'democratically elected' Zelenskyy after Trump 'dictator' jibe at Ukrainian leader\n                 \n                  Starmer meets Trump - but how does he prepare?\n                 I recognised one of the men at breakfast as a billionaire philanthropist. I'll protect his identity given his conversation was private. But, safe to say, Mr Trump is the talk of the conference. The seminars over the next three days - or 'invite-only conclaves' as they are described - hit all the notes of the moment. \"Do states own the oceans?\", \"The end of multilateralism and what it means for the world\", \"How to create resilient economies for uncertain times\", and \"Is a new era of US-Middle East economic cooperation dawning?\" were among the topics being discussed. That last event bills Trump's point man/dealmaker for the Middle East (and Russia-Ukraine), Steve Witkoff as the main speaker. The moderator is Jared Kushner, Trump's son-in-law and the man who first raised the prospect of a 'Gaza Riviera'. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 The first speaker at the event was the American president himself. Donald Trump is determined to see massive Saudi investment in America to the tune of $1trn (£794bn). In return, he is investing in Riyadh too. Saudi Arabia, the host of this glitzy event, has emerged as a key global power broker. The Tuesday Russia-US talks were in Riyadh. The expected Trump-Putin meeting will be there too. Since Donald Trump was last president, the kingdom has matured and emboldened its geopolitical clout. Back in his first term, Mr Trump recognised the value (literally) in Saudi Arabia. This time, Saudi Arabia is harnessing Mr Trump's power. They know money talks and that he likes to be kept close. Saudi Arabia is playing a strategic geopolitical game and it's plainly transactional. Essentially, it is saying \"we want to invest, we want you to, but we also have our own agenda in regional diplomacy\". On the Middle East, Saudi red lines over Gaza and the prospects of Arab diplomatic normalisation with Israel are a backstop to a total Trump-Netanyahu wipeout of the Palestinians. More from Sky News:Starmer backs ZelenskyyUkraine is 'fighting on two fronts'Trump 'disappointed' by Ukraine On Ukraine-Russia, the Saudis are more than happy to host as mediators. It puts them centre stage. On Iran, they have buried the hatchet with the supreme leader and could play a key role in any new nuclear deal. There was a time when the diplomatic roads ran through the obvious places; Washington, London, Brussels, Berlin, Paris. Now, it's Florida and Saudi Arabia. Brussels, London, Berlin, Paris and even the opposition in Washington are wholly left out."
    },
    {
        "title": "KFC to TFC? Famous fast food chain leaves Kentucky for Texas",
        "description": "KFC is leaving Kentucky.",
        "url": "https://news.sky.com/story/kfc-to-tfc-famous-fast-food-chain-leaves-kentucky-for-texas-13312968",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kfc-fast-food_6834179.jpg?20250219222252",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-19 22:20:00",
        "Headline": "KFC's ties to the US state of Kentucky run almost a century deep, when at a service station in Corbin, Colonel Harland Sanders began feeding customers.",
        "Content": "KFC is leaving Kentucky. The fast food giant, once known as Kentucky Fried Chicken, is relocating its corporate office to Texas in a shake-up announced earlier this week. Started by Colonel Harland Sanders, KFC will be based in Plano, Texas, moving forward. Around 100 corporate employees will be relocated in the next six months, Yum Brands, KFC's parent company which also owns Taco Bell and Pizza Hut, said.  In recent years, other companies have also relocated to Texas, a popular destination thanks to its low-tax and business-friendly policies, according to a 2023 report by the CBRE investment firm. Governor of Kentucky Andy Beshear was quick to respond to the news. He said: \"I am disappointed by this decision and believe the company's founder would be, too. \"This company's name starts with Kentucky, and it has marketed our state's heritage and culture in the sale of its product.\" Yum Brands said the move was part of wider plans to set up two brand headquarters in the US - in Texas and in Irvine, California. KFC and Pizza Hut will be based in Texas and Taco Bell and Habit Burger & Grill will remain based in California, the company said. Yum Brands and KFC will maintain offices in Louisville. \"These changes position us for sustainable growth and will help us better serve our customers, employees, franchisees and shareholders,\" Yum Brands chief executive David Gibbs said in a statement. Read more from Sky News:What causes sinkholes in the UK?Odds of asteroid hitting Earth rise againPrankster sends runners on 2.5km detour KFC's Kentucky ties run almost a century deep. In 1930, at a service station in Corbin, Kentucky, Mr Sanders began feeding customers, according to the company's website. It added there are now over 24,000 KFC outlets in more than 145 countries and territories around the world."
    },
    {
        "title": "Woman sues fertility clinic after giving birth to another couple's baby",
        "description": "A 38-year-old American woman is suing a fertility clinic after the wrong embryo was implanted in her  - and she then had to give up the baby to its biological parents after giving birth.",
        "url": "https://news.sky.com/story/woman-sues-fertility-clinic-after-giving-birth-to-another-couples-baby-13312454",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-krystena-murra-baby-ivf_6833463.jpg?20250219103651",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-19 09:50:00",
        "Headline": "Krystena Murray says she was \"turned into an unwitting surrogate, against her will, for another couple\" and has been left \"emotionally and physically broken\".",
        "Content": " A 38-year-old American woman is suing a fertility clinic after the wrong embryo was implanted in her  - and she then had to give up the baby to its biological parents after giving birth. Krystena Murray, from Savannah, Georgia, gave birth to a healthy boy in December 2023 after deciding to try to have a child with the help of a sperm donor. After the birth, she knew there had been a mistake as the baby was black, while she and the donor were white. Ms Murray said she contacted the clinic, Coastal Fertility Specialists, and found out doctors had implanted another patient's embryo in her instead of her own. She said the baby's biological parents were notified and they demanded custody. Ms Murray voluntarily gave up custody of the then five-month-old boy to avoid a legal battle as part of a situation she said had left her \"emotionally and physically broken\". She said: \"My child was ultimately taken from me as the clinic had implanted into my womb an embryo from a stranger. I've never felt so violated.\" After handing the child over in a court, she told Sky's US partner network NBC News: \"I walked in a mum with a child and a baby who loved me and was mine and was attached to me, and I walked out of the building with an empty stroller and they left with my son.\" Ms Murray's lawsuit, which has been filed at a court in Georgia, says the clinic's \"extreme and outrageous\" mistake caused her to be \"turned into an unwitting surrogate, against her will, for another couple\". She said: \"The situation has left me emotionally and physically broken. \"I grew him, I raised him, I loved him. I saw no different than if he were mine, my own genetic embryo.\" Coastal Fertility Specialists, which runs an in-vitro fertilisation (IVF) clinic in Savannah and four others in neighbouring South Carolina, said in a statement to NBC News that it was an \"isolated event\" and apologised for \"an unprecedented error that resulted in an embryo transfer mix-up\". The clinic added: \"We are doing everything we can to make things right for those affected by this incident.\" Read more:AI could help more women get pregnant via IVFRate of single women having IVF more than triples Ms Murray said everything seemed normal when she began treatment in early 2023. She had injections to stimulate the production of eggs, which were later harvested and fertilised in a lab using a donor's sperm. The wedding photographer said she became pregnant the second time an embryo was implanted in her uterus. She added: \"I considered the consequences of IVF going in. Never once did I consider I might birth someone else's child and have them taken from me.\""
    },
    {
        "title": "'Why am I the fat?': Beauty and popularity of Yosemite can't save workers from Musk's DOGE cutbacks",
        "description": "Olek Chmura's job was to clean the facilities, including the toilets, at Yosemite National Park in California - one of America's most visited tourist attractions.",
        "url": "https://news.sky.com/story/why-am-i-the-fat-beauty-and-popularity-of-yosemite-cant-save-workers-from-musks-doge-cutbacks-13312392",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-olek-chmura-yosemite_6833585.jpg?20250219123834",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2025-02-19 07:07:00",
        "Headline": "The beauty of Yosemite National Park has offered no protection from the brutal job cuts being rolled out across the US government.",
        "Content": "\n          US correspondent\n              @marthakelner\n  Olek Chmura's job was to clean the facilities, including the toilets, at Yosemite National Park in California - one of America's most visited tourist attractions. That was, until last Friday afternoon when an email landed in his inbox, from a person he had never heard of, notifying him that his position had been terminated. Olek is one of about 1,000 newly hired National Park Service employees to be fired suddenly. They are the latest victims of Elon Musk's \"move fast and break things\" approach to national government. \"I'm traumatised,\" Olek says. \"Why am I a target? I don't make that much money, I make around $40,000 (£32,000) a year, I can't even afford to live in the local community, it's like, why me? Why am I the fat? \"I chose to come serve the American people and the international community, because I truly believe that our national parks are one of America's best ideas.\" Elon Musk is seemingly instituting a similar scheme of radical cost-cutting and job-slashing through the Department of Government Efficiency (DOGE) that he has executed in his private companies like X and Tesla. I ask what Olek would say to Musk if he had the opportunity. \"I'd like to tell him, come look at my bathrooms here and tell me if I'm essential or not,\" he says. \"I cleaned these toilets, armed with nothing but a putty knife and a pumice stone.\" National Parks are considered by many to be America's crown jewels. More than 300 million people each year visit parks across the United States, like Yosemite, Yellowstone, and the Grand Canyon, to appreciate the stunning views and historic sites. But beauty has offered no protection from the brutal job cuts being rolled out across national government. A further 3,400 workers at the US Forest Service have also been fired. 👉 Listen to Sky News Daily on your podcast app 👈 Existing workers in some of America's 63 national parks are warning that the job losses could be catastrophic for the parks' operations and the safety of staff and visitors. Danielle Schell and her husband Christopher are visiting Yosemite with their children, nine-year-old Cairo and Dakari, six. They are taking pictures of the valley from the tunnel view outlook. \"I'm crestfallen,\" says Christopher, an urban ecologist and professor at the University of California. \"I think the folks that are making the cuts certainly aren't the ones that are coming here. If you see what we see, it's really hard to make the cuts because it just equates to money. But there is no money that can replace this,\" he says, gesturing to the vista. Danielle says the cuts are short-sighted. \"The discouraging thing is trying to explain to your kids why the billionaires don't see it from our perspective as everyday people,\" she says. \"How do you convince people, that don't understand, that this matters? And that we're actually doing ourselves a disservice when we think these greenspaces are not a part of our own lives.\" But others disagree. Steve Giacolini is visiting the park with his son and is a supporter of Elon Musk's new role in government. Read more from Sky News:Trump's diplomacy does not look good for UkraineTrump administration lean on Romania over Andrew Tate \"I'm all for what Elon Musk is doing. He's the right man for the job,\" he says. \"There's a huge amount of waste and it's been going on for decades, it's horrible. He may go through all these agencies, find what he thinks needs to be cut and then the position will be gone and at least we will have saved billions of dollars. \"But I do think when it comes to cuts that agencies like the National Park Service should be last.\" But there is - seemingly - no order to these cuts and critics would say no rhyme or reason to who stays and who goes, only the promise that there's more to come."
    },
    {
        "title": "Sean 'Diddy' Combs lawyers argue 'racist' criminal charge should be dismissed",
        "description": "Lawyers for Sean \"Diddy\" Combs say the rapper has been subject to a \"racist\" prosecution and are seeking to dismiss one of the criminal charges against him.",
        "url": "https://news.sky.com/story/sean-diddy-combs-lawyers-argue-racist-criminal-charge-should-be-dismissed-13312534",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-p-diddy-sean-combs_6716191.jpg?20250219114244",
        "type": "US",
        "Author": "Gemma Peplow",
        "Date Published": "2025-02-19 11:26:00",
        "Headline": "In a new legal document, lawyers for Sean \"Diddy\" Combs have filed a motion to dismiss one of the criminal charges against him, saying he \"has been singled out because he is a powerful black man\". The rapper, who is facing a trial in May, has strenuously denied allegations of wrongdoing.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Lawyers for Sean \"Diddy\" Combs say the rapper has been subject to a \"racist\" prosecution and are seeking to dismiss one of the criminal charges against him. In a court filing seen by Sky News, the 55-year-old's legal team say he \"has been singled out because he is a powerful black man\" and is being prosecuted \"for conduct that regularly goes unpunished\". Combs was charged with racketeering conspiracy, sex trafficking by force, fraud or coercion, and transportation to engage in prostitution, in September 2024. He has pleaded not guilty, said his sexual relationships were consensual, and strenuously denied allegations of wrongdoing. His lawyers have now filed the motion to dismiss the transportation charge. \"This case is unprecedented in many ways, but perhaps most notably, and most disturbingly, no white person has ever been the target of a remotely similar prosecution,\" the court document states. It goes on to list his achievements as an \"extraordinarily successful artist, businessman, philanthropist and one of the most accomplished black people in this country\". However, \"like many other celebrities\", Combs has had \"complicated relationships with significant others as well as with alcohol and drugs throughout his time in the spotlight\", his lawyers say. \"But that doesn't make him a racketeer, or a sex trafficker.\" The rapper's legal team claims there \"has never been a similar prosecution\" under the Mann Act, the federal law the count falls under, which is also known as the White-Slave Traffic Act. They allege the US government has \"concocted\" its case based on allegations Combs would sometimes bring escorts into his relationships. \"No other person, and certainly no white person, has ever previously been prosecuted under the White-Slave Traffic Act for hiring male escorts from another state,\" their court filing states. They also allege the government's handling of the case \"demonstrates bias\", and add that during the investigation of Combs, his home was raided with \"utterly unnecessary military-level force\". Read more from Sky News:'Why am I the fat?': Yosemite workers hit by Musk's cutbacksWoman sues fertility clinic after giving birth to another couple's babyKevin Spacey reacts to Guy Pearce claiming he was 'targeted' The US Attorney's Office for the Southern District of New York declined to comment on the latest court filing when contacted by Sky News. In September, Marc Agnifilo, one of Combs' lawyers, told US entertainment site TMZ he believed the US government had made the case \"as a takedown of a successful black man\". Prosecutors addressed the comments in a subsequent court hearing, US media reported in October, saying Mr Agnifilo had \"baselessly accused the government of engaging in a racist prosecution\", and that this risked prejudicing potential jurors. Combs' trial is currently set to begin in May."
    },
    {
        "title": "Kevin Spacey tells Guy Pearce to 'grow up' after claiming he was 'targeted' by House of Cards actor",
        "description": "Kevin Spacey has issued a strongly-worded response to allegations he \"targeted\" Guy Pearce, telling the former co-star \"you're not a victim\" and \"grow up\".",
        "url": "https://news.sky.com/story/kevin-spacey-tells-guy-pearce-to-grow-up-after-claiming-he-was-targeted-by-house-of-cards-actor-13312442",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kevin-spacey-guy-pearce_6833456.jpg?20250219102758",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-19 11:49:00",
        "Headline": "Guy Pearce described being \"young and susceptible\" when he was filming the 1997 movie LA Confidential. But Kevin Spacey has accused his co-star of leaving out details which did not \"fit into the victim narrative\".",
        "Content": "Kevin Spacey has issued a strongly-worded response to allegations he \"targeted\" Guy Pearce, telling the former co-star \"you're not a victim\" and \"grow up\". On Tuesday, Pearce spoke about the 1997 film LA Confidential, choking up while alleging Spacey had pursued him while they were shooting the Oscar-winning film. He told The Hollywood Reporter's Awards Chatter podcast: \"I was sort of scared of Kevin because he's quite an aggressive man. \"He's extremely charming and brilliant at what he does... but I was young and susceptible, and he targeted me, no question.\" Pearce, 57, did not describe details of the alleged encounters but said he had a \"couple of confrontations with Kevin\" that \"got ugly\" since filming LA Confidential. Spacey, 65, has spent years fighting off allegations of sexual harassment and assault, all of which he has denied. Although he has admitted to \"being too handsy\" in the past. The House of Cards star and Oscar winner described having \"been through hell and back\" in a video response on X, in which he denied Pearce's claims and criticised him for going to the media. \n                  Kevin Spacey admits 'being too handsy'  \n                 \n                  Stars say Kevin Spacey should return to acting after 'seven years of exile'\n                 \n                  Kevin Spacey denies new allegations of inappropriate behaviour\n                 \"We could have had that conversation, but instead, you've decided to speak to the press, who are now, of course, coming after me, because they would like to know what my response is to the things that you said,\" Spacey said in the video. \"Guy, you need to grow up. You are not a victim.\" Spacey then posed a series of questions to Pearce: \"Did you also, by the way, tell the press that a year after we shot LA Confidential you flew to Savannah, Georgia - while I was shooting Midnight In The Garden Of Good And Evil - just to spend time with me?\" He then asked: \"Did you tell the press that too? Or does that not fit into the victim narrative you have going?\" Read more from Sky News:A$AP Rocky found not guiltyEmma Raducanu in tears on courtSoap celebrates 40 years In 2017, actor Anthony Rapp accused Spacey of sexual assault. Spacey was found not liable during the subsequent civil lawsuit. He was also accused of groping an 18-year-old at a Massachusetts bar in 2016. Charges were dropped in 2019 after the accuser refused to give evidence. In 2023, Spacey was also acquitted by a UK jury of sexually assaulting four men while working as the artistic director of London's Old Vic Theatre. Last week an additional civil lawsuit was filed in the UK against Spacey and London's Old Vic alleging sexual abuse. Spacey has consistently denied any accusations of sexual misconduct."
    },
    {
        "title": "Trial of Tupac murder suspect postponed for almost a year",
        "description": "The trial of the only suspect ever to be charged with the murder of rapper Tupac Shakur, almost 30 years after his death, has been postponed for almost a year.",
        "url": "https://news.sky.com/story/trial-of-tupac-murder-suspect-postponed-for-almost-a-year-13312579",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-duane-davis-tupac-shakur_6833613.jpg?20250219130633",
        "type": "US",
        "Author": "Gemma Peplow",
        "Date Published": "2025-02-19 12:10:00",
        "Headline": "Duane \"Keffe D\" Davis has been in jail since he was arrested on suspicion of the murder of Tupac Shakur in September 2023, some 27 years after the rapper's death. He has pleaded not guilty - and his lawyers now say they have new leads.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n The trial of the only suspect ever to be charged with the murder of rapper Tupac Shakur, almost 30 years after his death, has been postponed for almost a year. During a short hearing in Las Vegas on Tuesday, Clark County District Court Judge Carli Kierny said she had little choice but to reschedule given new developments presented by Duane \"Keffe D\" Davis' lawyers. Davis, 61, was charged with Tupac's murder in September 2023 and has been in jail since his arrest. He has pleaded not guilty to first-degree murder and his trial has already been pushed back twice, from June to November 2024, and then to March this year. Now, the case has been rescheduled for February 2026. \"It looks like there are quite a few things that are left to be done to get this case prepared so that Mr Davis can have effective assistance of counsel,\" Judge Kierny said. Davis, a former Los Angeles gang leader, agreed when asked by the judge if he was okay with moving the trial by such a long time. His defence team argue it has been so long since the shooting that more time is needed for thorough investigations to ensure a fair trial. They filed a motion last week calling for the trial to be delayed, saying a private investigator had identified witnesses who could testify that Davis was not at the scene of the shooting. They also say they have witness information that Shakur was in stable condition while in hospital, and that they are consulting medical and forensic experts to evaluate potential alternative causes of death. How did Tupac die? Shakur was shot in a drive-by in Las Vegas on the night of 7 September 1996. The rapper was sitting in the passenger seat of a BMW being driven by Marion \"Suge\" Knight, the founder of his record label, Death Row Records, when a white Cadillac pulled up next to them at a red light and shots were fired. Both men were taken to hospital. Knight was wounded, but Shakur died six days later. While Davis is not accused of being the gunman, he is accused of orchestrating the shooting. In Nevada, you can be charged with a crime, including murder, if you help someone commit the crime. Davis has previously claimed publicly in interviews and in a book published in 2019 that he was in the car involved. However, his court filings say any descriptions he has given in recent years were \"done for entertainment purposes and to make money\". In his memoir, Davis implicated his nephew, Orlando \"Baby Lane\" Anderson, a member of the South Side Compton Crips gang, saying he was one of two people in the backseat. Anderson, a known rival of Shakur, had been involved in a casino brawl with the rapper shortly before the shooting. Anderson, who denied any involvement, died in an unrelated gang shoot-out two years later. Read more:A$AP Rocky found not guilty after gun trialPlacebo frontman charged with defamation of Italian PM His attorney, Carl Arnold, has argued that he should never have been charged due to immunity agreements Davis claims he reached with federal and local prosecutors years ago, while living in California.But prosecutors say they have strong evidence against Davis, who now lives in Nevada, and any immunity agreement was limited. Knight is now in jail for an unrelated crime in the Los Angeles area in 2015. Shakur, who was 25 when he died, is regarded as one of the most influential rappers of all time, known for hits including Dear Mama, Keep Ya Head Up, California Love, I Ain't Mad At Cha, and Changes. His killer has never been formally identified, and the case has been regarded as one of the world's most infamous unsolved murders."
    },
    {
        "title": "200 jobs lost as Quiz Clothing calls in administrators",
        "description": "Hundreds more high street jobs will be lost this week after Quiz Clothing, the troubled fashion retailer, called in administrators.",
        "url": "https://news.sky.com/story/200-jobs-lost-as-quiz-clothing-calls-in-administrators-13312811",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-quiz-olivia-buckland_6792899.jpg?20250106153631",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-19 17:58:00",
        "Headline": "The majority of jobs at the ailing fashion chain will be salvaged in a pre-pack deal with a subsidiary controlled by its founding Ramzan family, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Hundreds more high street jobs will be lost this week after Quiz Clothing, the troubled fashion retailer, called in administrators. Sky News understands that the company, which was listed until recently on the London Stock Exchange, will see the closure of 23 of its shops, with about 200 employees expected to be made redundant. Quiz, which is chaired by the former JD Sports chief Peter Cowgill, has appointed the insolvency practitioner Teneo as administrator to Zandra Retail, which operates Quiz's standalone stores in the UK and Ireland, after weeks of talks about a rescue deal. The transaction is expected to be structured as a pre-pack administration, with the remaining assets being acquired by Orion Retail, a subsidiary of the company controlled by the founding Ramzan family. Orion will hold the right to trade from 42 outlets previously occupied by Zandra. One rival bidder said they understood that Teneo and the buyers had worked to preserve as many jobs as possible, with the majority understood to have been salvaged. Sky News reported last month that Quiz Clothing traded from roughly 60 standalone stores and dozens more concessions, employing about 1,500 people. \n                  Inflation rises to a high not seen in nearly a year - official figures\n                 \n                  Money blog: Holiday company issues warning over rising costs\n                 \n                  Big chains like Wetherspoons will be able absorb extra costs - but frustrations at government are palpable \n                 QUIZ's online business, concessions and international operations are operated by other Group subsidiaries and are unaffected by this announcement. Sheraz Ramzan, CEO of Quiz, said in a statement issued to Sky News: \"The board took the difficult decision to appoint administrators to Zandra Retail Limited in light of the continuing challenging trading conditions impacting the Group's performance. \"We are deeply sorry to those affected by the store closures, including our retail colleagues. \"However, this decision will put the business in a more sustainable footing for the future and protect several hundred jobs as a result.\" Quiz's main lender, HSBC, had recently hired restructuring experts at Interpath to advise it. Quiz's troubles come amid growing financial pressure on retailers, many of which are facing a deepening challenge in 2025 as a result of looming hikes to employers' national insurance contributions. In recent weeks, Sky News has revealed that: WH Smith was in talks to sell its entire high street chain, numbering 500 stores and about 5,000 employees; Poundland's parent has hired advisers to assess options for the leading discount chain; Lakeland, the family-owned kitchenware retailer, has been put up for sale; and that The Original Factory Shop was being sold to Modella Capital. Gavin Maher, Joint Administrator, said: \"Although the sale has resulted in the transfer of a number of jobs, it has been necessary to make redundancies. \"We appreciate that this is a difficult and uncertain time for all involved and are communicating appropriately with all employees, customers and stakeholders.\""
    },
    {
        "title": "Inflation rises to a high not seen in nearly a year - official figures",
        "description": "Inflation has risen a surprising amount - to the highest in nearly a year - official figures show.",
        "url": "https://news.sky.com/story/inflation-rises-from-25-to-3-official-figures-13312373",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-pound-gbp-currency_6243464.png?20250206124225",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-02-19 06:12:00",
        "Headline": "A chunky rise in the headline inflation rate will be unwelcome for those hoping for lower interest rates, but underlying figures are not as bad news.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Inflation has risen a surprising amount - to the highest in nearly a year - official figures show. This means prices are rising even more than at any time since last March, according to data from the Office for National Statistics (ONS) for January. The consumer price index (CPI) ticked up steeply to 3% from 2.5% a month earlier. A lower rise to 2.8% was forecast by economists polled by Reuters and by the Bank of England. The rise has come from more expensive transport and food and non-alcoholic beverages costs. Flight prices did not fall as much as usual for this time of year. Meat, bread and cereals in particular became more expensive while an increase in private school fees was another factor, as new VAT rules meant prices rose nearly 13%. What does it mean for interest rates? Inflation is now higher above the Bank of England's 2% target and will make interest rate cuts less likely. Traders are pricing in an 82% chance of no rate cut at its March meeting. Two more rate cuts are still expected this year.  But there are some signs that could be welcomed by the rate-setters at the Bank. Coming in below forecast was services inflation, impacted by rising wages, which rose to 5%, rather than the anticipated 5.2%. The closely watched core inflation measure - which excludes volatile food and energy prices - increased as expected to 3.7%, up from 3.2% in December. Just the start More inflation rises are anticipated throughout the year. Last month, the Bank of England predicted it would reach 3.7% by the end of the year. But economic research firm Pantheon Macro said a 4% reading later this year \"is far from out of the question\". Responding to the figures, Chancellor Rachel Reeves said: \"Since the election, we've seen year-on-year wages after inflation growing at their fastest rate - worth an extra £1,000 a year on average - but I know that millions of families are still struggling to make ends meet. \"That's why we're going further and faster to deliver economic growth.\""
    },
    {
        "title": "Big chains like Wetherspoons will be able absorb extra costs - but frustrations at government are palpable ",
        "description": "\"They were a little bit arrogant to start with... I think they are learning on the job.\"",
        "url": "https://news.sky.com/story/down-the-pub-political-frustrations-are-palpable-13312664",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-tim-martin-money_6833503.png?20250219112539",
        "type": "Business",
        "Author": "Darren McCaffrey, presenter",
        "Date Published": "2025-02-19 14:32:00",
        "Headline": "At a time when economic growth is at the heart of what the government wants to achieve, business believes ministers have shot themselves in the foot, making growth more expensive and thus less likely.",
        "Content": "By Darren McCaffrey, presenter   \"They were a little bit arrogant to start with... I think they are learning on the job.\" The obvious frustration of Sir Tim Martin, founder of Wetherspoons, at the government and its handling of the economy. And he's not alone. I've spoken to dozens of business leaders in recent months, many angry about tax increases on employers just around the corner, which alongside Wednesday's inflation is piling costs on businesses - many who fear they won't survive. \"Spoons\" will of course, as will the big supermarkets, be able to absorb the double whammy of employee national insurance increases and a hike in the minimum wage from April. Though those same companies are also clear it will mean likely price rises for customers, fewer people being hired and fewer pubs or shops opening in the future. Many smaller businesses are equally clear it may force them to close altogether. Read more:Inflation rises to a high not seen in nearly a yearThames Water multi-billion pound debt lifeline approved The frustration and anger is rooted, they argue, in the political choices that Labour made before the election. Maybe good political choices but bad economic ones. In order to win, Sir Keir Starmer ruled out tax increases for employees, on VAT, on income tax - what Labour branded \"no tax on hard-working people\". But in doing so - they've boxed themselves in, once in power. With the public finances in a pretty poor state - taxes had to go up and it was decided they would go up on those who employ people. At a time when economic growth is at the heart of what the government wants to achieve, business believes ministers have shot themselves in the foot, making growth more expensive and thus less likely."
    },
    {
        "title": "Melrose founders target $2bn bid for US industrial group ECI",
        "description": "The industrial veterans who turned Melrose Industries into one of Britain's most prominent public companies are targeting a $2bn (&#163;1.59bn) takeover of a US-based manufacturer of wire harnesses.",
        "url": "https://news.sky.com/story/melrose-founders-target-2bn-bid-for-us-industrial-group-eci-13312482",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-simon-peckham-melrose_6582168.jpg?20240615083241",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-19 10:33:00",
        "Headline": "Rosebank Industries is in talks to acquire Electrical Components International in what would be the London-listed vehicle's founders' first deal since leaving Melrose, Sky News can reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The industrial veterans who turned Melrose Industries into one of Britain's most prominent public companies are targeting a $2bn (£1.59bn) takeover of a US-based manufacturer of wire harnesses. Sky News has learnt that Rosebank Industries, which floated on the London stock market last summer, has identified Electrical Components International (ECI) as its first major acquisition. Talks with ECI's owner, Cerberus Capital Management, are understood to have been taking place for some time, according to banking sources. A person close to the talks cautioned on Wednesday, however, that a deal was not certain to be finalised. Rosebank is not yet thought to have formally sounded out new or existing investors about raising the equity financing that would be required to fund a deal, they added. If the deal's enterprise valuation is in the region of $2bn, that would leave Rosebank needing to raise roughly £1.5bn from the sale of new shares and new debt financing. The London-listed vehicle is understood to have other acquisition targets in its sights if the ECI deal does not materialise. Cerberus has owned Missouri-based ECI since 2018. The company operates dozens of production facilities and distribution centres globally, and its products are used in home appliances, as well as across the agriculture and construction industries. Read more:Inflation rises to a high not seen in nearly a yearThames Water multi-billion pound debt lifeline approved If confirmed, the transaction would be the latest to be struck by some of Britain's most prolific corporate dealmakers. Simon Peckham, the former Melrose chief who is now CEO of Rosebank, launched the new vehicle last year after months of deliberations about whether to structure it as a private or listed company. His former Melrose colleagues, Justin Dowley and Christopher Miller are also on the board of Rosebank. Their \"buy, improve, sell\" mantra saw them acquire a string of industrial assets at Melrose, the most notable of which was GKN, the historic British engineering group. That was then broken up, and Dowlais, its former automotive arm, has just agreed to be taken over by an American rival. Among the other industrial names that Melrose acquired were Nortek, Dynacast, and Elster. It was the £8bn takeover of GKN in 2018 which thrust Mr Peckham and his colleagues into the public spotlight, however, as the target company fought a bitter, and ultimately unsuccessful, battle for its independence. Rosebank has told investors that it will employ the same approach to executive remuneration as the one that saw Melrose's top team receive windfalls worth hundreds of millions of pounds over two decades. It has also said that once its first acquisition is identified and executed, it intends to move to the main London market. That would deliver a boost for the City at a time when companies - the latest of which is the mining giant Glencore - are weighing moving their listing to other exchanges in search of a higher valuation. A Rosebank spokesman declined to comment on Wednesday."
    },
    {
        "title": "KFC to TFC? Famous fast food chain leaves Kentucky for Texas",
        "description": "KFC is leaving Kentucky.",
        "url": "https://news.sky.com/story/kfc-to-tfc-famous-fast-food-chain-leaves-kentucky-for-texas-13312968",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kfc-fast-food_6834179.jpg?20250219222252",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-19 22:20:00",
        "Headline": "KFC's ties to the US state of Kentucky run almost a century deep, when at a service station in Corbin, Colonel Harland Sanders began feeding customers.",
        "Content": "KFC is leaving Kentucky. The fast food giant, once known as Kentucky Fried Chicken, is relocating its corporate office to Texas in a shake-up announced earlier this week. Started by Colonel Harland Sanders, KFC will be based in Plano, Texas, moving forward. Around 100 corporate employees will be relocated in the next six months, Yum Brands, KFC's parent company which also owns Taco Bell and Pizza Hut, said.  In recent years, other companies have also relocated to Texas, a popular destination thanks to its low-tax and business-friendly policies, according to a 2023 report by the CBRE investment firm. Governor of Kentucky Andy Beshear was quick to respond to the news. He said: \"I am disappointed by this decision and believe the company's founder would be, too. \"This company's name starts with Kentucky, and it has marketed our state's heritage and culture in the sale of its product.\" Yum Brands said the move was part of wider plans to set up two brand headquarters in the US - in Texas and in Irvine, California. KFC and Pizza Hut will be based in Texas and Taco Bell and Habit Burger & Grill will remain based in California, the company said. Yum Brands and KFC will maintain offices in Louisville. \"These changes position us for sustainable growth and will help us better serve our customers, employees, franchisees and shareholders,\" Yum Brands chief executive David Gibbs said in a statement. Read more from Sky News:What causes sinkholes in the UK?Odds of asteroid hitting Earth rise againPrankster sends runners on 2.5km detour KFC's Kentucky ties run almost a century deep. In 1930, at a service station in Corbin, Kentucky, Mr Sanders began feeding customers, according to the company's website. It added there are now over 24,000 KFC outlets in more than 145 countries and territories around the world."
    },
    {
        "title": "Inflation rise unlikely to shift Bank of England's stance on interest rates",
        "description": "Inflation is rising faster than expected but the latest data is unlikely to shift the Bank of England's stance on interest rates.",
        "url": "https://news.sky.com/story/inflation-rise-unlikely-to-shift-bank-of-englands-stance-on-interest-rates-13312440",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-money-bank-of-england_6690099.jpg?20241129110900",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-02-19 09:24:00",
        "Headline": "Weak economic growth should weigh on wages, taking the heat out of price pressures. That is the Bank of England's reading of the situation - but the last few years have shown us that the \"inflation tiger\" can be an unpredictable beast.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Inflation is rising faster than expected but the latest data is unlikely to shift the Bank of England's stance on interest rates. The headline rate of inflation hit 3% in January, up from 2.5% the previous month and higher than the 2.8% forecast by economists and the Bank of England. It's expected to go even higher, hitting 3.7% later in the year and moving even further away from the Bank's 2% target. Policymakers are hopeful that we are in a \"hump\" and that inflation will fall back to target. The latest increase was driven by a bigger-than-expected surge in airfares because of an erratic comparison with the same period last year and a VAT rise on private school fees. The Bank won't be too concerned about that. It will also look through increases in food prices, which can be volatile.  Core CPI inflation, which strips out the volatility by excluding food as well as energy, rose from 3.2% to 3.7%. That was in line with forecasts. Services inflation, which gives a better indication of underlying price pressures in the domestic economy, rose from 4.4% to 5%. That was lower than the Bank of England's 5.2% forecast. It means the Bank is likely to continue its measured approach to monetary policy. Although inflation is above target, weak economic growth has been weighing heavily on the minds of the Monetary Policy Committee (MPC). It's a balancing act. Two MPC members voted for a large 50 basis point interest rate cut this month. While the Bank is unlikely to cut again next month it is still expected to push through another two interest rate cuts this year. The Bank will have to hold its nerve. Wages are growing at their fastest pace in three years and rising energy prices will drive inflation higher this year, but the Bank expects the headline rate to then start falling. Weak economic growth should weigh on wages, taking the heat out of price pressures. That is the Bank's reading of the situation, but the last few years have shown us that the \"inflation tiger\" can be an unpredictable beast and the geo-political risks continue to abound, particularly the US president's tariffs policy. Rob Wood, chief UK economist at Pantheon Macroeconomics, said: \"The risks are pointed towards higher than expected inflation this year. \"We think the MPC would be 'brave' to keep cutting rates quarterly with wage growth around 6% year-over-year - at least double the rate consistent with inflation at target - stalling rather than collapsing jobs, and inflation well above 3%. \"We look for two more rate cuts this year, in May and November.\""
    },
    {
        "title": "Most areas set to increase council tax by at least 4.99% from April",
        "description": "Most councils are set to increase council tax by the maximum amount of at least 4.99% from April.",
        "url": "https://news.sky.com/story/most-areas-set-to-increase-council-tax-by-at-least-499-from-april-13312588",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-council-tax-bill_6705572.jpg?20241004064523",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-19 12:26:00",
        "Headline": "Six councils have got permission to raise council tax above 4.99% as local authorities struggle with rising costs of social care and homelessness.",
        "Content": "Most councils are set to increase council tax by the maximum amount of at least 4.99% from April. Government figures released on Wednesday show 85% of the 139 top-tier authorities in England that have proposed or confirmed rises so far are planning to do so by 4.99%. If local authorities want to raise council tax by 5% or more, they have to carry out a local referendum, under normal circumstances. Politics latest: Trump wants to 'shock' European into action with false Ukraine claims, Boris Johnson says However, six councils in severe financial trouble have been granted permission to increase council tax beyond this level without a vote. When they are included in the figures, the proportion of local authorities increasing council tax above 4.99% rises to nearly 90% of councils. A total of 17 councils wanting to increase council tax by 4.99% or more have confirmed their intentions, 122 are awaiting approval and 14 are yet to declare their intentions, analysis by the PA news agency shows. \n                  Millions face council tax rise of more than 5% after government gives green light to bigger hikes\n                 \n                  Rising cost of social care and school transport to cause £54bn blackhole for councils\n                 \n                  Single-person council tax discount will not be axed, Downing Street suggests\n                 Councils are facing rising costs, especially in areas where they legally have to provide services such as social care, education, housing and waste services. As they face more pressure to pay for those services, it is unlikely the council tax rises proposed by senior councillors will be rejected by full council ahead of budgets having to be set by the end of February, or March for some. Some councils are planning increases below 4.99% - but only 15. For example, Barnet, north London and Warrington in Cheshire are planning 4.98% increases, while Wandsworth in south London is only planning a 2% rise. Just seven councils are planning to increase council tax by 4% or less. They are: Kensington and Chelsea (4%), Doncaster (3.99%), North East Lincolnshire (3.98%), Essex (3.75%), Rotherham (3%), Lincolnshire (2.99%) and Wandsworth (2%). Read more:Council tax to rise to pay for police funding increaseCouncils to receive £1bn boost to tackle homelessness  The six councils granted permission to increase council tax by more than 4.99% are: Bradford 9.9% Birmingham 7.49% Newham, London 8.99% Somerset 7.5% Trafford, Greater Manchester 7.49% Windsor and Maidenhead 8.99% The Resolution Foundation said the poorest fifth of households across the UK paid 4.8% of their income on council tax in 2020-21, up from 2.9% in 2002-3. The thinktank identified this share of income was three times more than the 1.5% spent by the richest fifth."
    },
    {
        "title": "DeepSeek accused of giving user data to TikTok owner",
        "description": "South Korea has accused the Chinese AI company DeepSeek of sharing user data with TikTok's owner, according to the Yonhap news agency.",
        "url": "https://news.sky.com/story/deepseek-accused-of-giving-user-data-to-tiktok-owner-13312445",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-deepseek-logo_6812410.jpg?20250128034102",
        "type": "Business",
        "Author": "Mickey Carroll",
        "Date Published": "2025-02-19 09:57:00",
        "Headline": "The South Korean data regulator said DeepSeek was communicating with ByteDance and has blocked new downloads of the app in the country.",
        "Content": "\n          Science and Technology reporter\n       South Korea has accused the Chinese AI company DeepSeek of sharing user data with TikTok's owner, according to the Yonhap news agency. The South Korean data regulator said DeepSeek was communicating with ByteDance, although it has not yet confirmed what user data was shared between the companies. Read more: What is DeepSeek? Over the weekend, the country suspended new downloads of the AI app over security concerns. Users must give explicit permission for their data to be shared with third-party companies under South Korean law.  In response to South Korea's concerns, DeepSeek assigned a representative in South Korea and acknowledged shortcomings in the way it had considered local protection laws, according to Yonhap. When DeepSeek unveiled its powerful AI model, it sent shockwaves through the Western tech industry by being as powerful but significantly cheaper than OpenAI's ChatGPT. \n                  DeepSeek founder Liang Wengfeng spotted in public for first time since company upended AI in the West\n                 \n                  Meta to build world's longest undersea cable\n                 \n                  Why the UK didn't sign up to global AI agreement\n                  However, alarm bells were quickly raised over security. Just weeks before, TikTok, another Chinese tech firm, was briefly banned in the US over concerns about the security of user data. When DeepSeek appeared, US entrepreneur Bill Ackman described DeepSeek as \"a Trojan Horse\" and said TikTok \"is just a toy by comparison\"."
    },
    {
        "title": "Starmer backs 'democratically elected' Zelenskyy after Trump 'dictator' jibe at Ukrainian leader",
        "description": "Prime Minister Sir Keir Starmer has spoken with Volodymyr Zelenskyy to give the Ukrainian president his backing after Donald Trump called him a \"dictator\".",
        "url": "https://news.sky.com/story/kemi-badenoch-defends-volodymyr-zelenskyy-after-donald-trump-calls-him-a-dictator-13312728",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/219d65253d2ae70e49f3931d883052bb44c7d27dbd4316f610e50275a3d65472_6831919.jpg?20250217192628",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-02-19 16:17:00",
        "Headline": "The prime minister's show of support for Volodymyr Zelenskyy comes after Tory leader Kemi Badenoch refuted Mr Trump's comment but said the US leader was right that Europe \"needs to pull its weight\". ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Prime Minister Sir Keir Starmer has spoken with Volodymyr Zelenskyy to give the Ukrainian president his backing after Donald Trump called him a \"dictator\". A Downing Street spokesperson said Sir Keir called Mr Zelenskyy this evening and shared his support for him \"as Ukraine's democratically elected leader\". The prime minister \"said that it was perfectly reasonable to suspend elections during war time as the UK did during World War II\", the statement continued. He also \"reiterated his support for the US-led efforts to get a lasting peace in Ukraine that deterred Russia from any future aggression\".  Politics Live: Johnson responds to Trump's 'shock' Ukraine claims In a post on X about the call, Mr Zelenskyy said: \"The United Kingdom's role in fortifying Europe's defense and security is important for us.\" \n                  Why all roads lead through Riyadh - as Saudi Arabia emerges as key global power broker\n                 \n                  Kemi Badenoch breaks her silence on Ukraine – finally\n                 \n                  Starmer meets Trump - but how does he prepare?\n                 The \"UK's support matters indeed, and we will never forget the respect the British people have shown for Ukraine and our citizens\", he added. The call was held after Mr Trump took aim at the Ukrainian president in a post on his Truth Social platform. It is likely the war of words will come up again when Sir Keir meets Mr Trump in Washington next week, to discuss security and Ukraine. Conservative leader Kemi Badenoch, who had been under pressure to condemn Mr Trump's attacks, earlier said Mr Zelenskyy \"is not a dictator. He is the democratically elected leader of Ukraine who bravely stood up to Putin's illegal invasion\". However, she said that Mr Trump \"is right that Europe needs to pull its weight - and that includes the UK\". She added: \"We need to get serious. The PM will have my support to increase defence spending - there is a fully funded plan to get to 2.5% sitting on his desk. \"That should be the bare minimum. Starmer should get on with it, get on a plane to Washington and show some leadership. We cannot afford to get this wrong.\" Labour has pledged to raise defence spending to 2.5% of GDP, from about 2.3% now, but there is no timeline as to when. This week Ms Badenoch admitted the Tories tried to increase the funding to 3% while they were in office but there \"wasn't enough money to do so\". It comes against the backdrop of a war of words between Mr Trump and Mr Zelenskyy, after officials from the US and Russia met in Saudi Arabia for talks to end the war - without representatives from Kyiv or Europe present. Read more from Sky News:Analysis: Badenoch breaks her silence on Ukraine - finallyAnalysis: Ukraine is fighting war on two frontsTrump 'disappointed' by Ukraine 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 After Mr Zelenskyy complained of being excluded from the discussions, Mr Trump suggested the conflict could have been \"settled very easily\" and said \"you [Ukraine] should have never started it\". In response, Mr Zelenskyy said on Wednesday the American leader is living in a \"disinformation space\" created by Russia, which has repeatedly sought to blame Ukraine for the war.  Mr Trump has since hit back, saying Mr Zelenskyy \"better move fast or he is not going to have a country left\" and branding him a \"dictator\". Mr Zelenskyy was elected as president of Ukraine in May 2019. Elections were previously scheduled to go ahead in 2024, but they were not held as a result of martial law being in place. Ex-PM: Trump's comments intended to 'shock Europeans into action' Ms Badenoch's remarks come after reports that Tory MPs wanted her to take a stand on Ukraine since Mr Trump's interventions. Ukraine latest: Trump calls Zelenskyy a 'dictator ' Europe is scrambling to respond to a US shift in foreign policy - with Mr Trump making clear that Washington no longer sees the defence of the continent as its primary concern. Earlier on Wednesday, former prime minister Boris Johnson, who was in office when the war began, claimed Mr Trump's statements are \"not intended to be historically accurate but to shock Europeans into action\". He asked when Europeans will \"stop being scandalised about Donald Trump and start helping him to end this war?\" However on the other end of the political spectrum, Liberal Democrat leader Sir Ed Davey said that \"calling Mr Zelenskyy a 'dictator' must be where the line is drawn\". \"It is my sincere hope that the whole political spectrum in the United Kingdom will speak with one voice in opposition to Trump's lies.\" However defence secretary John Healey earlier reacted to the US president's claim that Ukraine started the war. The cabinet minister told reporters on a visit to Norway, near the border with Russia: \"Three years ago, one country illegally invaded another, and since then, the Ukrainians have been fighting for their freedom. \"They've been fighting for their future, and they still are. So whilst all the focus may be on talks, not even negotiations, our concern as defence ministers is that we're not jeopardising the peace by forgetting about the war.\""
    },
    {
        "title": "Kemi Badenoch breaks her silence on Ukraine – finally",
        "description": "After a former Tory prime minister and the current Liberal Democrat leader made the running on the Trump-Zelenskyy war of words, Kemi Badenoch finally broke her silence.",
        "url": "https://news.sky.com/story/kemi-badenoch-breaks-her-silence-on-ukraine-8211-finally-13312822",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-zelenskyy-badenoch_6833987.png?20250219184252",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-02-19 18:31:00",
        "Headline": "Donald Trump claimed Ukrainian President Volodymyr Zelenskyy was \"a dictator without elections\".",
        "Content": "\n          Chief political correspondent\n              @joncraig\n After a former Tory prime minister and the current Liberal Democrat leader made the running on the Trump-Zelenskyy war of words, Kemi Badenoch finally broke her silence. Amid warnings of a Trump-Putin stitch-up that betrays President Zelenskyy, the Tory leader had been missing in action, even neglecting to mention Ukraine in a conference speech this week. Now she has spoken out, finally. But in a contradictory statement, she said President Trump was wrong to claim that Zelenskyy is a dictator but right that Europe needs to pull its weight. Politics latest - Lammy urged to call out Trump attack on Zelenskyy  Then she said that under successive prime ministers the Conservatives had, and always would, stand with Ukraine, whereas Starmer should boost defence spending and \"show some leadership\". Perhaps she was goaded into breaking her silence by the typically flamboyant words of one of those successive Tory prime ministers, Boris Johnson, and attacks by the Lib Dem leader Sir Ed Davey. Mr Johnson, a cheerleader for both President Zelenskyy and President Trump since he was PM, tried to have it both ways too, criticising the US president's wild claims but backing his motives. \"Trump's statements are not intended to be historically accurate but to shock Europeans into action,\" he said in a pithy statement on Trump buddy Elon Musk's X. But at least Mr Johnson came up with a sensible suggestion: unfreeze the hundreds of billions of dollars in frozen Russian assets being blocked by Belgium, France and other counties. Quite why Ms Badenoch urged Sir Keir Starmer to \"get on a plane to Washington\", when the whole world knows he's getting on a plane to Washington next week, is anybody's guess. More from Sky News:Analysis: Ukraine is fighting war on two frontsTrump 'disappointed' by Ukraine Sir Ed Davey, the Lib Dem leader and self-appointed chief Trump basher in UK politics, has accused both the Conservatives and Reform UK of being \"Trump boot-lickers\". Strong words, no doubt partly motivated by political point-scoring against political opponents. Yet he later said he hoped \"the whole political spectrum in the UK would speak \"with one voice\".  Good luck with that. To be fair to Boris Johnson, Rishi Sunak and Sir Keir Starmer, there has until now been a political consensus in the UK in support of President Zelenskyy and Ukraine. But with Kemi Badenoch playing catch-up, criticising the PM's leadership, and James Cleverly now claiming David Lammy's \"silence is deafening\", that consensus is in danger of fraying."
    },
    {
        "title": "Most areas set to increase council tax by at least 4.99% from April",
        "description": "Most councils are set to increase council tax by the maximum amount of at least 4.99% from April.",
        "url": "https://news.sky.com/story/most-areas-set-to-increase-council-tax-by-at-least-499-from-april-13312588",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-council-tax-bill_6705572.jpg?20241004064523",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-19 12:26:00",
        "Headline": "Six councils have got permission to raise council tax above 4.99% as local authorities struggle with rising costs of social care and homelessness.",
        "Content": "Most councils are set to increase council tax by the maximum amount of at least 4.99% from April. Government figures released on Wednesday show 85% of the 139 top-tier authorities in England that have proposed or confirmed rises so far are planning to do so by 4.99%. If local authorities want to raise council tax by 5% or more, they have to carry out a local referendum, under normal circumstances. Politics latest: Trump wants to 'shock' European into action with false Ukraine claims, Boris Johnson says However, six councils in severe financial trouble have been granted permission to increase council tax beyond this level without a vote. When they are included in the figures, the proportion of local authorities increasing council tax above 4.99% rises to nearly 90% of councils. A total of 17 councils wanting to increase council tax by 4.99% or more have confirmed their intentions, 122 are awaiting approval and 14 are yet to declare their intentions, analysis by the PA news agency shows. \n                  Millions face council tax rise of more than 5% after government gives green light to bigger hikes\n                 \n                  Rising cost of social care and school transport to cause £54bn blackhole for councils\n                 \n                  Single-person council tax discount will not be axed, Downing Street suggests\n                 Councils are facing rising costs, especially in areas where they legally have to provide services such as social care, education, housing and waste services. As they face more pressure to pay for those services, it is unlikely the council tax rises proposed by senior councillors will be rejected by full council ahead of budgets having to be set by the end of February, or March for some. Some councils are planning increases below 4.99% - but only 15. For example, Barnet, north London and Warrington in Cheshire are planning 4.98% increases, while Wandsworth in south London is only planning a 2% rise. Just seven councils are planning to increase council tax by 4% or less. They are: Kensington and Chelsea (4%), Doncaster (3.99%), North East Lincolnshire (3.98%), Essex (3.75%), Rotherham (3%), Lincolnshire (2.99%) and Wandsworth (2%). Read more:Council tax to rise to pay for police funding increaseCouncils to receive £1bn boost to tackle homelessness  The six councils granted permission to increase council tax by more than 4.99% are: Bradford 9.9% Birmingham 7.49% Newham, London 8.99% Somerset 7.5% Trafford, Greater Manchester 7.49% Windsor and Maidenhead 8.99% The Resolution Foundation said the poorest fifth of households across the UK paid 4.8% of their income on council tax in 2020-21, up from 2.9% in 2002-3. The thinktank identified this share of income was three times more than the 1.5% spent by the richest fifth."
    },
    {
        "title": "Things Donald Trump says that aren't true should be called out",
        "description": "Donald Trump made it pretty clear before he won the US presidential election that one of his priorities was going to be ending the war in Ukraine - and quickly.&#160;",
        "url": "https://news.sky.com/story/things-donald-trump-says-that-arent-true-should-be-called-out-13312846",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-volodymyr-zelenskyy_6833975.jpg?20250219175708",
        "type": "Politics",
        "Author": "Sophy Ridge",
        "Date Published": "2025-02-19 19:29:00",
        "Headline": "On Tuesday, President Trump said Ukraine \"should never have started\" the war with Russia. That is not true - and it should be called out.",
        "Content": "\n          Lead politics presenter\n              @SophyRidgeSky\n Donald Trump made it pretty clear before he won the US presidential election that one of his priorities was going to be ending the war in Ukraine - and quickly.  Over the last few days, we've heard an awful lot of analysis and opinion about the nature of the talks - people will have different opinions on the compromises that might need to be made in order to stop the fighting, and the best way of ensuring a peace that lasts. In journalism, it's important to reflect both sides of an argument, listen, understand nuance, different perspectives, be aware of your own bias. But it's also important to state facts - and call out things that aren't true. Politics latest - Lammy urged to call out Trump attack on Zelenskyy On Tuesday night, Donald Trump said Ukraine \"should never have started\" the war with Russia. That is not true - and it should be called out. \n                  Starmer backs 'democratically elected' Zelenskyy after Trump 'dictator' jibe at Ukrainian leader\n                 \n                  Politics latest: Starmer backs Zelenskyy after Trump's attacks\n                 \n                  Kemi Badenoch breaks her silence on Ukraine – finally\n                 On 24 February 2022, Russia invaded Ukraine. Its army attacked from Belarus, Russia, and Crimea - which they have previously annexed.  So what's going on? Well, according to Boris Johnson, Europeans should \"stop being scandalised\" by Donald Trump. \"Trump's statements are not intended to be historically accurate but to shock Europeans into action,\" he said. Read more:Trump's diplomacy does not look good for UkraineTrump 'disappointed' by Ukraine's reaction to talks Is this all a negotiating tactic from the US president? It's certainly possible - and some would agree that Europe needs to step up. But despite all that, facts matter - and this one matters more than most. It seems to me, if you're trying to end a war, you need to face up to the truth of how it started."
    },
    {
        "title": "Anas Sarwar admits Keir Starmer's time in power has been tough - but he's confident Scottish Labour will oust SNP",
        "description": "Scottish Labour leader Anas Sarwar has said the last seven months of Sir Keir Starmer's government have been hard - but he is confident his party will oust the SNP from power next year.",
        "url": "https://news.sky.com/story/sarwar-admits-starmers-time-in-power-has-been-hard-but-hes-confident-scottish-labour-will-oust-snp-from-power-13312829",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sarwar-scotland-starmer_6833991.jpg?20250219185419",
        "type": "Politics",
        "Author": "Connor Gillies",
        "Date Published": "2025-02-19 18:52:00",
        "Headline": "A dramatic change in fortunes now leaves Scottish Labour potentially battling for second place at Holyrood amid a turbulent time with winter fuel payment woes and a row over the treatment of Waspi women.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n  Scottish Labour leader Anas Sarwar has said the last seven months of Sir Keir Starmer's government have been hard - but he is confident his party will oust the SNP from power next year. Mr Sarwar, a close ally of the Sir Keir, was speaking to Sky News ahead of his party's conference in Glasgow this weekend - which the prime minister is expected to attend. The polls had Labour on course to form the next Scottish government at the Holyrood elections in 2026 after capitalising on the SNP's misfortunes amid a bitter leadership contest, and senior figures being involved in a police embezzlement investigation. The PM stormed to victory in last year's general election, securing 37 of the 57 Scottish seats. They only had one MP at the beginning of the previous parliament. Politics latest: Lammy urged to call out Trump's attack on Zelenskyy  However, a dramatic change in fortunes now leaves Scottish Labour potentially battling for second place at Holyrood amid a turbulent time with winter fuel payment woes and a row over the treatment of Waspi women. A recent Notstat poll, commissioned for The Sunday Times, suggested Mr Sarwar may struggle to overtake the Scottish Conservatives as the official opposition in Edinburgh. \n                  Big chains like Wetherspoons will be able absorb extra costs - but frustrations at government are palpable \n                 \n                  Labour needs to 'rearm Britain' with 'more muscular defence', defence secretary warns\n                 \n                  Extra two million NHS appointments in Labour's first five months, government claims\n                 Striking an optimistic tone of the challenges he faces in the coming months, Mr Sarwar said he is \"confident\" there will be a Scottish Labour government next year.  Mr Sarwar said: \"There's no secret there have been challenges in the last seven months, but there hasn't really been a focus on what the choice is in May 2026 and that fundamental choice in 2026 is going to be more decline, more incompetence with the SNP. \"I've been really open with Keir in private and in public that my objective, my plan of course was to help get rid of the Tories, of course was to help elect a UK Labour government - but my ambition was to use the general election as a stepping stone to electing a Scottish Labour government here in 2026, and I'm still confident that is exactly what will happen. \"I have proven the pollsters and the pundits and the commentators wrong many times over the last four years, and I'm confident that we'll prove them wrong again.\" Read more:Starmer confronts reality of Trump and Putin's emerging new world order Scottish Labour has been heavily criticised over its handling of the impending closure of the Grangemouth oil refinery this summer. Mr Sarwar pledged to voters ahead of the general election that his party would \"step in and save the jobs\" by \"investing hundreds of millions of pounds\". Some 400 workers, who face unemployment, have started receiving their redundancy notices in recent weeks as the political promises fail to come to fruition. Asked repeatedly by Sky News whether it was a \"mistake\" to make pledges that could not be delivered, Mr Sarwar said: \"Look. I'm deeply frustrated about this. \"We need further action both, and let me emphasise this, not just from the Scottish government, it requires more urgent action from a UK Labour government too.\""
    },
    {
        "title": "Big chains like Wetherspoons will be able absorb extra costs - but frustrations at government are palpable ",
        "description": "\"They were a little bit arrogant to start with... I think they are learning on the job.\"",
        "url": "https://news.sky.com/story/down-the-pub-political-frustrations-are-palpable-13312664",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-tim-martin-money_6833503.png?20250219112539",
        "type": "Politics",
        "Author": "Darren McCaffrey, presenter",
        "Date Published": "2025-02-19 14:32:00",
        "Headline": "At a time when economic growth is at the heart of what the government wants to achieve, business believes ministers have shot themselves in the foot, making growth more expensive and thus less likely.",
        "Content": "By Darren McCaffrey, presenter   \"They were a little bit arrogant to start with... I think they are learning on the job.\" The obvious frustration of Sir Tim Martin, founder of Wetherspoons, at the government and its handling of the economy. And he's not alone. I've spoken to dozens of business leaders in recent months, many angry about tax increases on employers just around the corner, which alongside Wednesday's inflation is piling costs on businesses - many who fear they won't survive. \"Spoons\" will of course, as will the big supermarkets, be able to absorb the double whammy of employee national insurance increases and a hike in the minimum wage from April. Though those same companies are also clear it will mean likely price rises for customers, fewer people being hired and fewer pubs or shops opening in the future. Many smaller businesses are equally clear it may force them to close altogether. Read more:Inflation rises to a high not seen in nearly a yearThames Water multi-billion pound debt lifeline approved The frustration and anger is rooted, they argue, in the political choices that Labour made before the election. Maybe good political choices but bad economic ones. In order to win, Sir Keir Starmer ruled out tax increases for employees, on VAT, on income tax - what Labour branded \"no tax on hard-working people\". But in doing so - they've boxed themselves in, once in power. With the public finances in a pretty poor state - taxes had to go up and it was decided they would go up on those who employ people. At a time when economic growth is at the heart of what the government wants to achieve, business believes ministers have shot themselves in the foot, making growth more expensive and thus less likely."
    },
    {
        "title": "Senedd committee warns against making lying in politics a criminal offence",
        "description": "A Senedd committee has warned against making lying in politics a criminal offence.",
        "url": "https://news.sky.com/story/senedd-committee-warns-against-making-lying-in-politics-a-criminal-offence-13311377",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-wales-senedd_6831564.jpg?20250217124205",
        "type": "Politics",
        "Author": "Tomos Evans",
        "Date Published": "2025-02-19 01:00:00",
        "Headline": "The Welsh parliament's standards committee has instead recommended strengthening existing procedures, including updating the code of conduct for members.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n A Senedd committee has warned against making lying in politics a criminal offence. It comes after the Welsh government committed to introduce legislation which would ban members of the Welsh parliament from deliberately deceiving. But the Senedd's standards committee, which the government asked to look into the matter, has concluded that lying on purpose should not be criminalised. Former Plaid Cymru leader Adam Price put forward his party's motion in July last year, arguing that trust in politicians had \"fallen to an all-time low\". But before it went to a vote, the Welsh government's then counsel general, Mick Antoniw, said the government was \"committed to the principle\" and said it would introduce legislation ahead of the next Senedd election in 2026. Concerns had been raised by some members on the impact of such proposals on parliamentary privilege. The report comes after the committee last month suggested introducing a mechanism to unseat members of the Senedd found to have breached its code of conduct. \n                  Welsh government sets out plans to ban greyhound racing\n                 \n                  Tata Steel's new electric arc furnace in Port Talbot given green light\n                 \n                  Louis Rees-Zammit: Former Wales rugby star's NFL future confirmed\n                 In the report, published on Wednesday, the committee concludes it was \"not convinced\" that a new criminal offence would restore \"trust in the system\". \"Our view is that the risks and the unintended consequences currently outweigh the benefits,\" the committee added. The committee said the perceived risks included the \"considerable existing strain on the justice system\", the right to freedom of expression under article 10 of the European Convention of Human Rights and the \"difficulties of proving that a statement is false\". Read more from Sky News:Residents' fears over coal tips safetyGrooming gangs inquiry rejected by Senedd - but audit agreed Instead, the committee recommends the Welsh government strengthen the existing standards procedures for members of the Senedd. This includes a clear definition of deliberate deception and changing the code of conduct to explicitly state that members \"must not make deliberately misleading statements\". A Welsh government spokesperson said the committee had \"produced a detailed and thorough report into deliberate deception as part of its inquiry into member accountability\". \"We will now consider its findings and recommendations before responding formally,\" they added."
    },
    {
        "title": "Tomb of Egyptian pharaoh found in 'remarkable discovery' - the first since Tutankhamun",
        "description": "The tomb of an Egyptian pharaoh has been found for the first time since Tutankhamun was discovered in 1922.",
        "url": "https://news.sky.com/story/tomb-of-egyptian-pharaoh-found-in-remarkable-discovery-the-first-since-tutankhamun-13312871",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-egypt-tomb-thutmose-ii_6834092.jpg?20250219210350",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-19 20:00:00",
        "Headline": "The tomb was uncovered by a joint British-Egyptian mission, about 1.5 miles west of the Valley of the Kings in Luxor's western mountain region.",
        "Content": "The tomb of an Egyptian pharaoh has been found for the first time since Tutankhamun was discovered in 1922. In what has been dubbed a \"remarkable discovery\", the tomb of Thutmose II, the last missing royal tomb of the 18th dynasty, was found in the Western Valleys of the Theban Necropolis in Egypt. The tomb was uncovered by a joint British-Egyptian mission, about 1.5 miles west of the Valley of the Kings in Luxor's western mountain region. Objects recovered from the mission included fragments of alabaster jars (used to store perfumes, oils, and ointments) inscribed with the name Pharaoh Thutmose II, as well as inscriptions bearing the name of his wife Queen Hatshepsut - who became one of Egypt's few female pharaohs who ruled in her own right. For the first time ever, funeral furniture belonging to the pharaoh was found, according to Egypt's Ministry of Tourism and Antiquities. No funeral furniture of Thutmose II currently exists in any museum worldwide. The mission was formed by the New Kingdom Research Foundation (NKRF), a British independent academic foundation, and the Ministry of Tourism and Antiquities, a project affiliated to the McDonald Institute for Archaeological Research at the University of Cambridge. \"This discovery solves a great mystery of Ancient Egypt: the location of the tombs of the early 18th dynasty kings,\" said mission leader and field director Piers Litherland. \"The tomb of this ancestor of Tutankhamun had never been found because it was always thought to be at the other end of the mountain near the Valley of the Kings. \"Initially we thought we might have found the tomb of a royal wife, but the wide staircase and the large doorway suggested something more important. \"The discovery that the burial chamber had been decorated with scenes from the Amduat, a religious text which is reserved for kings, was immensely exciting and was the first indication that this was a king's tomb.\" Thutmose II died 3,500 years ago. He is believed to have ruled for around 14 years, from about 1493 to 1479 BCE, and fathered one child, Thutmose III. Read more from Sky News:Odds of asteroid hitting Earth rise againFather 'very concerned' as British journalist missing in BrazilPope Francis 'jokes around' with Giorgia Meloni Mohamed Abdel Badi, head of the Egyptian antiquities sector and co-leader of the mission, said the tomb was discovered in a poor state due to flooding that occurred shortly after the pharaoh's death. Archaeological evidence suggests the contents were moved to a second tomb due to the flood. Mohsen Kamel, assistant field director, said: \"The possible existence of a second, and most likely intact, tomb of Thutmose II is an astonishing possibility.\""
    },
    {
        "title": "Odds of 2024 YR4 asteroid hitting Earth rise again",
        "description": "The risk of the 2024 YR4 asteroid hitting Earth at the end of 2032 has increased again, according to NASA data.",
        "url": "https://news.sky.com/story/odds-of-2024-yr4-asteroid-hitting-earth-rise-again-13312577",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-asteroid-earth-space_6826746.jpg?20250212165816",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-19 12:04:00",
        "Headline": "Data shows the asteroid is the most threatening to Earth in modern forecasting and would cause \"severe damage\" to a region if it makes impact - while scientists have just a few more weeks to observe the asteroid before it disappears from view until 2028.",
        "Content": "The risk of the 2024 YR4 asteroid hitting Earth at the end of 2032 has increased again, according to NASA data. Latest calculations have shown a 3.1% chance of the space rock making impact in just under eight years. It is a significant change since the European Space Agency (ESA) estimated in January there was 1.2% chance of a direct hit. More recent calculations showed the odds had fallen 2.3%. In comparison, astronomers say the chance of winning big on the lottery is about one in 14 million. The increased odds mean the asteroid - which is around the size of a football pitch - is the most threatening to Earth in modern asteroid forecasting and would cause \"severe damage\" to a region if it makes impact. Scientists continue to stress there is no need for alarm and that the odds of an impact will fluctuate. They are working to gather a better understanding of the asteroid's trajectory. NASA and the ESA's Webb Space Telescope will observe the asteroid for a few more weeks before it disappears from view as it heads towards Jupiter. It will not be able to be viewed again until 2028.  NASA calculations show possible 'risk corridor' Data also currently shows if the rock enters the Earth's atmosphere on 22 December 2032, it is likely to head along a large central belt of our planet and over numerous major cities. Estimates say the rock would travel \"somewhere\" along a \"risk corridor\" above areas which are home to millions of people - but NASA data does not currently say which cities and major towns would be in this zone. NASA scientists said: \"In the unlikely event that 2024 YR4 is on an impact trajectory, the impact would occur somewhere along a risk corridor which extends across the eastern Pacific Ocean, northern South America, the Atlantic Ocean, Africa, the Arabian Sea, and South Asia.\" Asteroids are space rocks that scientists believe are the leftovers from the solar system's formation 4.6 billion years ago. Read more:What we know about the asteroidNuclear weapon 'could deflect asteroid' There are millions of rocks orbiting between Mars and Jupiter in a region known as the main asteroid belt. They sometimes get pushed out of the belt and pick up a new course, such as this one. Experts have already said it will be no surprise to them if the impact probability eventually drops to zero \"at some point\"."
    },
    {
        "title": "DeepSeek accused of giving user data to TikTok owner",
        "description": "South Korea has accused the Chinese AI company DeepSeek of sharing user data with TikTok's owner, according to the Yonhap news agency.",
        "url": "https://news.sky.com/story/deepseek-accused-of-giving-user-data-to-tiktok-owner-13312445",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-deepseek-logo_6812410.jpg?20250128034102",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-02-19 09:57:00",
        "Headline": "The South Korean data regulator said DeepSeek was communicating with ByteDance and has blocked new downloads of the app in the country.",
        "Content": "\n          Science and Technology reporter\n       South Korea has accused the Chinese AI company DeepSeek of sharing user data with TikTok's owner, according to the Yonhap news agency. The South Korean data regulator said DeepSeek was communicating with ByteDance, although it has not yet confirmed what user data was shared between the companies. Read more: What is DeepSeek? Over the weekend, the country suspended new downloads of the AI app over security concerns. Users must give explicit permission for their data to be shared with third-party companies under South Korean law.  In response to South Korea's concerns, DeepSeek assigned a representative in South Korea and acknowledged shortcomings in the way it had considered local protection laws, according to Yonhap. When DeepSeek unveiled its powerful AI model, it sent shockwaves through the Western tech industry by being as powerful but significantly cheaper than OpenAI's ChatGPT. \n                  DeepSeek founder Liang Wengfeng spotted in public for first time since company upended AI in the West\n                 \n                  Meta to build world's longest undersea cable\n                 \n                  Why the UK didn't sign up to global AI agreement\n                  However, alarm bells were quickly raised over security. Just weeks before, TikTok, another Chinese tech firm, was briefly banned in the US over concerns about the security of user data. When DeepSeek appeared, US entrepreneur Bill Ackman described DeepSeek as \"a Trojan Horse\" and said TikTok \"is just a toy by comparison\"."
    },
    {
        "title": "Sean 'Diddy' Combs lawyers argue 'racist' criminal charge should be dismissed",
        "description": "Lawyers for Sean \"Diddy\" Combs say the rapper has been subject to a \"racist\" prosecution and are seeking to dismiss one of the criminal charges against him.",
        "url": "https://news.sky.com/story/sean-diddy-combs-lawyers-argue-racist-criminal-charge-should-be-dismissed-13312534",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-p-diddy-sean-combs_6716191.jpg?20250219114244",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-02-19 11:26:00",
        "Headline": "In a new legal document, lawyers for Sean \"Diddy\" Combs have filed a motion to dismiss one of the criminal charges against him, saying he \"has been singled out because he is a powerful black man\". The rapper, who is facing a trial in May, has strenuously denied allegations of wrongdoing.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Lawyers for Sean \"Diddy\" Combs say the rapper has been subject to a \"racist\" prosecution and are seeking to dismiss one of the criminal charges against him. In a court filing seen by Sky News, the 55-year-old's legal team say he \"has been singled out because he is a powerful black man\" and is being prosecuted \"for conduct that regularly goes unpunished\". Combs was charged with racketeering conspiracy, sex trafficking by force, fraud or coercion, and transportation to engage in prostitution, in September 2024. He has pleaded not guilty, said his sexual relationships were consensual, and strenuously denied allegations of wrongdoing. His lawyers have now filed the motion to dismiss the transportation charge. \"This case is unprecedented in many ways, but perhaps most notably, and most disturbingly, no white person has ever been the target of a remotely similar prosecution,\" the court document states. It goes on to list his achievements as an \"extraordinarily successful artist, businessman, philanthropist and one of the most accomplished black people in this country\". However, \"like many other celebrities\", Combs has had \"complicated relationships with significant others as well as with alcohol and drugs throughout his time in the spotlight\", his lawyers say. \"But that doesn't make him a racketeer, or a sex trafficker.\" The rapper's legal team claims there \"has never been a similar prosecution\" under the Mann Act, the federal law the count falls under, which is also known as the White-Slave Traffic Act. They allege the US government has \"concocted\" its case based on allegations Combs would sometimes bring escorts into his relationships. \"No other person, and certainly no white person, has ever previously been prosecuted under the White-Slave Traffic Act for hiring male escorts from another state,\" their court filing states. They also allege the government's handling of the case \"demonstrates bias\", and add that during the investigation of Combs, his home was raided with \"utterly unnecessary military-level force\". Read more from Sky News:'Why am I the fat?': Yosemite workers hit by Musk's cutbacksWoman sues fertility clinic after giving birth to another couple's babyKevin Spacey reacts to Guy Pearce claiming he was 'targeted' The US Attorney's Office for the Southern District of New York declined to comment on the latest court filing when contacted by Sky News. In September, Marc Agnifilo, one of Combs' lawyers, told US entertainment site TMZ he believed the US government had made the case \"as a takedown of a successful black man\". Prosecutors addressed the comments in a subsequent court hearing, US media reported in October, saying Mr Agnifilo had \"baselessly accused the government of engaging in a racist prosecution\", and that this risked prejudicing potential jurors. Combs' trial is currently set to begin in May."
    },
    {
        "title": "Trial of Tupac murder suspect postponed for almost a year",
        "description": "The trial of the only suspect ever to be charged with the murder of rapper Tupac Shakur, almost 30 years after his death, has been postponed for almost a year.",
        "url": "https://news.sky.com/story/trial-of-tupac-murder-suspect-postponed-for-almost-a-year-13312579",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-duane-davis-tupac-shakur_6833613.jpg?20250219130633",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-02-19 12:10:00",
        "Headline": "Duane \"Keffe D\" Davis has been in jail since he was arrested on suspicion of the murder of Tupac Shakur in September 2023, some 27 years after the rapper's death. He has pleaded not guilty - and his lawyers now say they have new leads.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n The trial of the only suspect ever to be charged with the murder of rapper Tupac Shakur, almost 30 years after his death, has been postponed for almost a year. During a short hearing in Las Vegas on Tuesday, Clark County District Court Judge Carli Kierny said she had little choice but to reschedule given new developments presented by Duane \"Keffe D\" Davis' lawyers. Davis, 61, was charged with Tupac's murder in September 2023 and has been in jail since his arrest. He has pleaded not guilty to first-degree murder and his trial has already been pushed back twice, from June to November 2024, and then to March this year. Now, the case has been rescheduled for February 2026. \"It looks like there are quite a few things that are left to be done to get this case prepared so that Mr Davis can have effective assistance of counsel,\" Judge Kierny said. Davis, a former Los Angeles gang leader, agreed when asked by the judge if he was okay with moving the trial by such a long time. His defence team argue it has been so long since the shooting that more time is needed for thorough investigations to ensure a fair trial. They filed a motion last week calling for the trial to be delayed, saying a private investigator had identified witnesses who could testify that Davis was not at the scene of the shooting. They also say they have witness information that Shakur was in stable condition while in hospital, and that they are consulting medical and forensic experts to evaluate potential alternative causes of death. How did Tupac die? Shakur was shot in a drive-by in Las Vegas on the night of 7 September 1996. The rapper was sitting in the passenger seat of a BMW being driven by Marion \"Suge\" Knight, the founder of his record label, Death Row Records, when a white Cadillac pulled up next to them at a red light and shots were fired. Both men were taken to hospital. Knight was wounded, but Shakur died six days later. While Davis is not accused of being the gunman, he is accused of orchestrating the shooting. In Nevada, you can be charged with a crime, including murder, if you help someone commit the crime. Davis has previously claimed publicly in interviews and in a book published in 2019 that he was in the car involved. However, his court filings say any descriptions he has given in recent years were \"done for entertainment purposes and to make money\". In his memoir, Davis implicated his nephew, Orlando \"Baby Lane\" Anderson, a member of the South Side Compton Crips gang, saying he was one of two people in the backseat. Anderson, a known rival of Shakur, had been involved in a casino brawl with the rapper shortly before the shooting. Anderson, who denied any involvement, died in an unrelated gang shoot-out two years later. Read more:A$AP Rocky found not guilty after gun trialPlacebo frontman charged with defamation of Italian PM His attorney, Carl Arnold, has argued that he should never have been charged due to immunity agreements Davis claims he reached with federal and local prosecutors years ago, while living in California.But prosecutors say they have strong evidence against Davis, who now lives in Nevada, and any immunity agreement was limited. Knight is now in jail for an unrelated crime in the Los Angeles area in 2015. Shakur, who was 25 when he died, is regarded as one of the most influential rappers of all time, known for hits including Dear Mama, Keep Ya Head Up, California Love, I Ain't Mad At Cha, and Changes. His killer has never been formally identified, and the case has been regarded as one of the world's most infamous unsolved murders."
    },
    {
        "title": "Kevin Spacey tells Guy Pearce to 'grow up' after claiming he was 'targeted' by House of Cards actor",
        "description": "Kevin Spacey has issued a strongly-worded response to allegations he \"targeted\" Guy Pearce, telling the former co-star \"you're not a victim\" and \"grow up\".",
        "url": "https://news.sky.com/story/kevin-spacey-tells-guy-pearce-to-grow-up-after-claiming-he-was-targeted-by-house-of-cards-actor-13312442",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kevin-spacey-guy-pearce_6833456.jpg?20250219102758",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-19 11:49:00",
        "Headline": "Guy Pearce described being \"young and susceptible\" when he was filming the 1997 movie LA Confidential. But Kevin Spacey has accused his co-star of leaving out details which did not \"fit into the victim narrative\".",
        "Content": "Kevin Spacey has issued a strongly-worded response to allegations he \"targeted\" Guy Pearce, telling the former co-star \"you're not a victim\" and \"grow up\". On Tuesday, Pearce spoke about the 1997 film LA Confidential, choking up while alleging Spacey had pursued him while they were shooting the Oscar-winning film. He told The Hollywood Reporter's Awards Chatter podcast: \"I was sort of scared of Kevin because he's quite an aggressive man. \"He's extremely charming and brilliant at what he does... but I was young and susceptible, and he targeted me, no question.\" Pearce, 57, did not describe details of the alleged encounters but said he had a \"couple of confrontations with Kevin\" that \"got ugly\" since filming LA Confidential. Spacey, 65, has spent years fighting off allegations of sexual harassment and assault, all of which he has denied. Although he has admitted to \"being too handsy\" in the past. The House of Cards star and Oscar winner described having \"been through hell and back\" in a video response on X, in which he denied Pearce's claims and criticised him for going to the media. \n                  Kevin Spacey admits 'being too handsy'  \n                 \n                  Stars say Kevin Spacey should return to acting after 'seven years of exile'\n                 \n                  Kevin Spacey denies new allegations of inappropriate behaviour\n                 \"We could have had that conversation, but instead, you've decided to speak to the press, who are now, of course, coming after me, because they would like to know what my response is to the things that you said,\" Spacey said in the video. \"Guy, you need to grow up. You are not a victim.\" Spacey then posed a series of questions to Pearce: \"Did you also, by the way, tell the press that a year after we shot LA Confidential you flew to Savannah, Georgia - while I was shooting Midnight In The Garden Of Good And Evil - just to spend time with me?\" He then asked: \"Did you tell the press that too? Or does that not fit into the victim narrative you have going?\" Read more from Sky News:A$AP Rocky found not guiltyEmma Raducanu in tears on courtSoap celebrates 40 years In 2017, actor Anthony Rapp accused Spacey of sexual assault. Spacey was found not liable during the subsequent civil lawsuit. He was also accused of groping an 18-year-old at a Massachusetts bar in 2016. Charges were dropped in 2019 after the accuser refused to give evidence. In 2023, Spacey was also acquitted by a UK jury of sexually assaulting four men while working as the artistic director of London's Old Vic Theatre. Last week an additional civil lawsuit was filed in the UK against Spacey and London's Old Vic alleging sexual abuse. Spacey has consistently denied any accusations of sexual misconduct."
    },
    {
        "title": "Female prankster pretending to be marshal sends Glasgow runners on 2.5km detour during race",
        "description": "Runners at a 10k trail race in Glasgow were sent in the wrong direction by a prankster pretending to be a marshal and who buried arrow signs marking the course.",
        "url": "https://news.sky.com/story/female-prankster-pretending-to-be-marshal-sends-glasgow-runners-on-25km-detour-during-race-13312466",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-castlemilk-woodland_6833529.jpg?20250219115219",
        "type": "Strange",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-02-19 10:06:00",
        "Headline": "The organisers of the event said it is \"hard to laugh off the incident\" as the prank led the runners away from medical help had it been needed.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Runners at a 10k trail race in Glasgow were sent in the wrong direction by a prankster pretending to be a marshal and who buried arrow signs marking the course. Acorn Trails said about 30 of the 115 participants at the event on Sunday were sent on a 2.5km (1.5 mile) detour by the woman. Organisers Alex Osborne and Michelle Sinsheimer told Sky News it is \"hard to laugh off the incident\" as the prank led the runners away from medical help had it been needed. Mr Osborne said: \"It's hard to laugh off the incident when you consider the possible implications had things not panned out as lightly as they did. \"There's a fine line between it being a humorous prank and an incident had one of the runners, not all of whom were local, got more lost when their warm clothing, refreshments and first aid were at the finish line. \"I'd ask the saboteur, who we were told is female, to consider the above, which I'd like to think they hadn't thought of on Sunday.\" The competitors affected by the \"mischievous\" interference have been offered a 50% discount on their entry to the next event. \n                  Woman, 74, first to be charged in Scotland under abortion buffer zone law\n                 \n                  Inquiry begins into death of baby at Royal Hospital for Children in Glasgow\n                 \n                  Pharmacist jailed for abusing two women during medical examinations\n                 The near 10k race starts and finishes at the old golf clubhouse within Linn Park following two laps of Castlemilk Woodland. Marshals had been positioned at several turning points, but the woman was able to direct runners towards Linn Park Bridge from an unmanned spot. Read more from Sky News:Tennis star visibly distressed after spotting man in crowd at matchBritish journalist missing in Brazil Acorn Trails has held multiple events at the park, with at least three going into Castlemilk Woodland. Mr Osborne said: \"We've never had issues before. Maybe the odd sign tossed into a hedge, but never a course alteration or pretending to be part of the event staff. \"In terms of stewards at future events, we rely on volunteers giving up their own time and can only deploy the people we have available. \"We target spots where we think runners might get lost and where they appreciate the vocal support our amazing hi-vis heroes provide. \"It's not practical to have marshals in the place of every arrow sign as that would require a huge volume of people.\" Acorn Trails hosts a number of events throughout the year, with both runners and volunteers invited to get involved."
    }
]