[
    {
        "title": "Exit poll may appear decisive - but path to coalition is not clear yet",
        "description": "Initial exit polls appear to confirm what we have known for weeks: that the conservative Christian Democrats (CDU) and their Bavarian sister party the Christian Social Union (CSU) have got the most votes in the federal election, with Friedrich Merz most likely to be the next chancellor.",
        "url": "https://news.sky.com/story/exit-poll-may-appear-decisive-but-path-to-coalition-is-not-clear-yet-13315882",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-germany-elections-friedrich-merz_6837992.jpg?20250223185502",
        "type": "Home",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-02-23 18:30:00",
        "Headline": "While the exit poll result isn't a surprise, the fragile process of coalition building as well as the number of issues on the next government's intray means the path to power isn't easy.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  Initial exit polls appear to confirm what we have known for weeks: that the conservative Christian Democrats (CDU) and their Bavarian sister party the Christian Social Union (CSU) have got the most votes in the federal election, with Friedrich Merz most likely to be the next chancellor. While this result isn't a surprise, it doesn't mean the path to power will be easy. First off, the CDU-CSU don't have a majority so they need to try to build a coalition. Their most obvious choices as partners are the third-place Social Democrats. A two-party coalition is preferred as it can avoid excess bickering but the SPD and CDU disagree on several key points including sending long-range Taurus cruise missiles to Ukraine. Follow live: Germany's election results Forming a government can take months but Mr Merz is keen to speed up the process - aware of the pressing issues both at home and abroad. One of those is the rise of the far right, with the Alternative for Germany (AfD) party celebrating historic results. The initial results suggest that for the first time since the Second World War, a far-right party has got the second highest number of votes. That could also cause serious issues for the next government. As a result of Germany's Nazi history, mainstream parties have a long-running pact known as the \"firewall\" which says they will not work with the far right. Even before the polls had closed, AfD leader Alice Weidel echoed Donald Trump and released a video statement urging people to \"observe\" the ballots being counted and to \"protect democracy\".  Many of the AfD's supporters have said not allowing the second most popular party into government is undemocratic, threatening to take to the streets. The US vice president JD Vance also sparked outrage when he spoke out against the firewall at the recent Munich Security Conference and suggested the new Trump administration would be ready to work with the AfD. Conversely, in the run-up to the election, hundreds of thousands of Germans have protested to demand that the firewall remains. In January, Mr Merz caused controversy when a draft motion got through parliament with AfD support, he's since vowed he will not go into government with them. If he sticks to that pledge then he is likely to see right-wing demonstrations as well becoming a target of prominent AfD backers including Elon Musk. Read more on Germany election:Who is Friedrich Merz - Germany's likely next leader?German elections are usually dull affairs - this time is different The AfD's result also cannot be ignored. While some of the vote may be a protest, the party has expanded its traditional base in the east to pick up support in the west. Dissatisfaction over migration, the economy, rocketing prices and the war in Ukraine have all helped to grow its ranks as people feel ignored by mainstream parties. Mr Merz has already tried to win back some of its voters by proposing tough migration reforms including permanent checks on the borders and potentially turning away some asylum seekers when they try to enter. If he fails to deliver on these promises then the AfD will continue to make gains. Other urgent to dos for the next government include sorting out Germany's economy following two years of recession and restoring its position at the centre of the EU. Ministers must also face up to the fact their traditional allies are no longer guaranteed. The Trump administration appears to be ripping up the rule book when it comes to being a protector of Europe and its ongoing support for Ukraine. If America steps back, as Europe's largest power and Ukraine's largest European backer, Germany will have to step up. Again, that's going to be a big challenge as its military needs to be transformed. The final results are not even confirmed yet but whatever form it takes, the next government knows it has four years to fix Germany, if it fails then populists are highly likely to ride to power in 2029."
    },
    {
        "title": "Pope Francis has 'initial, mild' kidney problem and still in critical condition, says Vatican",
        "description": "The Pope remains in a critical condition and is now showing an \"initial, mild\" kidney problem - but is \"vigilant\" and took part in Mass in hospital with those caring for him.",
        "url": "https://news.sky.com/story/pope-francis-has-early-kidney-issue-and-still-in-critical-condition-says-vatican-13315376",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pope-pope-francis-candles_6835906.jpg?20250221194533",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-23 07:03:00",
        "Headline": "The update comes after the Pope released a message thanking people for their affection and asking for prayers.",
        "Content": " The Pope remains in a critical condition and is now showing an \"initial, mild\" kidney problem - but is \"vigilant\" and took part in Mass in hospital with those caring for him. The Vatican statement said Francis hadn't had any more \"respiratory crises\" since Saturday evening. However, a problem with his kidneys has emerged, with blood tests showing \"an initial, mild, renal insufficiency, which is currently under control\", according to the update. The 88-year-old Pope is still having \"high-flow oxygen therapy\" into his nose, while his hemoglobin value has increased after being given blood transfusions on Saturday. The Pope has been at Rome's Gemelli hospital since 14 February and is being treated for double pneumonia and chronic bronchitis. Sunday evening's statement said he was \"vigilant and well oriented\", but due to the complexity of his case the prognosis is \"reserved\". \"During the morning, in the apartment set up on the 10th floor, he participated in the Holy Mass, together with those who are taking care of him during these days of hospitalization,\" the update added. On Sunday morning, the Vatican said the Pope had a \"tranquil\" night and confirmed he would not lead prayers for the second week running. Instead, Francis, who has been Pope since 2013, prepared words to be read on his behalf at the recitation of the Angelus. 'I ask you to pray for me' The Pope's message said: \"I am confidently continuing my hospitalisation at the Gemelli Hospital, carrying on with the necessary treatment; and rest is also part of the therapy! \"I sincerely thank the doctors and health workers of this hospital for the attention they are showing me and the dedication with which they carry out their service among the sick. \"In recent days I have received many messages of affection, and I have been particularly struck by the letters and drawings from children. \"Thank you for this closeness, and for the prayers of comfort I have received from all over the world! I entrust you all to the intercession of Mary, and I ask you to pray for me.\"  The message is understood to have been written in the last few days. On Saturday night, the Vatican said the Pope was in a critical condition after a \"prolonged respiratory crisis\" that required a high flow of oxygen. It said he'd had blood transfusions after tests revealed thrombocytopenia, which is associated with anaemia. Millions around the world have been concerned about his increasingly frail health - and his condition has given rise to speculation over a possible resignation. By Lisa Holland, Sky correspondent in Vatican City  It's hard to imagine a Sunday in the Vatican City without the Pope. Every week – unless he's travelling – he is a constant, appearing at the same Vatican windows to deliver his message. Instead, his written words were distributed by Vatican officials. In his message, the Pope thanked his doctors and people around the world for their good wishes. But it seems the upbeat message was written before the dramatic downturn in the Pope’s health, which has left him in a critical condition. The business and the events of the Church are continuing in his absence.\n Faith is never lost but it feels like optimism is fading and we are living through the last days of Pope Francis. In St Peter's Square the sun shone – and a gentle light fell on the ancient stone of the basilica.\nThe beauty and pageantry of columns of deacons and visitors filing in for a special mass as part of the Catholic Church's jubilee year sat awkwardly with the prognosis of the Pope's ailing health.\n The visitors and deacons who'd come from around the world to take part, and hoped to see the Pope, were left disappointed.  Though they said they felt his presence. \"It is what it is,\" said one. They know the Pope is an 88-year-old man who has spent the last few years assisted by a wheelchair and walking stick. Throughout his life he has been dogged by lung issues.\n It leaves an almost philosophical mood ahead of what the coming days may bring.  Read more from Sky News: Two motorways closed after human remains foundMusk says federal employees must justify work or resign Doctors said on Friday that he was \"not out of danger\" and was expected to remain in hospital for at least another week. They also warned that while he did not have sepsis, there was always a risk the infection could spread in his body. Sepsis is a complication of an infection that can lead to organ failure and death. Pope Francis has a history of respiratory illness, having lost part of one of his lungs to pleurisy as a young man. He also had an acute case of pneumonia in 2023."
    },
    {
        "title": "Taxi driver shot by masked men through car window in west Belfast",
        "description": "Police in Northern Ireland have appealed for information after a taxi driver was shot through the window of his car on Sunday morning.&#160;",
        "url": "https://news.sky.com/story/taxi-driver-shot-by-masked-men-through-car-window-in-west-belfast-13316002",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bell-steel-manor-belfast_6838108.png?20250223221341",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-23 22:02:00",
        "Headline": "Police are appealing for information after the shooting on Sunday morning.",
        "Content": "Police in Northern Ireland have appealed for information after a taxi driver was shot through the window of his car on Sunday morning.  Detectives from the Police Service of Northern Ireland (PSNI) said two masked men approached the taxi at about 10.30am in the Bell Steel Manor area of Dunmurry, west Belfast. The taxi had been parked in the area. In a statement, a PSNI detective said the driver \"was taken to hospital for treatment of his injuries and is described as being in a critical but stable condition. \"Our investigation is at a very early stage and we urge anyone who was in the area at the time, and who may have information, dash-cam, CCTV or doorbell footage which could assist with our enquiries, to get in touch.\" Danny Baker, a Sinn Fein representative in Stormont, condemned the \"reckless\" shooting. \"There is no justification for guns on our streets. \"This is an extremely busy area in our community, with many local families and children passing through to visit shops, attend sports training and go about their daily lives. \"I want to extend my best wishes to the man who has been taken to hospital, and I hope that he fully recovers.\" Read more on Sky News:Body found in search for missing jogger, 23Innocent man released from prison after 30 years - here's what he thinks of modern life"
    },
    {
        "title": "'I felt like a trespasser and imposter': Louis Theroux to be awarded prestigious NFTS fellowship",
        "description": "Louis Theroux will be honoured with the prestigious National Film and Television School (NFTS) fellowship next month.",
        "url": "https://news.sky.com/story/i-felt-like-a-trespasser-and-imposter-louis-theroux-to-be-awarded-prestigious-nfts-fellowship-13313948",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-louis-theroux-headshot_6835694.jpg?20250221162756",
        "type": "Home",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-23 00:01:00",
        "Headline": "Famed for his Weird Weekends in the '90s, before interviewing a host of celebrities in When Louis Met and some less willing Scientologists for his feature-length 2026 movie, Louis Theroux is being honoured for his contribution to the industry.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Louis Theroux will be honoured with the prestigious National Film and Television School (NFTS) fellowship next month. The renowned interviewer - who has been working in the business for over three decades, and whose Weird Weekends were the stuff of legend - admits he initially felt like \"a trespasser\" and \"imposter\" in his front-of-screen role. Never going to film school himself, the now world-famous presenter and documentarian got his first job as a print journalist in America after graduating from Oxford University. His big break came on Michael Moore's TV Nation series, as a roving reporter delving into offbeat culture, later striking up a deal with the BBC resulting in Louis Theroux's Weird Weekends. A first-person storyteller, who disarms his subjects with charm, Theroux's interviews frequently result in the unexpected. Commenting on his upcoming award, Theroux said: \"I came into the industry more than thirty years ago, feeling like a trespasser, an imposter, in a role meant for someone else, worrying that I would be found out, hoping I could keep going for a few more months, since I was enjoying it so much. \"All these years later, I've learned that 'keeping going' may be the best definition of success.\" \n                  Barry Keoghan hits back at 'disgusting' online attacks calling him an 'absent father'\n                 \n                  Louis Theroux pays tribute to porn star Kagney Linn Karter who took her own life\n                 \n                  Louis Theroux contemplates cosmetic tattoo after shaving off 'patchy eyebrows'\n                 Admitting that like those just starting out in the field, he too is \"still figuring things out\", he said he hoped the fellowship would give him the chance to \"connect with younger people… sharing the few things I've learned, and more importantly learning from them\". Theroux went on to interview a host of celebrities in When Louis Met…, including Jimmy Savile, who is now known to have been one of the UK's most prolific sexual predators. Haunted by the interaction, Theroux would go on to interview some of Savile's victims in a follow-up 16 years later. Theroux has also fronted various documentaries across BBC1 and BBC2 and released the 2016 feature-length documentary My Scientology Movie. The author of several books, he currently hosts his own podcast series. In 2019, he set up his own production company, Mindhouse, with his wife Nancy Strang and filmmaker Arron Fellows, producing documentary film and TV series, as well as his podcast. Theroux recently revealed he was suffering from alopecia, initially resulting in the loss of his eyebrows. In true Theroux style, the 54-year-old has been documenting his hair loss journey on social media, seeking advice and sharing updates with his followers. Read more:Pamela Anderson on reclaiming her life and careerChris O'Dowd on returning to a 'broke' and 'down' London NFTS chair Sophie Turner Laing praised Theroux's \"immense contribution\" to the world of factual filmmaking, adding: \"His ability to connect with audiences and uncover powerful human stories makes him a true icon in the industry.\" Previous recipients of the honorary fellowship include James Bond producer Barbara Broccoli, Wallace And Gromit creator Nick Park, director Sam Mendes and children's author Malorie Blackman. NFTS graduates have gone on to win 15 Oscars and 166 BAFTAs since the school opened half a century ago, with current graduates' work on show at the BFI Southbank from Monday 3 March to Thursday 6 March. The fellowship will be awarded to Theroux during the school's graduation ceremony on Friday 7 March."
    },
    {
        "title": "Zelenskyy says he would give up presidency in return for peace and NATO membership for Ukraine",
        "description": "Ukraine's president has said he would step down in return for peace and NATO membership for his country. ",
        "url": "https://news.sky.com/story/russia-launches-aerial-terror-with-biggest-drone-attack-since-start-of-war-zelenskyy-13315475",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ukraine-russia-drone_6837530.jpg?20250223115850",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-23 11:41:00",
        "Headline": "President Zelenskyy condemned the \"aerial terror\" as he said Ukraine suffered its heaviest drone bombardment of the war overnight.",
        "Content": " Ukraine's president has said he would step down in return for peace and NATO membership for his country.  \"If [it means] peace for Ukraine, if you really need me to leave my post, I am ready,\" Volodymyr Zelenskyy said at a news conference. \"I can exchange this for NATO [membership], if that condition is there, immediately,\" he added. Donald Trump has previously said Ukraine is unlikely to become a NATO ally and membership is a red line for Russia. Mr Zelenskyy's comment appeared to be a response to Mr Trump recently calling him a \"dictator\" as Ukraine hadn't held fresh elections - despite laws prohibiting it during wartime During a wide-ranging conference in Kyiv, Mr Zelenskyy also said talks on a minerals deal with the US were moving forward, adding \"all is OK\", despite concerns of a stalemate in negotiations.   President Trump said on Saturday a deal was \"pretty close\" and he was determined to get payback for billions of dollars of aid provided to Ukraine. Ukraine wants the deal to include robust security guarantees over any future peace settlement with Russia.  Mr Zelenskyy also told Sky's Deborah Hayes that next week's visits to Washington by Sir Keir Starmer and Emmanuel Macron were vital. He said Europe had to be \"at the table\" when a peace deal is negotiated. \"Who will represent Europe - I can't tell you now exactly,\" he said. \"But I think one person will represent the EU. And of course, the UK has to be at the table, if we speak, for example, about security guarantees.\" The UK prime minister has said he's prepared to deploy British troops to Ukraine as part of a peacekeeping force. 'Biggest drone attack of war' The Ukrainian leader was speaking after his country was hit overnight with what he called the biggest drone attack since the war started. Mr Zelenskyy condemned Russia for the \"aerial terror\" - a day before the third anniversary of Russia's full-scale invasion. \"Every day, our people stand against aerial terror,\" Mr Zelenskyy wrote on X. \"On the eve of the third anniversary of the full-scale war, Russia launched 267 attack drones against Ukraine - the largest attack since Iranian drones began striking Ukrainian cities and villages.\" A total of 138 of the drones were shot down and another 119 disappeared from radars after being jammed by electronic warfare, Ukraine's air force said. Damage was reported across five regions. Mr Zelenskyy said nearly 1,150 drones, more than 1,400 guided aerial bombs and 35 missiles had been launched at Ukraine in the past week. He thanked those operating air defences and called on allies to stand united to secure a \"just and lasting peace\". \"This is achievable through the unity of all partners - we need the strength of all of Europe, the strength of America, the strength of everyone who seeks lasting peace,\" he said.  Read more:Fact-checking Trump's claims on Zelenskyy and Ukraine It comes amid concerns over Mr Trump's recent war of words with Mr Zelenskyy and his false claim that Ukraine had started the war. At a conservative conference on Saturday, Mr Trump - who alarmed Europe and Ukraine by holding a recent call with Vladimir Putin - repeated his optimism that a peace deal is possible under his watch. \"I've spoken to President Putin and I think that thing [the war] is going to end,\" said Mr Trump. Ukraine has insisted it won't accept any peace deal agreed without its participation, after it was excluded from a meeting between US and Russian diplomats in Saudi Arabia."
    },
    {
        "title": "British couple in their 70s detained by Taliban in Afghanistan",
        "description": "A British couple in their 70s who run education programmes in Afghanistan have been arrested by the Taliban, their children say.&#160;",
        "url": "https://news.sky.com/story/british-couple-in-their-70s-detained-by-taliban-in-afghanistan-13315839",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-peter-reynolds-barbie-reynolds_6837937.jpg?20250223175304",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-23 17:48:00",
        "Headline": "Peter Reynolds, 79, and his wife Barbie, 75, run education and training programmes in Afghanistan. They have lived in the country for 18 years. ",
        "Content": "A British couple in their 70s who run education programmes in Afghanistan have been arrested by the Taliban, their children say.  Peter Reynolds, 79, and his wife Barbie, 75, were detained earlier this month but the reason for their arrests is unknown. Their four adult children have said the couple were married in Kabul in 1970 and have lived in Afghanistan for 18 years - remaining after the Taliban toppled the Western-backed government in 2021. The couple runs Rebuild, an organisation that provides education and training programmes for businesses, government agencies, educational organisations and nongovernmental groups. Photos on Rebuild's website show both men and women taking part in various courses, including teacher training and management courses. Since the Taliban suddenly returned to power more than three years ago, it has severely restricted women's education and activities and is considered the worst place on earth to be a woman. In an open letter to the Taliban's interior ministry, shared with Sky News, the couple's children wrote: \"They have always been open about their presence and their work, diligently respecting and obeying the laws as they change. They do not represent another religion, and they love Muslims dearly.\" The couple, who are also Afghan citizens, allegedly texted their children after their arrests saying they did not want Western authorities to get involved. Read more:Pope sends message from hospital bed Zelenskyy 'would quit' for peace and NATO membershipPay back billions of aid, Trump tells Ukraine In the childrens' letter to the Taliban, they said: \"We recognise that there have been instances where exchanges have been beneficial for your government and Western nations. \"However, our parents have consistently expressed their commitment to Afghanistan, stating that they would rather sacrifice their lives than become part of ransom negotiations or be traded. \"We trust that this is not your intention, as we are instructed to respect their wishes to remain with you.\" The children added: \"They have chosen Afghanistan as their home, rather than with family in England, and they wish to spend the rest of their lives in Afghanistan.\" The Foreign Office declined to comment but it is understood they are aware of the arrests. The UK does not recognise the Taliban and has no embassy in Kabul."
    },
    {
        "title": "Boy, 16, arrested after teenager stabbed in Nottingham city centre Primark ",
        "description": "A 16-year-old boy has been arrested after another teenager, 17, was stabbed in front of shoppers in a Primark store in Nottingham city centre. ",
        "url": "https://news.sky.com/story/boy-16-arrested-after-teenager-stabbed-in-city-centre-primark-13315669",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-primark-nottingham_6837755.jpg?20250223153900",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-23 15:25:00",
        "Headline": "A 17-year-old boy is in hospital with \"serious injuries\", police say. ",
        "Content": "A 16-year-old boy has been arrested after another teenager, 17, was stabbed in front of shoppers in a Primark store in Nottingham city centre.  The victim suffered a stab wound to the chest after he was attacked inside the shop in Long Row at about 11.30am on Sunday. He was taken to hospital with \"serious injuries\" but these are not believed to be life-threatening, police said. A suspect fled the scene in the direction of Market Square after the attack. A 16-year-old boy was arrested later on Sunday on suspicion of causing grevious bodily harm. Officers believe there was an altercation outside the store between a group of young people before the attack and are appealing for witnesses. Detective Inspector Paul Shortt, of Nottinghamshire Police, said: \"This was a shocking incident that will have caused considerable alarm to anyone who witnessed it. \"A team of detectives has been working throughout the day to investigate this incident and we have now identified a suspect.\" In an earlier statement, Detective Inspector Shortt said: \"This was an appalling act of violence carried out in full view of members of the public. \"A team of detectives is now working to understand exactly what happened in the moments before, during and after this incident. \"To this end they want to hear from anyone who saw or heard any part of what happened. \"No matter how significant you think your information may be, we want to hear from you without delay.\" A Primark spokesperson said the shop is closed until further notice after the stabbing. \"Our thoughts are with the victim and we are focused on supporting our colleagues who were in store at the time,\" a statement said. \"We are assisting the police with their investigation and are unable to comment further.\""
    },
    {
        "title": "Fresh amber warning for rain as Met Office issues alerts for much of UK",
        "description": "A fresh amber weather warning for heavy rain has been issued by the Met Office - with much of the UK already on alert for high winds and showers. ",
        "url": "https://news.sky.com/story/rain-and-strong-winds-forecast-as-met-office-issues-warnings-13315384",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-millennium-bridge-weather_6238380.jpg?20230802160833",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-23 07:35:00",
        "Headline": "Temperatures are expected to cool over the coming days, the Met Office says.",
        "Content": "A fresh amber weather warning for heavy rain has been issued by the Met Office - with much of the UK already on alert for high winds and showers.  Northern Ireland, Scotland and the UK's west coast and the Midlands have yellow warnings for wind on Sunday - meaning the possibility of transport delays and short-term power cuts. There are also rain warnings in place for several parts of western UK. The new amber warning has been issued for rain in south and central Wales and is in force from 3pm on Sunday to 6am on Monday. An amber warning means danger to life from floodwater, homes and businesses are likely to be flooded, and there is a chance some communities will be cut off. Winds across the west of the UK will increase throughout the morning with gusts up to 70mph in exposed areas, the Met Office said. Zoe Hutin, a meteorologist at the forecaster, said Sunday is expected to be the \"worst day\" before conditions improve. \"The wind warning itself for the mainland UK ends at 6pm, but we can expect to continue to see quite blustery conditions even into the evening as the mainland rain itself pushes through.\" She added: \"By the time people get up on Monday, we'll still have some of the residual rain from that front in the far south-east of the country, and quite cloudy across England as well. \"But actually elsewhere, it could be a decent start.\" The Met Office's yellow weather warnings for much of England and Scotland came into force at 6am and are expected to run until 6pm on Sunday. A separate yellow warning for Northern Ireland came into force at 3am and runs until 3pm. Read more from Sky News:Motorways closed after human remains foundStarmer asks US to stand by Ukraine People who have noticed some slightly higher temperatures the last couple of days may be dismayed at the latest predictions. \"Through the week, those temperatures are trending back down,\" Ms Hutin said. \"And so it will be getting cooler each day, but they will actually just be recovering to around average for the time of year. So it won't be cold. \"It will just be returning back to where we would expect to be for this time of February.\""
    },
    {
        "title": "Taxi driver shot by masked men through car window in west Belfast",
        "description": "Police in Northern Ireland have appealed for information after a taxi driver was shot through the window of his car on Sunday morning.&#160;",
        "url": "https://news.sky.com/story/taxi-driver-shot-by-masked-men-through-car-window-in-west-belfast-13316002",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bell-steel-manor-belfast_6838108.png?20250223221341",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-23 22:02:00",
        "Headline": "Police are appealing for information after the shooting on Sunday morning.",
        "Content": "Police in Northern Ireland have appealed for information after a taxi driver was shot through the window of his car on Sunday morning.  Detectives from the Police Service of Northern Ireland (PSNI) said two masked men approached the taxi at about 10.30am in the Bell Steel Manor area of Dunmurry, west Belfast. The taxi had been parked in the area. In a statement, a PSNI detective said the driver \"was taken to hospital for treatment of his injuries and is described as being in a critical but stable condition. \"Our investigation is at a very early stage and we urge anyone who was in the area at the time, and who may have information, dash-cam, CCTV or doorbell footage which could assist with our enquiries, to get in touch.\" Danny Baker, a Sinn Fein representative in Stormont, condemned the \"reckless\" shooting. \"There is no justification for guns on our streets. \"This is an extremely busy area in our community, with many local families and children passing through to visit shops, attend sports training and go about their daily lives. \"I want to extend my best wishes to the man who has been taken to hospital, and I hope that he fully recovers.\" Read more on Sky News:Body found in search for missing jogger, 23Innocent man released from prison after 30 years - here's what he thinks of modern life"
    },
    {
        "title": "'I felt like a trespasser and imposter': Louis Theroux to be awarded prestigious NFTS fellowship",
        "description": "Louis Theroux will be honoured with the prestigious National Film and Television School (NFTS) fellowship next month.",
        "url": "https://news.sky.com/story/i-felt-like-a-trespasser-and-imposter-louis-theroux-to-be-awarded-prestigious-nfts-fellowship-13313948",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-louis-theroux-headshot_6835694.jpg?20250221162756",
        "type": "UK",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-23 00:01:00",
        "Headline": "Famed for his Weird Weekends in the '90s, before interviewing a host of celebrities in When Louis Met and some less willing Scientologists for his feature-length 2026 movie, Louis Theroux is being honoured for his contribution to the industry.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Louis Theroux will be honoured with the prestigious National Film and Television School (NFTS) fellowship next month. The renowned interviewer - who has been working in the business for over three decades, and whose Weird Weekends were the stuff of legend - admits he initially felt like \"a trespasser\" and \"imposter\" in his front-of-screen role. Never going to film school himself, the now world-famous presenter and documentarian got his first job as a print journalist in America after graduating from Oxford University. His big break came on Michael Moore's TV Nation series, as a roving reporter delving into offbeat culture, later striking up a deal with the BBC resulting in Louis Theroux's Weird Weekends. A first-person storyteller, who disarms his subjects with charm, Theroux's interviews frequently result in the unexpected. Commenting on his upcoming award, Theroux said: \"I came into the industry more than thirty years ago, feeling like a trespasser, an imposter, in a role meant for someone else, worrying that I would be found out, hoping I could keep going for a few more months, since I was enjoying it so much. \"All these years later, I've learned that 'keeping going' may be the best definition of success.\" \n                  Barry Keoghan hits back at 'disgusting' online attacks calling him an 'absent father'\n                 \n                  Louis Theroux pays tribute to porn star Kagney Linn Karter who took her own life\n                 \n                  Louis Theroux contemplates cosmetic tattoo after shaving off 'patchy eyebrows'\n                 Admitting that like those just starting out in the field, he too is \"still figuring things out\", he said he hoped the fellowship would give him the chance to \"connect with younger people… sharing the few things I've learned, and more importantly learning from them\". Theroux went on to interview a host of celebrities in When Louis Met…, including Jimmy Savile, who is now known to have been one of the UK's most prolific sexual predators. Haunted by the interaction, Theroux would go on to interview some of Savile's victims in a follow-up 16 years later. Theroux has also fronted various documentaries across BBC1 and BBC2 and released the 2016 feature-length documentary My Scientology Movie. The author of several books, he currently hosts his own podcast series. In 2019, he set up his own production company, Mindhouse, with his wife Nancy Strang and filmmaker Arron Fellows, producing documentary film and TV series, as well as his podcast. Theroux recently revealed he was suffering from alopecia, initially resulting in the loss of his eyebrows. In true Theroux style, the 54-year-old has been documenting his hair loss journey on social media, seeking advice and sharing updates with his followers. Read more:Pamela Anderson on reclaiming her life and careerChris O'Dowd on returning to a 'broke' and 'down' London NFTS chair Sophie Turner Laing praised Theroux's \"immense contribution\" to the world of factual filmmaking, adding: \"His ability to connect with audiences and uncover powerful human stories makes him a true icon in the industry.\" Previous recipients of the honorary fellowship include James Bond producer Barbara Broccoli, Wallace And Gromit creator Nick Park, director Sam Mendes and children's author Malorie Blackman. NFTS graduates have gone on to win 15 Oscars and 166 BAFTAs since the school opened half a century ago, with current graduates' work on show at the BFI Southbank from Monday 3 March to Thursday 6 March. The fellowship will be awarded to Theroux during the school's graduation ceremony on Friday 7 March."
    },
    {
        "title": "Starmer says 'US is right' about UK and Europe needing to take more responsibility for defence",
        "description": "Sir Keir Starmer has said the United States \"is right\" about the UK and Europe needing to take more responsibility for defence and security.",
        "url": "https://news.sky.com/story/starmer-says-us-is-right-about-uk-and-europe-needing-to-take-more-responsibility-for-defence-13315477",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-scotland_6837484.png?20250223105311",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-02-23 11:46:00",
        "Headline": "The prime minister agrees with Donald Trump's comments about Europe needing to spend more on defence ahead of his visit to Washington DC next week.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Keir Starmer has said the United States \"is right\" about the UK and Europe needing to take more responsibility for defence and security. The prime minister, speaking at the Scottish Labour conference in Glasgow on Sunday, said he is clear Britain \"will take a leading responsibility\" in protecting the continent. \"Instability in Europe always washes up on our shores,\" he said. \"And this is a generational moment. I've been saying for some time that we Europeans - including the United Kingdom - have to do more for our defence and security. The US is right about that.\" He added \"we can't cling to the comforts of the past\" as it is \"time to take responsibility for our security\". Politics latest: Starmer's stinging rebuke of Reform Donald Trump sparked an emergency meeting of European leaders this week after he said European NATO members should spend more on defence, while the US should spend less.  Sir Keir has said he will set out a path for the UK to spend 2.5% of GDP on defence, up from the current 2.3%, but has not indicated when that will be. It is believed he may announce the details when he visits Mr Trump in Washington DC on Thursday, bringing forward the announcement that was expected in the spring when a defence spending review is published. The prime minister reiterated the UK will \"play our role\" if required in Ukraine following a peace agreement after he earlier this week said the UK would send troops to be part of a peacekeeping force. However, his comments caused a row with Germany and Italy who said it was premature to commit to boots on the ground, although France agreed with the UK. Sir Keir said: \"As we enter a new phase in this conflict, we must now deepen our solidarity even further.\" He added: \"There can be no discussion about Ukraine without Ukraine. \"And the people of Ukraine must have long-term security.\" Read more:Starmer tells Zelenskyy this is 'significant moment' for European securitySombre Starmer and Europe confront emerging new world order This week has seen US officials meet their Russian counterparts in Saudi Arabia to discuss Ukraine - which has been met with indignation by Ukrainian President Volodymyr Zelenskyy as none of his team were invited. No Europeans were invited either, sparking concern the US is pandering to Vladimir Putin. Sir Keir has promised Mr Zelenskyy he will make the case for safeguarding Ukraine's sovereignty when he meets with Mr Trump, who has called the Ukrainian president a dictator. Mr Trump also said Sir Keir and French President Emmanuel Macron, who will visit the White House too this week, \"haven't done anything\" to end the war."
    },
    {
        "title": "Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing",
        "description": "Visits by prime ministers to the American president matter much more to us \"Brits\" than they do to them. ",
        "url": "https://news.sky.com/story/starmers-challenge-is-to-see-if-usual-rules-of-special-relationship-still-apply-under-trump-after-years-of-love-bombing-13313250",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-adam-boulton-bespoke_6835540.png?20250221130148",
        "type": "UK",
        "Author": "Adam Boulton",
        "Date Published": "2025-02-23 00:01:00",
        "Headline": "The challenges of the UK-US special relationship are not new. As Adam Boulton explains, it's always been up and down for prime ministers looking to charm presidents. ",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n Visits by prime ministers to the American president matter much more to us \"Brits\" than they do to them.  Donald Trump spelt this out in the off-hand way he announced that he had granted Sir Keir Starmer the coveted appointment in his busy schedule. \"We have a lot of good things going on,\" the president boasted. \"But he asked to come and see me and I just accepted his asking.\" After his phone call with the prime minister, Trump declared \"we're going to have a friendly meeting, very good\". That was before Sir Keir publicly disagreed with Trump's ruling that Volodymyr Zelenskyy is \"a dictator\".  Always assuming that his invitation is not cancelled in a fit of presidential pique, Starmer will find himself proceeding with the utmost caution when he gets to the Oval Office. Downing Street sources say they are anxious \"not to poke the bear\" in the full knowledge that previous leaders have endured many awkward moments in their attempts to further a special relationship at away matches. Starmer will have his work cut out. Since his re-election, Trump has signalled that he has less time than ever for traditional alliances. Newly inaugurated presidents traditionally send friendly greetings to their territorial neighbours. Trump slapped tariffs on Canada and Mexico and talked about US territorial expansion to both the north and the south. Historically the UK prime minister has often been the first foreign leader welcomed by a new US president. Trump hosted Theresa May less than a week after he took office for the first time and surprised her when he held her hand to go down some steps. This year Starmer has already been preceded by the leaders of Israel, Japan, Jordan and Indonesia and will be crossing the Atlantic to pay his respects in the same few days as France's President Macron. Thatcher and Reagan's political romance Even at the best of times, British officials are prone to exaggerate the closeness of the two countries' mutual interests. Harold Macmillan thought he could teach the young John Kennedy a thing or two, as the Greek to JFK's Roman, but ended up being dictated to by Kennedy on the nature of the UK's \"independent\" nuclear deterrent. One of the wily Harold Wilson's most significant achievements was refusing to send British troops to fight alongside the Americans in the Vietnam War. The most celebrated PM/POTUS political romance was between Margaret Thatcher and Ronald Reagan. Indeed when the Falklands conflict broke out in the spring of 1982, I was in the White House briefing room to hear then US secretary of state Al Haig joke with innuendo about the closeness of their relationship. It blossomed after Thatcher won Reagan over to give the UK expedition staunch support, in defiance of the advice from some of his officials. Even so, Thatcher was unnerved by Reagan's apparent willingness to consider mutual nuclear disarmament in discussion with the Soviet leader Mikhail Gorbachev in 1986. She flew hastily to Washington DC following the Reagan-Gorbachev summit in Reykjavik - \"to give Reagan a bollocking\" - at least according to the Daily Express reporter in her travelling party. In 1990 she reportedly told George HW Bush \"now George, this is not time to go wobbly\" during the flurry of meetings and phone calls which followed Iraq's invasion of Kuwait. Clinton owing Blair and Bush's love bombing John Major got off to a bad start with Bill Clinton after Conservative sources tried to help the Republican campaign dig up dirt on Clinton's time as a student at Oxford. Soon after the US election in 1992, Major flew to the US in the hope of being invited to a face-to-face meeting with the then president-elect. After several days all he got was a phone call from Little Rock, Arkansas. In spite of their ideological closeness, Tony Blair later said he found it more difficult to deal with the Third Way Democrat Bill Clinton than he did with the \"straightforward\" Republican George W Bush. Clinton nonetheless was a key player in bringing about the Belfast agreement. Blair's greatest success was persuading the president to commit US forces to peacekeeping in the Balkans but he also did Clinton significant personal service. Blair went on a scheduled visit to the White House at the height of the Monica Lewinsky scandal, just days after the president had made his statement \"I did not have sex with that woman\". At their joint news conference afterwards, Blair allowed all the questions to be deflected to him and expressed his admiration for the president. As they walked away from the East Wing, Clinton put his arm around the prime minister and appeared to say \"I owe you one\". Clinton's advice to Blair on his successor George W Bush was \"hug him close\". But both sides were apprehensive when the Labour prime minister flew to Camp David for his first meeting with the second President Bush. Bush wanted them to dress casual, and according to the British ambassador, Blair put on some \"ball-crushingly tight jeans\". From Bush's first words about sharing the same kind of toothpaste, Blair was subjected to love bombing. The two leaders' relationship remained close, including sending troops side-by-side into Afghanistan and Iraq. Brown's bag of CDs, Cameron's humility and common interests Through no fault of his own Gordon Brown found himself in the midst of a British media furore after Barack Obama's team returned a bust of Churchill which had been lent personally to George W Bush by the British Embassy. The new Obama administration's ignorance of the usual niceties was further demonstrated when a history-steeped gift to the president from Brown was reciprocated with a bag of CDs. David Cameron struck a humble note visiting Obama when he described the UK as America's \"junior partner\". Their alliance backfired when Obama tried to help during the Brexit referendum - warning that the UK would find itself \"at the back of the queue\" for striking a trade deal with the US after Brexit. The rapid turnover of prime ministers during Joe Biden's presidency did not allow any of them to build up a close working relationship. In any case, Biden chose to identify with his Irish, and not his English, heritage. Until this second Trump presidency, the US and the UK were at least pulling in the same direction, with differing interests but the common assumption that they would back each other up where possible. Starmer's challenge is to see if those rules still apply. Left-right differences can be overcome Until now, differences of left and right have not mattered much. It was a mere spat when the Reagan administration and the Labour leader Neil Kinnock ended up briefing against each other after the British leader of the Opposition was granted a brief Oval Office meeting before the 1987 general election. Reagan told Kinnock his unilateral nuclear disarmament policy was crazy and Labour said doddery Reagan had not recognised the shadow foreign secretary Denis Healey. Kinnock and Labour later abandoned their anti-nuclear policy. Starmer has got off to a better start than that. He and the foreign secretary David Lammy say they were hosted \"graciously\" by the then president-elect at Trump Tower in New York City last year. They will be hoping they can keep it that way this week in the White House."
    },
    {
        "title": "IT Crowd's Chris O'Dowd on aliens, returning to a 'broke' and 'down' London, and his new show Small Town, Big Story",
        "description": "Actor and comedian Chris O'Dowd has described moving back to London from the US, finding people in the city are \"down\" after a decade of cutbacks.",
        "url": "https://news.sky.com/story/it-crowds-chris-odowd-on-aliens-returning-to-a-broke-and-down-london-and-his-new-show-small-town-big-story-13313892",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-small-town-big-story_6835545.jpg?20250221130720",
        "type": "UK",
        "Author": "Stephen Murphy",
        "Date Published": "2025-02-23 00:01:00",
        "Headline": "The Irish actor and comedian spoke to Sky News about his new Sky Original show, starring Mad Men's Christina Hendricks, and returning to the UK after years in LA.",
        "Content": "\n          Ireland correspondent\n              @SMurphyTV\n  Actor and comedian Chris O'Dowd has described moving back to London from the US, finding people in the city are \"down\" after a decade of cutbacks. The IT Crowd star returned to London from Los Angeles with his wife Dawn O'Porter and their two children a year ago. \"It's just gone through 10 years of austerity, and you can feel it off it,\" he told Sky News. \"People are down, is the impression I'm getting. I don't know if it's because of the divisive political culture or whether it's because people are broke as s**t because they haven't put any money into public services for so long, and now they've said they're not going to do it either because they're not going to raise taxes, so I don't know what they're going to do. But everybody is… it would be hard to say it's improved.\" Asked if he sensed any optimism that things would change for the better, he replied: \"Not yet.\" O'Dowd said the decision to return to the UK \"wasn't because Trump got in or any of that crap\", but that he wanted to \"get out before the political cycle starts, because it just gets a bit heated\". He added: \"It actually didn't this time, because he won so easily.\" The Irish star was speaking ahead of the premiere of his new Sky Original series Small Town, Big Story, which comes to Sky and NOW on Thursday 27 February. Set in the fictional Irish border village of Drumban, the dramatic comedy follows Wendy Patterson, portrayed by Mad Men's Christina Hendricks, a local girl who found success as a TV producer in Los Angeles. She returns with a film crew in tow and is forced to confront a secret from decades ago - visitors from outer space. So does the show's creator believe in alien existence? \"I find it hard to believe we're it, we're just too imperfect,\" O'Dowd replied. He hails from Boyle, County Roscommon, which is considered a \"UFO hotspot\" in Ireland. \"In the vastness of the universe, or the multiverse or whatever we're existing within, it seems highly unlikely that you and me are the best we can do, no offence,\" he added. Patterson's show-within-a-show, titled I Am Celt but described as Lame Of Thrones, appears to satirise Hollywood's often inaccurate portrayal of Ireland. \"Some of them can be heavy-handed, or a little bit off-piste,\" laughs O'Dowd. \"I think the thing to remember is we're guilty of it too. \"Whenever I hear Americans being depicted from Irish people, very often they're stuffing themselves with cheeseburgers and they're morons. There's got to be a bit of give and take with that.\""
    },
    {
        "title": "Large fire near Wythenshawe Hospital mostly extinguished",
        "description": "A large fire on an industrial estate near Wythenshawe Hospital in Manchester has been mostly extinguished.",
        "url": "https://news.sky.com/story/large-fire-near-wythenshawe-hospital-mostly-extinguished-13315661",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-fire-wythenshawe_6837741.jpg?20250223153157",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-23 15:08:00",
        "Headline": "No subtitle found",
        "Content": "A large fire on an industrial estate near Wythenshawe Hospital in Manchester has been mostly extinguished. The fire service said this morning it was tackling a blaze \"involving heavy good vehicles\" on Ennis Close and advised locals to keep windows and doors shut. An update on X at lunchtime said the situation was largely under control. \"Thanks to the hard work of crews, the fire is now largely extinguished with just one area still requiring the attention of firefighters,\" said Greater Manchester Fire & Rescue Service It said people evacuated from their homes were returning and that a road closure had been lifted. Read more from Sky News:Fresh amber warning for rainGirl, 3, dies in Manchester tram collision"
    },
    {
        "title": "Exit poll may appear decisive - but path to coalition is not clear yet",
        "description": "Initial exit polls appear to confirm what we have known for weeks: that the conservative Christian Democrats (CDU) and their Bavarian sister party the Christian Social Union (CSU) have got the most votes in the federal election, with Friedrich Merz most likely to be the next chancellor.",
        "url": "https://news.sky.com/story/exit-poll-may-appear-decisive-but-path-to-coalition-is-not-clear-yet-13315882",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-germany-elections-friedrich-merz_6837992.jpg?20250223185502",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-02-23 18:30:00",
        "Headline": "While the exit poll result isn't a surprise, the fragile process of coalition building as well as the number of issues on the next government's intray means the path to power isn't easy.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  Initial exit polls appear to confirm what we have known for weeks: that the conservative Christian Democrats (CDU) and their Bavarian sister party the Christian Social Union (CSU) have got the most votes in the federal election, with Friedrich Merz most likely to be the next chancellor. While this result isn't a surprise, it doesn't mean the path to power will be easy. First off, the CDU-CSU don't have a majority so they need to try to build a coalition. Their most obvious choices as partners are the third-place Social Democrats. A two-party coalition is preferred as it can avoid excess bickering but the SPD and CDU disagree on several key points including sending long-range Taurus cruise missiles to Ukraine. Follow live: Germany's election results Forming a government can take months but Mr Merz is keen to speed up the process - aware of the pressing issues both at home and abroad. One of those is the rise of the far right, with the Alternative for Germany (AfD) party celebrating historic results. The initial results suggest that for the first time since the Second World War, a far-right party has got the second highest number of votes. That could also cause serious issues for the next government. As a result of Germany's Nazi history, mainstream parties have a long-running pact known as the \"firewall\" which says they will not work with the far right. Even before the polls had closed, AfD leader Alice Weidel echoed Donald Trump and released a video statement urging people to \"observe\" the ballots being counted and to \"protect democracy\".  Many of the AfD's supporters have said not allowing the second most popular party into government is undemocratic, threatening to take to the streets. The US vice president JD Vance also sparked outrage when he spoke out against the firewall at the recent Munich Security Conference and suggested the new Trump administration would be ready to work with the AfD. Conversely, in the run-up to the election, hundreds of thousands of Germans have protested to demand that the firewall remains. In January, Mr Merz caused controversy when a draft motion got through parliament with AfD support, he's since vowed he will not go into government with them. If he sticks to that pledge then he is likely to see right-wing demonstrations as well becoming a target of prominent AfD backers including Elon Musk. Read more on Germany election:Who is Friedrich Merz - Germany's likely next leader?German elections are usually dull affairs - this time is different The AfD's result also cannot be ignored. While some of the vote may be a protest, the party has expanded its traditional base in the east to pick up support in the west. Dissatisfaction over migration, the economy, rocketing prices and the war in Ukraine have all helped to grow its ranks as people feel ignored by mainstream parties. Mr Merz has already tried to win back some of its voters by proposing tough migration reforms including permanent checks on the borders and potentially turning away some asylum seekers when they try to enter. If he fails to deliver on these promises then the AfD will continue to make gains. Other urgent to dos for the next government include sorting out Germany's economy following two years of recession and restoring its position at the centre of the EU. Ministers must also face up to the fact their traditional allies are no longer guaranteed. The Trump administration appears to be ripping up the rule book when it comes to being a protector of Europe and its ongoing support for Ukraine. If America steps back, as Europe's largest power and Ukraine's largest European backer, Germany will have to step up. Again, that's going to be a big challenge as its military needs to be transformed. The final results are not even confirmed yet but whatever form it takes, the next government knows it has four years to fix Germany, if it fails then populists are highly likely to ride to power in 2029."
    },
    {
        "title": "Pope Francis has 'initial, mild' kidney problem and still in critical condition, says Vatican",
        "description": "The Pope remains in a critical condition and is now showing an \"initial, mild\" kidney problem - but is \"vigilant\" and took part in Mass in hospital with those caring for him.",
        "url": "https://news.sky.com/story/pope-francis-has-early-kidney-issue-and-still-in-critical-condition-says-vatican-13315376",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pope-pope-francis-candles_6835906.jpg?20250221194533",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-23 07:03:00",
        "Headline": "The update comes after the Pope released a message thanking people for their affection and asking for prayers.",
        "Content": " The Pope remains in a critical condition and is now showing an \"initial, mild\" kidney problem - but is \"vigilant\" and took part in Mass in hospital with those caring for him. The Vatican statement said Francis hadn't had any more \"respiratory crises\" since Saturday evening. However, a problem with his kidneys has emerged, with blood tests showing \"an initial, mild, renal insufficiency, which is currently under control\", according to the update. The 88-year-old Pope is still having \"high-flow oxygen therapy\" into his nose, while his hemoglobin value has increased after being given blood transfusions on Saturday. The Pope has been at Rome's Gemelli hospital since 14 February and is being treated for double pneumonia and chronic bronchitis. Sunday evening's statement said he was \"vigilant and well oriented\", but due to the complexity of his case the prognosis is \"reserved\". \"During the morning, in the apartment set up on the 10th floor, he participated in the Holy Mass, together with those who are taking care of him during these days of hospitalization,\" the update added. On Sunday morning, the Vatican said the Pope had a \"tranquil\" night and confirmed he would not lead prayers for the second week running. Instead, Francis, who has been Pope since 2013, prepared words to be read on his behalf at the recitation of the Angelus. 'I ask you to pray for me' The Pope's message said: \"I am confidently continuing my hospitalisation at the Gemelli Hospital, carrying on with the necessary treatment; and rest is also part of the therapy! \"I sincerely thank the doctors and health workers of this hospital for the attention they are showing me and the dedication with which they carry out their service among the sick. \"In recent days I have received many messages of affection, and I have been particularly struck by the letters and drawings from children. \"Thank you for this closeness, and for the prayers of comfort I have received from all over the world! I entrust you all to the intercession of Mary, and I ask you to pray for me.\"  The message is understood to have been written in the last few days. On Saturday night, the Vatican said the Pope was in a critical condition after a \"prolonged respiratory crisis\" that required a high flow of oxygen. It said he'd had blood transfusions after tests revealed thrombocytopenia, which is associated with anaemia. Millions around the world have been concerned about his increasingly frail health - and his condition has given rise to speculation over a possible resignation. By Lisa Holland, Sky correspondent in Vatican City  It's hard to imagine a Sunday in the Vatican City without the Pope. Every week – unless he's travelling – he is a constant, appearing at the same Vatican windows to deliver his message. Instead, his written words were distributed by Vatican officials. In his message, the Pope thanked his doctors and people around the world for their good wishes. But it seems the upbeat message was written before the dramatic downturn in the Pope’s health, which has left him in a critical condition. The business and the events of the Church are continuing in his absence.\n Faith is never lost but it feels like optimism is fading and we are living through the last days of Pope Francis. In St Peter's Square the sun shone – and a gentle light fell on the ancient stone of the basilica.\nThe beauty and pageantry of columns of deacons and visitors filing in for a special mass as part of the Catholic Church's jubilee year sat awkwardly with the prognosis of the Pope's ailing health.\n The visitors and deacons who'd come from around the world to take part, and hoped to see the Pope, were left disappointed.  Though they said they felt his presence. \"It is what it is,\" said one. They know the Pope is an 88-year-old man who has spent the last few years assisted by a wheelchair and walking stick. Throughout his life he has been dogged by lung issues.\n It leaves an almost philosophical mood ahead of what the coming days may bring.  Read more from Sky News: Two motorways closed after human remains foundMusk says federal employees must justify work or resign Doctors said on Friday that he was \"not out of danger\" and was expected to remain in hospital for at least another week. They also warned that while he did not have sepsis, there was always a risk the infection could spread in his body. Sepsis is a complication of an infection that can lead to organ failure and death. Pope Francis has a history of respiratory illness, having lost part of one of his lungs to pleurisy as a young man. He also had an acute case of pneumonia in 2023."
    },
    {
        "title": "Zelenskyy says he would give up presidency in return for peace and NATO membership for Ukraine",
        "description": "Ukraine's president has said he would step down in return for peace and NATO membership for his country. ",
        "url": "https://news.sky.com/story/russia-launches-aerial-terror-with-biggest-drone-attack-since-start-of-war-zelenskyy-13315475",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ukraine-russia-drone_6837530.jpg?20250223115850",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-23 11:41:00",
        "Headline": "President Zelenskyy condemned the \"aerial terror\" as he said Ukraine suffered its heaviest drone bombardment of the war overnight.",
        "Content": " Ukraine's president has said he would step down in return for peace and NATO membership for his country.  \"If [it means] peace for Ukraine, if you really need me to leave my post, I am ready,\" Volodymyr Zelenskyy said at a news conference. \"I can exchange this for NATO [membership], if that condition is there, immediately,\" he added. Donald Trump has previously said Ukraine is unlikely to become a NATO ally and membership is a red line for Russia. Mr Zelenskyy's comment appeared to be a response to Mr Trump recently calling him a \"dictator\" as Ukraine hadn't held fresh elections - despite laws prohibiting it during wartime During a wide-ranging conference in Kyiv, Mr Zelenskyy also said talks on a minerals deal with the US were moving forward, adding \"all is OK\", despite concerns of a stalemate in negotiations.   President Trump said on Saturday a deal was \"pretty close\" and he was determined to get payback for billions of dollars of aid provided to Ukraine. Ukraine wants the deal to include robust security guarantees over any future peace settlement with Russia.  Mr Zelenskyy also told Sky's Deborah Hayes that next week's visits to Washington by Sir Keir Starmer and Emmanuel Macron were vital. He said Europe had to be \"at the table\" when a peace deal is negotiated. \"Who will represent Europe - I can't tell you now exactly,\" he said. \"But I think one person will represent the EU. And of course, the UK has to be at the table, if we speak, for example, about security guarantees.\" The UK prime minister has said he's prepared to deploy British troops to Ukraine as part of a peacekeeping force. 'Biggest drone attack of war' The Ukrainian leader was speaking after his country was hit overnight with what he called the biggest drone attack since the war started. Mr Zelenskyy condemned Russia for the \"aerial terror\" - a day before the third anniversary of Russia's full-scale invasion. \"Every day, our people stand against aerial terror,\" Mr Zelenskyy wrote on X. \"On the eve of the third anniversary of the full-scale war, Russia launched 267 attack drones against Ukraine - the largest attack since Iranian drones began striking Ukrainian cities and villages.\" A total of 138 of the drones were shot down and another 119 disappeared from radars after being jammed by electronic warfare, Ukraine's air force said. Damage was reported across five regions. Mr Zelenskyy said nearly 1,150 drones, more than 1,400 guided aerial bombs and 35 missiles had been launched at Ukraine in the past week. He thanked those operating air defences and called on allies to stand united to secure a \"just and lasting peace\". \"This is achievable through the unity of all partners - we need the strength of all of Europe, the strength of America, the strength of everyone who seeks lasting peace,\" he said.  Read more:Fact-checking Trump's claims on Zelenskyy and Ukraine It comes amid concerns over Mr Trump's recent war of words with Mr Zelenskyy and his false claim that Ukraine had started the war. At a conservative conference on Saturday, Mr Trump - who alarmed Europe and Ukraine by holding a recent call with Vladimir Putin - repeated his optimism that a peace deal is possible under his watch. \"I've spoken to President Putin and I think that thing [the war] is going to end,\" said Mr Trump. Ukraine has insisted it won't accept any peace deal agreed without its participation, after it was excluded from a meeting between US and Russian diplomats in Saudi Arabia."
    },
    {
        "title": "Tanks 'move into West Bank' after Israel orders troops to 'not allow' Palestinians to return",
        "description": "Israeli tanks have moved into the Occupied West Bank shortly after the defence minister declared an escalation of its operation - ordering troops to remain there \"for the coming year\".",
        "url": "https://news.sky.com/story/tanks-move-into-west-bank-as-israel-orders-troops-to-remain-for-a-year-and-not-allow-palestinians-to-return-13315597",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-jenin-west-bank-israel_6837695.jpg?20250223151057",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-23 14:33:00",
        "Headline": "Israel launched a fresh offensive in the Occupied West Bank on 21 January - Operation Iron Wall.",
        "Content": "Israeli tanks have moved into the Occupied West Bank shortly after the defence minister declared an escalation of its operation - ordering troops to remain there \"for the coming year\". In a statement on Sunday, Israeli defence minister Israel Katz said he has instructed the military to \"prepare for an extended stay in the camps that were cleared for the coming year and not to allow the return of residents or for terror to grow again\". Associated Press journalists saw a handful of Israeli tanks move into Jenin shortly after. Israel launched a fresh offensive in the occupied territory on 21 January, calling it Operation Iron Wall. Since then, more than 40,000 Palestinians living there have been displaced. Buildings and refugee camps have also been demolished and people have been killed. Also on Sunday, Mr Katz confirmed the deployment of tanks to the West Bank stronghold city of Jenin, with wider operations expanding to \"additional villages in the Jenin area\". It is the first time tanks have entered the Occupied West Bank since the Second Intifada in 2002. Normally, it is home to around three million Palestinians - most of whom are descended from those forced to flee their homes during various wars with Israel. Under interim peace agreements from the 1990s, Israel maintains control of large parts of the West Bank, which it originally captured in 1967, while the Palestinian Authority (PA) presides over other areas. Israel often sends troops into designated Palestinian zones - but usually withdraws them once they claim to have completed their missions there - mostly rooting out Hamas militants. Read moreHuge buildings destroyed in West BankMilitary blocks entry to some West Bank areas Currently, Prime Minister Benjamin Netanyahu is under pressure from far-right partners in his government to crack down on terrorist activity in the West Bank. Clashes between Jewish settlers and Palestinians there have regularly proved deadly. Hamas condemns prisoner release delay Elsewhere on Sunday, Israel awoke to the decision to delay the planned release of 620 Palestinian prisoners - in exchange for the six Israeli hostages freed on Saturday. In a late statement, Mr Netanyahu cited \"repeated and ongoing violations\" by Hamas, who he blamed for \"humiliating and disgraceful\" hostage handover ceremonies and the \"use of our abductees for propaganda purposes\". Hamas responded by \"strongly condemning\" the delay, accusing Israel of putting ceasefire negotiations in \"grave danger\" and using \"flimsy excuses\" to negate their obligations. Five of the six hostages freed from Gaza on Saturday were handed over - as has become convention - by masked Hamas militants on a stage in front of crowds. The practice, which Hamas denies is degrading, has been widely criticised by the United Nations and others. Mr Netanyahu's reference to propaganda came after two hostages - Evyatar David and Guy Gilboa-Dalal - both abducted from the Nova music festival on 7 October 2023 - appeared in a Hamas video seemingly near the handover site on Saturday. The clip, filmed under duress, saw them plea with the Israeli government to cooperate and let them go, before they were seemingly returned to captivity.  In Beirut on Sunday morning, tens of thousands of people gathered at the Chamoun Sports City Stadium - the largest in Lebanon - for the funerals of Hezbollah leaders Hassan Nasrallah and Hashem Safieddine, who were both killed in Israeli airstrikes last year. As the commemorations took place, Israeli jets circled overhead."
    },
    {
        "title": "Supporters mourn charismatic leader Hassan Nasrallah - with Hezbollah left in crisis",
        "description": "The Hezbollah faithful packed into Lebanon's largest stadium to show their support for the group and pay their respects to their charismatic leader Hassan Nasrallah who was killed in a massive Israeli airstrike.",
        "url": "https://news.sky.com/story/supporters-mourn-charismatic-leader-hassan-nasrallah-with-hezbollah-left-in-crisis-13315738",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-hezbollah-funeral-hassan-nasrallah_6837818.jpg?20250223163005",
        "type": "World",
        "Author": "Alex Rossi",
        "Date Published": "2025-02-23 16:03:00",
        "Headline": "Nasrallah's funeral took place in Lebanon's largest stadium on Sunday morning but signified far more than simple grief for loyalists - as a weakened Hezbollah deals with the end of an era.",
        "Content": "\n          International correspondent\n              @alexrossiSKY\n  The Hezbollah faithful packed into Lebanon's largest stadium to show their support for the group and pay their respects to their charismatic leader Hassan Nasrallah who was killed in a massive Israeli airstrike. His coffin was paraded around the ground whilst mourners wept and tried to clamber on board the motorcade. But as their tears fell, Israeli jets roared overhead - a sign that while the latest conflict is over, the war has not really ended. In a region where force is often the language spoken, it was a potent statement. The funeral's significance goes far beyond simple grief for his loyalists. A weakened Hezbollah has major geopolitical implications and could signal a change in the power dynamics of the region. Nasrallah's death last September represents the end of an era for Hezbollah. Upon taking over its leadership in 1992, he transformed it from a small guerrilla force into one of the most formidable political and military powers in Lebanon and the wider Middle East. Under his command the group evolved into a key actor in the regional balance of power, maintaining close ties with Iran and Syria. But in the few months since his assassination, the organisation has lost key allies in the deposed Syrian dictator Bashar al Assad and Hamas is severely damaged after 16 months of devastating conflict in Gaza. His popularity among Hezbollah's supporters cannot be overstated; his charismatic rhetoric and commitment to Lebanon's sovereignty made him a hero to many in the Shiite community and beyond. Many of his followers regarded him as the leader of the \"axis of resistance\" - a group of anti-west and anti-Israel militias that includes the Houthis in Yemen, Hamas, and Shia fighters in Iraq. However, many here in Lebanon criticised his decision to link the country's fate to the conflict in Gaza. For his enemies, he was, of course, the leader of a terrorist organisation - a malign force operating in the heart of the region. Many question how easy it will be for Hezbollah to make a comeback. Its leadership has been decimated, it has lost large numbers of fighters and much of its weaponry. Read more: Who was Hezbollah leader Hassan Nasrallah? The group's power was also heavily entwined with the personality of Hassan Nasrallah - he will be difficult to replace. Its new leader Naim Qassem has vowed that the resistance will not be broken. But he has none of Nasrallah's charisma or popularity - it means there is a vacuum now in the group with the possibility of splits opening up over what direction the movement should take. Nasrallah was killed on 27 September last year in a series of heavy airstrikes targeting his underground command centre in Beirut. It was a turning point in the war with Israel. Hezbollah had launched attacks on the Jewish state's northern towns and cities in solidarity with Hamas after the 7 October terror attacks. It would turn out to be a catastrophic miscalculation. The group was battered by Israel's military and despite the show of loyalty at the funeral, its grip on Lebanon has been weakened - the group has often been described as a \"state within a state\". Outside the stadium tens of thousands of supporters turned out - the streets filling with those who had come to say goodbye. Read more:Tanks 'move into West Bank' after Israel orders troops to 'not allow' Palestinians to returnIsrael postpones release of more than 600 Palestinian prisoners after 'humiliating hostage ceremonies' And for the movement, the number of people attending is important as it tries to project strength and revive its image. But with Hezbollah's backer Iran also weakened and its ally in Syria dealing with the aftermath of the revolution - it will not be easy to rebuild. Israel has also made clear it will not tolerate a resurgent Hezbollah - any rearmament is likely to be met with a military response. There's no doubt the conflict with Israel has left Hezbollah in crisis. There are unanswered questions too about the wisdom of starting a war that caused so much destruction for the Lebanese people."
    },
    {
        "title": "British couple in their 70s detained by Taliban in Afghanistan",
        "description": "A British couple in their 70s who run education programmes in Afghanistan have been arrested by the Taliban, their children say.&#160;",
        "url": "https://news.sky.com/story/british-couple-in-their-70s-detained-by-taliban-in-afghanistan-13315839",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-peter-reynolds-barbie-reynolds_6837937.jpg?20250223175304",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-23 17:48:00",
        "Headline": "Peter Reynolds, 79, and his wife Barbie, 75, run education and training programmes in Afghanistan. They have lived in the country for 18 years. ",
        "Content": "A British couple in their 70s who run education programmes in Afghanistan have been arrested by the Taliban, their children say.  Peter Reynolds, 79, and his wife Barbie, 75, were detained earlier this month but the reason for their arrests is unknown. Their four adult children have said the couple were married in Kabul in 1970 and have lived in Afghanistan for 18 years - remaining after the Taliban toppled the Western-backed government in 2021. The couple runs Rebuild, an organisation that provides education and training programmes for businesses, government agencies, educational organisations and nongovernmental groups. Photos on Rebuild's website show both men and women taking part in various courses, including teacher training and management courses. Since the Taliban suddenly returned to power more than three years ago, it has severely restricted women's education and activities and is considered the worst place on earth to be a woman. In an open letter to the Taliban's interior ministry, shared with Sky News, the couple's children wrote: \"They have always been open about their presence and their work, diligently respecting and obeying the laws as they change. They do not represent another religion, and they love Muslims dearly.\" The couple, who are also Afghan citizens, allegedly texted their children after their arrests saying they did not want Western authorities to get involved. Read more:Pope sends message from hospital bed Zelenskyy 'would quit' for peace and NATO membershipPay back billions of aid, Trump tells Ukraine In the childrens' letter to the Taliban, they said: \"We recognise that there have been instances where exchanges have been beneficial for your government and Western nations. \"However, our parents have consistently expressed their commitment to Afghanistan, stating that they would rather sacrifice their lives than become part of ransom negotiations or be traded. \"We trust that this is not your intention, as we are instructed to respect their wishes to remain with you.\" The children added: \"They have chosen Afghanistan as their home, rather than with family in England, and they wish to spend the rest of their lives in Afghanistan.\" The Foreign Office declined to comment but it is understood they are aware of the arrests. The UK does not recognise the Taliban and has no embassy in Kabul."
    },
    {
        "title": "'Everybody is looking at their phones,' says man freed after 30 years in prison",
        "description": "A man who has been released from prison after 30 years for a crime he says he never committed has been readjusting to life - and getting used to just how connected people are now. ",
        "url": "https://news.sky.com/story/everybody-is-looking-at-their-phones-says-man-freed-after-30-years-in-prison-13315407",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-cordeiro-hawaii_6837472.jpg?20250223101453",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-23 09:05:00",
        "Headline": "A steak dinner and visiting his mother's gravesite in Hawaii were among the first things Gordon Cordeiro did when he was released from prison due to new DNA evidence.",
        "Content": "A man who has been released from prison after 30 years for a crime he says he never committed has been readjusting to life - and getting used to just how connected people are now.  Gordon Cordeiro was jailed in 1994 over the murder of Timothy Blaisdell on the island of Maui, but due to new DNA evidence his conviction was overturned on Friday. Speaking about his first impression of the outside world following his release from Maui Community Correctional Center, Mr Cordeiro, who has always maintained his innocence, said he has been trying to get used to how connected people are. \"Everybody is looking at their phones,\" he said, during his first Zoom interview since leaving prison. Mr Cordeiro also commented on the new DNA evidence which led to his release, telling the Associated Press news agency: \"Thank God for new DNA. Technology is awesome.\" The first thing he did after he was freed was visit his mother's grave as he said he had constantly thought about her during his time behind bars. Mr Cordeiro's mother, Paulette, died aged 49 in September 1994 from ALS, often called Lou Gehrig's disease. Her son was arrested the following month. \"Thanks for looking over me. Keeping me safe,\" Mr Cordeiro recalled saying at her grave. In a picture provided by his sister, he can be seen kneeling graveside, with a garland of flowers he was given upon release draped over the headstone. Read more from Sky News:Russia launches biggest drone attack of war - ZelenskyyPope sends message as Vatican sources give updateVoting under way in German election Speaking more about what he had got up to since regaining his freedom, Mr Cordeiro said he went for a steak dinner and celebrated with family at his father's house. The next day, he visited more relatives' graves and planned to go to Costco. \"It feels normal,\" he said, but added Maui had changed as he pointed to the destruction caused in Lahaina by a wildfire in 2023. Announcing her decision to free him, Judge Kirstin Hamman ruled new evidence, including DNA test results, would likely change the outcome of another trial. Maui County Prosecuting Attorney Andrew Martin said he plans to appeal against the decision and seek to have bail imposed on Mr Cordeiro's release. Mr Cordeiro's first trial ended in a hung jury, with only one juror voting to convict him. But he was later found guilty of murder, robbery and attempted murder and sentenced to life without the possibility of parole."
    },
    {
        "title": "Think business, not politics: Trump's approach to peacemaking",
        "description": "Donald Trump the president is still Donald Trump the businessman.",
        "url": "https://news.sky.com/story/think-business-not-politics-trumps-approach-to-peacemaking-13315348",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-president_6837387.jpg?20250223005337",
        "type": "US",
        "Author": "David Blevins, news correspondent, in Washington DC",
        "Date Published": "2025-02-23 00:45:00",
        "Headline": "Emmanuel Macron and Sir Keir Starmer will defend Ukraine's sovereignty when they meet the US president. Their problem might be that they find a businessman, not a politician, when they reach the Oval Office.",
        "Content": "By David Blevins, news correspondent, in Washington DC   Donald Trump the president is still Donald Trump the businessman. For the president of the United States, everything is transactional, even the business of ending the war in Ukraine. Under the agreement, he wants Ukraine to grant America access to its mineral and oil resources as payback for wartime aid. This deal-making approach aligns with his broader foreign policy perspective, emphasising economic gains. A source close to the negotiations has told Sky News that President Volodymyr Zelenskyy is not ready to sign up and that there are \"problematic issues\" with the draft. But that didn't stop President Trump telling the largest conservative gathering of the year in Washington that they're \"pretty close to a deal\". It's classic brinkmanship - giving the impression that agreement is close, thus making the other party look obstructive if they delay. \n                  Starmer says 'US is right' about UK and Europe needing to take more responsibility for defence\n                 \n                  Elon Musk says US federal employees must justify their work or resign\n                 \n                  Don't expect a Love Actually-style moment from the Starmer-Trump meeting\n                 Having campaigned on a promise to end the war in 24 hours, the man who has been president for a month needs a resolution. But at what price? Recognising Russia's control over occupied Ukrainian territory? Postponing Ukraine's NATO membership aspirations? 👉 Follow Trump 100 on your podcast app 👈 Read more:Envoy says US is 'with' Ukraine - in contrast to Trump's remarksStarmer says this is 'significant moment' for European securityDon't expect Love Actually-style moment from Starmer-Trump talks French President Emmanuel Macron and British Prime Minister Sir Keir Starmer will defend Ukraine's sovereignty when they meet the US president at the White House next week. The administration's perceived alignment with Russian interest, ending eight decades of foreign policy, has stunned European leaders. Their problem might be that they find a businessman, not a politician, when they reach the Oval Office. Donald Trump does not do diplomacy, and in boardroom politics, there is always an economic interest."
    },
    {
        "title": "Elon Musk says US federal employees must justify their work or resign",
        "description": "Elon Musk has issued an ultimatum to US federal employees - respond to an email justifying the work they completed this week or resign.",
        "url": "https://news.sky.com/story/elon-musk-says-us-federal-workers-must-justify-their-work-or-resign-13315365",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-elon-musk-chainsaw_6837404.jpg?20250223053407",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-23 05:11:00",
        "Headline": "Hundreds of thousands of federal workers have received an email with the following instruction: \"Please reply to this email with approx. 5 bullets of what you accomplished last week and cc your manager.\"",
        "Content": " Elon Musk has issued an ultimatum to US federal employees - respond to an email justifying the work they completed this week or resign. The billionaire boss of X, Tesla and SpaceX also leads the Department of Government Efficiency (DOGE) which has been tasked with cutting government spending, after he was appointed by President Donald Trump. It comes after Mr Trump fired America's top general and a series of other senior military figures. Posting on X, Mr Musk, who is the world's richest man, wrote: \"Consistent with President @realDonaldTrump's instructions, all federal employees will shortly receive an email requesting to understand what they got done last week. Failure to respond will be taken as a resignation.\" Hundreds of thousands of federal workers, including some judges, court staff and prison officials, have now received the email, from the Office of Personnel Management, with the following instruction: \"Please reply to this email with approx. 5 bullets of what you accomplished last week and cc your manager.\" They have been given just over 48 hours to explain what they accomplished in the past week. The deadline to reply was 11.59pm on Monday, although the email did not include Mr Musk's social media threat about those who fail to respond. \n                  Starmer says 'US is right' about UK and Europe needing to take more responsibility for defence\n                 \n                  Think business, not politics: Trump's approach to peacemaking\n                 \n                  Don't expect a Love Actually-style moment from the Starmer-Trump meeting\n                 Not every Trump official on same page According to Sky's US partner network NBC News, FBI director Kash Patel has told employees to \"pause any responses\" to the email. He said the bureau will review the work of its own employees in accordance with its own procedures. In addition, state department employees were told not to respond to the email. Also, federal court officials instructed recipients not to respond. \"We understand that some judges and judiciary staff have received an email ... directing the recipient to reply with 5 accomplishments from the prior week. Please be advised that this email did not originate from the judiciary or the administrative office and we suggest that no action be taken,\" officials wrote. Read more:Beauty and popularity of Yosemite can't save workers from DOGE cutbacksMusk calls famed astronaut an 'idiot'  On Friday, Mr Musk celebrated his new role at a gathering of conservatives by waving a chainsaw in the air. He called it \"the chainsaw for bureaucracy\" and said, \"Waste is pretty much everywhere\" in the federal government. Thousands of government employees have already been forced out of the federal workforce - either by being fired or offered buyouts (severance packages) - during the first month of the Trump administration. There is no official figure available for the total number of dismissals or layoffs so far. But the cuts include thousands of workers at the departments of veterans affairs, defence, health and human services, the Internal Revenue Service and the national parks service, among others. 'Utter disdain for federal employees' Union leaders have condemned the ultimatum and threatened legal action. President of the American Federation of Government Employees (AFGE), Everett Kelley, called the new order an example of Mr Trump and Mr Musk's \"utter disdain for federal employees and the critical services they provide to the American people\". \"It is cruel and disrespectful to hundreds of thousands of veterans who are wearing their second uniform in the civil service to be forced to justify their job duties to this out-of-touch, privileged, unelected billionaire who has never performed one single hour of honest public service in his life,\" Mr Kelley said. \"AFGE will challenge any unlawful terminations of our members and federal employees across the country.\" If you look at what he says on X – the social media platform he owns – you’d probably assume Elon Musk wields considerable power in the US government. And that might well be the case in practice. His Department of Government Efficiency (DOGE) has been examining and slashing federal spending in a number of departments and has been moving at pace. DOGE, despite its name, is not an official government department but a temporary contracted organisation. And according to the White House, Mr Musk “has no actual or formal authority”. In a court filing, the director of the government’s Office of Administration said Mr Musk is a senior advisor to the president. It said: “In his role as senior advisor to the president, Mr Musk has no greater authority than other senior White House advisors. “Like other senior White House advisors, Mr Musk has no actual or formal authority to make governmental decisions himself. “Mr Musk can only advise the president and communicate the president’s directives.” The mass layoffs threatened by the second Trump administration have faced legal hurdles, as federal employees have a number of civil protections under US law. Most civil service employees can be fired legally only for bad performance or misconduct, and they have a host of due process and appeal rights if they are let go arbitrarily."
    },
    {
        "title": "'Everybody is looking at their phones,' says man freed after 30 years in prison",
        "description": "A man who has been released from prison after 30 years for a crime he says he never committed has been readjusting to life - and getting used to just how connected people are now. ",
        "url": "https://news.sky.com/story/everybody-is-looking-at-their-phones-says-man-freed-after-30-years-in-prison-13315407",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-cordeiro-hawaii_6837472.jpg?20250223101453",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-23 09:05:00",
        "Headline": "A steak dinner and visiting his mother's gravesite in Hawaii were among the first things Gordon Cordeiro did when he was released from prison due to new DNA evidence.",
        "Content": "A man who has been released from prison after 30 years for a crime he says he never committed has been readjusting to life - and getting used to just how connected people are now.  Gordon Cordeiro was jailed in 1994 over the murder of Timothy Blaisdell on the island of Maui, but due to new DNA evidence his conviction was overturned on Friday. Speaking about his first impression of the outside world following his release from Maui Community Correctional Center, Mr Cordeiro, who has always maintained his innocence, said he has been trying to get used to how connected people are. \"Everybody is looking at their phones,\" he said, during his first Zoom interview since leaving prison. Mr Cordeiro also commented on the new DNA evidence which led to his release, telling the Associated Press news agency: \"Thank God for new DNA. Technology is awesome.\" The first thing he did after he was freed was visit his mother's grave as he said he had constantly thought about her during his time behind bars. Mr Cordeiro's mother, Paulette, died aged 49 in September 1994 from ALS, often called Lou Gehrig's disease. Her son was arrested the following month. \"Thanks for looking over me. Keeping me safe,\" Mr Cordeiro recalled saying at her grave. In a picture provided by his sister, he can be seen kneeling graveside, with a garland of flowers he was given upon release draped over the headstone. Read more from Sky News:Russia launches biggest drone attack of war - ZelenskyyPope sends message as Vatican sources give updateVoting under way in German election Speaking more about what he had got up to since regaining his freedom, Mr Cordeiro said he went for a steak dinner and celebrated with family at his father's house. The next day, he visited more relatives' graves and planned to go to Costco. \"It feels normal,\" he said, but added Maui had changed as he pointed to the destruction caused in Lahaina by a wildfire in 2023. Announcing her decision to free him, Judge Kirstin Hamman ruled new evidence, including DNA test results, would likely change the outcome of another trial. Maui County Prosecuting Attorney Andrew Martin said he plans to appeal against the decision and seek to have bail imposed on Mr Cordeiro's release. Mr Cordeiro's first trial ended in a hung jury, with only one juror voting to convict him. But he was later found guilty of murder, robbery and attempted murder and sentenced to life without the possibility of parole."
    },
    {
        "title": "Don't expect a Love Actually-style moment from the Starmer-Trump meeting",
        "description": "For a prime minister who has spent so much of his time in office out of the country, this week's high-stakes trip to Washington DC may well be the one for which Sir Keir Starmer ends up being most remembered.",
        "url": "https://news.sky.com/story/dont-expect-a-love-actually-style-moment-from-the-starmer-trump-meeting-13315274",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-nuclear_6821341.jpg?20250206143509",
        "type": "US",
        "Author": "Amanda Akass",
        "Date Published": "2025-02-23 00:01:00",
        "Headline": "After Donald Trump pulled the rug from under Ukraine and ripped up the post-war expectation that America could be relied upon as the Western world's protector, what can Sir Keir Starmer do to ensure a successful trip?",
        "Content": "\n          Political correspondent\n              @amandaakass\n  For a prime minister who has spent so much of his time in office out of the country, this week's high-stakes trip to Washington DC may well be the one for which Sir Keir Starmer ends up being most remembered. At a time when the Western alliance seems close to fracturing over Donald Trump's verbal evisceration of Ukraine and enthusiastic embrace of Russia - the PM's mission is to smooth over those cracks, to advocate for Ukraine, and attempt to bring the White House back around to the European point of view. Can he succeed in convincing President Trump of the need for the Ukrainians and Europeans to be part of his negotiations with Russia - and commit to backing up any resulting peace deal with American firepower? Or will he face the kind of humiliation endured by Theresa May when she visited Mr Trump in 2017? The former Conservative prime minister scored a diplomatic coup in becoming the first world leader invited to the White House after Mr Trump's first election win, and hoped to shore up the president's support of NATO. While she succeeded in getting a public commitment to NATO - and incidentally, promised to encourage other European leaders to spend more on defence - the image of a domineering president grabbing her hand while she smiled awkwardly is what has gone down in history. This time the stakes are much higher. \n                  Starmer says 'US is right' about UK and Europe needing to take more responsibility for defence\n                 \n                  Elon Musk says US federal employees must justify their work or resign\n                 \n                  Think business, not politics: Trump's approach to peacemaking\n                 Over the past week, the mercurial new president has pulled the rug from under Ukraine and ripped up the post-war expectation that America could be relied upon as the Western world's protector. While Mr Trump's insistence that European leaders should spend more on defence and take up the burden of their own security comes as no surprise, his outright hostility to Volodymyr Zelenskyy and apparent embrace of Russian propaganda has blindsided the rest of Europe.  This weekend, Mr Trump has criticised both Sir Keir and President Emmanuel Macron - who will visit the White House three days earlier than the prime minister on Monday - as having done \"nothing\" to end the war in Ukraine. Downing Street is maintaining a dignified silence in response. The last thing it wants to do ahead of Sir Keir's visit is to provoke any further ire from the president. It's already charting a difficult course in publicly contradicting the president's description of President Zelenskyy as a \"dictator\" by making a rapid, supportive phone call and reaffirming Ukraine's \"democratically elected leader\". Sir Keir has made three phone calls to Mr Zelenskyy in just over a week and clearly wants to make a point that the UK's support for Ukraine is unwavering, whatever the president says. It's expected the UK will announce an expansion of military support and a package of Russian sanctions to mark the third anniversary of the invasion, which runs counter to Mr Trump's ambition to stop the fighting as soon as possible. 👉 Follow Trump 100 on your podcast app 👈 But Sir Keir will go to the White House bearing gifts in an attempt to mollify the president. He's widely expected to make a long-awaited announcement setting out the timetable to increase defence spending from 2.3% to 2.5% of GDP, several months earlier than planned. The president has repeatedly argued about the need for all NATO members to grow their defence budgets. The Telegraph reports the prime minister will also present Mr Trump with an invitation from the King for a state visit to the UK - a tactic previously employed by Mrs May. Will this be enough to nudge Mr Trump into greater enthusiasm for Sir Keir's plan to deploy British and other European troops to help keep the peace in Ukraine, backed up by US security guarantees?  Read more:Sombre Starmer and Europe confront emerging new world orderTrump's direction of travel doesn't look good for UkraineFact-checking Trump's claims about Zelenskyy and Ukraine war The Russians are clearly against the idea, and the president has made it clear he has no wish to deploy American forces to Europe. But perhaps US air support could provide the necessary \"backstop\", as Sir Keir calls it. But beyond Ukraine there are many other areas where the PM will need to deploy his best diplomatic skills. The Chagos deal is one such bone of contention. Labour has drawn up a plan to hand the remote Pacific archipelago to Mauritius, in line with international court rulings, but pay to continue leasing the UK/US military base there for the next 99 years. The government insists the arrangement is necessary for national security reasons, but the Trump administration has made it clear it is not happy with the plan. Donald Trump the president is still Donald Trump the businessman. For the president of the United States, everything is transactional, even the business of ending the war in Ukraine. Under the agreement, he wants Ukraine to grant America access to its mineral and oil resources as payback for wartime aid. This deal-making approach aligns with his broader foreign policy perspective, emphasising economic gains. Read the rest of David's analysis The other elephant in the room is the issue of tariffs, with Mr Trump threatening to slap \"reciprocal tariffs\" on imports to the US, citing VAT as an example of an \"unfair, discriminatory, or extraterritorial tax\". The White House is also promising a 25% tariff for overseas steel and aluminium. The UK is hoping to negotiate some kind of exemption due to the relatively even balance of US/UK trade, although that didn't work the last time the president was in office. In a worst-case scenario, economists have estimated tariffs could cost the British economy £24bn. It's a packed agenda - even without the added complication of Elon Musk getting involved, given his outspoken antipathy to Sir Keir. Talk of a Love Actually-style moment - any kind of open critique of the US president's wild approach to diplomacy - is hardly the prime minister's style. Mr Trump recently described Sir Keir as a \"very nice guy\" - but that personal relationship will only carry the negotiations so far."
    },
    {
        "title": "Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing",
        "description": "Visits by prime ministers to the American president matter much more to us \"Brits\" than they do to them. ",
        "url": "https://news.sky.com/story/starmers-challenge-is-to-see-if-usual-rules-of-special-relationship-still-apply-under-trump-after-years-of-love-bombing-13313250",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-adam-boulton-bespoke_6835540.png?20250221130148",
        "type": "US",
        "Author": "Adam Boulton",
        "Date Published": "2025-02-23 00:01:00",
        "Headline": "The challenges of the UK-US special relationship are not new. As Adam Boulton explains, it's always been up and down for prime ministers looking to charm presidents. ",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n Visits by prime ministers to the American president matter much more to us \"Brits\" than they do to them.  Donald Trump spelt this out in the off-hand way he announced that he had granted Sir Keir Starmer the coveted appointment in his busy schedule. \"We have a lot of good things going on,\" the president boasted. \"But he asked to come and see me and I just accepted his asking.\" After his phone call with the prime minister, Trump declared \"we're going to have a friendly meeting, very good\". That was before Sir Keir publicly disagreed with Trump's ruling that Volodymyr Zelenskyy is \"a dictator\".  Always assuming that his invitation is not cancelled in a fit of presidential pique, Starmer will find himself proceeding with the utmost caution when he gets to the Oval Office. Downing Street sources say they are anxious \"not to poke the bear\" in the full knowledge that previous leaders have endured many awkward moments in their attempts to further a special relationship at away matches. Starmer will have his work cut out. Since his re-election, Trump has signalled that he has less time than ever for traditional alliances. Newly inaugurated presidents traditionally send friendly greetings to their territorial neighbours. Trump slapped tariffs on Canada and Mexico and talked about US territorial expansion to both the north and the south. Historically the UK prime minister has often been the first foreign leader welcomed by a new US president. Trump hosted Theresa May less than a week after he took office for the first time and surprised her when he held her hand to go down some steps. This year Starmer has already been preceded by the leaders of Israel, Japan, Jordan and Indonesia and will be crossing the Atlantic to pay his respects in the same few days as France's President Macron. Thatcher and Reagan's political romance Even at the best of times, British officials are prone to exaggerate the closeness of the two countries' mutual interests. Harold Macmillan thought he could teach the young John Kennedy a thing or two, as the Greek to JFK's Roman, but ended up being dictated to by Kennedy on the nature of the UK's \"independent\" nuclear deterrent. One of the wily Harold Wilson's most significant achievements was refusing to send British troops to fight alongside the Americans in the Vietnam War. The most celebrated PM/POTUS political romance was between Margaret Thatcher and Ronald Reagan. Indeed when the Falklands conflict broke out in the spring of 1982, I was in the White House briefing room to hear then US secretary of state Al Haig joke with innuendo about the closeness of their relationship. It blossomed after Thatcher won Reagan over to give the UK expedition staunch support, in defiance of the advice from some of his officials. Even so, Thatcher was unnerved by Reagan's apparent willingness to consider mutual nuclear disarmament in discussion with the Soviet leader Mikhail Gorbachev in 1986. She flew hastily to Washington DC following the Reagan-Gorbachev summit in Reykjavik - \"to give Reagan a bollocking\" - at least according to the Daily Express reporter in her travelling party. In 1990 she reportedly told George HW Bush \"now George, this is not time to go wobbly\" during the flurry of meetings and phone calls which followed Iraq's invasion of Kuwait. Clinton owing Blair and Bush's love bombing John Major got off to a bad start with Bill Clinton after Conservative sources tried to help the Republican campaign dig up dirt on Clinton's time as a student at Oxford. Soon after the US election in 1992, Major flew to the US in the hope of being invited to a face-to-face meeting with the then president-elect. After several days all he got was a phone call from Little Rock, Arkansas. In spite of their ideological closeness, Tony Blair later said he found it more difficult to deal with the Third Way Democrat Bill Clinton than he did with the \"straightforward\" Republican George W Bush. Clinton nonetheless was a key player in bringing about the Belfast agreement. Blair's greatest success was persuading the president to commit US forces to peacekeeping in the Balkans but he also did Clinton significant personal service. Blair went on a scheduled visit to the White House at the height of the Monica Lewinsky scandal, just days after the president had made his statement \"I did not have sex with that woman\". At their joint news conference afterwards, Blair allowed all the questions to be deflected to him and expressed his admiration for the president. As they walked away from the East Wing, Clinton put his arm around the prime minister and appeared to say \"I owe you one\". Clinton's advice to Blair on his successor George W Bush was \"hug him close\". But both sides were apprehensive when the Labour prime minister flew to Camp David for his first meeting with the second President Bush. Bush wanted them to dress casual, and according to the British ambassador, Blair put on some \"ball-crushingly tight jeans\". From Bush's first words about sharing the same kind of toothpaste, Blair was subjected to love bombing. The two leaders' relationship remained close, including sending troops side-by-side into Afghanistan and Iraq. Brown's bag of CDs, Cameron's humility and common interests Through no fault of his own Gordon Brown found himself in the midst of a British media furore after Barack Obama's team returned a bust of Churchill which had been lent personally to George W Bush by the British Embassy. The new Obama administration's ignorance of the usual niceties was further demonstrated when a history-steeped gift to the president from Brown was reciprocated with a bag of CDs. David Cameron struck a humble note visiting Obama when he described the UK as America's \"junior partner\". Their alliance backfired when Obama tried to help during the Brexit referendum - warning that the UK would find itself \"at the back of the queue\" for striking a trade deal with the US after Brexit. The rapid turnover of prime ministers during Joe Biden's presidency did not allow any of them to build up a close working relationship. In any case, Biden chose to identify with his Irish, and not his English, heritage. Until this second Trump presidency, the US and the UK were at least pulling in the same direction, with differing interests but the common assumption that they would back each other up where possible. Starmer's challenge is to see if those rules still apply. Left-right differences can be overcome Until now, differences of left and right have not mattered much. It was a mere spat when the Reagan administration and the Labour leader Neil Kinnock ended up briefing against each other after the British leader of the Opposition was granted a brief Oval Office meeting before the 1987 general election. Reagan told Kinnock his unilateral nuclear disarmament policy was crazy and Labour said doddery Reagan had not recognised the shadow foreign secretary Denis Healey. Kinnock and Labour later abandoned their anti-nuclear policy. Starmer has got off to a better start than that. He and the foreign secretary David Lammy say they were hosted \"graciously\" by the then president-elect at Trump Tower in New York City last year. They will be hoping they can keep it that way this week in the White House."
    },
    {
        "title": "British tech star Quantexa in talks to secure new funding",
        "description": "A data analytics company which has become one of Britain's hottest technology businesses is closing in on a new round of funding expected to value it at billions of dollars.",
        "url": "https://news.sky.com/story/british-tech-star-quantexa-in-talks-to-secure-new-funding-13315937",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-quantex-quan_6838055.jpg?20250223200744",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-23 19:42:00",
        "Headline": "Run by Vishal Marria, Quantexa is in talks to secure an undisclosed amount of new funding from the Ontario Teachers Pension Plan, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A data analytics company which has become one of Britain's hottest technology businesses is closing in on a new round of funding expected to value it at billions of dollars. Sky News has learnt that Quantexa, which was founded in 2016, is in advanced talks with Ontario Teachers Pension Plan (OTPP), one of the world's biggest pension funds, about becoming a significant shareholder in the company. Precise details of the funding injection, including its size and the likely post-money valuation attributed to Quantexa, were unclear on Sunday evening. The company ranks among the most prized tech companies in Britain, and counts HSBC, British Patient Capital and the private equity firm Warburg Pincus among its shareholders. Quantexa specialises in using AI, data and analytics software to help clients combat fraud and white-collar criminal activity. It has worked with many of the world's largest banks, but now derives a significant proportion of what it describes as decision intelligence revenue from outside the financial services industry. The company's last major funding round took place in 2023, when it was valued at $1.8bn. \n                  Payments watchdog could be abolished in PM's purge of regulators\n                 \n                  Low-paid jobs at risk from Labour's tax increases on businesses\n                 \n                  'Worst hack in history' as $1.5bn in cryptocurrency stolen\n                 Last October, it said it had reached $100m in annual recurring revenue - a significant milestone. It is run by Vishal Marria, its chief executive, who is also understood to be a significant shareholder. OTPP declined to comment, while Quantexa did not respond to several emailed enquiries from Sky News."
    },
    {
        "title": "Starmer says 'US is right' about UK and Europe needing to take more responsibility for defence",
        "description": "Sir Keir Starmer has said the United States \"is right\" about the UK and Europe needing to take more responsibility for defence and security.",
        "url": "https://news.sky.com/story/starmer-says-us-is-right-about-uk-and-europe-needing-to-take-more-responsibility-for-defence-13315477",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-scotland_6837484.png?20250223105311",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-02-23 11:46:00",
        "Headline": "The prime minister agrees with Donald Trump's comments about Europe needing to spend more on defence ahead of his visit to Washington DC next week.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Keir Starmer has said the United States \"is right\" about the UK and Europe needing to take more responsibility for defence and security. The prime minister, speaking at the Scottish Labour conference in Glasgow on Sunday, said he is clear Britain \"will take a leading responsibility\" in protecting the continent. \"Instability in Europe always washes up on our shores,\" he said. \"And this is a generational moment. I've been saying for some time that we Europeans - including the United Kingdom - have to do more for our defence and security. The US is right about that.\" He added \"we can't cling to the comforts of the past\" as it is \"time to take responsibility for our security\". Politics latest: Starmer's stinging rebuke of Reform Donald Trump sparked an emergency meeting of European leaders this week after he said European NATO members should spend more on defence, while the US should spend less.  Sir Keir has said he will set out a path for the UK to spend 2.5% of GDP on defence, up from the current 2.3%, but has not indicated when that will be. It is believed he may announce the details when he visits Mr Trump in Washington DC on Thursday, bringing forward the announcement that was expected in the spring when a defence spending review is published. The prime minister reiterated the UK will \"play our role\" if required in Ukraine following a peace agreement after he earlier this week said the UK would send troops to be part of a peacekeeping force. However, his comments caused a row with Germany and Italy who said it was premature to commit to boots on the ground, although France agreed with the UK. Sir Keir said: \"As we enter a new phase in this conflict, we must now deepen our solidarity even further.\" He added: \"There can be no discussion about Ukraine without Ukraine. \"And the people of Ukraine must have long-term security.\" Read more:Starmer tells Zelenskyy this is 'significant moment' for European securitySombre Starmer and Europe confront emerging new world order This week has seen US officials meet their Russian counterparts in Saudi Arabia to discuss Ukraine - which has been met with indignation by Ukrainian President Volodymyr Zelenskyy as none of his team were invited. No Europeans were invited either, sparking concern the US is pandering to Vladimir Putin. Sir Keir has promised Mr Zelenskyy he will make the case for safeguarding Ukraine's sovereignty when he meets with Mr Trump, who has called the Ukrainian president a dictator. Mr Trump also said Sir Keir and French President Emmanuel Macron, who will visit the White House too this week, \"haven't done anything\" to end the war."
    },
    {
        "title": "Starmer announces £200m for Grangemouth",
        "description": "The prime minister has announced &#163;200m for Grangemouth ahead of the closure of Scotland's last oil refinery.",
        "url": "https://news.sky.com/story/starmer-announces-163200m-for-grangemouth-13315498",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-grangemouth-refinery_6425509.jpg?20240718093244",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-02-23 12:34:00",
        "Headline": "The oil refinery is set to close down this summer as it is losing hundreds of thousands of pounds a day.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The prime minister has announced £200m for Grangemouth ahead of the closure of Scotland's last oil refinery. Sir Keir Starmer, speaking at the Scottish Labour conference on Sunday, said the cash would come from the National Wealth Fund for an \"investment in Scotland's industrial future\". Grangemouth oil refinery, on the banks of the Firth of Forth, is set to cease operation this summer and transition into an import terminal, making 400 workers redundant. Politics latest: Starmer says US 'is right' and Europe needs to take more defence responsibility Sir Keir said: \"We will grasp the opportunities at Grangemouth, work alongside partners to develop viable proposals, team up with business to get new industries off the ground and to attract private investors into the partnership we need. \"We will allocate £200m from the National Wealth Fund for investment in Grangemouth.\" The money comes on top of a £100m \"growth plan\" already in place for the area. Scotland's first minister, the SNP's John Swinney, welcomed the announcement and said it is \"important that the Scottish and UK governments work together on securing the future for the workforce\". Sir Keir said the new investment will be a partnership with the private sector, and he is expecting three times the amount the government is putting in to come from private investors. The prime minister said he believes the transition to clean energy is a \"golden opportunity for Britain, especially for Scotland\", and is essential for national security as it \"gets Putin's boots off our throat\". However, he said oil and gas are also \"vital for our security\" so will be \"part of the future of Scotland for decades to come\". As well as the investment in Grangemouth's future, Sir Keir said every person made redundant will get 18 months full pay and a skills and training offer \"backed up with up to £10m\". Any business in Grangemouth that takes on those workers will get National Insurance relief, he also said. Read more:Starmer's challenge is to see if usual rules of special relationship still applyLow paid jobs at risk from Labour's tax increases on businesses Petroineos, which owns Grangemouth, announced last September it was to close Grangemouth by this summer because it was unable to compete with sites in Asia, Africa and the Middle East. The refinery is understood to have been losing about £395,000 a day when it made the announcement and was on course to lose about £153m this year. The company said the decision would \"safeguard fuel supply for Scotland\" by converting the site into a terminal able to import petrol, diesel, aviation fuel and kerosene into Scotland. However, it said that would only need a workforce of fewer than 100 employees. Petroineos announced its intention to close the plant in November 2023 but union leaders had hoped it could remain open for longer to provide time for a green alternative to be established there."
    },
    {
        "title": "Starmer asks US to stand by Ukraine with security guarantee as bad peace deal would be 'disaster' for all",
        "description": "Sir Keir Starmer has urged Donald Trump to stand by Ukraine with a security guarantee as he warned a bad peace deal would be a \"disaster for everyone\".",
        "url": "https://news.sky.com/story/starmer-asks-us-to-stand-by-ukraine-with-security-guarantee-as-bad-peace-deal-would-be-disaster-for-all-13315350",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-paris_6837396.jpg?20250223035635",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-23 01:53:00",
        "Headline": "The prime minister has warned that a \"peace deal which does not stop Putin from attacking again would be a disaster for everyone\".",
        "Content": " Sir Keir Starmer has urged Donald Trump to stand by Ukraine with a security guarantee as he warned a bad peace deal would be a \"disaster for everyone\". The prime minister is due to meet the US president for talks in Washington DC next week amid fragile relations between America and Europe after Mr Trump launched a verbal attack on President Volodymyr Zelenskyy. Mr Trump called Ukraine's leader a \"dictator\" on Wednesday and later said Sir Keir and French President Emmanuel Macron, both of whom will visit the White House in the coming days, \"haven't done anything\" to end the war. Sir Keir said a good peace \"can only be won through strength\" and Ukraine \"must have a voice in negotiations about its future\". And he warned that a \"peace deal which does not stop Putin from attacking again would be a disaster for everyone\". Writing in The Sun on Sunday, he said Kyiv needs strong security guarantees \"so the peace will last\" and America \"must be part of that guarantee\". This could mean providing air defence and a promise that the US will come to the aid of a NATO country if Russia attacks them, the paper reported. \n                  Starmer says 'US is right' about UK and Europe needing to take more responsibility for defence\n                 \n                  Think business, not politics: Trump's approach to peacemaking\n                 \n                  Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing\n                 So far, talks aimed at ending the war have been taking place between US and Russian delegations in Saudi Arabia, which have not included the Ukrainians. UK Defence Secretary John Healey has said \"any negotiations about Ukraine cannot happen without Ukraine. We all want the fighting to end, but an insecure peace risks more war\". Read more:Envoy says US is 'with' Ukraine - in contrast to Trump's remarksDon't expect Love Actually-style moment from Starmer-Trump meeting  'Turn the screws' on Russia The third anniversary of Russia's full-scale invasion of Ukraine is on Monday. Foreign Secretary David Lammy has said he will unveil new sanctions to \"turn the screws\" on Russia on Monday to coincide with the anniversary. 👉 Follow Trump 100 on your podcast app 👈 Sir Keir also said the UK must increase its defence spending and play a bigger role in NATO. And he is open to British troops playing a role in any European force in Ukraine after a peace agreement. He added: \"This is not something I say lightly.\" Sir Keir, along with other European allies and UK opposition parties, has backed Mr Zelensky as a \"democratically elected leader\".  Also, Washington has warned that Europe must shoulder more of the cost of its own security. Sir Keir is expected to use his upcoming trip to the US to confirm a timeline to raise UK defence spending from 2.3% to 2.5% of gross domestic product (GDP) in a bid to ease tensions. It comes amid pressure from defence chiefs and opposition critics including Tory leader Kemi Badenoch, who wrote to the prime minister on Saturday demanding he set out a plan for meeting the target. :: Education secretary Bridget Phillipson, campaigner for global health and education Sarah Brown, and shadow defence secretary James Cartlidge will be discussing all the latest political stories in the UK and around the world on the Trevor Phillips on Sunday show on Sky News from 8.30am"
    },
    {
        "title": "Don't expect a Love Actually-style moment from the Starmer-Trump meeting",
        "description": "For a prime minister who has spent so much of his time in office out of the country, this week's high-stakes trip to Washington DC may well be the one for which Sir Keir Starmer ends up being most remembered.",
        "url": "https://news.sky.com/story/dont-expect-a-love-actually-style-moment-from-the-starmer-trump-meeting-13315274",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-nuclear_6821341.jpg?20250206143509",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-02-23 00:01:00",
        "Headline": "After Donald Trump pulled the rug from under Ukraine and ripped up the post-war expectation that America could be relied upon as the Western world's protector, what can Sir Keir Starmer do to ensure a successful trip?",
        "Content": "\n          Political correspondent\n              @amandaakass\n  For a prime minister who has spent so much of his time in office out of the country, this week's high-stakes trip to Washington DC may well be the one for which Sir Keir Starmer ends up being most remembered. At a time when the Western alliance seems close to fracturing over Donald Trump's verbal evisceration of Ukraine and enthusiastic embrace of Russia - the PM's mission is to smooth over those cracks, to advocate for Ukraine, and attempt to bring the White House back around to the European point of view. Can he succeed in convincing President Trump of the need for the Ukrainians and Europeans to be part of his negotiations with Russia - and commit to backing up any resulting peace deal with American firepower? Or will he face the kind of humiliation endured by Theresa May when she visited Mr Trump in 2017? The former Conservative prime minister scored a diplomatic coup in becoming the first world leader invited to the White House after Mr Trump's first election win, and hoped to shore up the president's support of NATO. While she succeeded in getting a public commitment to NATO - and incidentally, promised to encourage other European leaders to spend more on defence - the image of a domineering president grabbing her hand while she smiled awkwardly is what has gone down in history. This time the stakes are much higher. \n                  Starmer says 'US is right' about UK and Europe needing to take more responsibility for defence\n                 \n                  Elon Musk says US federal employees must justify their work or resign\n                 \n                  Think business, not politics: Trump's approach to peacemaking\n                 Over the past week, the mercurial new president has pulled the rug from under Ukraine and ripped up the post-war expectation that America could be relied upon as the Western world's protector. While Mr Trump's insistence that European leaders should spend more on defence and take up the burden of their own security comes as no surprise, his outright hostility to Volodymyr Zelenskyy and apparent embrace of Russian propaganda has blindsided the rest of Europe.  This weekend, Mr Trump has criticised both Sir Keir and President Emmanuel Macron - who will visit the White House three days earlier than the prime minister on Monday - as having done \"nothing\" to end the war in Ukraine. Downing Street is maintaining a dignified silence in response. The last thing it wants to do ahead of Sir Keir's visit is to provoke any further ire from the president. It's already charting a difficult course in publicly contradicting the president's description of President Zelenskyy as a \"dictator\" by making a rapid, supportive phone call and reaffirming Ukraine's \"democratically elected leader\". Sir Keir has made three phone calls to Mr Zelenskyy in just over a week and clearly wants to make a point that the UK's support for Ukraine is unwavering, whatever the president says. It's expected the UK will announce an expansion of military support and a package of Russian sanctions to mark the third anniversary of the invasion, which runs counter to Mr Trump's ambition to stop the fighting as soon as possible. 👉 Follow Trump 100 on your podcast app 👈 But Sir Keir will go to the White House bearing gifts in an attempt to mollify the president. He's widely expected to make a long-awaited announcement setting out the timetable to increase defence spending from 2.3% to 2.5% of GDP, several months earlier than planned. The president has repeatedly argued about the need for all NATO members to grow their defence budgets. The Telegraph reports the prime minister will also present Mr Trump with an invitation from the King for a state visit to the UK - a tactic previously employed by Mrs May. Will this be enough to nudge Mr Trump into greater enthusiasm for Sir Keir's plan to deploy British and other European troops to help keep the peace in Ukraine, backed up by US security guarantees?  Read more:Sombre Starmer and Europe confront emerging new world orderTrump's direction of travel doesn't look good for UkraineFact-checking Trump's claims about Zelenskyy and Ukraine war The Russians are clearly against the idea, and the president has made it clear he has no wish to deploy American forces to Europe. But perhaps US air support could provide the necessary \"backstop\", as Sir Keir calls it. But beyond Ukraine there are many other areas where the PM will need to deploy his best diplomatic skills. The Chagos deal is one such bone of contention. Labour has drawn up a plan to hand the remote Pacific archipelago to Mauritius, in line with international court rulings, but pay to continue leasing the UK/US military base there for the next 99 years. The government insists the arrangement is necessary for national security reasons, but the Trump administration has made it clear it is not happy with the plan. Donald Trump the president is still Donald Trump the businessman. For the president of the United States, everything is transactional, even the business of ending the war in Ukraine. Under the agreement, he wants Ukraine to grant America access to its mineral and oil resources as payback for wartime aid. This deal-making approach aligns with his broader foreign policy perspective, emphasising economic gains. Read the rest of David's analysis The other elephant in the room is the issue of tariffs, with Mr Trump threatening to slap \"reciprocal tariffs\" on imports to the US, citing VAT as an example of an \"unfair, discriminatory, or extraterritorial tax\". The White House is also promising a 25% tariff for overseas steel and aluminium. The UK is hoping to negotiate some kind of exemption due to the relatively even balance of US/UK trade, although that didn't work the last time the president was in office. In a worst-case scenario, economists have estimated tariffs could cost the British economy £24bn. It's a packed agenda - even without the added complication of Elon Musk getting involved, given his outspoken antipathy to Sir Keir. Talk of a Love Actually-style moment - any kind of open critique of the US president's wild approach to diplomacy - is hardly the prime minister's style. Mr Trump recently described Sir Keir as a \"very nice guy\" - but that personal relationship will only carry the negotiations so far."
    },
    {
        "title": "Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing",
        "description": "Visits by prime ministers to the American president matter much more to us \"Brits\" than they do to them. ",
        "url": "https://news.sky.com/story/starmers-challenge-is-to-see-if-usual-rules-of-special-relationship-still-apply-under-trump-after-years-of-love-bombing-13313250",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-adam-boulton-bespoke_6835540.png?20250221130148",
        "type": "Politics",
        "Author": "Adam Boulton",
        "Date Published": "2025-02-23 00:01:00",
        "Headline": "The challenges of the UK-US special relationship are not new. As Adam Boulton explains, it's always been up and down for prime ministers looking to charm presidents. ",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n Visits by prime ministers to the American president matter much more to us \"Brits\" than they do to them.  Donald Trump spelt this out in the off-hand way he announced that he had granted Sir Keir Starmer the coveted appointment in his busy schedule. \"We have a lot of good things going on,\" the president boasted. \"But he asked to come and see me and I just accepted his asking.\" After his phone call with the prime minister, Trump declared \"we're going to have a friendly meeting, very good\". That was before Sir Keir publicly disagreed with Trump's ruling that Volodymyr Zelenskyy is \"a dictator\".  Always assuming that his invitation is not cancelled in a fit of presidential pique, Starmer will find himself proceeding with the utmost caution when he gets to the Oval Office. Downing Street sources say they are anxious \"not to poke the bear\" in the full knowledge that previous leaders have endured many awkward moments in their attempts to further a special relationship at away matches. Starmer will have his work cut out. Since his re-election, Trump has signalled that he has less time than ever for traditional alliances. Newly inaugurated presidents traditionally send friendly greetings to their territorial neighbours. Trump slapped tariffs on Canada and Mexico and talked about US territorial expansion to both the north and the south. Historically the UK prime minister has often been the first foreign leader welcomed by a new US president. Trump hosted Theresa May less than a week after he took office for the first time and surprised her when he held her hand to go down some steps. This year Starmer has already been preceded by the leaders of Israel, Japan, Jordan and Indonesia and will be crossing the Atlantic to pay his respects in the same few days as France's President Macron. Thatcher and Reagan's political romance Even at the best of times, British officials are prone to exaggerate the closeness of the two countries' mutual interests. Harold Macmillan thought he could teach the young John Kennedy a thing or two, as the Greek to JFK's Roman, but ended up being dictated to by Kennedy on the nature of the UK's \"independent\" nuclear deterrent. One of the wily Harold Wilson's most significant achievements was refusing to send British troops to fight alongside the Americans in the Vietnam War. The most celebrated PM/POTUS political romance was between Margaret Thatcher and Ronald Reagan. Indeed when the Falklands conflict broke out in the spring of 1982, I was in the White House briefing room to hear then US secretary of state Al Haig joke with innuendo about the closeness of their relationship. It blossomed after Thatcher won Reagan over to give the UK expedition staunch support, in defiance of the advice from some of his officials. Even so, Thatcher was unnerved by Reagan's apparent willingness to consider mutual nuclear disarmament in discussion with the Soviet leader Mikhail Gorbachev in 1986. She flew hastily to Washington DC following the Reagan-Gorbachev summit in Reykjavik - \"to give Reagan a bollocking\" - at least according to the Daily Express reporter in her travelling party. In 1990 she reportedly told George HW Bush \"now George, this is not time to go wobbly\" during the flurry of meetings and phone calls which followed Iraq's invasion of Kuwait. Clinton owing Blair and Bush's love bombing John Major got off to a bad start with Bill Clinton after Conservative sources tried to help the Republican campaign dig up dirt on Clinton's time as a student at Oxford. Soon after the US election in 1992, Major flew to the US in the hope of being invited to a face-to-face meeting with the then president-elect. After several days all he got was a phone call from Little Rock, Arkansas. In spite of their ideological closeness, Tony Blair later said he found it more difficult to deal with the Third Way Democrat Bill Clinton than he did with the \"straightforward\" Republican George W Bush. Clinton nonetheless was a key player in bringing about the Belfast agreement. Blair's greatest success was persuading the president to commit US forces to peacekeeping in the Balkans but he also did Clinton significant personal service. Blair went on a scheduled visit to the White House at the height of the Monica Lewinsky scandal, just days after the president had made his statement \"I did not have sex with that woman\". At their joint news conference afterwards, Blair allowed all the questions to be deflected to him and expressed his admiration for the president. As they walked away from the East Wing, Clinton put his arm around the prime minister and appeared to say \"I owe you one\". Clinton's advice to Blair on his successor George W Bush was \"hug him close\". But both sides were apprehensive when the Labour prime minister flew to Camp David for his first meeting with the second President Bush. Bush wanted them to dress casual, and according to the British ambassador, Blair put on some \"ball-crushingly tight jeans\". From Bush's first words about sharing the same kind of toothpaste, Blair was subjected to love bombing. The two leaders' relationship remained close, including sending troops side-by-side into Afghanistan and Iraq. Brown's bag of CDs, Cameron's humility and common interests Through no fault of his own Gordon Brown found himself in the midst of a British media furore after Barack Obama's team returned a bust of Churchill which had been lent personally to George W Bush by the British Embassy. The new Obama administration's ignorance of the usual niceties was further demonstrated when a history-steeped gift to the president from Brown was reciprocated with a bag of CDs. David Cameron struck a humble note visiting Obama when he described the UK as America's \"junior partner\". Their alliance backfired when Obama tried to help during the Brexit referendum - warning that the UK would find itself \"at the back of the queue\" for striking a trade deal with the US after Brexit. The rapid turnover of prime ministers during Joe Biden's presidency did not allow any of them to build up a close working relationship. In any case, Biden chose to identify with his Irish, and not his English, heritage. Until this second Trump presidency, the US and the UK were at least pulling in the same direction, with differing interests but the common assumption that they would back each other up where possible. Starmer's challenge is to see if those rules still apply. Left-right differences can be overcome Until now, differences of left and right have not mattered much. It was a mere spat when the Reagan administration and the Labour leader Neil Kinnock ended up briefing against each other after the British leader of the Opposition was granted a brief Oval Office meeting before the 1987 general election. Reagan told Kinnock his unilateral nuclear disarmament policy was crazy and Labour said doddery Reagan had not recognised the shadow foreign secretary Denis Healey. Kinnock and Labour later abandoned their anti-nuclear policy. Starmer has got off to a better start than that. He and the foreign secretary David Lammy say they were hosted \"graciously\" by the then president-elect at Trump Tower in New York City last year. They will be hoping they can keep it that way this week in the White House."
    },
    {
        "title": "'Life-saving' simple blood test could transform and personalise cancer care if trial succeeds",
        "description": "Personalised cancer treatment, matched to a patient via a simple blood test, is being hailed as \"life-saving\", following an initial study.",
        "url": "https://news.sky.com/story/life-saving-simple-blood-test-could-transform-and-personalise-cancer-care-if-trial-succeeds-13313872",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-treatment-trial-study_6837405.jpg?20250223060653",
        "type": "Technology",
        "Author": "Katerina Vittozzi",
        "Date Published": "2025-02-23 00:01:00",
        "Headline": "What's effectively a \"liquid biopsy\" could transform cancer treatment, researchers hope. If a trial is successful, the goal is to personalise cancer care across the NHS - saving lives and making treatment less risky and intrusive.",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n  Personalised cancer treatment, matched to a patient via a simple blood test, is being hailed as \"life-saving\", following an initial study. The Target National trial, being conducted at The Christie hospital in Manchester, analyses a patient's DNA to determine what type of therapy will work best for them. If successful, researchers hope the procedure could become \"routinely available on the NHS\". Dr Matthew Krebs, the study's chief investigator, tells Sky News its research was making \"precision medicine\" more accessible for a wider range of cancer patients. \"There are tiny bits of DNA which come off the cancer that circulate around in the bloodstream,\" he explains, \"so we can extract the DNA that specifically comes from the cancer.\" That DNA is then analysed, allowing doctors to see its specific mutations and suggest bespoke treatment. Dr Krebs says that means \"rather than just treating generically with chemotherapy-type drugs\" the patient gets a treatment \"that's more personalised to them\". Although genetic and DNA testing for cancer patients is already being carried out in hospitals, typically the sample is collected using a biopsy. That can involve surgery, be intrusive, painful and - in some cases - delayed. Read more from Katerina Vittozzi:Stabbed teacher speaks outSky News joins police slavery raid at abattoirWhy wife stayed with husband after child abuse images found 'It's been life-saving' The Target National study, funded by The Christie Charity and the Sir Bobby Robson Foundation, hopes to recruit 6,000 patients, to examine if the blood-test route, in effect a \"liquid biopsy\", improves patient outcomes. Dr Krebs says they know that the blood test route \"won't work for everyone\", but in some cases, it has already enabled patients with advanced cancers to be matched to drug trials. Pamela Garner-Jones, 78, was told her stage four cervical cancer was \"inoperable\" and \"no longer responding to treatment\". \"They were talking about palliative care,\" she tells Sky News. \"I thought they were making it up, I couldn't believe it.\" At that point, Ms Garner-Jones was offered a place on the Target National study. Her blood test matched her to a new immunotherapy drug trial, that saw her tumour shrink by two-thirds. \"Honestly, I couldn't ask for anything more,\" she says. \"I've got more energy, my appetite's back - it's been life-saving.\" \"It's just a simple blood test and you're not pumped full of no end of drugs,\" she adds. Ms Garner-Jones says she is now looking forward to a holiday with friends, meals out and being able to spend time in her garden. \"I'm made up,\" she says. \"Like a dog with two tails!\""
    },
    {
        "title": "IT Crowd's Chris O'Dowd on aliens, returning to a 'broke' and 'down' London, and his new show Small Town, Big Story",
        "description": "Actor and comedian Chris O'Dowd has described moving back to London from the US, finding people in the city are \"down\" after a decade of cutbacks.",
        "url": "https://news.sky.com/story/it-crowds-chris-odowd-on-aliens-returning-to-a-broke-and-down-london-and-his-new-show-small-town-big-story-13313892",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-small-town-big-story_6835545.jpg?20250221130720",
        "type": "Entertainment",
        "Author": "Stephen Murphy",
        "Date Published": "2025-02-23 00:01:00",
        "Headline": "The Irish actor and comedian spoke to Sky News about his new Sky Original show, starring Mad Men's Christina Hendricks, and returning to the UK after years in LA.",
        "Content": "\n          Ireland correspondent\n              @SMurphyTV\n  Actor and comedian Chris O'Dowd has described moving back to London from the US, finding people in the city are \"down\" after a decade of cutbacks. The IT Crowd star returned to London from Los Angeles with his wife Dawn O'Porter and their two children a year ago. \"It's just gone through 10 years of austerity, and you can feel it off it,\" he told Sky News. \"People are down, is the impression I'm getting. I don't know if it's because of the divisive political culture or whether it's because people are broke as s**t because they haven't put any money into public services for so long, and now they've said they're not going to do it either because they're not going to raise taxes, so I don't know what they're going to do. But everybody is… it would be hard to say it's improved.\" Asked if he sensed any optimism that things would change for the better, he replied: \"Not yet.\" O'Dowd said the decision to return to the UK \"wasn't because Trump got in or any of that crap\", but that he wanted to \"get out before the political cycle starts, because it just gets a bit heated\". He added: \"It actually didn't this time, because he won so easily.\" The Irish star was speaking ahead of the premiere of his new Sky Original series Small Town, Big Story, which comes to Sky and NOW on Thursday 27 February. Set in the fictional Irish border village of Drumban, the dramatic comedy follows Wendy Patterson, portrayed by Mad Men's Christina Hendricks, a local girl who found success as a TV producer in Los Angeles. She returns with a film crew in tow and is forced to confront a secret from decades ago - visitors from outer space. So does the show's creator believe in alien existence? \"I find it hard to believe we're it, we're just too imperfect,\" O'Dowd replied. He hails from Boyle, County Roscommon, which is considered a \"UFO hotspot\" in Ireland. \"In the vastness of the universe, or the multiverse or whatever we're existing within, it seems highly unlikely that you and me are the best we can do, no offence,\" he added. Patterson's show-within-a-show, titled I Am Celt but described as Lame Of Thrones, appears to satirise Hollywood's often inaccurate portrayal of Ireland. \"Some of them can be heavy-handed, or a little bit off-piste,\" laughs O'Dowd. \"I think the thing to remember is we're guilty of it too. \"Whenever I hear Americans being depicted from Irish people, very often they're stuffing themselves with cheeseburgers and they're morons. There's got to be a bit of give and take with that.\""
    },
    {
        "title": "'I felt like a trespasser and imposter': Louis Theroux to be awarded prestigious NFTS fellowship",
        "description": "Louis Theroux will be honoured with the prestigious National Film and Television School (NFTS) fellowship next month.",
        "url": "https://news.sky.com/story/i-felt-like-a-trespasser-and-imposter-louis-theroux-to-be-awarded-prestigious-nfts-fellowship-13313948",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-louis-theroux-headshot_6835694.jpg?20250221162756",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-23 00:01:00",
        "Headline": "Famed for his Weird Weekends in the '90s, before interviewing a host of celebrities in When Louis Met and some less willing Scientologists for his feature-length 2026 movie, Louis Theroux is being honoured for his contribution to the industry.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Louis Theroux will be honoured with the prestigious National Film and Television School (NFTS) fellowship next month. The renowned interviewer - who has been working in the business for over three decades, and whose Weird Weekends were the stuff of legend - admits he initially felt like \"a trespasser\" and \"imposter\" in his front-of-screen role. Never going to film school himself, the now world-famous presenter and documentarian got his first job as a print journalist in America after graduating from Oxford University. His big break came on Michael Moore's TV Nation series, as a roving reporter delving into offbeat culture, later striking up a deal with the BBC resulting in Louis Theroux's Weird Weekends. A first-person storyteller, who disarms his subjects with charm, Theroux's interviews frequently result in the unexpected. Commenting on his upcoming award, Theroux said: \"I came into the industry more than thirty years ago, feeling like a trespasser, an imposter, in a role meant for someone else, worrying that I would be found out, hoping I could keep going for a few more months, since I was enjoying it so much. \"All these years later, I've learned that 'keeping going' may be the best definition of success.\" \n                  Barry Keoghan hits back at 'disgusting' online attacks calling him an 'absent father'\n                 \n                  Louis Theroux pays tribute to porn star Kagney Linn Karter who took her own life\n                 \n                  Louis Theroux contemplates cosmetic tattoo after shaving off 'patchy eyebrows'\n                 Admitting that like those just starting out in the field, he too is \"still figuring things out\", he said he hoped the fellowship would give him the chance to \"connect with younger people… sharing the few things I've learned, and more importantly learning from them\". Theroux went on to interview a host of celebrities in When Louis Met…, including Jimmy Savile, who is now known to have been one of the UK's most prolific sexual predators. Haunted by the interaction, Theroux would go on to interview some of Savile's victims in a follow-up 16 years later. Theroux has also fronted various documentaries across BBC1 and BBC2 and released the 2016 feature-length documentary My Scientology Movie. The author of several books, he currently hosts his own podcast series. In 2019, he set up his own production company, Mindhouse, with his wife Nancy Strang and filmmaker Arron Fellows, producing documentary film and TV series, as well as his podcast. Theroux recently revealed he was suffering from alopecia, initially resulting in the loss of his eyebrows. In true Theroux style, the 54-year-old has been documenting his hair loss journey on social media, seeking advice and sharing updates with his followers. Read more:Pamela Anderson on reclaiming her life and careerChris O'Dowd on returning to a 'broke' and 'down' London NFTS chair Sophie Turner Laing praised Theroux's \"immense contribution\" to the world of factual filmmaking, adding: \"His ability to connect with audiences and uncover powerful human stories makes him a true icon in the industry.\" Previous recipients of the honorary fellowship include James Bond producer Barbara Broccoli, Wallace And Gromit creator Nick Park, director Sam Mendes and children's author Malorie Blackman. NFTS graduates have gone on to win 15 Oscars and 166 BAFTAs since the school opened half a century ago, with current graduates' work on show at the BFI Southbank from Monday 3 March to Thursday 6 March. The fellowship will be awarded to Theroux during the school's graduation ceremony on Friday 7 March."
    }
]