[
    {
        "title": "Trump hails 'highest honour of my life' at state banquet - as King references trade, Ukraine and environment",
        "description": "Donald Trump said being the first US president to enjoy a second British state visit was \"one of the highest honours of my life\", as he wined and dined with royalty at Windsor Castle.",
        "url": "https://news.sky.com/story/king-references-trade-ukraine-and-environmentalism-beside-trump-during-state-banquet-speech-13433022",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-king-charles_7023442.jpg?20250917211237",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-17 19:43:00",
        "Headline": "Earlier today, Donald Trump and King Charles watched on as a military parade - replete with a Red Arrows flyover - was held at Windsor Castle.",
        "Content": " Donald Trump said being the first US president to enjoy a second British state visit was \"one of the highest honours of my life\", as he wined and dined with royalty at Windsor Castle. Wednesday evening's state banquet came after a day full of pomp and pageantry for Mr Trump, who was treated to a carriage procession, military parade, and plenty more lavish treatment. Trump's state banquet as it happened Suited and booted for the banquet to bring the day to a close, sat between the King and Princess of Wales, the president thanked the monarch and Queen for their \"extraordinary graciousness\". Mr Trump said it was a \"singular privilege\" to be the first American president to be granted a second state banquet, adding: \"This is truly one of the highest honours of my life, such respect for you and such respect for your country.\" He suggested it might be the last time it happens, adding \"I hope it is actually\" to laughter. Mr Trump's speech at the banquet followed one from the King, who referenced trade, Ukraine, and environmentalism. The monarch said the UK and US \"fought together to defeat the forces of tyranny\" during the First and Second World War, and added: \"Today, as tyranny once again threatens Europe, we and our allies stand together in support of Ukraine to deter aggression and secure peace.\" He mentioned trade between the two countries early in the speech, saying: \"Today, our alliance spans every field of endeavour and shows vast potential for growth. \"The United Kingdom was your partner in the first trade deal of your administration, Mr President, bringing jobs and growth to both our countries. \"And no doubt we can go even further as we build this new era of our partnership.\"  The King also referenced the environment and said that \"in striving for a better world, we also have a precious opportunity to safeguard and to restore the wonders and beauty of nature for the generations who follow us\". And in more lighthearted comments, the monarch said that \"I cannot help but wonder what our forefathers from 1776 would make of our friendship\" to audible laughter from the president. Red Arrows, tech giants and French menu The dinner capped off Mr Trump's first day of his state visit to the UK, with the US president joining King Charles to watch a military parade - replete with a Red Arrows flyover - held at Windsor Castle. More from Sky News:Trump's visit in picturesWho's who at state banquet  He and first lady Melania Trump also paid tribute to the late Queen Elizabeth II at St George's Chapel, where they laid a wreath at her tomb. The banquet had 160 attendees, including the Prince and Princess of Wales, Sir Keir Starmer, and a long list of American technology CEOs - including Apple's Tim Cook, OpenAI's Sam Altman, and Microsoft's Satya Nadella. The Silicon Valley executives are in the country as the UK and US announce a landmark technology deal worth billions of pounds. Sir Keir, meanwhile, has his focus set on talks with Mr Trump at his Chequers country retreat on Thursday. Photos from Windsor Castle ahead of the banquet showed a lavish arrangement - with a menu in French as has been tradition since the Norman conquests of the 11th century. International affairs editor Trump state visit II has so far been like The Truman Show.  A lavish production and spectacle revolving around just one man, while outside the set of Windsor Castle, beyond the big walls put up to fence it in, the world goes on. The question is - has it been worth all the enormous effort and expense? Click here to read more UK-US bond 'unbreakable', says Trump On the relationship between the UK and US, Mr Trump said that \"seen from American eyes, the word special does not begin to do it justice,\" before adding: \"We're like two notes in one chord or two verses of the same prose. \"Each beautiful on its own, but really meant to be played together. The bond of kinship and identity between America and the United Kingdom is priceless and eternal. \"It's irreplaceable and unbreakable.\" He then made a reference to former US president Joe Biden, saying: \"We had a very sick country one year ago, and today I believe we're the hottest country anywhere in the world.\" Mr Trump also told the King he had raised \"a remarkable son\" in Prince William before saying: \"Melania and I are delighted to visit again with Prince William and to see Her Royal Highness Princess Catherine so radiant and so healthy, so beautiful.\""
    },
    {
        "title": "Starmer-Trump talks could be landmark moment - and join pantheon of UK-US summits",
        "description": "In years to come, it may become known simply as Chequers '25.",
        "url": "https://news.sky.com/story/starmer-trump-talks-could-be-landmark-moment-and-join-pantheon-of-uk-us-summits-13433006",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-state-visit-donald-trump_7023394.png?20250917204535",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-09-17 19:18:00",
        "Headline": "Sir Keir Starmer is set to meet Donald Trump today for what could be a monumental moment. But what does history tell us about past meetings, and what can the PM learn?",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  In years to come, it may become known simply as Chequers '25. But today's summit between Sir Keir Starmer and Donald Trump, at the prime minister's country retreat, has the potential to be a landmark moment in UK-US history. There's plenty of scope for it to go horribly wrong, of course: over Jeffrey Epstein, Sir Keir's pledge to recognise Palestine, the president's lukewarm support for Ukraine, the Chagos Islands sell-off, or free speech. Trump state visit live - read the latest  But on the other hand, it could be a triumph for the so-called \"special relationship\" - as well as relations between these two unlikely allies - with deals on trade and tariffs and an improbably blossoming bromance. Either way, this Chequers summit - on the president's historic second state visit to the UK - could turn out to be one of the most notable one-to-one meetings between PM and president in 20th and 21st century history. Sir Keir and Mr Trump have already met several times, most recently at The Donald's golf courses in Scotland in late July and, before that, memorably at the White House in February. It was then that the PM theatrically pulled King Charles's invitation for this week's visit out of his inside pocket in a spectacular stunt surely masterminded by the \"Prince of Darkness\", spin doctor-turned-ambassador (until last week, anyway) Peter Mandelson. And over the years, there have been some remarkable and historic meetings and relationships, good and bad, between UK prime ministers and American presidents. From Churchill and Roosevelt to Eden and Eisenhower, from Macmillan and JFK to Wilson and Johnson, from Thatcher and Reagan, to Blair and Bush, and from Cameron and Obama… to Starmer and Trump, perhaps?  A brief history of relationships between PMs and presidents Throughout UK-US history, there have been many examples of a good relationship and close bond between a Labour prime minister and a Republican president. And vice versa. Also, it has not always been rosy between prime ministers and presidents of the two sister parties. There have been big fallings out: over Suez, Vietnam and the Caribbean island of Grenada. Leading up to this Chequers summit, the omens have not been good. First, the PM was forced to sack his vital link between Downing Street and the Oval Office, Lord Mandelson, over his friendship with Epstein.  Second, the president arrived in the UK to a barrage of criticism from London Mayor Sir Sadiq Khan, who accused him of doing more than anyone else to encourage the intolerant far right across the globe. And third, in a video-link to the 'Unite the Kingdom' march in London last weekend, one-time Trump ally Elon Musk called for a dissolution of parliament and a change of government and appeared to encourage violent protest. Churchill and FDR Back in the mid-20th century, the godfather of the \"special relationship\" was wartime leader Sir Winston Churchill, though it was 1946 before he first coined the phrase in a speech in the US, in which he also spoke of the \"iron curtain\". It was in 1941 that Churchill held one of the most significant meetings with a US president, Franklin D Roosevelt, at a Washington conference to plot the defeat of Germany after Japan's attack on Pearl Harbour. Churchill arrived in Washington in December after a rough 10-day voyage on a Royal Navy battleship and stayed three weeks, spending Christmas in the White House and on Boxing Day becoming the first UK PM to address Congress. The close bond between Churchill and Roosevelt was described as a friendship that saved the world. It was even claimed one reason the pair got on famously was that they were both renowned cigar smokers. Churchill and Truman After the war ended, Churchill's \"special relationship\" speech, describing the alliance between the UK and US, was delivered at Westminster College, in Fulton, Missouri in March 1946. The speech was introduced by President Harry Truman, a Democrat, with whom Churchill had attended the Potsdam Conference in 1945 to negotiate the terms of ending the war. These two were also close friends and would write handwritten letters to each other and address one another as Harry and Winston. Mr Truman was also the only US president to visit Churchill at Chartwell, his family home. Eden and Eisenhower But the transatlantic cosiness came to an abrupt end in the 1950s, when Churchill's Conservative successor Anthony Eden fell out badly with the Republican president Dwight Eisenhower over the Suez Crisis. Mr Eden did visit Mr Eisenhower in Washington in January 1956, and the official record of the meeting describes the discussion as focussing on \"policy differences and Cold War problems\". Macmillan and JFK But in the early 1960s, a Conservative prime minister and a Democrat president with seemingly nothing in common, the stuffy and diffident Harold Macmillan, and the charismatic John F Kennedy, repaired the damage. They were credited with rescuing the special relationship after the rupture of the Suez Crisis, at a time of high tensions around the world: the Berlin Wall, the Cuban missile crisis, and the threat of nuclear weapons. The two leaders exchanged handwritten notes, as well as Christmas and birthday cards. The Macmillans visited the Kennedys twice at the White House, in 1961 and 1962 - the second described in the US as a \"momentous\" meeting on the Cuban crisis. The relationship was abruptly cut short in 1963 by \"Supermac's\" demise prompted by the Profumo scandal, and JFK's assassination in Dallas. But after her husband's death, Jacqueline Kennedy was said to have had a father-daughter relationship with Macmillan, who was said to have been enchanted with her. Wilson and LBJ  After JFK, the so-called \"special relationship\" cooled once again - and under a Labour prime minister and Democrat president - when Harold Wilson rejected pressure from Lyndon B Johnson to send British troops to Vietnam. Mr Wilson became prime minister in 1964, just two months after LBJ sent US troops. His first overseas trip was to the White House, in December 1964, and the PM returned to tell his cabinet: \"Lyndon Johnson is begging me even to send a bagpipe band to Vietnam.\" Thatcher and Reagan And even though Margaret Thatcher and Ronald Reagan were ideological soulmates, Thatcher was furious when she wasn't consulted before the Americans invaded Grenada in 1983 to topple a Marxist regime. Even worse, according to Mrs Thatcher allies, a year earlier, Reagan had stayed neutral during the Falklands war. Reagan said he couldn't understand why two US allies were arguing over \"that little ice-cold bunch of land down there\". But their relationship didn't just survive, it flourished, including at one memorable visit to the presidential retreat at Camp David in 1984, where President Reagan famously drove Mrs T around in a golf buggy. They would also memorably dance together at White House balls. Blair and Bush  Camp David was also where in 2001 the Republican president George W Bush and Labour's Sir Tony Blair embarked on the defining mission of his premiership: the Iraq War. It was to prove to be an historic encounter. The war was the turning point of Sir Tony's decade in Number 10. He was branded a liar over claims about Saddam Hussein's \"weapons of mass destruction\", he was vilified by the Labour left, and it was the beginning of the end for him. And to add to the suspicion among Sir Tony's critics that he was Mr Bush's poodle, in 2006 at a G8 summit in St Petersburg - that wouldn't happen now - a rogue microphone picked up the president calling, \"Yo, Blair! How are you doing?\" Cameron and Obama Some years later, the Tory prime minister sometimes called the \"heir to Blair\", David Cameron, bonded over burgers with the Democrat president Barack Obama, serving a BBQ lunch to military families in the Downing Street garden. They also played golf at the exclusive Grove resort in 2016. They seemed unlikely allies: Obama, the first African-American president, and Cameron, the 19th old Etonian prime minister. It was claimed they had a \"transatlantic bromance\" in office. \"Yes, he sometimes calls me bro,\" Lord Cameron admitted. But not everything went well. The Tory PM persuaded Mr Obama to help the Remain campaign in the 2016 Brexit referendum, when he claimed the UK would be \"at the back of the queue\" on trade deals with the US, if it left the EU. It backfired, of course. Now it's Sir Keir Starmer's turn to tread a delicate and potentially hazardous political tightrope as he entertains the latest - and most unconventional - US president. The greatest dangers for Sir Keir will be a news conference in the afternoon, in the gardens, if the weather permits. Good luck, as they say, with that. Before then, there's the potential for what the Americans call a \"pool spray\", one of those impromptu, rambling and unpredictable Q&As we've seen so many times in the Oval Office. For Sir Keir, what could possibly go wrong? Chequers '25 could be memorable and notable, like so many previous meetings between a PM and a president. But not necessarily for the right reasons for this UK prime minister."
    },
    {
        "title": "Jimmy Kimmel's show pulled over comments about Charlie Kirk",
        "description": "US talk show host Jimmy Kimmel has had his programme pulled over \"offensive and insensitive\" comments about Charlie Kirk.",
        "url": "https://news.sky.com/story/jimmy-kimmels-show-pulled-over-comments-about-charlie-kirk-13433145",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel-talk-show_7023618.jpg?20250918001442",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-17 22:46:00",
        "Headline": "Donald Trump and Vice President JD Vance are among those to cite \"left-wing extremism\" as a factor in Charlie Kirk's killing - and Jimmy Kimmel used his show to call out perceived hypocrisy among MAGA supporters.",
        "Content": "US talk show host Jimmy Kimmel has had his programme pulled over \"offensive and insensitive\" comments about Charlie Kirk. Kimmel used his show on Monday night to accuse Donald Trump and his allies of \"doing their best to fan the flames\" following the conservative influencer's assassination last week. Disney-owned ABC said it would be taken off-air indefinitely - and with immediate effect - after network operator Nexstar said it would stop broadcasting the programme. Andrew Alford, president of Nexstar's broadcasting division, said it \"strongly objects\" to Kimmel's comments. \"Mr Kimmel's comments about the death of Mr Kirk are offensive and insensitive at a critical time in our national political discourse,\" he said, with the show to go off-air to \"let cooler heads prevail\". Mr Trump welcomed the news on Truth Social, writing \"congratulations to ABC\" and \"Kimmel has ZERO talent\". What happened? Kimmel called out what he believes is hypocrisy in how Republicans have responded to Mr Kirk's death. Mr Trump and Vice President JD Vance are among those to cite \"left-wing extremism\" as a factor in the killing. Suspected gunman Tyler Robinson appeared in court for the first time on Tuesday night. Prosecutors said he had shared negative views about Kirk, an influential media figure in the MAGA movement. Read more from Sky News:Trump enjoys lavish state banquetRobert Redford's grandchildren pay tribute  On the Monday edition of his show, Kimmel drew attention to Capitol rioters who \"wanted to hang\" Mr Trump's first term vice president, Mike Pence, for certifying Joe Biden's 2020 election win. \"Was that the liberal left? Or the toothless army who stormed the Capitol on January 6,\" said Kimmel. His remarks saw the chairman of the Federal Communications Commission, Trump backer Brendan Carr, threaten to \"take action\" against Disney and ABC. A representative for Kimmel did not immediately respond to a request for comment about the cancellation. Kimmel follows in Colbert's footsteps The abrupt removal of Jimmy Kimmel Live comes after fellow late night host Stephen Colbert saw his programme cancelled, which fans claimed was a result of his criticism of Mr Trump. Mr Trump presents himself as a staunch advocate of free speech, but regularly rails against media organisations which criticise him. This week he launched a lawsuit against The New York Times. CBS announced in July it would end The Late Show when its current series ends next May. In a statement, the network said the move was \"not related in any way to the show's performance, content or other matters happening at Paramount.\" Mr Trump praised the move, saying \"his talent was even worse than his ratings\". Colbert's Late Show won an Emmy for outstanding talk series for the first time at the weekend."
    },
    {
        "title": "Home Office to appeal temporary block on man's deportation under 'one in, one out' plan",
        "description": "The Home Office will appeal against the High Court's decision to temporarily block the deportation of an Eritrean man to France under the government's \"one in, one out\" scheme, Shabana Mahmood has confirmed.\n",
        "url": "https://news.sky.com/story/home-office-to-appeal-temporary-block-on-mans-deportation-13432899",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-small-boats-starmer_6989917.png?20250813164711",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-17 16:23:00",
        "Headline": "Shabana Mahmood has vowed to \"fight\" attempts to block the first deportation flight under the UK-France returns deal.",
        "Content": "The Home Office will appeal against the High Court's decision to temporarily block the deportation of an Eritrean man to France under the government's \"one in, one out\" scheme, Shabana Mahmood has confirmed.\n Speaking for the first time since the court's decision on Tuesday, the new home secretary said: \"Last minute attempts to frustrate a removal are intolerable, and I will fight them at every step.\" Ms Mahmood added that she will \"fight to end vexatious, last-minute claims\" and \"robustly defend the British public's priorities\". Yesterday evening, the High Court granted an Eritrean man, who cannot be named for legal reasons, a \"short period of interim relief\" ahead of his deportation to France scheduled for a 9am flight this morning. Lawyers acting on the man's behalf said the case \"concerns a trafficking claim\" and her client, who alleges he has a gunshot wound in his leg, claims he is vulnerable and faces a risk of \"destitution\" in France. The Home Office defended the case, saying it was reasonable to expect the man to claim asylum in France. Mr Justice Sheldon ruled that while there did not appear to be a \"real risk\" the man would be destitute in France, the trafficking claim required further interrogation. \n                  Sadiq Khan calls out Gaza 'genocide', as Starmer 'delays' recognising Palestinian state until end of Trump's state visit\n                 \n                  Starmer-Trump talks could be landmark moment - and join pantheon of UK-US summits\n                 \n                  Radical overhaul of how schools support special needs students demanded by MPs\n                 The man would have been the first person to be returned to France under the terms of the UK-France deal, which was signed in July and led to the first people being detained after crossing the Channel in August. In a statement, Ms Mahmood added: \"Migrants suddenly deciding they are a modern slave on the eve of their removal, having never made such a claim before, make a mockery of our laws and this country's generosity. \"I will do whatever it takes to secure our border.\" She has also announced she will review the Modern Slavery Act to see where it is currently open to misuse.  The Home Office has confirmed the temporary block on the man's deportation will be challenged in the courts, and that lawyers acting for the man have 14 days to provide proof for their claim that he has been trafficked to the UK. It also insisted that the first deportation flight under the UK-France migrants returns deal will still take place this week. Conservative Party leader Kemi Badenoch was quick to criticise the government over the ruling on Tuesday, saying: \"We told you so\". Responding to Ms Mahmood's comments, the Tories' Chris Philp said the home secretary \"is reacting in panic to the collapse of her gimmick returns deal\". The shadow home secretary added: \"No one is fooled by tough talk from Labour. They will never do the hard work needed to tackle the lawfare that blocks removals. \"The truth is, Labour is run by human rights lawyers - Keir Starmer and Lord Hermer - who have always sided with open borders activists over security and control.\" Mr Philp added that the \"weak government will continue to preside over borders chaos\". Reform UK has repeatedly criticised the policy and has also hit back at the home secretary following her statement. Zia Yusuf, the party's head of policy, said: \"These are empty words from a home secretary who is out of her depth. \"Without a total legal reset, including leaving the ECHR [European Convention on Human Rights] and disapplying international treaties like the 1951 Refugee Convention, activist lawyers will continue abusing the legal system to prevent deportations.\" What is the scheme? The pilot scheme was announced to much fanfare in July, after French President Emmanuel Macron made a state visit to the UK. Sir Keir Starmer had hoped the agreement - which would see the UK send asylum seekers who have crossed the Channel back to France in exchange for legal migrants with links to Britain - would prove more resilient to court challenges than the Tories' Rwanda plan. He wants the number of migrants being returned to France to gradually increase over the course of the scheme, to deter them from coming in small boats. The pilot came into force last month and is in place until June 2026."
    },
    {
        "title": "Meta announces new smart glasses with a bold claim. I've tried them - and am unconvinced",
        "description": "Meta has announced smart glasses with a screen in the right lens, meaning you can read WhatsApp messages, look at a map or translate a conversation - all from the comfort of your face.",
        "url": "https://news.sky.com/story/meta-announces-new-smart-glasses-with-a-bold-claim-ive-tried-them-and-am-unconvinced-13432792",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-meta-smart-glasses_7023626.png?20250918021439",
        "type": "Home",
        "Author": "Mickey Carroll",
        "Date Published": "2025-09-17 14:29:00",
        "Headline": "Meta believes the new glasses keep \"you tuned in to the world around you, not distracted from it\". But I tried the tech on at an event with the company earlier this month and found the opposite.",
        "Content": "\n          Science and technology reporter\n       Meta has announced smart glasses with a screen in the right lens, meaning you can read WhatsApp messages, look at a map or translate a conversation - all from the comfort of your face. The company describes them as the world's most advanced AI glasses, and it's the first time it has put a display in its smart Ray-Bans. Mark Zuckerberg believes such hi-tech specs are the future of portable computing, telling the unveiling event they're \"the only form factor where you can let AI see what you see, hear what you hear\". Released on 30 September for $799 (£587), the display is controlled using a neural band that wraps around the user's wrist and monitors their hand movements. A twist of the fingers will turn the glasses' volume up or down or zoom on the camera; two taps of the thumb to the forefinger will close the display and soon, users will be able to write texts by drawing letters in the air. \"The amount of signals the band can detect is incredible - it has the fidelity to measure movement even before it's visually perceptible,\" said a Meta spokesperson. The company says their glasses are \"designed to help you look up and stay present\", a \"technology that keeps you tuned in to the world around you, not distracted from it\". But I tried the tech on at an event with Meta earlier this month and found the opposite. I was so distracted by the display that during an interview with Ankit Brahmbhatt, director of product management at Meta, I realised I was watching a game I'd accidentally left on in my lens. I confessed and asked Mr Brahmbhatt if the glasses would actually help enable better face-to-face conversations, or if people would simply look more engaged because they weren't looking down at their phone. \"I don't think we're saying we have all the answers yet, right? Just like when we were first introduced to smartphones or any other new paradigm, there's a lot of things that evolve over time,\" said Mr Brahmbhatt. \"We feel very much that this is already going to make you much more heads up and in the moment. With AI glasses, you actually have the sense of being able to engage.\" But having a screen in your vision can be very distracting - research has repeatedly shown our brains simply aren't designed to cope with two activities at a time. In one famous study published in the Applied Cognitive Psychology journal, people walking down a road while doing a task on their phone didn't even notice a unicycling clown riding in front of them. Read more from Sky News:How most people are using ChatGPTNHS medicines bill 'should rise to preserve UK drug industry' It's a phenomenon called inattentional blindness. \"People are cognitively distracted all of the time [by devices]. It's just that in particular circumstances, such as driving, the risks are so much higher,\" said Professor Gemma Briggs, professor of applied cognitive psychology at the Open University. Although the display on Meta's glasses will turn off automatically when it detects you're driving, there's nothing to stop users from switching it back on. This could lead to dangerously distracted drivers, according to Professor Briggs. \"My research has demonstrated that it really doesn't make any difference whether you're touching, holding, manipulating your phone or whether it's hands-free, you're still far more likely to be distracted. \"That means you're four times more likely to be involved in a collision, you are significantly less likely to notice hazards that occur, even if they occur straight ahead of you and any hazards that you do notice, you will take a lot longer to react to,\" said Professor Briggs. Meta insists these glasses will make sure their wearers stay in the moment and engaged. For some, however, phones are already distracting enough - let alone when you have one strapped to your face."
    },
    {
        "title": "Madeleine McCann suspect Christian B celebrates release from prison with burger and cigarette",
        "description": "The suspect in the Madeleine McCann case celebrated his release from prison with a fast-food breakfast of chicken nuggets and a burger.",
        "url": "https://news.sky.com/story/madeleine-mccann-suspect-christian-b-celebrates-release-from-prison-with-burger-and-cigarette-13432947",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-christian-b-madeleine-mcann_7023063.jpg?20250917153032",
        "type": "Home",
        "Author": "Martin Brunt",
        "Date Published": "2025-09-17 17:49:00",
        "Headline": "It's not known where Christian B was headed after he stopped briefly at a McDonald's restaurant, but he's been fitted with an electronic ankle tag, has had to surrender his passport and register a permanent address as part of his release conditions.",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n  The suspect in the Madeleine McCann case celebrated his release from prison with a fast-food breakfast of chicken nuggets and a burger. Christian B, 49, was smuggled from a jail near Hanover, hidden in the back of his lawyer's car and managed to avoid being filmed or pictured by scores of camera operators who had been waiting for several days. But a photographer caught up with him as he stopped briefly at a McDonald's restaurant. Read more: Madeleine McCann suspect released after serving rape sentence Christian B, who cannot be fully identified under German privacy laws, stood outside and smoked a cigarette before eating his food. Dressed in a lilac shirt, beige trousers and trainers, he ordered chicken nuggets with sweet-and-sour sauce, a burger and a hot drink. He wore sunglasses, but they did little to disguise the distinctive features that have appeared on TV and on the front of newspapers around the world. \n                  Madeleine McCann suspect Christian B released after serving rape sentence\n                 \n                  Prime suspect in Madeleine McCann case slapped with strict conditions ahead of jail release\n                 \n                  What we know about Christian B -  the prime suspect in Madeleine McCann's disappearance\n                 After 15 minutes, he left the restaurant as police blocked the street to allow him to leave freely. He was driven off again in the black Audi saloon in which his lawyer Friedrich Fulscher had collected him an hour earlier from Sehnde prison. It's not known where Christian B was headed after completing an unrelated sentence for the rape of an elderly woman, or who will help him adjust to his new life of freedom. As part of his release conditions, he's been fitted with an electronic ankle tag, has had to surrender his passport and register his permanent address with probation officers. Another of his lawyers, Philipp Marquort, said: \"This is an attempt by the public prosecutor's office to keep him in a kind of pre-trial detention where they would have access to him at any time. We will not accept that.\" German prosecutor Hans Christian Wolters, who leads the Madeleine investigation, believes Christian B abducted and murdered the three-year-old during a family holiday in Portugal in 2007. The suspect, who has convictions for child sex abuse, theft, drug trafficking and forgery, denies any involvement. Explainer: The chequered history of Christian B  Madeleine vanished from her bed in a rented apartment as her parents and their friends dined nearby at the hotel complex in Praia da Luz. Mr Wolters told Sky News he had \"almost\" enough evidence to charge the suspect, but could not justify arresting him and stopping him from being freed. He said: \"He is dangerous, a psychopath, and we hope he does not commit more crimes, but it is likely he will.\" He said he hadn't ruled out the chance of charging Christian B: \"At the moment, we still have lines of investigation we are pursuing, and we hope we may gain more evidence or indications. \"If that happens, our situation would of course improve, and we would prefer to go to court with that stronger position.\" Christian B, who flitted between Germany and Portugal, has served seven years for the rape of a 72-year-old American woman in Praia da Luz - two years before Madeleine vanished. He is expected to appear in a German court next month to face a charge of using insulting behaviour towards a female prison warder. A conviction could put him back in jail. He also faces a possible retrial after the prosecutor's appeal against his acquittal last year on unrelated rape and child sex allegations. Scotland Yard detectives, who failed to charge anyone in their own investigation, revealed this week they had asked Christian B to answer their questions, but he refused, as he has with their German and Portuguese colleagues. His lawyers dismissed it as an illegal request because investigators had shared none of the prosecution files with him. According to the prosecutor, the evidence against Christian B in the Madeleine case is circumstantial; his mobile phone was nearby her apartment at the time she vanished, he was a convicted child sex abuser, he had allegedly confessed to a friend, and he had re-registered his car the day after. There is no forensic evidence to link the suspect to the abduction - and after 18 years, the chances of finding it must be remote. Read more from Martin Brunt:I was reporting during 7/7 bombings - here's what happenedSky News tracks down woman in hit-and-run Maddie theoryOfficers describe confronting 'coward' Southport killer  German criminal profiler Mark T Hofmann told Sky News: \"I'm a big believer in second chances, but I'm not that much of a big believer in tenth chances. \"So if you commit a crime, and you do it again and again and again and again, then you need to ask yourself like, why should we believe that he will stop now? \"I wish, and I hope that also he realises that he can maybe now live a different life anonymously in some place, and hopefully stop committing crimes.\" Madeleine's parents Kate and Gerry McCann, from Leicestershire, cling to the hope their daughter might still be found alive, in the absence of any evidence they are aware of to show she is dead."
    },
    {
        "title": "Sadiq Khan calls out Gaza 'genocide', as Starmer 'delays' recognising Palestinian state until end of Trump's state visit",
        "description": "London's mayor Sir Sadiq Khan has for the first time described the situation in Gaza as a \"genocide\", becoming the most senior Labour figure to contradict the government's official position.",
        "url": "https://news.sky.com/story/sadiq-khan-calls-out-gaza-genocide-as-starmer-delays-recognising-palestinian-state-until-end-of-trumps-state-visit-13433134",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sir-sadiq-khan-sir-keir-starmer_7023622.png?20250918013930",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-17 22:10:00",
        "Headline": "It is reported that the government wants to avoid Gaza, and looming recognition of Palestinian statehood, dominating the news agenda following talks between Sir Keir Starmer and Donald Trump on Thursday.",
        "Content": "London's mayor Sir Sadiq Khan has for the first time described the situation in Gaza as a \"genocide\", becoming the most senior Labour figure to contradict the government's official position. Earlier this week, a UN Commission said a genocide was taking place in Gaza - something repeatedly denied by Israel. Meanwhile, Sir Keir Starmer has been under pressure to raise Israel's bombardment of the territory with Donald Trump during his state visit to the UK. The prime minister is due to have discussions with the president today, but reports suggest he will delay formally recognising a Palestinian state until this weekend, after Mr Trump has left Britain. It is claimed the government wants to avoid the issue dominating a news conference the two men plan to hold, according to The Times.  The prime minister has found himself at odds with the US administration over the move, which is opposed to official recognition of Palestine. The mayor of London, who has engaged in a long-running spat with Mr Trump, has added to the political tension by contradicting official Labour policy at a people's question time event on Wednesday. \"I think it's inescapable to draw the conclusion in Gaza we are seeing before our very eyes a genocide,\" said Sir Sadiq. Sir Keir has previously pledged to recognise Palestinian statehood ahead of next week's United Nations General Assembly in New York if Israel does not meet a series of conditions to improve the humanitarian situation in Gaza. Other nations, including France, Australia and Canada, have said they plan to take the same step at the UN gathering. Explainer: What does recognising a Palestinian state mean? The UK has consistently argued that the issue of whether Israel has committed genocide was a matter for the courts. Israel is fighting a case at the International Court of Justice in The Hague in which the country is accused of genocide. But some opposition leaders, including Zack Polanski for the Green Party, and the Liberal Democrats' Sir Ed Davey have specifically referred to the situation in Gaza as genocide. Read more from Sky News:Watch: Israel's Gaza City offensiveMPs denied entry into West Bank  On Tuesday, the UN Independent International Commission of Inquiry on the Occupied Palestinian Territory released a report, claiming: \"It is clear that there is an intent to destroy the Palestinians in Gaza\". It said Israel's actions meet the criteria set down for defining a genocide. The UK government has said its official position was it \"has not concluded that Israel is acting with that [genocidal] intent\". Israel is currently undertaking a major ground offensive in Gaza, with thousands forced to flee from Gaza City in recent days."
    },
    {
        "title": "Radical overhaul of how schools support special needs students demanded by MPs",
        "description": "A radical overhaul of the way mainstream schools support children with special educational needs and disabilities (SEND) is needed to stop the system from collapsing under growing demand, MPs have warned.",
        "url": "https://news.sky.com/story/radical-overhaul-of-how-schools-support-special-needs-students-demanded-by-mps-13433131",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lauren-and-her-son_7023549.jpg?20250917224124",
        "type": "Home",
        "Author": "Anjum Peerbacos",
        "Date Published": "2025-09-17 22:02:00",
        "Headline": "With 1.7 million children identified as having SEND, a cultural shift across the sector, backed by investment in training and staff, is needed for schools to become genuinely inclusive, a cross-party report says.",
        "Content": "\n          Education reporter\n       A radical overhaul of the way mainstream schools support children with special educational needs and disabilities (SEND) is needed to stop the system from collapsing under growing demand, MPs have warned. The number of children identified with SEND has soared from 1.3 million in 2019 to 1.7 million this year. In 2024/25, more than 1.2 million pupils were receiving SEND support, with nearly half a million holding an education health care plan (EHCP). Helen Hayes, Education Committee chair, said the findings show that only with a cultural shift across the sector, backed by investment in training and staff, will schools be genuinely inclusive. Ms Hayes told Sky News she would like to see \"a fully inclusive education system that means defining what inclusive means and properly resourcing the delivery of that\". Asked if the report was a recommendation to replace all specialist schools with mainstream SEND provision, she said: \"No, not at all, quite the opposite. \"Our report calls for more investment in specialist schools in the state sector. \"The current approach to funding is not sustainable, it's driving local authorities to the edge of bankruptcy.\" Read more education news:Why SEND plans worry parentsOfsted report cards 'add insult to injury'  Autism is now the most common need cited in EHCPs, accounting for over a third of cases, but MPs also heard of sharp increases in speech, language, and communication needs, as well as social, emotional and mental health needs, particularly since the pandemic. Ms Hayes said ministers \"shouldn't be making any changes to EHCPs as they currently work\". \"They are an important statutory part of the system; there will always be children who need them,\" she added. 'It's incredibly hard to watch' Lauren's six-year-old son was diagnosed with autism in January, and she is still waiting for his EHCP and further reassessments. She said she is \"flabbergasted by the level of failure we've faced, and I know we're not the only ones\". \"It's incredibly hard to watch a child who's already vulnerable be pushed even further into disadvantage by the very systems that were supposed to protect and support him,\" she said. The cross-party committee stresses that the long-term solution lies in embedding inclusivity across all schools, from early years through to post-16, with needs identified earlier and support delivered by staff trained in SEND. Such a shift, the report argues, would ease demand for complex, expensive EHCPs, help balance stretched budgets, and ensure children are supported before issues escalate. Read more on Sky News:Southport killer's parents 'knew risk'Robert Redford's grandchildren pay tribute Rachel Filmer, co-founder of Save Our Children's Rights, said her organisation welcomed \"any measures to make mainstream schools genuinely more inclusive, but this cannot be inclusion in name only\". \"It is vital that children retain the right to statutory plans, to individualised support, and to specialist school placements if this is in the child's best interests,\" she added. While the report highlights examples of strong practice in England and abroad, it also acknowledges many families are still facing long waits for assessments. The report does not draw a conclusion on the causes of rising need, but expert witnesses pointed to a mix of factors, from greater awareness and better diagnosis to wider social and health trends."
    },
    {
        "title": "Southport victims' parents say killer's parents 'knew and ignored risk he posed to public'",
        "description": "The families of the three girls murdered in the Southport attack have claimed the parents of killer Axel Rudakubana \"knew and ignored the risk he posed to the public\".",
        "url": "https://news.sky.com/story/southport-victims-parents-say-killers-parents-knew-and-ignored-risk-he-posed-to-public-13432889",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-southport-victim_6809419.jpg?20250917171849",
        "type": "Home",
        "Author": "Duncan Gardham, security journalist",
        "Date Published": "2025-09-17 15:59:00",
        "Headline": "The inquiry had previously heard about efforts by Axel Rudakubana's parents to get him help with his mental health in the years before the July 2024 attack.",
        "Content": "By Duncan Gardham, security journalist  The families of the three girls murdered in the Southport attack have claimed the parents of killer Axel Rudakubana \"knew and ignored the risk he posed to the public\". They also pointed to \"multiple errors, omissions and fatal misjudgements\" by mental health services, social services and police. The claims were made as the families outlined for the first time the issues they want the public inquiry, being held at Liverpool Town Hall, to examine over the next seven weeks. Rudakubana's brother Dion said he wanted the inquiry to examine whether his sibling's exclusion from school and transfer to a pupil referral unit had increased his sense of isolation from friends and family. The inquiry had previously heard about a series of efforts made by Rudakubana's parents to get him help with his mental health in the years before the attack but also outlined that they intercepted two machetes delivered to the house and were struggling to deal with their son's violence in the home. Bebe King, six, Elsie Stancombe, seven, and Alice da Silva Aguiar, nine, were fatally stabbed at a Taylor Swift-themed class on 29 July last year by Rudakubana, then aged 17, who was jailed earlier this year for a minimum of 52 years. Nicholas Bowen KC, for the three bereaved families, told the inquiry: \"It is a visceral conviction that the safeguarding apparatus of the state has failed them and that it was not only public bodies.\" \n                  Southport killer's parents took delivery of machetes and knives and tried to hide them from him, inquiry told\n                 \n                  Mother of girl killed in Southport attack tells inquiry she is 'broken beyond repair'\n                 \n                  New evidence shows 'significantly more missed opportunities' to stop Southport killer\n                 Rudakubana's family \"knew and ignored the risk he posed to the public\" as did a taxi driver who drove away after dropping the killer at the Hart Space dance studio, he said. \"But for multiple errors, omissions and fatal misjudgements,\" Rudakubana - referred to throughout as AR - \"would have been seen for who he really was, and, we say, stopped,\" Mr Bowen said. The families blamed a combination of incompetent diagnosis, inappropriate educational provision, and a lack of action by public bodies. They highlighted an incident when Rudakubana was reported missing by his parents and found on a bus in March 2022, refusing to pay the fare, with a knife in his possession. 'Failure to join the dots' The police, mental health services and social services \"failed to join the dots with his previous offending\" which involved an attempt to target a child he claimed was bullying him by taking a knife into assembly at his previous school. If authorities had joined the dots, it would have been \"inevitable\" that Rudakubana would have been subjected to a \"full and rigorous assessment\", that would have been out of parental control, and then referred to mental health services, he said. \"It is very unlikely that the assessment would not have led to a discovery of the horrific escalation of risk that we have heard about, aggression at home and the parents' knowledge of the purchase of weapons,\" Mr Bowen told the hearing. Rudakubana's father took delivery of a machete, marked up that it must be delivered to a person over 18, and he \"must have known and would have warned, had he been behaving responsibly, the social workers about the hole into which his son was descending\", said Mr Bowen. Warning signs The victims' families highlighted details about two attacks Rudakubana launched at Range High School, in nearby Formby, which were not previously known. On 6 October 2019, he \"viciously attacked\" his alleged bully in class and was put into isolation. Interviewed by police the next day, he said he was \"pretty certain\" he was willing to use a knife he had taken into the school on at least 10 separate occasions. The school decided to exclude him permanently but he appealed against it. However, during his appeal, Rudakubana \"showed no remorse or regret, trusted no one, and refused all support\". He was sent to a pupil referral unit called Acorns which was the \"one institution that emerges with credit from this tragic series of events\", Mr Bowen said. They made three separate referrals to the Prevent deradicalisation programme, none of which were adopted by the project. The Acorn school's leadership were \"acutely concerned\" about Rudakubana's behaviour and internet use and consistently resisted categorising him as \"low risk\", Mr Bowen said. Read more:The missed chances to stop RudakubanaGrandfather who tackled killer Asked why he took a knife to school, Rudakubana \"emotionlessly and without eye contact\" told one teacher: \"To use it.\" Her professional judgement was that \"there was something so cold\" about the way he described the incident. This information should have been available to mental health services and social services, \"underlining the urgency of assessment and tailored provision to protect the public and meet AR's needs\", Mr Bowen said. On 11 December 2019, two months after the classroom incident, Rudakubana returned to Range High School, from where he had been excluded, with a hockey stick and a knife in a rucksack. He tried to enter the school assembly, searching for the bully, but when he was chased away by the headteacher, he instead attacked a schoolfriend in the corridor. Afterwards, Rudakubana admitted he had intended to strike the bully with the hockey stick and if required \"finish him off\" with the knife and said he was indifferent to going to prison, repeating that he had the knife \"to use it\". However, when Rudakubana's father attended the school, the headteacher reported that he \"appeared calm and failed to appreciate the gravity of the incident\". Merseyside Police recorded that day that Rudakubana had \"deteriorating mental health\" and that he would be subjected to a full mental health assessment. It noted there was knowledge of previously carrying a knife at school and the use of the internet to research school massacres and beheading videos. Questioned by a mental health practitioner while in custody, Rudakubana stated he \"wouldn't have felt sad\" if he hurt the boy and would have killed the bully if he had been in assembly, adding: \"Ideally, I wish I did it.\" He liked the boy he hit and was unbothered because the boy \"didn't get hurt that bad\" even though the victim was hospitalised, and press reports referred to a broken wrist. \"His callous attack on the friend, a mere bystander to his quest for revenge, was something of real concern\" to the mental health practitioner, Mr Bowen said. However, when he was eventually taken up by forensic child and adolescent mental health services FCAMHS, it emerged that a formal diagnosis of autism spectrum disorder could take up to two years and no formal risk assessment was carried out. Instead, Acorns school were left \"holding the baby\", Mr Bowen added."
    },
    {
        "title": "Trump hails 'highest honour of my life' at state banquet - as King references trade, Ukraine and environment",
        "description": "Donald Trump said being the first US president to enjoy a second British state visit was \"one of the highest honours of my life\", as he wined and dined with royalty at Windsor Castle.",
        "url": "https://news.sky.com/story/king-references-trade-ukraine-and-environmentalism-beside-trump-during-state-banquet-speech-13433022",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-king-charles_7023442.jpg?20250917211237",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-17 19:43:00",
        "Headline": "Earlier today, Donald Trump and King Charles watched on as a military parade - replete with a Red Arrows flyover - was held at Windsor Castle.",
        "Content": " Donald Trump said being the first US president to enjoy a second British state visit was \"one of the highest honours of my life\", as he wined and dined with royalty at Windsor Castle. Wednesday evening's state banquet came after a day full of pomp and pageantry for Mr Trump, who was treated to a carriage procession, military parade, and plenty more lavish treatment. Trump's state banquet as it happened Suited and booted for the banquet to bring the day to a close, sat between the King and Princess of Wales, the president thanked the monarch and Queen for their \"extraordinary graciousness\". Mr Trump said it was a \"singular privilege\" to be the first American president to be granted a second state banquet, adding: \"This is truly one of the highest honours of my life, such respect for you and such respect for your country.\" He suggested it might be the last time it happens, adding \"I hope it is actually\" to laughter. Mr Trump's speech at the banquet followed one from the King, who referenced trade, Ukraine, and environmentalism. The monarch said the UK and US \"fought together to defeat the forces of tyranny\" during the First and Second World War, and added: \"Today, as tyranny once again threatens Europe, we and our allies stand together in support of Ukraine to deter aggression and secure peace.\" He mentioned trade between the two countries early in the speech, saying: \"Today, our alliance spans every field of endeavour and shows vast potential for growth. \"The United Kingdom was your partner in the first trade deal of your administration, Mr President, bringing jobs and growth to both our countries. \"And no doubt we can go even further as we build this new era of our partnership.\"  The King also referenced the environment and said that \"in striving for a better world, we also have a precious opportunity to safeguard and to restore the wonders and beauty of nature for the generations who follow us\". And in more lighthearted comments, the monarch said that \"I cannot help but wonder what our forefathers from 1776 would make of our friendship\" to audible laughter from the president. Red Arrows, tech giants and French menu The dinner capped off Mr Trump's first day of his state visit to the UK, with the US president joining King Charles to watch a military parade - replete with a Red Arrows flyover - held at Windsor Castle. More from Sky News:Trump's visit in picturesWho's who at state banquet  He and first lady Melania Trump also paid tribute to the late Queen Elizabeth II at St George's Chapel, where they laid a wreath at her tomb. The banquet had 160 attendees, including the Prince and Princess of Wales, Sir Keir Starmer, and a long list of American technology CEOs - including Apple's Tim Cook, OpenAI's Sam Altman, and Microsoft's Satya Nadella. The Silicon Valley executives are in the country as the UK and US announce a landmark technology deal worth billions of pounds. Sir Keir, meanwhile, has his focus set on talks with Mr Trump at his Chequers country retreat on Thursday. Photos from Windsor Castle ahead of the banquet showed a lavish arrangement - with a menu in French as has been tradition since the Norman conquests of the 11th century. International affairs editor Trump state visit II has so far been like The Truman Show.  A lavish production and spectacle revolving around just one man, while outside the set of Windsor Castle, beyond the big walls put up to fence it in, the world goes on. The question is - has it been worth all the enormous effort and expense? Click here to read more UK-US bond 'unbreakable', says Trump On the relationship between the UK and US, Mr Trump said that \"seen from American eyes, the word special does not begin to do it justice,\" before adding: \"We're like two notes in one chord or two verses of the same prose. \"Each beautiful on its own, but really meant to be played together. The bond of kinship and identity between America and the United Kingdom is priceless and eternal. \"It's irreplaceable and unbreakable.\" He then made a reference to former US president Joe Biden, saying: \"We had a very sick country one year ago, and today I believe we're the hottest country anywhere in the world.\" Mr Trump also told the King he had raised \"a remarkable son\" in Prince William before saying: \"Melania and I are delighted to visit again with Prince William and to see Her Royal Highness Princess Catherine so radiant and so healthy, so beautiful.\""
    },
    {
        "title": "Starmer-Trump talks could be landmark moment - and join pantheon of UK-US summits",
        "description": "In years to come, it may become known simply as Chequers '25.",
        "url": "https://news.sky.com/story/starmer-trump-talks-could-be-landmark-moment-and-join-pantheon-of-uk-us-summits-13433006",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-state-visit-donald-trump_7023394.png?20250917204535",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-09-17 19:18:00",
        "Headline": "Sir Keir Starmer is set to meet Donald Trump today for what could be a monumental moment. But what does history tell us about past meetings, and what can the PM learn?",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  In years to come, it may become known simply as Chequers '25. But today's summit between Sir Keir Starmer and Donald Trump, at the prime minister's country retreat, has the potential to be a landmark moment in UK-US history. There's plenty of scope for it to go horribly wrong, of course: over Jeffrey Epstein, Sir Keir's pledge to recognise Palestine, the president's lukewarm support for Ukraine, the Chagos Islands sell-off, or free speech. Trump state visit live - read the latest  But on the other hand, it could be a triumph for the so-called \"special relationship\" - as well as relations between these two unlikely allies - with deals on trade and tariffs and an improbably blossoming bromance. Either way, this Chequers summit - on the president's historic second state visit to the UK - could turn out to be one of the most notable one-to-one meetings between PM and president in 20th and 21st century history. Sir Keir and Mr Trump have already met several times, most recently at The Donald's golf courses in Scotland in late July and, before that, memorably at the White House in February. It was then that the PM theatrically pulled King Charles's invitation for this week's visit out of his inside pocket in a spectacular stunt surely masterminded by the \"Prince of Darkness\", spin doctor-turned-ambassador (until last week, anyway) Peter Mandelson. And over the years, there have been some remarkable and historic meetings and relationships, good and bad, between UK prime ministers and American presidents. From Churchill and Roosevelt to Eden and Eisenhower, from Macmillan and JFK to Wilson and Johnson, from Thatcher and Reagan, to Blair and Bush, and from Cameron and Obama… to Starmer and Trump, perhaps?  A brief history of relationships between PMs and presidents Throughout UK-US history, there have been many examples of a good relationship and close bond between a Labour prime minister and a Republican president. And vice versa. Also, it has not always been rosy between prime ministers and presidents of the two sister parties. There have been big fallings out: over Suez, Vietnam and the Caribbean island of Grenada. Leading up to this Chequers summit, the omens have not been good. First, the PM was forced to sack his vital link between Downing Street and the Oval Office, Lord Mandelson, over his friendship with Epstein.  Second, the president arrived in the UK to a barrage of criticism from London Mayor Sir Sadiq Khan, who accused him of doing more than anyone else to encourage the intolerant far right across the globe. And third, in a video-link to the 'Unite the Kingdom' march in London last weekend, one-time Trump ally Elon Musk called for a dissolution of parliament and a change of government and appeared to encourage violent protest. Churchill and FDR Back in the mid-20th century, the godfather of the \"special relationship\" was wartime leader Sir Winston Churchill, though it was 1946 before he first coined the phrase in a speech in the US, in which he also spoke of the \"iron curtain\". It was in 1941 that Churchill held one of the most significant meetings with a US president, Franklin D Roosevelt, at a Washington conference to plot the defeat of Germany after Japan's attack on Pearl Harbour. Churchill arrived in Washington in December after a rough 10-day voyage on a Royal Navy battleship and stayed three weeks, spending Christmas in the White House and on Boxing Day becoming the first UK PM to address Congress. The close bond between Churchill and Roosevelt was described as a friendship that saved the world. It was even claimed one reason the pair got on famously was that they were both renowned cigar smokers. Churchill and Truman After the war ended, Churchill's \"special relationship\" speech, describing the alliance between the UK and US, was delivered at Westminster College, in Fulton, Missouri in March 1946. The speech was introduced by President Harry Truman, a Democrat, with whom Churchill had attended the Potsdam Conference in 1945 to negotiate the terms of ending the war. These two were also close friends and would write handwritten letters to each other and address one another as Harry and Winston. Mr Truman was also the only US president to visit Churchill at Chartwell, his family home. Eden and Eisenhower But the transatlantic cosiness came to an abrupt end in the 1950s, when Churchill's Conservative successor Anthony Eden fell out badly with the Republican president Dwight Eisenhower over the Suez Crisis. Mr Eden did visit Mr Eisenhower in Washington in January 1956, and the official record of the meeting describes the discussion as focussing on \"policy differences and Cold War problems\". Macmillan and JFK But in the early 1960s, a Conservative prime minister and a Democrat president with seemingly nothing in common, the stuffy and diffident Harold Macmillan, and the charismatic John F Kennedy, repaired the damage. They were credited with rescuing the special relationship after the rupture of the Suez Crisis, at a time of high tensions around the world: the Berlin Wall, the Cuban missile crisis, and the threat of nuclear weapons. The two leaders exchanged handwritten notes, as well as Christmas and birthday cards. The Macmillans visited the Kennedys twice at the White House, in 1961 and 1962 - the second described in the US as a \"momentous\" meeting on the Cuban crisis. The relationship was abruptly cut short in 1963 by \"Supermac's\" demise prompted by the Profumo scandal, and JFK's assassination in Dallas. But after her husband's death, Jacqueline Kennedy was said to have had a father-daughter relationship with Macmillan, who was said to have been enchanted with her. Wilson and LBJ  After JFK, the so-called \"special relationship\" cooled once again - and under a Labour prime minister and Democrat president - when Harold Wilson rejected pressure from Lyndon B Johnson to send British troops to Vietnam. Mr Wilson became prime minister in 1964, just two months after LBJ sent US troops. His first overseas trip was to the White House, in December 1964, and the PM returned to tell his cabinet: \"Lyndon Johnson is begging me even to send a bagpipe band to Vietnam.\" Thatcher and Reagan And even though Margaret Thatcher and Ronald Reagan were ideological soulmates, Thatcher was furious when she wasn't consulted before the Americans invaded Grenada in 1983 to topple a Marxist regime. Even worse, according to Mrs Thatcher allies, a year earlier, Reagan had stayed neutral during the Falklands war. Reagan said he couldn't understand why two US allies were arguing over \"that little ice-cold bunch of land down there\". But their relationship didn't just survive, it flourished, including at one memorable visit to the presidential retreat at Camp David in 1984, where President Reagan famously drove Mrs T around in a golf buggy. They would also memorably dance together at White House balls. Blair and Bush  Camp David was also where in 2001 the Republican president George W Bush and Labour's Sir Tony Blair embarked on the defining mission of his premiership: the Iraq War. It was to prove to be an historic encounter. The war was the turning point of Sir Tony's decade in Number 10. He was branded a liar over claims about Saddam Hussein's \"weapons of mass destruction\", he was vilified by the Labour left, and it was the beginning of the end for him. And to add to the suspicion among Sir Tony's critics that he was Mr Bush's poodle, in 2006 at a G8 summit in St Petersburg - that wouldn't happen now - a rogue microphone picked up the president calling, \"Yo, Blair! How are you doing?\" Cameron and Obama Some years later, the Tory prime minister sometimes called the \"heir to Blair\", David Cameron, bonded over burgers with the Democrat president Barack Obama, serving a BBQ lunch to military families in the Downing Street garden. They also played golf at the exclusive Grove resort in 2016. They seemed unlikely allies: Obama, the first African-American president, and Cameron, the 19th old Etonian prime minister. It was claimed they had a \"transatlantic bromance\" in office. \"Yes, he sometimes calls me bro,\" Lord Cameron admitted. But not everything went well. The Tory PM persuaded Mr Obama to help the Remain campaign in the 2016 Brexit referendum, when he claimed the UK would be \"at the back of the queue\" on trade deals with the US, if it left the EU. It backfired, of course. Now it's Sir Keir Starmer's turn to tread a delicate and potentially hazardous political tightrope as he entertains the latest - and most unconventional - US president. The greatest dangers for Sir Keir will be a news conference in the afternoon, in the gardens, if the weather permits. Good luck, as they say, with that. Before then, there's the potential for what the Americans call a \"pool spray\", one of those impromptu, rambling and unpredictable Q&As we've seen so many times in the Oval Office. For Sir Keir, what could possibly go wrong? Chequers '25 could be memorable and notable, like so many previous meetings between a PM and a president. But not necessarily for the right reasons for this UK prime minister."
    },
    {
        "title": "Sadiq Khan calls out Gaza 'genocide', as Starmer 'delays' recognising Palestinian state until end of Trump's state visit",
        "description": "London's mayor Sir Sadiq Khan has for the first time described the situation in Gaza as a \"genocide\", becoming the most senior Labour figure to contradict the government's official position.",
        "url": "https://news.sky.com/story/sadiq-khan-calls-out-gaza-genocide-as-starmer-delays-recognising-palestinian-state-until-end-of-trumps-state-visit-13433134",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sir-sadiq-khan-sir-keir-starmer_7023622.png?20250918013930",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-17 22:10:00",
        "Headline": "It is reported that the government wants to avoid Gaza, and looming recognition of Palestinian statehood, dominating the news agenda following talks between Sir Keir Starmer and Donald Trump on Thursday.",
        "Content": "London's mayor Sir Sadiq Khan has for the first time described the situation in Gaza as a \"genocide\", becoming the most senior Labour figure to contradict the government's official position. Earlier this week, a UN Commission said a genocide was taking place in Gaza - something repeatedly denied by Israel. Meanwhile, Sir Keir Starmer has been under pressure to raise Israel's bombardment of the territory with Donald Trump during his state visit to the UK. The prime minister is due to have discussions with the president today, but reports suggest he will delay formally recognising a Palestinian state until this weekend, after Mr Trump has left Britain. It is claimed the government wants to avoid the issue dominating a news conference the two men plan to hold, according to The Times.  The prime minister has found himself at odds with the US administration over the move, which is opposed to official recognition of Palestine. The mayor of London, who has engaged in a long-running spat with Mr Trump, has added to the political tension by contradicting official Labour policy at a people's question time event on Wednesday. \"I think it's inescapable to draw the conclusion in Gaza we are seeing before our very eyes a genocide,\" said Sir Sadiq. Sir Keir has previously pledged to recognise Palestinian statehood ahead of next week's United Nations General Assembly in New York if Israel does not meet a series of conditions to improve the humanitarian situation in Gaza. Other nations, including France, Australia and Canada, have said they plan to take the same step at the UN gathering. Explainer: What does recognising a Palestinian state mean? The UK has consistently argued that the issue of whether Israel has committed genocide was a matter for the courts. Israel is fighting a case at the International Court of Justice in The Hague in which the country is accused of genocide. But some opposition leaders, including Zack Polanski for the Green Party, and the Liberal Democrats' Sir Ed Davey have specifically referred to the situation in Gaza as genocide. Read more from Sky News:Watch: Israel's Gaza City offensiveMPs denied entry into West Bank  On Tuesday, the UN Independent International Commission of Inquiry on the Occupied Palestinian Territory released a report, claiming: \"It is clear that there is an intent to destroy the Palestinians in Gaza\". It said Israel's actions meet the criteria set down for defining a genocide. The UK government has said its official position was it \"has not concluded that Israel is acting with that [genocidal] intent\". Israel is currently undertaking a major ground offensive in Gaza, with thousands forced to flee from Gaza City in recent days."
    },
    {
        "title": "Radical overhaul of how schools support special needs students demanded by MPs",
        "description": "A radical overhaul of the way mainstream schools support children with special educational needs and disabilities (SEND) is needed to stop the system from collapsing under growing demand, MPs have warned.",
        "url": "https://news.sky.com/story/radical-overhaul-of-how-schools-support-special-needs-students-demanded-by-mps-13433131",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lauren-and-her-son_7023549.jpg?20250917224124",
        "type": "UK",
        "Author": "Anjum Peerbacos",
        "Date Published": "2025-09-17 22:02:00",
        "Headline": "With 1.7 million children identified as having SEND, a cultural shift across the sector, backed by investment in training and staff, is needed for schools to become genuinely inclusive, a cross-party report says.",
        "Content": "\n          Education reporter\n       A radical overhaul of the way mainstream schools support children with special educational needs and disabilities (SEND) is needed to stop the system from collapsing under growing demand, MPs have warned. The number of children identified with SEND has soared from 1.3 million in 2019 to 1.7 million this year. In 2024/25, more than 1.2 million pupils were receiving SEND support, with nearly half a million holding an education health care plan (EHCP). Helen Hayes, Education Committee chair, said the findings show that only with a cultural shift across the sector, backed by investment in training and staff, will schools be genuinely inclusive. Ms Hayes told Sky News she would like to see \"a fully inclusive education system that means defining what inclusive means and properly resourcing the delivery of that\". Asked if the report was a recommendation to replace all specialist schools with mainstream SEND provision, she said: \"No, not at all, quite the opposite. \"Our report calls for more investment in specialist schools in the state sector. \"The current approach to funding is not sustainable, it's driving local authorities to the edge of bankruptcy.\" Read more education news:Why SEND plans worry parentsOfsted report cards 'add insult to injury'  Autism is now the most common need cited in EHCPs, accounting for over a third of cases, but MPs also heard of sharp increases in speech, language, and communication needs, as well as social, emotional and mental health needs, particularly since the pandemic. Ms Hayes said ministers \"shouldn't be making any changes to EHCPs as they currently work\". \"They are an important statutory part of the system; there will always be children who need them,\" she added. 'It's incredibly hard to watch' Lauren's six-year-old son was diagnosed with autism in January, and she is still waiting for his EHCP and further reassessments. She said she is \"flabbergasted by the level of failure we've faced, and I know we're not the only ones\". \"It's incredibly hard to watch a child who's already vulnerable be pushed even further into disadvantage by the very systems that were supposed to protect and support him,\" she said. The cross-party committee stresses that the long-term solution lies in embedding inclusivity across all schools, from early years through to post-16, with needs identified earlier and support delivered by staff trained in SEND. Such a shift, the report argues, would ease demand for complex, expensive EHCPs, help balance stretched budgets, and ensure children are supported before issues escalate. Read more on Sky News:Southport killer's parents 'knew risk'Robert Redford's grandchildren pay tribute Rachel Filmer, co-founder of Save Our Children's Rights, said her organisation welcomed \"any measures to make mainstream schools genuinely more inclusive, but this cannot be inclusion in name only\". \"It is vital that children retain the right to statutory plans, to individualised support, and to specialist school placements if this is in the child's best interests,\" she added. While the report highlights examples of strong practice in England and abroad, it also acknowledges many families are still facing long waits for assessments. The report does not draw a conclusion on the causes of rising need, but expert witnesses pointed to a mix of factors, from greater awareness and better diagnosis to wider social and health trends."
    },
    {
        "title": "Southport victims' parents say killer's parents 'knew and ignored risk he posed to public'",
        "description": "The families of the three girls murdered in the Southport attack have claimed the parents of killer Axel Rudakubana \"knew and ignored the risk he posed to the public\".",
        "url": "https://news.sky.com/story/southport-victims-parents-say-killers-parents-knew-and-ignored-risk-he-posed-to-public-13432889",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-southport-victim_6809419.jpg?20250917171849",
        "type": "UK",
        "Author": "Duncan Gardham, security journalist",
        "Date Published": "2025-09-17 15:59:00",
        "Headline": "The inquiry had previously heard about efforts by Axel Rudakubana's parents to get him help with his mental health in the years before the July 2024 attack.",
        "Content": "By Duncan Gardham, security journalist  The families of the three girls murdered in the Southport attack have claimed the parents of killer Axel Rudakubana \"knew and ignored the risk he posed to the public\". They also pointed to \"multiple errors, omissions and fatal misjudgements\" by mental health services, social services and police. The claims were made as the families outlined for the first time the issues they want the public inquiry, being held at Liverpool Town Hall, to examine over the next seven weeks. Rudakubana's brother Dion said he wanted the inquiry to examine whether his sibling's exclusion from school and transfer to a pupil referral unit had increased his sense of isolation from friends and family. The inquiry had previously heard about a series of efforts made by Rudakubana's parents to get him help with his mental health in the years before the attack but also outlined that they intercepted two machetes delivered to the house and were struggling to deal with their son's violence in the home. Bebe King, six, Elsie Stancombe, seven, and Alice da Silva Aguiar, nine, were fatally stabbed at a Taylor Swift-themed class on 29 July last year by Rudakubana, then aged 17, who was jailed earlier this year for a minimum of 52 years. Nicholas Bowen KC, for the three bereaved families, told the inquiry: \"It is a visceral conviction that the safeguarding apparatus of the state has failed them and that it was not only public bodies.\" \n                  Southport killer's parents took delivery of machetes and knives and tried to hide them from him, inquiry told\n                 \n                  Mother of girl killed in Southport attack tells inquiry she is 'broken beyond repair'\n                 \n                  New evidence shows 'significantly more missed opportunities' to stop Southport killer\n                 Rudakubana's family \"knew and ignored the risk he posed to the public\" as did a taxi driver who drove away after dropping the killer at the Hart Space dance studio, he said. \"But for multiple errors, omissions and fatal misjudgements,\" Rudakubana - referred to throughout as AR - \"would have been seen for who he really was, and, we say, stopped,\" Mr Bowen said. The families blamed a combination of incompetent diagnosis, inappropriate educational provision, and a lack of action by public bodies. They highlighted an incident when Rudakubana was reported missing by his parents and found on a bus in March 2022, refusing to pay the fare, with a knife in his possession. 'Failure to join the dots' The police, mental health services and social services \"failed to join the dots with his previous offending\" which involved an attempt to target a child he claimed was bullying him by taking a knife into assembly at his previous school. If authorities had joined the dots, it would have been \"inevitable\" that Rudakubana would have been subjected to a \"full and rigorous assessment\", that would have been out of parental control, and then referred to mental health services, he said. \"It is very unlikely that the assessment would not have led to a discovery of the horrific escalation of risk that we have heard about, aggression at home and the parents' knowledge of the purchase of weapons,\" Mr Bowen told the hearing. Rudakubana's father took delivery of a machete, marked up that it must be delivered to a person over 18, and he \"must have known and would have warned, had he been behaving responsibly, the social workers about the hole into which his son was descending\", said Mr Bowen. Warning signs The victims' families highlighted details about two attacks Rudakubana launched at Range High School, in nearby Formby, which were not previously known. On 6 October 2019, he \"viciously attacked\" his alleged bully in class and was put into isolation. Interviewed by police the next day, he said he was \"pretty certain\" he was willing to use a knife he had taken into the school on at least 10 separate occasions. The school decided to exclude him permanently but he appealed against it. However, during his appeal, Rudakubana \"showed no remorse or regret, trusted no one, and refused all support\". He was sent to a pupil referral unit called Acorns which was the \"one institution that emerges with credit from this tragic series of events\", Mr Bowen said. They made three separate referrals to the Prevent deradicalisation programme, none of which were adopted by the project. The Acorn school's leadership were \"acutely concerned\" about Rudakubana's behaviour and internet use and consistently resisted categorising him as \"low risk\", Mr Bowen said. Read more:The missed chances to stop RudakubanaGrandfather who tackled killer Asked why he took a knife to school, Rudakubana \"emotionlessly and without eye contact\" told one teacher: \"To use it.\" Her professional judgement was that \"there was something so cold\" about the way he described the incident. This information should have been available to mental health services and social services, \"underlining the urgency of assessment and tailored provision to protect the public and meet AR's needs\", Mr Bowen said. On 11 December 2019, two months after the classroom incident, Rudakubana returned to Range High School, from where he had been excluded, with a hockey stick and a knife in a rucksack. He tried to enter the school assembly, searching for the bully, but when he was chased away by the headteacher, he instead attacked a schoolfriend in the corridor. Afterwards, Rudakubana admitted he had intended to strike the bully with the hockey stick and if required \"finish him off\" with the knife and said he was indifferent to going to prison, repeating that he had the knife \"to use it\". However, when Rudakubana's father attended the school, the headteacher reported that he \"appeared calm and failed to appreciate the gravity of the incident\". Merseyside Police recorded that day that Rudakubana had \"deteriorating mental health\" and that he would be subjected to a full mental health assessment. It noted there was knowledge of previously carrying a knife at school and the use of the internet to research school massacres and beheading videos. Questioned by a mental health practitioner while in custody, Rudakubana stated he \"wouldn't have felt sad\" if he hurt the boy and would have killed the bully if he had been in assembly, adding: \"Ideally, I wish I did it.\" He liked the boy he hit and was unbothered because the boy \"didn't get hurt that bad\" even though the victim was hospitalised, and press reports referred to a broken wrist. \"His callous attack on the friend, a mere bystander to his quest for revenge, was something of real concern\" to the mental health practitioner, Mr Bowen said. However, when he was eventually taken up by forensic child and adolescent mental health services FCAMHS, it emerged that a formal diagnosis of autism spectrum disorder could take up to two years and no formal risk assessment was carried out. Instead, Acorns school were left \"holding the baby\", Mr Bowen added."
    },
    {
        "title": "East Midlands Ambulance Service 'neglect' contributed to meningitis death of Zara Cheesman, 15, coroner rules",
        "description": "Ambulance workers were guilty of \"gross failings to provide basic care\" in the death of a 15-year-old schoolgirl from meningitis, a coroner has ruled.",
        "url": "https://news.sky.com/story/east-midlands-ambulance-service-neglect-contributed-to-meningitis-death-of-zara-cheesman-15-coroner-rules-13432929",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-f-zara-cheesman-zara-cheesman_7016254.jpg?20250910163859",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-17 17:07:00",
        "Headline": "The teenager showed might have survived but for the \"neglect\" of EMAS technicians who were guilty of \"gross failings to provide basic care\", the coroner says.",
        "Content": "Ambulance workers were guilty of \"gross failings to provide basic care\" in the death of a 15-year-old schoolgirl from meningitis, a coroner has ruled. Zara Cheesman, who died at the Queen's Medical Centre (QMC) in Nottingham in December, had shown \"red flags\" of the disease, and might have survived but for the \"neglect\" of East Midlands Ambulance Service (EMAS), coroner Elizabeth Didcock said. Concluding the inquest into the schoolgirl's death at Nottingham Coroner's Court on Wednesday, Ms Didcock said she was \"satisfied neglect contributed to Zara's death\". Donald Trump state visit - latest She added: \"In this case, it is the total picture of the EMAS assessment that amounts to neglect.\" Two technicians who assessed Zara and did not take her to hospital were guilty of \"gross failings to provide basic care\". Ms Didcock said there was an opportunity missed \"to provide treatment on the 21st of December 2024 that likely would have been lifesaving\". \n                  Trump hails 'highest honour of my life' at state banquet - as King references trade, Ukraine and environment\n                 \n                  Starmer-Trump talks could be landmark moment - and join pantheon of UK-US summits\n                 \n                  Sadiq Khan calls out Gaza 'genocide', as Starmer 'delays' recognising Palestinian state until end of Trump's state visit\n                 The teenager, from the Mapperley Park area of the city, went to A&E the day before after vomiting and suffering from neck and shoulder pain, but she was discharged with a suspected case of norovirus. Dr Derek Huffadine, a paediatric emergency medicine registrar at QMC, considered Zara might have meningitis but decided not to do blood tests because he didn't think they would help on the basis of his examination. This conclusion was \"reasonable\", the coroner said, as was the decision not to order tests. The next day, Zara woke up \"confused\", so EMAS technicians, who, unlike paramedics, are non-registered clinicians, went to Zara's home. Ambulance service policy is for technicians to ask for guidance from a registered clinician if they decide not to take a child to hospital. They did not follow it and Zara would likely have survived had they done so, the inquest heard. The technicians had a preconception that Zara had norovirus and did not consider the significance of her not being \"with it\" and ignored her parents' concerns, Ms Didcock said. There was \"no exploration of these key symptoms\", a history of diarrhoea was incorrectly recorded, and they did not follow guidance, the coroner added. She said: \"I find all of the above failings amount to serious issues of care. Had Zara been conveyed to hospital, she would have had an appropriate assessment. On balance, Zara would have survived.\" Read more on Sky News:Appeal over one in, one out schemeHatton 'in good place' - familyDangerous fake dolls seized Speaking outside Nottingham Coroner's Court, Zara's mother said losing their daughter \"has left a hole in our lives that can never be filled. She was empathic, funny, intelligent and had so many dreams she wanted to achieve - a daughter, a sister, and a friend whose laughter lit up the room\". Her father said: \"Our deepest wish is that the lessons are learned, and actions are taken so no other family will be forced to endure what we have been through.\" Keeley Sheldon, director of quality at East Midlands Ambulance Service, said: \"I am truly sorry that we missed the opportunity to take Zara to hospital for further assessment. Offering her \"sincere condolences\", she said EMAS accepted the coroner's findings and promised to make changes \"to ensure that this does not happen again\"."
    },
    {
        "title": "MSPs vote to abolish Scottish legal system's controversial not proven verdict",
        "description": "MSPs have voted to abolish Scotland's controversial not proven verdict.",
        "url": "https://news.sky.com/story/msps-vote-to-abolish-scottish-legal-systems-controversial-not-proven-verdict-13432747",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-scottish-parliament_6496922.jpg?20250917141057",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-09-17 13:00:00",
        "Headline": "The Victims, Witnesses and Justice Reform (Scotland) Bill was passed on Wednesday following a lengthy debate of more than 160 amendments that began the day before.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n MSPs have voted to abolish Scotland's controversial not proven verdict. The Scottish government's flagship Victims, Witnesses and Justice Reform (Scotland) Bill was passed on Wednesday following a lengthy debate of more than 160 amendments that began the day before. The new legislation makes a series of changes to the justice system, including scrapping the not proven verdict; establishing a specialist sexual offences court; creating a victims and witnesses commissioner; reforming the jury process to require a two-thirds majority for conviction; and implementing Suzanne's Law which will require the parole board to take into account if a killer continues to refuse to reveal where they hid their victim's body. Following Royal Assent, the legislation will be implemented in phases. Justice Secretary Angela Constance said: \"This historic legislation will put victims and witnesses at the heart of a modern and fair justice system. \"By changing culture, process and practice across the system, it will help to ensure victims are heard, supported, protected and treated with compassion, while the rights of the accused will continue to be safeguarded. \"This legislation, which builds on progress in recent years, has been shaped by the voices of victims, survivors, their families and support organisations, and it is testimony to their tireless efforts to campaign for further improvement. \n                  Human remains found in Loch Lomond identified as missing man as police probe 'unexplained death'\n                 \n                  Edinburgh charity worker embezzled nearly £30,000 from vulnerable and disabled victims\n                 \n                  Scottish council begins legal action to evict 'African tribe' from new campsite\n                 \"I am grateful to those who bravely shared their experiences to inform the development of this legislation and pave a better, more compassionate path for others.\" Currently, juries in Scotland have three verdicts open to them when considering the evidence after a trial, and can find an accused person either guilty or not guilty, or that the case against them is not proven. Like not guilty, the centuries-old not proven verdict results in an accused person being acquitted. Critics have argued it can stigmatise a defendant by appearing not to clear them, while failing to provide closure for the alleged victim. Notable cases which resulted in a not proven verdict include Sir Hugh Campbell and Sir George Campbell, who were tried for high treason in 1684 for being present at the Battle of Bothwell Bridge. The murder of Amanda Duffy, 19, in South Lanarkshire in 1992 sparked a national conversation around the existence of the not proven verdict and double jeopardy rules. Suspect Francis Auld stood trial but the case was found not proven by a jury and an attempt to secure a retrial failed in 2016. Auld died the following year. In 2018, a sexual assault case against former television presenter John Leslie was found not proven. And in 2020, former first minister Alex Salmond was found not guilty on 12 sexual assault charges, while one charge of sexual assault with intent to rape was found not proven. Victim Support Scotland (VSS) had earlier urged MSPs to put aside party politics and vote \"for the intention of the bill\". Kate Wallace, chief executive of VSS, believes the act is a \"solid foundation\" on which to build further improvements. She added: \"The passing of this act represents a momentous occasion for Scotland's criminal justice system. \"It marks a significant step towards creating a system that considers and prioritises the needs of people impacted by crime.\" VSS worked with the families of Arlene Fraser and Suzanne Pilley to spearhead Suzanne's Law. Ms Fraser was murdered by estranged husband Nat Fraser in 1998, while Ms Pilley was killed by David Gilroy in 2010. To date, the women's bodies have never been recovered. Before the bill, parole board rules dictated that a killer's refusal to disclose the information \"may\" be taken into account. The new legislation means parole boards \"must\" take the refusal to cooperate into account. Carol Gillies, sister of Ms Fraser, and Gail Fairgrieve, sister of Ms Pilley said: \"We have done everything possible to make this change to parole in memory of Arlene and Suzanne, and for other people who have lost their lives in such a horrific way. \"For our families, the passing of this act and the change to parole are momentous.\" Read more from Sky News:Why next year's Scottish elections could get messy The Scottish Conservatives and Scottish Labour voted against the bill. Although in support of the abolition of the not proven verdict, the Scottish Tories said they had been left with no alternative but to oppose the bill after the SNP rejected a series of amendments. The party had called for a Scotland-only grooming gangs inquiry; wanted victims to be told if a decision was taken not to prosecute an accused; and for all victims to be informed if a plea deal was struck between defence and prosecution lawyers. They also wanted Suzanne's Law to be strengthened, which would have compelled killers to reveal the location of their victim's body or risk having their parole rejected - ensuring \"no body, no release\". MSP Liam Kerr, shadow justice secretary, said: \"This half-baked bill sells the victims of crime desperately short. \"By ignoring many of the key demands of victims' groups, the SNP have squandered the chance for a long overdue rebalancing of Scotland's justice system. \"The Scottish Conservatives' common sense amendments would have given this legislation real teeth but, by rejecting them, the nationalists have delivered a victims' bill in name only. \"While we back the abolition of the not proven verdict, the SNP's intransigence on a number of key issues meant we could not support this bill in its final form.\""
    },
    {
        "title": "In pictures: Donald Trump given royal welcome as UK state visit begins",
        "description": "Donald Trump has kicked off his second state visit to the UK with a royal greeting, carriage procession and gun salute.",
        "url": "https://news.sky.com/story/in-pictures-donald-trump-given-royal-welcome-as-uk-state-visit-begins-13432635",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-wales-princess-prince_7023367.jpg?20250917202858",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-17 09:52:00",
        "Headline": "Donald Trump and First Lady Melania Trump touched down in Windsor, marking the beginning of the US president's second state visit to the UK.",
        "Content": " Donald Trump has kicked off his second state visit to the UK with a royal greeting, carriage procession and gun salute. As the US president and the First Lady Melania Trump touched down in a rainy Windsor, they were greeted by Prince William and Kate, before meeting King Charles and Queen Camilla. Follow Trump state visit live The national anthems of the UK and US were then played as a carriage procession carried the Trumps and the King and Queen towards Windsor Castle. Here, Mr Trump inspected the Guard of Honour before heading inside the castle. Tonight, a grand state banquet will be held in honour of the US president, where both the King and Mr Trump are expected to give speeches. Read more:Who's who at Trump's second state banquetGifts exchanged between the King and Donald TrumpTrump state visit is all about deals to turn around UK economy"
    },
    {
        "title": "Home Office to appeal temporary block on man's deportation under 'one in, one out' plan",
        "description": "The Home Office will appeal against the High Court's decision to temporarily block the deportation of an Eritrean man to France under the government's \"one in, one out\" scheme, Shabana Mahmood has confirmed.\n",
        "url": "https://news.sky.com/story/home-office-to-appeal-temporary-block-on-mans-deportation-13432899",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-small-boats-starmer_6989917.png?20250813164711",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-17 16:23:00",
        "Headline": "Shabana Mahmood has vowed to \"fight\" attempts to block the first deportation flight under the UK-France returns deal.",
        "Content": "The Home Office will appeal against the High Court's decision to temporarily block the deportation of an Eritrean man to France under the government's \"one in, one out\" scheme, Shabana Mahmood has confirmed.\n Speaking for the first time since the court's decision on Tuesday, the new home secretary said: \"Last minute attempts to frustrate a removal are intolerable, and I will fight them at every step.\" Ms Mahmood added that she will \"fight to end vexatious, last-minute claims\" and \"robustly defend the British public's priorities\". Yesterday evening, the High Court granted an Eritrean man, who cannot be named for legal reasons, a \"short period of interim relief\" ahead of his deportation to France scheduled for a 9am flight this morning. Lawyers acting on the man's behalf said the case \"concerns a trafficking claim\" and her client, who alleges he has a gunshot wound in his leg, claims he is vulnerable and faces a risk of \"destitution\" in France. The Home Office defended the case, saying it was reasonable to expect the man to claim asylum in France. Mr Justice Sheldon ruled that while there did not appear to be a \"real risk\" the man would be destitute in France, the trafficking claim required further interrogation. \n                  Sadiq Khan calls out Gaza 'genocide', as Starmer 'delays' recognising Palestinian state until end of Trump's state visit\n                 \n                  Starmer-Trump talks could be landmark moment - and join pantheon of UK-US summits\n                 \n                  Radical overhaul of how schools support special needs students demanded by MPs\n                 The man would have been the first person to be returned to France under the terms of the UK-France deal, which was signed in July and led to the first people being detained after crossing the Channel in August. In a statement, Ms Mahmood added: \"Migrants suddenly deciding they are a modern slave on the eve of their removal, having never made such a claim before, make a mockery of our laws and this country's generosity. \"I will do whatever it takes to secure our border.\" She has also announced she will review the Modern Slavery Act to see where it is currently open to misuse.  The Home Office has confirmed the temporary block on the man's deportation will be challenged in the courts, and that lawyers acting for the man have 14 days to provide proof for their claim that he has been trafficked to the UK. It also insisted that the first deportation flight under the UK-France migrants returns deal will still take place this week. Conservative Party leader Kemi Badenoch was quick to criticise the government over the ruling on Tuesday, saying: \"We told you so\". Responding to Ms Mahmood's comments, the Tories' Chris Philp said the home secretary \"is reacting in panic to the collapse of her gimmick returns deal\". The shadow home secretary added: \"No one is fooled by tough talk from Labour. They will never do the hard work needed to tackle the lawfare that blocks removals. \"The truth is, Labour is run by human rights lawyers - Keir Starmer and Lord Hermer - who have always sided with open borders activists over security and control.\" Mr Philp added that the \"weak government will continue to preside over borders chaos\". Reform UK has repeatedly criticised the policy and has also hit back at the home secretary following her statement. Zia Yusuf, the party's head of policy, said: \"These are empty words from a home secretary who is out of her depth. \"Without a total legal reset, including leaving the ECHR [European Convention on Human Rights] and disapplying international treaties like the 1951 Refugee Convention, activist lawyers will continue abusing the legal system to prevent deportations.\" What is the scheme? The pilot scheme was announced to much fanfare in July, after French President Emmanuel Macron made a state visit to the UK. Sir Keir Starmer had hoped the agreement - which would see the UK send asylum seekers who have crossed the Channel back to France in exchange for legal migrants with links to Britain - would prove more resilient to court challenges than the Tories' Rwanda plan. He wants the number of migrants being returned to France to gradually increase over the course of the scheme, to deter them from coming in small boats. The pilot came into force last month and is in place until June 2026."
    },
    {
        "title": "Speeding motorcyclist jailed for killing 86-year-old man on pedestrian crossing",
        "description": "A speeding motorcyclist has been jailed for 21 months after killing an 86-year-old man on a pedestrian crossing.",
        "url": "https://news.sky.com/story/speeding-motorcyclist-jailed-for-killing-86-year-old-man-on-pedestrian-crossing-13432854",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-croydon-road-bromley-kent_7023214.jpg?20250917173343",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-17 15:36:00",
        "Headline": "The defendant, who was doing up to 64mph in a 40mph zone, showed a \"clear disregard for the rules of the road\"",
        "Content": "A speeding motorcyclist has been jailed for 21 months after killing an 86-year-old man on a pedestrian crossing. Daniel Redpath, 25, was riding a rare classic Aprilia RX 125 off-road bike when he hit Kunwar Singh on the eastbound lane of the Croydon Road in Bromley, Kent, on 18 April 2023. The defendant was travelling at up to 64mph (103kmh) on the busy residential street where the speed limit was 40mph (64kmh), the Old Bailey heard. Donald Trump state visit - latest Mr Singh, a married father-of-two, would have been killed almost immediately on impact, the court was told. Passers-by rushed to help but he was pronounced dead at the scene at 3.28pm. Redpath denied he was driving dangerously but admitted the lesser offences of causing death by careless driving and driving otherwise than in accordance with a licence. \n                  Woman shot by husband on Valentine's Day after trying to escape relationship\n                 \n                  Three men jailed for drugging and raping 12-year-old girl in Kent\n                 \n                  Woman dies after small boat rescue operation in English Channel\n                 Judge Richard Marks KC said on Wednesday that Redpath showed a \"clear disregard for the rules of the road\" as he jailed him for 21 months and gave him a three-year driving ban after he is released. Praising the \"heart-rending\" victim impact statements given by Mr Singh's son and daughter, the judge said it was clear their father was \"hugely loved and respected\". Mr Singh died just days before his golden wedding anniversary and his 80-year-old widow died in \"heartbreak at the loss of her husband\", Mr Marks added. Redpath only had a provisional driving licence at the time of the crash and was not displaying L plates on the front of his bike. His full licence had been revoked after he accrued six penalty points within the first two years of qualifying. There were no indicators or mirrors on the bike, whose rear tyre was unsuitable for use on the highway, the court heard. Just before the crash, Redpath had overtaken a transit tipper and was travelling at speeds of between 48mph and 64mph, jurors heard. Read more on Sky News:Appeal over one in, one out schemeHatton 'in good place' - familyDangerous fake dolls seized It wasn't clear if Mr Singh, who was part-way across the crossing, had seen the approaching motorbike before he was hit and knocked to the ground, prosecutor Anna Pope said. Redpath told police at the scene he had seen Mr Singh but thought he would stop and wait for him to pass, but instead walked out without looking. Redpath had a previous conviction for driving whilst disqualified, along with a number of endorsements on his licence. In mitigation, Jade Gambrill said the defendant had shown \"significant remorse\" and suffered from flashbacks and feelings of self-harm."
    },
    {
        "title": "Madeleine McCann suspect Christian B celebrates release from prison with burger and cigarette",
        "description": "The suspect in the Madeleine McCann case celebrated his release from prison with a fast-food breakfast of chicken nuggets and a burger.",
        "url": "https://news.sky.com/story/madeleine-mccann-suspect-christian-b-celebrates-release-from-prison-with-burger-and-cigarette-13432947",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-christian-b-madeleine-mcann_7023063.jpg?20250917153032",
        "type": "World",
        "Author": "Martin Brunt",
        "Date Published": "2025-09-17 17:49:00",
        "Headline": "It's not known where Christian B was headed after he stopped briefly at a McDonald's restaurant, but he's been fitted with an electronic ankle tag, has had to surrender his passport and register a permanent address as part of his release conditions.",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n  The suspect in the Madeleine McCann case celebrated his release from prison with a fast-food breakfast of chicken nuggets and a burger. Christian B, 49, was smuggled from a jail near Hanover, hidden in the back of his lawyer's car and managed to avoid being filmed or pictured by scores of camera operators who had been waiting for several days. But a photographer caught up with him as he stopped briefly at a McDonald's restaurant. Read more: Madeleine McCann suspect released after serving rape sentence Christian B, who cannot be fully identified under German privacy laws, stood outside and smoked a cigarette before eating his food. Dressed in a lilac shirt, beige trousers and trainers, he ordered chicken nuggets with sweet-and-sour sauce, a burger and a hot drink. He wore sunglasses, but they did little to disguise the distinctive features that have appeared on TV and on the front of newspapers around the world. \n                  Madeleine McCann suspect Christian B released after serving rape sentence\n                 \n                  Prime suspect in Madeleine McCann case slapped with strict conditions ahead of jail release\n                 \n                  What we know about Christian B -  the prime suspect in Madeleine McCann's disappearance\n                 After 15 minutes, he left the restaurant as police blocked the street to allow him to leave freely. He was driven off again in the black Audi saloon in which his lawyer Friedrich Fulscher had collected him an hour earlier from Sehnde prison. It's not known where Christian B was headed after completing an unrelated sentence for the rape of an elderly woman, or who will help him adjust to his new life of freedom. As part of his release conditions, he's been fitted with an electronic ankle tag, has had to surrender his passport and register his permanent address with probation officers. Another of his lawyers, Philipp Marquort, said: \"This is an attempt by the public prosecutor's office to keep him in a kind of pre-trial detention where they would have access to him at any time. We will not accept that.\" German prosecutor Hans Christian Wolters, who leads the Madeleine investigation, believes Christian B abducted and murdered the three-year-old during a family holiday in Portugal in 2007. The suspect, who has convictions for child sex abuse, theft, drug trafficking and forgery, denies any involvement. Explainer: The chequered history of Christian B  Madeleine vanished from her bed in a rented apartment as her parents and their friends dined nearby at the hotel complex in Praia da Luz. Mr Wolters told Sky News he had \"almost\" enough evidence to charge the suspect, but could not justify arresting him and stopping him from being freed. He said: \"He is dangerous, a psychopath, and we hope he does not commit more crimes, but it is likely he will.\" He said he hadn't ruled out the chance of charging Christian B: \"At the moment, we still have lines of investigation we are pursuing, and we hope we may gain more evidence or indications. \"If that happens, our situation would of course improve, and we would prefer to go to court with that stronger position.\" Christian B, who flitted between Germany and Portugal, has served seven years for the rape of a 72-year-old American woman in Praia da Luz - two years before Madeleine vanished. He is expected to appear in a German court next month to face a charge of using insulting behaviour towards a female prison warder. A conviction could put him back in jail. He also faces a possible retrial after the prosecutor's appeal against his acquittal last year on unrelated rape and child sex allegations. Scotland Yard detectives, who failed to charge anyone in their own investigation, revealed this week they had asked Christian B to answer their questions, but he refused, as he has with their German and Portuguese colleagues. His lawyers dismissed it as an illegal request because investigators had shared none of the prosecution files with him. According to the prosecutor, the evidence against Christian B in the Madeleine case is circumstantial; his mobile phone was nearby her apartment at the time she vanished, he was a convicted child sex abuser, he had allegedly confessed to a friend, and he had re-registered his car the day after. There is no forensic evidence to link the suspect to the abduction - and after 18 years, the chances of finding it must be remote. Read more from Martin Brunt:I was reporting during 7/7 bombings - here's what happenedSky News tracks down woman in hit-and-run Maddie theoryOfficers describe confronting 'coward' Southport killer  German criminal profiler Mark T Hofmann told Sky News: \"I'm a big believer in second chances, but I'm not that much of a big believer in tenth chances. \"So if you commit a crime, and you do it again and again and again and again, then you need to ask yourself like, why should we believe that he will stop now? \"I wish, and I hope that also he realises that he can maybe now live a different life anonymously in some place, and hopefully stop committing crimes.\" Madeleine's parents Kate and Gerry McCann, from Leicestershire, cling to the hope their daughter might still be found alive, in the absence of any evidence they are aware of to show she is dead."
    },
    {
        "title": "'At least 16' killed in latest Israeli attacks on Gaza - as 10 children arrive in UK for NHS treatment",
        "description": "At least 16 people are said to have died overnight in Israeli attacks in Gaza - as the first group of 10 children arrived in the UK for urgent NHS treatment.",
        "url": "https://news.sky.com/story/at-least-16-killed-in-latest-israeli-attacks-on-gaza-as-10-children-arrive-in-uk-for-nhs-treatment-13432634",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gaza-israeli-strike_7022688.jpg?20250917084551",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-17 09:49:00",
        "Headline": "A coalition of aid groups urges the international community to do more to stop Israel's attacks, which it says have caused \"an unprecedented humanitarian catastrophe\".",
        "Content": "At least 16 people are said to have died overnight in Israeli attacks in Gaza - as the first group of 10 children arrived in the UK for urgent NHS treatment. Officials said more than half of those killed in the latest attacks were in Gaza City, where Israel this week began a major ground offensive. A mother and her child died at an apartment in the city's Shati refugee camp, according to the Shifa hospital.  The al-Adwa and Nasser hospitals said other victims included a pregnant woman - among three killed when a house was hit in the Nuseirat refugee camp in central Gaza - and two parents and their child in the Muwasi area west of Khan Younis. The Israel Defence Forces (IDF) launched its ground assault on Tuesday, in what it called a \"new phase\" in its bid to destroy Hamas and force the release of the remaining hostages. It said it was looking into the deaths caused by the latest strikes. Troops and tanks continued to push deeper into Gaza City on Wednesday despite widespread condemnation of the attempt to take full control of the city. \n                  Pressure mounts on PM to raise Israel's Gaza offensive with Trump\n                 \n                  Thousands of families remain in Gaza City as Israeli army advances\n                 \n                  Netanyahu refuses to rule out further strikes on Hamas leaders abroad\n                 UK Foreign Secretary Yvette Cooper has called the operation \"utterly reckless and appalling\". Ms Cooper - who last night helped greet the pro-Israel President Trump - said it would \"only bring more bloodshed, kill more innocent civilians & endanger the remaining hostages\".  Meanwhile, 10 critically ill and injured children from Gaza have arrived in Britain for medical care alongside 50 companions, the World Health Organisation said on Wednesday. It said they were first evacuated to Jordan and that \"robust\" security checks were undertaken before the group got approval to travel.The foreign secretary said the children were \"unable to get the medical care they need to survive\" in Gaza. More are expected to arrive in the coming weeks, in what Health Secretary Wes Streeting said \"reflects the very best of our NHS values - compassion, care and expertise when it matters most\". A small number of children were previously brought to the UK and are being treated privately through the Project Pure Hope initiative. It comes as a coalition of aid groups today urged the international community to do more to stop Israel's attacks, which it said had caused \"an unprecedented humanitarian catastrophe\". \"States must use every available political, economic, and legal tool at their disposal to intervene. Rhetoric and half measures are not enough. This moment demands decisive action,\" said a statement signed by the heads of more than 20 organisations working in Gaza. The call comes a day after a UN commission said Israel was committing genocide in Gaza - a claim the country vehemently denies as \"distorted and false\". Sky News analysis shows thousands of families remain in crowded tent camps in Gaza City, with the UN estimating last week that a million people remain there. Israel, however, believes 40% of the population has already fled south. Many are taking what little they can and attempting the perilous journey south after Israel warned them to evacuate ahead of it new offensive. Read more from Sky News:Madeleine McCann suspect released from prisonImages of Trump and Epstein projected on Windsor Castle The IDF said another route south for those fleeing would open from noon local time on Wednesday, running along Salah al-Din street along Gaza's coastline, for two days. Israel has not said how long its Gaza City operation will last, but that it will involve both air and ground forces and the number of soldiers will increase over the coming days. It insists it takes strenuous efforts to issue warnings and avoid civilian casualties, but that it's complicated by Hamas deliberately embedding itself in civilian areas. Health officials in Gaza say nearly 65,000 people have died in the two years of the war - a figure that does not specify the number of Hamas members killed. The terror attack on Israel in October 2023 killed around 1,200 and saw 251 taken hostage. Forty-eight remain in Gaza, but fewer then half are though to still be alive."
    },
    {
        "title": "Pressure mounts on PM to raise Israel's Gaza offensive with Trump",
        "description": "Sir Keir Starmer is under mounting pressure to raise Israel's bombardment of Gaza with Donald Trump during his UK state visit, after a UN Commission said a genocide was taking place.",
        "url": "https://news.sky.com/story/pressure-mounts-on-pm-to-raise-israels-gaza-offensive-with-trump-13432530",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gaza-palestinians-israeli_7021890.jpg?20250916093927",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-17 00:02:00",
        "Headline": "Israel is continuing to expand its offensive in Gaza City, despite Sky News analysis finding thousands of families remain there in camps of tents. ",
        "Content": " Sir Keir Starmer is under mounting pressure to raise Israel's bombardment of Gaza with Donald Trump during his UK state visit, after a UN Commission said a genocide was taking place. Liberal Democrat leader Sir Ed Davey used the president's arrival on Tuesday night to call for action on the escalating situation, as Israeli forces advance in Gaza City. Sky News analysis has found thousands of families remain in the city's crowded tent camps, despite a ground offensive beginning yesterday. Sir Ed, who is boycotting the state dinner being held for Mr Trump, said Sir Keir must \"press\" the president now. He said: \"What is happening in Gaza is a genocide. And the president of the United States, who wants a Nobel Peace Prize, is doing nothing to stop it.\" On Tuesday, a United Nations Commission agreed Israel was committing genocide in Gaza - the first time such an explosive allegation has been made publicly by a UN body. Israel's foreign ministry said it \"categorically rejects this distorted and false report\" and called for the commission to be abolished.  Reports suggest the situation will be a talking point between Sir Keir and Mr Trump during his visit. The calls to Sir Keir to press his US counterpart come before the UK is due to recognise a Palestinian state at the UN General Assembly later this month, along with allies including Canada and France. In a late night statement, Canada's foreign ministry described the Gaza City offensive as \"horrific\". 'We cannot be bystanders' Lib Dem leader Sir Ed added: \"We have long said that Hamas is genocidal and condemned them for their actions. \"Now, I think we have to say that what the Netanyahu government is doing amounts to genocide.\" Labour MP Rosena Allin-Khan, a former shadow minister, also called on her party leader to make discussing the situation in Gaza with Mr Trump a \"top priority\". Speaking to Sky News' Politics Hub With Sophy Ridge, she said: \"We say 'never again' when we look at Bosnia and Rwanda, but here we are again, and it's been livestreamed, and we've all seen it. \"We cannot be bystanders to a genocide.\"  It emerged on Tuesday that two of Ms Allin-Khan's colleagues, MPs Peter Prinsley and Simon Opher, were denied by Israel from entering the West Bank. They were part of a UK parliamentary delegation to observe medical and humanitarian work being carried out. They were also due to meet British diplomats in Jerusalem, as well as Palestinian and Israeli human rights organisations. But they were instead held in a passport office and presented with a \"legal form\" insisting they leave the country. UN report pulls no punches The accusation of genocide is made by the UN Independent International Commission of Inquiry on the Occupied Palestinian Territory. It alleges Israel has been \"killing Palestinians or forcing them to live in inhumane conditions that led to death; causing serious bodily or mental harm, including through torture, displacement and sexual crime; deliberately imposing inhumane conditions, and fourthly, imposing measures intending to prevent births\". Read more from Sky News:Zelenskyy makes demand of TrumpTrump sues New York Times Earlier this month, the International Association of Genocide Scholars also passed a resolution stating that Israel's conduct passed the threshold of committing genocide. However, a report from the British government said it had \"not concluded\" that Israel intended to \"destroy in whole or in part a national, ethnic, racial or religious group\". Nearly 65,000 people are now believed to have died, according to figures collated by Gaza's Hamas-run health ministry. It does not distinguish between civilians and combatants in its count."
    },
    {
        "title": "Rocks on train tracks leave 900 Machu Picchu tourists stranded due to protest",
        "description": "Hundreds of tourists have been left stranded near Peru's ancient Inca citadel of Machu Picchu after rail services were suspended because protesters blocked the route with rocks.",
        "url": "https://news.sky.com/story/rocks-on-train-tracks-leave-900-machu-picchu-tourists-stranded-due-to-protest-13432598",
        "image_url": "https://e3.365dm.com/22/07/1920x1080/skynews-machu-picchu-peru-inca-ruins_5820139.jpg?20220701122109",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-17 08:11:00",
        "Headline": "Rail services to the UNESCO World Heritage Site from the nearest town are suspended as a dispute between residents and authorities over a bus service escalates.",
        "Content": "Hundreds of tourists have been left stranded near Peru's ancient Inca citadel of Machu Picchu after rail services were suspended because protesters blocked the route with rocks. Tourism minister Desilu Leon told local radio that 1,400 tourists had been evacuated but around 900 remained stranded in Aguas Calientes, the closest town to the UNESCO World Heritage Site. Train operator PeruRail said services were suspended on Monday because train tracks in Peru's mountainous Cusco region had been blocked by \"rocks of various sizes\". It also said \"third parties\" had dug up part of the rail route, which had slowed evacuation operations. The protest by residents began last week after tourist bus operator Consettur's concession expired. The company ferries tourists from Aguas Calientes to the entrance of the tourist attraction. A neighbouring district commissioned another bus company to provide services in its place, but protesters in Aguas Calientes prevented it from operating. Protesters claim there is a lack of transparency and fairness in the process of replacing Consettur. New7Wonders, a campaign group which highlights global sites of major cultural heritage, has sent a letter to Peru's government warning that if the row - between residents, authorities and bus companies - escalates, Machu Picchu's global status could be affected. Tourism is key to Peru's economy. Read more from Sky News:Madeleine McCann suspect released from prisonTrump-Epstein images projected onto Windsor Castle Machu Picchu is visited by more than one million people a year. The number of tourists granted access to the iconic site, built in the 1400s, is capped at 5,600 a day in peak season, May to September."
    },
    {
        "title": "Irish police find human remains in search for Daniel Aruebose",
        "description": "The skeletal remains of a child have been found in the search for a boy who hasn't been seen for three years.",
        "url": "https://news.sky.com/story/irish-police-find-human-remains-in-search-for-daniel-aruebose-13432754",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-aruebose-daniel-ireland_7023006.jpg?20250917143716",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-17 13:28:00",
        "Headline": "The remains were found in Donabate, north of Dublin city. Daniel was last seen alive in 2022.",
        "Content": "The skeletal remains of a child have been found in the search for a boy who hasn't been seen for three years. Gardaí (Irish police) said they believe the remains are those of Daniel Aruebose, who was last seen in 2022 but never reported missing. He would be aged seven today. The remains were found on Wednesday during a search of open ground in Donabate, Co. Dublin, which officers began investigating a few weeks ago. It came after the Irish child and family agency, Tusla, raised concerns and alerted officers on 29 August. It's understood they have spoken to members of Daniel's family, who are abroad, as part of the investigation. in a statement, Gardai said that officers would \"investigate all of the circumstances\" of the boy's disappearance. Police had previously stated that Daniel was \"presumed dead\". Formal identification will now be done via DNA analysis. \n                  Bob Geldof reveals why he won't run for Irish presidency\n                 \n                  Conor McGregor announces he is withdrawing from Irish presidency race\n                 \n                  Ireland's deputy PM Simon Harris  condemns 'sinister' bomb threats against him and his family\n                 Officers said the boy was last known to be living at The Gallery Apartments in Donabate, about 10 miles (16km) north of central Dublin. They conducted a \"technical examination\" of a flat there on 31 August and are continuing house-to-house inquiries. Police are urging anyone who lived in The Gallery Apartments from July 2019 to the present to get in touch with Swords Garda Station or call a confidential hotline on 1800 666 111 - no matter how insignificant the information might seem. Ireland's minister for children, Norma Foley, said she was \"deeply saddened\" by the discovery of the remains. Read more:Madeleine McCann suspect Christian B released from prisonHatton 'in a good place' before death, says family Daniel's case comes a year after Tusla raised the alarm over another missing boy, Kryan Durnin, who was six when he was last seen in 2022. Two people have been arrested in that case but no charges have been filed. Although there is no suggestion that the two cases are connected, the apparent similarities in circumstances, with delays in reporting children as missing, have shocked many in Ireland."
    },
    {
        "title": "FBI director Kash Patel shouts at members of Congress for second day - as Democrats pile on questions about Jeffrey Epstein",
        "description": "The FBI director has shouted at a Democratic representative over questions about Jeffrey Epstein - the second day in a row he has clashed with members of Congress during a hearing.",
        "url": "https://news.sky.com/story/fbi-director-kash-patel-shouts-at-members-of-congress-for-second-day-as-democrats-pile-on-questions-about-jeffrey-epstein-13432914",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-kash-patel-fbi-washington_7023241.jpg?20250917180132",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-17 16:39:00",
        "Headline": "US President Donald Trump has denied any impropriety involving his relationship with deceased paedophile financier Epstein, who he once counted as a friend.",
        "Content": "The FBI director has shouted at a Democratic representative over questions about Jeffrey Epstein - the second day in a row he has clashed with members of Congress during a hearing. A day after facing the Senate for his first oversight meeting, Kash Patel attended the House Judiciary Committee's oversight hearing on the FBI with representatives from both parties. While Tuesday's hearing ranged in subjects, Democratic representatives repeatedly asked Mr Patel about the case involving Jeffrey Epstein on Wednesday. Follow the latest on Trump's state visit Representative Jamie Raskin, from Maryland, questioned the US intelligence director while displaying a birthday card, allegedly from Donald Trump, to the deceased paedophile financier. The US president has denied any impropriety involving Epstein, whom he once counted as a friend. He filed lawsuits against the Wall Street Journal in July, and against the New York Times earlier this week, over their reporting on his ties to Epstein. \n                  FBI director Kash Patel shouts at Democrat senators over Charlie Kirk and Jeffrey Epstein during oversight hearing\n                 \n                  Texas Governor threatens Democrats with arrest after politicians flee to block redistricting vote\n                 \n                  Is this pop star the left's answer to Trump?\n                 Kentucky representative Thomas Massie, a Republican who has been trying to force the release of Epstein-related files, also pressured Mr Patel on his comments to the Senate that there is no \"credible information\" that Epstein trafficked victims to anyone but himself. Shouting again broke out when Democrat Pramila Jayapal questioned Mr Patel over whether he believes Epstein's victims are credible. The representative from Washington asked the FBI director whether \"the victims of the Jeffrey Epstein horrific trafficking ring, are they credible?\" - which he sidestepped and said he would welcome new information on the case. Ms Jayapal then accused Mr Patel of not answering, to which he replied: \"I have. You just don't like the answer.\" \"We have routinely asked for people to come forward with more evidence, and we will look at it,\" he said. After a terse exchange, Ms Jayapal asked Mr Patel if he'd meet with the victims, and yelled: \"Are you going to continue to cover up for the rich and powerful men, including those that might be on this committee?\" Read more from Sky News:Charlie Kirk suspect appears in courtIn pictures: Trump's state visit so farWhat is the Hillsborough Law? During Tuesday's hearing, the FBI director clashed with Democrat Cory Booker over accusations he fired FBI agents out of retribution for political investigations. He then called senator Adam Schiff - who also asked about Epstein - \"the biggest fraud to ever sit in the United States Senate\". Mr Patel, a former lawyer who has been accused of spreading conspiracy theories, was controversially nominated to be the FBI director by Mr Trump last year. He was narrowly confirmed by the Senate in a 51-49 vote in February. Two Republicans voted against his nomination."
    },
    {
        "title": "Madeleine McCann suspect Christian B released after serving rape sentence",
        "description": "Convicted sex offender Christian B has been released from prison after a prosecutor failed to find enough evidence to charge him in the Madeleine McCann case.",
        "url": "https://news.sky.com/story/madeleine-mccann-suspect-christian-b-released-after-serving-rape-sentence-13432506",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-christian-b-court-madeleine_7022538.jpg?20250917063927",
        "type": "World",
        "Author": "Martin Brunt",
        "Date Published": "2025-09-17 07:26:00",
        "Headline": "The German drifter, who walked free at the end of an unrelated sentence for rape, has been fitted with an electronic ankle tag, surrendered his passport and given probation officers his permanent address.",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n  Convicted sex offender Christian B has been released from prison after a prosecutor failed to find enough evidence to charge him in the Madeleine McCann case. The German drifter, accused but not charged over the toddler's abduction, walked free at the end of an unrelated sentence for rape. Christian B, who cannot be fully identified under German privacy laws, was driven away from Sehnde prison near Hannover by his lawyer Friedrich Fulscher. As part of his release conditions, he's been fitted with an electronic ankle tag, has had to surrender his passport, and register his permanent address with probation officers. Another of his lawyers, Philipp Marquort, said: \"This is an attempt by the public prosecutor's office to keep him in a kind of pre-trial detention where they would have access to him at any time. We will not accept that.\" Mr Fulscher also criticised prosecutors for \"parrot-like repetition of slogans\" that they \"have the right man, he killed Maddie\". \"They keep fuelling this prejudgment. But they have provided no evidence that it is true,\" he added.  It was not known where Christian B was heading after his release, or who might help him adjust to a new life as the only currently known suspect in the world's most notorious unsolved child abduction mystery. Prosecutor Hans Christian Wolters, who leads the Madeleine investigation, believes Christian B, 49, abducted and murdered the three-year-old during a family holiday in Portugal in 2007. The suspect, who has convictions for child sex abuse, theft, drug trafficking and forgery, denies any involvement. Madeleine vanished from her bed in a rented apartment as her parents and their friends dined nearby at the hotel complex in Praia da Luz. Read more on Sky News:The chequered history of Christian BThe hit-and-run Madeleine theory 'A risk of reoffending' Mr Wolters told Sky News recently he had \"almost\" enough evidence to charge the suspect, but could not justify arresting him and stopping him from being freed. He said: \"We do consider him very dangerous and assume there is a risk of reoffending.\" He said he had not ruled out the chance of charging Christian B: \"At the moment, we still have lines of investigation we are pursuing, and we hope we may gain more evidence or indications. \"If that happens, our situation would, of course, improve, and we would prefer to go to court with that stronger position.\" Rape conviction Christian B, who flitted between Germany and Portugal, has served seven years for the rape of a 72-year-old American woman in Praia da Luz two years before Madeleine vanished. He is expected to appear in a German court next month to face a charge of using insulting behaviour towards a female prison warder. A conviction could put him back in jail. He also faces a possible retrial after the prosecutor's appeal against his acquittal last year on unrelated rape and child sex allegations. Scotland Yard detectives, who failed to charge anyone in their own investigation, revealed this week they had \"asked Christian B to answer their questions, but he refused, as he has with their German and Portuguese colleagues. His lawyers dismissed it as an illegal request because investigators had shared none of the prosecution files with him. 'Why should we believe he will stop?' According to the prosecutor, the evidence against Christian B in the Madeleine case is circumstantial; his mobile phone was nearby her apartment at the time she vanished, he was a convicted child sex abuser, he had allegedly confessed to a friend, and he had re-registered his car the day after. There is no forensic evidence to link the suspect to the abduction, and after 18 years, the chances of finding it must be remote. German crime analyst Mark T Hofmann told Sky News: \"I'm a big believer in second chances, but I'm not that much of a big believer in 10th chances. So if you commit a crime, and you do it again and again and again and again, then you need to ask yourself, 'why should we believe that he will stop now?' \"I wish, and I hope, that also he realises that he can maybe now live a different life anonymously in some place and hopefully stop committing crimes.\" Madeleine's parents, Kate and Gerry McCann, from Leicestershire, cling to the hope their daughter might still be found alive, in the absence of any evidence they are aware of to show she is dead."
    },
    {
        "title": "Lab tests show Alexei Navalny was poisoned in Russian jail, his widow says",
        "description": "The widow of Russian opposition leader Alexei Navalny has said two independent laboratory tests on biological samples taken from her late husband show he was poisoned before his death.",
        "url": "https://news.sky.com/story/lab-tests-show-alexei-navalny-was-poisoned-in-russian-jail-his-widow-says-13432681",
        "image_url": "https://e3.365dm.com/21/04/1920x1080/skynews-alexei-navalny-russia_5332279.jpg?20210406185110",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-17 10:55:00",
        "Headline": "Alexei Navalny's widow called for the laboratory results to be published, adding \"we have the right to know\" how her husband died at a Russian jail in February 2024.",
        "Content": "The widow of Russian opposition leader Alexei Navalny has said two independent laboratory tests on biological samples taken from her late husband show he was poisoned before his death. In a video statement released on Wednesday, Yulia Navalnaya said foreign laboratories had carried out tests \"independently of each other\" - and repeated previous claims that Russian President Vladimir Putin was involved in her husband's death. She said: \"These labs in two different countries reached the same conclusion - Alexei was killed. More specifically, he was poisoned.\" Ms Navalnaya said the tests took place after \"we were able to obtain samples of Alexei's biological material and securely smuggle them abroad\" in February 2024.  She called for the labs which conducted the tests to \"publish their results\" and reveal what she called the \"inconvenient truth\". No further details were given about the tests. Ms Navalnaya said: \"Alexei was my husband. He was my friend. He was a symbol of hope for our country. Putin killed that hope. We have the right to know how he did it. \"Stop pandering to Putin on account of so-called higher considerations. While you remain silent, he does not stop.\" She opened the video by saying her husband - an outspoken critic against Mr Putin - \"died in a penal colony beyond the Arctic Circle\" and had been transferred to the \"closed off place\" two months before his death. \"All he had was six square metres of space, a cup, a toothbrush and a bed fixed to the wall during the day so it's not possible to lie on it,\" she said. Ms Navalnaya added: \"It was in this punishment cell that they killed him.\"  Mr Navalny, 47, died on 16 February 2024 in a Russian jail. The federal prison service said he had become unwell after a walk. When asked about Ms Navalnaya's remarks on Wednesday, Kremlin spokesman Dmitry Peskov said: \"I don't know anything about these statements of hers, and I can't say anything.\" Read more from Sky News:How Putin could target the UK's power cables Arrests after Trump-Epstein images projected onto castle  Mr Navalny voluntarily returned to Russia in 2021 from Germany, where he underwent treatment for what Western laboratory tests showed was an attempt to poison him with a nerve agent in Siberia. He was arrested on arrival and was serving sentences on fraud, extremism and other charges that he said were trumped up to silence him."
    },
    {
        "title": "Trump hails 'highest honour of my life' at state banquet - as King references trade, Ukraine and environment",
        "description": "Donald Trump said being the first US president to enjoy a second British state visit was \"one of the highest honours of my life\", as he wined and dined with royalty at Windsor Castle.",
        "url": "https://news.sky.com/story/king-references-trade-ukraine-and-environmentalism-beside-trump-during-state-banquet-speech-13433022",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-king-charles_7023442.jpg?20250917211237",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-17 19:43:00",
        "Headline": "Earlier today, Donald Trump and King Charles watched on as a military parade - replete with a Red Arrows flyover - was held at Windsor Castle.",
        "Content": " Donald Trump said being the first US president to enjoy a second British state visit was \"one of the highest honours of my life\", as he wined and dined with royalty at Windsor Castle. Wednesday evening's state banquet came after a day full of pomp and pageantry for Mr Trump, who was treated to a carriage procession, military parade, and plenty more lavish treatment. Trump's state banquet as it happened Suited and booted for the banquet to bring the day to a close, sat between the King and Princess of Wales, the president thanked the monarch and Queen for their \"extraordinary graciousness\". Mr Trump said it was a \"singular privilege\" to be the first American president to be granted a second state banquet, adding: \"This is truly one of the highest honours of my life, such respect for you and such respect for your country.\" He suggested it might be the last time it happens, adding \"I hope it is actually\" to laughter. Mr Trump's speech at the banquet followed one from the King, who referenced trade, Ukraine, and environmentalism. The monarch said the UK and US \"fought together to defeat the forces of tyranny\" during the First and Second World War, and added: \"Today, as tyranny once again threatens Europe, we and our allies stand together in support of Ukraine to deter aggression and secure peace.\" He mentioned trade between the two countries early in the speech, saying: \"Today, our alliance spans every field of endeavour and shows vast potential for growth. \"The United Kingdom was your partner in the first trade deal of your administration, Mr President, bringing jobs and growth to both our countries. \"And no doubt we can go even further as we build this new era of our partnership.\"  The King also referenced the environment and said that \"in striving for a better world, we also have a precious opportunity to safeguard and to restore the wonders and beauty of nature for the generations who follow us\". And in more lighthearted comments, the monarch said that \"I cannot help but wonder what our forefathers from 1776 would make of our friendship\" to audible laughter from the president. Red Arrows, tech giants and French menu The dinner capped off Mr Trump's first day of his state visit to the UK, with the US president joining King Charles to watch a military parade - replete with a Red Arrows flyover - held at Windsor Castle. More from Sky News:Trump's visit in picturesWho's who at state banquet  He and first lady Melania Trump also paid tribute to the late Queen Elizabeth II at St George's Chapel, where they laid a wreath at her tomb. The banquet had 160 attendees, including the Prince and Princess of Wales, Sir Keir Starmer, and a long list of American technology CEOs - including Apple's Tim Cook, OpenAI's Sam Altman, and Microsoft's Satya Nadella. The Silicon Valley executives are in the country as the UK and US announce a landmark technology deal worth billions of pounds. Sir Keir, meanwhile, has his focus set on talks with Mr Trump at his Chequers country retreat on Thursday. Photos from Windsor Castle ahead of the banquet showed a lavish arrangement - with a menu in French as has been tradition since the Norman conquests of the 11th century. International affairs editor Trump state visit II has so far been like The Truman Show.  A lavish production and spectacle revolving around just one man, while outside the set of Windsor Castle, beyond the big walls put up to fence it in, the world goes on. The question is - has it been worth all the enormous effort and expense? Click here to read more UK-US bond 'unbreakable', says Trump On the relationship between the UK and US, Mr Trump said that \"seen from American eyes, the word special does not begin to do it justice,\" before adding: \"We're like two notes in one chord or two verses of the same prose. \"Each beautiful on its own, but really meant to be played together. The bond of kinship and identity between America and the United Kingdom is priceless and eternal. \"It's irreplaceable and unbreakable.\" He then made a reference to former US president Joe Biden, saying: \"We had a very sick country one year ago, and today I believe we're the hottest country anywhere in the world.\" Mr Trump also told the King he had raised \"a remarkable son\" in Prince William before saying: \"Melania and I are delighted to visit again with Prince William and to see Her Royal Highness Princess Catherine so radiant and so healthy, so beautiful.\""
    },
    {
        "title": "Starmer-Trump talks could be landmark moment - and join pantheon of UK-US summits",
        "description": "In years to come, it may become known simply as Chequers '25.",
        "url": "https://news.sky.com/story/starmer-trump-talks-could-be-landmark-moment-and-join-pantheon-of-uk-us-summits-13433006",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-state-visit-donald-trump_7023394.png?20250917204535",
        "type": "US",
        "Author": "Jon Craig",
        "Date Published": "2025-09-17 19:18:00",
        "Headline": "Sir Keir Starmer is set to meet Donald Trump today for what could be a monumental moment. But what does history tell us about past meetings, and what can the PM learn?",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  In years to come, it may become known simply as Chequers '25. But today's summit between Sir Keir Starmer and Donald Trump, at the prime minister's country retreat, has the potential to be a landmark moment in UK-US history. There's plenty of scope for it to go horribly wrong, of course: over Jeffrey Epstein, Sir Keir's pledge to recognise Palestine, the president's lukewarm support for Ukraine, the Chagos Islands sell-off, or free speech. Trump state visit live - read the latest  But on the other hand, it could be a triumph for the so-called \"special relationship\" - as well as relations between these two unlikely allies - with deals on trade and tariffs and an improbably blossoming bromance. Either way, this Chequers summit - on the president's historic second state visit to the UK - could turn out to be one of the most notable one-to-one meetings between PM and president in 20th and 21st century history. Sir Keir and Mr Trump have already met several times, most recently at The Donald's golf courses in Scotland in late July and, before that, memorably at the White House in February. It was then that the PM theatrically pulled King Charles's invitation for this week's visit out of his inside pocket in a spectacular stunt surely masterminded by the \"Prince of Darkness\", spin doctor-turned-ambassador (until last week, anyway) Peter Mandelson. And over the years, there have been some remarkable and historic meetings and relationships, good and bad, between UK prime ministers and American presidents. From Churchill and Roosevelt to Eden and Eisenhower, from Macmillan and JFK to Wilson and Johnson, from Thatcher and Reagan, to Blair and Bush, and from Cameron and Obama… to Starmer and Trump, perhaps?  A brief history of relationships between PMs and presidents Throughout UK-US history, there have been many examples of a good relationship and close bond between a Labour prime minister and a Republican president. And vice versa. Also, it has not always been rosy between prime ministers and presidents of the two sister parties. There have been big fallings out: over Suez, Vietnam and the Caribbean island of Grenada. Leading up to this Chequers summit, the omens have not been good. First, the PM was forced to sack his vital link between Downing Street and the Oval Office, Lord Mandelson, over his friendship with Epstein.  Second, the president arrived in the UK to a barrage of criticism from London Mayor Sir Sadiq Khan, who accused him of doing more than anyone else to encourage the intolerant far right across the globe. And third, in a video-link to the 'Unite the Kingdom' march in London last weekend, one-time Trump ally Elon Musk called for a dissolution of parliament and a change of government and appeared to encourage violent protest. Churchill and FDR Back in the mid-20th century, the godfather of the \"special relationship\" was wartime leader Sir Winston Churchill, though it was 1946 before he first coined the phrase in a speech in the US, in which he also spoke of the \"iron curtain\". It was in 1941 that Churchill held one of the most significant meetings with a US president, Franklin D Roosevelt, at a Washington conference to plot the defeat of Germany after Japan's attack on Pearl Harbour. Churchill arrived in Washington in December after a rough 10-day voyage on a Royal Navy battleship and stayed three weeks, spending Christmas in the White House and on Boxing Day becoming the first UK PM to address Congress. The close bond between Churchill and Roosevelt was described as a friendship that saved the world. It was even claimed one reason the pair got on famously was that they were both renowned cigar smokers. Churchill and Truman After the war ended, Churchill's \"special relationship\" speech, describing the alliance between the UK and US, was delivered at Westminster College, in Fulton, Missouri in March 1946. The speech was introduced by President Harry Truman, a Democrat, with whom Churchill had attended the Potsdam Conference in 1945 to negotiate the terms of ending the war. These two were also close friends and would write handwritten letters to each other and address one another as Harry and Winston. Mr Truman was also the only US president to visit Churchill at Chartwell, his family home. Eden and Eisenhower But the transatlantic cosiness came to an abrupt end in the 1950s, when Churchill's Conservative successor Anthony Eden fell out badly with the Republican president Dwight Eisenhower over the Suez Crisis. Mr Eden did visit Mr Eisenhower in Washington in January 1956, and the official record of the meeting describes the discussion as focussing on \"policy differences and Cold War problems\". Macmillan and JFK But in the early 1960s, a Conservative prime minister and a Democrat president with seemingly nothing in common, the stuffy and diffident Harold Macmillan, and the charismatic John F Kennedy, repaired the damage. They were credited with rescuing the special relationship after the rupture of the Suez Crisis, at a time of high tensions around the world: the Berlin Wall, the Cuban missile crisis, and the threat of nuclear weapons. The two leaders exchanged handwritten notes, as well as Christmas and birthday cards. The Macmillans visited the Kennedys twice at the White House, in 1961 and 1962 - the second described in the US as a \"momentous\" meeting on the Cuban crisis. The relationship was abruptly cut short in 1963 by \"Supermac's\" demise prompted by the Profumo scandal, and JFK's assassination in Dallas. But after her husband's death, Jacqueline Kennedy was said to have had a father-daughter relationship with Macmillan, who was said to have been enchanted with her. Wilson and LBJ  After JFK, the so-called \"special relationship\" cooled once again - and under a Labour prime minister and Democrat president - when Harold Wilson rejected pressure from Lyndon B Johnson to send British troops to Vietnam. Mr Wilson became prime minister in 1964, just two months after LBJ sent US troops. His first overseas trip was to the White House, in December 1964, and the PM returned to tell his cabinet: \"Lyndon Johnson is begging me even to send a bagpipe band to Vietnam.\" Thatcher and Reagan And even though Margaret Thatcher and Ronald Reagan were ideological soulmates, Thatcher was furious when she wasn't consulted before the Americans invaded Grenada in 1983 to topple a Marxist regime. Even worse, according to Mrs Thatcher allies, a year earlier, Reagan had stayed neutral during the Falklands war. Reagan said he couldn't understand why two US allies were arguing over \"that little ice-cold bunch of land down there\". But their relationship didn't just survive, it flourished, including at one memorable visit to the presidential retreat at Camp David in 1984, where President Reagan famously drove Mrs T around in a golf buggy. They would also memorably dance together at White House balls. Blair and Bush  Camp David was also where in 2001 the Republican president George W Bush and Labour's Sir Tony Blair embarked on the defining mission of his premiership: the Iraq War. It was to prove to be an historic encounter. The war was the turning point of Sir Tony's decade in Number 10. He was branded a liar over claims about Saddam Hussein's \"weapons of mass destruction\", he was vilified by the Labour left, and it was the beginning of the end for him. And to add to the suspicion among Sir Tony's critics that he was Mr Bush's poodle, in 2006 at a G8 summit in St Petersburg - that wouldn't happen now - a rogue microphone picked up the president calling, \"Yo, Blair! How are you doing?\" Cameron and Obama Some years later, the Tory prime minister sometimes called the \"heir to Blair\", David Cameron, bonded over burgers with the Democrat president Barack Obama, serving a BBQ lunch to military families in the Downing Street garden. They also played golf at the exclusive Grove resort in 2016. They seemed unlikely allies: Obama, the first African-American president, and Cameron, the 19th old Etonian prime minister. It was claimed they had a \"transatlantic bromance\" in office. \"Yes, he sometimes calls me bro,\" Lord Cameron admitted. But not everything went well. The Tory PM persuaded Mr Obama to help the Remain campaign in the 2016 Brexit referendum, when he claimed the UK would be \"at the back of the queue\" on trade deals with the US, if it left the EU. It backfired, of course. Now it's Sir Keir Starmer's turn to tread a delicate and potentially hazardous political tightrope as he entertains the latest - and most unconventional - US president. The greatest dangers for Sir Keir will be a news conference in the afternoon, in the gardens, if the weather permits. Good luck, as they say, with that. Before then, there's the potential for what the Americans call a \"pool spray\", one of those impromptu, rambling and unpredictable Q&As we've seen so many times in the Oval Office. For Sir Keir, what could possibly go wrong? Chequers '25 could be memorable and notable, like so many previous meetings between a PM and a president. But not necessarily for the right reasons for this UK prime minister."
    },
    {
        "title": "Jimmy Kimmel's show pulled over comments about Charlie Kirk",
        "description": "US talk show host Jimmy Kimmel has had his programme pulled over \"offensive and insensitive\" comments about Charlie Kirk.",
        "url": "https://news.sky.com/story/jimmy-kimmels-show-pulled-over-comments-about-charlie-kirk-13433145",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel-talk-show_7023618.jpg?20250918001442",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-17 22:46:00",
        "Headline": "Donald Trump and Vice President JD Vance are among those to cite \"left-wing extremism\" as a factor in Charlie Kirk's killing - and Jimmy Kimmel used his show to call out perceived hypocrisy among MAGA supporters.",
        "Content": "US talk show host Jimmy Kimmel has had his programme pulled over \"offensive and insensitive\" comments about Charlie Kirk. Kimmel used his show on Monday night to accuse Donald Trump and his allies of \"doing their best to fan the flames\" following the conservative influencer's assassination last week. Disney-owned ABC said it would be taken off-air indefinitely - and with immediate effect - after network operator Nexstar said it would stop broadcasting the programme. Andrew Alford, president of Nexstar's broadcasting division, said it \"strongly objects\" to Kimmel's comments. \"Mr Kimmel's comments about the death of Mr Kirk are offensive and insensitive at a critical time in our national political discourse,\" he said, with the show to go off-air to \"let cooler heads prevail\". Mr Trump welcomed the news on Truth Social, writing \"congratulations to ABC\" and \"Kimmel has ZERO talent\". What happened? Kimmel called out what he believes is hypocrisy in how Republicans have responded to Mr Kirk's death. Mr Trump and Vice President JD Vance are among those to cite \"left-wing extremism\" as a factor in the killing. Suspected gunman Tyler Robinson appeared in court for the first time on Tuesday night. Prosecutors said he had shared negative views about Kirk, an influential media figure in the MAGA movement. Read more from Sky News:Trump enjoys lavish state banquetRobert Redford's grandchildren pay tribute  On the Monday edition of his show, Kimmel drew attention to Capitol rioters who \"wanted to hang\" Mr Trump's first term vice president, Mike Pence, for certifying Joe Biden's 2020 election win. \"Was that the liberal left? Or the toothless army who stormed the Capitol on January 6,\" said Kimmel. His remarks saw the chairman of the Federal Communications Commission, Trump backer Brendan Carr, threaten to \"take action\" against Disney and ABC. A representative for Kimmel did not immediately respond to a request for comment about the cancellation. Kimmel follows in Colbert's footsteps The abrupt removal of Jimmy Kimmel Live comes after fellow late night host Stephen Colbert saw his programme cancelled, which fans claimed was a result of his criticism of Mr Trump. Mr Trump presents himself as a staunch advocate of free speech, but regularly rails against media organisations which criticise him. This week he launched a lawsuit against The New York Times. CBS announced in July it would end The Late Show when its current series ends next May. In a statement, the network said the move was \"not related in any way to the show's performance, content or other matters happening at Paramount.\" Mr Trump praised the move, saying \"his talent was even worse than his ratings\". Colbert's Late Show won an Emmy for outstanding talk series for the first time at the weekend."
    },
    {
        "title": "What we can learn about Charlie Kirk suspect Tyler Robinson from his charging document",
        "description": "A charging document from prosecutors has revealed new details about Charlie Kirk's suspected shooter, including incriminating messages he allegedly sent to his roommate.",
        "url": "https://news.sky.com/story/what-we-can-learn-about-charlie-kirk-suspect-tyler-robinson-from-his-charging-document-13432664",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tyler-robinson-charlie-kirk_7018010.jpg?20250912153100",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-17 10:28:00",
        "Headline": "The charging document includes texts sent between the alleged shooter and his roommate after Charlie Kirk's death.",
        "Content": "A charging document from prosecutors has revealed new details about Charlie Kirk's suspected shooter, including incriminating messages he allegedly sent to his roommate. The details came after Tyler Robinson, 22, appeared in court via video link from prison, having been charged with aggravated murder, weapon, and obstruction of justice offences. He was arrested following a two-day manhunt after right-wing influencer Kirk, 31, was killed at one of his rallies at Utah Valley University (UVU) last Wednesday.  Here are some of the key details included in Robinson's charging document: What was in the texts between Robinson and his roommate? Investigators and prosecutors, including the Utah's Republican governor, Spencer James Cox, have said Robinson was in a relationship with his roommate, a biological male in the process of transitioning. The document reveals some of the exchanges between the pair, which prosecutors say were provided to the police by the roommate, despite Robinson allegedly demanding that they deleted them.  On the day of the shooting, Robinson allegedly sent the roommate a text which read: \"Drop what you are doing, look under my keyboard.\" Prosecutors say the roommate looked under his keyboard and found a note that stated: \"I had the opportunity to take out Charlie Kirk and I'm going to take it.\" Robinson added he was hoping to be home soon and apologised for \"involving\" the roommate, adding he had \"hoped to keep this secret till [sic] I died of old age\". When his roommate asked if he was the \"one who did it\", Robinson allegedly replied: \"I am, I'm sorry.\" Robinson is said to have written in another text: \"I had enough of his hatred. Some hate can't be negotiated out.\" He supposedly wrote that he had planned the shooting for \"a bit over a week\" and later instructed the roommate to \"delete this exchange\". Read more:What the engravings on the bullets may refer toMaps and videos show what happened moments before shootingThe string of bloody political violence in the MAGA era Children present while bullet 'passed closely' by questioner The shooting happened during Kirk's \"prove me wrong\" series, which saw the father of two visit campuses and debate contentious subjects; in this case, he was discussing mass shootings. The prosecutors say the bullet which struck Kirk's neck \"passed closely to several other individuals\", including the person questioning him as part of the event.  One of the seven counts against Robinson is for \"violent offence committed in the presence of a child\", as prosecutors say there were children near the stage when Kirk was shot. The charge states that there was a child younger than 14 years old present. Campus police officer started investigating immediately after shooting The document details how one UVU police officer quickly uncovered the position where Kirk is believed to have taken the shot from. It says the officer was watching the crowd from an elevated vantage point when the shot was fired, and that he began to scan the area for threats as soon as he heard it go off. The officer assumed the shot came from a rifle based on its sound, and started looking for sniper positions. He noted the roof area where the shot could have been taken from. He rushed there and confirmed a clear shooting corridor between the position and Kirk's seat. \"He also noticed markings in the gravel rooftop consistent with a sniper having lain on the roof - impressions in the gravel potentially left by the elbows, knees, and feet of a person in a prone shooting position,\" the document states. Prosecutors say the discovery led the authorities to review footage covering the roof, which later helped them identify the suspect. Targets with bullet holes found at suspect's home Police said they found several targets with bullet holes when they searched Robinson's home, along with a shell casing with etchings in it. The etchings, prosecutors said, were like the ones found on the shells in the rifle near UVU. The words and symbols on those shells featured references to fascism, video games and internet memes."
    },
    {
        "title": "Who's who at Trump's second state banquet ",
        "description": "Business moguls, politicians and members of the royal family made up the guest list for the state banquet to honour Donald Trump.",
        "url": "https://news.sky.com/story/whos-who-at-trumps-second-state-banquet-13432974",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donpix-windsor-donald-trump_7023505.jpg?20250917215556",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-17 18:45:00",
        "Headline": "The guest list for Donald Trump's second state banquet in Windsor Castle looked slightly different in comparison to previous US presidential visits. Here's who bagged an invitation. ",
        "Content": "Business moguls, politicians and members of the royal family made up the guest list for the state banquet to honour Donald Trump. The glitzy event at Windsor Castle wraps up the first day of the US president's visit to the UK, which has already seen pageantry, pomp and parades. Trump state visit live: Follow latest updates Previous state banquets, including one for former US president Barack Obama in 2011, have been littered with Hollywood stars, with Tom Hanks, Helena Bonham Carter and Tim Burton among those in attendance. For Mr Trump, the 160-person strong guest list featured more trade and business rather than show business.  Sky News US correspondent Mark Stone said the positioning of each guest around the table is also telling. He said across from Mr Trump and the King, on the other side of the table, was the Queen, the first lady, the Prince of Wales and Treasury Secretary Scott Bessent, which, Stone said \"gives you a hint of how much this is all about business\". Among the guests of honour were, of course, Donald and Melania Trump, alongside King Charles, Queen Camilla and Prime Minister Sir Keir Starmer. The Prince and Princess of Wales were in attendance, as were the Duke and Duchess of Gloucester, the Princess Royal and her husband, Vice Admiral Sir Tim Laurence.  Read more:In pictures: Trump's state visit so farGifts exchanged between the King and Donald TrumpTrump state visit is all about deals to turn around UK economy US secretary of state Marco Rubio, treasury secretary Scott Bessent and special envoy Steve Witkoff were among the senior American diplomats in attendance. MI6 chief Sir Richard Moore was also on the list. Apple CEO Tim Cook, Nvidia CEO, Jensen Huang, and OpenAI CEO Sam Altman were all in attendance, as was Paula Reynolds, the chair of National Grid - the UK's national electricity and gas system. Click or tap on the white dots below to find out who's who."
    },
    {
        "title": "In pictures: Donald Trump given royal welcome as UK state visit begins",
        "description": "Donald Trump has kicked off his second state visit to the UK with a royal greeting, carriage procession and gun salute.",
        "url": "https://news.sky.com/story/in-pictures-donald-trump-given-royal-welcome-as-uk-state-visit-begins-13432635",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-wales-princess-prince_7023367.jpg?20250917202858",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-17 09:52:00",
        "Headline": "Donald Trump and First Lady Melania Trump touched down in Windsor, marking the beginning of the US president's second state visit to the UK.",
        "Content": " Donald Trump has kicked off his second state visit to the UK with a royal greeting, carriage procession and gun salute. As the US president and the First Lady Melania Trump touched down in a rainy Windsor, they were greeted by Prince William and Kate, before meeting King Charles and Queen Camilla. Follow Trump state visit live The national anthems of the UK and US were then played as a carriage procession carried the Trumps and the King and Queen towards Windsor Castle. Here, Mr Trump inspected the Guard of Honour before heading inside the castle. Tonight, a grand state banquet will be held in honour of the US president, where both the King and Mr Trump are expected to give speeches. Read more:Who's who at Trump's second state banquetGifts exchanged between the King and Donald TrumpTrump state visit is all about deals to turn around UK economy"
    },
    {
        "title": "Trump state visit is all about deals to turn around UK economy",
        "description": "For Donald Trump, today was primarily about one thing.",
        "url": "https://news.sky.com/story/trump-state-visit-is-all-about-deals-to-turn-around-uk-economy-13432729",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jensen-huang-nvidia_7022973.jpg?20250917135628",
        "type": "US",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-09-17 12:25:00",
        "Headline": "Sky's Gurpreet Narwan says differences in state visit aims between the US and UK are clear as the world's most important businessmen say the UK is to be a superpower of the new industrial revolution.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  For Donald Trump, today was primarily about one thing. Before boarding Air Force One to make the transatlantic flight to the UK, he told reporters on the White House Lawn: \"It's to be with Prince Charles and Camilla, they're friends of mine for a long time… you're going to have some great pictures, it's going to be a beautiful event.\" Britain delivered. After a military welcome, lunch with the King and Queen and a Red Arrows flypast, the president has already got more than enough photographs to admire on the plane back home. Luckily, pomp and circumstance is something we do well. Money latest: Did Oasis tour impact inflation? But this was not an altruistic display. These things rarely are. As British governments have done in the past, the Starmer team leveraged Britain's soft power to advance its own aims. Beyond the fanfare, Starmer wants to catch the president's ear on foreign policy issues, including Gaza and Ukraine. But they are also there to talk money: investment and trade. On trade, we faltered. The US refused to budge on its 25% tariff imposed on the aluminium and steel Industry (a reminder perhaps that no amount of tea with the King will get the US to act against its interests). But in the arena of investment, the British government is already declaring victory. Trump arrived in Britain along with a who's who of the US tech scene. \n                  Trump finally gets his demand for a US rate cut\n                 \n                  Meta announces new smart glasses with a bold claim. I've tried them - and am unconvinced\n                 \n                  Food inflation at 18-month high - and experts predict worse to come\n                 Jensen Huang, chief executive of the AI chipmaker Nvidia, Apple's Tim Cook, Microsoft's Satya Nadella, and Sam Altman of OpenAI all made the journey over. Today, they are attending a state dinner at Windsor Castle along with the president but they had other reasons for coming too. Many of them were here to announce major investments, running into the tens of billions of pounds, to build AI data centres in the UK under a new US-UK tech deal. Trump state visit latest: These are private investments but the government is viewing them as a win for Starmer. His administration is - like the one before it and the one before that - scrambling to unlock economic growth in the UK. It is pinning its hopes on the transformational promise of AI. The prospect of greater economic growth, productivity and jobs is an alluring one for Britain and, indeed, most of Western Europe's ailing economies. The hope is that these investments will build the digital infrastructure needed to turbocharge the AI industry in the UK.  The government said the deals, which came from Nvidia, Microsoft, OpenAI, Google among others, were a \"vote of confidence in the UK\". And there are, of course, compelling reasons why Britain's existing AI ecosystem is attracting these companies. It has little to do with the King. World-class researchers, universities and scientific research have contributed to an ecosystem in Britain that is ripe for take off. Deep Mind was perhaps the most famous success story, a company that Google swooped in to acquire in 2014. That is something Jensen Huang, chief executive of Nvidia was keen to remind us. Ahead of his trip to Windsor, he expressed surprise at Britain's sometimes dysphoric attitude about its own capabilities. \"This week we're here to announce that the UK is going to be a superpower... but you know, Britons can be a bit humble, even deprecating, about their successes. Really, this is a moment to celebrate the UK ecosystem.\"  He said that Britain was at the cusp of a new Industrial Revolution, and it should seize the moment. \"This is the home of the origins of artificial intelligence and some of the brightest minds in AI are here. So the expertise of creating artificial intelligence and creating and training large language models is deep here.\" The UK has obvious expertise and appeal. It is the third largest AI market in the world, after the US and China. It is home to a third of Europe's AI start-up companies and twice as many as any other European country. Where it falters is infrastructure. High energy costs and a creaking grid are holding back growth in data centres. The government has promised to rectify this (which has caught the attention of the tech giants, hungry as they are for energy and computational power). The deal with the US will also see both sides cooperate to expand nuclear energy in the UK. Not everyone is comfortable with all this attention from the Americans, however. US dollars will help to fund the expansion in data centres, but US AI companies like OpenAI, which is partnering with Nvidia and Nscale to open a data centre in Blyth, will be at the forefront of the opportunities too. Open AI will secure the access to infrastructure, energy and computing power to run and train its models. Meanwhile Nvidia will provide the chips. Nscale, the British data centre company, is set for huge growth but, where France boasts Mistral, the UK has no comparable national AI champion. For all the claims of \"sovereign AI\", some may wonder whether building data centres in the UK is enough to give us sufficient control over this powerful new industry, when so much of the technology is American. Speaking to Sky News, Mr Huang batted away those concerns. \"Sovereign AI starts with having your sovereign data... you have lots of your own data,\" he said. \"The data of your people, of your companies, of your society. That data is created here. It belongs to you. You should use it to train your own large language models. There's going to be a whole bunch of different AI models being created here, and I have every confidence, so long as we provide the instrument of the science.\""
    },
    {
        "title": "Robert Redford's grandchildren pay tribute to Hollywood icon as they share family photos",
        "description": "Robert Redford's grandchildren have paid tribute to the Hollywood icon with a series of never-before-seen family photos.",
        "url": "https://news.sky.com/story/robert-redfords-grandchildren-pay-tribute-to-hollywood-icon-as-they-share-family-photos-13432951",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-conor-schlosser-robert-redford_7023296.jpg?20250917191407",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-17 17:55:00",
        "Headline": "The 89-year-old Hollywood actor died on Tuesday in Utah \"surrounded by those he loved\".",
        "Content": "Robert Redford's grandchildren have paid tribute to the Hollywood icon with a series of never-before-seen family photos. Redford died on Tuesday at the age of 89 in the mountains of Utah \"surrounded by those he loved\", according to his representative Cindi Berger. Now Conor Schlosser, the 33-year-old son of Redford's eldest daughter Shauna Redford, 64, has posted five photos on Instagram with the movie star, including three throwback pictures from his childhood of the pair together. In them, they are riding a horse, opening a present and playing golf. Mr Schlosser also shared two more recent pictures with Redford, including one of them enjoying a meal and the other of him with his arm around his grandfather. In a caption that accompanied the social media post, he wrote: \"He was larger than life to the world, but to his family, he was simply that … family. \"Rest in peace, Grandpa.🐎\".\" He added: \"If anyone has a favourite story of him you'd like to share, please send it to me in a private message - I'd love to collect them.\" \n                  Robert Redford dies: His career in pictures\n                 \n                  Hollywood actor and director Robert Redford dies at 89\n                 \n                  Robert Redford pays tribute to son James following his death from cancer\n                 Read more:Redford's career in pictures His cousin, Lena Hart Redford, the 29-year-old daughter of Redford's late son, James Redford, also posted a number of pictures with the Hollywood star on Instagram. There were photos of her on a horse with her grandfather and also with him on a film set. She also included a photo of her late father with Redford in the post, which she captioned with a red heart emoji. And in a tribute on Instagram Stories, she shared a throwback image of her and Redford wearing Kangol-brand beanies. \"Taught me so much. … Had us all in Kangol,\" she wrote. She also posted a picture of Redford and her father horseback riding. \"Dad & grandpa, I feel like they are riding awesome horses in heaven,\" she wrote. Lena Hart Redford's brother, Dylan Redford, shared a picture with his grandfather on his Instagram Stories. He wrote: \"He was best grampa a grandson could ask for. He also made amazing things, helped others make amazing things, and tried to make the world a better place.\" Redford fathered four children with his first wife Lola Van Wagenen - sons Scott and James and daughters Shauna and Amy. Scott died in 1959 from sudden infant death syndrome aged only two months, while his younger son James died aged 58 of cancer in 2020. Redford is survived by his wife Sibylle Szaggars Redford, daughters Shauna and Amy and seven grandchildren."
    },
    {
        "title": "Arrests after Trump-Epstein images projected on to Windsor Castle",
        "description": "Giant projections of Donald Trump alongside paedophile Jeffrey Epstein have been beamed on to Windsor Castle by protesters as the US president arrived in the UK for his second state visit.",
        "url": "https://news.sky.com/story/images-of-trump-and-epstein-projected-on-windsor-castle-ahead-of-protests-13432557",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-state-visit_7022699.jpg?20250917090019",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-17 05:23:00",
        "Headline": "There are no public-facing engagements for the US president throughout his 48-hour state visit, with thousands of people in central London expected to take part in a major protest against his UK stay.",
        "Content": " Giant projections of Donald Trump alongside paedophile Jeffrey Epstein have been beamed on to Windsor Castle by protesters as the US president arrived in the UK for his second state visit. Mr Trump has faced mounting questions about his relationship with the disgraced billionaire after messages allegedly sent to him by the US president were published earlier this month. Follow Trump's second state visit live   The apparent notes - which Mr Trump denies having written - appeared in a 2003 \"birthday book\" for Epstein. Four people were arrested on Tuesday on suspicion of malicious communications after the images of Mr Trump and Epstein appeared on the castle, Thames Valley Police said. The force said they were a 60-year-old man from East Sussex, a 36-year-old man from London, a 37-year-old man from Kent and a 50-year-old man from London. Political campaign group Led By Donkeys said it was behind the nine-minute projection sequence. It called the arrests a \"ridiculous overreaction\" and said it had beamed the pictures from a nearby hotel. \"My colleagues were arrested for malicious communications, which seems ridiculous, because we've done 25 or 30 projections before, no one's ever been arrested,\" a spokesperson told PA news agency. \"I think they've been arrested for embarrassing Donald Trump,\" they added. Two men were also arrested yesterday in separate incidents for breaching temporary airspace restrictions by flying drones in Windsor. Police said they were both 37 and from Brentford, west London, and Aylesbury in Buckinghamshire. The president is being feted with a stay in Windsor Castle, where he will be hosted by the King and treated to a ceremonial welcome on Wednesday and later, a lavish state banquet. The Prince and Princess of Wales will meet the president and first lady Melania Trump in the grounds of the Windsor estate, where he will spend the day, before heading to the prime minister's country residence Chequers on Thursday. It is hoped the Queen - who pulled out of attending the Duchess of Kent's funeral on Tuesday after suffering from acute sinusitis - will recover in time to attend the busy run of royal events. Read more: No one does pomp better than Britain There are no public-facing engagements for the president throughout his 48-hour state visit. Thousands of people expected to take part in a major protest against his stay in central London today.  The Metropolitan Police said it is preparing for \"a significant operation\" with as many as 50 protest groups expected to take part. More than 1,600 officers will be deployed, including 500 assisting from other forces. The Prince and Princess of Wales will greet the president and his wife in the grounds of the Windsor estate in the morning, before accompanying them to meet the King and Queen for an open-air greeting. Mr and Mrs Trump, the King, Camilla, William, and Kate will then take part in a carriage procession through the estate to the castle, with the carriage ride joined by the Household Cavalry Mounted Regiment, which will provide a Sovereign's Escort, as well as members of the armed forces and three military bands. A ceremonial welcome with a guard of honour will be staged in the quadrangle of the castle, as is customary, followed by lunch with the royal family and a visit to see a Royal Collection exhibition within the castle.\n The president and his wife will then visit St George's Chapel privately on Wednesday afternoon to lay a wreath on the tomb of Queen Elizabeth II, whom they both met on their first state visit. They will then be treated to a flypast by the Red Arrows alongside UK and US F-35 military jets on the east lawn at Windsor Castle, as well as a special Beating Retreat military ceremony. The traditional grand state banquet is set to follow in the castle's St George's Hall in the evening, with both Mr Trump and the King to give speeches as the event gets under way. A small group of protesters from the Stop Trump Coalition were in Windsor on Tuesday night. Two protesters from the activist group Fossil Free London were escorted out of a dinner organised by Republicans Overseas UK at Windsor Guildhall in the Berkshire town. They chanted \"how many will you kill if you drill baby drill\" and unfurled a banner that said: \"Oily Money Kills\" at the event. Speaking to reporters mid-flight, Mr Trump said: \"My relationship is very good with the UK, and Charles, as you know, who's now King, is my friend. \"It's the first time this has ever happened where somebody was honoured twice. So, it's a great honour.\" He told the journalists \"everybody is looking forward to it. You're going to have the best pictures\"."
    },
    {
        "title": " Air traffic control warns flight to turn away from Air Force One as it brings Trumps to London",
        "description": "An air traffic controller had to repeatedly warn a flight to turn away from Air Force One's path as the two aircraft flew over New York on Tuesday. ",
        "url": "https://news.sky.com/story/air-traffic-control-warns-flight-to-turn-away-from-air-force-one-as-it-brings-trumps-to-london-13432903",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-air-force-one-donald-trump_6915332.jpg?20250513154024",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-17 16:27:00",
        "Headline": "Donald and Melania Trump were on board the presidential aircraft when an air traffic controller told the pilot of a nearby flight: \"Pay attention. Get off the iPad.\" ",
        "Content": "An air traffic controller had to repeatedly warn a flight to turn away from Air Force One's path as the two aircraft flew over New York on Tuesday.  Air Force One - carrying a London-bound Donald Trump and his wife Melania - was a short while into its journey when the incident took place. The other plane was travelling from Fort Lauderdale in Florida to Boston, Massachusetts, when a seemingly frustrated air traffic controller eventually told its pilot: \"Pay attention. Get off the iPad.\" Follow live: The latest updates from Donald Trump's state visit Sky News' US partner NBC News reports that in a LiveATC (Air Traffic Control) recording, the controller can be heard telling the Spirit Airlines flight to \"turn 20 degrees\". \"Pay attention, Spirit 1300, turn 20 degrees right,\" they say. \"Spirit 1300, turn 20 degrees right now. Spirit Wings, 1300 turn 20 degrees right immediately. Pay attention.\" The controller continues asking them to turn away before highlighting the significance of the other flight, adding: \"I'm sure you can see who it is.\" \n                  Has the royal Truman Show for Trump been worth the enormous effort and expense?\n                 \n                  Trump hails 'highest honour of my life' at state banquet - as King references trade, Ukraine and environment\n                 \n                  Starmer-Trump talks could be landmark moment - and join pantheon of UK-US summits\n                 They then say: \"I got to talk to you twice every time, Spirit 1300… Pay attention. Get off the iPad.\" A source told NBC that the Spirit plane and Air Force One maintained the required separation. A spokesperson for Spirit said that its flight \"followed procedures and Air Traffic Control instructions while en route to Boston\". \"Safety is always our top priority,\" they added. Read more: Arrests made over Trump-Epstein Windsor stuntThe King and Trump exchange gifts The US president and first lady are in the UK for a second state visit. They touched down at London's Stansted Airport on Tuesday night, where they were greeted by the newly-installed Foreign Secretary Yvette Cooper.  The Trumps then travelled to central London by helicopter and spent the night at the US ambassador's residence Winfield House, in Regent's Park. They are now being hosted by the King and Queen at Windsor Castle, where engagements have included a carriage ride, a military parade and a Red Arrows flypast."
    },
    {
        "title": "Trump state visit is all about deals to turn around UK economy",
        "description": "For Donald Trump, today was primarily about one thing.",
        "url": "https://news.sky.com/story/trump-state-visit-is-all-about-deals-to-turn-around-uk-economy-13432729",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jensen-huang-nvidia_7022973.jpg?20250917135628",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-09-17 12:25:00",
        "Headline": "Sky's Gurpreet Narwan says differences in state visit aims between the US and UK are clear as the world's most important businessmen say the UK is to be a superpower of the new industrial revolution.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  For Donald Trump, today was primarily about one thing. Before boarding Air Force One to make the transatlantic flight to the UK, he told reporters on the White House Lawn: \"It's to be with Prince Charles and Camilla, they're friends of mine for a long time… you're going to have some great pictures, it's going to be a beautiful event.\" Britain delivered. After a military welcome, lunch with the King and Queen and a Red Arrows flypast, the president has already got more than enough photographs to admire on the plane back home. Luckily, pomp and circumstance is something we do well. Money latest: Did Oasis tour impact inflation? But this was not an altruistic display. These things rarely are. As British governments have done in the past, the Starmer team leveraged Britain's soft power to advance its own aims. Beyond the fanfare, Starmer wants to catch the president's ear on foreign policy issues, including Gaza and Ukraine. But they are also there to talk money: investment and trade. On trade, we faltered. The US refused to budge on its 25% tariff imposed on the aluminium and steel Industry (a reminder perhaps that no amount of tea with the King will get the US to act against its interests). But in the arena of investment, the British government is already declaring victory. Trump arrived in Britain along with a who's who of the US tech scene. \n                  Trump finally gets his demand for a US rate cut\n                 \n                  Meta announces new smart glasses with a bold claim. I've tried them - and am unconvinced\n                 \n                  Food inflation at 18-month high - and experts predict worse to come\n                 Jensen Huang, chief executive of the AI chipmaker Nvidia, Apple's Tim Cook, Microsoft's Satya Nadella, and Sam Altman of OpenAI all made the journey over. Today, they are attending a state dinner at Windsor Castle along with the president but they had other reasons for coming too. Many of them were here to announce major investments, running into the tens of billions of pounds, to build AI data centres in the UK under a new US-UK tech deal. Trump state visit latest: These are private investments but the government is viewing them as a win for Starmer. His administration is - like the one before it and the one before that - scrambling to unlock economic growth in the UK. It is pinning its hopes on the transformational promise of AI. The prospect of greater economic growth, productivity and jobs is an alluring one for Britain and, indeed, most of Western Europe's ailing economies. The hope is that these investments will build the digital infrastructure needed to turbocharge the AI industry in the UK.  The government said the deals, which came from Nvidia, Microsoft, OpenAI, Google among others, were a \"vote of confidence in the UK\". And there are, of course, compelling reasons why Britain's existing AI ecosystem is attracting these companies. It has little to do with the King. World-class researchers, universities and scientific research have contributed to an ecosystem in Britain that is ripe for take off. Deep Mind was perhaps the most famous success story, a company that Google swooped in to acquire in 2014. That is something Jensen Huang, chief executive of Nvidia was keen to remind us. Ahead of his trip to Windsor, he expressed surprise at Britain's sometimes dysphoric attitude about its own capabilities. \"This week we're here to announce that the UK is going to be a superpower... but you know, Britons can be a bit humble, even deprecating, about their successes. Really, this is a moment to celebrate the UK ecosystem.\"  He said that Britain was at the cusp of a new Industrial Revolution, and it should seize the moment. \"This is the home of the origins of artificial intelligence and some of the brightest minds in AI are here. So the expertise of creating artificial intelligence and creating and training large language models is deep here.\" The UK has obvious expertise and appeal. It is the third largest AI market in the world, after the US and China. It is home to a third of Europe's AI start-up companies and twice as many as any other European country. Where it falters is infrastructure. High energy costs and a creaking grid are holding back growth in data centres. The government has promised to rectify this (which has caught the attention of the tech giants, hungry as they are for energy and computational power). The deal with the US will also see both sides cooperate to expand nuclear energy in the UK. Not everyone is comfortable with all this attention from the Americans, however. US dollars will help to fund the expansion in data centres, but US AI companies like OpenAI, which is partnering with Nvidia and Nscale to open a data centre in Blyth, will be at the forefront of the opportunities too. Open AI will secure the access to infrastructure, energy and computing power to run and train its models. Meanwhile Nvidia will provide the chips. Nscale, the British data centre company, is set for huge growth but, where France boasts Mistral, the UK has no comparable national AI champion. For all the claims of \"sovereign AI\", some may wonder whether building data centres in the UK is enough to give us sufficient control over this powerful new industry, when so much of the technology is American. Speaking to Sky News, Mr Huang batted away those concerns. \"Sovereign AI starts with having your sovereign data... you have lots of your own data,\" he said. \"The data of your people, of your companies, of your society. That data is created here. It belongs to you. You should use it to train your own large language models. There's going to be a whole bunch of different AI models being created here, and I have every confidence, so long as we provide the instrument of the science.\""
    },
    {
        "title": "Trump finally gets his demand for a US rate cut",
        "description": "The US central bank has cut interest rates for the first time this year, in a move President Donald Trump will likely declare is long overdue.",
        "url": "https://news.sky.com/story/trump-finally-gets-his-demand-for-a-us-rate-cut-13432797",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-jerome-powell_6978342.jpg?20250730193357",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-09-17 14:35:00",
        "Headline": "Financial markets believe more interest rate cuts are on the way in the US - music to Donald Trump's ears as the US economy shows signs of slowing.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The US central bank has cut interest rates for the first time this year, in a move President Donald Trump will likely declare is long overdue. Mr Trump has demanded cuts to borrowing costs from the Federal Reserve ever since worries emerged in the world's largest economy that his trade war would stoke US inflation. The president - currently in the UK on a state visit - has, on several occasions, threatened to fire the Fed chair Jay Powell and place his own supporters on the bank's voting panel. Money latest: Did Oasis tour impact UK inflation? He was yet to comment on the rate decision. The fallout from the row has resonated globally, sparking worries about central bank independence. Financial markets have also reflected those concerns. The bank, which has a dual mandate to keep inflation steady and maintain maximum employment, made its move on Wednesday after a major slowdown in the employment market that has seen hiring ease sharply. \n                  Has the royal Truman Show for Trump been worth the enormous effort and expense?\n                 \n                  Trump hails 'highest honour of my life' at state banquet - as King references trade, Ukraine and environment\n                 \n                  Starmer-Trump talks could be landmark moment - and join pantheon of UK-US summits\n                 The latest economic indicators have shown caution over spending among both companies and consumers alike. The Fed said the economy had moderated. Inflation, while somewhat elevated due to the effects of higher import costs from the trade war, has not taken off as badly as some economists, and the Fed, had initially feared. Its 12-member panel backed a quarter-point reduction in the Fed funds rate to a new range of between 4% to 4.25%. The effective interest rate is in the middle of that range. Crucially for Mr Trump, who is trying to inspire growth in the economy, the Fed signalled more reductions ahead despite continued concern over inflation.  Financial markets saw a further two quarter-point rate cuts before the year's end. The dollar, which has weakened in recent days on the back of expectations of further rate cuts, fell in the wake of the decision and the Fed's statement. It was trading down against both the euro and pound. Sterling was almost half a cent up at $1.37. This Fed meeting was the first with new Trump appointee Stephen Miran on the voting panel. He was chairman of the president's Council of Economic Advisers before being handed the role this week. His was a sole voice in the voting for a half percentage-point cut. It is clear, though the identity of participants' forecasts are not revealed, his was the lone voice in calling for a further five quarter-point reductions this year. Mr Trump has sought to fire a member of the Fed's board, Lisa Cook, to bolster his position further, but that decision is currently subject to a legal challenge. At a news conference, Mr Powell declined to answer a question on whether the Fed's independence was threatened by the presence of Mr Miran. He merely outlined that he had been welcomed to the rate-setting meeting and that the central bank was committed to its dual mandate. Isaac Stell, investment manager at Wealth Club, said of the rate cut: \"The decision is unlikely to satisfy the president, who made it publicly known he expected a \"big cut\", not the 0.25% the Fed has opted for today. \"Unfortunately, the timing and circumstances of today's move make it appear more like a concession rather than a strategic policy shift, potentially fuelling concerns about the Fed's independence.\""
    },
    {
        "title": "Meta announces new smart glasses with a bold claim. I've tried them - and am unconvinced",
        "description": "Meta has announced smart glasses with a screen in the right lens, meaning you can read WhatsApp messages, look at a map or translate a conversation - all from the comfort of your face.",
        "url": "https://news.sky.com/story/meta-announces-new-smart-glasses-with-a-bold-claim-ive-tried-them-and-am-unconvinced-13432792",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-meta-smart-glasses_7023626.png?20250918021439",
        "type": "Business",
        "Author": "Mickey Carroll",
        "Date Published": "2025-09-17 14:29:00",
        "Headline": "Meta believes the new glasses keep \"you tuned in to the world around you, not distracted from it\". But I tried the tech on at an event with the company earlier this month and found the opposite.",
        "Content": "\n          Science and technology reporter\n       Meta has announced smart glasses with a screen in the right lens, meaning you can read WhatsApp messages, look at a map or translate a conversation - all from the comfort of your face. The company describes them as the world's most advanced AI glasses, and it's the first time it has put a display in its smart Ray-Bans. Mark Zuckerberg believes such hi-tech specs are the future of portable computing, telling the unveiling event they're \"the only form factor where you can let AI see what you see, hear what you hear\". Released on 30 September for $799 (£587), the display is controlled using a neural band that wraps around the user's wrist and monitors their hand movements. A twist of the fingers will turn the glasses' volume up or down or zoom on the camera; two taps of the thumb to the forefinger will close the display and soon, users will be able to write texts by drawing letters in the air. \"The amount of signals the band can detect is incredible - it has the fidelity to measure movement even before it's visually perceptible,\" said a Meta spokesperson. The company says their glasses are \"designed to help you look up and stay present\", a \"technology that keeps you tuned in to the world around you, not distracted from it\". But I tried the tech on at an event with Meta earlier this month and found the opposite. I was so distracted by the display that during an interview with Ankit Brahmbhatt, director of product management at Meta, I realised I was watching a game I'd accidentally left on in my lens. I confessed and asked Mr Brahmbhatt if the glasses would actually help enable better face-to-face conversations, or if people would simply look more engaged because they weren't looking down at their phone. \"I don't think we're saying we have all the answers yet, right? Just like when we were first introduced to smartphones or any other new paradigm, there's a lot of things that evolve over time,\" said Mr Brahmbhatt. \"We feel very much that this is already going to make you much more heads up and in the moment. With AI glasses, you actually have the sense of being able to engage.\" But having a screen in your vision can be very distracting - research has repeatedly shown our brains simply aren't designed to cope with two activities at a time. In one famous study published in the Applied Cognitive Psychology journal, people walking down a road while doing a task on their phone didn't even notice a unicycling clown riding in front of them. Read more from Sky News:How most people are using ChatGPTNHS medicines bill 'should rise to preserve UK drug industry' It's a phenomenon called inattentional blindness. \"People are cognitively distracted all of the time [by devices]. It's just that in particular circumstances, such as driving, the risks are so much higher,\" said Professor Gemma Briggs, professor of applied cognitive psychology at the Open University. Although the display on Meta's glasses will turn off automatically when it detects you're driving, there's nothing to stop users from switching it back on. This could lead to dangerously distracted drivers, according to Professor Briggs. \"My research has demonstrated that it really doesn't make any difference whether you're touching, holding, manipulating your phone or whether it's hands-free, you're still far more likely to be distracted. \"That means you're four times more likely to be involved in a collision, you are significantly less likely to notice hazards that occur, even if they occur straight ahead of you and any hazards that you do notice, you will take a lot longer to react to,\" said Professor Briggs. Meta insists these glasses will make sure their wearers stay in the moment and engaged. For some, however, phones are already distracting enough - let alone when you have one strapped to your face."
    },
    {
        "title": "Food inflation at 18-month high - and experts predict worse to come",
        "description": "Inflation has remained relatively high, meaning goods are becoming more expensive, particularly the cost of food, official figures show. ",
        "url": "https://news.sky.com/story/inflation-remains-relatively-high-but-worse-to-come-13432556",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-money-cash_6984899.jpg?20250807143220",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-09-17 05:10:00",
        "Headline": "Food prices are expected to peak in December as hot weather led to a poor harvest and the industry complained of higher costs.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Inflation has remained relatively high, meaning goods are becoming more expensive, particularly the cost of food, official figures show.  The rate of price rises remained at 3.8% in August, the same as in July, according to data from the Office for National Statistics (ONS). Money blog: Here's what inflation figure means for you Food and non-alcoholic drinks price rises, however, accelerated from 4.9% to 5.1%, far higher than the headline rate and other measures of inflation. It's the fifth monthly rise in a row and the first time in 18 months such a high has been reached. \"Small increases\" were seen in vegetables, cheeses and fish, the ONS said. Economic research firm Pantheon Macroeconomics has forecast it will peak at 6% in December. Prices are expected to continue rising, with the Bank of England forecasting the rate will hit 4% in September. Such a high is double the central bank's 2% target, meaning interest rates - and the cost of borrowing as a result - could remain higher for longer. Why? Latest headline data was unchanged as airfares rose less sharply in August this year, compared with last, though this was offset by hotel prices falling less sharply and more expensive petrol. Oasis gigs across Britain likely contributed to higher accommodation costs. The rise in food inflation follows the hottest UK spring and summer on record, which impacted crop growth and animal feeding, and resulted in one of its worst harvests in decades. Increased wage bills through higher minimum wage and employers' national insurance contributions were said to be behind the high figure, the Food and Drink Federation said. The British Retail Consortium added a new packaging tax was upping business costs.  Behind the headline figure Other measures of inflation slowed. Core inflation, which strips out volatile food and energy prices and is closely watched by the rate-setters at the Bank of England, fell back to 3.6% from 3.8% last month. Read more:Trump to sign US-UK tech partnership in drive for AINHS medicines bill should rise to preserve UK drug industry, minister says Similarly, services inflation, which tracks prices in the biggest part of the UK economy, dropped back to 4.7% from 5% in July. Responding to the data, Chancellor Rachel Reeves said: \"I know families are finding it tough and that for many the economy feels stuck. That's why I'm determined to bring costs down and support people who are facing higher bills. \"We are taking action - raising the national living wage, extending the £3 bus fare cap, and expanding free school meals, to put more money in people's pockets while we work to build a stronger, more stable economy that rewards hard work\"."
    },
    {
        "title": "Private hospitals group Spire faces investor calls to explore sale",
        "description": "Spire Healthcare, the private hospitals operator, is facing calls from leading investors to put itself up for sale.",
        "url": "https://news.sky.com/story/private-hospitals-group-spire-faces-investor-calls-to-explore-sale-13432783",
        "image_url": "https://e3.365dm.com/20/01/1920x1080/skynews-spire-parkway-hospital_4901374.jpg?20250917174615",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-17 14:19:00",
        "Headline": "The FTSE 250 private hospitals operator is under pressure from shareholders to examine options for delivering greater value in the coming months, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Spire Healthcare, the private hospitals operator, is facing calls from leading investors to put itself up for sale. Sky News has learnt that shareholders including Achilles, an activist investment trust co-founded by the prominent City fund manager Christopher Mills, wants Spire to explore talks with potential bidders. City sources said that Achilles and other Harwood Capital Management entities, which hold roughly 5% of Spire's shares, were among a number of investors who believed the company was significantly undervalued. Money latest: Did Oasis tour impact inflation? Spire runs 38 hospitals and more than 50 clinics, medical centres and consulting rooms across the UK. It is the largest provider of hip and knee operations in the country. Run by Justin Ash, chief executive, the company is chaired by the City grandee Sir Ian Cheshire. \n                  Trump state visit is all about deals to turn around UK economy\n                 \n                  Trump finally gets his demand for a US rate cut\n                 \n                  Meta announces new smart glasses with a bold claim. I've tried them - and am unconvinced\n                 Achilles, which is managed by Robert Naylor, is understood to have communicated its wish for the company to hire advisers to run a formal sale process. Spire has a market capitalisation of close to £820m, although its real estate assets alone have been valued at more than £1.4bn. The company has told investors that it was committed to delivering value for shareholders \"The Board will continue to actively evaluate and implement any appropriate action that drives long term shareholder value,\" it said alongside results in July. It was unclear on Wednesday whether any formal approaches had been received by Spire's board. Achilles declined to comment, while Spire has been contacted for comment."
    },
    {
        "title": "Manchester United announce record revenues - but still make a loss",
        "description": "Manchester United have announced record revenues of &#163;666.5m for the 2024/25 season - but still made an overall loss of &#163;33m.",
        "url": "https://news.sky.com/story/manchester-united-announce-record-revenues-but-still-make-a-loss-13432748",
        "image_url": "https://e3.365dm.com/23/10/1920x1080/skynews-old-traffod-manchester-united_6306545.jpg?20250917141120",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-17 13:00:00",
        "Headline": "United's accounts for 2024/25 show, despite a lack of on-field success, the club saw revenue marginally increase by 0.7% to £666.5m, but made an overall loss of £33m.",
        "Content": "Manchester United have announced record revenues of £666.5m for the 2024/25 season - but still made an overall loss of £33m. The club were without Champions League football last season and finished 15th in the Premier League – their lowest top-flight finish in 51 years. But despite a lack of on-field success, United still saw revenue marginally increase by 0.7% to £666.5m. United bosses have hailed their five-year shirt sponsorship with Snapdragon as the most valuable of its kind in world sport, and that played a significant role in boosting revenues with four years remaining on the deal. The club posted record commercial revenues of £333.3m, and achieved record matchday revenues of £160.3m. Broadcasting revenue, however, fell by £48.9m to £172.9m after the men's team played in the Europa League rather than the Champions League. The club said they spent £36.6m in terms of exceptional items, which included pay-offs to employees as part of their \"transformation plan\" along with former boss Erik ten Hag and his staff. The accounts released on Wednesday for the year ending 30 June 2025 also showed United's operating loss fell from £69.3m to £18.4m compared with the previous 12 months.  Employee expenses were down by 14.1%, from £51.5m to £313.2m. This was achieved by several high-earning players, who were not part of the first-team plans, going out on loan or being sold.  It was also down to wider club restructuring. More than 250 members of staff at Old Trafford were made redundant in the first round of cuts. Overall losses dropped from £113.2m to £33m after co-owner Sir Jim Ratcliffe oversaw some wide-ranging, and often unpopular, changes at a club he claimed in March had \"gone one off the rails\" as a business. The British billionaire, who is the founder, chairman and CEO of petrochemicals empire INEOS, even warned United would have gone \"bust at Christmas\" if they had not taken \"really tough decisions\". Read more from Sky News:Food inflation at 18-month highTrump to sign US-UK tech dealBen & Jerry's founder quits  'Priority is success on the pitch' United's chief executive Omar Berrada said the club was \"emerging from a period of structural and leadership change with a refreshed, streamlined organisation equipped to deliver on our sporting and commercial objectives\". \"To have generated record revenues during such a challenging year for the club demonstrates the resilience which is a hallmark of Manchester United,\" he said. \"As we start to feel the benefits of our cost-reduction programme, there is significant potential for improved financial performance, which will, in turn, support our overriding priority: success on the pitch.\" United are expecting the next financial year to bring in revenue of £640m to £660m despite being without European football for the first time since 2014/15."
    },
    {
        "title": "WH Smith buyer Modella leads race to snap up Claire's UK chain",
        "description": "The investor which swooped on WH Smith's high street business earlier this year is in pole position to snap up the British operations of Claire's, the accessories retailer which collapsed last month.",
        "url": "https://news.sky.com/story/wh-smith-buyer-modella-leads-race-to-buy-claires-uk-chain-13432620",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-accessories-claires-accessories_6965200.jpg?20250720165751",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-17 09:09:00",
        "Headline": "Modella Capital has agreed an outline deal with Ames Watson, the private equity firm which recently bought Claire's brand and US retail operations, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The investor which swooped on WH Smith's high street business earlier this year is in pole position to snap up the British operations of Claire's, the accessories retailer which collapsed last month. Sky News has learnt that Modella Capital has agreed the outline of a deal with Claire's new US-based owner, private equity firm Ames Watson, which paves the way for it to buy the UK chain. Modella is said to have edged ahead of rival bidders in recent days including Touker Suleyman, the Dragons' Den judge, and HMV-owner Doug Putman in recent days. Ames Watson is understood to have been seeking minimum financial guarantees for Claire's UK business as part of its discussions with potential buyers. Sources close to the process said on Wednesday that Modella had yet to agree a separate deal with Interpath Advisory, the administrators of Claire's business in the UK. While there was no guarantee that it would do so, its talks with Ames Watson makes the prospects of an agreement likely, the sources added. Claire's trades from 278 stores in the UK and 28 in Ireland, employing about 2,100 people across the combined estate. \n                  Trump state visit is all about deals to turn around UK economy\n                 \n                  Trump finally gets his demand for a US rate cut\n                 \n                  Meta announces new smart glasses with a bold claim. I've tried them - and am unconvinced\n                 Interpath said last month it would keep all shops open while it assessed options for the business. Modella has emerged from nowhere to become the most prolific investor in bricks-and-mortar retailing in Britain in recent months. As well as WH Smith, which it is rebranding under the name TG Jones, Modella now owns The Original Factory Shop and Hobbycraft, both of which it has put through restructuring processes since it acquired them. Claire's, which has been a fixture in British shopping centres and town centres for decades, is one of the biggest high street chains to fall into insolvency this year. It has a particular following among teenage shoppers. The company had been running a sale process prior to its appointment as administrators, but did not manage to secure a solvent deal. The retail industry has been left reeling by the employers' national insurance hike announced by Rachel Reeves, the chancellor, last autumn. Both Poundland and River Island recently survived creditor votes paving the way for them to slash rents and close dozens of stores. The collapse of Claire's UK operations came a week after its US parent company filed for Chapter 11 bankruptcy protection. The company had been owned by former creditors Elliott Management and Monarch Alternative Capital following a previous financial restructuring. Will Wright, UK chief executive at Interpath, said last month: \"Claire's has long been a popular brand across the UK, known not only for its trend-led accessories but also as the go-to destination for ear piercing. \"Over the coming weeks, we will endeavour to continue to operate all stores as a going concern for as long as we can, while we assess options for the company. \"This includes exploring the possibility of a sale which would secure a future for this well-loved brand.\" A Modella spokesperson said it did not comment on market rumours, while Mr Suleyman declined to comment. Interpath has been contacted for comment."
    },
    {
        "title": "Bain Capital among suitors for £900m wealth adviser Amber River",
        "description": "The private equity giant Bain Capital is among the suitors circling Amber River, one of Britain&#8217;s biggest independent financial planning networks.",
        "url": "https://news.sky.com/story/bain-capital-among-suitors-for-163900m-wealth-adviser-amber-river-13432693",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-waterloo-bridge-london_6988596.jpg?20250812074610",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-17 11:33:00",
        "Headline": "Bain Capital and Stone Point Capital are said to be among the private equity firms preparing to lodge offers for Amber River, a consolidator of financial planning firms, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity giant Bain Capital is among the suitors circling Amber River, one of Britain’s biggest independent financial planning networks. Sky News has learnt that Bain, a former owner of motor insurer esure, and several other private equity firms are preparing to lodge bids for Amber River, which has been put up for sale by owner Penta Capital. Banking sources said the auction could fetch a price in the region of £900m. Money latest: Did Oasis tour impact inflation? The insiders named Stone Point Capital, a financial services-focused buyout firm, as another potential bidder ahead of offers due in the coming weeks. Amber River is headed by Mary-Anne McIntyre, former chief executive of financial adviser network OpenWork. It has roughly £14bn of assets under advice, and has been built through a string of acquisitions since it was founded in 2019 under the name Socium Group. \n                  Trump state visit is all about deals to turn around UK economy\n                 \n                  Trump finally gets his demand for a US rate cut\n                 \n                  Meta announces new smart glasses with a bold claim. I've tried them - and am unconvinced\n                 Last year, it struck a £275m debt refinancing deal with Carlyle, the US-based investment giant. The auction is being handled by bankers at Rothschild. Consolidation has been sweeping the UK's financial advice sector, with the City watchdog cautioning firms to seek approval prior to signing deals amid a review of the industry. Bain Capital declined to comment on Wednesday."
    },
    {
        "title": "Sadiq Khan calls out Gaza 'genocide', as Starmer 'delays' recognising Palestinian state until end of Trump's state visit",
        "description": "London's mayor Sir Sadiq Khan has for the first time described the situation in Gaza as a \"genocide\", becoming the most senior Labour figure to contradict the government's official position.",
        "url": "https://news.sky.com/story/sadiq-khan-calls-out-gaza-genocide-as-starmer-delays-recognising-palestinian-state-until-end-of-trumps-state-visit-13433134",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sir-sadiq-khan-sir-keir-starmer_7023622.png?20250918013930",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-17 22:10:00",
        "Headline": "It is reported that the government wants to avoid Gaza, and looming recognition of Palestinian statehood, dominating the news agenda following talks between Sir Keir Starmer and Donald Trump on Thursday.",
        "Content": "London's mayor Sir Sadiq Khan has for the first time described the situation in Gaza as a \"genocide\", becoming the most senior Labour figure to contradict the government's official position. Earlier this week, a UN Commission said a genocide was taking place in Gaza - something repeatedly denied by Israel. Meanwhile, Sir Keir Starmer has been under pressure to raise Israel's bombardment of the territory with Donald Trump during his state visit to the UK. The prime minister is due to have discussions with the president today, but reports suggest he will delay formally recognising a Palestinian state until this weekend, after Mr Trump has left Britain. It is claimed the government wants to avoid the issue dominating a news conference the two men plan to hold, according to The Times.  The prime minister has found himself at odds with the US administration over the move, which is opposed to official recognition of Palestine. The mayor of London, who has engaged in a long-running spat with Mr Trump, has added to the political tension by contradicting official Labour policy at a people's question time event on Wednesday. \"I think it's inescapable to draw the conclusion in Gaza we are seeing before our very eyes a genocide,\" said Sir Sadiq. Sir Keir has previously pledged to recognise Palestinian statehood ahead of next week's United Nations General Assembly in New York if Israel does not meet a series of conditions to improve the humanitarian situation in Gaza. Other nations, including France, Australia and Canada, have said they plan to take the same step at the UN gathering. Explainer: What does recognising a Palestinian state mean? The UK has consistently argued that the issue of whether Israel has committed genocide was a matter for the courts. Israel is fighting a case at the International Court of Justice in The Hague in which the country is accused of genocide. But some opposition leaders, including Zack Polanski for the Green Party, and the Liberal Democrats' Sir Ed Davey have specifically referred to the situation in Gaza as genocide. Read more from Sky News:Watch: Israel's Gaza City offensiveMPs denied entry into West Bank  On Tuesday, the UN Independent International Commission of Inquiry on the Occupied Palestinian Territory released a report, claiming: \"It is clear that there is an intent to destroy the Palestinians in Gaza\". It said Israel's actions meet the criteria set down for defining a genocide. The UK government has said its official position was it \"has not concluded that Israel is acting with that [genocidal] intent\". Israel is currently undertaking a major ground offensive in Gaza, with thousands forced to flee from Gaza City in recent days."
    },
    {
        "title": "Starmer-Trump talks could be landmark moment - and join pantheon of UK-US summits",
        "description": "In years to come, it may become known simply as Chequers '25.",
        "url": "https://news.sky.com/story/starmer-trump-talks-could-be-landmark-moment-and-join-pantheon-of-uk-us-summits-13433006",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-state-visit-donald-trump_7023394.png?20250917204535",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-09-17 19:18:00",
        "Headline": "Sir Keir Starmer is set to meet Donald Trump today for what could be a monumental moment. But what does history tell us about past meetings, and what can the PM learn?",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  In years to come, it may become known simply as Chequers '25. But today's summit between Sir Keir Starmer and Donald Trump, at the prime minister's country retreat, has the potential to be a landmark moment in UK-US history. There's plenty of scope for it to go horribly wrong, of course: over Jeffrey Epstein, Sir Keir's pledge to recognise Palestine, the president's lukewarm support for Ukraine, the Chagos Islands sell-off, or free speech. Trump state visit live - read the latest  But on the other hand, it could be a triumph for the so-called \"special relationship\" - as well as relations between these two unlikely allies - with deals on trade and tariffs and an improbably blossoming bromance. Either way, this Chequers summit - on the president's historic second state visit to the UK - could turn out to be one of the most notable one-to-one meetings between PM and president in 20th and 21st century history. Sir Keir and Mr Trump have already met several times, most recently at The Donald's golf courses in Scotland in late July and, before that, memorably at the White House in February. It was then that the PM theatrically pulled King Charles's invitation for this week's visit out of his inside pocket in a spectacular stunt surely masterminded by the \"Prince of Darkness\", spin doctor-turned-ambassador (until last week, anyway) Peter Mandelson. And over the years, there have been some remarkable and historic meetings and relationships, good and bad, between UK prime ministers and American presidents. From Churchill and Roosevelt to Eden and Eisenhower, from Macmillan and JFK to Wilson and Johnson, from Thatcher and Reagan, to Blair and Bush, and from Cameron and Obama… to Starmer and Trump, perhaps?  A brief history of relationships between PMs and presidents Throughout UK-US history, there have been many examples of a good relationship and close bond between a Labour prime minister and a Republican president. And vice versa. Also, it has not always been rosy between prime ministers and presidents of the two sister parties. There have been big fallings out: over Suez, Vietnam and the Caribbean island of Grenada. Leading up to this Chequers summit, the omens have not been good. First, the PM was forced to sack his vital link between Downing Street and the Oval Office, Lord Mandelson, over his friendship with Epstein.  Second, the president arrived in the UK to a barrage of criticism from London Mayor Sir Sadiq Khan, who accused him of doing more than anyone else to encourage the intolerant far right across the globe. And third, in a video-link to the 'Unite the Kingdom' march in London last weekend, one-time Trump ally Elon Musk called for a dissolution of parliament and a change of government and appeared to encourage violent protest. Churchill and FDR Back in the mid-20th century, the godfather of the \"special relationship\" was wartime leader Sir Winston Churchill, though it was 1946 before he first coined the phrase in a speech in the US, in which he also spoke of the \"iron curtain\". It was in 1941 that Churchill held one of the most significant meetings with a US president, Franklin D Roosevelt, at a Washington conference to plot the defeat of Germany after Japan's attack on Pearl Harbour. Churchill arrived in Washington in December after a rough 10-day voyage on a Royal Navy battleship and stayed three weeks, spending Christmas in the White House and on Boxing Day becoming the first UK PM to address Congress. The close bond between Churchill and Roosevelt was described as a friendship that saved the world. It was even claimed one reason the pair got on famously was that they were both renowned cigar smokers. Churchill and Truman After the war ended, Churchill's \"special relationship\" speech, describing the alliance between the UK and US, was delivered at Westminster College, in Fulton, Missouri in March 1946. The speech was introduced by President Harry Truman, a Democrat, with whom Churchill had attended the Potsdam Conference in 1945 to negotiate the terms of ending the war. These two were also close friends and would write handwritten letters to each other and address one another as Harry and Winston. Mr Truman was also the only US president to visit Churchill at Chartwell, his family home. Eden and Eisenhower But the transatlantic cosiness came to an abrupt end in the 1950s, when Churchill's Conservative successor Anthony Eden fell out badly with the Republican president Dwight Eisenhower over the Suez Crisis. Mr Eden did visit Mr Eisenhower in Washington in January 1956, and the official record of the meeting describes the discussion as focussing on \"policy differences and Cold War problems\". Macmillan and JFK But in the early 1960s, a Conservative prime minister and a Democrat president with seemingly nothing in common, the stuffy and diffident Harold Macmillan, and the charismatic John F Kennedy, repaired the damage. They were credited with rescuing the special relationship after the rupture of the Suez Crisis, at a time of high tensions around the world: the Berlin Wall, the Cuban missile crisis, and the threat of nuclear weapons. The two leaders exchanged handwritten notes, as well as Christmas and birthday cards. The Macmillans visited the Kennedys twice at the White House, in 1961 and 1962 - the second described in the US as a \"momentous\" meeting on the Cuban crisis. The relationship was abruptly cut short in 1963 by \"Supermac's\" demise prompted by the Profumo scandal, and JFK's assassination in Dallas. But after her husband's death, Jacqueline Kennedy was said to have had a father-daughter relationship with Macmillan, who was said to have been enchanted with her. Wilson and LBJ  After JFK, the so-called \"special relationship\" cooled once again - and under a Labour prime minister and Democrat president - when Harold Wilson rejected pressure from Lyndon B Johnson to send British troops to Vietnam. Mr Wilson became prime minister in 1964, just two months after LBJ sent US troops. His first overseas trip was to the White House, in December 1964, and the PM returned to tell his cabinet: \"Lyndon Johnson is begging me even to send a bagpipe band to Vietnam.\" Thatcher and Reagan And even though Margaret Thatcher and Ronald Reagan were ideological soulmates, Thatcher was furious when she wasn't consulted before the Americans invaded Grenada in 1983 to topple a Marxist regime. Even worse, according to Mrs Thatcher allies, a year earlier, Reagan had stayed neutral during the Falklands war. Reagan said he couldn't understand why two US allies were arguing over \"that little ice-cold bunch of land down there\". But their relationship didn't just survive, it flourished, including at one memorable visit to the presidential retreat at Camp David in 1984, where President Reagan famously drove Mrs T around in a golf buggy. They would also memorably dance together at White House balls. Blair and Bush  Camp David was also where in 2001 the Republican president George W Bush and Labour's Sir Tony Blair embarked on the defining mission of his premiership: the Iraq War. It was to prove to be an historic encounter. The war was the turning point of Sir Tony's decade in Number 10. He was branded a liar over claims about Saddam Hussein's \"weapons of mass destruction\", he was vilified by the Labour left, and it was the beginning of the end for him. And to add to the suspicion among Sir Tony's critics that he was Mr Bush's poodle, in 2006 at a G8 summit in St Petersburg - that wouldn't happen now - a rogue microphone picked up the president calling, \"Yo, Blair! How are you doing?\" Cameron and Obama Some years later, the Tory prime minister sometimes called the \"heir to Blair\", David Cameron, bonded over burgers with the Democrat president Barack Obama, serving a BBQ lunch to military families in the Downing Street garden. They also played golf at the exclusive Grove resort in 2016. They seemed unlikely allies: Obama, the first African-American president, and Cameron, the 19th old Etonian prime minister. It was claimed they had a \"transatlantic bromance\" in office. \"Yes, he sometimes calls me bro,\" Lord Cameron admitted. But not everything went well. The Tory PM persuaded Mr Obama to help the Remain campaign in the 2016 Brexit referendum, when he claimed the UK would be \"at the back of the queue\" on trade deals with the US, if it left the EU. It backfired, of course. Now it's Sir Keir Starmer's turn to tread a delicate and potentially hazardous political tightrope as he entertains the latest - and most unconventional - US president. The greatest dangers for Sir Keir will be a news conference in the afternoon, in the gardens, if the weather permits. Good luck, as they say, with that. Before then, there's the potential for what the Americans call a \"pool spray\", one of those impromptu, rambling and unpredictable Q&As we've seen so many times in the Oval Office. For Sir Keir, what could possibly go wrong? Chequers '25 could be memorable and notable, like so many previous meetings between a PM and a president. But not necessarily for the right reasons for this UK prime minister."
    },
    {
        "title": "Home Office to appeal temporary block on man's deportation under 'one in, one out' plan",
        "description": "The Home Office will appeal against the High Court's decision to temporarily block the deportation of an Eritrean man to France under the government's \"one in, one out\" scheme, Shabana Mahmood has confirmed.\n",
        "url": "https://news.sky.com/story/home-office-to-appeal-temporary-block-on-mans-deportation-13432899",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-small-boats-starmer_6989917.png?20250813164711",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-17 16:23:00",
        "Headline": "Shabana Mahmood has vowed to \"fight\" attempts to block the first deportation flight under the UK-France returns deal.",
        "Content": "The Home Office will appeal against the High Court's decision to temporarily block the deportation of an Eritrean man to France under the government's \"one in, one out\" scheme, Shabana Mahmood has confirmed.\n Speaking for the first time since the court's decision on Tuesday, the new home secretary said: \"Last minute attempts to frustrate a removal are intolerable, and I will fight them at every step.\" Ms Mahmood added that she will \"fight to end vexatious, last-minute claims\" and \"robustly defend the British public's priorities\". Yesterday evening, the High Court granted an Eritrean man, who cannot be named for legal reasons, a \"short period of interim relief\" ahead of his deportation to France scheduled for a 9am flight this morning. Lawyers acting on the man's behalf said the case \"concerns a trafficking claim\" and her client, who alleges he has a gunshot wound in his leg, claims he is vulnerable and faces a risk of \"destitution\" in France. The Home Office defended the case, saying it was reasonable to expect the man to claim asylum in France. Mr Justice Sheldon ruled that while there did not appear to be a \"real risk\" the man would be destitute in France, the trafficking claim required further interrogation. \n                  Sadiq Khan calls out Gaza 'genocide', as Starmer 'delays' recognising Palestinian state until end of Trump's state visit\n                 \n                  Starmer-Trump talks could be landmark moment - and join pantheon of UK-US summits\n                 \n                  Radical overhaul of how schools support special needs students demanded by MPs\n                 The man would have been the first person to be returned to France under the terms of the UK-France deal, which was signed in July and led to the first people being detained after crossing the Channel in August. In a statement, Ms Mahmood added: \"Migrants suddenly deciding they are a modern slave on the eve of their removal, having never made such a claim before, make a mockery of our laws and this country's generosity. \"I will do whatever it takes to secure our border.\" She has also announced she will review the Modern Slavery Act to see where it is currently open to misuse.  The Home Office has confirmed the temporary block on the man's deportation will be challenged in the courts, and that lawyers acting for the man have 14 days to provide proof for their claim that he has been trafficked to the UK. It also insisted that the first deportation flight under the UK-France migrants returns deal will still take place this week. Conservative Party leader Kemi Badenoch was quick to criticise the government over the ruling on Tuesday, saying: \"We told you so\". Responding to Ms Mahmood's comments, the Tories' Chris Philp said the home secretary \"is reacting in panic to the collapse of her gimmick returns deal\". The shadow home secretary added: \"No one is fooled by tough talk from Labour. They will never do the hard work needed to tackle the lawfare that blocks removals. \"The truth is, Labour is run by human rights lawyers - Keir Starmer and Lord Hermer - who have always sided with open borders activists over security and control.\" Mr Philp added that the \"weak government will continue to preside over borders chaos\". Reform UK has repeatedly criticised the policy and has also hit back at the home secretary following her statement. Zia Yusuf, the party's head of policy, said: \"These are empty words from a home secretary who is out of her depth. \"Without a total legal reset, including leaving the ECHR [European Convention on Human Rights] and disapplying international treaties like the 1951 Refugee Convention, activist lawyers will continue abusing the legal system to prevent deportations.\" What is the scheme? The pilot scheme was announced to much fanfare in July, after French President Emmanuel Macron made a state visit to the UK. Sir Keir Starmer had hoped the agreement - which would see the UK send asylum seekers who have crossed the Channel back to France in exchange for legal migrants with links to Britain - would prove more resilient to court challenges than the Tories' Rwanda plan. He wants the number of migrants being returned to France to gradually increase over the course of the scheme, to deter them from coming in small boats. The pilot came into force last month and is in place until June 2026."
    },
    {
        "title": "Radical overhaul of how schools support special needs students demanded by MPs",
        "description": "A radical overhaul of the way mainstream schools support children with special educational needs and disabilities (SEND) is needed to stop the system from collapsing under growing demand, MPs have warned.",
        "url": "https://news.sky.com/story/radical-overhaul-of-how-schools-support-special-needs-students-demanded-by-mps-13433131",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lauren-and-her-son_7023549.jpg?20250917224124",
        "type": "Politics",
        "Author": "Anjum Peerbacos",
        "Date Published": "2025-09-17 22:02:00",
        "Headline": "With 1.7 million children identified as having SEND, a cultural shift across the sector, backed by investment in training and staff, is needed for schools to become genuinely inclusive, a cross-party report says.",
        "Content": "\n          Education reporter\n       A radical overhaul of the way mainstream schools support children with special educational needs and disabilities (SEND) is needed to stop the system from collapsing under growing demand, MPs have warned. The number of children identified with SEND has soared from 1.3 million in 2019 to 1.7 million this year. In 2024/25, more than 1.2 million pupils were receiving SEND support, with nearly half a million holding an education health care plan (EHCP). Helen Hayes, Education Committee chair, said the findings show that only with a cultural shift across the sector, backed by investment in training and staff, will schools be genuinely inclusive. Ms Hayes told Sky News she would like to see \"a fully inclusive education system that means defining what inclusive means and properly resourcing the delivery of that\". Asked if the report was a recommendation to replace all specialist schools with mainstream SEND provision, she said: \"No, not at all, quite the opposite. \"Our report calls for more investment in specialist schools in the state sector. \"The current approach to funding is not sustainable, it's driving local authorities to the edge of bankruptcy.\" Read more education news:Why SEND plans worry parentsOfsted report cards 'add insult to injury'  Autism is now the most common need cited in EHCPs, accounting for over a third of cases, but MPs also heard of sharp increases in speech, language, and communication needs, as well as social, emotional and mental health needs, particularly since the pandemic. Ms Hayes said ministers \"shouldn't be making any changes to EHCPs as they currently work\". \"They are an important statutory part of the system; there will always be children who need them,\" she added. 'It's incredibly hard to watch' Lauren's six-year-old son was diagnosed with autism in January, and she is still waiting for his EHCP and further reassessments. She said she is \"flabbergasted by the level of failure we've faced, and I know we're not the only ones\". \"It's incredibly hard to watch a child who's already vulnerable be pushed even further into disadvantage by the very systems that were supposed to protect and support him,\" she said. The cross-party committee stresses that the long-term solution lies in embedding inclusivity across all schools, from early years through to post-16, with needs identified earlier and support delivered by staff trained in SEND. Such a shift, the report argues, would ease demand for complex, expensive EHCPs, help balance stretched budgets, and ensure children are supported before issues escalate. Read more on Sky News:Southport killer's parents 'knew risk'Robert Redford's grandchildren pay tribute Rachel Filmer, co-founder of Save Our Children's Rights, said her organisation welcomed \"any measures to make mainstream schools genuinely more inclusive, but this cannot be inclusion in name only\". \"It is vital that children retain the right to statutory plans, to individualised support, and to specialist school placements if this is in the child's best interests,\" she added. While the report highlights examples of strong practice in England and abroad, it also acknowledges many families are still facing long waits for assessments. The report does not draw a conclusion on the causes of rising need, but expert witnesses pointed to a mix of factors, from greater awareness and better diagnosis to wider social and health trends."
    },
    {
        "title": "MSPs vote to abolish Scottish legal system's controversial not proven verdict",
        "description": "MSPs have voted to abolish Scotland's controversial not proven verdict.",
        "url": "https://news.sky.com/story/msps-vote-to-abolish-scottish-legal-systems-controversial-not-proven-verdict-13432747",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-scottish-parliament_6496922.jpg?20250917141057",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-09-17 13:00:00",
        "Headline": "The Victims, Witnesses and Justice Reform (Scotland) Bill was passed on Wednesday following a lengthy debate of more than 160 amendments that began the day before.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n MSPs have voted to abolish Scotland's controversial not proven verdict. The Scottish government's flagship Victims, Witnesses and Justice Reform (Scotland) Bill was passed on Wednesday following a lengthy debate of more than 160 amendments that began the day before. The new legislation makes a series of changes to the justice system, including scrapping the not proven verdict; establishing a specialist sexual offences court; creating a victims and witnesses commissioner; reforming the jury process to require a two-thirds majority for conviction; and implementing Suzanne's Law which will require the parole board to take into account if a killer continues to refuse to reveal where they hid their victim's body. Following Royal Assent, the legislation will be implemented in phases. Justice Secretary Angela Constance said: \"This historic legislation will put victims and witnesses at the heart of a modern and fair justice system. \"By changing culture, process and practice across the system, it will help to ensure victims are heard, supported, protected and treated with compassion, while the rights of the accused will continue to be safeguarded. \"This legislation, which builds on progress in recent years, has been shaped by the voices of victims, survivors, their families and support organisations, and it is testimony to their tireless efforts to campaign for further improvement. \n                  Human remains found in Loch Lomond identified as missing man as police probe 'unexplained death'\n                 \n                  Edinburgh charity worker embezzled nearly £30,000 from vulnerable and disabled victims\n                 \n                  Scottish council begins legal action to evict 'African tribe' from new campsite\n                 \"I am grateful to those who bravely shared their experiences to inform the development of this legislation and pave a better, more compassionate path for others.\" Currently, juries in Scotland have three verdicts open to them when considering the evidence after a trial, and can find an accused person either guilty or not guilty, or that the case against them is not proven. Like not guilty, the centuries-old not proven verdict results in an accused person being acquitted. Critics have argued it can stigmatise a defendant by appearing not to clear them, while failing to provide closure for the alleged victim. Notable cases which resulted in a not proven verdict include Sir Hugh Campbell and Sir George Campbell, who were tried for high treason in 1684 for being present at the Battle of Bothwell Bridge. The murder of Amanda Duffy, 19, in South Lanarkshire in 1992 sparked a national conversation around the existence of the not proven verdict and double jeopardy rules. Suspect Francis Auld stood trial but the case was found not proven by a jury and an attempt to secure a retrial failed in 2016. Auld died the following year. In 2018, a sexual assault case against former television presenter John Leslie was found not proven. And in 2020, former first minister Alex Salmond was found not guilty on 12 sexual assault charges, while one charge of sexual assault with intent to rape was found not proven. Victim Support Scotland (VSS) had earlier urged MSPs to put aside party politics and vote \"for the intention of the bill\". Kate Wallace, chief executive of VSS, believes the act is a \"solid foundation\" on which to build further improvements. She added: \"The passing of this act represents a momentous occasion for Scotland's criminal justice system. \"It marks a significant step towards creating a system that considers and prioritises the needs of people impacted by crime.\" VSS worked with the families of Arlene Fraser and Suzanne Pilley to spearhead Suzanne's Law. Ms Fraser was murdered by estranged husband Nat Fraser in 1998, while Ms Pilley was killed by David Gilroy in 2010. To date, the women's bodies have never been recovered. Before the bill, parole board rules dictated that a killer's refusal to disclose the information \"may\" be taken into account. The new legislation means parole boards \"must\" take the refusal to cooperate into account. Carol Gillies, sister of Ms Fraser, and Gail Fairgrieve, sister of Ms Pilley said: \"We have done everything possible to make this change to parole in memory of Arlene and Suzanne, and for other people who have lost their lives in such a horrific way. \"For our families, the passing of this act and the change to parole are momentous.\" Read more from Sky News:Why next year's Scottish elections could get messy The Scottish Conservatives and Scottish Labour voted against the bill. Although in support of the abolition of the not proven verdict, the Scottish Tories said they had been left with no alternative but to oppose the bill after the SNP rejected a series of amendments. The party had called for a Scotland-only grooming gangs inquiry; wanted victims to be told if a decision was taken not to prosecute an accused; and for all victims to be informed if a plea deal was struck between defence and prosecution lawyers. They also wanted Suzanne's Law to be strengthened, which would have compelled killers to reveal the location of their victim's body or risk having their parole rejected - ensuring \"no body, no release\". MSP Liam Kerr, shadow justice secretary, said: \"This half-baked bill sells the victims of crime desperately short. \"By ignoring many of the key demands of victims' groups, the SNP have squandered the chance for a long overdue rebalancing of Scotland's justice system. \"The Scottish Conservatives' common sense amendments would have given this legislation real teeth but, by rejecting them, the nationalists have delivered a victims' bill in name only. \"While we back the abolition of the not proven verdict, the SNP's intransigence on a number of key issues meant we could not support this bill in its final form.\""
    },
    {
        "title": "No 10 insists migrant returns deal isn't a 'shambles' after court blocks man's removal",
        "description": "Downing Street has insisted its migrant returns scheme with France is not a \"shambles\" after the High Court blocked a man's deportation.",
        "url": "https://news.sky.com/story/no-10-insists-migrant-returns-deal-isnt-a-shambles-after-court-blocks-first-removal-13432534",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-english-channel-migrants_6966846.jpg?20250717110152",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-17 00:52:00",
        "Headline": "Sir Keir Starmer's deal with Emmanuel Macron, announced earlier this summer, would see the UK send asylum seekers who have crossed the Channel in small boats back to France in exchange for migrants with links to Britain.",
        "Content": "Downing Street has insisted its migrant returns scheme with France is not a \"shambles\" after the High Court blocked a man's deportation. Having seen the previous Conservative government's Rwanda scheme run into trouble with the courts, the Labour administration's alternative suffered its own setback on Tuesday. An Eritrean man, who cannot be named for legal reasons, was due to be on a flight to France this morning. He brought a legal claim against the Home Office, with lawyers acting on his behalf saying the case \"concerns a trafficking claim\". They also said he had a gunshot wound to his leg, and would be left destitute if he was deported. The Home Office said it was reasonable to expect him to have claimed asylum in France before he reached the UK in August, but the ruling went in his favour. Mr Justice Sheldon granted the man a \"brief period of interim relief\". While the judge said there did not appear to be a \"real risk\" he would face destitution in France, the trafficking claim required further interrogation. He said the case should return to court \"as soon as is reasonably practical in light of the further representations the claimant […] will make on his trafficking decision\". A Number 10 spokesperson downplayed the development, insisting removals under the deal with France will start \"imminently\" and ministers are not powerless in the face of the courts.  'We told you so' The pilot scheme was announced to much fanfare in July, after Emmanuel Macron made a state visit to the UK. Sir Keir Starmer had hoped the agreement - which would see the UK send asylum seekers who have crossed the Channel back over to France in exchange for migrants with links to Britain - would prove more resilient to court challenges than the Tories' Rwanda plan. He wants the number of migrants being returned to France to gradually increase over the course of the scheme, to deter them from coming in small boats. The pilot came into force last month and is in place until June 2026. Tory leader Kemi Badenoch was quick to say \"we told you so\" following Tuesday's court decision, while Reform UK's Nigel Farage criticised the government's plan. Mr Farage - who has said he would deport anyone who arrives in Britain illegally - said: \"Even if the policy worked, one in, one out, and with another one in, still means plus one for everyone that crosses the Channel.\"  The small boats crisis represents one of the biggest challenges for the new home secretary, Shabana Mahmood, following her promotion in Sir Keir's recent reshuffle. Speaking to Sky News' Politics Hub With Sophy Ridge, Labour peer Maurice Glasman backed her to deliver. Describing the former justice secretary as \"very tough\", he said: \"She's completely for real. I've known her for over 10 years - she really wants to see law and order restored.\""
    },
    {
        "title": "'Shameful' that two MPs were denied entry into West Bank, Streeting says",
        "description": "Health Secretary Wes Streeting has criticised Israel's \"shameful but not surprising\" actions after two medically trained MPs were denied entry into the occupied West Bank.",
        "url": "https://news.sky.com/story/shameful-that-two-mps-were-denied-entry-into-west-bank-streeting-says-13432572",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-west-bank-israel_6990726.jpg?20250814145433",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-17 06:26:00",
        "Headline": "Labour MPs Peter Prinsley and Simon Opher, who are both doctors, were travelling in a parliamentary delegation to see medical and humanitarian work being carried out.",
        "Content": "Health Secretary Wes Streeting has criticised Israel's \"shameful but not surprising\" actions after two medically trained MPs were denied entry into the occupied West Bank. Labour MPs Peter Prinsley and Simon Opher, who are both doctors, were travelling in a parliamentary delegation to see medical and humanitarian work being carried out by organisations such as Medical Aid for Palestinians (MAP). They were also due to meet British diplomats in Jerusalem, as well as Palestinian and Israeli human rights organisations, in a visit organised by the Council for Arab-British Understanding (CAABU).  Politics live: Court ruling 'will not stop' France migrant deal, says cabinet minister However, in a joint statement on Tuesday night, the pair said Israeli authorities had \"prevented them from seeing first-hand the grave challenges facing medical facilities in the region and from hearing the British government's assessment of the situation on the ground\", calling this \"deeply regrettable\". Mr Streeting wrote on social media: \"Having been on a number of delegations to Israel and Palestine, including with @MedicalAidPal @Caabu, I find the treatment of two highly respected clinicians and Members of Parliament by the Israeli government shameful, but no longer surprising.\" \n                  'At least 16' killed in latest Israeli attacks on Gaza - as 10 children arrive in UK for NHS treatment\n                 \n                  Pressure mounts on PM to raise Israel's Gaza offensive with Trump\n                 \n                  Thousands of families remain in Gaza City as Israeli army advances\n                 Foreign Office minister Hamish Falconer said the decision to deny entry to the two MPs was \"unacceptable\". He said: \"I have remained in contact with both colleagues throughout and I have been clear with the Israeli authorities that this is no way to treat British parliamentarians.\" Chris Doyle, the director of CAABU, said that \"visiting the occupied Palestinian territory and seeing humanitarian and medical projects should not be subject to an Israeli veto\". The Israeli embassy in London has been contacted for comment. Dr Prinsley, the MP for Bury St Edmunds and Stowmarket, and Dr Opher, the MP for Stroud, were both elected in 2024 and have extensive backgrounds in healthcare. Dr Prinsley has been an NHS surgeon for 30 years and retired recently to focus on his work in parliament, while Dr Opher chairs an all-party parliamentary group on health and works as a GP. Read More: Pressure mounts on PM to raise Israel's Gaza offensive with Trump  Dr Opher told the BBC he and his colleague were held in a passport office and given a \"legal form insisting that we leave the country\" before being \"escorted to a bus\" back to Jordan. \"It's very disappointing. We are both doctors and we were really just going to look at healthcare facilities in the West Bank to see if there was anything we could do to support them,\" he said. \"We weren't in any way trying to undermine the Israelis, just trying to see what we could do in the West Bank\" where, he said, they had been told healthcare was getting increasingly difficult. He said he was not being admitted under \"public order\" grounds. In April, two other Labour MPs, Abtisam Mohamed and Yuan Yang, were denied entry to Israel on another visit organised by CAABU and MAP. It sparked a political row at the time as Israel's UK embassy says they were denied entry because they had \"accused Israel of false claims\" and were \"actively involved in promoting sanctions against Israeli ministers\". Then foreign secretary David Lammy called the move \"unaccaptable\", while the two MPs said parliamentarians \"should feel free to speak truthfully in the House of Commons, without fear of being targeted\"."
    },
    {
        "title": "Pressure mounts on PM to raise Israel's Gaza offensive with Trump",
        "description": "Sir Keir Starmer is under mounting pressure to raise Israel's bombardment of Gaza with Donald Trump during his UK state visit, after a UN Commission said a genocide was taking place.",
        "url": "https://news.sky.com/story/pressure-mounts-on-pm-to-raise-israels-gaza-offensive-with-trump-13432530",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gaza-palestinians-israeli_7021890.jpg?20250916093927",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-17 00:02:00",
        "Headline": "Israel is continuing to expand its offensive in Gaza City, despite Sky News analysis finding thousands of families remain there in camps of tents. ",
        "Content": " Sir Keir Starmer is under mounting pressure to raise Israel's bombardment of Gaza with Donald Trump during his UK state visit, after a UN Commission said a genocide was taking place. Liberal Democrat leader Sir Ed Davey used the president's arrival on Tuesday night to call for action on the escalating situation, as Israeli forces advance in Gaza City. Sky News analysis has found thousands of families remain in the city's crowded tent camps, despite a ground offensive beginning yesterday. Sir Ed, who is boycotting the state dinner being held for Mr Trump, said Sir Keir must \"press\" the president now. He said: \"What is happening in Gaza is a genocide. And the president of the United States, who wants a Nobel Peace Prize, is doing nothing to stop it.\" On Tuesday, a United Nations Commission agreed Israel was committing genocide in Gaza - the first time such an explosive allegation has been made publicly by a UN body. Israel's foreign ministry said it \"categorically rejects this distorted and false report\" and called for the commission to be abolished.  Reports suggest the situation will be a talking point between Sir Keir and Mr Trump during his visit. The calls to Sir Keir to press his US counterpart come before the UK is due to recognise a Palestinian state at the UN General Assembly later this month, along with allies including Canada and France. In a late night statement, Canada's foreign ministry described the Gaza City offensive as \"horrific\". 'We cannot be bystanders' Lib Dem leader Sir Ed added: \"We have long said that Hamas is genocidal and condemned them for their actions. \"Now, I think we have to say that what the Netanyahu government is doing amounts to genocide.\" Labour MP Rosena Allin-Khan, a former shadow minister, also called on her party leader to make discussing the situation in Gaza with Mr Trump a \"top priority\". Speaking to Sky News' Politics Hub With Sophy Ridge, she said: \"We say 'never again' when we look at Bosnia and Rwanda, but here we are again, and it's been livestreamed, and we've all seen it. \"We cannot be bystanders to a genocide.\"  It emerged on Tuesday that two of Ms Allin-Khan's colleagues, MPs Peter Prinsley and Simon Opher, were denied by Israel from entering the West Bank. They were part of a UK parliamentary delegation to observe medical and humanitarian work being carried out. They were also due to meet British diplomats in Jerusalem, as well as Palestinian and Israeli human rights organisations. But they were instead held in a passport office and presented with a \"legal form\" insisting they leave the country. UN report pulls no punches The accusation of genocide is made by the UN Independent International Commission of Inquiry on the Occupied Palestinian Territory. It alleges Israel has been \"killing Palestinians or forcing them to live in inhumane conditions that led to death; causing serious bodily or mental harm, including through torture, displacement and sexual crime; deliberately imposing inhumane conditions, and fourthly, imposing measures intending to prevent births\". Read more from Sky News:Zelenskyy makes demand of TrumpTrump sues New York Times Earlier this month, the International Association of Genocide Scholars also passed a resolution stating that Israel's conduct passed the threshold of committing genocide. However, a report from the British government said it had \"not concluded\" that Israel intended to \"destroy in whole or in part a national, ethnic, racial or religious group\". Nearly 65,000 people are now believed to have died, according to figures collated by Gaza's Hamas-run health ministry. It does not distinguish between civilians and combatants in its count."
    },
    {
        "title": "'Disappointing' no steel tariff deal done before Trump in town, industry says",
        "description": "The UK steel industry body has said it is \"disappointing\" that exports of the metal will be hit with 25% tariffs. ",
        "url": "https://news.sky.com/story/disappointing-no-steel-tariff-deal-done-before-trump-in-town-industry-says-13432627",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-blast-furnace-conway_6875398.jpg?20250404000423",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-17 09:23:00",
        "Headline": "Tariffs on steel to the US do not fall within the US-UK trade deal and are currently set at 25%. ",
        "Content": "The UK steel industry body has said it is \"disappointing\" that exports of the metal will be hit with 25% tariffs.  UK Steel, however, did welcome the certainty and competitive nature of the agreed 25% tax on exports of steel entering the US. \"It will be disappointing if we do not have the tariff-free quota level, but if the US was never offering that deal, then the final decision on 25% offers a degree of certainty and potentially a competitive advantage so long as other countries remain at 50%,\" said the director general of UK Steel, Gareth Stace.  It comes after the UK missed the White House-imposed deadline to agree a trade deal on steel and aluminium in July. While a trade deal was signed in June, it did not include metals and left steel and aluminium to fall under blanket Trump administration rules. Read more:Last UK blast furnaces days from closing as Chinese owners cut off key supplyHow Donald Trump's tariffs are wreaking chaos in the British metal industry There were hopes a zero-tariff agreement could have been reached as President Trump comes to Britain to visit the King but instead the UK managed to avoid the 50% tariff applied to other states. Those hopes remain, based on comments from Mr Trump before he boarded his plane to Britain. \"We've made a deal, and it's a great deal, and I'm into helping them,\" Mr Trump said, referring to the UK government. \"They'd like to see if they could get a little bit better deal. So, we'll talk to them.\" Exports to the US make up 6% of all UK steel exports by volume and 9% by value. \"The reality is that the deluge of heavily subsidised steel flooding into international markets is forcing countries across the world to erect trade barriers to protect their industries,\" UK Steel's Mr Stace said. \"It is even more imperative now that the UK government beefs up its own trade defences to ensure UK steelmakers have a sustainable share of their own market. In these market conditions, the last country to protect their industry will be the first to lose it.\""
    },
    {
        "title": "Meta announces new smart glasses with a bold claim. I've tried them - and am unconvinced",
        "description": "Meta has announced smart glasses with a screen in the right lens, meaning you can read WhatsApp messages, look at a map or translate a conversation - all from the comfort of your face.",
        "url": "https://news.sky.com/story/meta-announces-new-smart-glasses-with-a-bold-claim-ive-tried-them-and-am-unconvinced-13432792",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-meta-smart-glasses_7023626.png?20250918021439",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-09-17 14:29:00",
        "Headline": "Meta believes the new glasses keep \"you tuned in to the world around you, not distracted from it\". But I tried the tech on at an event with the company earlier this month and found the opposite.",
        "Content": "\n          Science and technology reporter\n       Meta has announced smart glasses with a screen in the right lens, meaning you can read WhatsApp messages, look at a map or translate a conversation - all from the comfort of your face. The company describes them as the world's most advanced AI glasses, and it's the first time it has put a display in its smart Ray-Bans. Mark Zuckerberg believes such hi-tech specs are the future of portable computing, telling the unveiling event they're \"the only form factor where you can let AI see what you see, hear what you hear\". Released on 30 September for $799 (£587), the display is controlled using a neural band that wraps around the user's wrist and monitors their hand movements. A twist of the fingers will turn the glasses' volume up or down or zoom on the camera; two taps of the thumb to the forefinger will close the display and soon, users will be able to write texts by drawing letters in the air. \"The amount of signals the band can detect is incredible - it has the fidelity to measure movement even before it's visually perceptible,\" said a Meta spokesperson. The company says their glasses are \"designed to help you look up and stay present\", a \"technology that keeps you tuned in to the world around you, not distracted from it\". But I tried the tech on at an event with Meta earlier this month and found the opposite. I was so distracted by the display that during an interview with Ankit Brahmbhatt, director of product management at Meta, I realised I was watching a game I'd accidentally left on in my lens. I confessed and asked Mr Brahmbhatt if the glasses would actually help enable better face-to-face conversations, or if people would simply look more engaged because they weren't looking down at their phone. \"I don't think we're saying we have all the answers yet, right? Just like when we were first introduced to smartphones or any other new paradigm, there's a lot of things that evolve over time,\" said Mr Brahmbhatt. \"We feel very much that this is already going to make you much more heads up and in the moment. With AI glasses, you actually have the sense of being able to engage.\" But having a screen in your vision can be very distracting - research has repeatedly shown our brains simply aren't designed to cope with two activities at a time. In one famous study published in the Applied Cognitive Psychology journal, people walking down a road while doing a task on their phone didn't even notice a unicycling clown riding in front of them. Read more from Sky News:How most people are using ChatGPTNHS medicines bill 'should rise to preserve UK drug industry' It's a phenomenon called inattentional blindness. \"People are cognitively distracted all of the time [by devices]. It's just that in particular circumstances, such as driving, the risks are so much higher,\" said Professor Gemma Briggs, professor of applied cognitive psychology at the Open University. Although the display on Meta's glasses will turn off automatically when it detects you're driving, there's nothing to stop users from switching it back on. This could lead to dangerously distracted drivers, according to Professor Briggs. \"My research has demonstrated that it really doesn't make any difference whether you're touching, holding, manipulating your phone or whether it's hands-free, you're still far more likely to be distracted. \"That means you're four times more likely to be involved in a collision, you are significantly less likely to notice hazards that occur, even if they occur straight ahead of you and any hazards that you do notice, you will take a lot longer to react to,\" said Professor Briggs. Meta insists these glasses will make sure their wearers stay in the moment and engaged. For some, however, phones are already distracting enough - let alone when you have one strapped to your face."
    },
    {
        "title": "New AI model could predict risk of disease a decade before symptoms",
        "description": "A new AI model could predict a patient's risk of more than 1,000 diseases a decade before they actually develop symptoms, according to new results.",
        "url": "https://news.sky.com/story/new-ai-model-could-predict-risk-of-disease-a-decade-before-symptoms-13432645",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-artificial-intelligence_7022783.jpg?20250917110608",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-09-17 10:01:00",
        "Headline": "The AI tool learned how 400,000 people's medical history changed over time, picking out patterns that were associated with later diseases.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n A new AI model could predict a patient's risk of more than 1,000 diseases a decade before they actually develop symptoms, according to new results. The scientists who created the tool hope it could be ready for GPs and other doctors to use within 5 to 10 years, giving patients an early warning that they need to change their lifestyles or perhaps start medical intervention. Ewan Birney, who led the team at the European Molecular Biology Laboratory in Cambridge, said it was \"one of the most exciting bits of science I have been involved in - it's really cool.\" The AI tool, called Delphi, was trained on the anonymised medical records of 400,000 people who have signed up to the UK Biobank research database. It learned how their medical history changed over time, picking out patterns that were associated with later diseases. The tool was then unleashed on the records of 1.9 million patients in the Danish National Patient Registry and was able to make \"meaningful\" predictions of the risk and timing of over 1,000 diseases, according to results published in the journal Nature. Read more from Sky News:How most people are using ChatGPTNHS medicines bill 'should rise to preserve UK drug industry' \n                  Meta announces new smart glasses with a bold claim. I've tried them - and am unconvinced\n                 \n                  Chimpanzees consume 'two alcoholic drinks a day', study says\n                 \n                  Trump to sign US-UK tech partnership in drive for AI\n                 \"By modelling how illnesses develop over time, we can start to explore when certain risks emerge and how best to plan early interventions, said Mr Birney. \"It's a big step towards more personalised and preventive approaches to healthcare.\" The tool in effect gives a 'health forecast', much like a weather app. Long-term predictions of a disease - or the chance of rain - are uncertain, though still useful. But short-term assessments of risk are more accurate.  The research highlighted how the likelihood of disease can vary widely across the population. Delphi showed that the risk of a heart attack in men aged between 60 and 65 ranged from 1 in 100 per year in some to 1 in 2,500 per year in others. Women were less likely to have a heart attack on average, but there was a similar spread of risk. The tool would need to be carefully assessed before it was rolled out for clinical use. Moritz Gerstung, from the German Cancer Research Centre, which collaborated in the study, said some patients could become \"fatalistic\" after discovering they have a higher than average chance of a disease. \"There is an element of psychology that needs to be brought into an assessment of how such tools are used in the future,\" he said. There is huge interest in the ability of AI to spot patterns in health data. Pharmaceutical company AstraZeneca last year published results from an AI model that looked at data from routine GP visits, such as blood pressure checks and urine tests, as well as 3,000 proteins found in the blood. It predicted the risk of 121 diseases with \"exceptional\" accuracy up to 20 years in advance, the researchers said."
    },
    {
        "title": "Chimpanzees consume 'two alcoholic drinks a day', study says",
        "description": "Chimpanzees consume the equivalent of two human alcoholic drinks each day thanks to their fondness for ripe fruit, researchers have said.",
        "url": "https://news.sky.com/story/chimpanzees-consume-two-alcoholic-drinks-a-day-study-says-13433019",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-chimpanzees-ivory-coast_7023384.jpg?20250917204049",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-17 19:37:00",
        "Headline": "Wild chimps often eat around 10% of their body weight daily in ripe fruit containing alcohol, according to scientists who measured the alcohol content of the fermented ripe fruits they consumed regularly.",
        "Content": "Chimpanzees consume the equivalent of two human alcoholic drinks each day thanks to their fondness for ripe fruit, researchers have said. Wild chimpanzees regularly eat around 10% of their body weight in ripe fruit daily, and because the fruit often is undergoing natural fermentation - the process that turns sugar into alcohol - it means the apes are consuming the human equivalent of two cocktails daily. A team from the University of California, Berkeley, measured the alcohol content of the fermented ripe fruits consumed regularly by chimps at two sites - in Uganda and Ivory Coast. They estimated that, based on their usual food intake, the animals may ingest 14g of ethanol, the principal type of alcohol found in alcoholic drinks, every day. A standard alcoholic drink in the US contains about the same amount of alcohol - 14g. When the relative body weights of humans and chimps are factored in, the apes have roughly the equivalent of two standard alcoholic drinks. The chimps showed no obvious signs of being intoxicated, the scientists said, as they ate the fruit over many hours during foraging, limiting the alcohol's impact. \n                  Ivory Coast: TV host convicted of glorifying rape after letting rapist recreate attacks using mannequin\n                 \n                  Laurent Gbagbo: Ivory Coast's former president acquitted of war crimes\n                 \n                  French military plane crashes on take off in Ivory Coast \n                 Lead author Aleksey Maro, from Berkeley's Department of Integrative Biology, said it's \"difficult to say how much consuming this amount of dietary alcohol would affect the behaviour of chimpanzees. \"We know that just the presence of a lot of ripe fruit can affect things like how often they go on territorial patrols andhunts. \"And the oestrous cycle of female chimpanzees, when they are fertile, is timed around when large amounts of food are available. \"It's possible ethanol could play a role in some of these diet-related dynamics, especially when they're able to consume large volumes of fruit quickly.\" Chimpanzees are specialists in consuming ripe fruits, which represent more than 70% of their diet. Researchers, whose findings were published on Wednesday in the journal Science Advances, tried 21 fruit species at the two study sites - Uganda's Kibale National Park and Tai National Park in Ivory Coast. Read more on Sky News:Appeal over one in, one out schemeHatton 'in good place' - familyDangerous fake dolls seized Mr Maro described the number and diversity of fruit species in the chimpanzee diet as \"staggering\", ranging from \"bowling ball-sized fruits to fruits that are composed almost entirely of seeds with just a little pulp glued to them - and everything in between\". The team studied those species most popular with the chimpanzees, which in Uganda were figs, while those in Ivory Coast preferred a plum-like fruit with bright green flesh. Mr Maro said \"it's certainly plausible\" that the chimps actively look for fruit with higher alcohol content - riper fruit with more sugars to ferment. \"We hypothesise that they judge whether to eat a fruit in their hand partly based on the smell of ethanol.\""
    },
    {
        "title": "Taliban orders 'complete ban' on fibre optic internet in northern Afghanistan, as reports says order will be enforced nationwide ",
        "description": "The Taliban has banned an Afghanistan province from using fibre optic internet to \"prevent immorality\".",
        "url": "https://news.sky.com/story/taliban-orders-complete-ban-on-fibre-optic-internet-in-northern-afghanistan-as-reports-says-order-will-be-enforced-nationwide-13432773",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-afghanistan-cable-internet_7023091.jpg?20250917153954",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-17 14:00:00",
        "Headline": "A Taliban spokesman said the ban would help 'prevent' immorality'",
        "Content": "The Taliban has banned an Afghanistan province from using fibre optic internet to \"prevent immorality\". Government offices, the private sector, public institutions, and homes across the northern Balkh province are now disconnected from Wi-Fi internet after the ban, although mobile internet was still functional as of Tuesday. Haji Attaullah Zaid, a provincial Taliban government spokesman, said the \"complete ban\" of cable internet was ordered by Afghanistan's Supreme Leader Hibatullah Akhundzada. Mr Zaid added that the measure \"was taken to prevent immorality, and an alternative will be built within the country for necessities\". It's unclear why Balkh province was chosen for the ban, or if the shutdown would spread to other provinces. Local news outlet, Afghanistan International, reports that the fibre optic internet ban will be nationwide and is already in effect in the Kandahar, Uruzgan, Helmand and Nimroz provinces. Disruption has also been reported in the Baghlan, Ghazni, Parwan and Herat provinces. \n                  Taliban reports sharp rise in death toll following earthquake in eastern Afghanistan, as aid agencies issue warning\n                 \n                  Has China humiliated Trump?\n                 \n                  Moving Afghan nationals to UK forecast to cost more than £2bn\n                 A source told the website: \"The order from the Taliban leader is irreversible and will be enforced nationwide.\" One Balkh resident told the Associated Press that \"blocking the internet is beyond my comprehension in such an advanced era,\" adding that mobile internet can be slow and expensive. He said: \"If this ban continues, it will not only be detrimental to my business but also to others because all our business is done on the internet. \"We do business with people in the outside world and maintain relationships through it. I might have to move from Mazar-e-Sharif (the capital of Balkh) to another province because I cannot afford the loss.\" Read more from Sky News:In pictures: Trump's state visit so farHow the US lost its longest warFake Labubu dolls seized It marks the first such ban since the Taliban seized power in Afghanistan after the withdrawal of US and Western troops in 2021. Afghan authorities have sometimes suspended the mobile phone network for security reasons, usually during religious festivals, to prevent the detonation of explosive devices."
    },
    {
        "title": "Jimmy Kimmel's show pulled over comments about Charlie Kirk",
        "description": "US talk show host Jimmy Kimmel has had his programme pulled over \"offensive and insensitive\" comments about Charlie Kirk.",
        "url": "https://news.sky.com/story/jimmy-kimmels-show-pulled-over-comments-about-charlie-kirk-13433145",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel-talk-show_7023618.jpg?20250918001442",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-17 22:46:00",
        "Headline": "Donald Trump and Vice President JD Vance are among those to cite \"left-wing extremism\" as a factor in Charlie Kirk's killing - and Jimmy Kimmel used his show to call out perceived hypocrisy among MAGA supporters.",
        "Content": "US talk show host Jimmy Kimmel has had his programme pulled over \"offensive and insensitive\" comments about Charlie Kirk. Kimmel used his show on Monday night to accuse Donald Trump and his allies of \"doing their best to fan the flames\" following the conservative influencer's assassination last week. Disney-owned ABC said it would be taken off-air indefinitely - and with immediate effect - after network operator Nexstar said it would stop broadcasting the programme. Andrew Alford, president of Nexstar's broadcasting division, said it \"strongly objects\" to Kimmel's comments. \"Mr Kimmel's comments about the death of Mr Kirk are offensive and insensitive at a critical time in our national political discourse,\" he said, with the show to go off-air to \"let cooler heads prevail\". Mr Trump welcomed the news on Truth Social, writing \"congratulations to ABC\" and \"Kimmel has ZERO talent\". What happened? Kimmel called out what he believes is hypocrisy in how Republicans have responded to Mr Kirk's death. Mr Trump and Vice President JD Vance are among those to cite \"left-wing extremism\" as a factor in the killing. Suspected gunman Tyler Robinson appeared in court for the first time on Tuesday night. Prosecutors said he had shared negative views about Kirk, an influential media figure in the MAGA movement. Read more from Sky News:Trump enjoys lavish state banquetRobert Redford's grandchildren pay tribute  On the Monday edition of his show, Kimmel drew attention to Capitol rioters who \"wanted to hang\" Mr Trump's first term vice president, Mike Pence, for certifying Joe Biden's 2020 election win. \"Was that the liberal left? Or the toothless army who stormed the Capitol on January 6,\" said Kimmel. His remarks saw the chairman of the Federal Communications Commission, Trump backer Brendan Carr, threaten to \"take action\" against Disney and ABC. A representative for Kimmel did not immediately respond to a request for comment about the cancellation. Kimmel follows in Colbert's footsteps The abrupt removal of Jimmy Kimmel Live comes after fellow late night host Stephen Colbert saw his programme cancelled, which fans claimed was a result of his criticism of Mr Trump. Mr Trump presents himself as a staunch advocate of free speech, but regularly rails against media organisations which criticise him. This week he launched a lawsuit against The New York Times. CBS announced in July it would end The Late Show when its current series ends next May. In a statement, the network said the move was \"not related in any way to the show's performance, content or other matters happening at Paramount.\" Mr Trump praised the move, saying \"his talent was even worse than his ratings\". Colbert's Late Show won an Emmy for outstanding talk series for the first time at the weekend."
    },
    {
        "title": "Robert Redford's grandchildren pay tribute to Hollywood icon as they share family photos",
        "description": "Robert Redford's grandchildren have paid tribute to the Hollywood icon with a series of never-before-seen family photos.",
        "url": "https://news.sky.com/story/robert-redfords-grandchildren-pay-tribute-to-hollywood-icon-as-they-share-family-photos-13432951",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-conor-schlosser-robert-redford_7023296.jpg?20250917191407",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-17 17:55:00",
        "Headline": "The 89-year-old Hollywood actor died on Tuesday in Utah \"surrounded by those he loved\".",
        "Content": "Robert Redford's grandchildren have paid tribute to the Hollywood icon with a series of never-before-seen family photos. Redford died on Tuesday at the age of 89 in the mountains of Utah \"surrounded by those he loved\", according to his representative Cindi Berger. Now Conor Schlosser, the 33-year-old son of Redford's eldest daughter Shauna Redford, 64, has posted five photos on Instagram with the movie star, including three throwback pictures from his childhood of the pair together. In them, they are riding a horse, opening a present and playing golf. Mr Schlosser also shared two more recent pictures with Redford, including one of them enjoying a meal and the other of him with his arm around his grandfather. In a caption that accompanied the social media post, he wrote: \"He was larger than life to the world, but to his family, he was simply that … family. \"Rest in peace, Grandpa.🐎\".\" He added: \"If anyone has a favourite story of him you'd like to share, please send it to me in a private message - I'd love to collect them.\" \n                  Robert Redford dies: His career in pictures\n                 \n                  Hollywood actor and director Robert Redford dies at 89\n                 \n                  Robert Redford pays tribute to son James following his death from cancer\n                 Read more:Redford's career in pictures His cousin, Lena Hart Redford, the 29-year-old daughter of Redford's late son, James Redford, also posted a number of pictures with the Hollywood star on Instagram. There were photos of her on a horse with her grandfather and also with him on a film set. She also included a photo of her late father with Redford in the post, which she captioned with a red heart emoji. And in a tribute on Instagram Stories, she shared a throwback image of her and Redford wearing Kangol-brand beanies. \"Taught me so much. … Had us all in Kangol,\" she wrote. She also posted a picture of Redford and her father horseback riding. \"Dad & grandpa, I feel like they are riding awesome horses in heaven,\" she wrote. Lena Hart Redford's brother, Dylan Redford, shared a picture with his grandfather on his Instagram Stories. He wrote: \"He was best grampa a grandson could ask for. He also made amazing things, helped others make amazing things, and tried to make the world a better place.\" Redford fathered four children with his first wife Lola Van Wagenen - sons Scott and James and daughters Shauna and Amy. Scott died in 1959 from sudden infant death syndrome aged only two months, while his younger son James died aged 58 of cancer in 2020. Redford is survived by his wife Sibylle Szaggars Redford, daughters Shauna and Amy and seven grandchildren."
    },
    {
        "title": "LimeWire and Fyre Festival: Two of the music industry's least favourite brands have joined forces",
        "description": "They are both infamous in the music industry, and now LimeWire and Fyre Festival are joining forces. ",
        "url": "https://news.sky.com/story/limewire-and-fyre-festival-two-of-the-music-industrys-least-favourite-brands-have-joined-forces-13432774",
        "image_url": "https://e3.365dm.com/17/04/1920x1080/d8dbc59de0dd747c5a5e01e560f59c1059c53cf9262d8a0308cc2f90e4e79324_3940573.jpg?20170428140955",
        "type": "Entertainment",
        "Author": "Megan Harwood-Baynes, news reporter",
        "Date Published": "2025-09-17 14:03:00",
        "Headline": "LimeWire, known for enabling illegal piracy of music, has just bought Fyre Festival, a brand which promised a luxury music festival in the Bahamas but ended up as a viral disaster in 2017.",
        "Content": "By Megan Harwood-Baynes, news reporter  They are both infamous in the music industry, and now LimeWire and Fyre Festival are joining forces.  LimeWire, known for enabling illegal piracy of music, has just bought Fyre Festival, a brand which promised a luxury music festival in the Bahamas and ended up as one of the biggest viral disasters of 2017. The fallout from the festival sparked several lawsuits and even a spell in prison for Billy McFarland, its founder. Mr McFarland even tried his luck a second time, with 2,000 tickets going on sale for Fyre Festival II, earlier this year. The festival was postponed just weeks before it was due to take place this summer. Rights to the festival have now been sold in a bid \"that even included Ryan Reynolds and his agency Maximum Effort\", according to LimeWire. \"Congrats to LimeWire... I look forward to attend their first event but will be bringing my own palette of water,\" Reynolds reportedly told the brand. But the CEO of LimeWire said the purchase does not necessarily mean a Fyre Festival III is in the works. \"We're not bringing the festival back,\" said Julian Zehetmayr, the CEO. \"We're bringing the brand and the meme back to life, this time with real execution.\" What is LimeWire - and how is it back? For music-loving millennials growing up in the early 2000s, in an era before Spotify and digital streaming, LimeWire was an essential part of life - as long as you didn't mind downloading the occasional virus onto the shared family PC. The website was largely used for the download and distribution of pirated music, but was shut down in 2011 after the Recording Industry Association of America (RIAA) said LimeWire owed them $72 trillion in damages. The RIAA demanded $150,000 for each download of 11,000 infringed songs, a demand that even a federal judge called \"absurd\". The case was eventually settled for a much smaller fee of $105 million. But it wasn't the end, and the brand was resurrected as a crypto and file sharing company in 2022. As for what is next, LimeWire said \"over the coming months, [it] will unveil a reimagined vision for Fyre - one that expands beyond the digital realm and taps into real-world experiences\". \"What could possibly go wrong?\" LimeWire's statement said."
    }
]