[
    {
        "title": "Police chiefs warn of crime surge if Labour's plans pass - as hunt for mistakenly released prisoners continues",
        "description": "Police are preparing for a surge in crime if the Labour government's plans to overhaul prison sentences go ahead - with hundreds of thousands more offences expected in a year.",
        "url": "https://news.sky.com/story/police-chiefs-warn-of-crime-surge-if-labours-plans-pass-as-hunt-for-mistakenly-released-prisoners-continues-13464694",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-brahim-kaddour-cherif_7073009.jpg?20251105170438",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-05 22:39:00",
        "Headline": "Labour have blamed the Conservatives for leaving the country's justice system in a poor state, but the government has been dogged by a series of embarrassing headlines, with a number of prisoners mistakenly released. A manhunt for two men remains under way.",
        "Content": " Police are preparing for a surge in crime if the Labour government's plans to overhaul prison sentences go ahead - with hundreds of thousands more offences expected in a year. Measures proposed under the Sentencing Bill, intended to ease overcrowding in prisons, include limiting the use of short prison sentences and releasing some convicted criminals earlier. However, police chiefs are warning such measures could see up to a 6% rise in crime in the immediate aftermath, should the plans become law. It comes as a manhunt is under way for two prisoners mistakenly released from HMP Wandsworth, including Brahim Kaddour-Cherif, a 24-year-old Algerian man and registered sex offender, and 35-year-old William Smith.  'It has to be properly funded' Assistant Chief Constable Jason Devonport, who spent 18 months on secondment as a prison governor at HMP Berwyn, said forces are planning for an increase in all types of offences. While he said community programmes to support rehabilitation \"are being ramped up,\" he warned officers \"expect, certainly in the short term, there will be an increase of offending in the community\". \n                  Train stabbing latest: Rail worker critically ill but stable after mass stabbing, transport minister tells Sky News\n                 \n                  Claire Inglis: Call for 'damning' report into mother's murder to be fully released\n                 \n                  Regan McClinton: Blantyre sex predator who attacked two girls after dragging them off street jailed\n                 \"I believe in the Sentencing Bill and I believe in rehabilitation,\" he added, \"but it has to be properly funded.\" ACC Devonport said the probation service is trying to recruit 1,500 officers a year for the next three years to manage demand, and that the rise in police-recorded crime in one year is expected to be between 4% and 6%. In the year to June 2025, police in England and Wales recorded 6.6 million offences. A rise of 6% would then equal around 396,000 additional recorded crimes. Gavin Stephens, chairman of the National Police Chiefs' Council, added that officers have \"all been in policing long enough to know that some of the things that help people stop offending or desist from offending are not going to be resolved by short sentences in particular\". However, he added: \"Our issue is in the short-term period of the implementation, there is a shift of demand on to policing, and we want that shift of demand on to us to be properly recognised and properly modelled... so we can have the right and appropriate resource in there to mitigate the risk to communities.\" Chief political correspondent The charitable view of the latest prison release blunder that has plunged the government into another political crisis is that it's extremely bad luck rather than an act of incompetence by ministers. \n\n But the more we learn about the shocking details of what happened and what looks like a cynical attempt at a cover-up by the hapless David Lammy, the more the blame can be laid at the government's door. Click here to read more Prison system at 'breaking point,' warns MP In a further warning about the state of law and order in the UK, the chair of the Justice Committee has said the prison system is at \"breaking point\". Labour MP Andy Slaughter called the latest releases from HMP Wandsworth \"extremely concerning,\" adding: \"While the day to day running of prison security and public safety are paramount, the current spate of releases in error will be repeated until the underlying failures are addressed.\" He also said evidence taken by the committee \"laid bare a crisis-hit prison system, starved of investment over many years which is facing multi-faceted pressures\". What do we know about the manhunt? The south London prison admitted on Wednesday that Kaddour-Cherif, who sentenced for trespass with an intent to steal, was accidentally released on 29 October. His release came just five days after the high-profile release of migrant sex offender Hadush Kebatu from HMP Chelmsford in Essex.  Hours after Kaddour-Cherif's accidental release was confirmed by the Met, Surrey Police announced it was also searching for Smith after another error by prison staff. The 35-year-old, who was sentenced to 45 months for multiple fraud offences and goes by the name Billy, had apparently been released on Monday. It is not yet clear why it was nearly a week between the first release at Wandsworth and the police being informed that an offender was at large. Both mistakes follow vows by Deputy Prime Minister and Justice Secretary David Lammy that enhanced checks on prisoner releases would be introduced. He came under fire while standing in for Sir Keir Starmer at PMQs, but sought to blame the Conservatives, saying: \"In 25 years in this House, I have not witnessed a more shameful spectacle frankly than what the party opposite left in our justice system.\" News of Kaddour-Cherif's release broke as PMQs was ending, and a comment released on Mr Lammy's behalf said he was \"absolutely outraged\" about it. He had been repeatedly asked whether any more asylum seekers had been mistakenly released from jail since the Kebatu case, and refused to answer. Read more from Sky News:Nearly 40,000 freed early to tackle prison overcrowdingHow many prisoners are released by mistake?Driver hits several people on holiday island  In response to concerns of a spike in crime should the Sentencing Bill become law, a Ministry of Justice spokesperson said the government \"inherited a prison system in crisis, days away from running out of space\". \"Public safety will always be our top priority, and we are building 14,000 more prison places to keep dangerous offenders locked up,\" they added. \"Offenders released face strict licence conditions, and we are increasing the probation budget by an extra £700 million over the next three years and investing in new technology to reduce admin, so staff can focus on work that reduces reoffending.\" And in response to the manhunt for the two released convicts, a spokesperson said: \"Releases in error have been increasing for several years and are another symptom of a justice system crisis inherited by this government.\" They added: \"We are clear that these mistakes must not continue to happen.\""
    },
    {
        "title": "Elon Musk: Why some are starting to question if the world's richest man is still value for money",
        "description": "Elon Musk is already the world's richest man, but today he could take a giant step towards becoming the world's first trillionaire.",
        "url": "https://news.sky.com/story/elon-musk-why-some-are-starting-to-question-if-the-worlds-richest-man-is-still-value-for-money-13464620",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-elon-musk-air-force-one_7073336.jpg?20251106013545",
        "type": "Home",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-11-05 21:31:00",
        "Headline": "As Tesla shareholders vote on a deal that would help hand Elon Musk unprecedented wealth for corporate America, some are questioning whether the controversial tech tycoon represents a smart investment.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Elon Musk is already the world's richest man, but today he could take a giant step towards becoming the world's first trillionaire. Shareholders at Tesla are voting on a pay deal for their chief executive that is unlike anything corporate America has ever seen. The package would grant Musk, who already has a net worth of more than $400bn, around 425 million shares in the company. That would net him about $1trn (£760bn) and, perhaps more importantly to Musk, it would tighten his grip on the company by raising his stake from 15% to almost 30%. The board, which has been making its case to retail investors with a series of videos and digital ads, has a simple message: Tesla is at a turning point. Yes, it wants to sell millions of cars, but it also wants to be a pioneer in robotaxis, AI-driven humanoid robots, and autonomous driving software. At this moment, it needs its visionary leader motivated and fully on board. Musk has served his warning shot. Late last month, he wrote on X: \"Tesla is worth more than all other automotive companies combined. Which of those CEOs would you like to run Tesla? It won't be me.\" Not everyone is buying it, however. With so much of his personal wealth tied up in Tesla, would Musk really walk away? Bad for the brand? Others see his continued presence and rising influence as a risk. Norway's sovereign wealth fund, the world's largest, which owns 1.1% of the company (making it a top 10 shareholder), has already declared it will vote against the deal. It cited concerns about \"the award's size, dilution, and lack of mitigation of key person risk\". Several major US pension funds have followed suit. In an open letter published last month, they warned: \"The board's relentless pursuit of keeping its chief executive has damaged Tesla's reputation.\" They also criticised the board for allowing Musk to pursue other ventures. They said he was overcommitted and distracted as a result. Signatories of that letter included the state treasurers of Nevada, New Mexico, Connecticut, Massachusetts, Colorado, and the comptrollers of Maryland and New York City. All of them Democrats. Republicans have been more favourable. There is a political slant to this. The signatories' concerns with his \"other ventures\" no doubt include the time Musk spent dabbling in right-wing politics with the Republican inner circle. That made him a polarising figure and, to an extent, Tesla too. Pay packet dwarfs rivals Combine this with a mixed sales performance and a volatile share price, and some are wondering whether the carmaker has lost its way under his leadership. Irrespective of performance, for some, the existence of billionaires - let alone trillionaires - can never be justified. Some may also ask why Musk is worth so much more than the leaders of Apple, Facebook, and Microsoft, or Nvidia, the world's most valuable company by market capitalisation. Nvidia's chief executive, Jensen Huang, received $49.9m (£37.9m) this fiscal year. So, how has Tesla come up with these numbers? Why is Musk's pay so out of kilter with the benchmark? Does the company have a corporate governance problem? The courts have suggested it might. Last year, a Delaware court took the view that Tesla's board members, which include Musk's brother Kimbal, were not fully independent when agreeing to a $56bn (£42.6bn) pay packet back in 2017. Read more from Sky News:Badenoch calls for government to 'get Britain drilling again'Sickness bill costs £85bn a year, says new report The Delaware Supreme Court is now reviewing the case. It is a reminder that even if Musk meets his targets, a similar fate could befall the current package. The Tesla board is holding firm, however. Robyn Denholm, the company's chair, told The New York Times: \"He doesn't get any compensation if he doesn't deliver,\" adding that Musk \"does things that further humankind\". Tesla's valuation is tied up in its promise to deliver revolutionary AI and robotics products that will change the world. Those ambitions, which include robots that can look after children, are lofty. Some would call them unrealistic, but the board is adamant that if they are to become a reality, only Musk can make it happen. Under the deal, Musk would receive no salary or cash bonus. Instead, he would collect shares as Tesla's value grows. To unlock the full package, he would have to increase the current market valuation six times to $8.5trn (£6.47trn). For context, that's almost twice that of Nvidia. There are other hurdles. The company would have to sell 20 million additional electric vehicles, achieve 10 million subscriptions to its self-driving software on average over three months, deploy one million robotaxis on average over the same period, sell one million AI-powered robots, and boost adjusted earnings 24-fold to $400bn (£304bn). They are ambitious targets, but Musk has defied the sceptics before."
    },
    {
        "title": "'Posh boys' playing gangsters: Eddie Marsan on TV and film industry’s obsession with upper-class actors",
        "description": "Over the last two decades, Eddie Marsan has established himself as one of Britain's most versatile and acclaimed character actors. From major blockbusters like the Sherlock Holmes films and Mission: Impossible III, to his roles on the TV series Ray Donovan, and more recently the sci-fi drama Supacell.",
        "url": "https://news.sky.com/story/posh-boys-playing-gangsters-eddie-marsan-on-tv-and-film-industry8217s-obsession-with-upper-class-actors-13464383",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-eddie-marsan-actor_7072897.jpg?20251105150821",
        "type": "Home",
        "Author": "Katie Spencer",
        "Date Published": "2025-11-05 14:10:00",
        "Headline": "\"If you want to be an actor in this country, and you come from a disadvantaged background, you have to be exceptional,\" says Marsan, who argues people like Laurence Fox fear greater representation on screen will \"level the playing field\".",
        "Content": "\n          Arts and entertainment correspondent\n        Over the last two decades, Eddie Marsan has established himself as one of Britain's most versatile and acclaimed character actors. From major blockbusters like the Sherlock Holmes films and Mission: Impossible III, to his roles on the TV series Ray Donovan, and more recently the sci-fi drama Supacell. As a performer, he is a skilled observer. And one thing he's come to notice a lot over the years is how few of his castmates tend to share his working-class roots. \"If you want to be an actor in this country, and you come from a disadvantaged background, you have to be exceptional to have a hope of a career,\" he says. \"If you come from a privileged background, you can be mediocre.\" Speaking after being named one of the new vice presidents of drama school Mountview, and meeting students at the establishment where he too first trained, Marsan is keen to stress why it's so necessary to support young actors who can't fund their careers. \"I came here when I was in my 20s… I was a bit lost, to be honest… I was serving an apprenticeship as a printer when Mountview offered me a place,\" he says. \"There were no kinds of grants then, so for the first year an East End bookmaker paid my fees, then my mum and him got together and paid the second year, then Mountview gave me a scholarship for the third year, so I owe them everything. \"I didn't earn a living as an actor for like six, seven years… years ago, actors could sign on and basically go on the dole while doing plays… now, in order to become an actor, you have to have the bank of mummy and daddy to bankroll you for those seven or eight years when you're not going to earn a living.\" Marson and Dame Elaine Paige are both taking on ambassadorial roles to mark Mountview's 80th anniversary, joining Dame Judi Dench, who has been president of the school since 2006. \"The parties are fantastic,\" he jokes. \"The two dames, they get so half-cut, honestly, you have to get an Uber to get them home!\" But he's rather more serious about TV and film's \"fashion for posh boys\". \"When I went to America and I did 21 Grams and Vera Drake. I remember thinking, 'great I'm going to have a career now,' but I wasn't the idea of what Britain was selling of itself. \"Coming back from Hollywood, a publicist said to me 'when we get to London and do publicity for the film 21 Grams we're going to come to you'… but no one was interested… I remember coming to Waterloo station and looking up and seeing all these posh actors selling Burberry coats and posters, and they hadn't done anything compared to what I'd done, and yet they were the image that we were pushing as a country.\" Read more from Sky News:Diary collection wins prestigious non-fiction prizeBeckham receives knighthood at Windsor Castle A 2024 Creative Industries, Policy, and Evidence Centre report found 8% of British actors come from working class backgrounds, compared to 20% in the 70s and 80s. \"Even a gangster movie now, 40 years ago you would have something like The Long Good Friday or Get Carter with people like Michael Caine or Bob Hoskins who were real working-class actors playing those parts, now you have posh boys playing working-class characters.\" Within the last five or six years, he says there has at least been \"more of an effort to include people of colour\". 'They're scared of a level-playing field' \"What I find really interesting is, I've been an actor for 34 years, and I remember for the first 20 years going on a set and very rarely within the crew and within the cast would you see a black face, very rarely. \"One of the saving graces really are things now like Top Boy and Supacell, where you have members of the black community making dramas about their communities, that can't be co-opted by the middle classes.\" \"People like Laurence Fox complaining that it's unfair, I never heard them complain when you never saw a black face, never once did they say anything. Now that people are trying to address it, they think it's unfair…because they're scared of a level playing field.\" Now, more than ever, Marsan says he feels compelled to point out what needs to change within the industry he works in. \"Look, social media is destroying cultural discourse. It's making people become very binary… acting and drama is an exercise in empathy and if there's one thing that we need more of at the moment it's that.\""
    },
    {
        "title": "Collins Word of the Year 2025 revealed - do you recognise it?",
        "description": "The term \"vibe coding\" has been named the Collins Word of the Year for 2025, beating contenders like \"clanker\", \"glaze\" and \"aura farming\".",
        "url": "https://news.sky.com/story/collins-word-of-the-year-2025-revealed-do-you-recognise-it-13464395",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/2372402200584454407_6462356.jpg?20240220141821",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-05 14:38:00",
        "Headline": "This year's winner follows on from last year's \"brat\", which was popularised by British singer Charli XCX.",
        "Content": "The term \"vibe coding\" has been named the Collins Word of the Year for 2025, beating contenders like \"clanker\", \"glaze\" and \"aura farming\". Vibe coding refers to an emerging software development process that turns natural language into computer code using AI. The term, coined in February by Andrej Karpathy, former director of AI at Tesla and a founding engineer at OpenAI, essentially outlines how a person can now prioritise describing what they need to AI so it can generate code on their behalf, rather than writing code line-by-line themselves. Lexicographers at Collins monitor the Collins Corpus, a 24 billion-word database which draws from a range of media sources, including social media, to create the annual list of new and notable words. Vibe coding was in close contention with \"clanker\" - a derogatory term for computers, robots, or sources of AI, often used on social media to express frustrations and distrust in AI chatbots and platforms, and \"glaze\" - to praise or flatter someone excessively or undeservedly. Other popular terms considered were \"aura farming\" - the practice of trying to look cool through the deliberate cultivation of a distinctive and charismatic persona, and \"broligarchy\" - referring to the owners of the biggest global technology companies, informally known as \"tech bros\". Read more from Sky News:Is net zero dead?Who is Zohran Mamdani?What's the impact of the US shutdown? Here are some of the other contenders: • Biohacking - also referred to as \"do-it-yourself biology\". This describes the activity of altering the natural processes of one's body in an attempt to enhance physical wellbeing and extend lifespan. • Micro-retirement - a term often used by Gen Z and millennials to describe taking a break between periods of employment in order to pursue personal interests. • Coolcation - a holiday in a place with a cool climate, as temperatures soar where they live or where they typically spent their holidays. • Taskmasking - the act of giving a false impression that one is being productive in the workplace. • HENRY - an acronym for \"high earner, not rich yet\". Refers to someone who has a large income but hasn't saved a lot. Collins' top words of the year can leave some feeling culturally informed and others completely out of touch. Here are the previous Collins words going back 10 years – how many do you recognise? 2015: Binge-watch – defined as viewing more than three episodes of a series in one day. 2016: Brexit – the withdrawal of the UK from the European Union. 2017: Fake news - defined as \"false, often sensational, information disseminated under the guise of news reporting,\" it has remained one of Donald Trump's catchphrases during his second term. 2018: Single-use - popularised by the increasing call to ban materials that damage the environment and pollute the food chain. 2019: Climate strike – a form of protest popularised by activist Greta Thunberg, where demonstrators skip work or school to raise awareness of climate change. 2020: Lockdown – chosen in the height of the COVID-19 pandemic, Collins defined lockdown as \"the imposition of stringent restrictions on travel, social interaction, and access to public spaces\". 2021: NFT – the abbreviation for non-fungible token - clinched the top spot. In case you still don't get it, an NFT is a unique digital identifier that records ownership of a digital creation asset. This can be a picture, a video, a piece of music or even a tweet. 2022: Permacrisis – defined as \"an extended period of instability and insecurity,\" this one came during the year the Ukraine war began, the cost-of-living crisis worsened significantly and political tensions increased. 2023: AI – the abbreviation of artificial intelligence took the top spot, with AI becoming the dominant conversation worldwide after ChatGPT was launched in November 2022. 2024: Brat – popularised by British singer Charli XCX, brat took on a new meaning last year as a lifestyle \"characterised by a confident, independent, and hedonistic attitude\"."
    },
    {
        "title": "Maccabi boss hits out at 'blatant falsehoods' peddled about their fans - but admits work to do on racism",
        "description": "The chief executive of Israeli football team Maccabi Tel Aviv has denounced \"falsehoods\" and hatred being spewed about their supporters, leading to them being banned from Aston Villa, while accepting there is work to do to eradicate racism in the fan base.",
        "url": "https://news.sky.com/story/maccabi-boss-hits-out-at-blatant-falsehoods-peddled-about-their-fans-but-admits-work-to-do-on-racism-13464552",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-maccabi-tel-aviv-football_7073185.jpg?20251105204123",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-11-05 19:59:00",
        "Headline": "More than 700 police officers are due to deploy to a Europa League match between Aston Villa and Maccabi Tel Aviv, with protests anticipated outside by Palestinian and Israeli groups.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n The chief executive of Israeli football team Maccabi Tel Aviv has denounced \"falsehoods\" and hatred being spewed about their supporters, leading to them being banned from Aston Villa, while accepting there is work to do to eradicate racism in the fan base. Jack Angelides told Sky News there is a need for \"toning down the incitement\" ahead of tomorrow's Europa League match at Villa Park, which will see more than 700 police officers deployed with protests anticipated outside by Palestinian and Israeli groups. Mr Angelides revealed the club has not been given a specific reason for Birmingham authorities banning their supporters - a decision which the government pushed to be overturned before Maccabi said they would reject any fan allocation granted in any case. \"We feared for the safety of our fans and it's a huge responsibility,\" Mr Angelides said in an interview at Villa Park. \"[With] a lot of incitement, we didn't feel comfortable in taking that allocation and that's a sad day in football because things like that shouldn't happen. \"People have the right to freedom of speech, absolutely, but people don't have the right to spew hatred.\" Birmingham's Safety Advisory Group (SAG) announced last month that visiting fans will be barred from attending the game at Villa Park amid public safety concerns. West Midlands Police also classified the Europa League match \"high risk\" and said the ban was necessary due to \"current intelligence and previous incidents\". That was a reference to Maccabi's match at Ajax last November when their fans were attacked by locals, leading to five convictions. No Maccabi fans were prosecuted. They were seen tearing down Palestinian flags and chanting anti-Arab abuse. Read more from Sky News:Search is on for two prisoners freed by mistakeDog that killed nine-month-old baby was XL bully Mr Angelides said: \"We have not been given a clear reason [for the ban], but I have seen people coming up with all sorts of stories of our fans, especially in Amsterdam, where there was, what the Amsterdam authorities themselves classified as 'a Jew hunt', being portrayed as organised fighters, soldiers, etc, etc. \"It's just blatant falsehoods, and people who say those things know that they're false and shame on them.\" Mr Angelides believes the decision has been kept private to leave open for people to form a conclusion and characterise his club as racist. Ayoub Khan, the independent pro-Gaza MP whose constituency covers Villa Park, called for the ban because the club has \"hooligans who have a long history of violence and vile racism\". \"Any club that tries to suggest that they don't have any issues, whatever that may be, it's untrue,\" Mr Angelides said. \"We know we've got a long road ahead. There are elements in the club that are not in line with our values, our morals, and we do expend a lot of energy and have been for many, many years in trying to… eradicate that. \"But to malign thousands and thousands of good fans with the actions of a few, it's a dangerous game because I think that's something that is not conducive to toning down the incitement that's actually going on now. It's manipulation to my mind.\"  Football focus Mr Angelides did not discuss whether there was fear among the players going into a potentially hostile environment. \"We have Jewish players; we have Christian players; we have Muslim players - we're a club that's quite diverse,\" he said. \"There is an understandable excitement of playing. They're aware, … the last two years have taken a toll on Israeli society because of what's been going on. So they're very aware of the situation, but I think they're prepared to focus on their football.\" The game is going ahead, after moves in European football to ban Israeli teams over the war in Gaza faded, as a peace deal was implemented."
    },
    {
        "title": "Major incident declared in parts of Wales after flooding triggers hundreds of calls",
        "description": "Fire crews have been tackling a major incident after flooding hit parts of southwest Wales overnight, with people trapped in their homes and vehicles.",
        "url": "https://news.sky.com/story/major-incident-declared-in-parts-of-wales-after-flooding-triggers-hundreds-of-calls-13464349",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-kidwelly-flooding-wales_7072864.jpg?20251105142917",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-05 13:02:00",
        "Headline": "Dozens of people have been rescued from flooded homes in the Carmarthenshire area, three people were saved from a vehicle trapped in fast-flowing water and more than 30 dogs were rescued from flood-affected kennels at a shelter.",
        "Content": "Fire crews have been tackling a major incident after flooding hit parts of southwest Wales overnight, with people trapped in their homes and vehicles. Joint Fire Control (JFC), which includes South Wales Fire and Rescue Service, received more than 450 calls within a 12-hour period, mainly in Carmarthenshire, according to Mid and West Wales Fire and Rescue Service (MAWWFRS). Forty-eight people were rescued from a care home, more than 40 people were helped to safety from flooded homes, three people were rescued from a vehicle trapped in fast-flowing water, and more than 30 dogs were saved from flood-affected kennels at a shelter. A major incident was declared after flooding at a retirement complex in Whitland in the early hours of Wednesday. At 1.35am, crews were deployed to rescue 48 people using \"rescue sleds and water rescue equipment,\" MAWWFRS said in a statement. Earlier on Tuesday, in the remote village of Ffarmers, fire teams rescued three people and their two dogs who were stuck in a vehicle situated in fast-flowing water. Fire chiefs said crews used extension ladders to reach the vehicle. Two further incidents on Tuesday evening involved people being rescued from flooded properties in Ferryside. \n                  Nine-month-old baby dies after dog attack in Wales\n                 \n                  Labour dealt historic defeat in Caerphilly by-election - as Plaid Cymru win seat\n                 \n                  Labour's dominance in Caerphilly has crumbled like cheese - but a Reform win isn't guaranteed\n                 Around 42 more people were rescued in nearby St Clears, where about 20 domestic and commercial properties were flooded. Later the same evening, crews were involved in an operation at Glanrhyd Dog Sanctuary, Kidwelly. Boats were used to evacuated dogs from a shelter which was ruined in the floods. Owner Alison Clark told Sky News she was \"broken beyond belief\". \"It's devastating. Everything ruined or lost in the current. All white goods... freezers etc along with dog food, bedding and leads etc. \"We spent 80k on this move to make the sanctuary one of the best and now it is ruined. \"I'm broken beyond belief. My only saving grace is that I kept every dog alive.\" Among the rivers placed on flood warning - where flooding is expected - were the River Towy around Camarthen and between Llandeilo and Abergwili, the River Ritec at Tenby, the River Cynin at St Clears, the River Taf at Whitland and the River Teifi at Llechryd and Cenarth. Carmarthenshire County Council said a rest centre has been set up in Carmarthen Leisure Centre for those suffering the \"severe impact\" of flooding in the Whitland and St Clears areas. Seven schools were closed on Wednesday in the county and the council also confirmed multiple road closures were in place due to flooding or road conditions. Read more from Sky News:Manhunt for prisoner wrongly releasedMigrant sent back to France for second time Craig Flannery, Assistant Chief Fire Officer at MAWWFRS, said the rescues were \"prolonged and challenging\". \"I have personally witnessed the dedication and professionalism of our staff dealing with multiple calls over a prolonged period, as well as the courageous efforts of our operational crews responding to these incidents across our Service area,\" he said. \"Our crews have been truly exceptional in assisting and protecting our communities. \"We are also extremely grateful to all partner agencies who have assisted in responding to incidents during a prolonged and challenging period.\""
    },
    {
        "title": "Prisoner serving life for murdering toddler found dead in his cell",
        "description": "A prisoner serving a life sentence for killing his stepdaughter has been found dead in his cell.",
        "url": "https://news.sky.com/story/prisoner-serving-life-for-murdering-toddler-found-dead-in-his-cell-13464559",
        "image_url": "https://e3.365dm.com/23/04/1920x1080/skynews-kyle-bevan-sinead-james_6132880.jpg?20230425132208",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-05 20:03:00",
        "Headline": "Kyle Bevan, 33, was serving a life sentence for murdering two-year-old Lola James, who had suffered 101 separate injuries to her body, including a 'catastrophic' brain injury. ",
        "Content": "A prisoner serving a life sentence for killing his stepdaughter has been found dead in his cell. Kyle Bevan was given a life sentence with a minimum term of 28 years for attacking two-year-old Lola James in her home in Haverfordwest, Pembrokeshire, on 17 July 2020. She died four days later. Bevan, 33, from Aberystwyth, was found dead on Wednesday morning in his cell at HMP Wakefield, police said. \"Investigations into the man's death are in their early stages and enquiries are being carried out,\" West Yorkshire Police said in a statement. Swansea Crown Court heard evidence that Lola had suffered 101 separate injuries to her body, including a \"catastrophic\" brain injury. Bevan claimed Lola had fallen down the stairs after the family dog pushed her. Her mother, Sinead James, was sentenced to six years for causing or allowing the death of a child. \n                  Police chiefs warn of crime surge if Labour's plans pass - as hunt for mistakenly released prisoners continues\n                 \n                  Feeble and inept - prison release fiasco is yet another political crisis\n                 \n                  Collins Word of the Year 2025 revealed - do you recognise it?\n                 A child practice review, commissioned by the Mid and West Wales Safeguarding Children Board, found that an assessment of Lola's needs was \"not properly undertaken\" prior to her death. Child practice reviews are conducted when a child dies or suffers a serious injury and was neither on the child protection register nor a \"looked-after child\" during the six months before the event. Read more from Sky News:Joey Barton's posts 'caused me sleepless nights', says Jeremy VineDog that killed nine-month-old baby in Rogiet was XL bully The review also identified \"a number of missed opportunities by the health visiting service\". James had not agreed to any home visits during the five-month period from 15 February 2020 to 16 July 2020. \"In future cases, far more probing and challenge is needed by health visitors,\" the review found. 'Monster' who 'needs to rot in hell' During the trial, James described Bevan as a \"monster\" who \"needs to rot in hell\" for taking her daughter's life. \"If I had got him out of the house, my daughter would still be alive today,\" she said. Judge Mr Justice Griffiths said he was sure Bevan \"was responsible for multiple assaults on the children before he murdered Lola\". Bevan \"didn't get emergency help, he didn't wake Lola's mum up. Instead, he tried to cover his tracks,\" the judge said."
    },
    {
        "title": "Police chiefs warn of crime surge if Labour's plans pass - as hunt for mistakenly released prisoners continues",
        "description": "Police are preparing for a surge in crime if the Labour government's plans to overhaul prison sentences go ahead - with hundreds of thousands more offences expected in a year.",
        "url": "https://news.sky.com/story/police-chiefs-warn-of-crime-surge-if-labours-plans-pass-as-hunt-for-mistakenly-released-prisoners-continues-13464694",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-brahim-kaddour-cherif_7073009.jpg?20251105170438",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-05 22:39:00",
        "Headline": "Labour have blamed the Conservatives for leaving the country's justice system in a poor state, but the government has been dogged by a series of embarrassing headlines, with a number of prisoners mistakenly released. A manhunt for two men remains under way.",
        "Content": " Police are preparing for a surge in crime if the Labour government's plans to overhaul prison sentences go ahead - with hundreds of thousands more offences expected in a year. Measures proposed under the Sentencing Bill, intended to ease overcrowding in prisons, include limiting the use of short prison sentences and releasing some convicted criminals earlier. However, police chiefs are warning such measures could see up to a 6% rise in crime in the immediate aftermath, should the plans become law. It comes as a manhunt is under way for two prisoners mistakenly released from HMP Wandsworth, including Brahim Kaddour-Cherif, a 24-year-old Algerian man and registered sex offender, and 35-year-old William Smith.  'It has to be properly funded' Assistant Chief Constable Jason Devonport, who spent 18 months on secondment as a prison governor at HMP Berwyn, said forces are planning for an increase in all types of offences. While he said community programmes to support rehabilitation \"are being ramped up,\" he warned officers \"expect, certainly in the short term, there will be an increase of offending in the community\". \n                  Train stabbing latest: Rail worker critically ill but stable after mass stabbing, transport minister tells Sky News\n                 \n                  Claire Inglis: Call for 'damning' report into mother's murder to be fully released\n                 \n                  Regan McClinton: Blantyre sex predator who attacked two girls after dragging them off street jailed\n                 \"I believe in the Sentencing Bill and I believe in rehabilitation,\" he added, \"but it has to be properly funded.\" ACC Devonport said the probation service is trying to recruit 1,500 officers a year for the next three years to manage demand, and that the rise in police-recorded crime in one year is expected to be between 4% and 6%. In the year to June 2025, police in England and Wales recorded 6.6 million offences. A rise of 6% would then equal around 396,000 additional recorded crimes. Gavin Stephens, chairman of the National Police Chiefs' Council, added that officers have \"all been in policing long enough to know that some of the things that help people stop offending or desist from offending are not going to be resolved by short sentences in particular\". However, he added: \"Our issue is in the short-term period of the implementation, there is a shift of demand on to policing, and we want that shift of demand on to us to be properly recognised and properly modelled... so we can have the right and appropriate resource in there to mitigate the risk to communities.\" Chief political correspondent The charitable view of the latest prison release blunder that has plunged the government into another political crisis is that it's extremely bad luck rather than an act of incompetence by ministers. \n\n But the more we learn about the shocking details of what happened and what looks like a cynical attempt at a cover-up by the hapless David Lammy, the more the blame can be laid at the government's door. Click here to read more Prison system at 'breaking point,' warns MP In a further warning about the state of law and order in the UK, the chair of the Justice Committee has said the prison system is at \"breaking point\". Labour MP Andy Slaughter called the latest releases from HMP Wandsworth \"extremely concerning,\" adding: \"While the day to day running of prison security and public safety are paramount, the current spate of releases in error will be repeated until the underlying failures are addressed.\" He also said evidence taken by the committee \"laid bare a crisis-hit prison system, starved of investment over many years which is facing multi-faceted pressures\". What do we know about the manhunt? The south London prison admitted on Wednesday that Kaddour-Cherif, who sentenced for trespass with an intent to steal, was accidentally released on 29 October. His release came just five days after the high-profile release of migrant sex offender Hadush Kebatu from HMP Chelmsford in Essex.  Hours after Kaddour-Cherif's accidental release was confirmed by the Met, Surrey Police announced it was also searching for Smith after another error by prison staff. The 35-year-old, who was sentenced to 45 months for multiple fraud offences and goes by the name Billy, had apparently been released on Monday. It is not yet clear why it was nearly a week between the first release at Wandsworth and the police being informed that an offender was at large. Both mistakes follow vows by Deputy Prime Minister and Justice Secretary David Lammy that enhanced checks on prisoner releases would be introduced. He came under fire while standing in for Sir Keir Starmer at PMQs, but sought to blame the Conservatives, saying: \"In 25 years in this House, I have not witnessed a more shameful spectacle frankly than what the party opposite left in our justice system.\" News of Kaddour-Cherif's release broke as PMQs was ending, and a comment released on Mr Lammy's behalf said he was \"absolutely outraged\" about it. He had been repeatedly asked whether any more asylum seekers had been mistakenly released from jail since the Kebatu case, and refused to answer. Read more from Sky News:Nearly 40,000 freed early to tackle prison overcrowdingHow many prisoners are released by mistake?Driver hits several people on holiday island  In response to concerns of a spike in crime should the Sentencing Bill become law, a Ministry of Justice spokesperson said the government \"inherited a prison system in crisis, days away from running out of space\". \"Public safety will always be our top priority, and we are building 14,000 more prison places to keep dangerous offenders locked up,\" they added. \"Offenders released face strict licence conditions, and we are increasing the probation budget by an extra £700 million over the next three years and investing in new technology to reduce admin, so staff can focus on work that reduces reoffending.\" And in response to the manhunt for the two released convicts, a spokesperson said: \"Releases in error have been increasing for several years and are another symptom of a justice system crisis inherited by this government.\" They added: \"We are clear that these mistakes must not continue to happen.\""
    },
    {
        "title": "Feeble and inept - prison release fiasco is yet another political crisis",
        "description": "The charitable view of the latest prison release blunder that has plunged the government into another political crisis is that it's extremely bad luck rather than an act of incompetence by ministers.&#160;",
        "url": "https://news.sky.com/story/feeble-and-inept-prison-release-fiasco-is-yet-another-political-crisis-13464456",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-david-lammy-dpmqs-commons_7072997.jpg?20251105165133",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-11-05 16:29:00",
        "Headline": "David Lammy was asked five times by Conservative James Cartlidge if any further prisoners had been released by mistake since Hadush Kebatu was freed in error.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n The charitable view of the latest prison release blunder that has plunged the government into another political crisis is that it's extremely bad luck rather than an act of incompetence by ministers.  But the more we learn about the shocking details of what happened and what looks like a cynical attempt at a cover-up by the hapless David Lammy, the more the blame can be laid at the government's door. Politics latest: Badenoch slams 'shambles of a government' Critics of the justice secretary and deputy prime minister, standing in for Sir Keir Starmer at PMQs, claim this sorry episode reveals his pomposity, inability to think on his feet and a tendency to blame others for a fiasco. And it's not as if the accidental prison releases that have shocked the nation and outraged public opinion in recent weeks are the only fiascos on the government's watch. For example: The asylum seeker deported on the government's one in, one out deal with France who then returned to the UK on a small boat across the Channel was another case of a policy that critics claim isn't working. The furore over the tax rises expected in Rachel Reeves' budget can be attributed to what now looks like a strategic error in promising no rises in income, VAT or national insurance in Labour's election manifesto. \n                  Police chiefs warn of crime surge if Labour's plans pass - as hunt for mistakenly released prisoners continues\n                 \n                  Government 'ready to be held to account' over prisoner releases, says minister\n                 \n                  Wandsworth manhunt latest: Search is on for two prisoners freed by mistake\n                 The chancellor's failure to apply for a local authority licence to rent out her home in London's leafy suburbs revealed a lack of judgment on her part, on top of her dodgy CV about her jobs before becoming an MP. Angela Rayner's careless approach to stamp duty requirements on her luxury beachfront flat that forced her resignation triggered a botched reshuffle that caused resentment among ministers and MPs.  The appointment of Peter Mandelson as US ambassador - described by ministers as \"a risk worth taking\" - despite his links to paedophile Jeffrey Epstein, always looked like an accident waiting to happen. The list goes on. But Mr Lammy's handling of the Wandsworth prison releases (another was revealed hours after PMQs) has been chaotic, shifty and made a bad situation worse. It couldn't have come at a worse time, of course, when he was deputising at PMQs. We now know that he was told about the release blunder overnight. His excuse for dodging James Cartlidge's questions in PMQs about another release was that information was still emerging and the case was complicated. Feeble! And inept. Read more:Manhunt for two prisoners freed in errorHow many prisoners are released by mistake? A tougher law and order minister in the mould of David Blunkett, John Reid, Michael Howard or - dare one say - his predecessor as justice secretary, Shabana Mahmood - would have demanded the full facts on his desk first thing in the morning. Was Mr Lammy guilty of a deliberate cover-up or was he just incompetent, with no grip over his department and the increasingly accident-prone prison service? Either is bad and damaging for the government's credibility. We also know that the Conservatives found out about the mistaken release 15 minutes before PMQs. Tory stand-in Mr Cartlidge doggedly asked him no fewer than five times if there had been any more accidental releases. Mr Lammy floundered and, in what was a very bad look, lost his temper. That was a bad mistake. His tactics backfired spectacularly. When Mr Cartlidge rose at the end of PMQs and told MPs another prisoner had indeed been mistakenly released, Mr Lammy fled the chamber in indecent haste, ignoring the Speaker's offer of a response.  It was, or course, Angela Rayner's resignation over her stamp duty blunder that brought about Mr Lammy's elevation to deputy prime minister. And that, of course, was a sop to compensate him for losing the Foreign Office brief. His critics claim Mr Lammy was over-promoted when he was appointed shadow foreign secretary. But then he did co-chair Sir Keir's 2020 leadership campaign. And, like the PM, he's a barrister. Elected MP for Tottenham in a by-election in 2000, he held a number of junior and middle-ranking ministerial posts under Tony Blair and Gordon Brown. And in a humiliating appearance on TV's Celebrity Mastermind in 2009, he said in one answer during a general knowledge round that Henry VII acceded the English throne after the death of Henry VIII. But the minister now dubbed \"Calamity Lammy\" by his Tory opponent Robert Jenrick isn't the only minister guilty of blunders. Top of that list must be the prime minister himself. Sir Keir makes the appointments, controls policy from No 10, overrules ministers and - when it comes to the economy - is, after all, the First Lord of the Treasury. Yes, some of the government's political problems are down to bad luck. But not all, by any means. To misquote Oscar Wilde, the most famous prisoner held in another prison, Reading Gaol: \"To lose one prisoner may be regarded as a misfortune. To lose two looks like carelessness.\""
    },
    {
        "title": "Collins Word of the Year 2025 revealed - do you recognise it?",
        "description": "The term \"vibe coding\" has been named the Collins Word of the Year for 2025, beating contenders like \"clanker\", \"glaze\" and \"aura farming\".",
        "url": "https://news.sky.com/story/collins-word-of-the-year-2025-revealed-do-you-recognise-it-13464395",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/2372402200584454407_6462356.jpg?20240220141821",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-05 14:38:00",
        "Headline": "This year's winner follows on from last year's \"brat\", which was popularised by British singer Charli XCX.",
        "Content": "The term \"vibe coding\" has been named the Collins Word of the Year for 2025, beating contenders like \"clanker\", \"glaze\" and \"aura farming\". Vibe coding refers to an emerging software development process that turns natural language into computer code using AI. The term, coined in February by Andrej Karpathy, former director of AI at Tesla and a founding engineer at OpenAI, essentially outlines how a person can now prioritise describing what they need to AI so it can generate code on their behalf, rather than writing code line-by-line themselves. Lexicographers at Collins monitor the Collins Corpus, a 24 billion-word database which draws from a range of media sources, including social media, to create the annual list of new and notable words. Vibe coding was in close contention with \"clanker\" - a derogatory term for computers, robots, or sources of AI, often used on social media to express frustrations and distrust in AI chatbots and platforms, and \"glaze\" - to praise or flatter someone excessively or undeservedly. Other popular terms considered were \"aura farming\" - the practice of trying to look cool through the deliberate cultivation of a distinctive and charismatic persona, and \"broligarchy\" - referring to the owners of the biggest global technology companies, informally known as \"tech bros\". Read more from Sky News:Is net zero dead?Who is Zohran Mamdani?What's the impact of the US shutdown? Here are some of the other contenders: • Biohacking - also referred to as \"do-it-yourself biology\". This describes the activity of altering the natural processes of one's body in an attempt to enhance physical wellbeing and extend lifespan. • Micro-retirement - a term often used by Gen Z and millennials to describe taking a break between periods of employment in order to pursue personal interests. • Coolcation - a holiday in a place with a cool climate, as temperatures soar where they live or where they typically spent their holidays. • Taskmasking - the act of giving a false impression that one is being productive in the workplace. • HENRY - an acronym for \"high earner, not rich yet\". Refers to someone who has a large income but hasn't saved a lot. Collins' top words of the year can leave some feeling culturally informed and others completely out of touch. Here are the previous Collins words going back 10 years – how many do you recognise? 2015: Binge-watch – defined as viewing more than three episodes of a series in one day. 2016: Brexit – the withdrawal of the UK from the European Union. 2017: Fake news - defined as \"false, often sensational, information disseminated under the guise of news reporting,\" it has remained one of Donald Trump's catchphrases during his second term. 2018: Single-use - popularised by the increasing call to ban materials that damage the environment and pollute the food chain. 2019: Climate strike – a form of protest popularised by activist Greta Thunberg, where demonstrators skip work or school to raise awareness of climate change. 2020: Lockdown – chosen in the height of the COVID-19 pandemic, Collins defined lockdown as \"the imposition of stringent restrictions on travel, social interaction, and access to public spaces\". 2021: NFT – the abbreviation for non-fungible token - clinched the top spot. In case you still don't get it, an NFT is a unique digital identifier that records ownership of a digital creation asset. This can be a picture, a video, a piece of music or even a tweet. 2022: Permacrisis – defined as \"an extended period of instability and insecurity,\" this one came during the year the Ukraine war began, the cost-of-living crisis worsened significantly and political tensions increased. 2023: AI – the abbreviation of artificial intelligence took the top spot, with AI becoming the dominant conversation worldwide after ChatGPT was launched in November 2022. 2024: Brat – popularised by British singer Charli XCX, brat took on a new meaning last year as a lifestyle \"characterised by a confident, independent, and hedonistic attitude\"."
    },
    {
        "title": "'Posh boys' playing gangsters: Eddie Marsan on TV and film industry’s obsession with upper-class actors",
        "description": "Over the last two decades, Eddie Marsan has established himself as one of Britain's most versatile and acclaimed character actors. From major blockbusters like the Sherlock Holmes films and Mission: Impossible III, to his roles on the TV series Ray Donovan, and more recently the sci-fi drama Supacell.",
        "url": "https://news.sky.com/story/posh-boys-playing-gangsters-eddie-marsan-on-tv-and-film-industry8217s-obsession-with-upper-class-actors-13464383",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-eddie-marsan-actor_7072897.jpg?20251105150821",
        "type": "UK",
        "Author": "Katie Spencer",
        "Date Published": "2025-11-05 14:10:00",
        "Headline": "\"If you want to be an actor in this country, and you come from a disadvantaged background, you have to be exceptional,\" says Marsan, who argues people like Laurence Fox fear greater representation on screen will \"level the playing field\".",
        "Content": "\n          Arts and entertainment correspondent\n        Over the last two decades, Eddie Marsan has established himself as one of Britain's most versatile and acclaimed character actors. From major blockbusters like the Sherlock Holmes films and Mission: Impossible III, to his roles on the TV series Ray Donovan, and more recently the sci-fi drama Supacell. As a performer, he is a skilled observer. And one thing he's come to notice a lot over the years is how few of his castmates tend to share his working-class roots. \"If you want to be an actor in this country, and you come from a disadvantaged background, you have to be exceptional to have a hope of a career,\" he says. \"If you come from a privileged background, you can be mediocre.\" Speaking after being named one of the new vice presidents of drama school Mountview, and meeting students at the establishment where he too first trained, Marsan is keen to stress why it's so necessary to support young actors who can't fund their careers. \"I came here when I was in my 20s… I was a bit lost, to be honest… I was serving an apprenticeship as a printer when Mountview offered me a place,\" he says. \"There were no kinds of grants then, so for the first year an East End bookmaker paid my fees, then my mum and him got together and paid the second year, then Mountview gave me a scholarship for the third year, so I owe them everything. \"I didn't earn a living as an actor for like six, seven years… years ago, actors could sign on and basically go on the dole while doing plays… now, in order to become an actor, you have to have the bank of mummy and daddy to bankroll you for those seven or eight years when you're not going to earn a living.\" Marson and Dame Elaine Paige are both taking on ambassadorial roles to mark Mountview's 80th anniversary, joining Dame Judi Dench, who has been president of the school since 2006. \"The parties are fantastic,\" he jokes. \"The two dames, they get so half-cut, honestly, you have to get an Uber to get them home!\" But he's rather more serious about TV and film's \"fashion for posh boys\". \"When I went to America and I did 21 Grams and Vera Drake. I remember thinking, 'great I'm going to have a career now,' but I wasn't the idea of what Britain was selling of itself. \"Coming back from Hollywood, a publicist said to me 'when we get to London and do publicity for the film 21 Grams we're going to come to you'… but no one was interested… I remember coming to Waterloo station and looking up and seeing all these posh actors selling Burberry coats and posters, and they hadn't done anything compared to what I'd done, and yet they were the image that we were pushing as a country.\" Read more from Sky News:Diary collection wins prestigious non-fiction prizeBeckham receives knighthood at Windsor Castle A 2024 Creative Industries, Policy, and Evidence Centre report found 8% of British actors come from working class backgrounds, compared to 20% in the 70s and 80s. \"Even a gangster movie now, 40 years ago you would have something like The Long Good Friday or Get Carter with people like Michael Caine or Bob Hoskins who were real working-class actors playing those parts, now you have posh boys playing working-class characters.\" Within the last five or six years, he says there has at least been \"more of an effort to include people of colour\". 'They're scared of a level-playing field' \"What I find really interesting is, I've been an actor for 34 years, and I remember for the first 20 years going on a set and very rarely within the crew and within the cast would you see a black face, very rarely. \"One of the saving graces really are things now like Top Boy and Supacell, where you have members of the black community making dramas about their communities, that can't be co-opted by the middle classes.\" \"People like Laurence Fox complaining that it's unfair, I never heard them complain when you never saw a black face, never once did they say anything. Now that people are trying to address it, they think it's unfair…because they're scared of a level playing field.\" Now, more than ever, Marsan says he feels compelled to point out what needs to change within the industry he works in. \"Look, social media is destroying cultural discourse. It's making people become very binary… acting and drama is an exercise in empathy and if there's one thing that we need more of at the moment it's that.\""
    },
    {
        "title": "Maccabi boss hits out at 'blatant falsehoods' peddled about their fans - but admits work to do on racism",
        "description": "The chief executive of Israeli football team Maccabi Tel Aviv has denounced \"falsehoods\" and hatred being spewed about their supporters, leading to them being banned from Aston Villa, while accepting there is work to do to eradicate racism in the fan base.",
        "url": "https://news.sky.com/story/maccabi-boss-hits-out-at-blatant-falsehoods-peddled-about-their-fans-but-admits-work-to-do-on-racism-13464552",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-maccabi-tel-aviv-football_7073185.jpg?20251105204123",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-11-05 19:59:00",
        "Headline": "More than 700 police officers are due to deploy to a Europa League match between Aston Villa and Maccabi Tel Aviv, with protests anticipated outside by Palestinian and Israeli groups.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n The chief executive of Israeli football team Maccabi Tel Aviv has denounced \"falsehoods\" and hatred being spewed about their supporters, leading to them being banned from Aston Villa, while accepting there is work to do to eradicate racism in the fan base. Jack Angelides told Sky News there is a need for \"toning down the incitement\" ahead of tomorrow's Europa League match at Villa Park, which will see more than 700 police officers deployed with protests anticipated outside by Palestinian and Israeli groups. Mr Angelides revealed the club has not been given a specific reason for Birmingham authorities banning their supporters - a decision which the government pushed to be overturned before Maccabi said they would reject any fan allocation granted in any case. \"We feared for the safety of our fans and it's a huge responsibility,\" Mr Angelides said in an interview at Villa Park. \"[With] a lot of incitement, we didn't feel comfortable in taking that allocation and that's a sad day in football because things like that shouldn't happen. \"People have the right to freedom of speech, absolutely, but people don't have the right to spew hatred.\" Birmingham's Safety Advisory Group (SAG) announced last month that visiting fans will be barred from attending the game at Villa Park amid public safety concerns. West Midlands Police also classified the Europa League match \"high risk\" and said the ban was necessary due to \"current intelligence and previous incidents\". That was a reference to Maccabi's match at Ajax last November when their fans were attacked by locals, leading to five convictions. No Maccabi fans were prosecuted. They were seen tearing down Palestinian flags and chanting anti-Arab abuse. Read more from Sky News:Search is on for two prisoners freed by mistakeDog that killed nine-month-old baby was XL bully Mr Angelides said: \"We have not been given a clear reason [for the ban], but I have seen people coming up with all sorts of stories of our fans, especially in Amsterdam, where there was, what the Amsterdam authorities themselves classified as 'a Jew hunt', being portrayed as organised fighters, soldiers, etc, etc. \"It's just blatant falsehoods, and people who say those things know that they're false and shame on them.\" Mr Angelides believes the decision has been kept private to leave open for people to form a conclusion and characterise his club as racist. Ayoub Khan, the independent pro-Gaza MP whose constituency covers Villa Park, called for the ban because the club has \"hooligans who have a long history of violence and vile racism\". \"Any club that tries to suggest that they don't have any issues, whatever that may be, it's untrue,\" Mr Angelides said. \"We know we've got a long road ahead. There are elements in the club that are not in line with our values, our morals, and we do expend a lot of energy and have been for many, many years in trying to… eradicate that. \"But to malign thousands and thousands of good fans with the actions of a few, it's a dangerous game because I think that's something that is not conducive to toning down the incitement that's actually going on now. It's manipulation to my mind.\"  Football focus Mr Angelides did not discuss whether there was fear among the players going into a potentially hostile environment. \"We have Jewish players; we have Christian players; we have Muslim players - we're a club that's quite diverse,\" he said. \"There is an understandable excitement of playing. They're aware, … the last two years have taken a toll on Israeli society because of what's been going on. So they're very aware of the situation, but I think they're prepared to focus on their football.\" The game is going ahead, after moves in European football to ban Israeli teams over the war in Gaza faded, as a peace deal was implemented."
    },
    {
        "title": "'I'm desperately sorry': Axel Rudakubana's father accepts 'share of the responsibility' after Southport attack",
        "description": "Axel Rudakubana's father has said he is \"desperately sorry\" for failing to challenge his son's violent behaviour over the years before the Southport attack. ",
        "url": "https://news.sky.com/story/im-desperately-sorry-axel-rudakubanas-father-accepts-share-of-the-responsibility-after-southport-attack-13464330",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-southport-attack-southport-stabbings_6976493.jpg?20250729034220",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-11-05 12:24:00",
        "Headline": "An inquiry hears Rudakubana did not leave home alone for more than two years before carrying out the attack.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  Axel Rudakubana's father has said he is \"desperately sorry\" for failing to challenge his son's violent behaviour over the years before the Southport attack.  Alphonse Rudakubana told a public inquiry he was \"frightened\" of his son, who once poured a bottle of oil over him and said: \"Trust me, I will kill you.\" He said Axel's behaviour deteriorated in a \"short period of time\" until he was expelled from the Range High School in Formby, Merseyside, in October 2019 after admitting to carrying knives. Two months later, he returned to attack a pupil with a hockey stick, while armed with a knife and was arrested and made subject to a referral order, aged 13.  Alphonse said his son would have \"random\" violent outbursts, attacking him up to twice a day, but he became \"conditioned to his behaviour\" and \"allowed him to abuse and assault me\". \"I'm ashamed of my response,\" he said, adding his fear \"prevented him from doing things a parent would normally do\", such as restricting internet activity and ordering weapons online. \"This had catastrophic consequences for which I'm desperately sorry,\" he said. \"I accept I bear my share of the responsibility and that by not challenging his behaviour he was allowed to acquire dangerous weapons and view inappropriate content online.\" He said he and his wife Laetitia Muzayire \"couldn't set boundaries, we couldn't say anything because it would lead to outbursts, and he was effectively out of control\". He also said he feared his son would be taken away. Axel was referred three times to the government's anti-terror programme Prevent between 2019 and 2021 because of concerns over his fixation with violence, including school shootings. The criminal investigation showed he had images of mutilated bodies, torture, cartoons mocking Islam, antisemitic material, Nazi mass graves and material demeaning to women and girls, on his devices. His father told the inquiry he was not aware of the material but admitted: \"I had lost control, I had no authority as a father.\" \"I was reduced to somebody who feeds him, does all he asks,\" he said, adding: \"I had no power to stop him from accessing anything he wanted online.\" The inquiry heard Axel received a delivery of a machete in June 2023 but his father said he didn't confront him \"because he would fly into a rage\". Knife packaging found in washing machine after Rudakubana left home His brother Dion said Axel would order packages online with money he made through his genealogy business which he feared \"had something bad in them\". He told the inquiry the last time his brother left home alone before the Southport attack was when he was caught carrying a knife on a bus in March 2022, telling police he was \"going out to stab someone to get rid of his social media accounts\". Dion said it would have seemed \"logical\" to Axel, adding: \"It wouldn't have been anyone specific, just a random person.\" A week before the mass stabbing, armed with a knife, Axel booked a taxi to his old school and tried to get in, but was stopped by his father. Axel Rudakubana, was aged 17 when he murdered Elsie Dot Stancombe, seven, Bebe King, six, and Alice da Silva Aguiar, nine, in a knife attack on a Taylor Swift-themed dance class on 29 July last year. Read more:Rudakubana was 'building up to something'Rudakubana judged as posing no risk to othersThe missed chances to stop Rudakubana Eight other children, who cannot be identified because of their age, were also injured, along with yoga instructor Leanne Lucas, who was leading the dance class, and businessman John Hayes, who was one of the first people on the scene and tackled the killer. Dion described the moment his brother left the family home that morning wearing a face mask and with the sleeves of his hoodie pulled down. He told the inquiry how his mother showed him the knife packaging she found in the washing machine shortly after. But his parents \"didn't seem alarmed\" and his mother went back to bed so he took \"comfort\" from this and there was \"no discussion about contacting the police\". \"We did not believe he intended to harm anyone\" and thought if he was carrying a knife it was to \"protect himself, not to harm others\", Dion said. Asked about why Axel may have targeted the Taylor Swift-themed dance class, Dion suggested because \"children are very valuable to society\" and it would \"hurt society very badly\" if children were to be harmed. The inquiry, which is being held at Liverpool Town Hall, continues on Thursday."
    },
    {
        "title": "Joey Barton's posts 'caused me sleepless nights', says Jeremy Vine",
        "description": "Broadcaster Jeremy Vine has told a jury he felt \"wickedly torn down for no reason\" by ex-footballer Joey Barton, whose online posts led him to take civil action.",
        "url": "https://news.sky.com/story/jeremy-vine-tells-jury-he-felt-wickedly-torn-down-by-joey-barton-posts-13464462",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-jeremy-vine-court-joey-barton_7072603.jpg?20251105102737",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-05 16:48:00",
        "Headline": "The broadcaster says the ex-footballer's posts about him and other commentators led him to take civil action as he \"began to feel scared\" for his safety.",
        "Content": "Broadcaster Jeremy Vine has told a jury he felt \"wickedly torn down for no reason\" by ex-footballer Joey Barton, whose online posts led him to take civil action. The TV and radio presenter said he intervened to support football commentators Lucy Ward and Eni Aluko after Barton shared an image online of their faces superimposed on to a photograph of notorious serial killers Fred and Rose West. After a televised FA Cup match between Crystal Palace and Everton in January 2024, the former Manchester City and Newcastle United footballer likened the sports broadcasters to the \"Fred and Rose West of commentary\". Responding to the comment, Vine said on X: \"What's going on with @Joey7Barton? I just glanced at the Rose West thing... genuinely, is it possible we are dealing with a brain injury here?\"  'I was quite shocked' Giving evidence on Wednesday, Vine said: \"I was quite shocked by what Mr Barton had said about two very respected commentators in Lucy Ward and Eni Aluko. \"I thought it was very vicious to impose them on the images of two mass murderers of children, and I was looking for an explanation. \"I said 'are we dealing with a brain injury here' as a way of underlining my own feelings that he had crossed the line on that tweet.\" Barton, 43, is currently standing trial at Liverpool Crown Court, accused of posting grossly offensive messages on X aimed at the three broadcasters, allegedly with the intent to cause distress or anxiety. The court heard that Mr Barton replied to Vine's tweet with a post referring to him as \"you big bike nonce\". The defendant, who has 2.7 million followers on X, also made references to convicted child sex offender Jeffrey Epstein. 'This now gets really serious' Vine told the prosecutor he felt \"very alarmed\" that Mr Barton was choosing \"this word 'nonce' to throw around\" and that \"this was now escalating\". \"This now gets really serious. He is accusing me of being a paedophile,\" he said. \"These are disgusting actions. It's a despicable thing to say. \"It gravely upset me, and I had a sleepless night that night.\" As more posts followed, Vine \"began to feel scared\". Read more from Sky News:How many prisoners are released by mistake in the UK?Migrant sent back to France for second time in two months Vine said: \"I realised I had to take some action, but I was not sure what to do. I realised the quickest remedy would be some sort of civil action.\" Civil proceedings were initiated in March 2024. A week later, a post from Mr Barton's X account stated: \"If anyone has any information about Jeremy Vine - pictures, screenshots, videos, or messages that could help us in the case - please send them to me using the hashtag #bikenonce.\" Jurors heard that in June 2024, Barton agreed to pay Mr Vine £75,000 in damages for defamation and harassment, along with his legal expenses, as the two parties reached a settlement in the civil case. In a separate agreement, Barton also paid Vine an additional £35,000 in damages and legal costs relating to similar issues. The court was told that Mr Barton issued a public apology on his X account in June 2024, admitting that he had made a \"very serious allegation\" on social media. He denies the offences said to have been committed between January and March 2024."
    },
    {
        "title": "Ex-police officer says she's not a 'racist murderer' following death of black man",
        "description": "A former police officer who was injured in an incident by a suspect has told Sky News she has been branded a &#8220;racist\" following his death. ",
        "url": "https://news.sky.com/story/former-police-officer-nicole-short-says-shes-not-a-racist-murderer-following-the-death-of-sheku-bayoh-13464502",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-police-scotland_7073109.jpg?20251105184950",
        "type": "UK",
        "Author": "Connor Gillies",
        "Date Published": "2025-11-05 18:21:00",
        "Headline": "Bayoh, a father-of-two from Fife, died after he was restrained by police officers in the town of Kirkcaldy in May 2015.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n  A former police officer who was injured in an incident by a suspect has told Sky News she has been branded a “racist\" following his death.  Sheku Bayoh, a black father-of-two from Fife, stopped breathing after being restrained and pinned down by police in the town of Kirkcaldy in May 2015. Mr Bayoh, who had taken the drugs MDMA and Flakka, was found to have suffered 23 separate injuries. PC Nicole Short, who is around 5ft, was one of the first responders to 999 calls from the public, who reported seeing the 31-year-old walking the streets with a knife. Speaking for the first time to the media, Ms Short said she has been forced to retire due to her ill-health. 'I thought he was going to kill me' The 39-year-old has said she believed she was going to be killed by Mr Bayoh after being \"stamped on\". \n                  Gold bars and jewellery among £2m haul seized at Manchester Airport\n                 \n                  Home Office must deliver on police reform at critical moment, watchdog warns\n                 \n                  Five teenagers arrested as murder probe under way after house fire in Devon\n                 Ms Short said: \"He kept coming at me with his fists up like a boxer. \"I thought he was going to kill me. He was on a mission. I thought I was done. The ground is the most dangerous place to be.\" Mr Bayoh was later found not to have a knife in his possession at the time of his death. A weapon was found discarded nearby. Ms Short told Sky News she believed Bayoh may have concealed a weapon on his body and was capable of \"stabbing somebody, murdering somebody\". Two doctors, who examined Ms Short in the hours after the incident, previously told a public inquiry there were no signs of serious injury on the officer. Police accounts of Ms Short being stamped on by Mr Bayoh are disputed by a member of the public who watched the incident from his house. He alleges the stamping did not happen. Read more from Sky News:Major incident declared in parts of Wales after floodingDog that killed nine-month-old baby in Rogiet was XL bully A public inquiry examining the circumstances surrounding the incident, including whether race played a role in the police response and subsequent investigation, has descended into chaos. The Chair, Lord Bracadale, stood down after being accused of apparent bias over private meetings he held with the Bayoh family. The inquiry, which has so far cost more than £50m, is now searching for a new chairperson. 'I am not a racist' Ms Short believes she has been painted to be a racist. \"It's been horrible for myself and my family. \"He was a man with a knife - a dangerous weapon. Members of the public had phoned us because they were scared.\" Asked if she was racist, Ms Short said \"no way\" and denies she would have acted differently if the confrontation had been with a white suspect. She said: \"Race was mentioned early on. I couldn't believe it. I couldn't believe that on top of everything else that we were being accused of being racist, murdering police officers. Trying to live your daily life with that hanging over you. \"We were all white police officers. We were sent to a call and the man who we were sent to was black. That is as far as it goes. I understand the tragic death of Mr Bayoh and we all feel that, but we are not racist, murdering police officers.\" Scotland's prosecution service, the Crown Office, previously took the decision not to prosecute any of the officers involved in the incident after a \"thorough review\" of all the available evidence. Aamer Anwar, the lawyer representing the family of Mr Bayoh, said in response to Ms Short's comments: \"The words of Nicole Short today are grotesque, and... a further attempt to smear, criminalise and negate Sheku's right to life. \"There is only one person that died that day and it was a 31-year-old unarmed black man, a father of two boys, suffering mental health crisis due to drugs he took. \"He died as a result of restraint by up to six officers - with half a tonne weight on top of him - those are the facts.\""
    },
    {
        "title": "Prisoner serving life for murdering toddler found dead in his cell",
        "description": "A prisoner serving a life sentence for killing his stepdaughter has been found dead in his cell.",
        "url": "https://news.sky.com/story/prisoner-serving-life-for-murdering-toddler-found-dead-in-his-cell-13464559",
        "image_url": "https://e3.365dm.com/23/04/1920x1080/skynews-kyle-bevan-sinead-james_6132880.jpg?20230425132208",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-05 20:03:00",
        "Headline": "Kyle Bevan, 33, was serving a life sentence for murdering two-year-old Lola James, who had suffered 101 separate injuries to her body, including a 'catastrophic' brain injury. ",
        "Content": "A prisoner serving a life sentence for killing his stepdaughter has been found dead in his cell. Kyle Bevan was given a life sentence with a minimum term of 28 years for attacking two-year-old Lola James in her home in Haverfordwest, Pembrokeshire, on 17 July 2020. She died four days later. Bevan, 33, from Aberystwyth, was found dead on Wednesday morning in his cell at HMP Wakefield, police said. \"Investigations into the man's death are in their early stages and enquiries are being carried out,\" West Yorkshire Police said in a statement. Swansea Crown Court heard evidence that Lola had suffered 101 separate injuries to her body, including a \"catastrophic\" brain injury. Bevan claimed Lola had fallen down the stairs after the family dog pushed her. Her mother, Sinead James, was sentenced to six years for causing or allowing the death of a child. \n                  Police chiefs warn of crime surge if Labour's plans pass - as hunt for mistakenly released prisoners continues\n                 \n                  Feeble and inept - prison release fiasco is yet another political crisis\n                 \n                  Collins Word of the Year 2025 revealed - do you recognise it?\n                 A child practice review, commissioned by the Mid and West Wales Safeguarding Children Board, found that an assessment of Lola's needs was \"not properly undertaken\" prior to her death. Child practice reviews are conducted when a child dies or suffers a serious injury and was neither on the child protection register nor a \"looked-after child\" during the six months before the event. Read more from Sky News:Joey Barton's posts 'caused me sleepless nights', says Jeremy VineDog that killed nine-month-old baby in Rogiet was XL bully The review also identified \"a number of missed opportunities by the health visiting service\". James had not agreed to any home visits during the five-month period from 15 February 2020 to 16 July 2020. \"In future cases, far more probing and challenge is needed by health visitors,\" the review found. 'Monster' who 'needs to rot in hell' During the trial, James described Bevan as a \"monster\" who \"needs to rot in hell\" for taking her daughter's life. \"If I had got him out of the house, my daughter would still be alive today,\" she said. Judge Mr Justice Griffiths said he was sure Bevan \"was responsible for multiple assaults on the children before he murdered Lola\". Bevan \"didn't get emergency help, he didn't wake Lola's mum up. Instead, he tried to cover his tracks,\" the judge said."
    },
    {
        "title": "Elon Musk: Why some are starting to question if the world's richest man is still value for money",
        "description": "Elon Musk is already the world's richest man, but today he could take a giant step towards becoming the world's first trillionaire.",
        "url": "https://news.sky.com/story/elon-musk-why-some-are-starting-to-question-if-the-worlds-richest-man-is-still-value-for-money-13464620",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-elon-musk-air-force-one_7073336.jpg?20251106013545",
        "type": "World",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-11-05 21:31:00",
        "Headline": "As Tesla shareholders vote on a deal that would help hand Elon Musk unprecedented wealth for corporate America, some are questioning whether the controversial tech tycoon represents a smart investment.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Elon Musk is already the world's richest man, but today he could take a giant step towards becoming the world's first trillionaire. Shareholders at Tesla are voting on a pay deal for their chief executive that is unlike anything corporate America has ever seen. The package would grant Musk, who already has a net worth of more than $400bn, around 425 million shares in the company. That would net him about $1trn (£760bn) and, perhaps more importantly to Musk, it would tighten his grip on the company by raising his stake from 15% to almost 30%. The board, which has been making its case to retail investors with a series of videos and digital ads, has a simple message: Tesla is at a turning point. Yes, it wants to sell millions of cars, but it also wants to be a pioneer in robotaxis, AI-driven humanoid robots, and autonomous driving software. At this moment, it needs its visionary leader motivated and fully on board. Musk has served his warning shot. Late last month, he wrote on X: \"Tesla is worth more than all other automotive companies combined. Which of those CEOs would you like to run Tesla? It won't be me.\" Not everyone is buying it, however. With so much of his personal wealth tied up in Tesla, would Musk really walk away? Bad for the brand? Others see his continued presence and rising influence as a risk. Norway's sovereign wealth fund, the world's largest, which owns 1.1% of the company (making it a top 10 shareholder), has already declared it will vote against the deal. It cited concerns about \"the award's size, dilution, and lack of mitigation of key person risk\". Several major US pension funds have followed suit. In an open letter published last month, they warned: \"The board's relentless pursuit of keeping its chief executive has damaged Tesla's reputation.\" They also criticised the board for allowing Musk to pursue other ventures. They said he was overcommitted and distracted as a result. Signatories of that letter included the state treasurers of Nevada, New Mexico, Connecticut, Massachusetts, Colorado, and the comptrollers of Maryland and New York City. All of them Democrats. Republicans have been more favourable. There is a political slant to this. The signatories' concerns with his \"other ventures\" no doubt include the time Musk spent dabbling in right-wing politics with the Republican inner circle. That made him a polarising figure and, to an extent, Tesla too. Pay packet dwarfs rivals Combine this with a mixed sales performance and a volatile share price, and some are wondering whether the carmaker has lost its way under his leadership. Irrespective of performance, for some, the existence of billionaires - let alone trillionaires - can never be justified. Some may also ask why Musk is worth so much more than the leaders of Apple, Facebook, and Microsoft, or Nvidia, the world's most valuable company by market capitalisation. Nvidia's chief executive, Jensen Huang, received $49.9m (£37.9m) this fiscal year. So, how has Tesla come up with these numbers? Why is Musk's pay so out of kilter with the benchmark? Does the company have a corporate governance problem? The courts have suggested it might. Last year, a Delaware court took the view that Tesla's board members, which include Musk's brother Kimbal, were not fully independent when agreeing to a $56bn (£42.6bn) pay packet back in 2017. Read more from Sky News:Badenoch calls for government to 'get Britain drilling again'Sickness bill costs £85bn a year, says new report The Delaware Supreme Court is now reviewing the case. It is a reminder that even if Musk meets his targets, a similar fate could befall the current package. The Tesla board is holding firm, however. Robyn Denholm, the company's chair, told The New York Times: \"He doesn't get any compensation if he doesn't deliver,\" adding that Musk \"does things that further humankind\". Tesla's valuation is tied up in its promise to deliver revolutionary AI and robotics products that will change the world. Those ambitions, which include robots that can look after children, are lofty. Some would call them unrealistic, but the board is adamant that if they are to become a reality, only Musk can make it happen. Under the deal, Musk would receive no salary or cash bonus. Instead, he would collect shares as Tesla's value grows. To unlock the full package, he would have to increase the current market valuation six times to $8.5trn (£6.47trn). For context, that's almost twice that of Nvidia. There are other hurdles. The company would have to sell 20 million additional electric vehicles, achieve 10 million subscriptions to its self-driving software on average over three months, deploy one million robotaxis on average over the same period, sell one million AI-powered robots, and boost adjusted earnings 24-fold to $400bn (£304bn). They are ambitious targets, but Musk has defied the sceptics before."
    },
    {
        "title": "Several hurt after motorist hits pedestrians and cyclists on French island of Ile d'Oleron",
        "description": "Five people have been injured after a car was driven into pedestrians and cyclists on the French island of Ile d'Oleron.",
        "url": "https://news.sky.com/story/driver-hits-several-people-on-french-holiday-island-of-ile-doleron-13464083",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-cyclists-pedestrians_7072800.jpg?20251105132510",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-05 00:01:00",
        "Headline": "Two people are in intensive care after the incident which lasted for 35 minutes, French interior minister Laurent Nunez said.",
        "Content": "Five people have been injured after a car was driven into pedestrians and cyclists on the French island of Ile d'Oleron. Two people are in a serious condition in hospital and a man has been arrested, French interior minister Laurent Nunez said. The incident lasted for 35 minutes and the suspect had tried to torch his car, added Mr Nunez. \"This morning, starting at 8:40, an individual driving his vehicle went on a journey during which he deliberately hit several people who were in his path, either on bicycles or on foot,\" he said. Thibault Brechkoff, the mayor of Dolus-d'Oleron, told BFMTV the suspect shouted \"Allahu Akbar\" (Arabic for God is Greatest) when he was detained. Arnaud Laraize, the public prosecutor in La Rochelle, told the Sud Ouest newspaper the 35-year-old suspect \"resisted arrest\" and was \"subdued using a stun gun\". He said the suspect was known for minor offences such as theft, adding he was not on a list of people considered a threat to national security. Pedestrians and cyclists were hit on a road between Dolus d'Oleron and Saint-Pierre d'Oleron, he added. Police were alerted, with the first calls made at around 9am. Read more from Sky News:Rapper detained in murder investigation of influencerJapan sends in troops to tackle bear attacks The suspect is a French national from La Cotiniere, a small fishing village on the west coast of Ile d'Oleron, according to French media reports. The motive for the attack remains unclear and the anti-terrorism prosecutor's office is not involved. Mr Nunez said he was heading to the scene at the request of Sebastien Lecornu, the French prime minister."
    },
    {
        "title": "Prince William photographed at iconic spot Diana posed at decades earlier",
        "description": "Prince William posed in front of the Christ the Redeemer statue - the same spot his mother had stood in Rio - on day three of his trip to Brazil.",
        "url": "https://news.sky.com/story/prince-william-photographed-at-iconic-spot-diana-posed-at-decades-earlier-13464407",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-prince-of-wales-prince-william_7072766.jpg?20251105130454",
        "type": "World",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-11-05 15:08:00",
        "Headline": "William is in Rio to mark the fifth year of his Earthshot Prize and had earlier met the finalists of this year's awards.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  Prince William posed in front of the Christ the Redeemer statue - the same spot his mother had stood in Rio - on day three of his trip to Brazil. The usually packed tourist attraction - one of the New Seven Wonders Of The World - had been closed to the public to allow the Prince to meet this year's 15 Earthshot finalists and learn about their experiences and hopes for the future. William is making a five-day visit to Brazil, his first to the South American country, to stage his Earthshot Prize, a global environmental competition to find solutions to \"repair\" the planet. After posing for a photograph with the finalists on the steps in front of the iconic statue, William then walked to a spot where his mother Diana, Princess of Wales had also previously stopped for a photograph in 1991. From the summit of Mount Corcovado he quietly looked out at the stunning views of the city hundreds of metres below, partly shrouded in clouds, before heading off for more Earthshot events. A Kensington Palace spokesperson said: \"The Prince has loved meeting so many people from across Rio over the last few days. He's been incredibly struck by the number of people who fondly remember his mother's visit to this beautiful city.\" The Earthshot award ceremony will take place tonight at Rio's Museum of Tomorrow, with stars Kylie Minogue and Canadian singer Shawn Mendes among the celebrities performing as five winners are awarded £1million. Prime Minister Sir Keir Starmer will also join William at the awards ceremony, where the Prince will give the keynote speech, before both men gather with world leaders at the global Cop30 climate change summit later this week, being staged in the Amazonian city of Belem."
    },
    {
        "title": "US likely jammed GPS signals off Venezuela coast, expert tells Sky News",
        "description": "High levels of GPS jamming detected off the coast of Venezuela were likely being carried out by the US, an expert has told Sky News.",
        "url": "https://news.sky.com/story/us-likely-jammed-gps-signals-off-venezuela-coast-expert-tells-sky-news-13464222",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-usa-venezuela_7072647.jpg?20251105110934",
        "type": "World",
        "Author": "Michael Drummond",
        "Date Published": "2025-11-05 08:45:00",
        "Headline": "Disruption to navigation signals has been picked up around Trinidad and Tobago, where a US warship had been stationed amid escalating tensions in the region.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n High levels of GPS jamming detected off the coast of Venezuela were likely being carried out by the US, an expert has told Sky News. Disruption to navigation signals has been picked up around Trinidad and Tobago, where a US warship had been stationed amid escalating tensions in the region. \"Looking at the map it's hard to say who else it could be,\" electronic warfare expert Dr Thomas Withington told Sky News. Sky News has contacted the US Department of Defence for comment but has not received a response. It comes as the USS Gerald R Ford aircraft carrier - the largest warship in the world - moves closer to Venezuela after being ordered to deploy to the Caribbean. Meanwhile, US secretary of war (the department formerly known as defence) Pete Hegseth announced another lethal strike on what the Trump administration claims are drug trafficking boats. News has also emerged that a Russian cargo plane operated by a sanctioned airline touched down in the Venezuelan capital, Caracas, late last month. \n                  'We will treat them EXACTLY how we treated al Qaeda' - US carries out another lethal strike in Caribbean\n                 \n                  More than a dozen killed as US attacks alleged drug boats in Pacific 'on Donald Trump's orders'\n                 \n                  Is Trump getting ready to run for a third term?\n                 GPS jamming detected  Heavy signals disruption has been detected not far off the coast of Venezuela, according to the open-source website GPSJam, which tracks instances of GPS interference around the world. It appears to be centred around Trinidad and Tobago and emerged around the time the USS Gravely guided missile destroyer arrived there in late October. It is not usual for disruption to be seen in that part of the world. Use the slider below to see the emergence of disruption between October 26 and November 3. Jamming can overwhelm an aircraft's GPS navigation systems, preventing them from working properly, leaving pilots to rely on other ways of finding out where they are. Western leaders blame Russia for its widespread use in eastern Europe, with the EU accusing Moscow of jamming the plane of its chief Ursula von der Leyen.  Read more:Who is messing with GPS signals in Europe?Questions raised by alleged GPS jamming of EU chief's flight Disruption off Venezuela's coast was minor at first but levels increased over the following days, showing up in red on the map, indicating higher amounts. Jamming was detected up until and including November 3, but the latest data for Tuesday, November 4, appears to show that the jamming stopped. \"Looking at the map it's hard to say who else it could be,\" says Dr Withington, an expert on electronic warfare at the RUSI thinktank. He argues that there aren't many militaries in that part of the world who would have the capability to disrupt GPS signals in such a widespread way. \"In absence of certainty, it would seem the evidence is suggesting it's the US military interests in the region,\" he said.  Why might the US be carrying out GPS jamming? Dr Withington says it seems like the GPS disruption there is \"defensive\", with the US possibly concerned about the use of drones. \"I wouldn't be surprised if it's counter-drone systems that are in their ships,\" he added. He says the US may be worried about the risk of Venezuelan drones being used to gather intelligence or the potential for kamikaze attacks on US warships. \"I can't say for certain... but if you think about what the Russians have been using, if you think about what the Iranians have - the stuff is out there and it is available from Venezuela's allies.\" Both Russia and Iran have increasingly used drones to harass or attack their enemies in recent years, with explosive Shaheds proving a deadly problem in Ukraine. \"If there's any military action involving the US and Venezuela, the Russians are probably relatively limited in what they can do,\" Dr Withington added. \"That doesn't stop them at least trying to give some sort of material support.\" In that case, the Americans are likely not taking any chances, he said. Russian cargo plane stops in Venezuela According to FlightRadar data, an Ilyushin Il-76TD cargo plane landed in the Venezuelan capital, Caracas, on October 29. It was operated by Aviacon Zitotrans, a Russian airline sanctioned by the US Treasury in 2023, which said it has \"handled cargo shipments for sanctioned Russian Federation defence entities\". Meanwhile, Russian MP Alexei Zhuravlyov said the US \"may be in for some surprises\" as he hinted at a possible weapons transfer to Venezuela in comments published by a Russian news site over the weekend. \"I see no obstacles to supplying a friendly country with new developments such as the Oreshnik or, let's say, the well-proven Kalibr missiles,\" Mr Zhuravlyov told Gazeta.Ru.  Trump says Maduro's days are numbered Venezuela's President Nicolas Maduro has accused President Trump of seeking regime change and of \"fabricating a new eternal war\" against his country, and he appealed to the American people for peace. President Trump has justified the strikes by saying the US is in \"armed conflict\" with drug cartels, and claiming the boats are operated by foreign terror organisations. He has not provided evidence. During an interview aired on CBS's 60 Minutes show on Sunday, the US leader was asked if America was going to war with Venezuela. He replied: \"I doubt it. I don't think so. But they've been treating us very badly, not only on drugs.\" Asked if President Maduro's days were numbered, he said: \"I would say yeah. I think so, yeah.\""
    },
    {
        "title": "Japan sends in troops to help tackle deadly bear attacks",
        "description": "Japan has deployed troops to tackle a surge in bear attacks, which have killed a record number of people since April.",
        "url": "https://news.sky.com/story/japan-sends-in-troops-to-help-tackle-deadly-bear-attacks-13464251",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-brown-bear-japan-sunagawa_7072615.jpg?20251105120007",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-05 09:44:00",
        "Headline": "Authorities in Akita prefecture say bear sightings have jumped sixfold this year, prompting local officials to call in help from Japan's Self Defence Force.",
        "Content": "Japan has deployed troops to tackle a surge in bear attacks, which have killed a record number of people since April. Most of those deaths have been in the mountainous Akita and neighbouring Iwate prefectures in the north of the country. Soldiers have begun an operation in the town of Kazuno, where residents have been told to avoid thick forests that surround it and stay home after dark. People have even been carrying bells to deter bears that might forage near their homes for food. There have been more than 100 bear attacks with a record 12 people killed across Japan in the year since April, according to the environment ministry. The troops will help transport, set and inspect the box traps, with food inside, used to capture the bears, but they are culled by trained hunters with weapons more suited to that purpose. \"The townspeople feel the danger every day,\" Kazuno Mayor Shinji Sasamoto said after meeting around 15 soldiers equipped with body armour. \n                  The 40 million Americans without food because of the government shutdown\n                 \n                  Man admits murdering Japan's former prime minister Shinzo Abe\n                 \n                  From Iron Maiden to the Iron Lady: Japan's first female prime minister\n                 \"It has affected how people live their lives, forcing them to stop going out or cancel events,\" Mr Sasamoto said. Customers attacked in supermarket Bears have attacked customers inside a supermarket, targeted a tourist waiting at a bus stop near a UNESCO World Heritage site, and mutilated a worker at a hot spring resort in recent weeks. Some schools have had to temporarily shut after bears were spotted wandering in and around their grounds. Bear attacks often peak in October and November, as the animals forage intensively before winter hibernation. Over 8,000 bear sightings Authorities in Akita say bear sightings have jumped this year to more than 8,000, six times higher than normal, prompting the prefecture's governor to request help from Japan's Self Defence Force. Read more from Sky News:Images show destruction from typhoonZohran Mamdani: From rapper to mayorWatch: Cargo plane erupts into fireball After Kazuno, the soldiers will head for the cities of Odate and Kitaakita under an agreement due to last until the end of the month. Rising bear numbers, climate change-driven shifts in natural food sources and depopulation of rural areas are increasingly bringing people into contact with bears in Japan. Japanese black bears, common across most of the country, can weigh up to 130kg. Brown bears on its northern island of Hokkaido can weigh as much as 400kg."
    },
    {
        "title": "Malaysian rapper detained in murder investigation of Taiwanese influencer",
        "description": "Malaysian rapper and filmmaker Namewee has been detained in connection with the murder of a Taiwanese social media influencer.",
        "url": "https://news.sky.com/story/malaysian-rapper-detained-in-murder-investigation-of-taiwanese-influencer-13464267",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-wee-meng-chee-rapper_7072553.jpg?20251105093616",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-05 11:06:00",
        "Headline": "Namewee denies any wrongdoing and vows to help police investigating the death of Iris Hsieh, who was found in a hotel bathtub in Kuala Lumpur last month.",
        "Content": "Malaysian rapper and filmmaker Namewee has been detained in connection with the murder of a Taiwanese social media influencer. Namewee, whose real name is Wee Meng Chee, surrendered to police on Wednesday and will be placed under remand for six days, his lawyer Joshua Tay said. Nurse turned model Iris Hsieh, who had more than half a million followers on Instagram and also operated an OnlyFans account, was found dead in a hotel bathtub in Kuala Lumpur on 22 October. According to local media reports, police said Wee was the last person seen with her before her death. The 31-year-old, whose real name was Hsieh Yu-hsin, was known as Nurse Goddess by her fans. Police said she arrived in Malaysia on 20 October for a four-day trip. Officers are waiting for the full post-mortem and toxicology reports before releasing the official cause of her death, local media reported. Namewee was briefly detained at the time and separately charged for drug possession and use - allegations he denied. He said he was deeply saddened by Hsieh's death and denied any wrongdoing. In an Instagram post after surrendering to police, the 42-year-old vowed to co-operate with the investigation. Read more from Sky News:'Trump's worst nightmare' wins New York electionUS plane crash leaves at least seven dead Controversial artist Namewee is known for his satirical lyrics and videos on topics including politics, race and religion. In 2016, he was arrested over his music video Oh My God following complaints it was disrespectful to Islam. He released a track with Australian singer Kimberley Chen in 2021 that poked fun at Chinese nationalists and touched on sensitive topics, such as Taiwan's sovereignty. The pair were banned from entering China and the song was removed from all Chinese platforms."
    },
    {
        "title": "From New York to Iran: How are young people upsetting the establishment?",
        "description": "<a href=' https://podfollow.com/the-world-with-richard-and-yalda'>👉Listen to The World With Richard Engel And Yalda Hakim on your podcast app👈</a>  ",
        "url": "https://news.sky.com/story/from-new-york-to-iran-how-are-young-people-upsetting-the-establishment-13464459",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-yalda-world-podcast_6914107.png?20250512132334",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-05 16:35:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to The World With Richard Engel And Yalda Hakim on your podcast app👈  What does Zohran Mamdani's win in the New York mayoral race mean for America? Will the Democrats embrace him? What will Donald Trump do? The youngest person in 100 years has just been elected the city's mayor and Yalda and Dominic Waghorn - stepping in this week for Richard - assess what's happened. While young people voted overwhelmingly for Mamdani, young people in Iran's capital Tehran defied authorities and came out singing and dancing in the streets. But what does this tell us about the current status of the regime? Dom has been to Iran recently and tells Yalda what he thinks. Dom also brings an update on Sudan where horrifying images are emerging. He has spoken to the Sudanese ambassador to the UK who says a genocide is unfolding and the world must wake up. You can also watch the podcast on our YouTube channel here. Do you have a question for Richard and Yalda? Write to them at theworld@sky.uk"
    },
    {
        "title": "Helen Garner's 'unsparing' diary collection becomes first to win prestigious Baillie Gifford non-fiction prize",
        "description": "A writer, whose \"candid\" and \"unsparing\" diaries have become the first to ever win the prestigious Baillie Gifford Prize for Non-Fiction. has told Sky News she is \"delighted\" to see the literary format recognised rather than dismissed.",
        "url": "https://news.sky.com/story/helen-garners-unsparing-diary-collection-becomes-first-to-win-prestigious-baillie-gifford-non-fiction-prize-13464269",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-helen-garner-baillie-gifford-prize_7072604.jpg?20251105103303",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-05 10:33:00",
        "Headline": "How To End A Story charts 20 years of Australian writer Helen Garner's life, from publishing her debut novel in the 1970s to the collapse of her marriage in the 1990s.",
        "Content": "A writer, whose \"candid\" and \"unsparing\" diaries have become the first to ever win the prestigious Baillie Gifford Prize for Non-Fiction. has told Sky News she is \"delighted\" to see the literary format recognised rather than dismissed. Helen Garner, an acclaimed Australian author and diarist whose celebrity fans include singer Dua Lipa and fellow writer David Nicholls, said that diaries, often written by women, tended to be given \"short shrift\" in the literary industry. She has now won the Baillie Gifford award for How To End A Story, a collection which charts 20 years of her life, from publishing her debut novel while raising a young daughter in the 1970s to the disintegration of her marriage in the 1990s. Judges hailed her as a \"brilliant observer and listener\" and described the diaries as a \"recklessly candid, unsparing, occasionally eye-popping account of the implosion of a marriage\". Speaking to Sky News' Sophy Ridge and Wilfred Frost on the new Mornings with Ridge and Frost programme, Garner, 82, said: \"My main reason to be delighted is that I think diaries have been given short shrift in literature. I think they are literature. \"Because they were often written by women, they used to be dismissed as just sort of verbal sludge that people... sort of lazily wrote down, but in actual fact to keep a decent diary involves as much hard work as writing a full-on book - in my experience, anyway. So I'm really glad that it's been recognised.\" Garner was named winner of the £50,000 prize at a ceremony in London on Tuesday, and accepted her award via video link from Melbourne, Australia. Journalist Robbie Millen, who chaired the prize jury, said her \"addictive\" book was the unanimous choice of the six judges. \"Garner takes the diary form, mixing the intimate, the intellectual, and the everyday, to new heights,\" he said, comparing her to Virginia Woolf in the canon of great literary diarists. \"There are places it's toe-curlingly embarrassing. She puts it all out there.\" 'The mess my life became is not unique' Garner, who has published novels, short stories, screenplays and true crime books, told Sky News she has been surprised to hear from so many readers who have related to her words and most intimate thoughts. \"People have said to me, 'this could be my marriage',\" she said. \"I found that rather shocking because it's quite a painful story of a marriage collapsing, starting off with love, but then developing over the years into something painful and destructive. \"I've been glad to find that I'm not unique in that way, that the mess that I made in my life, the mess that my life became, it's not unique. In fact, it's archetypal. It's something that's happened to gazillions of people in the history of the world.\" Asked by Ridge if the book would have been a \"difficult read\" for her ex-husband, Garner replied: \"I don't know, I haven't spoken to him for approximately 25 years. We won't be speaking to each other again, I imagine. And if you've read the diary, you'll see why.\" Jason Burke's The Revolutionists: The Story Of The Extremists Who Hijacked The 1970s Richard Holmes's The Boundless Deep: Young Tennyson, Science And The Crisis Of Belief Justin Marozzi's Captives And Companions: A History Of Slavery And The Slave Trade In The Islamic World Adam Weymouth's Lone Wolf: Walking The Faultlines Of Europe Frances Wilson's Electric Spark: The Enigma Of Muriel Spark How To End A Story is the first set of diaries to win the Baillie Gifford Prize, which was founded in 1999 and recognises English-language books in current affairs, history, politics, science, sport, travel, biography, autobiography and the arts. It was selected from more than 350 books published between 1 November 2024 and 31 October 2025."
    },
    {
        "title": "Zohran Mamdani's win in New York suggests he hit on a formula that worked for Trump",
        "description": "It was not the show Donald Trump wanted to see.",
        "url": "https://news.sky.com/story/zohran-mamdanis-win-in-new-york-suggests-he-hit-on-a-formula-that-worked-for-trump-13464187",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-zohran-mamdani-new-york-city_7072471.jpg?20251105080056",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-11-05 07:21:00",
        "Headline": "Mamdani's victory feels big - for him and his political movement. His left-wing politics and promises on affordability chimed with a body of people who feel disenfranchised from politics, whatever the party.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  It was not the show Donald Trump wanted to see. America's off-season \"election special\" starred Zohran Mamdani, and the supporting cast counted Democrats who won electoral contests across the country. It was a \"blue wave\" of sorts - small but potentially significant. New York mayor latest: US president reacts to Mamdani win Mamdani's victory places him as the first Muslim to hold the office of New York mayor. He's the history boy who would style himself as the future of the Democratic Party. His victory feels big - for him and his political movement. His left-wing politics and promises on affordability chimed with a body of people who feel disenfranchised from politics, whatever the party.  Mamdani hit on the formula that worked for Trump, albeit at the other end of the political spectrum. \n                  Arsenal fan Mamdani can't expect any easy wins - even the home games\n                 \n                  Trump and US elections latest: Mamdani says victory is lesson for Trump - after president's shutdown warning\n                 \n                  Trump threatens to move World Cup games from 'unsafe' host cities\n                 He focused, relentlessly, on the cost of living, affordability in unaffordable New York, and it delivered populist appeal. He's a big beast in the party now - too big for the old guard to ignore, as much as they might like. Moderate Democrats see difficulties in selling his politics to middle America, where the 2028 election will be won and lost, believing his Democratic socialism does not bite so hard beyond the 'Big Apple'. 👉Listen to Cheat Sheet on your podcast app👈   The party has to somehow accommodate and exploit his support and success, however. Mamdani is not alone on the progressive wing of the Democratic movement, and he nudged its centre of gravity to the left. Mamdani is 'stick' to beat Democrats with \"AND SO IT BEGINS!\" wrote Donald Trump on Truth Social. What begins, in earnest, is a Trump effort to use Mamdani as a stick to beat the Democrats with. The news has attracted controversy over time, in calling for the defunding of the police, decriminalisation of prostitution and staunch criticism of Israel. Mamdani pointedly stated in his victory speech that his City Hall \"does not waver in the fight against the scourge of antisemitism\" - he knows where the attack lines are because he's heard them before - \"communist\", \"extremist\", \"insurgent\". Read more from Sky News:Mamdani: 'Trump's worst nightmare'Who is Zohran Mamdani? He has long been seen as the mayor that Trump wanted - for the same reason that the Democratic establishment was not keen - there are key parts of America where his politics, and/or his Islamic faith, will not land like they do in New York. Mamdani is the prime product in liberal New York who could be a hard sell further west. Aside from the New York result, there were notable wins for Democrats in Virginia and New Jersey, where their candidates won the races for governor. Californians backed a move to redraw district boundaries, increasing Democrat chances of winning more seats in the House of Representatives. They are results that point towards mid-term elections next year and the presidential poll in 2028. Donald Trump will not have missed the headline stories of the night, nor the details. It included the disappearance of much of the Hispanic vote in Virginia, which helped get him back into the White House. Nine months into a presidency that's deployed a hardened immigration policy and ICE raids on American streets, there's evidence that Hispanic voters who got him over the line have deserted him."
    },
    {
        "title": "Elon Musk: Why some are starting to question if the world's richest man is still value for money",
        "description": "Elon Musk is already the world's richest man, but today he could take a giant step towards becoming the world's first trillionaire.",
        "url": "https://news.sky.com/story/elon-musk-why-some-are-starting-to-question-if-the-worlds-richest-man-is-still-value-for-money-13464620",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-elon-musk-air-force-one_7073336.jpg?20251106013545",
        "type": "US",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-11-05 21:31:00",
        "Headline": "As Tesla shareholders vote on a deal that would help hand Elon Musk unprecedented wealth for corporate America, some are questioning whether the controversial tech tycoon represents a smart investment.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Elon Musk is already the world's richest man, but today he could take a giant step towards becoming the world's first trillionaire. Shareholders at Tesla are voting on a pay deal for their chief executive that is unlike anything corporate America has ever seen. The package would grant Musk, who already has a net worth of more than $400bn, around 425 million shares in the company. That would net him about $1trn (£760bn) and, perhaps more importantly to Musk, it would tighten his grip on the company by raising his stake from 15% to almost 30%. The board, which has been making its case to retail investors with a series of videos and digital ads, has a simple message: Tesla is at a turning point. Yes, it wants to sell millions of cars, but it also wants to be a pioneer in robotaxis, AI-driven humanoid robots, and autonomous driving software. At this moment, it needs its visionary leader motivated and fully on board. Musk has served his warning shot. Late last month, he wrote on X: \"Tesla is worth more than all other automotive companies combined. Which of those CEOs would you like to run Tesla? It won't be me.\" Not everyone is buying it, however. With so much of his personal wealth tied up in Tesla, would Musk really walk away? Bad for the brand? Others see his continued presence and rising influence as a risk. Norway's sovereign wealth fund, the world's largest, which owns 1.1% of the company (making it a top 10 shareholder), has already declared it will vote against the deal. It cited concerns about \"the award's size, dilution, and lack of mitigation of key person risk\". Several major US pension funds have followed suit. In an open letter published last month, they warned: \"The board's relentless pursuit of keeping its chief executive has damaged Tesla's reputation.\" They also criticised the board for allowing Musk to pursue other ventures. They said he was overcommitted and distracted as a result. Signatories of that letter included the state treasurers of Nevada, New Mexico, Connecticut, Massachusetts, Colorado, and the comptrollers of Maryland and New York City. All of them Democrats. Republicans have been more favourable. There is a political slant to this. The signatories' concerns with his \"other ventures\" no doubt include the time Musk spent dabbling in right-wing politics with the Republican inner circle. That made him a polarising figure and, to an extent, Tesla too. Pay packet dwarfs rivals Combine this with a mixed sales performance and a volatile share price, and some are wondering whether the carmaker has lost its way under his leadership. Irrespective of performance, for some, the existence of billionaires - let alone trillionaires - can never be justified. Some may also ask why Musk is worth so much more than the leaders of Apple, Facebook, and Microsoft, or Nvidia, the world's most valuable company by market capitalisation. Nvidia's chief executive, Jensen Huang, received $49.9m (£37.9m) this fiscal year. So, how has Tesla come up with these numbers? Why is Musk's pay so out of kilter with the benchmark? Does the company have a corporate governance problem? The courts have suggested it might. Last year, a Delaware court took the view that Tesla's board members, which include Musk's brother Kimbal, were not fully independent when agreeing to a $56bn (£42.6bn) pay packet back in 2017. Read more from Sky News:Badenoch calls for government to 'get Britain drilling again'Sickness bill costs £85bn a year, says new report The Delaware Supreme Court is now reviewing the case. It is a reminder that even if Musk meets his targets, a similar fate could befall the current package. The Tesla board is holding firm, however. Robyn Denholm, the company's chair, told The New York Times: \"He doesn't get any compensation if he doesn't deliver,\" adding that Musk \"does things that further humankind\". Tesla's valuation is tied up in its promise to deliver revolutionary AI and robotics products that will change the world. Those ambitions, which include robots that can look after children, are lofty. Some would call them unrealistic, but the board is adamant that if they are to become a reality, only Musk can make it happen. Under the deal, Musk would receive no salary or cash bonus. Instead, he would collect shares as Tesla's value grows. To unlock the full package, he would have to increase the current market valuation six times to $8.5trn (£6.47trn). For context, that's almost twice that of Nvidia. There are other hurdles. The company would have to sell 20 million additional electric vehicles, achieve 10 million subscriptions to its self-driving software on average over three months, deploy one million robotaxis on average over the same period, sell one million AI-powered robots, and boost adjusted earnings 24-fold to $400bn (£304bn). They are ambitious targets, but Musk has defied the sceptics before."
    },
    {
        "title": "'Hope won': London mayor Sadiq Khan compares newly-elected New York mayor to his leadership",
        "description": "New York has followed London by choosing hope over fear in electing Democrat Zohran Mamdani as its new mayor, Sir Sadiq Khan said.",
        "url": "https://news.sky.com/story/hope-won-london-mayor-sadiq-khan-compares-newly-elected-new-york-mayor-to-his-leadership-13464376",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rama-duwaji-zohran-mamdani_7072586.jpg?20251105101332",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-05 13:43:00",
        "Headline": "Democrat Zohran Mamdani defeated Trump-backed former New York governor Andrew Cuomo to become mayor.",
        "Content": " New York has followed London by choosing hope over fear in electing Democrat Zohran Mamdani as its new mayor, Sir Sadiq Khan said. Mr Mamdani, 34, defeated former New York governor Andrew Cuomo and Republican Curtis Sliwa to become the city's first Muslim mayor and the first of South Asian heritage. London mayor Sir Sadiq drew comparisons to his own 2016 victory as he congratulated Mr Mamdani, who will become New York's youngest mayor in more than a century when he takes office on 1 January. US latest: Trump downplays Democrats' wins Sir Sadiq called it a \"historic campaign\", adding on X: \"New Yorkers faced a clear choice - between hope and fear - and just like we've seen in London - hope won.\" Education Secretary Bridget Phillipson also congratulated Mr Mamdani, telling Sky News: \"I wish him well. \"It's a wonderful job to have secured.\" \n                  The night Democrats fought back against Trump\n                 \n                  Trump renominates billionaire Musk ally Jared Isaacman to lead NASA\n                 \n                  Zohran Mamdani's win in New York suggests he hit on a formula that worked for Trump\n                 Green Party leader Zack Polanski said Mr Mamdani's success \"will resonate throughout the world\" as he called it a \"story where no one is left behind\". \"It's time to write that story across England and Wales too,\" he added. Mr Mamdani's victory was a setback for Donald Trump, who had thrown his weight behind Andrew Cuomo, a former Democrat running as an independent. The mayor-elect described himself as \"Trump's worst nightmare\" and said New York had shown \"a nation betrayed by Donald Trump how to defeat him\". Read more:From rapper to New York mayor - Who is Zohran Mamdani? The US president had threatened to cut federal funding to New York if Mr Mamdani won. In his victory speech, Mr Mamdani said: \"New York will remain a city of immigrants, a city built by immigrants, powered by immigrants and as of tonight, led by an immigrant. \"If anyone can show a nation betrayed by Donald Trump how to defeat him, it is the city that gave rise to him.\""
    },
    {
        "title": "US likely jammed GPS signals off Venezuela coast, expert tells Sky News",
        "description": "High levels of GPS jamming detected off the coast of Venezuela were likely being carried out by the US, an expert has told Sky News.",
        "url": "https://news.sky.com/story/us-likely-jammed-gps-signals-off-venezuela-coast-expert-tells-sky-news-13464222",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-usa-venezuela_7072647.jpg?20251105110934",
        "type": "US",
        "Author": "Michael Drummond",
        "Date Published": "2025-11-05 08:45:00",
        "Headline": "Disruption to navigation signals has been picked up around Trinidad and Tobago, where a US warship had been stationed amid escalating tensions in the region.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n High levels of GPS jamming detected off the coast of Venezuela were likely being carried out by the US, an expert has told Sky News. Disruption to navigation signals has been picked up around Trinidad and Tobago, where a US warship had been stationed amid escalating tensions in the region. \"Looking at the map it's hard to say who else it could be,\" electronic warfare expert Dr Thomas Withington told Sky News. Sky News has contacted the US Department of Defence for comment but has not received a response. It comes as the USS Gerald R Ford aircraft carrier - the largest warship in the world - moves closer to Venezuela after being ordered to deploy to the Caribbean. Meanwhile, US secretary of war (the department formerly known as defence) Pete Hegseth announced another lethal strike on what the Trump administration claims are drug trafficking boats. News has also emerged that a Russian cargo plane operated by a sanctioned airline touched down in the Venezuelan capital, Caracas, late last month. \n                  'We will treat them EXACTLY how we treated al Qaeda' - US carries out another lethal strike in Caribbean\n                 \n                  More than a dozen killed as US attacks alleged drug boats in Pacific 'on Donald Trump's orders'\n                 \n                  Is Trump getting ready to run for a third term?\n                 GPS jamming detected  Heavy signals disruption has been detected not far off the coast of Venezuela, according to the open-source website GPSJam, which tracks instances of GPS interference around the world. It appears to be centred around Trinidad and Tobago and emerged around the time the USS Gravely guided missile destroyer arrived there in late October. It is not usual for disruption to be seen in that part of the world. Use the slider below to see the emergence of disruption between October 26 and November 3. Jamming can overwhelm an aircraft's GPS navigation systems, preventing them from working properly, leaving pilots to rely on other ways of finding out where they are. Western leaders blame Russia for its widespread use in eastern Europe, with the EU accusing Moscow of jamming the plane of its chief Ursula von der Leyen.  Read more:Who is messing with GPS signals in Europe?Questions raised by alleged GPS jamming of EU chief's flight Disruption off Venezuela's coast was minor at first but levels increased over the following days, showing up in red on the map, indicating higher amounts. Jamming was detected up until and including November 3, but the latest data for Tuesday, November 4, appears to show that the jamming stopped. \"Looking at the map it's hard to say who else it could be,\" says Dr Withington, an expert on electronic warfare at the RUSI thinktank. He argues that there aren't many militaries in that part of the world who would have the capability to disrupt GPS signals in such a widespread way. \"In absence of certainty, it would seem the evidence is suggesting it's the US military interests in the region,\" he said.  Why might the US be carrying out GPS jamming? Dr Withington says it seems like the GPS disruption there is \"defensive\", with the US possibly concerned about the use of drones. \"I wouldn't be surprised if it's counter-drone systems that are in their ships,\" he added. He says the US may be worried about the risk of Venezuelan drones being used to gather intelligence or the potential for kamikaze attacks on US warships. \"I can't say for certain... but if you think about what the Russians have been using, if you think about what the Iranians have - the stuff is out there and it is available from Venezuela's allies.\" Both Russia and Iran have increasingly used drones to harass or attack their enemies in recent years, with explosive Shaheds proving a deadly problem in Ukraine. \"If there's any military action involving the US and Venezuela, the Russians are probably relatively limited in what they can do,\" Dr Withington added. \"That doesn't stop them at least trying to give some sort of material support.\" In that case, the Americans are likely not taking any chances, he said. Russian cargo plane stops in Venezuela According to FlightRadar data, an Ilyushin Il-76TD cargo plane landed in the Venezuelan capital, Caracas, on October 29. It was operated by Aviacon Zitotrans, a Russian airline sanctioned by the US Treasury in 2023, which said it has \"handled cargo shipments for sanctioned Russian Federation defence entities\". Meanwhile, Russian MP Alexei Zhuravlyov said the US \"may be in for some surprises\" as he hinted at a possible weapons transfer to Venezuela in comments published by a Russian news site over the weekend. \"I see no obstacles to supplying a friendly country with new developments such as the Oreshnik or, let's say, the well-proven Kalibr missiles,\" Mr Zhuravlyov told Gazeta.Ru.  Trump says Maduro's days are numbered Venezuela's President Nicolas Maduro has accused President Trump of seeking regime change and of \"fabricating a new eternal war\" against his country, and he appealed to the American people for peace. President Trump has justified the strikes by saying the US is in \"armed conflict\" with drug cartels, and claiming the boats are operated by foreign terror organisations. He has not provided evidence. During an interview aired on CBS's 60 Minutes show on Sunday, the US leader was asked if America was going to war with Venezuela. He replied: \"I doubt it. I don't think so. But they've been treating us very badly, not only on drugs.\" Asked if President Maduro's days were numbered, he said: \"I would say yeah. I think so, yeah.\""
    },
    {
        "title": "Trump renominates billionaire Musk ally Jared Isaacman to lead NASA",
        "description": "Donald Trump has relaunched his nomination of a billionaire private astronaut to be the new NASA chief and lead the space agency \"into a bold new era\".",
        "url": "https://news.sky.com/story/trump-renominates-billionaire-musk-ally-jared-isaacman-to-lead-nasa-13464219",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-jared-isaacman-florida_7072498.jpg?20251105083309",
        "type": "US",
        "Author": "Thomas Moore",
        "Date Published": "2025-11-05 08:29:00",
        "Headline": "The private astronaut, who has twice been to space in commercially funded missions with SpaceX, was nominated by the US president in the spring, but the rug was pulled at the last minute over his previous donations to Democrats. ",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n Donald Trump has relaunched his nomination of a billionaire private astronaut to be the new NASA chief and lead the space agency \"into a bold new era\". Jared Isaacman, an ally of SpaceX boss Elon Musk, was originally nominated by the US president in the spring, but the rug was pulled at the last minute over his previous donations to Democrats. Now, in a sudden reversal, Mr Trump has decided Isaacman is, after all, the best person for the job. \"Jared's passion for Space, astronaut experience, and dedication to pushing the boundaries of exploration, unlocking the mysteries of the universe, and unlocking the new space economy, make him ideally suited to lead NASA into a bold new era,\" he wrote in a post on his social media platform Truth Social. Isaacman, the former chief executive of the payment processing company Shift4, has twice been to space in commercially funded missions with SpaceX. Last year he became the first private citizen to perform a spacewalk.  Although he has wide support within the US space industry, he remains a controversial figure in Republican circles, and still needs to be approved in a Senate hearing. Isaacman doesn't appear to hold a grudge over his job offer being cancelled last time round. He said on X: \"Thank you, Mr President @POTUS, for this opportunity. It will be an honor to serve my country under your leadership. \"The support from the space-loving community has been overwhelming. \"I am not sure how I earned the trust of so many, but I will do everything I can to live up to those expectations.\" If Isaacman is cleared to take up the job, he faces the daunting task of putting the US space programme back on track and beating China in a new space race to land astronauts on the moon. Read more from Sky News:'Trump's worst nightmare' wins New York electionUS plane crash leaves at least seven deadFormer US vice president Dick Cheney dies The Artemis programme has been seriously delayed. That's partly because of problems with the Orion capsule that will take astronauts to and from lunar orbit, but largely because the SpaceX Starship mega-rocket that is supposed to then shuttle the crew down to the surface has struggled to even orbit Earth. Sean Duffy, the temporary NASA chief and former reality TV star, recently criticised the tardy development of Starship and said he would reopen the contract for the lunar landing to SpaceX competitors. Musk responded on X: \"The person responsible for America's space program can't have a 2 digit IQ.\" Isaacman supports the Artemis mission, although his commitment is unclear to the NASA-developed SLS rocket that is due to launch on its first crewed test flight around the moon next year. He said he wants \"more astronauts in space with greater frequency\" and signalled that commercial companies could increasingly take over some NASA activities while it refocused funding on \"the near-impossible that no one else will work on like nuclear electric propulsion\"."
    },
    {
        "title": "Elon Musk: Why some are starting to question if the world's richest man is still value for money",
        "description": "Elon Musk is already the world's richest man, but today he could take a giant step towards becoming the world's first trillionaire.",
        "url": "https://news.sky.com/story/elon-musk-why-some-are-starting-to-question-if-the-worlds-richest-man-is-still-value-for-money-13464620",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-elon-musk-air-force-one_7073336.jpg?20251106013545",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-11-05 21:31:00",
        "Headline": "As Tesla shareholders vote on a deal that would help hand Elon Musk unprecedented wealth for corporate America, some are questioning whether the controversial tech tycoon represents a smart investment.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Elon Musk is already the world's richest man, but today he could take a giant step towards becoming the world's first trillionaire. Shareholders at Tesla are voting on a pay deal for their chief executive that is unlike anything corporate America has ever seen. The package would grant Musk, who already has a net worth of more than $400bn, around 425 million shares in the company. That would net him about $1trn (£760bn) and, perhaps more importantly to Musk, it would tighten his grip on the company by raising his stake from 15% to almost 30%. The board, which has been making its case to retail investors with a series of videos and digital ads, has a simple message: Tesla is at a turning point. Yes, it wants to sell millions of cars, but it also wants to be a pioneer in robotaxis, AI-driven humanoid robots, and autonomous driving software. At this moment, it needs its visionary leader motivated and fully on board. Musk has served his warning shot. Late last month, he wrote on X: \"Tesla is worth more than all other automotive companies combined. Which of those CEOs would you like to run Tesla? It won't be me.\" Not everyone is buying it, however. With so much of his personal wealth tied up in Tesla, would Musk really walk away? Bad for the brand? Others see his continued presence and rising influence as a risk. Norway's sovereign wealth fund, the world's largest, which owns 1.1% of the company (making it a top 10 shareholder), has already declared it will vote against the deal. It cited concerns about \"the award's size, dilution, and lack of mitigation of key person risk\". Several major US pension funds have followed suit. In an open letter published last month, they warned: \"The board's relentless pursuit of keeping its chief executive has damaged Tesla's reputation.\" They also criticised the board for allowing Musk to pursue other ventures. They said he was overcommitted and distracted as a result. Signatories of that letter included the state treasurers of Nevada, New Mexico, Connecticut, Massachusetts, Colorado, and the comptrollers of Maryland and New York City. All of them Democrats. Republicans have been more favourable. There is a political slant to this. The signatories' concerns with his \"other ventures\" no doubt include the time Musk spent dabbling in right-wing politics with the Republican inner circle. That made him a polarising figure and, to an extent, Tesla too. Pay packet dwarfs rivals Combine this with a mixed sales performance and a volatile share price, and some are wondering whether the carmaker has lost its way under his leadership. Irrespective of performance, for some, the existence of billionaires - let alone trillionaires - can never be justified. Some may also ask why Musk is worth so much more than the leaders of Apple, Facebook, and Microsoft, or Nvidia, the world's most valuable company by market capitalisation. Nvidia's chief executive, Jensen Huang, received $49.9m (£37.9m) this fiscal year. So, how has Tesla come up with these numbers? Why is Musk's pay so out of kilter with the benchmark? Does the company have a corporate governance problem? The courts have suggested it might. Last year, a Delaware court took the view that Tesla's board members, which include Musk's brother Kimbal, were not fully independent when agreeing to a $56bn (£42.6bn) pay packet back in 2017. Read more from Sky News:Badenoch calls for government to 'get Britain drilling again'Sickness bill costs £85bn a year, says new report The Delaware Supreme Court is now reviewing the case. It is a reminder that even if Musk meets his targets, a similar fate could befall the current package. The Tesla board is holding firm, however. Robyn Denholm, the company's chair, told The New York Times: \"He doesn't get any compensation if he doesn't deliver,\" adding that Musk \"does things that further humankind\". Tesla's valuation is tied up in its promise to deliver revolutionary AI and robotics products that will change the world. Those ambitions, which include robots that can look after children, are lofty. Some would call them unrealistic, but the board is adamant that if they are to become a reality, only Musk can make it happen. Under the deal, Musk would receive no salary or cash bonus. Instead, he would collect shares as Tesla's value grows. To unlock the full package, he would have to increase the current market valuation six times to $8.5trn (£6.47trn). For context, that's almost twice that of Nvidia. There are other hurdles. The company would have to sell 20 million additional electric vehicles, achieve 10 million subscriptions to its self-driving software on average over three months, deploy one million robotaxis on average over the same period, sell one million AI-powered robots, and boost adjusted earnings 24-fold to $400bn (£304bn). They are ambitious targets, but Musk has defied the sceptics before."
    },
    {
        "title": "Nvidia boss defends AI against claims of bubble by 'Big Short' investor",
        "description": "Nvidia boss Jensen Huang has told Sky News the AI sector is a \"long, long way\" from a Big Short-style collapse.\n",
        "url": "https://news.sky.com/story/nvidia-boss-defends-ai-against-claims-of-bubble-by-big-short-investor-13464295",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-huang-kendall_7072666.png?20251105113738",
        "type": "Business",
        "Author": "Tim Baker",
        "Date Published": "2025-11-05 11:56:00",
        "Headline": "Michael Burry, who was played by Christian Bale in the 2015 film The Big Short, has bet against Nvidia and other technology stocks, causing market plunges worth hundreds of billions of dollars.",
        "Content": "\n          Political reporter\n              @TimJ_B\n  Nvidia boss Jensen Huang has told Sky News the AI sector is a \"long, long way\" from a Big Short-style collapse.\n Speaking outside Downing Street following a roundtable with government and other industry figures, the head of the world's first $5tn company defended his sector from criticism by investor Michael Burry. Mr Burry and his firm, Scion Capital, gained notoriety for \"shorting\" - betting against - the US housing market ahead of the 2008 financial crash. Politics latest: Lammy to take deputy PMQs He was portrayed by Christian Bale in the 2015 film The Big Short, which also starred Steve Carell, Brad Pitt and Ryan Gosling. Earlier this week, filings revealed Mr Burry has now bet against Nvidia and on social media, he has suggested there is a bubble in the sector. Some $500bn was wiped off technology stocks overnight Tuesday into Wednesday, Bloomberg reported. \n                  Ex-Starmer adviser's start-ups backer nears £1bn valuation\n                 \n                  Revealed: How much the government's spending on AI\n                 \n                  Microsoft, Alphabet and Meta results overshadowed by growing fears of AI bubble\n                 Speaking to Sky News, Mr Huang said: \"I would say that we're in the beginning of a very long build out of artificial intelligence.\" Defending his company and investment, Mr Huang said AI is the first technology that requires \"infrastructure to be built\" and that Nvidia has seen \"great returns\" from AI, and that is why it is expanding. Mr Huang said better training of AI has led to much \"better\" and \"useful\" answers, and that means \"the AIs have become profitable\". \"When something is profitable, the suppliers want to make more of it, and that's the reason the infrastructure build out is accelerating,\" he added. Pushed on whether he was worried about a situation like the Big Short, Mr Huang said: \"We are long, long away from that.\" The UK government is betting big on AI in the hopes that it can save money by using it and generate growth by building the infrastructure to back it up. Asked if she was worried about the market, Technology Secretary Liz Kendall told Sky News: \"I have no doubts that AI is going to transfer all parts of our economy and our public services.\" Mr Burry and his firm, Scion Capital's bets against Nvidia and other companies were revealed by regulatory filings earlier this week. The investor also posted on social media for the first time in more than two years, warning of a bubble. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Concerns have been raised about the market surrounding AI, and the growth many companies are experiencing. Nvidia is the largest producer of the specialist computer chips that are used to train and use AI models."
    },
    {
        "title": "M&S reveals cost of cyber attack as profit almost wiped out",
        "description": "The cyber attack on high street department store Marks and Spencer is expected to directly cost roughly &#163;136m.",
        "url": "https://news.sky.com/story/ms-reveals-cost-of-cyber-attack-as-profit-almost-wiped-out-13464171",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-marks-and-spencer-m-and-s_6915979.jpg?20250514112929",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-11-05 07:44:00",
        "Headline": "Despite the hit to profits in the first half of the year, M&S said the second half-year profit will be \"at least\" in line with the same period 12 months earlier. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The cyber attack on high street department store Marks and Spencer is expected to directly cost roughly £136m. The figure is only the cost of immediate incident systems response and recovery, as well as specialist legal and professional services support. Money blog: Treasury thinks 'working people' earn less than £45,000 - readers think differently Combined with a loss in sales, as the retailer's online systems were out of action from Easter into the summer, statutory profit before tax at the business has been nearly wiped out for the first half of the year. This profit measure dropped from £391.9m last year to £3.4m this year. Statutory profit before tax is the official profit figure reported in a company's financial statements before it paid tax, used for tax and legal purposes. That's expected to increase to \"at least in line with last year\" for the second half of the department store's financial year. About £100m is being claimed back in insurance for the cyber attack, M&S said in its market update. \n                   Jaguar Land Rover cyber attack pushes overall UK car production down more than a quarter\n                 \n                  Government contractor Capita fined £14m after more than six million people had data stolen in cyber attack\n                 \n                  China poses 'highly sophisticated' cyber threat to UK, NCSC warns\n                 Using a different profit measure - the M&S group's adjusted profit before tax - the figure is more than half that of a year earlier, down from £413m to £184m. The impact of a cyber attack Sales were hit as online shopping was unavailable from the April attack date until June. Some shelves were also empty in the days after the attack. It was not until August that the click and collect function was restored. Ransomware hackers broke into M&S systems by tricking employees at a third-party contractor. While overall sales volumes rose compared to the 12 months before fashion, mome and beauty sales dropped 16.4%and international sales were down 11.6%. The attack was just one of a series that struck major British businesses.  Competitors like Next said it benefited from the halt in some of the chain's sales but strong food sales suggest M&S has managed to keep customers. It recorded three years of consecutive monthly food volume growth, M&S chief executive Stuart Machin said. The Co-Op, Jaguar Land Rover and Harrods all had operations interrupted by cyber criminals."
    },
    {
        "title": "Ex-Starmer adviser's start-ups backer nears £1bn valuation",
        "description": "An incubator of technology start-ups co-founded by Sir Keir Starmer's former artificial intelligence adviser is closing in on a &#163;1bn valuation after securing new investor backing.",
        "url": "https://news.sky.com/story/ex-starmer-advisers-start-ups-backer-nears-1631bn-valuation-13464379",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-matt-clifford-matthew_6946128.png?20250619172325",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-05 13:50:00",
        "Headline": "Entrepreneurs First, which was co-founded by AI expert Matt Clifford, is raising $120m from new and existing investors at a pre-money valuation of $1.18bn, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n An incubator of technology start-ups co-founded by Sir Keir Starmer's former artificial intelligence adviser is closing in on a £1bn valuation after securing new investor backing. Sky News has learnt that Entrepreneurs First (EF) is in the process of raising about $120m from a syndicate of new and existing funders. EF was jointly founded by Matt Clifford, who this year spent six months helping shape Downing Street's approach to AI, authoring its AI Opportunities Action Plan. Mr Clifford, who stepped down from that role for personal reasons, is also chair of the government's advanced research agency, ARIA. Sources said that EF had notified investors in recent weeks that it had secured a $75m commitment from Transpose Platform, one of its existing investors, as part of the broader funding round. New backers, according to people briefed on the plans, include Japan Post Bank and the California Public Employees Retirement System, one of the world's most powerful pension fund investors. The Series D funding round will cement EF's status as a lynchpin of Britain's start-up economy. \n                  Nvidia boss defends AI against claims of bubble by 'Big Short' investor\n                 \n                  Revealed: How much the government's spending on AI\n                 \n                  Microsoft, Alphabet and Meta results overshadowed by growing fears of AI bubble\n                 EF has backed hundreds of companies, including the fintech unicorn Cleo and insurance claims processor Tractable. The firm is run by chief executive Alice Bentinck, who co-founded it with Mr Clifford in 2011. In response to an enquiry from Sky News, EF declined to comment."
    },
    {
        "title": "Sickness bill costs £85bn year, says new report, which warns of 'economic crisis'",
        "description": "The UK is facing an \"economic inactivity crisis\" as employers are losing an estimated &#163;85bn a year in costs linked to sickness and poor workplace health, a landmark report has found.",
        "url": "https://news.sky.com/story/sickness-bill-costs-16385bn-year-says-new-report-which-warns-of-economic-crisis-13464243",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-health-work-depression_7072566.jpg?20251105095110",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-05 09:37:00",
        "Headline": "The landmark Mayfield review proposes a \"fundamental shift\" in how ill health at work is treated by employees, employers and health services.",
        "Content": "The UK is facing an \"economic inactivity crisis\" as employers are losing an estimated £85bn a year in costs linked to sickness and poor workplace health, a landmark report has found. More than one in five working-age people are now out of work and not looking for work - more than comparator countries - which is costing the UK £212bn a year, the Mayfield review said. Its author, former John Lewis boss Sir Charlie Mayfield, says poor health \"has become one of the biggest brakes on growth and opportunity,\" but says it is not inevitable. Politics latest: Lammy to be grilled at deputy PMQs The report, published on Wednesday, says there are now 800,000 more people out of work now than in 2019 due to health problems, and without \"decisive action\" to address this, another 600,000 people will be added by 2030. Sir Charlie found that a 22-year-old who is not in work for health reasons could be more than £1 million worse off over their lifetime, while employers are losing an average of £120 per day in profit from absences. The cost to the state is also vast - it is costing 7% of GDP, or almost 70% of the income tax we pay, through \"lost output, increased welfare payments and additional burdens on the NHS\", which is \"unsustainable\". \n                  214,000 parents missing out on child benefit and potentially thousands\n                 \n                  Starmer defends suspending rebel MPs after backbench criticism\n                 \n                  'We're a team': Jess Phillips defends PM's decision to suspend Labour rebels\n                 The additional burden in welfare payments and NHS demand is around £47bn annually, the report says. Among the reasons for these absences continuing to mount is a \"culture of fear\" felt by both employers and employees, that \"creates distance\" and \"discourages safe and early disclosure, constructive conversations and support,\" Sir Charlie found. Live news reporter \"Who the f*** am I?\" asks Roni Jones, from Cornwall, four years after the Easter weekend that ended her career. The former NHS manager, charity chief executive and self-confessed workaholic once dismissed those off work with long-term sickness as \"malingerers\", \"the worried well\" or suffering from \"yuppie flu\". But after she collapsed in her garden in 2021, she was diagnosed with a debilitating neurological condition, adding her name to the growing list of 2.8 million people off work due to long-term sickness. \"There's always been this negative thing about people who don't work. And I would have been part of that. Until it happened to me,\" says Jones, 63, who lives with multisystem dysautonomia, a condition that causes her \"bone-crushing\" pain and fatigue. \"I can't even conceive of being able on a regular basis to get up, get showered and get out of the house - never mind go and do a day's work.\" Tap here to read more. He wrote that there is a \"a lack of an effective or consistent support system for employers and their employees in managing health and tackling barriers faced by disabled people\" that are \"structural\". But he says \"these problems are not inevitable,\" adding: \"What is missing is coordination, focus, and a coherent framework for change.\" Google among 60 employers interested in new scheme Sir Charlie's report is \"proposing a fundamental shift from a model where health at work is largely left to the individual and the NHS, to one where it becomes a shared responsibility between employers, employees and health services\". Employers must \"act on prevention, to support rehabilitation, and to remove barriers for disabled people,\" he says. His message to employees is: \"Work can be demanding. Setbacks are part of life. Health and work are not always easy partners, but they are mutually reinforcing. Supportive workplaces matter, and so does personal responsibility.\"  But he also calls on the government to \"reset the system - to enable and incentivise employers and employees to act\". \"System issues such as fit note reform, dispute resolution and links with programmes like Pathways to Work will also demand coordination,\" he wrote, calling for political leadership across a range of government departments to spearhead change. The review also calls for the adoption of a workplace health provision, which is described as a non-clinical case management service supporting employees and line managers across a so-called healthy working lifecycle. It says this approach of offering support and advice and early intervention could be integrated with the NHS App and reduce or replace the need for the current fit note. The government says more than 60 employers - including the British Beer and Pub Association, Burger King, John Lewis and Google UK - have expressed interest in becoming so-called vanguard employers to pioneer the overall new approach. This would involve a three-year phase focused on how to address mental health at work, retention of older people in work and improved participation and retention of disabled people in work. Business Secretary Peter Kyle told broadcasters said the aim of this initial scheme would be to see \"what works, what is possible\", and they have agreed to share their findings with the government with the aim of \"spread[ing] that learning\" to businesses across the country. Health is 'essential for economic growth' Sir Charlie said: \"Employers are uniquely placed to make a difference, preventing health issues where possible, supporting people when they arise, and helping them return to work. \"If we keep Britain working, everyone wins - people, employers and the state. \"That's why the action the government is taking forward from my review is so important. I'm looking forward to working with them and with employers, large and small, to keep people in work, unlock potential and build a healthier, more prosperous Britain.\" Work and Pensions Secretary Pat McFadden said Sir Charlie's message was \"crystal clear: keeping people healthy and in work is the right thing to do and is essential for economic growth\". \"Business is our partner in building a productive workforce - because when businesses retain talent and reduce workplace ill-health, everyone wins. \"That's why we're acting now to launch employer-led vanguards as part of the Plan for Change, driving economic growth and opportunity across the country.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 Conservative shadow business secretary Andrew Griffith said that while he welcomes the report and its findings, he is worried about the impact of the government's Employment Rights Bill, that is returning to the Commons this afternoon. He told Mornings with Ridge and Frost: \"I think we need to give employers more opportunity and reasons to hire young people, and that (the Bill)… will put up all sorts of barriers and create incentives for them not to take a chance when they're giving young people a job.\""
    },
    {
        "title": "Badenoch calls for government to 'get Britain drilling again' as Starmer flies to COP30",
        "description": "Kemi Badenoch is calling for the government to \"get Britain drilling again\" - as Sir Keir Starmer heads to COP30.",
        "url": "https://news.sky.com/story/badenoch-calls-for-government-to-get-britain-drilling-again-as-starmer-flies-to-cop30-13464309",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-china-spy-case-badenoch_7060740.jpg?20251024165959",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-05 12:56:00",
        "Headline": "The Conservatives have said the government needs to recognise gas will be needed to secure energy and lower bills.",
        "Content": "Kemi Badenoch is calling for the government to \"get Britain drilling again\" - as Sir Keir Starmer heads to COP30. The Tory leader has launched a joint campaign with the Scottish Conservatives to demand the moratorium on new oil and gas licences is lifted. They are also calling on the chancellor to scrap the energy profits levy - an extra 38% tax on North Sea oil and gas profits - at the upcoming budget on 26 November. Politics latest: Reeves refuses to rule out tax rises The Conservatives want the government to recognise that it believes gas will be a key part of the future energy mix to secure energy and lower bills to \"deliver a stronger economy\". They have launched the call to \"get Britain drilling again\" as the prime minister flies to Brazil for the COP30 summit after he reiterated the government's dedication to clean energy goals and the UK's role as a global climate leader on Tuesday. He admitted COP30 would present a \"challenge\" due to slow global progress in cutting emissions, but said: \"I've thought climate change has been our biggest challenge as a species for a very long number of years now.\"  Speaking on a visit to Aberdeen, Ms Badenoch said the UK, in particular northeast Scotland, is facing an oil and gas \"emergency due to the anti-growth policies of the Labour government in Westminster and the SNP in Holyrood\". She warned the offshore oil and gas sector \"risks disappearing altogether\", which she said would mean job losses in Scotland and the rest of the UK, and leave the country more reliant on overseas energy imports. Ms Badenoch said: \"Scotland, and the whole United Kingdom, faces a growing oil and gas emergency thanks to Labour's inability to put our national interest first. \"By the end of Labour's first term in office, it's not inconceivable that Scotland's oil and gas sector will be at serious risk, with domestic production currently set to half by 2030. \"That would be a shocking indictment of Labour's energy policy, and a dangerous act of economic self-sabotage. \"Enough is enough. Keir Starmer must find the backbone to ditch Ed Miliband's Net Zero fanaticism, which is forcing up bills and driving away industry. \"Instead, the prime minister should do what our economy needs, scrap the energy profits levy and end the moratorium on new licences in the North Sea. \"If the Labour government fails to act, we could be witness to the end of our domestic energy security as we know it.\" A Labour Party spokesperson accused Ms Badenoch of \"doubling down on the same failed Tory energy policy that caused the worst cost-of-living crisis in a generation\". \"The Conservatives' anti-growth, anti-jobs, anti-investment position on clean energy would cost hundreds of thousands of jobs, leave Britain reliant on insecure expensive fossil fuels and lock families into higher bills for generations to come,\" she added. \"It's the same old Tories, with the same old policies. It didn't work then and it won't work now.\" There have been a series of oil and gas closures this year. Grangemouth, Scotland's only oil refinery, stopped processing crude oil after a century of operations in April, with 430 job losses. The union Unite said political leaders had \"utterly failed\" the workers and would face \"electoral wrath\", while the area's Labour MP, Brian Leishman, said he was \"disgusted\" by the broken promises. Harbour Energy, the UK's largest oil and gas producer, cut 250 jobs in Aberdeen in May, blaming the government's fiscal rules and regulations. The Prax Lindsey Oil Refinery in Lincolnshire ended production in August, with 125 job losses, after the group went into administration and the government was unable to find a buyer. In October, oil and gas contractor Petrofac, which employs about 2,000 people in Scotland, filed for administration, but its core operating subsidiaries and North Sea business have continued to trade as normal while it looks at restructuring or selling."
    },
    {
        "title": "Police chiefs warn of crime surge if Labour's plans pass - as hunt for mistakenly released prisoners continues",
        "description": "Police are preparing for a surge in crime if the Labour government's plans to overhaul prison sentences go ahead - with hundreds of thousands more offences expected in a year.",
        "url": "https://news.sky.com/story/police-chiefs-warn-of-crime-surge-if-labours-plans-pass-as-hunt-for-mistakenly-released-prisoners-continues-13464694",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-brahim-kaddour-cherif_7073009.jpg?20251105170438",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-05 22:39:00",
        "Headline": "Labour have blamed the Conservatives for leaving the country's justice system in a poor state, but the government has been dogged by a series of embarrassing headlines, with a number of prisoners mistakenly released. A manhunt for two men remains under way.",
        "Content": " Police are preparing for a surge in crime if the Labour government's plans to overhaul prison sentences go ahead - with hundreds of thousands more offences expected in a year. Measures proposed under the Sentencing Bill, intended to ease overcrowding in prisons, include limiting the use of short prison sentences and releasing some convicted criminals earlier. However, police chiefs are warning such measures could see up to a 6% rise in crime in the immediate aftermath, should the plans become law. It comes as a manhunt is under way for two prisoners mistakenly released from HMP Wandsworth, including Brahim Kaddour-Cherif, a 24-year-old Algerian man and registered sex offender, and 35-year-old William Smith.  'It has to be properly funded' Assistant Chief Constable Jason Devonport, who spent 18 months on secondment as a prison governor at HMP Berwyn, said forces are planning for an increase in all types of offences. While he said community programmes to support rehabilitation \"are being ramped up,\" he warned officers \"expect, certainly in the short term, there will be an increase of offending in the community\". \n                  Train stabbing latest: Rail worker critically ill but stable after mass stabbing, transport minister tells Sky News\n                 \n                  Claire Inglis: Call for 'damning' report into mother's murder to be fully released\n                 \n                  Regan McClinton: Blantyre sex predator who attacked two girls after dragging them off street jailed\n                 \"I believe in the Sentencing Bill and I believe in rehabilitation,\" he added, \"but it has to be properly funded.\" ACC Devonport said the probation service is trying to recruit 1,500 officers a year for the next three years to manage demand, and that the rise in police-recorded crime in one year is expected to be between 4% and 6%. In the year to June 2025, police in England and Wales recorded 6.6 million offences. A rise of 6% would then equal around 396,000 additional recorded crimes. Gavin Stephens, chairman of the National Police Chiefs' Council, added that officers have \"all been in policing long enough to know that some of the things that help people stop offending or desist from offending are not going to be resolved by short sentences in particular\". However, he added: \"Our issue is in the short-term period of the implementation, there is a shift of demand on to policing, and we want that shift of demand on to us to be properly recognised and properly modelled... so we can have the right and appropriate resource in there to mitigate the risk to communities.\" Chief political correspondent The charitable view of the latest prison release blunder that has plunged the government into another political crisis is that it's extremely bad luck rather than an act of incompetence by ministers. \n\n But the more we learn about the shocking details of what happened and what looks like a cynical attempt at a cover-up by the hapless David Lammy, the more the blame can be laid at the government's door. Click here to read more Prison system at 'breaking point,' warns MP In a further warning about the state of law and order in the UK, the chair of the Justice Committee has said the prison system is at \"breaking point\". Labour MP Andy Slaughter called the latest releases from HMP Wandsworth \"extremely concerning,\" adding: \"While the day to day running of prison security and public safety are paramount, the current spate of releases in error will be repeated until the underlying failures are addressed.\" He also said evidence taken by the committee \"laid bare a crisis-hit prison system, starved of investment over many years which is facing multi-faceted pressures\". What do we know about the manhunt? The south London prison admitted on Wednesday that Kaddour-Cherif, who sentenced for trespass with an intent to steal, was accidentally released on 29 October. His release came just five days after the high-profile release of migrant sex offender Hadush Kebatu from HMP Chelmsford in Essex.  Hours after Kaddour-Cherif's accidental release was confirmed by the Met, Surrey Police announced it was also searching for Smith after another error by prison staff. The 35-year-old, who was sentenced to 45 months for multiple fraud offences and goes by the name Billy, had apparently been released on Monday. It is not yet clear why it was nearly a week between the first release at Wandsworth and the police being informed that an offender was at large. Both mistakes follow vows by Deputy Prime Minister and Justice Secretary David Lammy that enhanced checks on prisoner releases would be introduced. He came under fire while standing in for Sir Keir Starmer at PMQs, but sought to blame the Conservatives, saying: \"In 25 years in this House, I have not witnessed a more shameful spectacle frankly than what the party opposite left in our justice system.\" News of Kaddour-Cherif's release broke as PMQs was ending, and a comment released on Mr Lammy's behalf said he was \"absolutely outraged\" about it. He had been repeatedly asked whether any more asylum seekers had been mistakenly released from jail since the Kebatu case, and refused to answer. Read more from Sky News:Nearly 40,000 freed early to tackle prison overcrowdingHow many prisoners are released by mistake?Driver hits several people on holiday island  In response to concerns of a spike in crime should the Sentencing Bill become law, a Ministry of Justice spokesperson said the government \"inherited a prison system in crisis, days away from running out of space\". \"Public safety will always be our top priority, and we are building 14,000 more prison places to keep dangerous offenders locked up,\" they added. \"Offenders released face strict licence conditions, and we are increasing the probation budget by an extra £700 million over the next three years and investing in new technology to reduce admin, so staff can focus on work that reduces reoffending.\" And in response to the manhunt for the two released convicts, a spokesperson said: \"Releases in error have been increasing for several years and are another symptom of a justice system crisis inherited by this government.\" They added: \"We are clear that these mistakes must not continue to happen.\""
    },
    {
        "title": "Feeble and inept - prison release fiasco is yet another political crisis",
        "description": "The charitable view of the latest prison release blunder that has plunged the government into another political crisis is that it's extremely bad luck rather than an act of incompetence by ministers.&#160;",
        "url": "https://news.sky.com/story/feeble-and-inept-prison-release-fiasco-is-yet-another-political-crisis-13464456",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-david-lammy-dpmqs-commons_7072997.jpg?20251105165133",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-11-05 16:29:00",
        "Headline": "David Lammy was asked five times by Conservative James Cartlidge if any further prisoners had been released by mistake since Hadush Kebatu was freed in error.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n The charitable view of the latest prison release blunder that has plunged the government into another political crisis is that it's extremely bad luck rather than an act of incompetence by ministers.  But the more we learn about the shocking details of what happened and what looks like a cynical attempt at a cover-up by the hapless David Lammy, the more the blame can be laid at the government's door. Politics latest: Badenoch slams 'shambles of a government' Critics of the justice secretary and deputy prime minister, standing in for Sir Keir Starmer at PMQs, claim this sorry episode reveals his pomposity, inability to think on his feet and a tendency to blame others for a fiasco. And it's not as if the accidental prison releases that have shocked the nation and outraged public opinion in recent weeks are the only fiascos on the government's watch. For example: The asylum seeker deported on the government's one in, one out deal with France who then returned to the UK on a small boat across the Channel was another case of a policy that critics claim isn't working. The furore over the tax rises expected in Rachel Reeves' budget can be attributed to what now looks like a strategic error in promising no rises in income, VAT or national insurance in Labour's election manifesto. \n                  Police chiefs warn of crime surge if Labour's plans pass - as hunt for mistakenly released prisoners continues\n                 \n                  Government 'ready to be held to account' over prisoner releases, says minister\n                 \n                  Wandsworth manhunt latest: Search is on for two prisoners freed by mistake\n                 The chancellor's failure to apply for a local authority licence to rent out her home in London's leafy suburbs revealed a lack of judgment on her part, on top of her dodgy CV about her jobs before becoming an MP. Angela Rayner's careless approach to stamp duty requirements on her luxury beachfront flat that forced her resignation triggered a botched reshuffle that caused resentment among ministers and MPs.  The appointment of Peter Mandelson as US ambassador - described by ministers as \"a risk worth taking\" - despite his links to paedophile Jeffrey Epstein, always looked like an accident waiting to happen. The list goes on. But Mr Lammy's handling of the Wandsworth prison releases (another was revealed hours after PMQs) has been chaotic, shifty and made a bad situation worse. It couldn't have come at a worse time, of course, when he was deputising at PMQs. We now know that he was told about the release blunder overnight. His excuse for dodging James Cartlidge's questions in PMQs about another release was that information was still emerging and the case was complicated. Feeble! And inept. Read more:Manhunt for two prisoners freed in errorHow many prisoners are released by mistake? A tougher law and order minister in the mould of David Blunkett, John Reid, Michael Howard or - dare one say - his predecessor as justice secretary, Shabana Mahmood - would have demanded the full facts on his desk first thing in the morning. Was Mr Lammy guilty of a deliberate cover-up or was he just incompetent, with no grip over his department and the increasingly accident-prone prison service? Either is bad and damaging for the government's credibility. We also know that the Conservatives found out about the mistaken release 15 minutes before PMQs. Tory stand-in Mr Cartlidge doggedly asked him no fewer than five times if there had been any more accidental releases. Mr Lammy floundered and, in what was a very bad look, lost his temper. That was a bad mistake. His tactics backfired spectacularly. When Mr Cartlidge rose at the end of PMQs and told MPs another prisoner had indeed been mistakenly released, Mr Lammy fled the chamber in indecent haste, ignoring the Speaker's offer of a response.  It was, or course, Angela Rayner's resignation over her stamp duty blunder that brought about Mr Lammy's elevation to deputy prime minister. And that, of course, was a sop to compensate him for losing the Foreign Office brief. His critics claim Mr Lammy was over-promoted when he was appointed shadow foreign secretary. But then he did co-chair Sir Keir's 2020 leadership campaign. And, like the PM, he's a barrister. Elected MP for Tottenham in a by-election in 2000, he held a number of junior and middle-ranking ministerial posts under Tony Blair and Gordon Brown. And in a humiliating appearance on TV's Celebrity Mastermind in 2009, he said in one answer during a general knowledge round that Henry VII acceded the English throne after the death of Henry VIII. But the minister now dubbed \"Calamity Lammy\" by his Tory opponent Robert Jenrick isn't the only minister guilty of blunders. Top of that list must be the prime minister himself. Sir Keir makes the appointments, controls policy from No 10, overrules ministers and - when it comes to the economy - is, after all, the First Lord of the Treasury. Yes, some of the government's political problems are down to bad luck. But not all, by any means. To misquote Oscar Wilde, the most famous prisoner held in another prison, Reading Gaol: \"To lose one prisoner may be regarded as a misfortune. To lose two looks like carelessness.\""
    },
    {
        "title": "Wandsworth manhunt latest: Search is on for two prisoners freed by mistake",
        "description": "Just hours after it was discovered a prisoner was on the run after being mistakenly released from HMP Wandsworth, the prison admits it has a second escapee.",
        "url": "https://news.sky.com/story/manhunt-for-foreign-prisoner-after-mistaken-release-from-hmp-wandsworth-13464331",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-brahim-kaddour-cherif_7073009.jpg?20251105170438",
        "type": "Politics",
        "Author": "Tom Parmenter",
        "Date Published": "2025-11-05 12:16:00",
        "Headline": "This comes just days after migrant sex offender Hadush Kebatu was released in error, as statistics show 262 prisoners were freed by mistake in the year leading up to March 2025.",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  Just hours after it was discovered a prisoner was on the run after being mistakenly released from HMP Wandsworth, the prison admits it has a second escapee. HMP Wandsworth in south London admitted a foreign prisoner was accidentally released on 29 October - just five days after the high-profile release of migrant sex offender Hadush Kebatu from HMP Chelmsford in Essex. But later on Wednesday, Surrey Police announced it was now also searching for 35-year-old William Smith, who had apparently been released on Monday, in a second error by staff at the jail. Both mistakes follow vows by Deputy Prime Minister and Justice Secretary David Lammy that enhanced checks on prisoner releases would be introduced. The number of these types of errors has risen recently, with 262 instances between March 2024 and March 2025 - a 128% increase on 115 in the previous 12 months. Manhunt latest: Foreign prisoner on the loose  The Metropolitan Police confirmed to Sky News that shortly after 1pm on Tuesday 4 November, the Prison Service confirmed Brahim Kaddour-Cherif, a 24-year-old Algerian man, had been released in error from HMP Wandsworth on 29 October. The Met said officers were \"carrying out urgent enquiries in an effort to locate him and return him to custody\". Sky News understands he is a registered sex offender who was serving time for trespass with an intent to steal. It is understood he is not an asylum seeker. Meanwhile, William Smith, who was released on Monday, and goes by the name Billy, was sentenced to 45 months for multiple fraud offences. 'Utterly unacceptable' It is not yet clear why it was nearly a week between the first release at Wandsworth and the police being informed that an offender was at large. Sir Keir Starmer was not aware of the incident until the Met Police announcement, Downing Street said. The prime minister's spokesman told reporters: \"The Met have released a statement I think in the last few minutes.\" He said \"one mistaken release is one too many\" and the case was \"utterly unacceptable\". \"It's important the police are given the time and space to bring him back into custody. And we will look into the circumstances behind this as a matter of urgency,\" he added.  The PM's spokesman could not say when Mr Lammy became aware of the initial error, after the cabinet minister refused to answer several questions about it, in the House of Commons, from the shadow defence secretary. Tory leader Kemi Badenoch wrote on X: \"James Cartlidge asked the Deputy PM FIVE times to tell us if ANOTHER migrant sex offender had been accidentally released from prison. \"Instead of answering, Lammy lost his temper. \"Now we read it HAS happened again & he's been on the run for a week. \"This is a shambles of a government.\"  Lammy 'outraged and appalled' Sky News understands Mr Lammy did know about the first prisoner release before he stood up in the Commons and was pressed on the issue by the Conservatives. \"If we knew, one can only assume the justice secretary knew,\" a spokesman for Ms Badenoch said, adding Mr Lammy should come back to the chamber \"and do a statement as soon as possible\". Mr Lammy said afterwards he was \"absolutely outraged and appalled by the mistaken release of a foreign criminal wanted by the police\", adding his \"officials have been working through the night to take him back to prison\". \"Victims deserve better and the public deserve answers,\" he said. It is understood Mr Lammy believed it would have been irresponsible to talk about the case - involving several agencies - while details were still emerging. Reform UK leader Nigel Farage posted on social media (before the announcement of the second erroneous release): \"Another dangerous criminal is on the loose thanks to Labour. What a total farce.\" The Conservatives described the Kebatu episode as a \"national embarrassment\" - and Charlie Taylor, the chief inspector of prisons, said mistakes were happening \"all the time\" and are symptomatic of the chaos within the system. Read more: How many prisoners are released by mistake?  In the aftermath of the Kebatu manhunt, Mr Lammy promised \"the strongest release checks that have ever been in place\". He also ordered an independent investigation into the Kebatu release, which is being led by former deputy commissioner of the Met Police Dame Lynne Owens. \"This latest incident exposes deeper flaws across the failing criminal justice system we inherited,\" Mr Lammy added in his statement on Wednesday on the HMP Wandsworth error. \"Dame Lynne Owens' investigation will leave no stone unturned to identify these issues, so we can fix them, improve safeguards and ensure the public is properly protected.\"  'Dangerous situation' The Liberal Democrats' justice spokesperson Jess Brown-Fuller said again, before the second Wandsworth incident: \"Just when you couldn't think things could get any worse for the Ministry of Justice, somehow they have. It would be laughable if the situation weren't so dangerous. \"This is yet another grave mistake from the government. The public deserves a full explanation about how this has happened again. That should start with David Lammy coming back before parliament this afternoon for why he failed to answer this pressing question in PMQs as well as a full explanation of how it took almost a week for this to come to light. \"It's utterly unacceptable that public safety has been put at risk yet again. Both the government and the prison service must own up to their failures and guarantee that these mistakes will stop happening once and for all.\""
    },
    {
        "title": "Small boat migrant sent back to France for second time in less than two months",
        "description": "A man who arrived on a small boat has been sent back to France for the second time in less than two months.",
        "url": "https://news.sky.com/story/small-boat-migrant-sent-back-to-france-for-a-second-time-in-less-than-two-months-13464316",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-home-office-migrant_7072818.jpg?20251105133952",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-05 12:09:00",
        "Headline": "The Iranian national was deported to France under the one in, one out agreement but came back to the UK as he said he was a victim of modern slavery in northern France.",
        "Content": "A man who arrived on a small boat has been sent back to France for the second time in less than two months. The Iranian man came to the UK on a small boat on 6 August and was initially sent back to France on 19 September, before returning to the UK on a small boat on 18 October. He has been flown back again as part of the latest tranche of 19 returnees under the \"one in, one out\" agreement with France. Politics latest: Badenoch slams 'shambles of a government' The Iranian man told The Guardian he had been a victim of modern slavery at the hands of people smugglers in northern France. As part of the one in, one out agreement, which came into play in August, 94 migrants who came to the UK illegally on small boats have now been removed. In return, a total of 57 approved asylum seekers have been brought to the UK. \n                  Vietnamese migrants to be returned under new deal with UK\n                 \n                  Huge rise in raids on salons and takeaways revealed in illegal working crackdown\n                 \n                  Starmer failed to take decisive step to smash the gangs at leaders summit - as small boat crossings exceed 2024\n                 Although the UK has sent back more migrants than it has accepted, the two countries have committed to exchange an equal number of people in each direction. The end of October saw more migrants having crossed the Channel in 2025 than the entirety of 2024. Read more:Manhunt after foreign prisoner mistakenly released from prison Home Secretary Shabana Mahmood said: \"Anyone looking to return to the UK after being removed under the UK-France agreement is wasting their time and money. \"This individual was detected by biometrics and detained instantly. His case was expedited, and now he has been removed again. \"My message is clear: if you try to return to the UK you will be sent back. I will do whatever it takes to scale up removals of illegal migrants and secure our borders.\""
    },
    {
        "title": "Badenoch calls for government to 'get Britain drilling again' as Starmer flies to COP30",
        "description": "Kemi Badenoch is calling for the government to \"get Britain drilling again\" - as Sir Keir Starmer heads to COP30.",
        "url": "https://news.sky.com/story/badenoch-calls-for-government-to-get-britain-drilling-again-as-starmer-flies-to-cop30-13464309",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-china-spy-case-badenoch_7060740.jpg?20251024165959",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-05 12:56:00",
        "Headline": "The Conservatives have said the government needs to recognise gas will be needed to secure energy and lower bills.",
        "Content": "Kemi Badenoch is calling for the government to \"get Britain drilling again\" - as Sir Keir Starmer heads to COP30. The Tory leader has launched a joint campaign with the Scottish Conservatives to demand the moratorium on new oil and gas licences is lifted. They are also calling on the chancellor to scrap the energy profits levy - an extra 38% tax on North Sea oil and gas profits - at the upcoming budget on 26 November. Politics latest: Reeves refuses to rule out tax rises The Conservatives want the government to recognise that it believes gas will be a key part of the future energy mix to secure energy and lower bills to \"deliver a stronger economy\". They have launched the call to \"get Britain drilling again\" as the prime minister flies to Brazil for the COP30 summit after he reiterated the government's dedication to clean energy goals and the UK's role as a global climate leader on Tuesday. He admitted COP30 would present a \"challenge\" due to slow global progress in cutting emissions, but said: \"I've thought climate change has been our biggest challenge as a species for a very long number of years now.\"  Speaking on a visit to Aberdeen, Ms Badenoch said the UK, in particular northeast Scotland, is facing an oil and gas \"emergency due to the anti-growth policies of the Labour government in Westminster and the SNP in Holyrood\". She warned the offshore oil and gas sector \"risks disappearing altogether\", which she said would mean job losses in Scotland and the rest of the UK, and leave the country more reliant on overseas energy imports. Ms Badenoch said: \"Scotland, and the whole United Kingdom, faces a growing oil and gas emergency thanks to Labour's inability to put our national interest first. \"By the end of Labour's first term in office, it's not inconceivable that Scotland's oil and gas sector will be at serious risk, with domestic production currently set to half by 2030. \"That would be a shocking indictment of Labour's energy policy, and a dangerous act of economic self-sabotage. \"Enough is enough. Keir Starmer must find the backbone to ditch Ed Miliband's Net Zero fanaticism, which is forcing up bills and driving away industry. \"Instead, the prime minister should do what our economy needs, scrap the energy profits levy and end the moratorium on new licences in the North Sea. \"If the Labour government fails to act, we could be witness to the end of our domestic energy security as we know it.\" A Labour Party spokesperson accused Ms Badenoch of \"doubling down on the same failed Tory energy policy that caused the worst cost-of-living crisis in a generation\". \"The Conservatives' anti-growth, anti-jobs, anti-investment position on clean energy would cost hundreds of thousands of jobs, leave Britain reliant on insecure expensive fossil fuels and lock families into higher bills for generations to come,\" she added. \"It's the same old Tories, with the same old policies. It didn't work then and it won't work now.\" There have been a series of oil and gas closures this year. Grangemouth, Scotland's only oil refinery, stopped processing crude oil after a century of operations in April, with 430 job losses. The union Unite said political leaders had \"utterly failed\" the workers and would face \"electoral wrath\", while the area's Labour MP, Brian Leishman, said he was \"disgusted\" by the broken promises. Harbour Energy, the UK's largest oil and gas producer, cut 250 jobs in Aberdeen in May, blaming the government's fiscal rules and regulations. The Prax Lindsey Oil Refinery in Lincolnshire ended production in August, with 125 job losses, after the group went into administration and the government was unable to find a buyer. In October, oil and gas contractor Petrofac, which employs about 2,000 people in Scotland, filed for administration, but its core operating subsidiaries and North Sea business have continued to trade as normal while it looks at restructuring or selling."
    },
    {
        "title": "'Hope won': London mayor Sadiq Khan compares newly-elected New York mayor to his leadership",
        "description": "New York has followed London by choosing hope over fear in electing Democrat Zohran Mamdani as its new mayor, Sir Sadiq Khan said.",
        "url": "https://news.sky.com/story/hope-won-london-mayor-sadiq-khan-compares-newly-elected-new-york-mayor-to-his-leadership-13464376",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rama-duwaji-zohran-mamdani_7072586.jpg?20251105101332",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-05 13:43:00",
        "Headline": "Democrat Zohran Mamdani defeated Trump-backed former New York governor Andrew Cuomo to become mayor.",
        "Content": " New York has followed London by choosing hope over fear in electing Democrat Zohran Mamdani as its new mayor, Sir Sadiq Khan said. Mr Mamdani, 34, defeated former New York governor Andrew Cuomo and Republican Curtis Sliwa to become the city's first Muslim mayor and the first of South Asian heritage. London mayor Sir Sadiq drew comparisons to his own 2016 victory as he congratulated Mr Mamdani, who will become New York's youngest mayor in more than a century when he takes office on 1 January. US latest: Trump downplays Democrats' wins Sir Sadiq called it a \"historic campaign\", adding on X: \"New Yorkers faced a clear choice - between hope and fear - and just like we've seen in London - hope won.\" Education Secretary Bridget Phillipson also congratulated Mr Mamdani, telling Sky News: \"I wish him well. \"It's a wonderful job to have secured.\" \n                  The night Democrats fought back against Trump\n                 \n                  Trump renominates billionaire Musk ally Jared Isaacman to lead NASA\n                 \n                  Zohran Mamdani's win in New York suggests he hit on a formula that worked for Trump\n                 Green Party leader Zack Polanski said Mr Mamdani's success \"will resonate throughout the world\" as he called it a \"story where no one is left behind\". \"It's time to write that story across England and Wales too,\" he added. Mr Mamdani's victory was a setback for Donald Trump, who had thrown his weight behind Andrew Cuomo, a former Democrat running as an independent. The mayor-elect described himself as \"Trump's worst nightmare\" and said New York had shown \"a nation betrayed by Donald Trump how to defeat him\". Read more:From rapper to New York mayor - Who is Zohran Mamdani? The US president had threatened to cut federal funding to New York if Mr Mamdani won. In his victory speech, Mr Mamdani said: \"New York will remain a city of immigrants, a city built by immigrants, powered by immigrants and as of tonight, led by an immigrant. \"If anyone can show a nation betrayed by Donald Trump how to defeat him, it is the city that gave rise to him.\""
    },
    {
        "title": "Nvidia boss defends AI against claims of bubble by 'Big Short' investor",
        "description": "Nvidia boss Jensen Huang has told Sky News the AI sector is a \"long, long way\" from a Big Short-style collapse.\n",
        "url": "https://news.sky.com/story/nvidia-boss-defends-ai-against-claims-of-bubble-by-big-short-investor-13464295",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-huang-kendall_7072666.png?20251105113738",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-11-05 11:56:00",
        "Headline": "Michael Burry, who was played by Christian Bale in the 2015 film The Big Short, has bet against Nvidia and other technology stocks, causing market plunges worth hundreds of billions of dollars.",
        "Content": "\n          Political reporter\n              @TimJ_B\n  Nvidia boss Jensen Huang has told Sky News the AI sector is a \"long, long way\" from a Big Short-style collapse.\n Speaking outside Downing Street following a roundtable with government and other industry figures, the head of the world's first $5tn company defended his sector from criticism by investor Michael Burry. Mr Burry and his firm, Scion Capital, gained notoriety for \"shorting\" - betting against - the US housing market ahead of the 2008 financial crash. Politics latest: Lammy to take deputy PMQs He was portrayed by Christian Bale in the 2015 film The Big Short, which also starred Steve Carell, Brad Pitt and Ryan Gosling. Earlier this week, filings revealed Mr Burry has now bet against Nvidia and on social media, he has suggested there is a bubble in the sector. Some $500bn was wiped off technology stocks overnight Tuesday into Wednesday, Bloomberg reported. \n                  Ex-Starmer adviser's start-ups backer nears £1bn valuation\n                 \n                  Revealed: How much the government's spending on AI\n                 \n                  Microsoft, Alphabet and Meta results overshadowed by growing fears of AI bubble\n                 Speaking to Sky News, Mr Huang said: \"I would say that we're in the beginning of a very long build out of artificial intelligence.\" Defending his company and investment, Mr Huang said AI is the first technology that requires \"infrastructure to be built\" and that Nvidia has seen \"great returns\" from AI, and that is why it is expanding. Mr Huang said better training of AI has led to much \"better\" and \"useful\" answers, and that means \"the AIs have become profitable\". \"When something is profitable, the suppliers want to make more of it, and that's the reason the infrastructure build out is accelerating,\" he added. Pushed on whether he was worried about a situation like the Big Short, Mr Huang said: \"We are long, long away from that.\" The UK government is betting big on AI in the hopes that it can save money by using it and generate growth by building the infrastructure to back it up. Asked if she was worried about the market, Technology Secretary Liz Kendall told Sky News: \"I have no doubts that AI is going to transfer all parts of our economy and our public services.\" Mr Burry and his firm, Scion Capital's bets against Nvidia and other companies were revealed by regulatory filings earlier this week. The investor also posted on social media for the first time in more than two years, warning of a bubble. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Concerns have been raised about the market surrounding AI, and the growth many companies are experiencing. Nvidia is the largest producer of the specialist computer chips that are used to train and use AI models."
    },
    {
        "title": "Giant effigy of Sir Keir Starmer unveiled ahead of town's Bonfire Night celebrations",
        "description": "Sir Keir Starmer will be the latest figure to appear as a giant effigy at a town&#8217;s Bonfire Night celebrations &#8211; following in the footsteps of Donald Trump, Liz Truss and Oasis.",
        "url": "https://news.sky.com/story/giant-effigy-of-sir-keir-starmer-unveiled-ahead-of-towns-bonfire-night-celebrations-13464325",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-edenbridge-bonfire-society_7072733.jpg?20251105123317",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-05 12:11:00",
        "Headline": "The Edenbridge Bonfire Society has been creating figures of celebrities and politicians since the 1990s.",
        "Content": "Sir Keir Starmer will be the latest figure to appear as a giant effigy at a town’s Bonfire Night celebrations – following in the footsteps of Donald Trump, Liz Truss and Oasis. The 11-metre figure of the prime minister holding a burning torch and a digital ID card will be the main feature of the event in Edenbridge, Kent, on Saturday. The effigy wears a \"farmer harmer\" badge, a hat, flip-flops and a frilly collar usually associated with Guy Fawkes - and is holding a clipboard with \"suck up to Trump\" written in big letters. The Edenbridge Bonfire Society has been poking fun at celebrities and politicians through the effigies since 1994. It has previously targeted the American president Mr Trump and Ms Truss, the UK's shortest-serving prime minister in history. Others to have been depicted as an effigy at the annual event include Harvey Weinstein, Katie Hopkins, Sir Sadiq Khan and Wayne Rooney. Last year, organisers poked fun at Ticketmaster and Oasis following public reaction to dynamic pricing over the band's reunion tour.  Other contenders for this year's celebrations included Andrew Mountbatten Windsor, Andrew Tate, Baroness Michelle Mone and MP Angela Rayner. Andrea Deans, one of the creators of this year's effigy, said: \"There were so many elements we could include on the effigy, and it was interesting working out how these could be represented visually.\" Bill Cummings, chairman of the Bonfire Society, said: \"This decision is a great opportunity to remind everyone why we have Bonfire Night in the first place, a message that has perhaps been forgotten over more recent years.\" Sir Keir has a connection to the area as he was raised in nearby Oxted and is said to have played football at one of the local clubs in Edenbridge. Read more from Sky News:Going to a fireworks display? Mum issues warningSpurs star 'threatened with gun' The Edenbridge Bonfire Society has been organising the event for nearly 100 years. Sir Winston Churchill is one of several famous figures to have previously opened the celebrations. This year, more than 500 people are expected to take part in the torchlit parade through Edenbridge High Street."
    },
    {
        "title": "Sickness bill costs £85bn year, says new report, which warns of 'economic crisis'",
        "description": "The UK is facing an \"economic inactivity crisis\" as employers are losing an estimated &#163;85bn a year in costs linked to sickness and poor workplace health, a landmark report has found.",
        "url": "https://news.sky.com/story/sickness-bill-costs-16385bn-year-says-new-report-which-warns-of-economic-crisis-13464243",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-health-work-depression_7072566.jpg?20251105095110",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-05 09:37:00",
        "Headline": "The landmark Mayfield review proposes a \"fundamental shift\" in how ill health at work is treated by employees, employers and health services.",
        "Content": "The UK is facing an \"economic inactivity crisis\" as employers are losing an estimated £85bn a year in costs linked to sickness and poor workplace health, a landmark report has found. More than one in five working-age people are now out of work and not looking for work - more than comparator countries - which is costing the UK £212bn a year, the Mayfield review said. Its author, former John Lewis boss Sir Charlie Mayfield, says poor health \"has become one of the biggest brakes on growth and opportunity,\" but says it is not inevitable. Politics latest: Lammy to be grilled at deputy PMQs The report, published on Wednesday, says there are now 800,000 more people out of work now than in 2019 due to health problems, and without \"decisive action\" to address this, another 600,000 people will be added by 2030. Sir Charlie found that a 22-year-old who is not in work for health reasons could be more than £1 million worse off over their lifetime, while employers are losing an average of £120 per day in profit from absences. The cost to the state is also vast - it is costing 7% of GDP, or almost 70% of the income tax we pay, through \"lost output, increased welfare payments and additional burdens on the NHS\", which is \"unsustainable\". \n                  214,000 parents missing out on child benefit and potentially thousands\n                 \n                  Starmer defends suspending rebel MPs after backbench criticism\n                 \n                  'We're a team': Jess Phillips defends PM's decision to suspend Labour rebels\n                 The additional burden in welfare payments and NHS demand is around £47bn annually, the report says. Among the reasons for these absences continuing to mount is a \"culture of fear\" felt by both employers and employees, that \"creates distance\" and \"discourages safe and early disclosure, constructive conversations and support,\" Sir Charlie found. Live news reporter \"Who the f*** am I?\" asks Roni Jones, from Cornwall, four years after the Easter weekend that ended her career. The former NHS manager, charity chief executive and self-confessed workaholic once dismissed those off work with long-term sickness as \"malingerers\", \"the worried well\" or suffering from \"yuppie flu\". But after she collapsed in her garden in 2021, she was diagnosed with a debilitating neurological condition, adding her name to the growing list of 2.8 million people off work due to long-term sickness. \"There's always been this negative thing about people who don't work. And I would have been part of that. Until it happened to me,\" says Jones, 63, who lives with multisystem dysautonomia, a condition that causes her \"bone-crushing\" pain and fatigue. \"I can't even conceive of being able on a regular basis to get up, get showered and get out of the house - never mind go and do a day's work.\" Tap here to read more. He wrote that there is a \"a lack of an effective or consistent support system for employers and their employees in managing health and tackling barriers faced by disabled people\" that are \"structural\". But he says \"these problems are not inevitable,\" adding: \"What is missing is coordination, focus, and a coherent framework for change.\" Google among 60 employers interested in new scheme Sir Charlie's report is \"proposing a fundamental shift from a model where health at work is largely left to the individual and the NHS, to one where it becomes a shared responsibility between employers, employees and health services\". Employers must \"act on prevention, to support rehabilitation, and to remove barriers for disabled people,\" he says. His message to employees is: \"Work can be demanding. Setbacks are part of life. Health and work are not always easy partners, but they are mutually reinforcing. Supportive workplaces matter, and so does personal responsibility.\"  But he also calls on the government to \"reset the system - to enable and incentivise employers and employees to act\". \"System issues such as fit note reform, dispute resolution and links with programmes like Pathways to Work will also demand coordination,\" he wrote, calling for political leadership across a range of government departments to spearhead change. The review also calls for the adoption of a workplace health provision, which is described as a non-clinical case management service supporting employees and line managers across a so-called healthy working lifecycle. It says this approach of offering support and advice and early intervention could be integrated with the NHS App and reduce or replace the need for the current fit note. The government says more than 60 employers - including the British Beer and Pub Association, Burger King, John Lewis and Google UK - have expressed interest in becoming so-called vanguard employers to pioneer the overall new approach. This would involve a three-year phase focused on how to address mental health at work, retention of older people in work and improved participation and retention of disabled people in work. Business Secretary Peter Kyle told broadcasters said the aim of this initial scheme would be to see \"what works, what is possible\", and they have agreed to share their findings with the government with the aim of \"spread[ing] that learning\" to businesses across the country. Health is 'essential for economic growth' Sir Charlie said: \"Employers are uniquely placed to make a difference, preventing health issues where possible, supporting people when they arise, and helping them return to work. \"If we keep Britain working, everyone wins - people, employers and the state. \"That's why the action the government is taking forward from my review is so important. I'm looking forward to working with them and with employers, large and small, to keep people in work, unlock potential and build a healthier, more prosperous Britain.\" Work and Pensions Secretary Pat McFadden said Sir Charlie's message was \"crystal clear: keeping people healthy and in work is the right thing to do and is essential for economic growth\". \"Business is our partner in building a productive workforce - because when businesses retain talent and reduce workplace ill-health, everyone wins. \"That's why we're acting now to launch employer-led vanguards as part of the Plan for Change, driving economic growth and opportunity across the country.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 Conservative shadow business secretary Andrew Griffith said that while he welcomes the report and its findings, he is worried about the impact of the government's Employment Rights Bill, that is returning to the Commons this afternoon. He told Mornings with Ridge and Frost: \"I think we need to give employers more opportunity and reasons to hire young people, and that (the Bill)… will put up all sorts of barriers and create incentives for them not to take a chance when they're giving young people a job.\""
    },
    {
        "title": "Nvidia boss defends AI against claims of bubble by 'Big Short' investor",
        "description": "Nvidia boss Jensen Huang has told Sky News the AI sector is a \"long, long way\" from a Big Short-style collapse.\n",
        "url": "https://news.sky.com/story/nvidia-boss-defends-ai-against-claims-of-bubble-by-big-short-investor-13464295",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-huang-kendall_7072666.png?20251105113738",
        "type": "Technology",
        "Author": "Tim Baker",
        "Date Published": "2025-11-05 11:56:00",
        "Headline": "Michael Burry, who was played by Christian Bale in the 2015 film The Big Short, has bet against Nvidia and other technology stocks, causing market plunges worth hundreds of billions of dollars.",
        "Content": "\n          Political reporter\n              @TimJ_B\n  Nvidia boss Jensen Huang has told Sky News the AI sector is a \"long, long way\" from a Big Short-style collapse.\n Speaking outside Downing Street following a roundtable with government and other industry figures, the head of the world's first $5tn company defended his sector from criticism by investor Michael Burry. Mr Burry and his firm, Scion Capital, gained notoriety for \"shorting\" - betting against - the US housing market ahead of the 2008 financial crash. Politics latest: Lammy to take deputy PMQs He was portrayed by Christian Bale in the 2015 film The Big Short, which also starred Steve Carell, Brad Pitt and Ryan Gosling. Earlier this week, filings revealed Mr Burry has now bet against Nvidia and on social media, he has suggested there is a bubble in the sector. Some $500bn was wiped off technology stocks overnight Tuesday into Wednesday, Bloomberg reported. \n                  Ex-Starmer adviser's start-ups backer nears £1bn valuation\n                 \n                  Revealed: How much the government's spending on AI\n                 \n                  Microsoft, Alphabet and Meta results overshadowed by growing fears of AI bubble\n                 Speaking to Sky News, Mr Huang said: \"I would say that we're in the beginning of a very long build out of artificial intelligence.\" Defending his company and investment, Mr Huang said AI is the first technology that requires \"infrastructure to be built\" and that Nvidia has seen \"great returns\" from AI, and that is why it is expanding. Mr Huang said better training of AI has led to much \"better\" and \"useful\" answers, and that means \"the AIs have become profitable\". \"When something is profitable, the suppliers want to make more of it, and that's the reason the infrastructure build out is accelerating,\" he added. Pushed on whether he was worried about a situation like the Big Short, Mr Huang said: \"We are long, long away from that.\" The UK government is betting big on AI in the hopes that it can save money by using it and generate growth by building the infrastructure to back it up. Asked if she was worried about the market, Technology Secretary Liz Kendall told Sky News: \"I have no doubts that AI is going to transfer all parts of our economy and our public services.\" Mr Burry and his firm, Scion Capital's bets against Nvidia and other companies were revealed by regulatory filings earlier this week. The investor also posted on social media for the first time in more than two years, warning of a bubble. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Concerns have been raised about the market surrounding AI, and the growth many companies are experiencing. Nvidia is the largest producer of the specialist computer chips that are used to train and use AI models."
    },
    {
        "title": "Badenoch calls for government to 'get Britain drilling again' as Starmer flies to COP30",
        "description": "Kemi Badenoch is calling for the government to \"get Britain drilling again\" - as Sir Keir Starmer heads to COP30.",
        "url": "https://news.sky.com/story/badenoch-calls-for-government-to-get-britain-drilling-again-as-starmer-flies-to-cop30-13464309",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-china-spy-case-badenoch_7060740.jpg?20251024165959",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-11-05 12:56:00",
        "Headline": "The Conservatives have said the government needs to recognise gas will be needed to secure energy and lower bills.",
        "Content": "Kemi Badenoch is calling for the government to \"get Britain drilling again\" - as Sir Keir Starmer heads to COP30. The Tory leader has launched a joint campaign with the Scottish Conservatives to demand the moratorium on new oil and gas licences is lifted. They are also calling on the chancellor to scrap the energy profits levy - an extra 38% tax on North Sea oil and gas profits - at the upcoming budget on 26 November. Politics latest: Reeves refuses to rule out tax rises The Conservatives want the government to recognise that it believes gas will be a key part of the future energy mix to secure energy and lower bills to \"deliver a stronger economy\". They have launched the call to \"get Britain drilling again\" as the prime minister flies to Brazil for the COP30 summit after he reiterated the government's dedication to clean energy goals and the UK's role as a global climate leader on Tuesday. He admitted COP30 would present a \"challenge\" due to slow global progress in cutting emissions, but said: \"I've thought climate change has been our biggest challenge as a species for a very long number of years now.\"  Speaking on a visit to Aberdeen, Ms Badenoch said the UK, in particular northeast Scotland, is facing an oil and gas \"emergency due to the anti-growth policies of the Labour government in Westminster and the SNP in Holyrood\". She warned the offshore oil and gas sector \"risks disappearing altogether\", which she said would mean job losses in Scotland and the rest of the UK, and leave the country more reliant on overseas energy imports. Ms Badenoch said: \"Scotland, and the whole United Kingdom, faces a growing oil and gas emergency thanks to Labour's inability to put our national interest first. \"By the end of Labour's first term in office, it's not inconceivable that Scotland's oil and gas sector will be at serious risk, with domestic production currently set to half by 2030. \"That would be a shocking indictment of Labour's energy policy, and a dangerous act of economic self-sabotage. \"Enough is enough. Keir Starmer must find the backbone to ditch Ed Miliband's Net Zero fanaticism, which is forcing up bills and driving away industry. \"Instead, the prime minister should do what our economy needs, scrap the energy profits levy and end the moratorium on new licences in the North Sea. \"If the Labour government fails to act, we could be witness to the end of our domestic energy security as we know it.\" A Labour Party spokesperson accused Ms Badenoch of \"doubling down on the same failed Tory energy policy that caused the worst cost-of-living crisis in a generation\". \"The Conservatives' anti-growth, anti-jobs, anti-investment position on clean energy would cost hundreds of thousands of jobs, leave Britain reliant on insecure expensive fossil fuels and lock families into higher bills for generations to come,\" she added. \"It's the same old Tories, with the same old policies. It didn't work then and it won't work now.\" There have been a series of oil and gas closures this year. Grangemouth, Scotland's only oil refinery, stopped processing crude oil after a century of operations in April, with 430 job losses. The union Unite said political leaders had \"utterly failed\" the workers and would face \"electoral wrath\", while the area's Labour MP, Brian Leishman, said he was \"disgusted\" by the broken promises. Harbour Energy, the UK's largest oil and gas producer, cut 250 jobs in Aberdeen in May, blaming the government's fiscal rules and regulations. The Prax Lindsey Oil Refinery in Lincolnshire ended production in August, with 125 job losses, after the group went into administration and the government was unable to find a buyer. In October, oil and gas contractor Petrofac, which employs about 2,000 people in Scotland, filed for administration, but its core operating subsidiaries and North Sea business have continued to trade as normal while it looks at restructuring or selling."
    },
    {
        "title": "M&S reveals cost of cyber attack as profit almost wiped out",
        "description": "The cyber attack on high street department store Marks and Spencer is expected to directly cost roughly &#163;136m.",
        "url": "https://news.sky.com/story/ms-reveals-cost-of-cyber-attack-as-profit-almost-wiped-out-13464171",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-marks-and-spencer-m-and-s_6915979.jpg?20250514112929",
        "type": "Technology",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-11-05 07:44:00",
        "Headline": "Despite the hit to profits in the first half of the year, M&S said the second half-year profit will be \"at least\" in line with the same period 12 months earlier. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The cyber attack on high street department store Marks and Spencer is expected to directly cost roughly £136m. The figure is only the cost of immediate incident systems response and recovery, as well as specialist legal and professional services support. Money blog: Treasury thinks 'working people' earn less than £45,000 - readers think differently Combined with a loss in sales, as the retailer's online systems were out of action from Easter into the summer, statutory profit before tax at the business has been nearly wiped out for the first half of the year. This profit measure dropped from £391.9m last year to £3.4m this year. Statutory profit before tax is the official profit figure reported in a company's financial statements before it paid tax, used for tax and legal purposes. That's expected to increase to \"at least in line with last year\" for the second half of the department store's financial year. About £100m is being claimed back in insurance for the cyber attack, M&S said in its market update. \n                   Jaguar Land Rover cyber attack pushes overall UK car production down more than a quarter\n                 \n                  Government contractor Capita fined £14m after more than six million people had data stolen in cyber attack\n                 \n                  China poses 'highly sophisticated' cyber threat to UK, NCSC warns\n                 Using a different profit measure - the M&S group's adjusted profit before tax - the figure is more than half that of a year earlier, down from £413m to £184m. The impact of a cyber attack Sales were hit as online shopping was unavailable from the April attack date until June. Some shelves were also empty in the days after the attack. It was not until August that the click and collect function was restored. Ransomware hackers broke into M&S systems by tricking employees at a third-party contractor. While overall sales volumes rose compared to the 12 months before fashion, mome and beauty sales dropped 16.4%and international sales were down 11.6%. The attack was just one of a series that struck major British businesses.  Competitors like Next said it benefited from the halt in some of the chain's sales but strong food sales suggest M&S has managed to keep customers. It recorded three years of consecutive monthly food volume growth, M&S chief executive Stuart Machin said. The Co-Op, Jaguar Land Rover and Harrods all had operations interrupted by cyber criminals."
    },
    {
        "title": "Trump renominates billionaire Musk ally Jared Isaacman to lead NASA",
        "description": "Donald Trump has relaunched his nomination of a billionaire private astronaut to be the new NASA chief and lead the space agency \"into a bold new era\".",
        "url": "https://news.sky.com/story/trump-renominates-billionaire-musk-ally-jared-isaacman-to-lead-nasa-13464219",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-jared-isaacman-florida_7072498.jpg?20251105083309",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-11-05 08:29:00",
        "Headline": "The private astronaut, who has twice been to space in commercially funded missions with SpaceX, was nominated by the US president in the spring, but the rug was pulled at the last minute over his previous donations to Democrats. ",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n Donald Trump has relaunched his nomination of a billionaire private astronaut to be the new NASA chief and lead the space agency \"into a bold new era\". Jared Isaacman, an ally of SpaceX boss Elon Musk, was originally nominated by the US president in the spring, but the rug was pulled at the last minute over his previous donations to Democrats. Now, in a sudden reversal, Mr Trump has decided Isaacman is, after all, the best person for the job. \"Jared's passion for Space, astronaut experience, and dedication to pushing the boundaries of exploration, unlocking the mysteries of the universe, and unlocking the new space economy, make him ideally suited to lead NASA into a bold new era,\" he wrote in a post on his social media platform Truth Social. Isaacman, the former chief executive of the payment processing company Shift4, has twice been to space in commercially funded missions with SpaceX. Last year he became the first private citizen to perform a spacewalk.  Although he has wide support within the US space industry, he remains a controversial figure in Republican circles, and still needs to be approved in a Senate hearing. Isaacman doesn't appear to hold a grudge over his job offer being cancelled last time round. He said on X: \"Thank you, Mr President @POTUS, for this opportunity. It will be an honor to serve my country under your leadership. \"The support from the space-loving community has been overwhelming. \"I am not sure how I earned the trust of so many, but I will do everything I can to live up to those expectations.\" If Isaacman is cleared to take up the job, he faces the daunting task of putting the US space programme back on track and beating China in a new space race to land astronauts on the moon. Read more from Sky News:'Trump's worst nightmare' wins New York electionUS plane crash leaves at least seven deadFormer US vice president Dick Cheney dies The Artemis programme has been seriously delayed. That's partly because of problems with the Orion capsule that will take astronauts to and from lunar orbit, but largely because the SpaceX Starship mega-rocket that is supposed to then shuttle the crew down to the surface has struggled to even orbit Earth. Sean Duffy, the temporary NASA chief and former reality TV star, recently criticised the tardy development of Starship and said he would reopen the contract for the lunar landing to SpaceX competitors. Musk responded on X: \"The person responsible for America's space program can't have a 2 digit IQ.\" Isaacman supports the Artemis mission, although his commitment is unclear to the NASA-developed SLS rocket that is due to launch on its first crewed test flight around the moon next year. He said he wants \"more astronauts in space with greater frequency\" and signalled that commercial companies could increasingly take over some NASA activities while it refocused funding on \"the near-impossible that no one else will work on like nuclear electric propulsion\"."
    },
    {
        "title": "'Posh boys' playing gangsters: Eddie Marsan on TV and film industry’s obsession with upper-class actors",
        "description": "Over the last two decades, Eddie Marsan has established himself as one of Britain's most versatile and acclaimed character actors. From major blockbusters like the Sherlock Holmes films and Mission: Impossible III, to his roles on the TV series Ray Donovan, and more recently the sci-fi drama Supacell.",
        "url": "https://news.sky.com/story/posh-boys-playing-gangsters-eddie-marsan-on-tv-and-film-industry8217s-obsession-with-upper-class-actors-13464383",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-eddie-marsan-actor_7072897.jpg?20251105150821",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-11-05 14:10:00",
        "Headline": "\"If you want to be an actor in this country, and you come from a disadvantaged background, you have to be exceptional,\" says Marsan, who argues people like Laurence Fox fear greater representation on screen will \"level the playing field\".",
        "Content": "\n          Arts and entertainment correspondent\n        Over the last two decades, Eddie Marsan has established himself as one of Britain's most versatile and acclaimed character actors. From major blockbusters like the Sherlock Holmes films and Mission: Impossible III, to his roles on the TV series Ray Donovan, and more recently the sci-fi drama Supacell. As a performer, he is a skilled observer. And one thing he's come to notice a lot over the years is how few of his castmates tend to share his working-class roots. \"If you want to be an actor in this country, and you come from a disadvantaged background, you have to be exceptional to have a hope of a career,\" he says. \"If you come from a privileged background, you can be mediocre.\" Speaking after being named one of the new vice presidents of drama school Mountview, and meeting students at the establishment where he too first trained, Marsan is keen to stress why it's so necessary to support young actors who can't fund their careers. \"I came here when I was in my 20s… I was a bit lost, to be honest… I was serving an apprenticeship as a printer when Mountview offered me a place,\" he says. \"There were no kinds of grants then, so for the first year an East End bookmaker paid my fees, then my mum and him got together and paid the second year, then Mountview gave me a scholarship for the third year, so I owe them everything. \"I didn't earn a living as an actor for like six, seven years… years ago, actors could sign on and basically go on the dole while doing plays… now, in order to become an actor, you have to have the bank of mummy and daddy to bankroll you for those seven or eight years when you're not going to earn a living.\" Marson and Dame Elaine Paige are both taking on ambassadorial roles to mark Mountview's 80th anniversary, joining Dame Judi Dench, who has been president of the school since 2006. \"The parties are fantastic,\" he jokes. \"The two dames, they get so half-cut, honestly, you have to get an Uber to get them home!\" But he's rather more serious about TV and film's \"fashion for posh boys\". \"When I went to America and I did 21 Grams and Vera Drake. I remember thinking, 'great I'm going to have a career now,' but I wasn't the idea of what Britain was selling of itself. \"Coming back from Hollywood, a publicist said to me 'when we get to London and do publicity for the film 21 Grams we're going to come to you'… but no one was interested… I remember coming to Waterloo station and looking up and seeing all these posh actors selling Burberry coats and posters, and they hadn't done anything compared to what I'd done, and yet they were the image that we were pushing as a country.\" Read more from Sky News:Diary collection wins prestigious non-fiction prizeBeckham receives knighthood at Windsor Castle A 2024 Creative Industries, Policy, and Evidence Centre report found 8% of British actors come from working class backgrounds, compared to 20% in the 70s and 80s. \"Even a gangster movie now, 40 years ago you would have something like The Long Good Friday or Get Carter with people like Michael Caine or Bob Hoskins who were real working-class actors playing those parts, now you have posh boys playing working-class characters.\" Within the last five or six years, he says there has at least been \"more of an effort to include people of colour\". 'They're scared of a level-playing field' \"What I find really interesting is, I've been an actor for 34 years, and I remember for the first 20 years going on a set and very rarely within the crew and within the cast would you see a black face, very rarely. \"One of the saving graces really are things now like Top Boy and Supacell, where you have members of the black community making dramas about their communities, that can't be co-opted by the middle classes.\" \"People like Laurence Fox complaining that it's unfair, I never heard them complain when you never saw a black face, never once did they say anything. Now that people are trying to address it, they think it's unfair…because they're scared of a level playing field.\" Now, more than ever, Marsan says he feels compelled to point out what needs to change within the industry he works in. \"Look, social media is destroying cultural discourse. It's making people become very binary… acting and drama is an exercise in empathy and if there's one thing that we need more of at the moment it's that.\""
    },
    {
        "title": "Joey Barton's posts 'caused me sleepless nights', says Jeremy Vine",
        "description": "Broadcaster Jeremy Vine has told a jury he felt \"wickedly torn down for no reason\" by ex-footballer Joey Barton, whose online posts led him to take civil action.",
        "url": "https://news.sky.com/story/jeremy-vine-tells-jury-he-felt-wickedly-torn-down-by-joey-barton-posts-13464462",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-jeremy-vine-court-joey-barton_7072603.jpg?20251105102737",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-05 16:48:00",
        "Headline": "The broadcaster says the ex-footballer's posts about him and other commentators led him to take civil action as he \"began to feel scared\" for his safety.",
        "Content": "Broadcaster Jeremy Vine has told a jury he felt \"wickedly torn down for no reason\" by ex-footballer Joey Barton, whose online posts led him to take civil action. The TV and radio presenter said he intervened to support football commentators Lucy Ward and Eni Aluko after Barton shared an image online of their faces superimposed on to a photograph of notorious serial killers Fred and Rose West. After a televised FA Cup match between Crystal Palace and Everton in January 2024, the former Manchester City and Newcastle United footballer likened the sports broadcasters to the \"Fred and Rose West of commentary\". Responding to the comment, Vine said on X: \"What's going on with @Joey7Barton? I just glanced at the Rose West thing... genuinely, is it possible we are dealing with a brain injury here?\"  'I was quite shocked' Giving evidence on Wednesday, Vine said: \"I was quite shocked by what Mr Barton had said about two very respected commentators in Lucy Ward and Eni Aluko. \"I thought it was very vicious to impose them on the images of two mass murderers of children, and I was looking for an explanation. \"I said 'are we dealing with a brain injury here' as a way of underlining my own feelings that he had crossed the line on that tweet.\" Barton, 43, is currently standing trial at Liverpool Crown Court, accused of posting grossly offensive messages on X aimed at the three broadcasters, allegedly with the intent to cause distress or anxiety. The court heard that Mr Barton replied to Vine's tweet with a post referring to him as \"you big bike nonce\". The defendant, who has 2.7 million followers on X, also made references to convicted child sex offender Jeffrey Epstein. 'This now gets really serious' Vine told the prosecutor he felt \"very alarmed\" that Mr Barton was choosing \"this word 'nonce' to throw around\" and that \"this was now escalating\". \"This now gets really serious. He is accusing me of being a paedophile,\" he said. \"These are disgusting actions. It's a despicable thing to say. \"It gravely upset me, and I had a sleepless night that night.\" As more posts followed, Vine \"began to feel scared\". Read more from Sky News:How many prisoners are released by mistake in the UK?Migrant sent back to France for second time in two months Vine said: \"I realised I had to take some action, but I was not sure what to do. I realised the quickest remedy would be some sort of civil action.\" Civil proceedings were initiated in March 2024. A week later, a post from Mr Barton's X account stated: \"If anyone has any information about Jeremy Vine - pictures, screenshots, videos, or messages that could help us in the case - please send them to me using the hashtag #bikenonce.\" Jurors heard that in June 2024, Barton agreed to pay Mr Vine £75,000 in damages for defamation and harassment, along with his legal expenses, as the two parties reached a settlement in the civil case. In a separate agreement, Barton also paid Vine an additional £35,000 in damages and legal costs relating to similar issues. The court was told that Mr Barton issued a public apology on his X account in June 2024, admitting that he had made a \"very serious allegation\" on social media. He denies the offences said to have been committed between January and March 2024."
    },
    {
        "title": "Helen Garner's 'unsparing' diary collection becomes first to win prestigious Baillie Gifford non-fiction prize",
        "description": "A writer, whose \"candid\" and \"unsparing\" diaries have become the first to ever win the prestigious Baillie Gifford Prize for Non-Fiction. has told Sky News she is \"delighted\" to see the literary format recognised rather than dismissed.",
        "url": "https://news.sky.com/story/helen-garners-unsparing-diary-collection-becomes-first-to-win-prestigious-baillie-gifford-non-fiction-prize-13464269",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-helen-garner-baillie-gifford-prize_7072604.jpg?20251105103303",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-05 10:33:00",
        "Headline": "How To End A Story charts 20 years of Australian writer Helen Garner's life, from publishing her debut novel in the 1970s to the collapse of her marriage in the 1990s.",
        "Content": "A writer, whose \"candid\" and \"unsparing\" diaries have become the first to ever win the prestigious Baillie Gifford Prize for Non-Fiction. has told Sky News she is \"delighted\" to see the literary format recognised rather than dismissed. Helen Garner, an acclaimed Australian author and diarist whose celebrity fans include singer Dua Lipa and fellow writer David Nicholls, said that diaries, often written by women, tended to be given \"short shrift\" in the literary industry. She has now won the Baillie Gifford award for How To End A Story, a collection which charts 20 years of her life, from publishing her debut novel while raising a young daughter in the 1970s to the disintegration of her marriage in the 1990s. Judges hailed her as a \"brilliant observer and listener\" and described the diaries as a \"recklessly candid, unsparing, occasionally eye-popping account of the implosion of a marriage\". Speaking to Sky News' Sophy Ridge and Wilfred Frost on the new Mornings with Ridge and Frost programme, Garner, 82, said: \"My main reason to be delighted is that I think diaries have been given short shrift in literature. I think they are literature. \"Because they were often written by women, they used to be dismissed as just sort of verbal sludge that people... sort of lazily wrote down, but in actual fact to keep a decent diary involves as much hard work as writing a full-on book - in my experience, anyway. So I'm really glad that it's been recognised.\" Garner was named winner of the £50,000 prize at a ceremony in London on Tuesday, and accepted her award via video link from Melbourne, Australia. Journalist Robbie Millen, who chaired the prize jury, said her \"addictive\" book was the unanimous choice of the six judges. \"Garner takes the diary form, mixing the intimate, the intellectual, and the everyday, to new heights,\" he said, comparing her to Virginia Woolf in the canon of great literary diarists. \"There are places it's toe-curlingly embarrassing. She puts it all out there.\" 'The mess my life became is not unique' Garner, who has published novels, short stories, screenplays and true crime books, told Sky News she has been surprised to hear from so many readers who have related to her words and most intimate thoughts. \"People have said to me, 'this could be my marriage',\" she said. \"I found that rather shocking because it's quite a painful story of a marriage collapsing, starting off with love, but then developing over the years into something painful and destructive. \"I've been glad to find that I'm not unique in that way, that the mess that I made in my life, the mess that my life became, it's not unique. In fact, it's archetypal. It's something that's happened to gazillions of people in the history of the world.\" Asked by Ridge if the book would have been a \"difficult read\" for her ex-husband, Garner replied: \"I don't know, I haven't spoken to him for approximately 25 years. We won't be speaking to each other again, I imagine. And if you've read the diary, you'll see why.\" Jason Burke's The Revolutionists: The Story Of The Extremists Who Hijacked The 1970s Richard Holmes's The Boundless Deep: Young Tennyson, Science And The Crisis Of Belief Justin Marozzi's Captives And Companions: A History Of Slavery And The Slave Trade In The Islamic World Adam Weymouth's Lone Wolf: Walking The Faultlines Of Europe Frances Wilson's Electric Spark: The Enigma Of Muriel Spark How To End A Story is the first set of diaries to win the Baillie Gifford Prize, which was founded in 1999 and recognises English-language books in current affairs, history, politics, science, sport, travel, biography, autobiography and the arts. It was selected from more than 350 books published between 1 November 2024 and 31 October 2025."
    },
    {
        "title": "Malaysian rapper detained in murder investigation of Taiwanese influencer",
        "description": "Malaysian rapper and filmmaker Namewee has been detained in connection with the murder of a Taiwanese social media influencer.",
        "url": "https://news.sky.com/story/malaysian-rapper-detained-in-murder-investigation-of-taiwanese-influencer-13464267",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-wee-meng-chee-rapper_7072553.jpg?20251105093616",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-05 11:06:00",
        "Headline": "Namewee denies any wrongdoing and vows to help police investigating the death of Iris Hsieh, who was found in a hotel bathtub in Kuala Lumpur last month.",
        "Content": "Malaysian rapper and filmmaker Namewee has been detained in connection with the murder of a Taiwanese social media influencer. Namewee, whose real name is Wee Meng Chee, surrendered to police on Wednesday and will be placed under remand for six days, his lawyer Joshua Tay said. Nurse turned model Iris Hsieh, who had more than half a million followers on Instagram and also operated an OnlyFans account, was found dead in a hotel bathtub in Kuala Lumpur on 22 October. According to local media reports, police said Wee was the last person seen with her before her death. The 31-year-old, whose real name was Hsieh Yu-hsin, was known as Nurse Goddess by her fans. Police said she arrived in Malaysia on 20 October for a four-day trip. Officers are waiting for the full post-mortem and toxicology reports before releasing the official cause of her death, local media reported. Namewee was briefly detained at the time and separately charged for drug possession and use - allegations he denied. He said he was deeply saddened by Hsieh's death and denied any wrongdoing. In an Instagram post after surrendering to police, the 42-year-old vowed to co-operate with the investigation. Read more from Sky News:'Trump's worst nightmare' wins New York electionUS plane crash leaves at least seven dead Controversial artist Namewee is known for his satirical lyrics and videos on topics including politics, race and religion. In 2016, he was arrested over his music video Oh My God following complaints it was disrespectful to Islam. He released a track with Australian singer Kimberley Chen in 2021 that poked fun at Chinese nationalists and touched on sensitive topics, such as Taiwan's sovereignty. The pair were banned from entering China and the song was removed from all Chinese platforms."
    }
]