[
    {
        "title": "Hamas names three Israeli hostages it says it will release on Saturday",
        "description": "Hamas has released the names of three Israeli hostages it says it will release on Saturday in the fifth such swap of a fragile ceasefire in Gaza.",
        "url": "https://news.sky.com/story/hamas-names-three-israeli-hostages-it-says-it-will-release-on-saturday-13304815",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-eli-sharabi-ohad-ben-ami_6822457.jpg?20250207174408",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-07 16:54:00",
        "Headline": "The latest hostage release and prisoner exchange will happen in the shadow cast by US President Donald Trump's comments about taking over Gaza.",
        "Content": "Hamas has released the names of three Israeli hostages it says it will release on Saturday in the fifth such swap of a fragile ceasefire in Gaza. The hostages are Eli Sharabi, Ohad Ben Ami and Or Levy, Hamas armed wing spokesperson Abu Obeida said in a Telegram post. An Israeli official confirmed Israel had received the three names from Hamas. In return for the captives' release, Hamas said it expects 183 Palestinian prisoners to be released. Both Mr Ami, 56, and Mr Sharabi, 52, were taken from Kibbutz Be'eri during the 7 October attack. The cross-border attack saw around 1,200 Israelis killed and around 250 people taken hostage. Mr Levy, 34, was abducted from the Nova music festival. Of the Palestinian prisoners being freed, 18 have been serving life sentences, 54 were serving long sentences and the vast majority, 111, were detained in Gaza during the war. Eli Sharabi Mr Sharabi's wife Lianne Sharabi was born in Bristol. She, along with their children, 16-year-old Noiya and 13-year-old Yahel, were killed in the 7 October attack. His brother Yossi was also killed after being taken hostage. In a statement after news he would be released was announced, Mr Sharabi's lawyers said: \"The Sharabi family has already lost too much,\". It added: \"It is long past time to bring Eli home.\" Or Levy Mr Levy was captured by militants from a bomb shelter near the Nova music festival. His wife Einav was killed during the 7 October attack. Their son Almog, a toddler, is staying with his grandparents. Mr Levy is from the city of Rishon Lezion, where he worked as a computer programmer.  Some of Mr Levy's family previously spoke about his kidnapping and the death of his wife. Speaking around Hanukkah last year, his brother Michael Levy told Sky News's Yousra Elbagir: \"I have three little girls but it won't be the same. Hanukkah is a happy holiday - you light candles, you sing and eat all sorts of things but for us it is not a real holiday without Or.\" Ohad Ben Ami Mr Ben Ami, a father of three, was taken hostage with his wife Raz, who was released during the brief ceasefire period in November. His daughter Ella Ben Ami previously spoke to Sky News about missing her dad Mr Ami, as she pleaded for his release. \"On the eve of Christmas, on the 24 December, it will be his birthday, and I don't want to celebrate it without him,\" she told Sky News in 2023. Ms Ami was previously one of the first to tell the world what happened on 7 October, calling an Israeli TV channel while hiding.  Row over aid access Earlier on Friday, Hamas accused Israel of breaching the ceasefire accord and held off announcing the names of the Israeli hostages until the deadline had passed. The militant group claimed Israel delayed the entry of hundreds of trucks carrying food and other humanitarian supplies agreed under the truce deal and held back all but a fraction of the tents and mobile homes needed to provide people shelter in the devastated enclave. \"This demonstrates clear manipulation of relief and shelter priorities,\" Hamas said in a statement.  👉 Follow Trump 100 on your podcast app 👈 COGAT, the Israeli military agency that is overseeing the aid deliveries into Gaza, denied the accusation. It added Israel would \"not tolerate violations by Hamas\". The claims and counter-claims highlight the fragility and uncertainty of the ceasefire.  This has been heightened by US President Donald Trump recently saying the US could take over Gaza and move the Palestinian population out. Israel's air and ground war in Gaza has killed more than 47,000 Palestinians, according to Gaza health officials, and displaced the majority of the strip's population. Read more:What's in the ceasefire deal?The Israel-Hamas war in numbers Fragile ceasefire deal So far, 13 of the 33 female, older male and child hostages set to be released in the first phase of the multi-phase agreement have returned to Israel. Five Thai hostages have also been released. Hundreds of Palestinian prisoners and detainees have been released in exchange, often returning to large crowds. Work on the second stage of the agreement, aimed at the release of around 60 male hostages and the withdrawal of Israeli troops from Gaza, has begun. An Israeli negotiating team was expected to fly to Doha on Saturday, according to media reports."
    },
    {
        "title": "'Let's do a deal': Zelenskyy touts Ukraine's rare earth stores to Trump",
        "description": "Volodymyr Zelenskyy has told Donald Trump \"let's do a deal\" as he offered the US a partnership over Ukraine's stores of rare earth and minerals.",
        "url": "https://news.sky.com/story/lets-do-a-deal-zelenskyy-touts-ukraines-rare-earth-stores-to-trump-13304934",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-volodymyr-zelenskyy_6822644.jpg?20250207212217",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-07 20:13:00",
        "Headline": "Donald Trump has said he wants Ukraine to supply the US with critical resources in exchange for financial support in its war with Russia.",
        "Content": "Volodymyr Zelenskyy has told Donald Trump \"let's do a deal\" as he offered the US a partnership over Ukraine's stores of rare earth and minerals. Earlier this week, Mr Trump said he wanted Ukraine to supply the US with critical resources in exchange for financial support in its war with Russia. In an interview with Reuters on Friday, Mr Zelenskyy said: \"If we are talking about a deal, then let's do a deal, we are only for it.\" While emphasising that Kyiv was not proposing \"giving away\" its resources, he said he was open to a mutually beneficial partnership to develop them jointly. Ukraine-Russia war latest: Ukrainian forces seize land inside Russia Rare earths are a group of 17 metals that are vital in the production of high-performance magnets, electric motors and consumer electronics. Mr Zelenskyy touted the country's reserves of titanium and uranium as Europe's largest. \n                  Australian politician changes his name to 'Aussie Trump'\n                 \n                  Day 19: Can Elon Musk keep cutting the Federal government? \n                 \n                  Donald Trump sanctions International Criminal Court as he accuses it of 'abusing its power'\n                 According to the World Economic Forum, Ukraine also has the potential to become a key supplier of lithium, beryllium, manganese, gallium, zirconium, graphite, apatite, fluorite and nickel. Showing a map of Ukraine's mineral deposits, he then said Russia currently has control of less than 20% of the country's mineral resources - but that includes about half its rare earth deposits. \"Putin is not just grabbing them [minerals] along with the land, he is already thinking about how to get other partners in his alliance - North Korea, Iran... and he will give them access,\" Mr Zelenskyy said. \"This is very rich land. This does not mean that we are giving it away to anyone, even to strategic partners. We are talking about partnership... \"Let's develop this together, make money, and most importantly, it's about the security of the Western world.\" The Ukrainian president added that Kyiv and the White House were discussing the idea of using the country's underground gas storage sites to store American liquefied natural gas, calling it \"very interesting\". He also said he would like to discuss the US having priority when it came to rebuilding Ukraine, saying it would amount to \"a lot of money for business\". 'Not accepting Russia's ultimatums' He also insisted that Mr Trump must meet with him before he meets with the Russian president, \"otherwise it will look like a dialogue about Ukraine without Ukraine\". He added: \"I don't know what compromises can be discussed at the negotiating table, we have not reached that point... \"It is important for people to understand that Ukraine is negotiating, not accepting ultimatums from Russia.\" He also stressed Ukraine's need for security guarantees from its allies as part of any settlement. It comes as Mr Trump said he may meet with Mr Zelenskyy in the White House as early as next week. The two last met in New York in September last year. Mr Trump also repeated his interest in meeting the Russian president with whom he said he always had a \"good relationship\". Speaking to reporters while meeting with Japanese Prime Minister Shigeru Ishiba, Mr Trump said: \"I'd like to see it end, just on a human basis. I'd like to see that end. It's a ridiculous war.\" Read more:Ukraine peacekeeping force without US troops would be 'mistake'Lammy promises £55m for Ukraine during visit Mr Zelenskyy also told Reuters in his interview that thousands of North Korean soldiers have now returned to fight Kyiv's forces in the Kursk region of Russia. A Ukrainian special forces commander told Sky News last month that it appeared that North Korean troops had been temporarily pulled back from the frontline after heavy losses. The commander, who went by the codename \"Puls,\" claimed the forces had been seen blowing themselves up with grenades rather than risk capture."
    },
    {
        "title": "British couple found dead at house in southern France",
        "description": "A British couple have been found dead at a house in rural southwest France.",
        "url": "https://news.sky.com/story/british-couple-found-dead-at-house-in-southern-france-13304737",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-villefranche-de-rouergue_6822383.jpg?20250207155009",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-07 14:35:00",
        "Headline": "The bodies were reportedly discovered by a neighbour, with the couple said to be active in the local community and well-liked.",
        "Content": "A British couple have been found dead at a house in rural southwest France. Investigators are reportedly looking at whether they were killed during a burglary but all lines of inquiry are said to remain open. The identities of the victims have not been officially released but French news site La Depeche named them as Dawn and Andrew Searle. Their bodies were discovered on Thursday in the hamlet of Les Pesquies, near Villefranche-de-Rouergue, in the Aveyron department. French media reported they moved to the area about 10 years ago and were active in the local community. Mr Searle is said to have previously worked as an organised crime financial investigator in the UK. A LinkedIn profile in his name says he retired in 2015 after working for Barclays and Standard Life and was \"enjoying life in rural France\". \n                  Tomb of far-right French leader Jean-Marie Le Pen vandalised\n                 \n                  UK visitors will have to pay more to see the Mona Lisa in the Louvre in Paris than EU tourists as part of major renovation, Emmanuel Macron says\n                 \n                  British sailor missing after his damaged yacht found off French coast\n                 His page talks about \"over 20 years experience specialising in Financial Crime Prevention (AML, Fraud and Anti-Bribery) with a high profile in the industry and an extensive network of contacts\". Read more from Sky News:Two dead after plane crashes into busy roadPolitician changes his name to 'Aussie Trump' Police, gendarmerie, forensics officers and the public prosecutor were at the scene on Thursday, France3 reported. It said a neighbour discovered their bodies and quoted the local mayor as saying they were a popular couple who had dogs and got on with everyone. A Foreign Office spokesperson told Sky News: \"We are supporting the family of a British couple who died in France and are liaising with the local authorities.\""
    },
    {
        "title": "Apple ordered by UK government to let it access users' encrypted data - reports",
        "description": "Apple has reportedly been ordered by the UK government to allow it access to encrypted data stored by the company's users worldwide in its cloud service.",
        "url": "https://news.sky.com/story/apple-ordered-by-uk-government-to-let-it-access-users-encrypted-data-reports-13304724",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-apple-store-new-york_6822415.jpg?20250207163535",
        "type": "Home",
        "Author": "Tim Baker",
        "Date Published": "2025-02-07 14:05:00",
        "Headline": "The government will not confirm or deny the existence of the order. There are concerns that breaking encryption could allow bad actors to access people's data, and pave the way for countries like China to make similar demands.",
        "Content": "\n          Political reporter\n       Apple has reportedly been ordered by the UK government to allow it access to encrypted data stored by the company's users worldwide in its cloud service. At the moment, only the Apple account holder can access such data - not even the US technology giant can see it. Apple, which makes iPhones, iPads and iMacs, has been issued with a Technical Capability Notice (TCN), the Washington Post and BBC are reporting. This order, which does not get published, is said to require a blanket ability for the government to view people's encrypted data - both in the UK and abroad. The Home Office will not confirm or deny the existence of the order. Apple has been approached for comment. Getting technology companies to break encryption has long been a contentious issue in the UK government. Ministers have argued they want to use it for purposes like protecting children, identifying criminals and keeping the public safe. \n                  Apple suspends AI-generated news summaries after criticism over misleading notifications\n                 \n                  Apple AI feature 'must be revoked' over notifications misleading users, say journalists\n                 \n                  Severance star Adam Scott on balancing Hollywood fame with family life: 'Everything's a challenge at some point'\n                 What are the concerns? Opponents say it is a breach of privacy. They also highlight the risk to whistleblowers and journalists, and point out that any tool the government has to break into people's information has a danger of being hijacked by bad actors. There are also concerns that, if implemented, the UK's order could lead nations like China to force Western companies to break their users' privacy. 'Advanced Data Protection' On Apple products, users have the option to use Advanced Data Protection (ADP). The UK government's demand applies to all content stored using ADP, which means certain data can only be decrypted by the user. Apple promises that even a cloud data breach would not make the information readable. Users are also told that Apple cannot see the data due to the end-to-end encryption used to share the information. End-to-end encryption means that messages and data sent between two devices can only be read by the person they are sent to - and are scrambled if anyone else tries to intercept or access them. The debate stretches as far back as 2017, when then home secretary Amber Rudd stated that \"I don't need to understand how encryption works\" to want it broken. The order from the UK government was made under the UK Investigatory Powers Act 2016, according to The Washington Post. The act says the orders can be applied to companies outside the UK. There are avenues for Apple to appeal against the TCN, but this process would not be made public. Read more:Encryption 'put children at risk'A 'disaster' for counter-terrorism The Labour government has been outspoken in its desire to target social media and technology companies while in power. This includes recently trumpeting its plans to be the first country in the world to create a new AI sexual abuse offence to punish those generating and facilitating the creation of AI child sexual abuse images. And Home Secretary Yvette Cooper has criticised social media companies for not being fast enough to take down videos previously viewed by Southport killer Axel Rudakubana. Last year, Apple provided written evidence to MPs on its many oppositions to the Investigatory Powers Act and TCNs. It noted that the law gives the UK government the power to \"act as the world's regulator\" of security technology - something which could put it at odds with authorities like the European Union and the United States. Order would 'undermine human rights' The American company also said that an order to force decryption would \"undermine fundamentally human rights\" and potentially put the UK at odds with the European Court of Human Rights. \"There is no reason why the [UK government] should have the authority to decide for citizens of the world whether they can avail themselves of the proven security benefits that flow from end-to-end encryption,\" Apple said. It added: \"Moreover, any attempt by the [secretary of state] to use its extraterritorial powers to compel technology companies to weaken encryption technology will only strengthen the hands of malicious actors who seek to steal and exploit personal data for nefarious purposes.\" 👉 Listen to Sky News Daily on your podcast app 👈 A spokesperson for privacy and civil liberty campaign group Big Brother Watch said: \"We urge the UK government to immediately rescind this draconian order and cease attempts to employ mass surveillance in lieu of the targeted powers already at their disposal.\" A Home Office spokesperson said: \"We do not comment on operational matters, including for example confirming or denying the existence of any such notices.\""
    },
    {
        "title": "Teenager guilty of killing former friend after confessing to girl he knew online",
        "description": "A teenager has been found guilty of killing a 15-year-old boy in east London after he confessed to a girl he knew online while she was in Nando's.",
        "url": "https://news.sky.com/story/teenager-guilty-of-killing-former-friend-after-confessing-to-girl-he-knew-online-13304853",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-pharrell-garcia-hackney_6639181.jpg?20240725190048",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-07 18:17:00",
        "Headline": "The 16-year-old chased and stabbed former friend Pharrell Garcia once in the heart with a multi-tool pocketknife in Hackney last July.",
        "Content": "A teenager has been found guilty of killing a 15-year-old boy in east London after he confessed to a girl he knew online while she was in Nando's. The 16-year-old, who cannot be named for legal reasons, was found guilty of manslaughter at the Old Bailey on Friday. He had chased and stabbed former friend Pharrell Garcia once in the heart with a multi-tool pocketknife in Stellman Close, Hackney, on 23 July last year. After Pharrell collapsed in the street, the killer fled and threw away the knife, the court heard. Members of the public and paramedics had tried to save the 15-year-old, but he died at the scene. The teenager then told a girl he knew online that he killed Pharrell by \"accident\". 'I think I just killed Pharrell' The court heard that on the day of the killing, the teenager called her and said: \"I'm fighting Pharrell today.\" \n                  Former government intelligence contractor charged under Official Secrets Act over 'damaging' disclosures\n                 \n                  Chelsea striker Sam Kerr tells court she was 'trapped' in taxi before window was smashed\n                 \n                  Two dogs die and two homes gutted in separate e-bike and e-scooter fires\n                 She tried to dissuade him but later that day she said she received a call while she was in Nando's. She told police: \"I'm at Nando's with my nan and then [the teenager] calls me and he's like 'I think I just killed Pharrell'\". \"I was like 'don't lie' because I didn't believe it,\" she added. \"Like I was pretty shocked... \"He was like 'I think I just killed Pharrell. I stabbed him in the heart by accident, but I was meant to stab his leg'.\" Read more:Grenfell Tower to be demolished, government confirmsBritish couple found dead at house in rural France The Metropolitan Police arrested the killer at a family friend's house early on 24 July. Analysing his mobile phone, officers found 43 videos and photos of the teenager playing with knives from a week before the stabbing. He had also messaged his mother after the attack to say he could not go home, to remove certain items from their home, and to ask if he could go to Portugal. The teenager admitted stabbing the 15-year-old but claimed it was in self-defence after getting the knife off him - a claim detectives and the jury disputed. In a prepared statement he gave to police after his arrest, the teenager said Pharrell \"approached me on Tuesday and told me, again, he had a problem with me. He pulled a knife out of his sock and went to attack me\". \"I was scared for my life and acted instinctively to defend myself.\" The jury found the teenager not guilty of murder. Judge Philip Katz KC remanded him into custody ahead of sentencing on 17 April."
    },
    {
        "title": "Sweden school shooting: All 11 people who died have been identified by police - as local media name second victim",
        "description": "All 11 people who died in a shooting at a school for adults in Sweden have been identified by police but they have not yet released the names.",
        "url": "https://news.sky.com/story/sweden-school-shooting-all-11-people-who-died-have-been-identified-by-police-as-local-media-name-second-victim-13304800",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-flowers-tribute-sweden_6820935.jpg?20250206081038",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-07 16:21:00",
        "Headline": "The mass shooting in Orebro on Tuesday has been described by Sweden's prime minister as the worst in the country's history.",
        "Content": "All 11 people who died in a shooting at a school for adults in Sweden have been identified by police but they have not yet released the names. It comes as local media named a second victim in the attack as a father of two, who was a baker. Eleven people, including the 35-year-old suspect, were killed in the incident at the Campus Risbergska school in Orebro on Tuesday - described by Sweden's prime minister Ulf Kristersson as the worst shooting in the country's history. Police previously said they believe the attacker may have attended the adult education centre, while local media named the suspected perpetrator as Rickard Andersson. On Friday, Sweden's police authority, Polisen, said it had identified the 10 victims - seven women and three men - as well as the suspect who later turned the gun on himself. It said in a statement that all 11 people killed were from Orebro County. The authority added that \"each death constitutes an individual investigation\". The seven women killed were aged 32, 38, 46, 52, 54, 55 and 68, while the four men were aged 28, 31, 35 and 48. \n                  Orebro attack: Victim of Sweden shooting rang fiancee one last time to tell her he loved her\n                 \n                  Orebro shooting: Gunman had links with education centre where he killed 10 people, Swedish police say\n                 \n                  Orebro attack: Mass shooting survivor describes moment he escaped classroom\n                 Second victim named by local media Meanwhile, local news broadcaster SVT named Bassam al Sheleh, a father of two, as one of the 10 victims. It reported the 48-year-old worked as a baker and studied at Campus Risbergska to improve his Swedish. Pierre Al Hajj, who also worked at the bakery, told SVT: \"The customers miss him. They've been in and asked about him yesterday and today. \"They don't want to eat anymore. They have completely lost their appetite.\" Salim Iskef, a newly engaged nursing assistant, was named by local media on Thursday as one of the victims. Sky News' Swedish partner TV4 reported that after being shot, Mr Iskef managed to call his fiancee one final time. \"He said he loved me so much\", his partner Kareen Elia told the broadcaster. \"I can't describe the feelings. We were supposed to get married on July 25.\" She added that, after he called her while lying on the floor, she could not understand what she was seeing on FaceTime and was in shock. It also comes as Sweden's government announced plans to tighten gun control after the shooting, including changing the vetting process for people applying for gun licences and clamping down on some semi-automatic weapons. Read more from Sky News:Politician changes name to 'Aussie Trump'River in Argentina turns bright red Sweden's justice minister said the AR-15 assault rifle - which has been used in mass shootings in the US - was the kind of gun the government wants to ban. Gunnar Strommer said: \"In light of the horrible shooting in Orebro earlier this week we believe that the right balance is to roll back the regulation and prohibit that kind of weapon.\""
    },
    {
        "title": "Woman arrested on suspicion of using 'wigs and disguises' to take immigration test for others",
        "description": "A woman has been arrested on suspicion of using multiple disguises to fraudulently pose as 12 other people to help them pass a UK immigration test.",
        "url": "https://news.sky.com/story/woman-arrested-on-suspicion-of-using-wigs-and-disguises-to-take-immigration-test-for-others-13304730",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-woman-immigration-disguises_6822301.jpg?20250207161403",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-07 14:23:00",
        "Headline": "It is alleged the woman completed the Life in the UK test at a number of centres across the UK, disguising herself and doctoring ID documents to evade detection from authorities.",
        "Content": "A woman has been arrested on suspicion of using multiple disguises to fraudulently pose as 12 other people to help them pass a UK immigration test. The 42-year-old, who has not been named, has been accused of giving the applicants an \"unfair advantage\" in the Life in the UK test, the Home Office said. It is alleged she completed the tests at a number of centres across the UK, disguising herself and doctoring ID documents to evade detection from authorities. The test is a requirement for anyone seeking to obtain indefinite leave to remain or naturalisation as a British citizen. It consists of 24 questions aimed at proving the applicant has sufficient knowledge of British values, history, and society. The Home Office said fraudsters completing the test for others could result in people being wrongly granted the right to remain in the country without proper due diligence, \"potentially putting the public at risk\". The woman was arrested at an address in Dartford, Kent, on Friday. \n                  Fraud suspect, 61, 'used wigs and disguises' to take citizenship tests for others, Home Office says\n                 \n                  Three men found guilty after people smuggling probe sparked by woman found in car glove box\n                 \n                  GPS-tagged asylum seeker trial ended with no benefit, Home Office says\n                 As officers executed a search warrant, a second woman was found hiding under a bed. The woman, in her 20s, was arrested on suspicion of entering the UK illegally. Several suspected false documents were also seized alongside a hoard of luxury goods, including designer handbags, watches and shoes suspected to have been purchased through proceeds of crime. Both women remain in custody as the investigation continues. Read more from Sky News:Grenfell Tower will be demolishedMan who shook partner's toddler to death jailed Chris Foster, criminal and financial investigation lead for London, accused the woman of using \"wigs and disguises\" to \"impersonate others and cheat the immigration system, showing a complete disregard for UK safety and immigration laws\". He added: \"We have been actively taking action against those involved in this type of crime and will continue to do so. Anyone who benefits from such fraud will face the consequences.\" Last week, a woman was arrested on suspicion of fraudulently completing the test for at least 14 people. Josephine Maurice, 61, of Enfield in north London, has been charged with 15 counts of fraud by false representation and two counts of possession of false documents in connection to the incident. She is currently remanded in custody."
    },
    {
        "title": "Wreckage found in Alaska for missing Bering Air plane carrying 10 people",
        "description": "A small plane which crashed in western Alaska with 10 people on board has been found and the US Coast Guard (USCG) says there were no survivors.",
        "url": "https://news.sky.com/story/wreckage-found-in-alaska-for-missing-bering-air-plane-carrying-10-people-13304491",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-alaska-plane-crash_6822741.png?20250208005934",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-07 07:06:00",
        "Headline": "It comes after dozens of people died in two major air accidents elsewhere in the US in recent weeks.",
        "Content": "A small plane which crashed in western Alaska with 10 people on board has been found and the US Coast Guard (USCG) says there were no survivors. The Bering Air flight left Unalakleet at 2.38pm on Thursday but contact was lost less than an hour later, the firm's operations director David Olson said. On Saturday, in a post on X, the coastguard said: \"USCG has ended its search for the missing plane after the aircraft was located approx 34 miles southeast of Nome. 3 individuals were found inside and reported to be deceased. \"The remaining 7 people are believed to be inside the aircraft but are currently inaccessible due to the condition of the plane. Our heartfelt condolences are with those affected by this tragic incident.\" The Cessna 208B Grand Caravan - carrying a pilot and nine adult passengers - was flying across Norton Sound when tracking site Flightradar24 reported it at 5,300ft before contact was lost. It was travelling from Unalakleet, a community of about 690 people in western Alaska, to Nome, a gold rush town just south of the Arctic Circle. The flight time is normally just under an hour. Mike Salerno, a spokesperson for the US Coast Guard, said rescuers were searching the aircraft's last known location by helicopter when they spotted the wreckage. They lowered two rescue swimmers to investigate. In a post on Facebook, Nome's fire department issued an update: \"The Nome Search and Rescue Team is spooling up with assistance from the Alaska Air National Guard with recovery efforts. \"From reports we have received, the crash was not survivable. Our thoughts are with the families at this time.\" On Friday, Lieutenant Benjamin McIntyre-Coble, from the Alaskan coastguard, explained that the plane suffered a rapid loss of altitude and speed, according to radar data, but did not expand on the potential cause. Read more from Sky News:Zelenskyy tells Trump 'let's do a deal'Trauma of using unregulated funeral directorsTravis Kelce: Taylor's Eras Tour 'excruciating' Weather in Unalakleet at take-off time was -8.3C (17F) with fog and light snow, according to the US National Weather Service. Bering Air serves 32 villages in western Alaska and air travel is often the only option of travelling long distances in rural parts of the US state, especially in winter. It comes soon after two major air accidents in the US in recent weeks. Sixty-seven people were killed when a jet and helicopter collided in Washington DC and seven died when a medical plane crashed in Philadelphia."
    },
    {
        "title": "Apple ordered by UK government to let it access users' encrypted data - reports",
        "description": "Apple has reportedly been ordered by the UK government to allow it access to encrypted data stored by the company's users worldwide in its cloud service.",
        "url": "https://news.sky.com/story/apple-ordered-by-uk-government-to-let-it-access-users-encrypted-data-reports-13304724",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-apple-store-new-york_6822415.jpg?20250207163535",
        "type": "UK",
        "Author": "Tim Baker",
        "Date Published": "2025-02-07 14:05:00",
        "Headline": "The government will not confirm or deny the existence of the order. There are concerns that breaking encryption could allow bad actors to access people's data, and pave the way for countries like China to make similar demands.",
        "Content": "\n          Political reporter\n       Apple has reportedly been ordered by the UK government to allow it access to encrypted data stored by the company's users worldwide in its cloud service. At the moment, only the Apple account holder can access such data - not even the US technology giant can see it. Apple, which makes iPhones, iPads and iMacs, has been issued with a Technical Capability Notice (TCN), the Washington Post and BBC are reporting. This order, which does not get published, is said to require a blanket ability for the government to view people's encrypted data - both in the UK and abroad. The Home Office will not confirm or deny the existence of the order. Apple has been approached for comment. Getting technology companies to break encryption has long been a contentious issue in the UK government. Ministers have argued they want to use it for purposes like protecting children, identifying criminals and keeping the public safe. \n                  Apple suspends AI-generated news summaries after criticism over misleading notifications\n                 \n                  Apple AI feature 'must be revoked' over notifications misleading users, say journalists\n                 \n                  Severance star Adam Scott on balancing Hollywood fame with family life: 'Everything's a challenge at some point'\n                 What are the concerns? Opponents say it is a breach of privacy. They also highlight the risk to whistleblowers and journalists, and point out that any tool the government has to break into people's information has a danger of being hijacked by bad actors. There are also concerns that, if implemented, the UK's order could lead nations like China to force Western companies to break their users' privacy. 'Advanced Data Protection' On Apple products, users have the option to use Advanced Data Protection (ADP). The UK government's demand applies to all content stored using ADP, which means certain data can only be decrypted by the user. Apple promises that even a cloud data breach would not make the information readable. Users are also told that Apple cannot see the data due to the end-to-end encryption used to share the information. End-to-end encryption means that messages and data sent between two devices can only be read by the person they are sent to - and are scrambled if anyone else tries to intercept or access them. The debate stretches as far back as 2017, when then home secretary Amber Rudd stated that \"I don't need to understand how encryption works\" to want it broken. The order from the UK government was made under the UK Investigatory Powers Act 2016, according to The Washington Post. The act says the orders can be applied to companies outside the UK. There are avenues for Apple to appeal against the TCN, but this process would not be made public. Read more:Encryption 'put children at risk'A 'disaster' for counter-terrorism The Labour government has been outspoken in its desire to target social media and technology companies while in power. This includes recently trumpeting its plans to be the first country in the world to create a new AI sexual abuse offence to punish those generating and facilitating the creation of AI child sexual abuse images. And Home Secretary Yvette Cooper has criticised social media companies for not being fast enough to take down videos previously viewed by Southport killer Axel Rudakubana. Last year, Apple provided written evidence to MPs on its many oppositions to the Investigatory Powers Act and TCNs. It noted that the law gives the UK government the power to \"act as the world's regulator\" of security technology - something which could put it at odds with authorities like the European Union and the United States. Order would 'undermine human rights' The American company also said that an order to force decryption would \"undermine fundamentally human rights\" and potentially put the UK at odds with the European Court of Human Rights. \"There is no reason why the [UK government] should have the authority to decide for citizens of the world whether they can avail themselves of the proven security benefits that flow from end-to-end encryption,\" Apple said. It added: \"Moreover, any attempt by the [secretary of state] to use its extraterritorial powers to compel technology companies to weaken encryption technology will only strengthen the hands of malicious actors who seek to steal and exploit personal data for nefarious purposes.\" 👉 Listen to Sky News Daily on your podcast app 👈 A spokesperson for privacy and civil liberty campaign group Big Brother Watch said: \"We urge the UK government to immediately rescind this draconian order and cease attempts to employ mass surveillance in lieu of the targeted powers already at their disposal.\" A Home Office spokesperson said: \"We do not comment on operational matters, including for example confirming or denying the existence of any such notices.\""
    },
    {
        "title": "British couple found dead at house in southern France",
        "description": "A British couple have been found dead at a house in rural southwest France.",
        "url": "https://news.sky.com/story/british-couple-found-dead-at-house-in-southern-france-13304737",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-villefranche-de-rouergue_6822383.jpg?20250207155009",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-07 14:35:00",
        "Headline": "The bodies were reportedly discovered by a neighbour, with the couple said to be active in the local community and well-liked.",
        "Content": "A British couple have been found dead at a house in rural southwest France. Investigators are reportedly looking at whether they were killed during a burglary but all lines of inquiry are said to remain open. The identities of the victims have not been officially released but French news site La Depeche named them as Dawn and Andrew Searle. Their bodies were discovered on Thursday in the hamlet of Les Pesquies, near Villefranche-de-Rouergue, in the Aveyron department. French media reported they moved to the area about 10 years ago and were active in the local community. Mr Searle is said to have previously worked as an organised crime financial investigator in the UK. A LinkedIn profile in his name says he retired in 2015 after working for Barclays and Standard Life and was \"enjoying life in rural France\". \n                  Tomb of far-right French leader Jean-Marie Le Pen vandalised\n                 \n                  UK visitors will have to pay more to see the Mona Lisa in the Louvre in Paris than EU tourists as part of major renovation, Emmanuel Macron says\n                 \n                  British sailor missing after his damaged yacht found off French coast\n                 His page talks about \"over 20 years experience specialising in Financial Crime Prevention (AML, Fraud and Anti-Bribery) with a high profile in the industry and an extensive network of contacts\". Read more from Sky News:Two dead after plane crashes into busy roadPolitician changes his name to 'Aussie Trump' Police, gendarmerie, forensics officers and the public prosecutor were at the scene on Thursday, France3 reported. It said a neighbour discovered their bodies and quoted the local mayor as saying they were a popular couple who had dogs and got on with everyone. A Foreign Office spokesperson told Sky News: \"We are supporting the family of a British couple who died in France and are liaising with the local authorities.\""
    },
    {
        "title": "Prince Andrew's former senior adviser made 'bad decision' when he provided legal statement in alleged Chinese spy case, tribunal hears",
        "description": "Prince Andrew's former senior adviser made a \"mystifying\" and \"very bad decision\" when he provided a legal statement for the case of an alleged Chinese spy, without taking any legal advice.",
        "url": "https://news.sky.com/story/prince-andrews-former-senior-adviser-made-bad-decision-when-he-provided-legal-statement-in-alleged-chinese-spy-case-tribunal-hears-13304810",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-andrew-yang-tengbo_6778100.jpg?20250207175031",
        "type": "UK",
        "Author": "Laura Bundock",
        "Date Published": "2025-02-07 16:44:00",
        "Headline": "The statement is yet to be made public, but court papers say it contains information about the Duke of York which is \"private, personal, sensitive and confidential\".",
        "Content": "\n          Royal correspondent\n              @laurabundock\n Prince Andrew's former senior adviser made a \"mystifying\" and \"very bad decision\" when he provided a legal statement for the case of an alleged Chinese spy, without taking any legal advice. An immigration tribunal heard how Dominic Hampshire displayed a \"lack of common sense\" when he agreed to give evidence for Yang Tengbo, who was banned from the UK in 2023 due to security concerns. The court heard how the intelligence services had contacted Mr Hampshire about Mr Yang back in 2022. Mr Yang was a \"close confidante\" of the Duke of York. The pair worked together but also met socially, including at events held at royal residences. Mr Yang helped set up Pitch@Palace China, a branch of the duke's scheme to help young entrepreneurs. Judges banned Mr Yang from the UK, saying his association with a senior royal had made Prince Andrew \"vulnerable\" and posed a threat to national security. Mr Yang challenged that decision at the Special Immigration Appeals Commission (SIAC). \n                  Day 15: Can Trump make Canada the 51st state?\n                 \n                  Canada and Mexico hit back with retaliatory tariffs on US as Donald Trump risks trade war\n                 \n                  China has avoided the same tariffs as Mexico and Canada for now - and is taking Trump in its stride\n                 A bid has been made to have several documents from that challenge made public, including a statement provided by Mr Hampshire. His lawyers argued he only agreed to the statement on the understanding it would remain private. They said he wouldn't have given some of the evidence if he'd known it would be made public. It is yet to be revealed exactly what is in the statement, although court papers say it contains information about the Duke of York which is \"private, personal, sensitive and confidential\". Read more: Who is Yang Tengbo? Prince Andrew has since said he cut off all ties with Mr Yang after \"concerns were raised\". Mr Yang says the allegations against him are \"entirely untrue\". He says the description of him as a spy is false and insists he has done \"nothing wrong or unlawful\". 👉 Listen to Sky News Daily on your podcast app 👈 Mr Yang and Mr Hampshire are fighting to keep the documents and redactions withheld from the public. Mr Yang's legal team said disclosing the documents \"would not enhance public understanding\" of the case. Judges at the tribunal have reserved their judgment for a later date."
    },
    {
        "title": "Charlene Hobbs: Fresh appeal for information about missing mum as new CCTV released",
        "description": "New CCTV footage has been released of a missing mum not seen for more than six months.",
        "url": "https://news.sky.com/story/charlene-hobbs-fresh-appeal-for-information-about-missing-mum-as-new-cctv-released-13304816",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-charlene-hobbs-wales_6773471.png?20241211162740",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-07 16:57:00",
        "Headline": "The 36-year-old has been missing from Cardiff for more than six months.  South Wales Police has released new CCTV footage as part of its ongoing search.",
        "Content": " New CCTV footage has been released of a missing mum not seen for more than six months. South Wales Police says a \"large-scale police search\" for Charlene Hobbs is ongoing and officers are confident \"answers lie in the community\". The last confirmed sighting of the 36-year-old was a photograph taken on a mobile phone at a house in the Adamsdown area of Cardiff at 6.07am on 24 July last year. Ms Hobbs, who has a distinctive dragon tattoo on her back, had her hair in a bun and was wearing a dark strapless top. The new footage released by officers shows Ms Hobbs at Morrisons Local in Adamsdown on the day before she was last seen. Police say they hope the release of the footage will lead to new information from the public. In a previous statement, Ms Hobbs's family said they were \"desperate\" to have her home. \"We have been out looking for you and will continue to do all we can to try to find you, and to understand what may have happened,\" they added. \n                  Colin Richards death: 18-year-old Corey Gauci denies murder of father-of-seven\n                 \n                  Cardiff University could lose up to 400 jobs as part of bid to 'secure long-term future'\n                 \n                  Cardiff: Watchdog probes police chase before fatal crash\n                 More than a thousand hours of public and private CCTV is being reviewed by officers after reports of possible sightings of Ms Hobbs. Police say they have made enquiries at over 250 addresses and taken statements from more than 50 people since the start of the investigation. Residents in the Splott and Roath areas of Cardiff have been asked to check their outbuildings and empty properties, in case Ms Hobbs has taken shelter there. Read more from Sky News:Cancer nurse struck off after 'financially grooming' patientGrenfell Tower will be demolished, government confirms Detective Chief Inspector Matt Powell, from South Wales Police, said: \"We remain determined to find Charlene, with specialist teams of officers and staff dedicated to this investigation who are focused on finding Charlene and returning her to her family.\" South Wales Police is asking anyone with information which could help find Ms Hobbs to get in touch."
    },
    {
        "title": "Greater Manchester Police detective jailed for sexual assaults on female colleagues",
        "description": "A police officer has been jailed for 18 months for sexual assaults on two female colleagues.",
        "url": "https://news.sky.com/story/greater-manchester-police-detective-jailed-for-sexual-assaults-on-female-colleagues-13304748",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-richard-mills-court_6822327.jpg?20250207145936",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-07 14:59:00",
        "Headline": "Richard Mills, 42, was found guilty of assaulting two female colleagues while at work at Greater Manchester Police.",
        "Content": "A police officer has been jailed for 18 months for sexual assaults on two female colleagues. Detective Sergeant Richard Mills, 42, was found guilty of assaulting the women while working at Greater Manchester Police (GMP) on two separate occasions over the past 10 years. He had worked at the force since 2006. Judge David Swinnerton said during sentencing that the officer was \"enabled\" and \"emboldened\" by a culture in the lower ranks of the force where \"you don't report bobbies\". He added on Friday the women had their \"mental health, careers and their lives blighted\" by Mills's actions. The judge then said: \"When police officers commit offences like this, or any other sort of offence, you undermine every other officer because it does damage public trust in police.\" Liverpool Crown Court heard Mills, a father-of-two whose wife was in the public gallery during sentencing, describe the office environment within the GMP as one where a number of people joked with \"sexualised banter\". Judge Swinnerton also noted that witnesses during the trial said Mills had conversations with \"sexual overtones\" with his colleagues. \n                  More British people than ever trapped in modern slavery - as Sky News joins police on abattoir raid\n                 \n                  Albie Speakman: Father says death of boy, 3, in farm vehicle incident has 'ruined my life'\n                 \n                  Jury in Rochdale child sexual exploitation trial discharged for legal reasons\n                 One victim told the court Mills put her hand on his crotch after talking to her about what kind of sex he liked and saying he was not \"getting it\" from his wife. The victim had told others about the incident but did not support an investigation into Mills at the time. He was then given a verbal warning and no misconduct hearing took place. On a separate occasion, a second victim said she \"froze\" when Mills put her hand on his crotch while in a room with other people. \"That added to her sense of shame and embarrassment that you felt enabled to do that in that room believing she would not say anything,\" the judge said. In a statement, read by prosecutor Robert Dudley, one of the victims told the court: \"How do you call the police about the police? \"I used to be such a happy, smiley and bubbly character and I feel the complete opposite. I just feel sad all the time.\" Read more from Sky News:Travel chaos after car crashes on rail linesGrenfell Tower to be demolished, government confirms Mills, of Wardle, Rochdale denies the charges. He was cleared of three other counts of sexual assault after his trial in December. Hunter Gray, defending, said in court Mills had shown insight into his previous conduct and was no longer \"the tactile person he was\". He added: \"He would say that what he saw as acceptable banter at the time he now appreciates was unacceptable, particularly in the modern environment, and he will change his approach.\" Speaking after the sentencing, GMP Detective Superintendent David Jones said that Mills \"gravely abused his position of trust and authority within the force\". He then praised the victims, adding: \"Their tenacity and strength shown throughout our investigation and legal proceedings is commendable and should be recognised as the driving force behind reaching today's outcome, whereby Mills is starting a jail term as a convicted sex offender.\""
    },
    {
        "title": "Woman arrested on suspicion of using 'wigs and disguises' to take immigration test for others",
        "description": "A woman has been arrested on suspicion of using multiple disguises to fraudulently pose as 12 other people to help them pass a UK immigration test.",
        "url": "https://news.sky.com/story/woman-arrested-on-suspicion-of-using-wigs-and-disguises-to-take-immigration-test-for-others-13304730",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-woman-immigration-disguises_6822301.jpg?20250207161403",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-07 14:23:00",
        "Headline": "It is alleged the woman completed the Life in the UK test at a number of centres across the UK, disguising herself and doctoring ID documents to evade detection from authorities.",
        "Content": "A woman has been arrested on suspicion of using multiple disguises to fraudulently pose as 12 other people to help them pass a UK immigration test. The 42-year-old, who has not been named, has been accused of giving the applicants an \"unfair advantage\" in the Life in the UK test, the Home Office said. It is alleged she completed the tests at a number of centres across the UK, disguising herself and doctoring ID documents to evade detection from authorities. The test is a requirement for anyone seeking to obtain indefinite leave to remain or naturalisation as a British citizen. It consists of 24 questions aimed at proving the applicant has sufficient knowledge of British values, history, and society. The Home Office said fraudsters completing the test for others could result in people being wrongly granted the right to remain in the country without proper due diligence, \"potentially putting the public at risk\". The woman was arrested at an address in Dartford, Kent, on Friday. \n                  Fraud suspect, 61, 'used wigs and disguises' to take citizenship tests for others, Home Office says\n                 \n                  Three men found guilty after people smuggling probe sparked by woman found in car glove box\n                 \n                  GPS-tagged asylum seeker trial ended with no benefit, Home Office says\n                 As officers executed a search warrant, a second woman was found hiding under a bed. The woman, in her 20s, was arrested on suspicion of entering the UK illegally. Several suspected false documents were also seized alongside a hoard of luxury goods, including designer handbags, watches and shoes suspected to have been purchased through proceeds of crime. Both women remain in custody as the investigation continues. Read more from Sky News:Grenfell Tower will be demolishedMan who shook partner's toddler to death jailed Chris Foster, criminal and financial investigation lead for London, accused the woman of using \"wigs and disguises\" to \"impersonate others and cheat the immigration system, showing a complete disregard for UK safety and immigration laws\". He added: \"We have been actively taking action against those involved in this type of crime and will continue to do so. Anyone who benefits from such fraud will face the consequences.\" Last week, a woman was arrested on suspicion of fraudulently completing the test for at least 14 people. Josephine Maurice, 61, of Enfield in north London, has been charged with 15 counts of fraud by false representation and two counts of possession of false documents in connection to the incident. She is currently remanded in custody."
    },
    {
        "title": "Prince William shown how to make 'tree hugger' during Angus trip",
        "description": "The Prince of Wales was shown how to make a \"tree hugger\" during a visit to Scotland as part of his efforts to break down any \"taboos and stigmas around mental health\".",
        "url": "https://news.sky.com/story/prince-william-shown-how-to-make-tree-hugger-during-angus-trip-13304865",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-prince-william-prince-williamtree-hugger_6822199.jpg?20250207205716",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-07 18:25:00",
        "Headline": "The Prince of Wales also met young farmers during his trip, saying it is important to break down any \"taboos and stigmas around mental health\" in the industry.",
        "Content": "The Prince of Wales was shown how to make a \"tree hugger\" during a visit to Scotland as part of his efforts to break down any \"taboos and stigmas around mental health\". Prince William tried his hand at putting together the unusual garden nesting boxes, which are invented and built by members of the work of Carnoustie and Monifieth Men's Shed in Angus. The group was founded in 2015 and is run by local volunteers who meet weekly to take part in a range of activities such as woodwork, crafting and gardening. Chairman Derek Stewart, 77, said he did not sleep the night before because of his excitement about meeting the royal. He said: \"A lot of the discussion was about mental wellbeing and how we deal with that and how we progress with that. \"It was such an honour to meet him. \"He's really down to earth, you can sit and talk to him, he puts you at ease as soon as you start talking to him.\" \n                  Prince William has 'the best day of my life' spraying pond water at journalists\n                 \n                  Kate hugs Holocaust survivors as King warns of 'dangerous re-emergence of antisemitism'\n                 \n                  Boxing, horse riding and meeting a therapy poodle - what the royals have been up to\n                 During Prince William's visit to Angus on Thursday, he also took part in a roundtable event hosted by the Farm Safety Foundation, a charity working to address attitudes to farm safety and mental health. At the event at East Scryne Farm, he met local members of the Scottish Association of Young Farmers Clubs. Read more from Sky News:King and Queen to meet Pope during state visit to ItalyPrincess Anne thanks hospital staff after horse accident The prince, who is known as the Duke of Rothesay in Scotland, discussed issues including available support and the role of social media in helping them stay connected with others. He said: \"I love the countryside and I love farming as well. \"And I am conscious that it's an area that needs maybe a little bit of support and understanding that there is access and support out there for young farmers, as well as making sure we are breaking down any taboos and stigmas around mental health. \"Because I think in the farming world it's maybe not talked about as much as in other sectors - and yet we know it exists. \"So, I particularly wanted to hear a little bit today about how all of you felt and hear it from the horse's mouth whether we're getting better at talking about it, whether you feel the support is out there, what your recollections and feelings are about rural isolation and mental health.\" The Duchy of Cornwall and Prince William launched a new mental health strategy for Duchy tenants in 2023 designed to prioritise farmers' mental health and de-stigmatise the issue within the sector. Stephanie Berkeley, manager of the Farm Safety Foundation (also known as Yellow Wellies), said the charity is a small organisation and it was wonderful to have the prince take an interest. She said: \"The young farmers are so enthusiastic and hard-working and they should be celebrated, so it's lovely to have someone like the prince come and listen. \"He was very interested in everything that the young farmers wanted to talk about.\""
    },
    {
        "title": "A look at Gino D'Acampo's meteoric rise - as he denies allegations against him",
        "description": "Gino D'Acampo has \"firmly\" denied allegations&#160;of inappropriate and intimidating behaviour on the sets of his TV shows.",
        "url": "https://news.sky.com/story/a-look-at-gino-dacampos-meteoric-rise-as-he-denies-claims-against-him-13304533",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gino-dacampo-chef-this-morning_6822172.jpg?20250207121311",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-07 08:53:00",
        "Headline": "D'Acampo is one of the most recognisable chefs on TV. He also has numerous cookbooks and restaurants to his name. But how has his career unfolded?",
        "Content": "Gino D'Acampo has \"firmly\" denied allegations of inappropriate and intimidating behaviour on the sets of his TV shows. The chef's actions, over a period of more than 12 years, were described by dozens of people as \"unacceptable\", \"distressing\" and \"horrendous\", according to an investigation by ITV News. Denying all the allegations, D'Acampo told ITV he \"would not do anything that I thought would upset or distress anyone\". He added: \"I am a father, husband... the suggestion that I have acted in an improper way against is deeply upsetting.\" With over 25 years of presenting experience, D'Acampo is one of the most recognisable chefs on TV. He also has numerous cookbooks and restaurants to his name. But how has his career unfolded? Who is he? Born in Torre del Greco, Naples, in southern Italy, D'Acampo learned to cook from his grandfather, according to his official website. He went on to train at Luigi De Medici catering college in Florence and made the move to London at the age of 18. His love of food led to him starting and co-owning Bonta Italia in 2003, which imports Italian produce to restaurants, supermarkets and manufacturers in the UK. This led to him appearing as a guest on the Good Food television channel and since 2009, he has been a regular on cooking segments on ITV's This Morning. Using what his website describes as \"cheeky wit\", the chef soon became known for his risqué comments and sexual innuendos. Also in 2009 the chef headed into the Australian jungle for I'm A Celebrity Get Me Out Of Here, where he was crowned king of the jungle, narrowly beating TV personality Kim Woodburn. Family life D'Acampo has been married to Jessica Stellina Morrison for nearly 25 years. The pair reportedly met when they were teenagers while they were both working at a restaurant in Marbella. They have three children together - Luciano, Rocci, and Mia. Television career Proving popular with viewers, D'Acampo started to host his own cookery shows, including Gino's Italian Escape, which over a number of series, sees him travelling around Italy in search of authentic recipes from his homeland. He also paired up with model Melanie Sykes for ITV's Lets Do Lunch in 2011, which saw him cook three recipes each episode while a celebrity guest be interviewed. In 2017, D'Acampo went head-to-head with fellow chef Gordon Ramsay and maitre d'hotel Fred Sirieix to produce a festive menu for people who work in the emergency services. The trio were a hit and reunited for travel and food series Gordon, Gino and Fred's Ultimate Road Trip. Subsequent series of the show saw them travel across America, Greece and Spain. Most recently, the trio became a duo, with D'Acampo and Sirieix returning for Gino & Fred: Emission Impossible, which sees the pair visit Austria to track down sustainable produce and immerse themselves in environmentally friendly lifestyles. In 2020, the chef became the face of long-running game show Family Fortunes, after it was revived after 17 years. The latest series, which was filmed in 2023, is not currently scheduled for broadcast and ITV has no plans to work with D'Acampo, ITV News reported. Restaurants and cookbooks Away from presenting, D'Acampo has seven restaurants across the UK including in Manchester, London, Liverpool and Leeds. Read more from Sky News:Buffy The Vampire Slayer is backTaylor Swift's Eras Tour was 'excruciating' on her body and mind Throughout his career he has published 20 cookbooks, ranging from one directly aimed at getting children into cooking and another which uses recipes that can all be made using an air fryer. The chef also partnered with supermarket chain Asda in 2021 to release a range of 75 products including cookware, homeware, and appliances."
    },
    {
        "title": "Hamas names three Israeli hostages it says it will release on Saturday",
        "description": "Hamas has released the names of three Israeli hostages it says it will release on Saturday in the fifth such swap of a fragile ceasefire in Gaza.",
        "url": "https://news.sky.com/story/hamas-names-three-israeli-hostages-it-says-it-will-release-on-saturday-13304815",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-eli-sharabi-ohad-ben-ami_6822457.jpg?20250207174408",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-07 16:54:00",
        "Headline": "The latest hostage release and prisoner exchange will happen in the shadow cast by US President Donald Trump's comments about taking over Gaza.",
        "Content": "Hamas has released the names of three Israeli hostages it says it will release on Saturday in the fifth such swap of a fragile ceasefire in Gaza. The hostages are Eli Sharabi, Ohad Ben Ami and Or Levy, Hamas armed wing spokesperson Abu Obeida said in a Telegram post. An Israeli official confirmed Israel had received the three names from Hamas. In return for the captives' release, Hamas said it expects 183 Palestinian prisoners to be released. Both Mr Ami, 56, and Mr Sharabi, 52, were taken from Kibbutz Be'eri during the 7 October attack. The cross-border attack saw around 1,200 Israelis killed and around 250 people taken hostage. Mr Levy, 34, was abducted from the Nova music festival. Of the Palestinian prisoners being freed, 18 have been serving life sentences, 54 were serving long sentences and the vast majority, 111, were detained in Gaza during the war. Eli Sharabi Mr Sharabi's wife Lianne Sharabi was born in Bristol. She, along with their children, 16-year-old Noiya and 13-year-old Yahel, were killed in the 7 October attack. His brother Yossi was also killed after being taken hostage. In a statement after news he would be released was announced, Mr Sharabi's lawyers said: \"The Sharabi family has already lost too much,\". It added: \"It is long past time to bring Eli home.\" Or Levy Mr Levy was captured by militants from a bomb shelter near the Nova music festival. His wife Einav was killed during the 7 October attack. Their son Almog, a toddler, is staying with his grandparents. Mr Levy is from the city of Rishon Lezion, where he worked as a computer programmer.  Some of Mr Levy's family previously spoke about his kidnapping and the death of his wife. Speaking around Hanukkah last year, his brother Michael Levy told Sky News's Yousra Elbagir: \"I have three little girls but it won't be the same. Hanukkah is a happy holiday - you light candles, you sing and eat all sorts of things but for us it is not a real holiday without Or.\" Ohad Ben Ami Mr Ben Ami, a father of three, was taken hostage with his wife Raz, who was released during the brief ceasefire period in November. His daughter Ella Ben Ami previously spoke to Sky News about missing her dad Mr Ami, as she pleaded for his release. \"On the eve of Christmas, on the 24 December, it will be his birthday, and I don't want to celebrate it without him,\" she told Sky News in 2023. Ms Ami was previously one of the first to tell the world what happened on 7 October, calling an Israeli TV channel while hiding.  Row over aid access Earlier on Friday, Hamas accused Israel of breaching the ceasefire accord and held off announcing the names of the Israeli hostages until the deadline had passed. The militant group claimed Israel delayed the entry of hundreds of trucks carrying food and other humanitarian supplies agreed under the truce deal and held back all but a fraction of the tents and mobile homes needed to provide people shelter in the devastated enclave. \"This demonstrates clear manipulation of relief and shelter priorities,\" Hamas said in a statement.  👉 Follow Trump 100 on your podcast app 👈 COGAT, the Israeli military agency that is overseeing the aid deliveries into Gaza, denied the accusation. It added Israel would \"not tolerate violations by Hamas\". The claims and counter-claims highlight the fragility and uncertainty of the ceasefire.  This has been heightened by US President Donald Trump recently saying the US could take over Gaza and move the Palestinian population out. Israel's air and ground war in Gaza has killed more than 47,000 Palestinians, according to Gaza health officials, and displaced the majority of the strip's population. Read more:What's in the ceasefire deal?The Israel-Hamas war in numbers Fragile ceasefire deal So far, 13 of the 33 female, older male and child hostages set to be released in the first phase of the multi-phase agreement have returned to Israel. Five Thai hostages have also been released. Hundreds of Palestinian prisoners and detainees have been released in exchange, often returning to large crowds. Work on the second stage of the agreement, aimed at the release of around 60 male hostages and the withdrawal of Israeli troops from Gaza, has begun. An Israeli negotiating team was expected to fly to Doha on Saturday, according to media reports."
    },
    {
        "title": "'Let's do a deal': Zelenskyy touts Ukraine's rare earth stores to Trump",
        "description": "Volodymyr Zelenskyy has told Donald Trump \"let's do a deal\" as he offered the US a partnership over Ukraine's stores of rare earth and minerals.",
        "url": "https://news.sky.com/story/lets-do-a-deal-zelenskyy-touts-ukraines-rare-earth-stores-to-trump-13304934",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-volodymyr-zelenskyy_6822644.jpg?20250207212217",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-07 20:13:00",
        "Headline": "Donald Trump has said he wants Ukraine to supply the US with critical resources in exchange for financial support in its war with Russia.",
        "Content": "Volodymyr Zelenskyy has told Donald Trump \"let's do a deal\" as he offered the US a partnership over Ukraine's stores of rare earth and minerals. Earlier this week, Mr Trump said he wanted Ukraine to supply the US with critical resources in exchange for financial support in its war with Russia. In an interview with Reuters on Friday, Mr Zelenskyy said: \"If we are talking about a deal, then let's do a deal, we are only for it.\" While emphasising that Kyiv was not proposing \"giving away\" its resources, he said he was open to a mutually beneficial partnership to develop them jointly. Ukraine-Russia war latest: Ukrainian forces seize land inside Russia Rare earths are a group of 17 metals that are vital in the production of high-performance magnets, electric motors and consumer electronics. Mr Zelenskyy touted the country's reserves of titanium and uranium as Europe's largest. \n                  Australian politician changes his name to 'Aussie Trump'\n                 \n                  Day 19: Can Elon Musk keep cutting the Federal government? \n                 \n                  Donald Trump sanctions International Criminal Court as he accuses it of 'abusing its power'\n                 According to the World Economic Forum, Ukraine also has the potential to become a key supplier of lithium, beryllium, manganese, gallium, zirconium, graphite, apatite, fluorite and nickel. Showing a map of Ukraine's mineral deposits, he then said Russia currently has control of less than 20% of the country's mineral resources - but that includes about half its rare earth deposits. \"Putin is not just grabbing them [minerals] along with the land, he is already thinking about how to get other partners in his alliance - North Korea, Iran... and he will give them access,\" Mr Zelenskyy said. \"This is very rich land. This does not mean that we are giving it away to anyone, even to strategic partners. We are talking about partnership... \"Let's develop this together, make money, and most importantly, it's about the security of the Western world.\" The Ukrainian president added that Kyiv and the White House were discussing the idea of using the country's underground gas storage sites to store American liquefied natural gas, calling it \"very interesting\". He also said he would like to discuss the US having priority when it came to rebuilding Ukraine, saying it would amount to \"a lot of money for business\". 'Not accepting Russia's ultimatums' He also insisted that Mr Trump must meet with him before he meets with the Russian president, \"otherwise it will look like a dialogue about Ukraine without Ukraine\". He added: \"I don't know what compromises can be discussed at the negotiating table, we have not reached that point... \"It is important for people to understand that Ukraine is negotiating, not accepting ultimatums from Russia.\" He also stressed Ukraine's need for security guarantees from its allies as part of any settlement. It comes as Mr Trump said he may meet with Mr Zelenskyy in the White House as early as next week. The two last met in New York in September last year. Mr Trump also repeated his interest in meeting the Russian president with whom he said he always had a \"good relationship\". Speaking to reporters while meeting with Japanese Prime Minister Shigeru Ishiba, Mr Trump said: \"I'd like to see it end, just on a human basis. I'd like to see that end. It's a ridiculous war.\" Read more:Ukraine peacekeeping force without US troops would be 'mistake'Lammy promises £55m for Ukraine during visit Mr Zelenskyy also told Reuters in his interview that thousands of North Korean soldiers have now returned to fight Kyiv's forces in the Kursk region of Russia. A Ukrainian special forces commander told Sky News last month that it appeared that North Korean troops had been temporarily pulled back from the frontline after heavy losses. The commander, who went by the codename \"Puls,\" claimed the forces had been seen blowing themselves up with grenades rather than risk capture."
    },
    {
        "title": "Will Trump make space great again?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/will-trump-make-space-great-again-13304809",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-daily-podcast-thumbnail_6822416.jpg?20250207163657",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-07 16:37:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 The US is back in the race to the moon but this time, the competition is China. Determined not to lose, President Donald Trump is pushing for America to return to the moon, backed by billionaires like Elon Musk and Jeff Bezos. But as costs rise and delays mount, could the focus shift from the moon to Mars? On the Sky News Daily podcast, Tom Cheshire speaks to Science and Technology editor Tom Clarke and space journalist Eric Berger about the escalating price of securing America's place in the space race - and whether Mars could be the next \"MAGA mission\". Producer: Emma Rae WoodhouseEditor: Paul Stanworth"
    },
    {
        "title": "Sweden school shooting: All 11 people who died have been identified by police - as local media name second victim",
        "description": "All 11 people who died in a shooting at a school for adults in Sweden have been identified by police but they have not yet released the names.",
        "url": "https://news.sky.com/story/sweden-school-shooting-all-11-people-who-died-have-been-identified-by-police-as-local-media-name-second-victim-13304800",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-flowers-tribute-sweden_6820935.jpg?20250206081038",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-07 16:21:00",
        "Headline": "The mass shooting in Orebro on Tuesday has been described by Sweden's prime minister as the worst in the country's history.",
        "Content": "All 11 people who died in a shooting at a school for adults in Sweden have been identified by police but they have not yet released the names. It comes as local media named a second victim in the attack as a father of two, who was a baker. Eleven people, including the 35-year-old suspect, were killed in the incident at the Campus Risbergska school in Orebro on Tuesday - described by Sweden's prime minister Ulf Kristersson as the worst shooting in the country's history. Police previously said they believe the attacker may have attended the adult education centre, while local media named the suspected perpetrator as Rickard Andersson. On Friday, Sweden's police authority, Polisen, said it had identified the 10 victims - seven women and three men - as well as the suspect who later turned the gun on himself. It said in a statement that all 11 people killed were from Orebro County. The authority added that \"each death constitutes an individual investigation\". The seven women killed were aged 32, 38, 46, 52, 54, 55 and 68, while the four men were aged 28, 31, 35 and 48. \n                  Orebro attack: Victim of Sweden shooting rang fiancee one last time to tell her he loved her\n                 \n                  Orebro shooting: Gunman had links with education centre where he killed 10 people, Swedish police say\n                 \n                  Orebro attack: Mass shooting survivor describes moment he escaped classroom\n                 Second victim named by local media Meanwhile, local news broadcaster SVT named Bassam al Sheleh, a father of two, as one of the 10 victims. It reported the 48-year-old worked as a baker and studied at Campus Risbergska to improve his Swedish. Pierre Al Hajj, who also worked at the bakery, told SVT: \"The customers miss him. They've been in and asked about him yesterday and today. \"They don't want to eat anymore. They have completely lost their appetite.\" Salim Iskef, a newly engaged nursing assistant, was named by local media on Thursday as one of the victims. Sky News' Swedish partner TV4 reported that after being shot, Mr Iskef managed to call his fiancee one final time. \"He said he loved me so much\", his partner Kareen Elia told the broadcaster. \"I can't describe the feelings. We were supposed to get married on July 25.\" She added that, after he called her while lying on the floor, she could not understand what she was seeing on FaceTime and was in shock. It also comes as Sweden's government announced plans to tighten gun control after the shooting, including changing the vetting process for people applying for gun licences and clamping down on some semi-automatic weapons. Read more from Sky News:Politician changes name to 'Aussie Trump'River in Argentina turns bright red Sweden's justice minister said the AR-15 assault rifle - which has been used in mass shootings in the US - was the kind of gun the government wants to ban. Gunnar Strommer said: \"In light of the horrible shooting in Orebro earlier this week we believe that the right balance is to roll back the regulation and prohibit that kind of weapon.\""
    },
    {
        "title": "British couple found dead at house in southern France",
        "description": "A British couple have been found dead at a house in rural southwest France.",
        "url": "https://news.sky.com/story/british-couple-found-dead-at-house-in-southern-france-13304737",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-villefranche-de-rouergue_6822383.jpg?20250207155009",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-07 14:35:00",
        "Headline": "The bodies were reportedly discovered by a neighbour, with the couple said to be active in the local community and well-liked.",
        "Content": "A British couple have been found dead at a house in rural southwest France. Investigators are reportedly looking at whether they were killed during a burglary but all lines of inquiry are said to remain open. The identities of the victims have not been officially released but French news site La Depeche named them as Dawn and Andrew Searle. Their bodies were discovered on Thursday in the hamlet of Les Pesquies, near Villefranche-de-Rouergue, in the Aveyron department. French media reported they moved to the area about 10 years ago and were active in the local community. Mr Searle is said to have previously worked as an organised crime financial investigator in the UK. A LinkedIn profile in his name says he retired in 2015 after working for Barclays and Standard Life and was \"enjoying life in rural France\". \n                  Tomb of far-right French leader Jean-Marie Le Pen vandalised\n                 \n                  UK visitors will have to pay more to see the Mona Lisa in the Louvre in Paris than EU tourists as part of major renovation, Emmanuel Macron says\n                 \n                  British sailor missing after his damaged yacht found off French coast\n                 His page talks about \"over 20 years experience specialising in Financial Crime Prevention (AML, Fraud and Anti-Bribery) with a high profile in the industry and an extensive network of contacts\". Read more from Sky News:Two dead after plane crashes into busy roadPolitician changes his name to 'Aussie Trump' Police, gendarmerie, forensics officers and the public prosecutor were at the scene on Thursday, France3 reported. It said a neighbour discovered their bodies and quoted the local mayor as saying they were a popular couple who had dogs and got on with everyone. A Foreign Office spokesperson told Sky News: \"We are supporting the family of a British couple who died in France and are liaising with the local authorities.\""
    },
    {
        "title": "Two dead after plane crashes into vehicles on busy road in Sao Paulo",
        "description": "Two people have died after a plane crashed into vehicles on a busy road in the Brazilian city of Sao Paulo.",
        "url": "https://news.sky.com/story/two-dead-after-plane-crash-in-sao-paulo-13304494",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sao-paulo-crash-plane_6822149.jpg?20250207115355",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-07 07:13:00",
        "Headline": "Images and video footage show a bus on fire in the aftermath.",
        "Content": " Two people have died after a plane crashed into vehicles on a busy road in the Brazilian city of Sao Paulo. A fire department spokesperson confirmed the deaths, after two bodies were found in the wreckage of the aircraft. The plane - a small twin-engine Beech F90 King Air - crashed on Marques de Sao Vicente Avenue in Barra Funda at around 7.20am local time. Images and video footage show a bus on fire in the aftermath. Another two people - a motorcyclist, and a woman who was on the bus - were injured after they were struck by debris from the explosion and taken to hospital for treatment, CNN Brasil reported. The other passengers on the bus managed to get out safely. Four other people suffered minor injuries. The aircraft had earlier left Campo de Marte Airport, the Brazilian television news channel reported. The control tower lost contact with the plane minutes later. The plane was heading to the city of Porto Alegre in the southern Brazilian state of Rio Grande do Sul, according to the broadcaster. The cause of the crash is being investigated."
    },
    {
        "title": "Australian politician changes his name to 'Aussie Trump'",
        "description": "An Australian politician has legally changed his name to Austin Trump in a move inspired by Donald Trump - in what he said was a protest against the country's ruling centre-left Labor Party.",
        "url": "https://news.sky.com/story/australian-politician-changes-his-name-to-aussie-trump-13304500",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ben-dawkins-australia_6821911.jpg?20250207070021",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-07 07:23:00",
        "Headline": "\"I would love you to reach out Donald, just ring the office here,\" the Australian politician says, who has changed his name in what he describes as a political protest.",
        "Content": "An Australian politician has legally changed his name to Austin Trump in a move inspired by Donald Trump - in what he said was a protest against the country's ruling centre-left Labor Party. Ben Dawkins - who is an independent MP in Western Australia's upper house of parliament where Labor holds a majority - is now listed as \"Aussie Trump\" on the WA parliamentary website. He has also changed his username to \"Hon. Aussie Trump MLC\" on his X account. \"I've launched a political protest against the tyranny and systematic corruption of the Labor government in WA,\" he wrote, in a post on the social media platform, signing off as \"Aussie\". \"Vote Labor Out! & Drill Baby Drill!,\" he wrote in a second post, appearing to echo the US president's plan to increase the extraction of oil and gas in the United States. He also posted a photo showing legal confirmation of the name change from Western Australia's Registry of Births, Deaths and Marriages. \"I want to be like Trump in the sense of calling out woke leftist nonsense,\" he told 9News. \"I would love you to reach out Donald, just ring the office here.\" Read more from Sky News:Trump sanctions International Criminal CourtMake the Moon Great Again - or lose it to China? \"This is simply attention-seeking stuff,\" said Western Australia's Premier Roger Cook, the state's Labor leader, at a news conference on Thursday. \"I'm not sure how much lower he can go.\" Western Australia state elections are due to take place in March, before the country goes to the polls in a nationwide vote that must be held before 17 May."
    },
    {
        "title": "River in Argentina turns bright red",
        "description": "A river in a suburb of Buenos Aires in Argentina has turned red, sparking concern among residents.",
        "url": "https://news.sky.com/story/river-in-argentina-turns-bright-red-13304576",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-buenos-aires-argentina_6822090.jpg?20250207105152",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-07 10:31:00",
        "Headline": "Residents express alarm and say it's not the first time the waterway has changed colour.",
        "Content": " A river in a suburb of Buenos Aires in Argentina has turned red, sparking concern among residents. Footage and images of the Sarandi watercourse - which flows into the Rio de la Plata estuary - show the sudden change in colour. It is not the first time it has changed colour, according to local media reports, with residents raising fears of contamination. \"I have lived here all my life. Today, we have this red water. It has been grey, it has been green, it has been violet, bluish... very brown,\" one resident told La Nacion. \"On other days we have a thick yellow layer that left the top hard and had an acidic smell,\" another local told Pagina 12. Officials have been to the site to take away samples of the red water for testing. The region's environment ministry told La Nacion samples of the water would be analysed to find out what \"is causing the discolouration\"."
    },
    {
        "title": "More than 100 venomous snakes removed from Sydney back garden",
        "description": "One hundred and two venomous snakes have been removed from a suburban back garden in Sydney.",
        "url": "https://news.sky.com/story/more-than-100-venomous-snakes-removed-from-sydney-back-garden-13304615",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-snakes-red-belly-black-snakes_6822007.jpg?20250207091352",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-07 11:13:00",
        "Headline": "Experts say the snakes might have grouped together for safety or due to a shortage of suitable habitats to give birth.",
        "Content": "One hundred and two venomous snakes have been removed from a suburban back garden in Sydney. David Stein called experts after seeing six snakes moving around in a pile of mulch and discovered that red-belly blacks pile on top of each other before giving birth. Snake catcher Dylan Cooper was drafted in the same afternoon and bagged up five adults and 97 babies. Reptile Relocation Sydney said two of the adults gave birth to 29 snakes in the bag while the clean-up was still taking place. Company owner Cory Kerewaro said the highest number he'd heard about in a similar job was 30 non-venomous carpet pythons. However, that snake hatches from an egg whereas red-belly blacks give birth. \"You can get a decent number like that when the babies are hatching,\" Mr Kerewaro said. \"But to have this many venomous snakes, no one's come across it.\" The species normally has a litter of between four and 35 young. Snake expert and author Scott Eipper said the snakes might have grouped together for safety or due to a shortage of suitable habitats to give birth. \"This is an isolated incident. It's certainly a very rare occurrence,\" he said. The snakes have started a new life in an undisclosed national park after authorities granted permission for them to be released. Read more from Sky News:River in Argentina turns bright redGreece declares state of emergency on Santorini \"Because there was such a large number, obviously people were a bit concerned where 100 snakes were going to go,\" Mr Kerewaro said. \"They'll be far enough away to avoid any human interaction: 100 snakes are going into the middle of the bush in the middle of nowhere,\" he added. Meanwhile, Mr Stein has vowed to get rid of the mulch as soon as possible after being warned the snakes could return if it's not shifted."
    },
    {
        "title": "Travis Kelce says Taylor Swift's Eras Tour was 'excruciating' on her body and mind",
        "description": "American football star Travis Kelce has praised girlfriend Taylor Swift's work ethic, saying her record-breaking Eras Tour was \"excruciating\" on the singer's body and mind.",
        "url": "https://news.sky.com/story/travis-kelce-says-taylor-swifts-eras-tour-was-excruciating-on-her-body-and-mind-13304541",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-travis-kelce-taylor-swift_6822032.jpg?20250207094005",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-07 09:04:00",
        "Headline": "In the build up to Sunday's Super Bowl, questions about Kelce's love life with megastar Swift have dominated coverage, including if marriage is on the cards.",
        "Content": " American football star Travis Kelce has praised girlfriend Taylor Swift's work ethic, saying her record-breaking Eras Tour was \"excruciating\" on the singer's body and mind. Speaking ahead of Sunday's Super Bowl, Kelce, who is a tight end for the Kansas City Chiefs, was asked by reporters what he has learnt about Swift's dedication to her craft. \"What I saw on that [Eras Tour] last year was pretty remarkable,\" Kelce replied. \"To see the week in, week out, travelling from one country to the next, how excruciating it is on her body and on her mind. \"It's not just her, it was her entire tour. It was the dancers, it was the band, the singers, it was everybody involved. \"It was an absolute machine, and it was something I could admire watching, and I think about it all the time.\" Spanning five continents, Swift's Eras Tour became the highest-grossing of all time and the second most attended, seen by 10.1 million fans worldwide. The singer played a total of 149 shows, each running for around three hours, the elaborate performance also featured multiple costume changes and a set list of more than 40 songs. Kelce, who has been dating the singer since September 2023, attended multiple shows and even delighted fans when he joined Swift on stage at London's Wembley Arena. Swift's support and possible proposal? Although focus is firmly on Kelce as the Chiefs prepare to take on the Philadelphia Eagles in a bid to win an unprecedented third consecutive Super Bowl title, questions about his love life have dominated the build up to the game. The 14-time Grammy Award-winning singer was born in Philadelphia - the largest city in Pennsylvania - but when asked what team would get her full support, Kelce said he thinks this year she will be \"wearing red\" (the colour of the Chiefs). \"I know her father is an Eagles fan,\" he said, adding: \"But she'll be all for the Chiefs this time around for sure.\" The footballer was also quick to shut down questions on whether he plans to give Swift an engagement ring, should the Chiefs win a three in a row. When asked, he simply responded: \"A Super Bowl ring? Next question.\" Swift has become a regular feature at Chiefs games, last seen cheering Kelce and his teammates on as they beat the Bills in the AFC Championship game that secured their place in the Super Bowl, and came on to the field at the Arrowhead Stadium after their victory to kiss him as confetti fell behind them. Read more from Sky News:Buffy The Vampire Slayer: Sarah Michelle Gellar confirms revivalBlake Lively and Justin Baldoni's legal battle explained She also attracted plenty of attention in her own right at last year's game, as she was making a much-discussed journey from her concert in Tokyo in time for the big kick-off in Las Vegas. In the end she made it with plenty of time to spare, and went on to enjoy herself after the Chiefs' 25-22 win over the 49ers."
    },
    {
        "title": "Wreckage found in Alaska for missing Bering Air plane carrying 10 people",
        "description": "A small plane which crashed in western Alaska with 10 people on board has been found and the US Coast Guard (USCG) says there were no survivors.",
        "url": "https://news.sky.com/story/wreckage-found-in-alaska-for-missing-bering-air-plane-carrying-10-people-13304491",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-alaska-plane-crash_6822741.png?20250208005934",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-07 07:06:00",
        "Headline": "It comes after dozens of people died in two major air accidents elsewhere in the US in recent weeks.",
        "Content": "A small plane which crashed in western Alaska with 10 people on board has been found and the US Coast Guard (USCG) says there were no survivors. The Bering Air flight left Unalakleet at 2.38pm on Thursday but contact was lost less than an hour later, the firm's operations director David Olson said. On Saturday, in a post on X, the coastguard said: \"USCG has ended its search for the missing plane after the aircraft was located approx 34 miles southeast of Nome. 3 individuals were found inside and reported to be deceased. \"The remaining 7 people are believed to be inside the aircraft but are currently inaccessible due to the condition of the plane. Our heartfelt condolences are with those affected by this tragic incident.\" The Cessna 208B Grand Caravan - carrying a pilot and nine adult passengers - was flying across Norton Sound when tracking site Flightradar24 reported it at 5,300ft before contact was lost. It was travelling from Unalakleet, a community of about 690 people in western Alaska, to Nome, a gold rush town just south of the Arctic Circle. The flight time is normally just under an hour. Mike Salerno, a spokesperson for the US Coast Guard, said rescuers were searching the aircraft's last known location by helicopter when they spotted the wreckage. They lowered two rescue swimmers to investigate. In a post on Facebook, Nome's fire department issued an update: \"The Nome Search and Rescue Team is spooling up with assistance from the Alaska Air National Guard with recovery efforts. \"From reports we have received, the crash was not survivable. Our thoughts are with the families at this time.\" On Friday, Lieutenant Benjamin McIntyre-Coble, from the Alaskan coastguard, explained that the plane suffered a rapid loss of altitude and speed, according to radar data, but did not expand on the potential cause. Read more from Sky News:Zelenskyy tells Trump 'let's do a deal'Trauma of using unregulated funeral directorsTravis Kelce: Taylor's Eras Tour 'excruciating' Weather in Unalakleet at take-off time was -8.3C (17F) with fog and light snow, according to the US National Weather Service. Bering Air serves 32 villages in western Alaska and air travel is often the only option of travelling long distances in rural parts of the US state, especially in winter. It comes soon after two major air accidents in the US in recent weeks. Sixty-seven people were killed when a jet and helicopter collided in Washington DC and seven died when a medical plane crashed in Philadelphia."
    },
    {
        "title": "Billions for 'unproven' carbon capture technology will have 'very significant' impact on energy bills, MPs warn",
        "description": "The government is spending &#163;22bn on \"unproven\" technologies which will have a \"very significant effect\" on energy bills, according to an influential committee of MPs. ",
        "url": "https://news.sky.com/story/billions-for-unproven-carbon-capture-technology-will-have-very-significant-impact-on-energy-bills-mps-warn-13304513",
        "image_url": "https://e3.365dm.com/22/01/1920x1080/skynews-shell-carbon-capture_5647147.jpg?20220120131501",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-02-07 07:51:00",
        "Headline": "The state is \"gambling\" net zero targets on carbon capture technology but there are no examples of it working at scale in the UK, a committee has warned the government. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The government is spending £22bn on \"unproven\" technologies which will have a \"very significant effect\" on energy bills, according to an influential committee of MPs.  There has been no assessment of whether the programme to capture and store carbon from the atmosphere is affordable for billpayers, said a report from the Public Accounts Committee (PAC) of MPs. The financial impact on households of funding the project has not been examined by government at all, the PAC said. Money blog: Greggs taking on KFC with new range Even if the state's investment pays off, the technology is successful and makes money, there is no way for profits to be shared to bring down bills, it added. Private sector investors, however, would recoup investment, according to committee chair Sir Geoffrey Clifton-Brown. \"All early progress will be underwritten by taxpayers, who currently do not stand to benefit if these projects are successful,\" he said. \"Any private sector funding for such a project would expect to see significant returns when it becomes a success.\" That's despite the vast majority (two-thirds) of the £21.7bn investment coming from levies on consumers \"who are already facing some of the highest energy bills in the world\", it said. But there is no evidence to say the programme will be successful despite the government \"gambling\" its legally mandated net zero targets on the tech, committee chair Sir Geoffrey added.  There are no examples of carbon capture, usage and storage (CCUS) operating at scale in the UK, according to the PAC report. As part of its work, the PAC heard the technology may not capture as much carbon as expected. International examples show the government's expectations for its performance are \"far from guaranteed\", it heard as part of its inquiry. Read more:UK's first air capture plant to turn CO2 into jet fuelTrump faces stick or twist China space race choice A threat to net zero This lack of proof of the technology working is a threat to the UK reaching its net zero 2050 emissions targets. Last year the government downgraded the amount of carbon it expects to store each year as the goals were seen as \"no longer achievable\", but no new targets have been announced, creating a shortfall in the path to net zero. It is now \"unclear\" how the government will reach its goal, the PAC report said. \"Our committee was left unconvinced that CCUS is the silver bullet government is apparently betting on\", Sir Geoffrey said. The £22bn investment was due to be made over 25 years and into five CCUS projects."
    },
    {
        "title": "Apple ordered by UK government to let it access users' encrypted data - reports",
        "description": "Apple has reportedly been ordered by the UK government to allow it access to encrypted data stored by the company's users worldwide in its cloud service.",
        "url": "https://news.sky.com/story/apple-ordered-by-uk-government-to-let-it-access-users-encrypted-data-reports-13304724",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-apple-store-new-york_6822415.jpg?20250207163535",
        "type": "Business",
        "Author": "Tim Baker",
        "Date Published": "2025-02-07 14:05:00",
        "Headline": "The government will not confirm or deny the existence of the order. There are concerns that breaking encryption could allow bad actors to access people's data, and pave the way for countries like China to make similar demands.",
        "Content": "\n          Political reporter\n       Apple has reportedly been ordered by the UK government to allow it access to encrypted data stored by the company's users worldwide in its cloud service. At the moment, only the Apple account holder can access such data - not even the US technology giant can see it. Apple, which makes iPhones, iPads and iMacs, has been issued with a Technical Capability Notice (TCN), the Washington Post and BBC are reporting. This order, which does not get published, is said to require a blanket ability for the government to view people's encrypted data - both in the UK and abroad. The Home Office will not confirm or deny the existence of the order. Apple has been approached for comment. Getting technology companies to break encryption has long been a contentious issue in the UK government. Ministers have argued they want to use it for purposes like protecting children, identifying criminals and keeping the public safe. \n                  Apple suspends AI-generated news summaries after criticism over misleading notifications\n                 \n                  Apple AI feature 'must be revoked' over notifications misleading users, say journalists\n                 \n                  Severance star Adam Scott on balancing Hollywood fame with family life: 'Everything's a challenge at some point'\n                 What are the concerns? Opponents say it is a breach of privacy. They also highlight the risk to whistleblowers and journalists, and point out that any tool the government has to break into people's information has a danger of being hijacked by bad actors. There are also concerns that, if implemented, the UK's order could lead nations like China to force Western companies to break their users' privacy. 'Advanced Data Protection' On Apple products, users have the option to use Advanced Data Protection (ADP). The UK government's demand applies to all content stored using ADP, which means certain data can only be decrypted by the user. Apple promises that even a cloud data breach would not make the information readable. Users are also told that Apple cannot see the data due to the end-to-end encryption used to share the information. End-to-end encryption means that messages and data sent between two devices can only be read by the person they are sent to - and are scrambled if anyone else tries to intercept or access them. The debate stretches as far back as 2017, when then home secretary Amber Rudd stated that \"I don't need to understand how encryption works\" to want it broken. The order from the UK government was made under the UK Investigatory Powers Act 2016, according to The Washington Post. The act says the orders can be applied to companies outside the UK. There are avenues for Apple to appeal against the TCN, but this process would not be made public. Read more:Encryption 'put children at risk'A 'disaster' for counter-terrorism The Labour government has been outspoken in its desire to target social media and technology companies while in power. This includes recently trumpeting its plans to be the first country in the world to create a new AI sexual abuse offence to punish those generating and facilitating the creation of AI child sexual abuse images. And Home Secretary Yvette Cooper has criticised social media companies for not being fast enough to take down videos previously viewed by Southport killer Axel Rudakubana. Last year, Apple provided written evidence to MPs on its many oppositions to the Investigatory Powers Act and TCNs. It noted that the law gives the UK government the power to \"act as the world's regulator\" of security technology - something which could put it at odds with authorities like the European Union and the United States. Order would 'undermine human rights' The American company also said that an order to force decryption would \"undermine fundamentally human rights\" and potentially put the UK at odds with the European Court of Human Rights. \"There is no reason why the [UK government] should have the authority to decide for citizens of the world whether they can avail themselves of the proven security benefits that flow from end-to-end encryption,\" Apple said. It added: \"Moreover, any attempt by the [secretary of state] to use its extraterritorial powers to compel technology companies to weaken encryption technology will only strengthen the hands of malicious actors who seek to steal and exploit personal data for nefarious purposes.\" 👉 Listen to Sky News Daily on your podcast app 👈 A spokesperson for privacy and civil liberty campaign group Big Brother Watch said: \"We urge the UK government to immediately rescind this draconian order and cease attempts to employ mass surveillance in lieu of the targeted powers already at their disposal.\" A Home Office spokesperson said: \"We do not comment on operational matters, including for example confirming or denying the existence of any such notices.\""
    },
    {
        "title": "Cobham break-up nears end with Ultra warfare simulation arm sale",
        "description": "The private equity backer of one of Britain's oldest industrial manufacturing groups is in talks to sell an advanced defence technology business that will bring its parent's dismantling close to completion.",
        "url": "https://news.sky.com/story/cobham-break-up-nears-end-with-ultra-warfare-simulation-arm-sale-13304590",
        "image_url": "https://e3.365dm.com/21/07/1920x1080/skynews-eurofighter-typhoon_5459145.jpg?20210726145317",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-07 10:41:00",
        "Headline": "Prospective bidders are in talks to buy Ultra's Electronic Warfare Simulation Technology division as the dismantling of a famous British industrial name nears its conclusion, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity backer of one of Britain's oldest industrial manufacturing groups is in talks to sell an advanced defence technology business that will bring its parent's dismantling close to completion. Sky News has learnt that Advent International, the buyout firm which bought Cobham for £4bn in 2020 and then swooped on London-listed Ultra Electronics in a £2.6bn deal the following year, is in detailed negotiations to offload Ultra Electronic Warfare Simulation Technology (EWST). Money blog: Greggs taking on KFC with new range The division provides \"training and performance validation capabilities\" to its customers, and - according to the company - \"specialises in market-leading, multi-spectral threat and countermeasure simulators that are designed to strengthen naval, air force, army and the defence industry's electronic warfare testing, evaluation and training\". One bidder who explored a bid at an earlier stage of the sale process said on Friday that the EWST business was unlikely to command a significant price. A change of control may nevertheless require approval under the government's National Security and Investment Act, given the nature of the division's operations. The EWST division is part of Ultra Intelligence & Communications, which is itself a subsidiary of the broader group. Alvarez & Marsal, the professional services firm, has been drafted in to manage the auction, the source added. Advent has overseen a wholesale break-up of the enlarged Cobham group - a controversial process which drew opposition from members of the company's founding family as well as politicians and commentators. Among the assets already sold was Paris-based Cobham Aerospace Communications to the French group Thales, which fetched £850m in 2023. Advent's spokesman did not respond to enquiries about the remaining elements of the original Cobham business in its ownership but declined to comment on the EWST sale process."
    },
    {
        "title": "Online estate agent Purplebricks rents Mitchell as interim chief",
        "description": "Purplebricks, the online estate agent owned by Sir Charles Dunstone, one of Britain's most prolific entrepreneurs, has parachuted in an interim chief executive 18 months after it delisted from the London stock market.",
        "url": "https://news.sky.com/story/online-estate-agent-purplebricks-rents-mitchell-as-interim-chief-13304618",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-purplebricks-purple_6239769.jpg?20230803194626",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-07 11:18:00",
        "Headline": "Stuart Bartlett has been appointed as interim CEO of the online estate agent just over 18 months after it delisted from the London stock market following its cut-price takeover, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Purplebricks, the online estate agent owned by Sir Charles Dunstone, one of Britain's most prolific entrepreneurs, has parachuted in an interim chief executive 18 months after it delisted from the London stock market. Sky News has learnt that shareholders in Strike, Purplebricks' parent company, were notified this week that Stuart Bartlett, a former automotive industry executive, has been appointed to the role. Strike is owned by Freston Ventures, Sir Charles's investment vehicle. It swooped to buy Purplebricks in June 2023 for just £1, reflecting the crisis which had engulfed the prominent digital property agent. Mr Bartlett's profile on LinkedIn, the professional networking site, lists him as a board advisor to Purplebricks and an investor in Strike. He replaces Sam Mitchell, who stepped down at the end of last year. According to the update circulated to investors, Strike executive chairman Andrew Harrison - a long-standing colleague of TalkTalk and Carphone Warehouse co-founder Sir Charles - has also made a number of other senior appointments. \n                  Money blog: Netflix quietly increases its subscription prices\n                 \n                  Billions for 'unproven' carbon capture technology will have 'very significant' impact on energy bills, MPs warn\n                 \n                  Interest rate cut - but economic growth forecast slashed in blow to chancellor\n                 These include a new national sales director and interim group finance chief to replace Deepak Jayaprakash, its former chief financial officer. Hundreds of jobs have been cut at Purplebricks since the takeover in 2023. The company could not be reached for comment."
    },
    {
        "title": "Apple ordered by UK government to let it access users' encrypted data - reports",
        "description": "Apple has reportedly been ordered by the UK government to allow it access to encrypted data stored by the company's users worldwide in its cloud service.",
        "url": "https://news.sky.com/story/apple-ordered-by-uk-government-to-let-it-access-users-encrypted-data-reports-13304724",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-apple-store-new-york_6822415.jpg?20250207163535",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-02-07 14:05:00",
        "Headline": "The government will not confirm or deny the existence of the order. There are concerns that breaking encryption could allow bad actors to access people's data, and pave the way for countries like China to make similar demands.",
        "Content": "\n          Political reporter\n       Apple has reportedly been ordered by the UK government to allow it access to encrypted data stored by the company's users worldwide in its cloud service. At the moment, only the Apple account holder can access such data - not even the US technology giant can see it. Apple, which makes iPhones, iPads and iMacs, has been issued with a Technical Capability Notice (TCN), the Washington Post and BBC are reporting. This order, which does not get published, is said to require a blanket ability for the government to view people's encrypted data - both in the UK and abroad. The Home Office will not confirm or deny the existence of the order. Apple has been approached for comment. Getting technology companies to break encryption has long been a contentious issue in the UK government. Ministers have argued they want to use it for purposes like protecting children, identifying criminals and keeping the public safe. \n                  Apple suspends AI-generated news summaries after criticism over misleading notifications\n                 \n                  Apple AI feature 'must be revoked' over notifications misleading users, say journalists\n                 \n                  Severance star Adam Scott on balancing Hollywood fame with family life: 'Everything's a challenge at some point'\n                 What are the concerns? Opponents say it is a breach of privacy. They also highlight the risk to whistleblowers and journalists, and point out that any tool the government has to break into people's information has a danger of being hijacked by bad actors. There are also concerns that, if implemented, the UK's order could lead nations like China to force Western companies to break their users' privacy. 'Advanced Data Protection' On Apple products, users have the option to use Advanced Data Protection (ADP). The UK government's demand applies to all content stored using ADP, which means certain data can only be decrypted by the user. Apple promises that even a cloud data breach would not make the information readable. Users are also told that Apple cannot see the data due to the end-to-end encryption used to share the information. End-to-end encryption means that messages and data sent between two devices can only be read by the person they are sent to - and are scrambled if anyone else tries to intercept or access them. The debate stretches as far back as 2017, when then home secretary Amber Rudd stated that \"I don't need to understand how encryption works\" to want it broken. The order from the UK government was made under the UK Investigatory Powers Act 2016, according to The Washington Post. The act says the orders can be applied to companies outside the UK. There are avenues for Apple to appeal against the TCN, but this process would not be made public. Read more:Encryption 'put children at risk'A 'disaster' for counter-terrorism The Labour government has been outspoken in its desire to target social media and technology companies while in power. This includes recently trumpeting its plans to be the first country in the world to create a new AI sexual abuse offence to punish those generating and facilitating the creation of AI child sexual abuse images. And Home Secretary Yvette Cooper has criticised social media companies for not being fast enough to take down videos previously viewed by Southport killer Axel Rudakubana. Last year, Apple provided written evidence to MPs on its many oppositions to the Investigatory Powers Act and TCNs. It noted that the law gives the UK government the power to \"act as the world's regulator\" of security technology - something which could put it at odds with authorities like the European Union and the United States. Order would 'undermine human rights' The American company also said that an order to force decryption would \"undermine fundamentally human rights\" and potentially put the UK at odds with the European Court of Human Rights. \"There is no reason why the [UK government] should have the authority to decide for citizens of the world whether they can avail themselves of the proven security benefits that flow from end-to-end encryption,\" Apple said. It added: \"Moreover, any attempt by the [secretary of state] to use its extraterritorial powers to compel technology companies to weaken encryption technology will only strengthen the hands of malicious actors who seek to steal and exploit personal data for nefarious purposes.\" 👉 Listen to Sky News Daily on your podcast app 👈 A spokesperson for privacy and civil liberty campaign group Big Brother Watch said: \"We urge the UK government to immediately rescind this draconian order and cease attempts to employ mass surveillance in lieu of the targeted powers already at their disposal.\" A Home Office spokesperson said: \"We do not comment on operational matters, including for example confirming or denying the existence of any such notices.\""
    },
    {
        "title": "Plaid Cymru: Former leader Dafydd Elis-Thomas dies aged 78",
        "description": "Dafydd Elis-Thomas, the former leader of Plaid Cymru, has died at the age of 78.",
        "url": "https://news.sky.com/story/plaid-cymru-former-leader-dafydd-elis-thomas-dies-aged-78-13304617",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-llywodraeth-cymru-dafydd-elis-thomas_6822115.jpg?20250207112100",
        "type": "Politics",
        "Author": "Tomos Evans",
        "Date Published": "2025-02-07 11:17:00",
        "Headline": "Lord Elis-Thomas served as leader of the Welsh independence-backing party between 1984 and 1991, before more recently serving as a Welsh government minister.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n Dafydd Elis-Thomas, the former leader of Plaid Cymru, has died at the age of 78. Lord Elis-Thomas also served as the Welsh government's culture, sport and tourism minister from 2017 to 2021. He served as his party's leader between 1984 and 1991 and as MP for Merioneth, later Meirionnydd Nant Conwy, from 1974 to 1992. He then became a member of the House of Lords when he was made a life peer the same year. Lord Elis-Thomas was a member of the first Senedd, then known as the Welsh Assembly, in 1999 and played a key role as its first presiding officer - a role he held until 2011. He quit Plaid Cymru in 2016 and continued to sit as an independent member of the Senedd for Dwyfor Meirionnydd, until he stepped down at the 2021 election. 'Senedd's founding father' Plaid's current leader Rhun ap Iorwerth said Lord Elis-Thomas's death was \"a huge loss to Welsh politics and the civic life of Wales\". Mr ap Iorwerth said his predecessor was \"unquestionably one of the most influential figures of his generation\". As the inaugural presiding officer, he made \"a priceless contribution in laying the firm foundations of devolution\", Mr ap Iorwerth added. He said the party's \"sincerest condolences\" were with Lord Elis-Thomas's family. Elin Jones, the Senedd's current presiding officer, known as the Llywydd, said it was \"hard to imagine Welsh political life without [him]\". She said he was \"omnipresent\" in Welsh politics, having served in the House of Commons, House of Lords and the Senedd. Ms Jones said he was \"keen to establish a modern democracy from the start\" in his role as presiding officer and could \"rightly be called [the] Senedd's founding father\". Wales's first minister Eluned Morgan said he was \"a true giant of Welsh politics\" and \"helped shape the Wales we know today\". Baroness Morgan added that Wales was \"immeasurably richer for his lifetime of service\". Lord Elis-Thomas's successor as Senedd member for Dwyfor Meirionnydd, Mabon ap Gwynfor, said the news had come as an \"enormous blow\", and that he had made a \"priceless contribution to Welsh politics\". Secretary of State for Wales Jo Stevens also paid tribute, saying he had \"dedicated his life to serving Wales in Westminster, Cardiff Bay, and his constituency\". Elsewhere, Scotland's first minister John Swinney said he was \"a great friend to Scotland and a fine servant of Wales\". Read more from Sky News:Cancer nurse struck off after 'financially grooming' patientMajor travel disruption after car crashes onto railway lines Welsh Conservative leader Darren Millar described Lord Elis-Thomas as \"a titan of Welsh politics\" and that his death was \"a great loss\". Meanwhile, former Welsh Conservative leader Andrew RT Davies said he \"admired\" the former minister as \"a man who was never afraid to speak his mind\"."
    },
    {
        "title": "Billions for 'unproven' carbon capture technology will have 'very significant' impact on energy bills, MPs warn",
        "description": "The government is spending &#163;22bn on \"unproven\" technologies which will have a \"very significant effect\" on energy bills, according to an influential committee of MPs. ",
        "url": "https://news.sky.com/story/billions-for-unproven-carbon-capture-technology-will-have-very-significant-impact-on-energy-bills-mps-warn-13304513",
        "image_url": "https://e3.365dm.com/22/01/1920x1080/skynews-shell-carbon-capture_5647147.jpg?20220120131501",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-02-07 07:51:00",
        "Headline": "The state is \"gambling\" net zero targets on carbon capture technology but there are no examples of it working at scale in the UK, a committee has warned the government. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The government is spending £22bn on \"unproven\" technologies which will have a \"very significant effect\" on energy bills, according to an influential committee of MPs.  There has been no assessment of whether the programme to capture and store carbon from the atmosphere is affordable for billpayers, said a report from the Public Accounts Committee (PAC) of MPs. The financial impact on households of funding the project has not been examined by government at all, the PAC said. Money blog: Greggs taking on KFC with new range Even if the state's investment pays off, the technology is successful and makes money, there is no way for profits to be shared to bring down bills, it added. Private sector investors, however, would recoup investment, according to committee chair Sir Geoffrey Clifton-Brown. \"All early progress will be underwritten by taxpayers, who currently do not stand to benefit if these projects are successful,\" he said. \"Any private sector funding for such a project would expect to see significant returns when it becomes a success.\" That's despite the vast majority (two-thirds) of the £21.7bn investment coming from levies on consumers \"who are already facing some of the highest energy bills in the world\", it said. But there is no evidence to say the programme will be successful despite the government \"gambling\" its legally mandated net zero targets on the tech, committee chair Sir Geoffrey added.  There are no examples of carbon capture, usage and storage (CCUS) operating at scale in the UK, according to the PAC report. As part of its work, the PAC heard the technology may not capture as much carbon as expected. International examples show the government's expectations for its performance are \"far from guaranteed\", it heard as part of its inquiry. Read more:UK's first air capture plant to turn CO2 into jet fuelTrump faces stick or twist China space race choice A threat to net zero This lack of proof of the technology working is a threat to the UK reaching its net zero 2050 emissions targets. Last year the government downgraded the amount of carbon it expects to store each year as the goals were seen as \"no longer achievable\", but no new targets have been announced, creating a shortfall in the path to net zero. It is now \"unclear\" how the government will reach its goal, the PAC report said. \"Our committee was left unconvinced that CCUS is the silver bullet government is apparently betting on\", Sir Geoffrey said. The £22bn investment was due to be made over 25 years and into five CCUS projects."
    },
    {
        "title": "Will Trump make space great again?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/will-trump-make-space-great-again-13304809",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-daily-podcast-thumbnail_6822416.jpg?20250207163657",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-07 16:37:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 The US is back in the race to the moon but this time, the competition is China. Determined not to lose, President Donald Trump is pushing for America to return to the moon, backed by billionaires like Elon Musk and Jeff Bezos. But as costs rise and delays mount, could the focus shift from the moon to Mars? On the Sky News Daily podcast, Tom Cheshire speaks to Science and Technology editor Tom Clarke and space journalist Eric Berger about the escalating price of securing America's place in the space race - and whether Mars could be the next \"MAGA mission\". Producer: Emma Rae WoodhouseEditor: Paul Stanworth"
    },
    {
        "title": "FM25 cancelled: Makers of Football Manager video game issue update after release delays",
        "description": "The makers of video game Football Manager 25 have cancelled its release after a number of delays.",
        "url": "https://news.sky.com/story/fm25-cancelled-after-release-delays-13304547",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-football-manager-25_6821996.jpg?20250207090000",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-07 09:09:00",
        "Headline": "The game's makers say their attention will now turn to creating a new era for the Football Manager series.",
        "Content": "The makers of video game Football Manager 25 have cancelled its release after a number of delays. The game's release date had already been pushed back twice and its makers said they knew the latest news would \"come as a huge disappointment\". In an update on Thursday, Sports Interactive said it had made the \"difficult decision\" to cancel the release entirely after \"internal discussion and careful consideration with Sega\". Instead, their focus will now turn to the next release, Football Manager 26, expected to be released later this year. The makers said they were \"very sorry\" to have \"let down\" those who had pre-ordered the game. Football Manager was first released in November 2004 and its most recent release hit stores in November 2023. The latest in the series can be played on a variety of platforms, including Xbox One, PlayStation 5 and Nintendo Switch. It became the \"most played\" in the history of the franchise, having had seven million players within 100 days of its release. Sports Interactive said it had hoped to create \"the biggest technical and visual advancement in the series for a generation\" with the launch of Football Manager 25. The company said the game was delayed \"due to a variety of challenges\", until it became \"unmistakably clear\" that it would not achieve the expected standard, even with more time. Expanding on the delays, the statement added the \"overarching player experience and interface is not where [the company needs] it to be\". Read more from Sky News:Cancer nurse struck off after 'financially grooming' patientSearch under way for missing plane carrying 10 people While Sports Interactive says it \"could have pressed on\", it was \"unwilling to go beyond a March release\" as it was \"too late in the football season\". The company added that its \"full focus\" is now on creating a new era for the Football Manager series."
    },
    {
        "title": "Billions for 'unproven' carbon capture technology will have 'very significant' impact on energy bills, MPs warn",
        "description": "The government is spending &#163;22bn on \"unproven\" technologies which will have a \"very significant effect\" on energy bills, according to an influential committee of MPs. ",
        "url": "https://news.sky.com/story/billions-for-unproven-carbon-capture-technology-will-have-very-significant-impact-on-energy-bills-mps-warn-13304513",
        "image_url": "https://e3.365dm.com/22/01/1920x1080/skynews-shell-carbon-capture_5647147.jpg?20220120131501",
        "type": "Technology",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-02-07 07:51:00",
        "Headline": "The state is \"gambling\" net zero targets on carbon capture technology but there are no examples of it working at scale in the UK, a committee has warned the government. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The government is spending £22bn on \"unproven\" technologies which will have a \"very significant effect\" on energy bills, according to an influential committee of MPs.  There has been no assessment of whether the programme to capture and store carbon from the atmosphere is affordable for billpayers, said a report from the Public Accounts Committee (PAC) of MPs. The financial impact on households of funding the project has not been examined by government at all, the PAC said. Money blog: Greggs taking on KFC with new range Even if the state's investment pays off, the technology is successful and makes money, there is no way for profits to be shared to bring down bills, it added. Private sector investors, however, would recoup investment, according to committee chair Sir Geoffrey Clifton-Brown. \"All early progress will be underwritten by taxpayers, who currently do not stand to benefit if these projects are successful,\" he said. \"Any private sector funding for such a project would expect to see significant returns when it becomes a success.\" That's despite the vast majority (two-thirds) of the £21.7bn investment coming from levies on consumers \"who are already facing some of the highest energy bills in the world\", it said. But there is no evidence to say the programme will be successful despite the government \"gambling\" its legally mandated net zero targets on the tech, committee chair Sir Geoffrey added.  There are no examples of carbon capture, usage and storage (CCUS) operating at scale in the UK, according to the PAC report. As part of its work, the PAC heard the technology may not capture as much carbon as expected. International examples show the government's expectations for its performance are \"far from guaranteed\", it heard as part of its inquiry. Read more:UK's first air capture plant to turn CO2 into jet fuelTrump faces stick or twist China space race choice A threat to net zero This lack of proof of the technology working is a threat to the UK reaching its net zero 2050 emissions targets. Last year the government downgraded the amount of carbon it expects to store each year as the goals were seen as \"no longer achievable\", but no new targets have been announced, creating a shortfall in the path to net zero. It is now \"unclear\" how the government will reach its goal, the PAC report said. \"Our committee was left unconvinced that CCUS is the silver bullet government is apparently betting on\", Sir Geoffrey said. The £22bn investment was due to be made over 25 years and into five CCUS projects."
    },
    {
        "title": "Travis Kelce says Taylor Swift's Eras Tour was 'excruciating' on her body and mind",
        "description": "American football star Travis Kelce has praised girlfriend Taylor Swift's work ethic, saying her record-breaking Eras Tour was \"excruciating\" on the singer's body and mind.",
        "url": "https://news.sky.com/story/travis-kelce-says-taylor-swifts-eras-tour-was-excruciating-on-her-body-and-mind-13304541",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-travis-kelce-taylor-swift_6822032.jpg?20250207094005",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-07 09:04:00",
        "Headline": "In the build up to Sunday's Super Bowl, questions about Kelce's love life with megastar Swift have dominated coverage, including if marriage is on the cards.",
        "Content": " American football star Travis Kelce has praised girlfriend Taylor Swift's work ethic, saying her record-breaking Eras Tour was \"excruciating\" on the singer's body and mind. Speaking ahead of Sunday's Super Bowl, Kelce, who is a tight end for the Kansas City Chiefs, was asked by reporters what he has learnt about Swift's dedication to her craft. \"What I saw on that [Eras Tour] last year was pretty remarkable,\" Kelce replied. \"To see the week in, week out, travelling from one country to the next, how excruciating it is on her body and on her mind. \"It's not just her, it was her entire tour. It was the dancers, it was the band, the singers, it was everybody involved. \"It was an absolute machine, and it was something I could admire watching, and I think about it all the time.\" Spanning five continents, Swift's Eras Tour became the highest-grossing of all time and the second most attended, seen by 10.1 million fans worldwide. The singer played a total of 149 shows, each running for around three hours, the elaborate performance also featured multiple costume changes and a set list of more than 40 songs. Kelce, who has been dating the singer since September 2023, attended multiple shows and even delighted fans when he joined Swift on stage at London's Wembley Arena. Swift's support and possible proposal? Although focus is firmly on Kelce as the Chiefs prepare to take on the Philadelphia Eagles in a bid to win an unprecedented third consecutive Super Bowl title, questions about his love life have dominated the build up to the game. The 14-time Grammy Award-winning singer was born in Philadelphia - the largest city in Pennsylvania - but when asked what team would get her full support, Kelce said he thinks this year she will be \"wearing red\" (the colour of the Chiefs). \"I know her father is an Eagles fan,\" he said, adding: \"But she'll be all for the Chiefs this time around for sure.\" The footballer was also quick to shut down questions on whether he plans to give Swift an engagement ring, should the Chiefs win a three in a row. When asked, he simply responded: \"A Super Bowl ring? Next question.\" Swift has become a regular feature at Chiefs games, last seen cheering Kelce and his teammates on as they beat the Bills in the AFC Championship game that secured their place in the Super Bowl, and came on to the field at the Arrowhead Stadium after their victory to kiss him as confetti fell behind them. Read more from Sky News:Buffy The Vampire Slayer: Sarah Michelle Gellar confirms revivalBlake Lively and Justin Baldoni's legal battle explained She also attracted plenty of attention in her own right at last year's game, as she was making a much-discussed journey from her concert in Tokyo in time for the big kick-off in Las Vegas. In the end she made it with plenty of time to spare, and went on to enjoy herself after the Chiefs' 25-22 win over the 49ers."
    },
    {
        "title": "Buffy The Vampire Slayer: Sarah Michelle Gellar confirms revival of hit TV series is in the works",
        "description": "Sarah Michelle Gellar has responded to reports about a reboot of Buffy The Vampire Slayer, confirming the hit nineties TV drama is set to return.",
        "url": "https://news.sky.com/story/buffy-the-vampire-slayer-sarah-michelle-gellar-confirms-revival-of-hit-tv-series-is-in-the-works-13304453",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sarah-michelle-gellar_6821886.jpg?20250207041429",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-07 02:25:00",
        "Headline": "Buffy The Vampire Slayer ran for seven seasons from 1997, with its finale episode airing in May 2003.",
        "Content": "Sarah Michelle Gellar has responded to reports about a reboot of Buffy The Vampire Slayer, confirming the hit nineties TV drama is set to return. The actress, who played Buffy Summers, has shared details about why she decided to return to her days as a slayer, almost 22 years after the show ended. The series, created by writer and director Joss Whedon, featured Gellar, 47, as one in a long line of young women chosen by fate to battle evil forces in the fictional US town of Sunnydale. Now the star has posted a message on Instagram confirming her involvement in a revival of the drama, although did not reveal if it will be a reboot or sequel. She described a conversation three years ago with director Chloe Zhao \"to hear her take on a potential 'Buffy' revival\". \"Our twenty minute coffee quickly turned into a four hour adventure. We laughed, we cried, but mostly we both talked about how much this show means to us,\" she wrote, adding that at the time she didn't agree to continue Buffy's story. She added that she did \"shock\" herself by agreeing to continue the conversation \"until ultimately, one day, we landed on an idea\". \n                  The Eternals - 'We have to work together': Stars Salma Hayek, Gemma Chan, Kit Harington and Kumail Nanjiani on saving the planet\n                 \n                  Marvel reveals trailer for long-awaited Eternals - with director Chloe Zhao at the helm\n                 \n                  Oscars 2021: China censors social media posts about Chloe Zhao's Best Director win\n                 On Monday, Variety reported that Gellar was in \"final talks\" to play the iconic character, although she would not lead the new series, which would focus on a new slayer. The US entertainment news outlet also said it had been told by sources that the sequel \"is nearing a pilot order at [US streaming network] Hulu\". Buffy The Vampire Slayer ran for seven seasons from 1997, with its finale episode airing in May 2003. It also featured British actor Anthony Stewart Head who starred as Giles, Buffy's Watcher, along with her schoolfriends Willow and Xander from Sunnydale High, played by Alyson Hannigan and Nicholas Brendon respectively. The show was so successful that the character Angel - a cursed vampire who is Buffy's love interest - got his own spin-off series. The actor who played him, David Boreanaz, also went on to star in the long-running police series, Bones. Gellar wrote that she has always listened to the fans and heard their desires to revisit Buffy and her world. \"But it was not something I could do unless I was sure we would get it right. This has been a long process, and it's not over yet,\" she added. \"I promise you, we will only make this show if we know we can do it right. And I will tell you that we are on the path there.\" Read more from Sky News:TV chef denies inappropriate behaviourTrump sanctions International Criminal CourtAlerts issued as temperatures plummet Nora Zuckerman and her sister Lilla Zuckerman are confirmed as part of the team - reportedly writing the pilot. They have both previously collaborated on shows such as Fringe, Suits and Agents of S.H.I.E.L.D. Chloe Zhao - best known for her Oscar-winning film Nomadland - is attached to direct. Dolly Parton will be among the executive producers via her production company Sandollar, which was responsible for the original Buffy the Vampire Slayer and Angel television series."
    },
    {
        "title": "FM25 cancelled: Makers of Football Manager video game issue update after release delays",
        "description": "The makers of video game Football Manager 25 have cancelled its release after a number of delays.",
        "url": "https://news.sky.com/story/fm25-cancelled-after-release-delays-13304547",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-football-manager-25_6821996.jpg?20250207090000",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-07 09:09:00",
        "Headline": "The game's makers say their attention will now turn to creating a new era for the Football Manager series.",
        "Content": "The makers of video game Football Manager 25 have cancelled its release after a number of delays. The game's release date had already been pushed back twice and its makers said they knew the latest news would \"come as a huge disappointment\". In an update on Thursday, Sports Interactive said it had made the \"difficult decision\" to cancel the release entirely after \"internal discussion and careful consideration with Sega\". Instead, their focus will now turn to the next release, Football Manager 26, expected to be released later this year. The makers said they were \"very sorry\" to have \"let down\" those who had pre-ordered the game. Football Manager was first released in November 2004 and its most recent release hit stores in November 2023. The latest in the series can be played on a variety of platforms, including Xbox One, PlayStation 5 and Nintendo Switch. It became the \"most played\" in the history of the franchise, having had seven million players within 100 days of its release. Sports Interactive said it had hoped to create \"the biggest technical and visual advancement in the series for a generation\" with the launch of Football Manager 25. The company said the game was delayed \"due to a variety of challenges\", until it became \"unmistakably clear\" that it would not achieve the expected standard, even with more time. Expanding on the delays, the statement added the \"overarching player experience and interface is not where [the company needs] it to be\". Read more from Sky News:Cancer nurse struck off after 'financially grooming' patientSearch under way for missing plane carrying 10 people While Sports Interactive says it \"could have pressed on\", it was \"unwilling to go beyond a March release\" as it was \"too late in the football season\". The company added that its \"full focus\" is now on creating a new era for the Football Manager series."
    },
    {
        "title": "A look at Gino D'Acampo's meteoric rise - as he denies allegations against him",
        "description": "Gino D'Acampo has \"firmly\" denied allegations&#160;of inappropriate and intimidating behaviour on the sets of his TV shows.",
        "url": "https://news.sky.com/story/a-look-at-gino-dacampos-meteoric-rise-as-he-denies-claims-against-him-13304533",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gino-dacampo-chef-this-morning_6822172.jpg?20250207121311",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-07 08:53:00",
        "Headline": "D'Acampo is one of the most recognisable chefs on TV. He also has numerous cookbooks and restaurants to his name. But how has his career unfolded?",
        "Content": "Gino D'Acampo has \"firmly\" denied allegations of inappropriate and intimidating behaviour on the sets of his TV shows. The chef's actions, over a period of more than 12 years, were described by dozens of people as \"unacceptable\", \"distressing\" and \"horrendous\", according to an investigation by ITV News. Denying all the allegations, D'Acampo told ITV he \"would not do anything that I thought would upset or distress anyone\". He added: \"I am a father, husband... the suggestion that I have acted in an improper way against is deeply upsetting.\" With over 25 years of presenting experience, D'Acampo is one of the most recognisable chefs on TV. He also has numerous cookbooks and restaurants to his name. But how has his career unfolded? Who is he? Born in Torre del Greco, Naples, in southern Italy, D'Acampo learned to cook from his grandfather, according to his official website. He went on to train at Luigi De Medici catering college in Florence and made the move to London at the age of 18. His love of food led to him starting and co-owning Bonta Italia in 2003, which imports Italian produce to restaurants, supermarkets and manufacturers in the UK. This led to him appearing as a guest on the Good Food television channel and since 2009, he has been a regular on cooking segments on ITV's This Morning. Using what his website describes as \"cheeky wit\", the chef soon became known for his risqué comments and sexual innuendos. Also in 2009 the chef headed into the Australian jungle for I'm A Celebrity Get Me Out Of Here, where he was crowned king of the jungle, narrowly beating TV personality Kim Woodburn. Family life D'Acampo has been married to Jessica Stellina Morrison for nearly 25 years. The pair reportedly met when they were teenagers while they were both working at a restaurant in Marbella. They have three children together - Luciano, Rocci, and Mia. Television career Proving popular with viewers, D'Acampo started to host his own cookery shows, including Gino's Italian Escape, which over a number of series, sees him travelling around Italy in search of authentic recipes from his homeland. He also paired up with model Melanie Sykes for ITV's Lets Do Lunch in 2011, which saw him cook three recipes each episode while a celebrity guest be interviewed. In 2017, D'Acampo went head-to-head with fellow chef Gordon Ramsay and maitre d'hotel Fred Sirieix to produce a festive menu for people who work in the emergency services. The trio were a hit and reunited for travel and food series Gordon, Gino and Fred's Ultimate Road Trip. Subsequent series of the show saw them travel across America, Greece and Spain. Most recently, the trio became a duo, with D'Acampo and Sirieix returning for Gino & Fred: Emission Impossible, which sees the pair visit Austria to track down sustainable produce and immerse themselves in environmentally friendly lifestyles. In 2020, the chef became the face of long-running game show Family Fortunes, after it was revived after 17 years. The latest series, which was filmed in 2023, is not currently scheduled for broadcast and ITV has no plans to work with D'Acampo, ITV News reported. Restaurants and cookbooks Away from presenting, D'Acampo has seven restaurants across the UK including in Manchester, London, Liverpool and Leeds. Read more from Sky News:Buffy The Vampire Slayer is backTaylor Swift's Eras Tour was 'excruciating' on her body and mind Throughout his career he has published 20 cookbooks, ranging from one directly aimed at getting children into cooking and another which uses recipes that can all be made using an air fryer. The chef also partnered with supermarket chain Asda in 2021 to release a range of 75 products including cookware, homeware, and appliances."
    },
    {
        "title": "TV bosses need to get the message – check more on staff on the end of a star's pursuit of a cheap laugh",
        "description": "Here we go again. Another broadcaster following pretty much the same recipe card as the last one.",
        "url": "https://news.sky.com/story/tv-bosses-need-to-get-the-message-8211-check-in-more-on-staff-on-the-end-of-a-stars-pursuit-of-a-cheap-laugh-13304894",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gino-dacampo_6821849.jpg?20250206225804",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-02-07 19:12:00",
        "Headline": "Gino D'Acampo denies claims made about his behaviour on shows, but was he able to say and do anything he liked because he brought in the cash for ITV, as one woman alleged?",
        "Content": "\n          Arts and entertainment correspondent\n        Here we go again. Another broadcaster following pretty much the same recipe card as the last one. What's the best way to distance yourself from the alleged bad behaviour of a top celebrity chef that's making headlines? Distance yourself by pointing the finger of blame at the independent production company that makes his shows, then simply repeat the term \"robust duty of care policies\" until everything's cooled down. The only problem is this kind of approach tends to leave a bad taste in the mouth. Those who both pay for and air the shows where staff claim to have been too scared to \"speak up\", it seems to often end up trading responsibility just because they weren't the ones pressing record. Gino D'Acampo \"firmly denies\" claims made about his behaviour off-set and there will be those who cry \"but what's he actually done wrong?\" While ITV is now clearly distancing itself from its former star - shelving an entire new series of Family Fortunes and saying it has no plans to work with him again - the onus really needs to be on the broadcaster to follow-up. \n                  A look at Gino D'Acampo's meteoric rise - as he denies allegations against him\n                 \n                  TV chef Gino D'Acampo denies dozens of allegations of inappropriate behaviour\n                 Read more: A look at D'Acampo's meteoric rise In a position of power, was D'Acampo able to say and do anything he liked? An anonymous woman quoted in the ITV News investigation claims talent was \"furiously protected\" because they brought in the cash. At the very least, going forward, while ITV says it makes sure production companies know what standards it expects, bosses need to get the message that if you're airing a show where one of its stars regularly gets his junk out on screen in pursuit of a cheap laugh, it might just be worth checking-in a little more on the wellbeing of those who're filming it."
    },
    {
        "title": "Sky News nominated for nine RTS television journalism awards",
        "description": "Sky News has received nine nominations in the RTS TV journalism awards, including for news channel of the year.",
        "url": "https://news.sky.com/story/sky-news-nominated-for-nine-rts-television-journalism-awards-13304564",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-yalda-hakim-sednaya-prison_6773904.jpg?20241212080822",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-07 10:50:00",
        "Headline": "A number of our correspondents and presenters are in the running at the prestigious Royal Television Society event.",
        "Content": "Sky News has received nine nominations in the RTS TV journalism awards, including for news channel of the year. Our coverage from the scene of the Southport stabbings - fronted by Sarah-Jane Mee - is also named in the breaking news award, alongside BBC coverage of the Trump assassination bid and Reuters' work on the Hezbollah pager explosions. Sky's nominations span eight categories - with a number of correspondents and presenters in the running for awards.  Beth Rigby and Sam Coates, our political editor and deputy political editor, make up two of the three nominees in their category. Their work over the last year included extensive coverage of July's election - with highlights including Rigby's questioning of Rishi Sunak and Keir Starmer in Grimsby. The World With Yalda Hakim also goes up against Channel 4 News and ITV News for network daily news programme of the year. The show's leading interviews have included several exclusives with the Qatari prime minister - a key mediator in Gaza ceasefire talks - in which he warned January's deal was \"the last chance for peace\".  Sky News' coverage of the Sudan war, by Africa correspondent Yousra Elbagir and her team, has also been recognised in the international news category alongside work by CNN and ITV on Gaza. Chief correspondent Stuart Ramsay - who won an international Emmy in September for coverage of the Myanmar war - is nominated for network TV journalist of the year.  Ramsay's work has included an exclusive with President Zelenskyy in which he suggested a ceasefire could be agreed if Ukrainian territory went \"under the NATO umbrella\" and boarding \"The Beast\" train carrying migrants towards America. Sophy Ridge, Sky News' lead political presenter who presents a weeknight show from 7-8pm, and data and forensics correspondent Tom Cheshire are also nominated for best network presenter and specialist journalist respectively.  The RTS journalism awards, hosted by ITV's Tom Bradby, take place on 5 March at London's Park Lane Hilton. Read more from Sky News:Cancer nurse struck off after 'financially grooming' patientTrump faces stick or twist choice in China space race  Adrian Wells, chair of the RTS awards, said: \"In a globally tumultuous year, our nominees exemplify the vital work that journalists carry out in the news media industry, especially within a time where accuracy, transparency and compassion in reporting is so important. \"We look forward to recognising the high calibre of expertise and celebrating the achievements of the journalists at our awards ceremony next month.\""
    },
    {
        "title": "More than 100 venomous snakes removed from Sydney back garden",
        "description": "One hundred and two venomous snakes have been removed from a suburban back garden in Sydney.",
        "url": "https://news.sky.com/story/more-than-100-venomous-snakes-removed-from-sydney-back-garden-13304615",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-snakes-red-belly-black-snakes_6822007.jpg?20250207091352",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-02-07 11:13:00",
        "Headline": "Experts say the snakes might have grouped together for safety or due to a shortage of suitable habitats to give birth.",
        "Content": "One hundred and two venomous snakes have been removed from a suburban back garden in Sydney. David Stein called experts after seeing six snakes moving around in a pile of mulch and discovered that red-belly blacks pile on top of each other before giving birth. Snake catcher Dylan Cooper was drafted in the same afternoon and bagged up five adults and 97 babies. Reptile Relocation Sydney said two of the adults gave birth to 29 snakes in the bag while the clean-up was still taking place. Company owner Cory Kerewaro said the highest number he'd heard about in a similar job was 30 non-venomous carpet pythons. However, that snake hatches from an egg whereas red-belly blacks give birth. \"You can get a decent number like that when the babies are hatching,\" Mr Kerewaro said. \"But to have this many venomous snakes, no one's come across it.\" The species normally has a litter of between four and 35 young. Snake expert and author Scott Eipper said the snakes might have grouped together for safety or due to a shortage of suitable habitats to give birth. \"This is an isolated incident. It's certainly a very rare occurrence,\" he said. The snakes have started a new life in an undisclosed national park after authorities granted permission for them to be released. Read more from Sky News:River in Argentina turns bright redGreece declares state of emergency on Santorini \"Because there was such a large number, obviously people were a bit concerned where 100 snakes were going to go,\" Mr Kerewaro said. \"They'll be far enough away to avoid any human interaction: 100 snakes are going into the middle of the bush in the middle of nowhere,\" he added. Meanwhile, Mr Stein has vowed to get rid of the mulch as soon as possible after being warned the snakes could return if it's not shifted."
    },
    {
        "title": "Australian politician changes his name to 'Aussie Trump'",
        "description": "An Australian politician has legally changed his name to Austin Trump in a move inspired by Donald Trump - in what he said was a protest against the country's ruling centre-left Labor Party.",
        "url": "https://news.sky.com/story/australian-politician-changes-his-name-to-aussie-trump-13304500",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ben-dawkins-australia_6821911.jpg?20250207070021",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-02-07 07:23:00",
        "Headline": "\"I would love you to reach out Donald, just ring the office here,\" the Australian politician says, who has changed his name in what he describes as a political protest.",
        "Content": "An Australian politician has legally changed his name to Austin Trump in a move inspired by Donald Trump - in what he said was a protest against the country's ruling centre-left Labor Party. Ben Dawkins - who is an independent MP in Western Australia's upper house of parliament where Labor holds a majority - is now listed as \"Aussie Trump\" on the WA parliamentary website. He has also changed his username to \"Hon. Aussie Trump MLC\" on his X account. \"I've launched a political protest against the tyranny and systematic corruption of the Labor government in WA,\" he wrote, in a post on the social media platform, signing off as \"Aussie\". \"Vote Labor Out! & Drill Baby Drill!,\" he wrote in a second post, appearing to echo the US president's plan to increase the extraction of oil and gas in the United States. He also posted a photo showing legal confirmation of the name change from Western Australia's Registry of Births, Deaths and Marriages. \"I want to be like Trump in the sense of calling out woke leftist nonsense,\" he told 9News. \"I would love you to reach out Donald, just ring the office here.\" Read more from Sky News:Trump sanctions International Criminal CourtMake the Moon Great Again - or lose it to China? \"This is simply attention-seeking stuff,\" said Western Australia's Premier Roger Cook, the state's Labor leader, at a news conference on Thursday. \"I'm not sure how much lower he can go.\" Western Australia state elections are due to take place in March, before the country goes to the polls in a nationwide vote that must be held before 17 May."
    }
]