[
    {
        "title": "Police name firefighters and business owner killed at former RAF base in Bicester",
        "description": "Two firefighters who died at a former RAF base in Oxfordshire have been named as Jennie Logan and Martyn Sadler.",
        "url": "https://news.sky.com/story/two-firefighters-and-one-other-person-die-after-fire-at-former-raf-base-in-oxfordshire-13368819",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-bicester-fire-oxfordshire_6918877.jpg?20250516221941",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-16 08:39:00",
        "Headline": "Two other firefighters sustained serious injuries in the blaze and were taken to hospital after Thursday evening's fire.",
        "Content": "Two firefighters who died at a former RAF base in Oxfordshire have been named as Jennie Logan and Martyn Sadler. David Chester, who ran a construction business from the site, was also killed in the blaze in Bicester on Thursday evening. London Fire Commissioner Andy Roe said Mr Sadler, 38, was on call for Oxfordshire Fire and Rescue Service (OFRS), but was part of blue watch in Ealing, west London, where he was a leading firefighter/sub-officer. He also confirmed Ms Logan, 30, worked for the Oxfordshire service.  Ten fire and rescue crews were called to tackle the blaze at 6.39pm, which prompted a major response and warnings for local residents to stay indoors. Eyewitnesses described seeing the \"black\" smoke in the sky from the other side of town. The ex-RAF base is now used by Bicester Motion, a business park that hosts classic car and aviation firms. Its boss Daniel Geoghegan said Mr Chester, 57, had run a business, Chesters & Sons, on the site for 12 years. The chief executive called him a \"part of the fabric of our estate and a friend to us all\". \"Our whole community used to say that 'Dave always had our back'. Yesterday, he was doing just that - the epitome of his selfless spirit,\" Mr Geoghegan said. He added: \"We will cherish you Dave and you will be sorely missed, and we send our utmost love to Sue, Jordan and Riley.\" The company website says its work at Bicester Motion \"included carefully unearthing four buried wartime air raid shelters so as not to damage the structures to allow them to be renovated by another contractor\". Mr Geoghegan also sent \"heartfelt condolences\" to the firefighters' families and said Ms Logan and Mr Sadler had \"bravely tackled the scene\". \"No words can ever make up for what has happened, but they are all very much in our hearts,\" he said. Two other firefighters sustained serious injuries in the blaze and were taken to hospital.  Chief Fire Officer Rob MacDougall, from Oxfordshire Fire Service, announced the deaths earlier on Friday. \"It is with a very heavy heart that we today report the loss of two of our firefighters. Families have been informed and are being supported,\" he said. \"Our thoughts are with them at this most difficult of times and we ask for privacy to be respected.\" He appeared to hold back tears as he talked about how \"proud and grateful\" he was. London Fire Commissioner Andy Roe said Mr Sadler \"exemplified courage and selflessness\". Read more from Sky News:Prison governor jailed over relationship with drug bossMelania Trump statue goes missing from her hometown  Footage on social media showed plumes of black smoke and flames swallowing the large building. Kieran McGurk, who lives opposite the site, said he heard \"multiple explosions\" and \"loud bangs\". Another resident - who gave her name only as Ellie - said she \"heard loads of pops and crackles and bangs\". Assistant Chief Constable Tim Metcalfe said Thames Valley Police were investigating but the fire wasn't currently being treated as a criminal matter. Prime Minister Sir Keir Starmer said the deaths were \"devastating news\" and he hoped \"those in hospital make a full and swift recovery\". Conservative leader Kemi Badenoch said her \"heart goes out to the families of those people who have lost their lives and those who are still on the front line\"."
    },
    {
        "title": "Up to a million Palestinians could be 'permanently relocated' to war-torn Libya under US plans",
        "description": "Up to a million Palestinians could be permanently relocated from devastated Gaza to war-torn Libya under plans being worked on by Donald Trump's administration, NBC News reports.",
        "url": "https://news.sky.com/story/up-to-a-million-palestinians-could-be-permanently-relocated-to-war-torn-libya-under-us-plans-13369235",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-strike_6917173.jpg?20250515130758",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-16 20:29:00",
        "Headline": "Palestinians would reportedly be resettled from their homes in Gaza to Libya, a country that remains divided with two rival governments fighting for control.",
        "Content": "Up to a million Palestinians could be permanently relocated from devastated Gaza to war-torn Libya under plans being worked on by Donald Trump's administration, NBC News reports. The idea has been discussed with Libya's leadership, sources told Sky's US partner network, and would potentially see billions of dollars in frozen Libyan funds released. The North African country remains divided in two - nearly 14 years after the overthrow of dictator Muammar Gaddafi sparked a civil war - with two rival governments fighting for control. It comes as Israel continues a campaign of airstrikes on Gaza, with 93 people killed and hundreds injured on Friday, according to local medics.   No final agreement on any Libya plans have been reached, sources told NBC News, and US government agencies did not respond to requests for comment from the news outlet. Previous suggestions to resettle Palestinians from Gaza - voluntarily or otherwise - have provoked international outcry, particularly from Arab states who likely will play a role in rebuilding the enclave after any permanent ceasefire deal. And Libya is far from a safe nation, according to the US State Department's own travel advice, which says Americans should not travel to the country \"due to crime, terrorism, unexploded landmines, civil unrest, kidnapping, and armed conflict\". President Trump, speaking on the final day of his Middle East trip, said he was looking to resolve a range of global crises, including Gaza. \"We're looking at Gaza,\" he said. \"And we've got to get that taken care of. A lot of people are starving. A lot of people are - there's a lot of bad things going on.\" There had been hopes that his tour of the region could increase the chances of a ceasefire deal or prompt Israel to lift its blockade of Gaza that is preventing humanitarian aid from getting in. But instead Israel has continued to launch airstrikes on the territory, killing more than 250 people in the last two days, according to Hamas-run health authorities. 👉 Follow Trump100 on your podcast app 👈 The Israeli military, which had dropped leaflets on the northern town of Beit Lahia ordering residents to leave, said their airforce had struck more than 150 military targets across Gaza in recent days. This week, Israel said it had bombed the European Hospital because it was home to an underground Hamas base, but Sky News analysis has cast doubt on its evidence. Israeli officials said the latest strikes were a prelude to a larger military campaign in Gaza aimed at pressuring Hamas to release hostages.  Read more:How Israel has escalated Gaza bombing campaignTrump risks becoming impatient and losing interest in Gaza Ahmed Abu Riziq, founder of the Gaza Great Minds Foundation, which seeks to give children access to education in Gaza, said \"the hell doors opened\" in the last few days. Speaking to Sky News from Gaza City, he said: \"Myself with my family, we had to flee today from some certain areas in northern Gaza City... people are running in the streets. They don't know where to go or where to sleep at night. So it's really catastrophic.\" \"No food is entering Gaza,\" he added, saying that people are dying from hunger. Prime Minister Benjamin Netanyahu said this month that Israel plans to seize all of Gaza and hold it indefinitely. Tom Fletcher, head of the UN office for the coordination of humanitarian affairs, warned the Security Council this week it must \"act now\" to \"prevent genocide\" - a claim Israel vehemently denies."
    },
    {
        "title": "How Israel has escalated Gaza bombing campaign",
        "description": "A wave of deadly strikes in northern Gaza has marked a significant escalation in Israel's offensive.",
        "url": "https://news.sky.com/story/how-israel-has-escalated-gaza-bombing-campaign-13369088",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-dandf-teaser-rafah_6918639.jpg?20250516180213",
        "type": "Home",
        "Author": "Ben van der Merwe, Kaitlin Tosh, Sam Doak, Freya Gibson and Michelle Inez Simon, Data &amp; Forensics",
        "Date Published": "2025-05-16 16:00:00",
        "Headline": "Israel says the strikes are preparatory moves for a larger operation, which is expected to involve displacing Gaza's entire population. Officials had threatened a new offensive if no hostage deal was reached by the end of President Trump's visit to the region.",
        "Content": "By Ben van der Merwe, Kaitlin Tosh, Sam Doak, Freya Gibson and Michelle Inez Simon, Data & Forensics  A wave of deadly strikes in northern Gaza has marked a significant escalation in Israel's offensive. The Israeli military (IDF) says it has struck \"over 150 terror targets\" across the Gaza Strip in the past 24 hours - an average of one airstrike every ten minutes. At least 109 people have been killed in the strikes, according to the Hamas-run health ministry, bringing the total number killed this week to 284. That number may rise further. On Friday morning, the director of Gaza City's Al Shifa hospital told Al Jazeera that more than 250 people had been killed in the previous 36 hours alone.   Nurse and his family killed in strike The impact of this new bombardment is cataclysmic, as this video of an Israeli airstrike in Jabalia, northern Gaza, verified by Sky News, shows. \n                  NHS waiting list increases for first time in seven months\n                 \n                  Gaza hospital attack: Analysis contradicts Israel's evidence justifying airstrike\n                 \n                  The online drug trade behind QR code stickers plastered on streets across the UK \n                 Other videos show huge smoke clouds rising from airstrikes on residential neighbourhoods surrounding the city's Indonesian Hospital. The hospital's director, Dr Marwan al Sultan, told Sky News: \"There is a shortage of everything except death.\" Among those killed in Jabalia on Friday was 42-year old Yahya Shehab, a nurse for the Palestine Children's Relief Fund (PCRF). He was killed alongside his wife Tamara, 37, and their five children: Sarah, 18, Anas, 16, Maryam, 14, Aya, 12 and Abdul, 11. He is survived by his niece Huda, 27, a civil engineer, who lives nearby with her husband Ahmad Ngat, 31, and their two young sons, Mohammed, seven, and Yusuf, four. Ahmad remembers Yahya as kind and generous, and that he would use his skills as a nurse to treat Mohammed and Yusuf whenever they were sick. \"His kids were great too,\" Ahmad says. \"May God have mercy on them.\" Operation Gideon Chariot  An Israeli official said Friday's strikes were preparatory actions in the lead-up to a larger operation. Earlier this month, Israel's security cabinet approved \"Operation Gideon Chariot\" - a plan to \"capture\" all of Gaza and force its entire population to move to a small enclave in the southern Gaza Strip. At the time, a defence official said the operation would go ahead if no hostage deal was reached by the end of US President Donald Trump's visit to the Middle East. That visit ended on Friday, 16 May.  👉 Follow Trump100 on your podcast app 👈 Hamas had proposed releasing all hostages in exchange for a permanent end to the war. Last month, Hamas turned down Israel's offer of a temporary ceasefire in exchange for the militant group laying down its weapons and releasing half the living hostages. Finance minister Bezalel Smotrich, who sits in the security cabinet, said of Operation Gideon Chariot that Gaza would be \"entirely destroyed\", and that its population will \"leave in great numbers to third countries\".  Ahmad says he is ready to leave Gaza with his family at the earliest opportunity. \"We want to live our lives,\" he says. His wife Huda grieving the loss of her uncle Yahya, is seven months pregnant. The family are constantly struggling to find enough food for her and the children, he says. \"Unfortunately, she suffers greatly,\" Ahmad says. \"She developed gestational diabetes during this pregnancy.\" Israel has prevented the entry of all food, fuel and water since 2 March. On Monday, a UN-backed report warned that one in five people in Gaza were facing starvation. Satellite imagery may show new aid hubs  Under new proposals backed by the US, Israel now intends to control the distribution of aid via private military contractors. The proposals, set to start operating by the end of May, would see aid distributed from militarised compounds in four locations around the Gaza Strip. Satellite imagery from recent weeks shows Israel has constructed four compounds which could be used for aid distribution. Construction began in April and was completed by early May. Three of these are clustered together in the southwest corner of the Gaza Strip, with one in the central Netzarim corridor. None are located in northern Gaza, where Ahmad and Huda's family live. The UN has called this a \"deliberate attempt to weaponise\" aid distribution and has refused to participate. The planned aid distribution system is being coordinated by a new non-profit, the Gaza Humanitarian Foundation (GHF), which was set up in February in Switzerland. Its board includes a former head of World Central Kitchen, as well as people with close ties to the US military and private military contractors. Proposals drawn up by the GHF say the four planned aid distribution sites could feed around 1.2 million people, approximately 60% of Gaza's population. The GHF later requested that Israel establish additional distribution points. Speaking to the UN Security Council on Tuesday, UN Relief chief Tom Fletcher said the plan \"makes starvation a bargaining chip\". \"It is cynical sideshow. A deliberate distraction. A fig leaf for further violence and displacement,\" he said. Read more:Up to a million Palestinians could be 'permanently relocated' to LibyaTrump risks becoming impatient and losing interest in Gaza Large areas of Gaza have already been razed in recent weeks, including vast tracts of the southern city of Rafah, where many had fled during the war's early stages. Sky News analysis of satellite imagery shows approximately two-thirds of Rafah's built-up area (66%) has been reduced entirely to rubble, with buildings across much of the rest of the city showing signs of severe damage. On Thursday, Human Rights Watch executive director Federico Borello said the UK and US have a duty, under the Genocide Convention, to \"stop Israeli authorities from starving civilians in Gaza\". He said: \"Hearing Israeli officials flaunt plans to squeeze Gaza's two million people into an even tinier area while making the rest of the land uninhabitable should be treated like a five-alarm fire in London, Brussels, Paris, and Washington.\" Israeli government spokesman David Mencer said on Friday that Israel's new offensive is intended to secure the release of its hostages. \"Our objective is to get them home and get Hamas to relinquish power,\" he said. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "'He's the chosen one': Meet the 14-year-old British boxer now fighting for Bahrain",
        "description": "Only the most ardent followers of boxing will know of Jayden Price, the 14-year-old from Gloucester.",
        "url": "https://news.sky.com/story/hes-the-chosen-one-meet-the-14-year-old-british-boxer-now-fighting-for-bahrain-13369302",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-jayden-price-boxing_6918956.jpg?20250516231445",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-05-16 23:01:00",
        "Headline": "In three years, Jayden Price is aiming to top the podium at the Los Angeles Olympics - but he won't be representing Team GB, having signed up last month to fight for Bahrain.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  Only the most ardent followers of boxing will know of Jayden Price, the 14-year-old from Gloucester. But, in three years, this multiple English youth champion is aiming to top the podium at the Los Angeles Olympics. It won't, however, be God Save The King playing. No Team GB vest will be worn. Because this is an Olympic dream diverting from southwest England via the Middle East. And now, in exclusive interviews with Sky News, it is time for Jayden to reveal all with his coach and father. \"After the European Championships last year, Bahrain reached out to us wanting to sign me to represent their country. So now I represent Bahrain,\" Jayden explains. \"Obviously it's a special feeling to feel like I'm the one that's been reached out to and chosen to represent them.\" It is a decision, given his family's lack of previous connections to the Gulf nation, that has led to them receiving some disparaging comments. There are, of course, financial motivations such as facilitating and funding Jayden's sporting ambitions, while prioritising his wellbeing and private tuition. It was barely a month ago that a young life was transformed with contracts signed in the presence of Bahraini royalty. Jayden says: \"The agreements have been going on for so long, I had time to think, 'OK this is actually going on now'. Time to get used to it.\" Social media caught the attention of Bahrain Olympic Committee chair Jayden's journey being documented by his father, Lee Price, on social media apparently caught the attention of Bahrain Olympic Committee chairman Sheikh Khaled bin Hamad Al Khalifa, who was keen to engage more youngsters in sport. \"As discussions progressed, the focus shifted toward Jayden's long-term ambitions - particularly his aspirations to compete at the Olympic level,\" Mr Price says. \"The Bahraini sporting authorities then explored how they could support Jayden in achieving these goals. \"Bahrain's support package would allow Jayden to maintain his amateur status through to the 2032 Olympic Games in Brisbane, aligning with his long-term development and Olympic ambitions.\" 'It's good to secure it' One thought was that Jayden wouldn't make the cut yet for Team GB's LA 2028 squad and he would need to go professional to start earning money before the 2032 Games. \"It would have been difficult, because on the GB setup there are a lot of good boys,\" he says. \"I think I could have got there but there was a risk that I couldn't have. So it's good to secure it.\" Bahrain's lucrative deal opens up the possibility of two Olympic appearances while staying in the safer amateur ranks longer, with larger and more padded gloves softening blows. But inevitably when making such a decision, financial factors enter the conversation. \"In addition to the benefits of more international exposure, representing a different country can help create a distinctive personal brand,\" Mr Price says. \"This can open doors to sponsorship opportunities from the Middle East and beyond.\" All eight of Bahrain's Olympic medals have been won by imported athletes Britain, for decades, has chased and embraced investment from the Middle East, particularly in sport. So this could be considered reversing the flow of the pipeline and sharing sporting talent in the other direction. And overseas-born athletes, with no previous connections to Britain, have competed for Team GB. There is just a greater reliance in the former British protectorate with oil and gas wealth to spend and a population of Bahrainis under 800,000. All eight Olympic medals ever won by Bahrain have been won by imported athletes. Can Jayden deliver their first in boxing? \"That was the aim for them, to be fair, to hopefully bring me over and hopefully I can start winning them a lot of medals,\" he says. First gold medal won under Bahrain flag When we meet, there is already a first gold medal won under the flag of Bahrain in the collection of honours we are filming. Under the radar, just a couple of weeks earlier, Jayden was in the Jordanian capital Amman competing in an Asian boxing championship and winning the U15s 43kg class. \"Obviously things like the national anthem, I have to get used to that,\" he says. \"But just being able to compete for Bahrain now, I think it's a great opportunity.\" Facing UK opponent 'would be a little awkward' How would it feel facing a British opponent in the Olympic final? \"Obviously,\" he says. \"It would be a little bit awkward.\" But on hand to guide Jayden is a long-standing coach. Now there are trips to Manama for Amin Khan from his base at the Truth Boxing Club in the shadow of Gloucester Cathedral. Wearing a Bahrain Olympic Committee T-shirt, the scepticism and concerns are addressed directly. \"There's going to be a lot of questions, of course,\" Mr Khan says. \"But this is about what's best for Jayden and we want to give him that opportunity where he can perform at a very high level from a very early age and continue to develop. \"Boxing's still like a working-class sport, but it obviously is costly and obviously this opportunity does give financial benefits but more so is the benefits that I can offer for him in terms of career opportunity and getting to the Olympics.\" 'He's the chosen one' Precise figures are not mentioned in any conversations. Only that Jayden's family will be comfortable without pressure on him to seek work. \"He can stay amateur until the age of 21,\" Mr Khan says. \"In England you probably wouldn't have been able to do that because you're then put under pressure of turning pro and trying to earn an income because there's not much financial backing. \"And also it's a unique selling point as well. He's the poster boy of Bahrain, he's the chosen one.\" Aspirations to be 'one of the greatest' There is little sign of a swagger or boastfulness in almost three hours spent with Jayden during his first filming session of this kind on such a delicate, life-changing matter. Already 66 of 70 boxing contests have been won after a combat journey that began in Brazilian jiu-jitsu and mixed martial arts aged six. How will his career look two decades from now, by the age of 34? \"Hopefully be retired and I would have been the former undisputed champion,\" he says. \"Just one of the greatest.\" Read more:Eurovision's UK hopefuls who sing their trollers' insultsPrison governor jailed over relationship with drug boss Greatness that will be achieved not under the flag of Great Britain but a country he only visited for the first time last month. Transferring sporting allegiance like this will provoke a reaction. The family wants the public to understand that the money on offer was too irresistible to turn down. But this is the support needed to help Jayden become a boxing star - prioritising his welfare and wellbeing beyond the growing wealth."
    },
    {
        "title": "Prison governor jailed over relationship with drug boss known as Jesse Pinkman",
        "description": "A former prison governor seen as a rising star in the service has been jailed for nine years for having a relationship with an inmate who was the boss of a Liverpool drugs gang, police have said.",
        "url": "https://news.sky.com/story/prison-governor-jailed-over-relationship-with-drug-boss-known-as-jesse-pinkman-13369097",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kerri-pegg-kirkham_6879920.jpg?20250408154553",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-16 15:56:00",
        "Headline": "Kerri Pegg, who admitted in court she had been \"incredibly stupid\", signed off on a temporary release for the drug boss, despite not being entitled to do it, and was driving a Mercedes he paid for with 34kg of amphetamines.",
        "Content": "A former prison governor seen as a rising star in the service has been jailed for nine years for having a relationship with an inmate who was the boss of a Liverpool drugs gang, police have said. Kerri Pegg, 42, was the governor of HMP Kirkham in Lancashire when she met Anthony Saunderson - also known as Jesse Pinkman, named after the drug dealer in the Breaking Bad TV drama - who is now serving 35 years behind bars. Pegg, who had risen from graduate entrant to governor in six years, granted Saunderson a temporary release, even though she was not authorised to do so, the North West Regional Organised Crime Unit (NWROCU) said.   Concerns about their relationship began soon after she started work at the jail, with the two often being in her office with the door closed, Preston Crown Court heard. She had swapped her Honda Jazz for a £12,000 Mercedes, which Saunderson had bought with 34kg (75lbs) of amphetamines, and which was outside her flat in Orrell, Wigan, when police raided it in November 2020. Designer clothes, handbags and jewellery, were found by detectives, along with size 10 Hugo Boss slip-ons and a toothbrush with Saunderson's DNA. Investigators discovered she had been living way beyond her £3,000 a month income, buying Jimmy Choo shoes and Chanel necklaces despite being deep in debt. Pegg tearfully told jurors she had been \"incredibly stupid\" but did not think she had done anything wrong. Barbara-Louise Webster, prosecuting, said Pegg had a promising future, but Saunderson \"was her downfall\". The pair met through an inmate programme called BADD (Beating Alcohol and Drug Dependency), which Saunderson developed and delivered at several jails, even while he was himself running an amphetamines factory. Pegg, who was convicted of misconduct in a public office and possessing criminal property at trial last month, claimed her contact with Saunderson was down to the programme. The court heard Pegg, originally from Bramhall, Stockport, was a governor at HMP Kirkham by 2018, as Saunderson was reaching the end of a 10-year sentence for drug offences. He had been one of Merseyside's most wanted fugitives for his part in importing £19m worth of cocaine in shipments of corned beef from Argentina. Less than two months after being released from Kirkham in May 2019, he was involved in another massive drug conspiracy. Saunderson was jailed for 35 years at Liverpool Crown Court in August 2022 after investigators cracked the Encrochat system - the phone network used by serious organised criminals. It revealed both his drug dealing and his relationship with Pegg. Read more on Sky News:Firefighters die in airbase blazeBest-selling author's attacker jailed'Brazen' carnival murderer jailed Phil Copple, chief executive of HM Prison and Probation Service, said: \"The criminal misconduct in this case lets down the public we serve as well as the vast majority of honest and hardworking prison staff.\" Detective Inspector Brian Morley, from the NWROCU's Prison Intelligence Unit, said Pegg was guilty of \"serious misconduct\", which undermines public trust in prison staff."
    },
    {
        "title": "Cassie Ventura finishes her evidence after days describing alleged rape and 'hundreds' of freak offs",
        "description": "R&B star Cassie Ventura told Sean \"Diddy\" Combs \"I'm not a rag doll, I'm someone's child\", after he allegedly beat her outside a lift at the Intercontinental Hotel in Los Angeles in March 2016, a New York court has heard.",
        "url": "https://news.sky.com/story/cassie-ventura-finishes-her-evidence-after-days-describing-alleged-rape-and-hundreds-of-freak-offs-13369317",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cassie-diddy_6918508.jpg?20250516164535",
        "type": "Home",
        "Author": "Bethany Minelle",
        "Date Published": "2025-05-16 23:07:00",
        "Headline": "During the fifth day of the Sean \"Diddy\" Combs sex-trafficking trial in Manhattan, New York, the court heard details of an alleged rape in 2018, a surprise $10m settlement with the Intercontinental Hotel and \"an attack with a skillet of eggs\".",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n R&B star Cassie Ventura told Sean \"Diddy\" Combs \"I'm not a rag doll, I'm someone's child\", after he allegedly beat her outside a lift at the Intercontinental Hotel in Los Angeles in March 2016, a New York court has heard. Footage of Combs appearing to drag and kick the R&B star in a corridor was initially released by CNN in May 2024. Combs subsequently apologised for his actions.  The footage of the incident, which Cassie says took place after she left a \"freak off\" sex session, has since been widely shared and has been shown to the jury in court as evidence for the prosecution. Combs, 55, faces five criminal counts: one count of racketeering conspiracy; two counts of sex trafficking by force, fraud or coercion; and two counts of transportation to engage in prostitution. He denies the allegations against him. Cassie, whose full name is Casandra Ventura, alleges she was physically abused and degraded for years by the powerful hip-hop star and music executive, accusing him of violence, coercion, blackmail and rape. The 38-year-old, who is the star witness for the prosecution, faced a fourth day on the stand, with the hip-hop mogul's defence lawyers concluding their two-day cross-examination. Heavily pregnant, she is expecting her third child in just a few weeks. \n                  Diddy trial: What we have learned from Cassie's testimony\n                 \n                  Cassie challenged over Diddy 'freak off' allegations - as explicit messages read in court\n                 \n                  Cassie breaks down in tears during Sean 'Diddy' Combs trial as she tells of 'personal shame' and alleged rape\n                 Prosecutors say Combs exploited and used his network of employees to facilitate illegal activities, while defence lawyers have been attempting to show jurors she consented to their highly charged \"swingers lifestyle\". The court also heard further details of Cassie's allegation of rape against Combs, information around her stay at a trauma and addiction centre in Arizona and further messages appearing to show her enthusiasm for freak offs. Sean 'Diddy' Combs trial: Day 5 - As it happened Cassie was asked about singer Chris Brown - who she denied dancing with - and tells the court Combs had form for taking her belongings, including her phone, car and watch, when he was angry with her. An audio recording was also played to the court, appearing to show Cassie threatening a man she claimed to have a video of her at a freak off on his phone, screaming: \"I will f*** you up and it won't be my hand\". It was not clear as to whether such a video ever existed. Cassie was also asked about her use of drugs, and said she had struggled with opioid addiction since 2022. She described a 45-day stay at a rehabilitation centre in Arizona in 2023, where she underwent EMDR (Eye Movement Desensitisation and Reprocessing) to help resolve trauma. The centre specialises in treating \"sex and intimacy issues\", but Cassie confirmed she was treated only for trauma. The court also heard about Cassie's allegation of rape against Combs in August or September 2018, by which time she says they had split up. The pair were together, on and off, for about 11 years from 2007 to 2018. 'I have love for the past, what it was' Describing Combs taking her for dinner at an Italian restaurant in Malibu, she says he raped her after driving her home, after \"acting strangely\" during the meal. When asked if she believed his behaviour was due to his \"bipolar disorder\", Cassie answered \"yes\". The jury was then shown a text message which included a heart emoji, sent by Cassie to Combs the following day. When asked if she still had love for him, she said: \"I have love for the past, what it was.\" Cassie confirmed she saw Combs the following month, when she said she had consensual sex with him, during which her now-husband, personal trainer Alex Fine, attempted to FaceTime her. She said she didn't tell Fine she had been raped by Combs at the time, but that he \"punched a wall\" when she later told him. Combs paid close attention to Cassie's cross-examination, leaning in to read transcripts on the monitor in front of him and passing down notes to his lawyer. Cassie did not look at him throughout the trial. A '$10m' settlement with the Intercontinental Towards the end of her questioning by the defence, Cassie was read a message from Combs in September 2012, in which he asked \"do you want to have our last FO [freak off] tonight?\" - to which she responded, \"I don't want to freak off for the last time, I want it to be the first time for the rest of our lives\". In a surprise turn, Cassie also confirmed that an expected settlement of $10m had been agreed with the Intercontinental Hotel in Los Angeles, where she was assaulted. Following her time in court, she released a statement saying she hoped her testimony would help others \"heal from the abuse and fear\". \"For me, the more I heal, the more I can remember,\" she said. \"And the more I can remember, the more I will never forget.\" The next witness, special agent Yasin Binda, detailed items found during a search of Combs's Park Hyatt hotel room in 2004, following his arrest that year. She showed the court images of exhibits including lubricant and baby oil, drugs and a bum bag containing $9,000 (£6,800) in cash. 'Hit over the head with a skillet of eggs' At the end of the day, Dawn Richard, a former member of girl group Danity Kane and trio Dirty Money, gave evidence, telling the court she observed Combs attacking Cassie, including a time he \"hit her over the head with a skillet of eggs\". She went on to say Combs \"dragged\" Cassie upstairs where she \"heard glass breaking\", adding she had \"never seen anything\" like it before - \"he was punching his girlfriend\". Richard said she didn't intervene or report the incident to the police as she was \"scared\". The singer sued Combs last year, accusing him of physical abuse, groping and psychological abuse during her time working with him. Combs has been jailed since September and faces at least 15 years or possibly life in prison if convicted. The trial is set to last for seven more weeks."
    },
    {
        "title": "First Russia-Ukraine talks since 2022 agree POW swap - but last less than two hours",
        "description": "Russia and Ukraine failed to agree to a ceasefire in their first direct talks since 2022 - as European leaders called Moscow's approach \"unacceptable\" after the discussions lasted less than two hours and Vladimir Putin stayed away.",
        "url": "https://news.sky.com/story/first-russia-ukraine-talks-since-2022-agree-pow-swap-but-last-less-than-two-hours-13369074",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-turkish-foreign-minister_6918654.jpg?20250516183232",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-16 15:38:00",
        "Headline": "Russia and Ukraine agreed to swap 1,000 POWs each as a \"confidence-building measure\" but there's no big progress on a peace deal.",
        "Content": " Russia and Ukraine failed to agree to a ceasefire in their first direct talks since 2022 - as European leaders called Moscow's approach \"unacceptable\" after the discussions lasted less than two hours and Vladimir Putin stayed away. The meeting in Istanbul, Turkey, was set up at short notice on President Putin's behest, but he declined a challenge from Volodymyr Zelenskyy to meet him in person and instead sent relatively junior representatives. A source in the Ukrainian team told Sky News that Russia had threatened \"eternal war\" during the talks. They said the Russians were not ready to talk about technical details of a ceasefire and were waiting for superiors to approve them. Latest updates on Istanbul talks Both countries said they had agreed to trade 1,000 prisoners of war each in what would be the biggest such exchange yet of the conflict. But Kyiv wants the West to impose tighter sanctions unless Moscow accepts a proposal from Donald Trump for a 30-day ceasefire. \n                  Ukraine and Russia's talks in Istanbul were symbolically important - but revealed a stark reality\n                 \n                  Don't get your hopes up of Ukraine peace talks between Donald Trump and Vladimir Putin anytime soon\n                 \n                  Thousands of Ukrainian civilians lost in hellish archipelago of Russian jails\n                 President Zelenskyy said after the meeting that he had spoken to Mr Trump by phone - alongside Sir Keir Starmer and the leaders of France, Germany and Poland - who all met in Albania on Friday. In a post on X, he said Ukraine was \"ready to take the fastest possible steps to bring real peace\" and that \"tough sanctions must follow\" if Russia continues to resist a month-long truce. Frustration over Russia's perceived stalling in holding serious negotiations was also clear from the European leaders gathered in Tirana. \"The Russian position is clearly unacceptable, and not for the first time,\" said Sir Keir. \"So as a result of that meeting with President Zelenskyy and that call with President Trump we are now closely aligning our responses and will continue to do so.\" Read more:Istanbul talks symbolically important - but revealed stark realityDon't get your hopes up of talks Trump-Putin talks anytime soon The UK prime minister said the no-show by Russia's leader was \"more evidence that Putin is not serious about peace\" and has \"been dragging his heels\". NATO secretary-general Mark Rutte, who was also in Albania, said President Putin had made a \"big mistake\" by sending low-level delegates to Istanbul. A list of representatives ahead of the meeting listed presidential aide Vladimir Medinsky, deputy foreign minister Galuzin Mikhail Yuryevich and deputy defence chief Alexander Fomin. Ukraine's delegation was led by defence minister Rustem Umerov. President Zelenskyy had called the Russian team \"a theatre prop\" ahead of the summit in the Dolmabahce Palace.  However, Turkey's foreign minister heralded it as \"an important day for world peace\" and said Russia and Ukraine had agreed to swap 1,000 POWs each as a \"confidence-building measure\". Hakan Fidan shared a picture of the delegations and said they had \"agreed to share with the other side in writing the conditions that would make it possible to reach a ceasefire\". Russia's Vladimir Medinsky said his team had \"taken note\" of the Ukrainian request for direct talks between Mr Putin and Mr Zelenskyy. \"We have agreed that each side will present its vision of a possible future ceasefire and spell it out in detail,\" said Mr Medinsky. Hopes ahead of the meeting were low after Mr Trump and his secretary of state, Marco Rubio, played down the prospect of meaningful progress.  The US president told reporters on Air Force One on Thursday \"nothing's going to happen until Putin and I get together\", while Mr Rubio said a \"breakthrough\" was unlikely until the US and Russian presidents meet. No date for such a meeting has been proposed, but Mr Trump has said it will happen \"as soon as we can set it up\". Kremlin spokesman Dmitry Peskov told reporters that top-level talks were \"certainly needed\" but arranging it would take time. Russian foreign minister Sergei Lavrov was a notable absentee, despite attending Ukraine-focused talks with the US in Saudi Arabia in February. Russia has so far failed to agree to a 30-day unconditional ceasefire - proposed by European leaders who have threatened Moscow with \"massive\" sanctions if it doesn't sign up. The US also supports the plan. The Kremlin has ambitions to keep swathes of Ukrainian land as part of any long-term truce, an idea that Kyiv firmly rejects. Russia also wants an end to Ukraine's NATO ambitions and a promise it will stay neutral."
    },
    {
        "title": "Police watchdog to investigate mother's claim she was unlawfully strip-searched by Greater Manchester Police",
        "description": "A mother's complaint she was unlawfully strip-searched by Greater Manchester Police (GMP) will be investigated by the police watchdog.",
        "url": "https://news.sky.com/story/police-watchdog-to-investigate-mothers-claim-she-was-unlawfully-strip-searched-by-greater-manchester-police-13369261",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-dannika-stewart-baird-inquiry_6630429.jpg?20240718101325",
        "type": "Home",
        "Author": "Jason Farrell",
        "Date Published": "2025-05-16 20:45:00",
        "Headline": "It follows a \"lonely, exhausting and distressing\" battle by Dannika Stewart, who was featured in a Sky News investigation after she was arrested and allegedly forced to strip at Pendleton Police Station in October 2022.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  A mother's complaint she was unlawfully strip-searched by Greater Manchester Police (GMP) will be investigated by the police watchdog. It follows a \"lonely, exhausting and distressing\" battle by Dannika Stewart, who was featured in a Sky News investigation after she was arrested and allegedly forced to strip at Pendleton Police Station in October 2022. Ms Stewart claimed she was being punished for complaining about police failures over a crime she had reported. She was asked to come to the police station and on arriving was told the man she'd accused had made an accusation against her of blackmail. She told Sky News she was arrested and told to strip naked. She said: \"I took my tracksuit bottoms off, which I knew they were going to take away from me anyway. I took my leggings off and then took my knickers off and I'm just sat there naked.\" She said she was left naked while officers walked in and out of the cell. \"It's all about power,\" she said. \"Because when I left the police station that day the sergeant on the desk said, 'you need to drop all your complaints against the police'.\" Our investigation into the treatment of several women prompted Manchester mayor Andy Burnham to call an inquiry into the custody practices of GMP which was conducted by Dame Vera Baird. Dame Vera's report into allegations by several women found officers were \"using their power unwisely, unnecessarily, and sometimes unlawfully\". Read more: What has Greater Manchester Police learned from the Baird Review? Turned 'from a victim into a suspect' After publication she told Sky News \"based on almost nothing, GMP turned Ms Stewart from a victim into a suspect\". Dame Vera said Ms Stewart remained on bail with the threat of being charged with blackmail for months without any apparent evidence to support the allegations against her. She added: \"I think she was, in truth, bullied. The strip search is denied, but she is so clear and so humiliated when she repeats what happened that I'm inclined very much to believe her.\" Ms Stewart described this period on bail as \"very lonely, exhausting, empty and distressing\". She said: \"It was hard for my mind to consider anything alternative every day over and over, wondering if I was about to go to jail for something I didn't do. I constantly thought of potential solutions to free myself from the nightmare the police projected onto me. My brain never went offline at night, and the longer it has gone on.\" 'A disputed set of facts' However, following the inquiry, Chief Constable Stephen Watson told Sky News he didn't know if Ms Stewart was strip-searched because \"there is a disputed set of facts\". Responding, Ms Stewart said: \"If you are still denying something after an independent investigation, you are in denial, aren't you, as a force?\" Now the Independent Office for Police Conduct (IOPC) has decided her complaints relating to her interactions with officers while in custody, including how she was searched, should be independently investigated. In response a GMP spokesperson said: \"We have apologised unreservedly to Ms Stewart for the matters where the service we provided her was not acceptable, and for the distress caused by her experiences with the police. \"Our Professional Standards Directorate thoroughly investigated all allegations made and will now fully assist the IOPC with their enquiries. \"In implementing all the recommendations of Dame Vera Baird's report in the past year, we have significantly improved provisions for those in our custody - particularly women and girls - by ending the use of strip search for welfare purposes and by ensuring all female detainees are assigned a dedicated welfare officer.\" 'Apology is not enough' Ms Stewart doesn't feel like the apology she received in a letter from the police standards department last year is enough. She said: \"How is this an adequate or appropriate apology after three to four years fighting and the endless failings. Really, how many times do we have to ask them to treat us like humans and take accountability for the actions of officers? \"I am losing the ability to reason with such stupidity and ignorance from GMP. The police not taking accountability feels like a constant attack. No growth can occur until they accept what happened.\" Nearly a year on from the Baird Review, no officers have been disciplined for the treatment of Ms Stewart."
    },
    {
        "title": "MPs criticise terminally ill Esther Rantzen's assisted dying intervention",
        "description": "Terminally ill journalist Dame Esther Rantzen was branded \"disrespectful\" and \"insulting\" by MPs during a debate on the assisted dying bill.",
        "url": "https://news.sky.com/story/mps-criticise-terminally-ill-esther-rantzens-assisted-dying-intervention-13369024",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-assisted-dying-ester-rantzen_6760889.jpg?20250516191329",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-16 14:02:00",
        "Headline": "The broadcaster urged all MPs to back the assisted dying bill and suggested some would never change their minds due to undeclared religious beliefs.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Terminally ill journalist Dame Esther Rantzen was branded \"disrespectful\" and \"insulting\" by MPs during a debate on the assisted dying bill. The broadcaster and Childline founder wrote to all MPs ahead of Friday's Commons' debate urging them to vote for what she called a \"crucial reform\". MPs were voting on amendments made to the bill - the report stage - following months of a committee going line by line through it after being introduced last year by Labour MP Kim Leadbeater.   The bill says people with six months to live who have the mental capacity can request medical assistance to legally end their life. Dame Esther, who has stage four lung cancer, suggested many MPs who opposed the bill have \"undeclared personal religious beliefs which mean no precautions would satisfy them\". However, in a highly charged Commons session, some MPs took umbrage with that. Labour MP Florence Eshalomi, who is a Christian and voted against the bill the first time, told the Commons: \"This is frankly insulting to disabled people, hard working professionals up and down the country, who have raised many valid concerns about this bill, to have it dismissed as religious beliefs.\" Jess Asato, a Labour MP who, as a child, cared for her grandmother with serious health problems, said Dame Esther \"accused those of us who have concerns about the bills as having undeclared religious beliefs\". \"Many colleagues found this distasteful and disrespectful,\" said the MP, who previously voted against the bill. Health Secretary Wes Streeting, who voted against the bill last year, backed Ms Asato's criticism as he retweeted her X post saying Dame Esther's comment about faith was \"particularly distasteful\". Ms Asato's Commons comment was met with agreement by many MPs who said: \"Hear, hear.\" Read more:What is in the assisted dying bill?Requirement for High Court judge scrapped 'Clumsy criticism' Conservative MP Dr Kieran Mullan said there had been some \"unhelpful remarks by high profile campaigners\", and while he is not religious he was \"concerned to see a clumsy criticism\" that those objecting to the bill are doing so because of their \"religious beliefs\". In a dig at Dame Esther's comments, Rebecca Paul, Tory MP for Reigate, said she is not against assisted dying \"in principle\" but is against the bill - and wanted to put on the record: \"I have no personal religious beliefs.\" The debate saw some MPs on the verge of tears as they described their own experiences of having debilitating conditions, or having family members in pain. MPs do not have to vote along party lines for the bill. How did MPs vote? An amendment tabled by Ms Leadbeater, which \"expands the protection\" for medical practitioners to clarify they have \"no obligation\" to be part of an assisted death was passed by MPs. It also provides legal protections for medical professionals to ensure they are not subject to any kind of punishment for refusing to carry out an assisted death. Another new clause to allow employers to impose a blanket ban on staff facilitating an assisted death was rejected. Since the bill was first introduced, there have been significant changes, including the replacement of a High Court judge to sign assisted dying off by a three-member expert panel - on top of two doctors having to approve. The time at which assisted dying would come into effect was doubled to four years from when it becomes law, if voted through. Medical colleges pull support Opponents have argued the bill does not have enough safeguards and is being rushed through. Three days before the debate, the Royal College of Psychiatrists pulled its support for the bill over the change that will mean a psychiatrist must be on the panel that decides if someone can die. The next day, the Royal College of Physicians (the largest college) adopted a similar position. However, supporters argue it is time to change the law, with Ms Leadbeater saying: \"If we do not vote to change the law, we are essentially saying that the status quo is acceptable.\""
    },
    {
        "title": "Police name firefighters and business owner killed at former RAF base in Bicester",
        "description": "Two firefighters who died at a former RAF base in Oxfordshire have been named as Jennie Logan and Martyn Sadler.",
        "url": "https://news.sky.com/story/two-firefighters-and-one-other-person-die-after-fire-at-former-raf-base-in-oxfordshire-13368819",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-bicester-fire-oxfordshire_6918877.jpg?20250516221941",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-16 08:39:00",
        "Headline": "Two other firefighters sustained serious injuries in the blaze and were taken to hospital after Thursday evening's fire.",
        "Content": "Two firefighters who died at a former RAF base in Oxfordshire have been named as Jennie Logan and Martyn Sadler. David Chester, who ran a construction business from the site, was also killed in the blaze in Bicester on Thursday evening. London Fire Commissioner Andy Roe said Mr Sadler, 38, was on call for Oxfordshire Fire and Rescue Service (OFRS), but was part of blue watch in Ealing, west London, where he was a leading firefighter/sub-officer. He also confirmed Ms Logan, 30, worked for the Oxfordshire service.  Ten fire and rescue crews were called to tackle the blaze at 6.39pm, which prompted a major response and warnings for local residents to stay indoors. Eyewitnesses described seeing the \"black\" smoke in the sky from the other side of town. The ex-RAF base is now used by Bicester Motion, a business park that hosts classic car and aviation firms. Its boss Daniel Geoghegan said Mr Chester, 57, had run a business, Chesters & Sons, on the site for 12 years. The chief executive called him a \"part of the fabric of our estate and a friend to us all\". \"Our whole community used to say that 'Dave always had our back'. Yesterday, he was doing just that - the epitome of his selfless spirit,\" Mr Geoghegan said. He added: \"We will cherish you Dave and you will be sorely missed, and we send our utmost love to Sue, Jordan and Riley.\" The company website says its work at Bicester Motion \"included carefully unearthing four buried wartime air raid shelters so as not to damage the structures to allow them to be renovated by another contractor\". Mr Geoghegan also sent \"heartfelt condolences\" to the firefighters' families and said Ms Logan and Mr Sadler had \"bravely tackled the scene\". \"No words can ever make up for what has happened, but they are all very much in our hearts,\" he said. Two other firefighters sustained serious injuries in the blaze and were taken to hospital.  Chief Fire Officer Rob MacDougall, from Oxfordshire Fire Service, announced the deaths earlier on Friday. \"It is with a very heavy heart that we today report the loss of two of our firefighters. Families have been informed and are being supported,\" he said. \"Our thoughts are with them at this most difficult of times and we ask for privacy to be respected.\" He appeared to hold back tears as he talked about how \"proud and grateful\" he was. London Fire Commissioner Andy Roe said Mr Sadler \"exemplified courage and selflessness\". Read more from Sky News:Prison governor jailed over relationship with drug bossMelania Trump statue goes missing from her hometown  Footage on social media showed plumes of black smoke and flames swallowing the large building. Kieran McGurk, who lives opposite the site, said he heard \"multiple explosions\" and \"loud bangs\". Another resident - who gave her name only as Ellie - said she \"heard loads of pops and crackles and bangs\". Assistant Chief Constable Tim Metcalfe said Thames Valley Police were investigating but the fire wasn't currently being treated as a criminal matter. Prime Minister Sir Keir Starmer said the deaths were \"devastating news\" and he hoped \"those in hospital make a full and swift recovery\". Conservative leader Kemi Badenoch said her \"heart goes out to the families of those people who have lost their lives and those who are still on the front line\"."
    },
    {
        "title": "Prison governor jailed over relationship with drug boss known as Jesse Pinkman",
        "description": "A former prison governor seen as a rising star in the service has been jailed for nine years for having a relationship with an inmate who was the boss of a Liverpool drugs gang, police have said.",
        "url": "https://news.sky.com/story/prison-governor-jailed-over-relationship-with-drug-boss-known-as-jesse-pinkman-13369097",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kerri-pegg-kirkham_6879920.jpg?20250408154553",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-16 15:56:00",
        "Headline": "Kerri Pegg, who admitted in court she had been \"incredibly stupid\", signed off on a temporary release for the drug boss, despite not being entitled to do it, and was driving a Mercedes he paid for with 34kg of amphetamines.",
        "Content": "A former prison governor seen as a rising star in the service has been jailed for nine years for having a relationship with an inmate who was the boss of a Liverpool drugs gang, police have said. Kerri Pegg, 42, was the governor of HMP Kirkham in Lancashire when she met Anthony Saunderson - also known as Jesse Pinkman, named after the drug dealer in the Breaking Bad TV drama - who is now serving 35 years behind bars. Pegg, who had risen from graduate entrant to governor in six years, granted Saunderson a temporary release, even though she was not authorised to do so, the North West Regional Organised Crime Unit (NWROCU) said.   Concerns about their relationship began soon after she started work at the jail, with the two often being in her office with the door closed, Preston Crown Court heard. She had swapped her Honda Jazz for a £12,000 Mercedes, which Saunderson had bought with 34kg (75lbs) of amphetamines, and which was outside her flat in Orrell, Wigan, when police raided it in November 2020. Designer clothes, handbags and jewellery, were found by detectives, along with size 10 Hugo Boss slip-ons and a toothbrush with Saunderson's DNA. Investigators discovered she had been living way beyond her £3,000 a month income, buying Jimmy Choo shoes and Chanel necklaces despite being deep in debt. Pegg tearfully told jurors she had been \"incredibly stupid\" but did not think she had done anything wrong. Barbara-Louise Webster, prosecuting, said Pegg had a promising future, but Saunderson \"was her downfall\". The pair met through an inmate programme called BADD (Beating Alcohol and Drug Dependency), which Saunderson developed and delivered at several jails, even while he was himself running an amphetamines factory. Pegg, who was convicted of misconduct in a public office and possessing criminal property at trial last month, claimed her contact with Saunderson was down to the programme. The court heard Pegg, originally from Bramhall, Stockport, was a governor at HMP Kirkham by 2018, as Saunderson was reaching the end of a 10-year sentence for drug offences. He had been one of Merseyside's most wanted fugitives for his part in importing £19m worth of cocaine in shipments of corned beef from Argentina. Less than two months after being released from Kirkham in May 2019, he was involved in another massive drug conspiracy. Saunderson was jailed for 35 years at Liverpool Crown Court in August 2022 after investigators cracked the Encrochat system - the phone network used by serious organised criminals. It revealed both his drug dealing and his relationship with Pegg. Read more on Sky News:Firefighters die in airbase blazeBest-selling author's attacker jailed'Brazen' carnival murderer jailed Phil Copple, chief executive of HM Prison and Probation Service, said: \"The criminal misconduct in this case lets down the public we serve as well as the vast majority of honest and hardworking prison staff.\" Detective Inspector Brian Morley, from the NWROCU's Prison Intelligence Unit, said Pegg was guilty of \"serious misconduct\", which undermines public trust in prison staff."
    },
    {
        "title": "Police watchdog to investigate mother's claim she was unlawfully strip-searched by Greater Manchester Police",
        "description": "A mother's complaint she was unlawfully strip-searched by Greater Manchester Police (GMP) will be investigated by the police watchdog.",
        "url": "https://news.sky.com/story/police-watchdog-to-investigate-mothers-claim-she-was-unlawfully-strip-searched-by-greater-manchester-police-13369261",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-dannika-stewart-baird-inquiry_6630429.jpg?20240718101325",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-05-16 20:45:00",
        "Headline": "It follows a \"lonely, exhausting and distressing\" battle by Dannika Stewart, who was featured in a Sky News investigation after she was arrested and allegedly forced to strip at Pendleton Police Station in October 2022.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  A mother's complaint she was unlawfully strip-searched by Greater Manchester Police (GMP) will be investigated by the police watchdog. It follows a \"lonely, exhausting and distressing\" battle by Dannika Stewart, who was featured in a Sky News investigation after she was arrested and allegedly forced to strip at Pendleton Police Station in October 2022. Ms Stewart claimed she was being punished for complaining about police failures over a crime she had reported. She was asked to come to the police station and on arriving was told the man she'd accused had made an accusation against her of blackmail. She told Sky News she was arrested and told to strip naked. She said: \"I took my tracksuit bottoms off, which I knew they were going to take away from me anyway. I took my leggings off and then took my knickers off and I'm just sat there naked.\" She said she was left naked while officers walked in and out of the cell. \"It's all about power,\" she said. \"Because when I left the police station that day the sergeant on the desk said, 'you need to drop all your complaints against the police'.\" Our investigation into the treatment of several women prompted Manchester mayor Andy Burnham to call an inquiry into the custody practices of GMP which was conducted by Dame Vera Baird. Dame Vera's report into allegations by several women found officers were \"using their power unwisely, unnecessarily, and sometimes unlawfully\". Read more: What has Greater Manchester Police learned from the Baird Review? Turned 'from a victim into a suspect' After publication she told Sky News \"based on almost nothing, GMP turned Ms Stewart from a victim into a suspect\". Dame Vera said Ms Stewart remained on bail with the threat of being charged with blackmail for months without any apparent evidence to support the allegations against her. She added: \"I think she was, in truth, bullied. The strip search is denied, but she is so clear and so humiliated when she repeats what happened that I'm inclined very much to believe her.\" Ms Stewart described this period on bail as \"very lonely, exhausting, empty and distressing\". She said: \"It was hard for my mind to consider anything alternative every day over and over, wondering if I was about to go to jail for something I didn't do. I constantly thought of potential solutions to free myself from the nightmare the police projected onto me. My brain never went offline at night, and the longer it has gone on.\" 'A disputed set of facts' However, following the inquiry, Chief Constable Stephen Watson told Sky News he didn't know if Ms Stewart was strip-searched because \"there is a disputed set of facts\". Responding, Ms Stewart said: \"If you are still denying something after an independent investigation, you are in denial, aren't you, as a force?\" Now the Independent Office for Police Conduct (IOPC) has decided her complaints relating to her interactions with officers while in custody, including how she was searched, should be independently investigated. In response a GMP spokesperson said: \"We have apologised unreservedly to Ms Stewart for the matters where the service we provided her was not acceptable, and for the distress caused by her experiences with the police. \"Our Professional Standards Directorate thoroughly investigated all allegations made and will now fully assist the IOPC with their enquiries. \"In implementing all the recommendations of Dame Vera Baird's report in the past year, we have significantly improved provisions for those in our custody - particularly women and girls - by ending the use of strip search for welfare purposes and by ensuring all female detainees are assigned a dedicated welfare officer.\" 'Apology is not enough' Ms Stewart doesn't feel like the apology she received in a letter from the police standards department last year is enough. She said: \"How is this an adequate or appropriate apology after three to four years fighting and the endless failings. Really, how many times do we have to ask them to treat us like humans and take accountability for the actions of officers? \"I am losing the ability to reason with such stupidity and ignorance from GMP. The police not taking accountability feels like a constant attack. No growth can occur until they accept what happened.\" Nearly a year on from the Baird Review, no officers have been disciplined for the treatment of Ms Stewart."
    },
    {
        "title": "'He's the chosen one': Meet the 14-year-old British boxer now fighting for Bahrain",
        "description": "Only the most ardent followers of boxing will know of Jayden Price, the 14-year-old from Gloucester.",
        "url": "https://news.sky.com/story/hes-the-chosen-one-meet-the-14-year-old-british-boxer-now-fighting-for-bahrain-13369302",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-jayden-price-boxing_6918956.jpg?20250516231445",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-05-16 23:01:00",
        "Headline": "In three years, Jayden Price is aiming to top the podium at the Los Angeles Olympics - but he won't be representing Team GB, having signed up last month to fight for Bahrain.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  Only the most ardent followers of boxing will know of Jayden Price, the 14-year-old from Gloucester. But, in three years, this multiple English youth champion is aiming to top the podium at the Los Angeles Olympics. It won't, however, be God Save The King playing. No Team GB vest will be worn. Because this is an Olympic dream diverting from southwest England via the Middle East. And now, in exclusive interviews with Sky News, it is time for Jayden to reveal all with his coach and father. \"After the European Championships last year, Bahrain reached out to us wanting to sign me to represent their country. So now I represent Bahrain,\" Jayden explains. \"Obviously it's a special feeling to feel like I'm the one that's been reached out to and chosen to represent them.\" It is a decision, given his family's lack of previous connections to the Gulf nation, that has led to them receiving some disparaging comments. There are, of course, financial motivations such as facilitating and funding Jayden's sporting ambitions, while prioritising his wellbeing and private tuition. It was barely a month ago that a young life was transformed with contracts signed in the presence of Bahraini royalty. Jayden says: \"The agreements have been going on for so long, I had time to think, 'OK this is actually going on now'. Time to get used to it.\" Social media caught the attention of Bahrain Olympic Committee chair Jayden's journey being documented by his father, Lee Price, on social media apparently caught the attention of Bahrain Olympic Committee chairman Sheikh Khaled bin Hamad Al Khalifa, who was keen to engage more youngsters in sport. \"As discussions progressed, the focus shifted toward Jayden's long-term ambitions - particularly his aspirations to compete at the Olympic level,\" Mr Price says. \"The Bahraini sporting authorities then explored how they could support Jayden in achieving these goals. \"Bahrain's support package would allow Jayden to maintain his amateur status through to the 2032 Olympic Games in Brisbane, aligning with his long-term development and Olympic ambitions.\" 'It's good to secure it' One thought was that Jayden wouldn't make the cut yet for Team GB's LA 2028 squad and he would need to go professional to start earning money before the 2032 Games. \"It would have been difficult, because on the GB setup there are a lot of good boys,\" he says. \"I think I could have got there but there was a risk that I couldn't have. So it's good to secure it.\" Bahrain's lucrative deal opens up the possibility of two Olympic appearances while staying in the safer amateur ranks longer, with larger and more padded gloves softening blows. But inevitably when making such a decision, financial factors enter the conversation. \"In addition to the benefits of more international exposure, representing a different country can help create a distinctive personal brand,\" Mr Price says. \"This can open doors to sponsorship opportunities from the Middle East and beyond.\" All eight of Bahrain's Olympic medals have been won by imported athletes Britain, for decades, has chased and embraced investment from the Middle East, particularly in sport. So this could be considered reversing the flow of the pipeline and sharing sporting talent in the other direction. And overseas-born athletes, with no previous connections to Britain, have competed for Team GB. There is just a greater reliance in the former British protectorate with oil and gas wealth to spend and a population of Bahrainis under 800,000. All eight Olympic medals ever won by Bahrain have been won by imported athletes. Can Jayden deliver their first in boxing? \"That was the aim for them, to be fair, to hopefully bring me over and hopefully I can start winning them a lot of medals,\" he says. First gold medal won under Bahrain flag When we meet, there is already a first gold medal won under the flag of Bahrain in the collection of honours we are filming. Under the radar, just a couple of weeks earlier, Jayden was in the Jordanian capital Amman competing in an Asian boxing championship and winning the U15s 43kg class. \"Obviously things like the national anthem, I have to get used to that,\" he says. \"But just being able to compete for Bahrain now, I think it's a great opportunity.\" Facing UK opponent 'would be a little awkward' How would it feel facing a British opponent in the Olympic final? \"Obviously,\" he says. \"It would be a little bit awkward.\" But on hand to guide Jayden is a long-standing coach. Now there are trips to Manama for Amin Khan from his base at the Truth Boxing Club in the shadow of Gloucester Cathedral. Wearing a Bahrain Olympic Committee T-shirt, the scepticism and concerns are addressed directly. \"There's going to be a lot of questions, of course,\" Mr Khan says. \"But this is about what's best for Jayden and we want to give him that opportunity where he can perform at a very high level from a very early age and continue to develop. \"Boxing's still like a working-class sport, but it obviously is costly and obviously this opportunity does give financial benefits but more so is the benefits that I can offer for him in terms of career opportunity and getting to the Olympics.\" 'He's the chosen one' Precise figures are not mentioned in any conversations. Only that Jayden's family will be comfortable without pressure on him to seek work. \"He can stay amateur until the age of 21,\" Mr Khan says. \"In England you probably wouldn't have been able to do that because you're then put under pressure of turning pro and trying to earn an income because there's not much financial backing. \"And also it's a unique selling point as well. He's the poster boy of Bahrain, he's the chosen one.\" Aspirations to be 'one of the greatest' There is little sign of a swagger or boastfulness in almost three hours spent with Jayden during his first filming session of this kind on such a delicate, life-changing matter. Already 66 of 70 boxing contests have been won after a combat journey that began in Brazilian jiu-jitsu and mixed martial arts aged six. How will his career look two decades from now, by the age of 34? \"Hopefully be retired and I would have been the former undisputed champion,\" he says. \"Just one of the greatest.\" Read more:Eurovision's UK hopefuls who sing their trollers' insultsPrison governor jailed over relationship with drug boss Greatness that will be achieved not under the flag of Great Britain but a country he only visited for the first time last month. Transferring sporting allegiance like this will provoke a reaction. The family wants the public to understand that the money on offer was too irresistible to turn down. But this is the support needed to help Jayden become a boxing star - prioritising his welfare and wellbeing beyond the growing wealth."
    },
    {
        "title": "Salman Rushdie attacker who left author blind in one eye jailed",
        "description": "A man convicted of stabbing Salman Rushdie, leaving the author blind in one eye, has been jailed for 25 years.",
        "url": "https://news.sky.com/story/hadi-matar-man-who-stabbed-salman-rushdie-leaving-author-blind-in-one-eye-is-jailed-13368863",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-salman-rushdie-author_6825727.jpg?20250221215754",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-16 14:40:00",
        "Headline": "During the trial, Sir Salman revealed he feared he was dying when the masked attacker plunged a knife into his head and body more than a dozen times.",
        "Content": "A man convicted of stabbing Salman Rushdie, leaving the author blind in one eye, has been jailed for 25 years. Hadi Matar was found guilty of attempted murder and assault in February. Prosecutors had been seeking the maximum sentence of 25 years for the attack in August 2022, along with an additional seven-year term for injuring a second man. During the trial, Sir Salman revealed he feared he was dying when the masked attacker plunged a knife into his head and body more than a dozen times. The attack happened as the 77-year-old was introduced on stage at the Chautauqua Institution in New York for a discussion on writer safety. Sir Salman was stabbed in the head, neck, torso and left hand and suffered damage to his liver and intestines.  The Midnight's Children author spent 17 days at a hospital in Pennsylvania and more than three weeks at a rehabilitation facility in New York City, as he recovered from his injuries. He wrote about the attack and his recovery in his 2024 memoir Knife. Matar will next face a trial on terrorism-related charges. Prosecutors allege the 27-year-old was trying to carry out a decades-old fatwa calling for the author's death. In 1989, Iran's then leader, Ayatollah Ruhollah Khomeini, issued the fatwa in response to the publication of Sir Salman's novel The Satanic Verses, which some Muslims consider blasphemous, causing the Indian born British-American author to go into hiding. In 1998, Iran announced it would not enforce the decree, allowing Sir Salman to travel freely over the last quarter of a century. Read more from Sky News:Army unit charged with investigating sex crimes allowing abusers to 'get away with it'At least 93 killed in Gaza after Israeli strikesMPs criticise Esther Rantzen's assisted dying intervention Matar pleaded not guilty to providing materials to terrorists, attempting to provide material support to Hezbollah and engaging in terrorism transcending national boundaries."
    },
    {
        "title": "MPs criticise terminally ill Esther Rantzen's assisted dying intervention",
        "description": "Terminally ill journalist Dame Esther Rantzen was branded \"disrespectful\" and \"insulting\" by MPs during a debate on the assisted dying bill.",
        "url": "https://news.sky.com/story/mps-criticise-terminally-ill-esther-rantzens-assisted-dying-intervention-13369024",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-assisted-dying-ester-rantzen_6760889.jpg?20250516191329",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-16 14:02:00",
        "Headline": "The broadcaster urged all MPs to back the assisted dying bill and suggested some would never change their minds due to undeclared religious beliefs.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Terminally ill journalist Dame Esther Rantzen was branded \"disrespectful\" and \"insulting\" by MPs during a debate on the assisted dying bill. The broadcaster and Childline founder wrote to all MPs ahead of Friday's Commons' debate urging them to vote for what she called a \"crucial reform\". MPs were voting on amendments made to the bill - the report stage - following months of a committee going line by line through it after being introduced last year by Labour MP Kim Leadbeater.   The bill says people with six months to live who have the mental capacity can request medical assistance to legally end their life. Dame Esther, who has stage four lung cancer, suggested many MPs who opposed the bill have \"undeclared personal religious beliefs which mean no precautions would satisfy them\". However, in a highly charged Commons session, some MPs took umbrage with that. Labour MP Florence Eshalomi, who is a Christian and voted against the bill the first time, told the Commons: \"This is frankly insulting to disabled people, hard working professionals up and down the country, who have raised many valid concerns about this bill, to have it dismissed as religious beliefs.\" Jess Asato, a Labour MP who, as a child, cared for her grandmother with serious health problems, said Dame Esther \"accused those of us who have concerns about the bills as having undeclared religious beliefs\". \"Many colleagues found this distasteful and disrespectful,\" said the MP, who previously voted against the bill. Health Secretary Wes Streeting, who voted against the bill last year, backed Ms Asato's criticism as he retweeted her X post saying Dame Esther's comment about faith was \"particularly distasteful\". Ms Asato's Commons comment was met with agreement by many MPs who said: \"Hear, hear.\" Read more:What is in the assisted dying bill?Requirement for High Court judge scrapped 'Clumsy criticism' Conservative MP Dr Kieran Mullan said there had been some \"unhelpful remarks by high profile campaigners\", and while he is not religious he was \"concerned to see a clumsy criticism\" that those objecting to the bill are doing so because of their \"religious beliefs\". In a dig at Dame Esther's comments, Rebecca Paul, Tory MP for Reigate, said she is not against assisted dying \"in principle\" but is against the bill - and wanted to put on the record: \"I have no personal religious beliefs.\" The debate saw some MPs on the verge of tears as they described their own experiences of having debilitating conditions, or having family members in pain. MPs do not have to vote along party lines for the bill. How did MPs vote? An amendment tabled by Ms Leadbeater, which \"expands the protection\" for medical practitioners to clarify they have \"no obligation\" to be part of an assisted death was passed by MPs. It also provides legal protections for medical professionals to ensure they are not subject to any kind of punishment for refusing to carry out an assisted death. Another new clause to allow employers to impose a blanket ban on staff facilitating an assisted death was rejected. Since the bill was first introduced, there have been significant changes, including the replacement of a High Court judge to sign assisted dying off by a three-member expert panel - on top of two doctors having to approve. The time at which assisted dying would come into effect was doubled to four years from when it becomes law, if voted through. Medical colleges pull support Opponents have argued the bill does not have enough safeguards and is being rushed through. Three days before the debate, the Royal College of Psychiatrists pulled its support for the bill over the change that will mean a psychiatrist must be on the panel that decides if someone can die. The next day, the Royal College of Physicians (the largest college) adopted a similar position. However, supporters argue it is time to change the law, with Ms Leadbeater saying: \"If we do not vote to change the law, we are essentially saying that the status quo is acceptable.\""
    },
    {
        "title": "King Charles and Prince William share private moment at historical ceremony",
        "description": "King Charles and Prince William were able to share a private moment before they participated in a historical ceremony on Friday.",
        "url": "https://news.sky.com/story/king-charles-and-prince-william-share-private-moment-at-historical-ceremony-13368978",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prince-of-wales-prince-william_6918130.jpg?20250516114043",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-16 12:50:00",
        "Headline": "The Prince of Wales was installed as Great Master at the Order of the Bath service at Westminster Abbey.",
        "Content": "King Charles and Prince William were able to share a private moment before they participated in a historical ceremony on Friday. Dressed in crimson robes, they warmly greeted each other, and the King gently patted his son's arm ahead of the Order of the Bath service at Westminster Abbey. The ceremony celebrated the 300th anniversary of the order and included Charles as the sovereign for the first time, as the service usually takes place every four years. The Prince of Wales was installed as Great Master, which is awarded to members of the military or Civil Service for exemplary work, during his first-ever procession. Charles had held the Great Master role for nearly 50 years, but passed it to his son on St George's Day in April last year. He appointed his daughter-in-law, Kate, the first Royal Companion in the history of the Order of the Companions of Honour to recognise her for her public service and support of the arts. Queen Camilla was made Grand Master and First or Principal Dame Grand Cross of the Most Excellent Order of the British Empire. Five new Knights Grand Cross were also installed during the ceremony at the Lady Chapel of King Henry VII at the abbey on Friday. They are Air Chief Marshal Sir Stephen Hillier, Admiral Philip Jones, General Sir Mark Carleton-Smith, Lord Young and Sir Tom Scholar. The Order of the Bath was established by King George I in 1725, but it is believed to have originated in the eighth century. Its name stems from the ritual washing forming part of the preparations for the conferment of knighthood. Read more from Sky News:Two firefighters and one other person die in fireLaurence Fox denies encouraging others to damage ULEZ cameras The washing was inspired by baptism cleansing, which was a symbol of spiritual purification. Candidates were not knighted until they had prepared themselves through various rituals designed to cleanse them on the inside, for example by fasting, praying or taking part in vigils, and on the outside by bathing."
    },
    {
        "title": "'Toxic' army unit charged with investigating sex crimes allowing abusers to 'get away with it' in own ranks, whistleblower says",
        "description": "More than a dozen women came forward to report a staff sergeant&#160;in the Royal Military Police (RMP) for sexual abuse, but he was allowed to resign from the army instead of facing charges.",
        "url": "https://news.sky.com/story/toxic-army-unit-charged-with-investigating-sex-crimes-allowing-abusers-to-get-away-with-it-in-own-ranks-whistleblower-says-13368216",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-royal-military-police_6917105.png?20250515121926",
        "type": "UK",
        "Author": "Becky Johnson, social affairs correspondent, and Rebecca Spencer, specialist producer",
        "Date Published": "2025-05-16 13:30:00",
        "Headline": "A female veteran of the Royal Military Police tells Sky News she experienced sexual harassment and assault, and heard rape allegations against male colleagues.",
        "Content": "By Becky Johnson, social affairs correspondent, and Rebecca Spencer, specialist producer   More than a dozen women came forward to report a staff sergeant in the Royal Military Police (RMP) for sexual abuse, but he was allowed to resign from the army instead of facing charges. Warning: This article contains material some readers may find distressing That's the claim of a whistleblower who served as a sergeant in the RMP for over a decade and says she was one of the man's victims. Amy, not her real name, says a \"toxic\" culture in the military police means sexual predators in the army are \"getting away with stuff that they shouldn't be getting away with\". It's a rare insight into life inside the Royal Military Police, the corps charged with investigating crime in the army. Amy described how the man who assaulted her would go into women's rooms and sit on their beds. She says he used to force her to go out driving with him at night and talk about sex. \"He preyed on the young, new females that were in the unit,\" she says. \n                  'Sensitive military documents' found in Newcastle street\n                 \n                  Jaysley Beck: Mother of soldier who took her own life says she has 'sleepless nights' knowing there are still abusers in the Army \n                 \n                  Army sexual harassment investigations to be removed from chain of command\n                 \"One day, I was out with my friends in town and he was on patrol... There were two of us that went over to speak to him and I had quite a low-cut top on. \"So he hooked his finger around my top and pulled my boob out\". She recalls as she tried to stop him, \"he grabbed my hand and put it on his penis\". She claims there are other men in the RMP who've been accused of sexual offences, recalling hearing of five separate allegations of rape against male colleagues by female colleagues. \"If all of this sexual assault and bullying and rapes are going on within the military police, how can they then go out and investigate the wider army for doing the same things?\" she says. \"It doesn't work.\" 'He got away with it' Looking back on her career in the army is difficult for Amy. After leaving, she tried to settle back into life as a civilian with a new job and a young family to look after, but says she worried about bumping into former colleagues in the street. \"It's taken me a long time to heal,\" she says. \"I was very bitter towards my military career when I left, but I've had to sort of learn, build myself up again and remember the good times because they were really good times as well... I think it was just so bad at points.\" When she joined the RMP, she believed she would be part of a unit \"representing how the rest of the soldiers should be conducting themselves\". The reality, she says, was that she had become part of \"one of the most toxic\" corps in the army. She recalls being told that the staff sergeant she had reported for sexual assault would be allowed to resign. \"They basically told me he's not going to be charged, but will be leaving the military... doing him a favour,\" she says. \"He got away with it all,\" she adds. \"He's not going to lose his pension and whatever else he would have lost with a dishonourable discharge. \"He's left without a criminal record... that's not safe for civilians as well, because it's not even on his record.\" 'They investigate themselves' Earlier this year, an inquest into the suicide of 19-year-old Royal Artillery Gunner Jaysley Beck found she had been failed by the army after reporting sexual assault and harassment. Since then, Sky News has reported claims of widespread abuse and growing calls for investigations into sexual offences to be removed from the RMP and instead carried out by civilian police.  The Labour chair of the influential House of Commons Defence Committee is now urging the government to act. Tan Dhesi told Sky News: \"The system needs to change... incidents of sexual violence and sexual assault should be dealt with not by the Royal Military Police but by civilian police and civilian courts. \"I hope that the government will be making that substantial change in the very, very near future; in fact, they should do it ASAP.\" In 2022 the Defence Serious Crime Command Unit was established to provide greater law enforcement across the armed forces. Following the inquest into Gunner Beck's death, the Ministry of Defence announced a new specialist Tri-Service team to take the most serious complaints, such as bullying, discrimination and harassment, outside the single service chain of command. The change will see bullying, harassment, discrimination-related service complaints dealt with by a team outside the commands of the Royal Navy, British Army and Royal Air Force. However, Amy believes investigations need to be done \"completely separately from the military\". \"Otherwise it doesn't work because friends will be investigating friends,\" she says. \"I think there's such a male-dominated space in the military still. Women have no chance... and it's not fair because people are getting away with stuff that they shouldn't be getting away with and allowed to continue doing it and ruining lives.\" She believes the entire system lacks accountability. \"They investigate themselves,\" she says, even down to how the RMP is regulated. \"The people that run that unit are RMP. They get posted in, do a few years and then get posted back out.\" 'I was told off for reporting it' Katie, also not her real name, served in the army for over 20 years. She saw active service in Afghanistan and rose to the rank of Captain. It was a distinguished career that was brought to a premature end by sexual abuse and whistleblowing. Having taken the difficult decision to leave the army she now leads a secluded life and suffers poor mental health. \"I still struggle,\" she says. \"I'm still very wary of men. My relationship is strained. \"Everything seems like black and white now, like I live my life in black and white rather than full colour... As a person, it has changed my life forever.\" To begin with, she was in the same unit that Gunner Beck would join years later. She too experienced harassment and abuse, and says her line manager \"laughed\" when she reported it. \"I just felt like dehumanised, I felt like property, I didn't feel like a person anymore,\" she says. \"And so I would avoid people... I would hide in the garages, behind the tanks, in between the guns, just praying that these people hadn't seen me and I might be able to escape them for that day.\" She moved to a different unit but says wherever she went, abuse was rife. After being groped by a higher-ranking colleague, she assumed her chain of command would escalate her report to the RMP. Instead, she says she was \"put in front of the Sergeant Major and told off\". \"I remember at the time saying I'd like to call the civilian police, and I was told that I wasn't allowed to do that and I'd be disciplined if I tried to do that,\" she said. \"So I was so frightened.\" She stayed in the army, hoping to make a difference. As an officer, she began reporting abusers on behalf of younger victims. \"I kept this goal in my head of reaching a position one day where I could help other women,\" she said. \"When I got there, I realised that it was way more toxic than I could have ever imagined. \"The officer corps were actually the worst perpetrators of all because they brushed it under the carpet. There was a will and a need more to protect themselves or their friends. Or the reputation of the unit first and foremost.\" She believes changes made by the MoD since the death of Gunner Beck to remove the chain of command from sexual abuse investigations will make \"little difference\", saying they'll still be carried out by \"the same people, but just under a new title\". Email: sky.today@sky.uk or WhatsApp 07583 000 853 'They should be held accountable' An MoD spokesperson told Sky News that \"unacceptable and criminal behaviour has absolutely no place in our Armed Forces\". They added: \"That is why this government is creating a new Tri-Service Complaints team to take the most serious complaints out of the chain of single service command for the first time, and has launched a new central taskforce on Violence Against Women and Girls to give this issue the attention it deserves. \"We are also establishing an independent Armed Forces Commissioner with the power to visit defence sites unannounced, and to investigate and report to parliament any welfare matters affecting service life.\" Amy believes the RMP is not fit for purpose. \"They have higher standards to uphold, yet they don't uphold them within their own regiment, within their own lives, and then they're expected to police and uphold those standards throughout the rest of the army,\" she says. \"At the end of the day, they know the law and they should be held accountable for what they do.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Man jailed for life for 'brazen' murder of mother at Notting Hill Carnival",
        "description": "A man who fatally stabbed a mother in front of her three-year-old daughter at Notting Hill Carnival has been jailed for life.",
        "url": "https://news.sky.com/story/shakeil-thibou-man-who-fatally-stabbed-mother-cher-maximen-at-notting-hill-carnival-jailed-13346232",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-shakeil-thibou-noting-hill-carnival_6917969.jpg?20250516085046",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-16 07:10:00",
        "Headline": "Shakeil Thibou was convicted of murdering Cher Maximen last month. Police say he was armed with a large knife and seeking confrontation.",
        "Content": "A man who fatally stabbed a mother in front of her three-year-old daughter at Notting Hill Carnival has been jailed for life. Shakeil Thibou was convicted of murdering Cher Maximen at the Old Bailey last month. On Friday, the 20-year-old was jailed for life with a minimum term of 29 years. Ms Maximen, 32, was with friends when she became caught up in a fight involving multiple men, and died in hospital from her injuries six days later. Judge Philip Katz KC said Thibou's \"brazen\" attack was carried out in front of families and the police.  The defendant wore a medical face mask and blue beanie hat in the dock, and looked straight ahead throughout the hearing. Judge Katz told Thibou: \"The police were totally outnumbered as the violence spun out of control. Just watching the bodyworn footage was terrifying. \"When violence broke out, you were quick to move to join in. You were so fired up that you didn't hesitate to use your knife. You were so brazen that it was carried out in front of police officers.\" Thibou's 22-year-old brother Shaeim was convicted of assaulting PC Oliver Mort, who had tried to intervene, and has been handed a six-month jail term suspended for 18 months. Judge Katz told him he had gone \"too far\" when he assaulted the police officer. \"This is a warning. If you think loyalty to your brothers enables you to break the law, you are very much mistaken,\" he added. Their older brother, Sheldon, 25, will be sentenced at a later date after being found guilty of violent disorder and assaulting PC Mort. Philip Evans KC, defending, said Shakeil Thibou had expressed \"regret\" and \"remorse\" for what happened. However, the prosecution case was that the knife was brought to the scene by the defendant, and that another blade was found during a search of his room. Following Thibou's conviction, Detective Chief Inspector Alex Gammampila had said: \"Cher was a loving mother who went to Notting Hill Carnival to enjoy what should have been a carefree day ... her life was ended in the most senseless way. \"In stark contrast, Shakeil Thibou went to Carnival not to be part of the celebration, but to engage in violence. Why else would he have arrived armed with a large knife and seeking confrontation?\" The attack, which was caught on camera, happened just off the parade route on 25 August last year. Cher's relative TJ Jacobs, who is godmother to her daughter, said: \"What happened to us has completely turned our lives upside down. Losing Cher has filled our hearts with immeasurable sadness. \"This senseless act of violence has cut short a life that had so much more to offer the world and was only just beginning to blossom.\"  Speaking to Sky News, her family described her as a vivacious young woman who grew up in Bristol and then London, finding her feet working with people in music and entertainment. Cher's cousin Lawrence Hoo said: \"It's just this energy she had, she lit up the room. If you walked into a space, you'd know that Cher was there. Her energy itself would fill the room. She was a very bright light.\" Mr Hoo said the idea of the toddler witnessing her mother on the ground punctuates the sadness the family feel with anger. \"The feeling of loss is overwhelming, but so is the feeling of rage,\" he said. \"She [Cher's daughter] is aware that on that day, something happened to her mother.\" In a victim impact statement read to the court, grandmother Vyleen Maximen said: \"Cher was my first-born grandchild, my friend. \"I held you in my arms when you were born. Thirty-two years of loving, laughing, playing, crying and holidaying with you. I will no longer have that pleasure ever again. I won't see you get married or having more children. \"The hole in my heart will never be filled.\""
    },
    {
        "title": "Up to a million Palestinians could be 'permanently relocated' to war-torn Libya under US plans",
        "description": "Up to a million Palestinians could be permanently relocated from devastated Gaza to war-torn Libya under plans being worked on by Donald Trump's administration, NBC News reports.",
        "url": "https://news.sky.com/story/up-to-a-million-palestinians-could-be-permanently-relocated-to-war-torn-libya-under-us-plans-13369235",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-strike_6917173.jpg?20250515130758",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-16 20:29:00",
        "Headline": "Palestinians would reportedly be resettled from their homes in Gaza to Libya, a country that remains divided with two rival governments fighting for control.",
        "Content": "Up to a million Palestinians could be permanently relocated from devastated Gaza to war-torn Libya under plans being worked on by Donald Trump's administration, NBC News reports. The idea has been discussed with Libya's leadership, sources told Sky's US partner network, and would potentially see billions of dollars in frozen Libyan funds released. The North African country remains divided in two - nearly 14 years after the overthrow of dictator Muammar Gaddafi sparked a civil war - with two rival governments fighting for control. It comes as Israel continues a campaign of airstrikes on Gaza, with 93 people killed and hundreds injured on Friday, according to local medics.   No final agreement on any Libya plans have been reached, sources told NBC News, and US government agencies did not respond to requests for comment from the news outlet. Previous suggestions to resettle Palestinians from Gaza - voluntarily or otherwise - have provoked international outcry, particularly from Arab states who likely will play a role in rebuilding the enclave after any permanent ceasefire deal. And Libya is far from a safe nation, according to the US State Department's own travel advice, which says Americans should not travel to the country \"due to crime, terrorism, unexploded landmines, civil unrest, kidnapping, and armed conflict\". President Trump, speaking on the final day of his Middle East trip, said he was looking to resolve a range of global crises, including Gaza. \"We're looking at Gaza,\" he said. \"And we've got to get that taken care of. A lot of people are starving. A lot of people are - there's a lot of bad things going on.\" There had been hopes that his tour of the region could increase the chances of a ceasefire deal or prompt Israel to lift its blockade of Gaza that is preventing humanitarian aid from getting in. But instead Israel has continued to launch airstrikes on the territory, killing more than 250 people in the last two days, according to Hamas-run health authorities. 👉 Follow Trump100 on your podcast app 👈 The Israeli military, which had dropped leaflets on the northern town of Beit Lahia ordering residents to leave, said their airforce had struck more than 150 military targets across Gaza in recent days. This week, Israel said it had bombed the European Hospital because it was home to an underground Hamas base, but Sky News analysis has cast doubt on its evidence. Israeli officials said the latest strikes were a prelude to a larger military campaign in Gaza aimed at pressuring Hamas to release hostages.  Read more:How Israel has escalated Gaza bombing campaignTrump risks becoming impatient and losing interest in Gaza Ahmed Abu Riziq, founder of the Gaza Great Minds Foundation, which seeks to give children access to education in Gaza, said \"the hell doors opened\" in the last few days. Speaking to Sky News from Gaza City, he said: \"Myself with my family, we had to flee today from some certain areas in northern Gaza City... people are running in the streets. They don't know where to go or where to sleep at night. So it's really catastrophic.\" \"No food is entering Gaza,\" he added, saying that people are dying from hunger. Prime Minister Benjamin Netanyahu said this month that Israel plans to seize all of Gaza and hold it indefinitely. Tom Fletcher, head of the UN office for the coordination of humanitarian affairs, warned the Security Council this week it must \"act now\" to \"prevent genocide\" - a claim Israel vehemently denies."
    },
    {
        "title": "First Russia-Ukraine talks since 2022 agree POW swap - but last less than two hours",
        "description": "Russia and Ukraine failed to agree to a ceasefire in their first direct talks since 2022 - as European leaders called Moscow's approach \"unacceptable\" after the discussions lasted less than two hours and Vladimir Putin stayed away.",
        "url": "https://news.sky.com/story/first-russia-ukraine-talks-since-2022-agree-pow-swap-but-last-less-than-two-hours-13369074",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-turkish-foreign-minister_6918654.jpg?20250516183232",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-16 15:38:00",
        "Headline": "Russia and Ukraine agreed to swap 1,000 POWs each as a \"confidence-building measure\" but there's no big progress on a peace deal.",
        "Content": " Russia and Ukraine failed to agree to a ceasefire in their first direct talks since 2022 - as European leaders called Moscow's approach \"unacceptable\" after the discussions lasted less than two hours and Vladimir Putin stayed away. The meeting in Istanbul, Turkey, was set up at short notice on President Putin's behest, but he declined a challenge from Volodymyr Zelenskyy to meet him in person and instead sent relatively junior representatives. A source in the Ukrainian team told Sky News that Russia had threatened \"eternal war\" during the talks. They said the Russians were not ready to talk about technical details of a ceasefire and were waiting for superiors to approve them. Latest updates on Istanbul talks Both countries said they had agreed to trade 1,000 prisoners of war each in what would be the biggest such exchange yet of the conflict. But Kyiv wants the West to impose tighter sanctions unless Moscow accepts a proposal from Donald Trump for a 30-day ceasefire. \n                  Ukraine and Russia's talks in Istanbul were symbolically important - but revealed a stark reality\n                 \n                  Don't get your hopes up of Ukraine peace talks between Donald Trump and Vladimir Putin anytime soon\n                 \n                  Thousands of Ukrainian civilians lost in hellish archipelago of Russian jails\n                 President Zelenskyy said after the meeting that he had spoken to Mr Trump by phone - alongside Sir Keir Starmer and the leaders of France, Germany and Poland - who all met in Albania on Friday. In a post on X, he said Ukraine was \"ready to take the fastest possible steps to bring real peace\" and that \"tough sanctions must follow\" if Russia continues to resist a month-long truce. Frustration over Russia's perceived stalling in holding serious negotiations was also clear from the European leaders gathered in Tirana. \"The Russian position is clearly unacceptable, and not for the first time,\" said Sir Keir. \"So as a result of that meeting with President Zelenskyy and that call with President Trump we are now closely aligning our responses and will continue to do so.\" Read more:Istanbul talks symbolically important - but revealed stark realityDon't get your hopes up of talks Trump-Putin talks anytime soon The UK prime minister said the no-show by Russia's leader was \"more evidence that Putin is not serious about peace\" and has \"been dragging his heels\". NATO secretary-general Mark Rutte, who was also in Albania, said President Putin had made a \"big mistake\" by sending low-level delegates to Istanbul. A list of representatives ahead of the meeting listed presidential aide Vladimir Medinsky, deputy foreign minister Galuzin Mikhail Yuryevich and deputy defence chief Alexander Fomin. Ukraine's delegation was led by defence minister Rustem Umerov. President Zelenskyy had called the Russian team \"a theatre prop\" ahead of the summit in the Dolmabahce Palace.  However, Turkey's foreign minister heralded it as \"an important day for world peace\" and said Russia and Ukraine had agreed to swap 1,000 POWs each as a \"confidence-building measure\". Hakan Fidan shared a picture of the delegations and said they had \"agreed to share with the other side in writing the conditions that would make it possible to reach a ceasefire\". Russia's Vladimir Medinsky said his team had \"taken note\" of the Ukrainian request for direct talks between Mr Putin and Mr Zelenskyy. \"We have agreed that each side will present its vision of a possible future ceasefire and spell it out in detail,\" said Mr Medinsky. Hopes ahead of the meeting were low after Mr Trump and his secretary of state, Marco Rubio, played down the prospect of meaningful progress.  The US president told reporters on Air Force One on Thursday \"nothing's going to happen until Putin and I get together\", while Mr Rubio said a \"breakthrough\" was unlikely until the US and Russian presidents meet. No date for such a meeting has been proposed, but Mr Trump has said it will happen \"as soon as we can set it up\". Kremlin spokesman Dmitry Peskov told reporters that top-level talks were \"certainly needed\" but arranging it would take time. Russian foreign minister Sergei Lavrov was a notable absentee, despite attending Ukraine-focused talks with the US in Saudi Arabia in February. Russia has so far failed to agree to a 30-day unconditional ceasefire - proposed by European leaders who have threatened Moscow with \"massive\" sanctions if it doesn't sign up. The US also supports the plan. The Kremlin has ambitions to keep swathes of Ukrainian land as part of any long-term truce, an idea that Kyiv firmly rejects. Russia also wants an end to Ukraine's NATO ambitions and a promise it will stay neutral."
    },
    {
        "title": "Ukraine and Russia's talks in Istanbul were symbolically important - but revealed a stark reality",
        "description": "It was the first face-to-face meeting between Ukrainian and Russian government officials since 2022 - and it lasted barely two hours.",
        "url": "https://news.sky.com/story/ukraine-and-russias-istanbul-talks-were-symbolically-important-but-revealed-a-stark-reality-13369069",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-istanbul-russia-ukraine_6918506.jpg?20250516172937",
        "type": "World",
        "Author": "Alex Rossi",
        "Date Published": "2025-05-16 15:29:00",
        "Headline": "There was one concrete achievement: Russia and Ukraine agreed to a large-scale prisoner swap, potentially involving thousands of captives. Still, the level of participation at the talks told its own story.",
        "Content": "\n          International correspondent\n              @alexrossiSKY\n  It was the first face-to-face meeting between Ukrainian and Russian government officials since 2022 - and it lasted barely two hours. There were hopes that the encounter in Istanbul, Turkey, might mark a turning point in Europe's deadliest conflict since World War Two. But in reality, the talks proved to be more mirage than breakthrough - what the world has witnessed over the last few days was performative but it lacked real substance. Ukraine war latest: World reacts to two-hour peace talks What it did show, though, was that the gulf between the two sides remains as wide as ever. And at the centre of all this is a question of international willpower - particularly that of the United States. The future of any meaningful peace process may now rest on the extent to which Donald Trump is willing to stay engaged. \n                  First Russia-Ukraine talks since 2022 agree POW swap - but last less than two hours\n                 \n                  Don't get your hopes up of Ukraine peace talks between Donald Trump and Vladimir Putin anytime soon\n                 \n                  Thousands of Ukrainian civilians lost in hellish archipelago of Russian jails\n                 That engagement could eventually lead to the ultimate diplomatic meeting between Vladimir Putin, Volodymyr Zelenskyy, and the American president. But getting to that point will be slow, uncertain, and politically fraught. Success over prisoner exchanges There was, however, one concrete achievement: Russia and Ukraine agreed to a large-scale prisoner swap, potentially involving thousands of captives. It would be the largest such exchange since the war began and may serve as a building block for more substantive diplomacy. Still, the level of participation at the talks told its own story. Neither Putin - nor other senior Russian officials for that matter - attended, undermining Moscow's claims of seriousness in the eyes of many people. Ukrainian President Zelenskyy had openly dared Putin to meet face-to-face in a game of geopolitical poker. It was a move designed to call Putin's bluff after he called for the direct talks in the first place, and also underline Kyiv's commitment to peace and maintaining vital US support. Ukraine accuses Russia of stalling the process with maximalist, unrealistic demands. From Kyiv's perspective, Moscow is playing for time, hoping the war's momentum will eventually shift further in its favour strengthening its hand diplomatically. And with recent battlefield gains, Putin appears in no rush to negotiate a ceasefire - which was the central aim of the Ukrainian delegation. What does Putin want? Ultimately, the Russian president seems to be angling for a grand diplomatic bargain - one that would include a meeting with Trump and result in the geopolitical restoration of Russian dominance over swathes of the post-Soviet space. Read more:The Ukrainians lost in hellish Russian jailsWhat happened at Zelenskyy and Putin's last meeting?  The Istanbul talks were symbolically important - but they have also revealed a stark reality: the two sides remain worlds apart. And neither appears ready to make the tough concessions necessary for peace. Until that changes, any resolution to the Ukraine war will remain distant - a mirage on the horizon."
    },
    {
        "title": "At least 93 killed in Israeli strikes on Gaza, say local medics",
        "description": "Israeli strikes on Gaza killed at least 93 people and injured hundreds on Friday, according to local medics.",
        "url": "https://news.sky.com/story/at-least-82-killed-in-gaza-after-israeli-strikes-13368781",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-jabalia-gaza-airstrike_6918449.jpg?20250516153954",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-16 07:22:00",
        "Headline": "Donald Trump spoke about the prospect of resolving the humanitarian crisis in Gaza as he wrapped up his trip to the Middle East.",
        "Content": " Israeli strikes on Gaza killed at least 93 people and injured hundreds on Friday, according to local medics. Heavy strikes were reported in the northern town of Beit Lahia and the nearby Jabalia refugee camp. Israel said it had killed several militants in an observation compound. Its forces also struck Khan Younis and the outskirts of Deir al Balah in southern Gaza. Officials at Gaza's Indonesian Hospital said at least 66 bodies had been brought there, while 16 are said to have been taken to the Nasser Hospital further south. More than 250 people have now been killed in Israeli strikes since Thursday, according to local health authorities.  Israel, which had dropped leaflets on Beit Lahia ordering residents to leave, said its airforce had struck more than 150 military targets across Gaza in recent days. This week, Israel said it had bombed the European Hospital because it was home to an underground Hamas base, but expert analysis has cast doubt on its evidence. Read more:How Israel has escalated Gaza bombing campaign Tom Fletcher, head of the UN office for the coordination of humanitarian affairs, warned the Security Council this week it must \"act now\" to \"prevent genocide\" - a claim Israel vehemently denies. Donald Trump spoke about the humanitarian crisis in Gaza as he wrapped up his trip to the Middle East. In Abu Dhabi, the US president said: \"We're looking at Gaza, and we got to get that taken care of. \"A lot of people are starving, a lot of people. There's a lot of bad things going on.\" While most of his four-day visit to Saudi Arabia, Qatar and the United Arab Emirates focused on trade deals, he also chose to recognise the new government in Syria and urged Iran to engage in nuclear talks. There had been hope Mr Trump's visit could bring about a ceasefire deal or renewal of humanitarian aid to Gaza. An Israeli aid blockade of the territory is now in its third month. Israel says the blockade is to pressure Hamas to release the remaining hostages and that it won't allow aid back in until a system is in place that gives it control over distribution. Earlier this week, a new humanitarian organisation said it expected to begin operations before the end of the month after what it described as key agreements from Israeli officials.  The Gaza Humanitarian Foundation - which has US backing - identified several US military veterans, former humanitarian coordinators and security contractors that it said would lead the delivery effort. Many in the humanitarian community, including the UN, said the system does not align with humanitarian principles and will not be able to meet the needs of Gaza's people. The war began when Hamas militants killed 1,200 people and took 251 hostages in the 7 October 2023 attack on southern Israel. Israel has killed nearly 53,000 Palestinians, according to Gaza's Hamas-run health ministry, which does not distinguish between civilians and combatants. Prime Minister Benjamin Netanyahu said at the start of May that Israel was planning an expanded offensive against Hamas as his cabinet approved plans that could involve seizing the entire Gaza Strip and controlling aid. A defence official said at the time that it would not begin before President Trump finished his visit to the Middle East."
    },
    {
        "title": "How Israel has escalated Gaza bombing campaign",
        "description": "A wave of deadly strikes in northern Gaza has marked a significant escalation in Israel's offensive.",
        "url": "https://news.sky.com/story/how-israel-has-escalated-gaza-bombing-campaign-13369088",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-dandf-teaser-rafah_6918639.jpg?20250516180213",
        "type": "World",
        "Author": "Ben van der Merwe, Kaitlin Tosh, Sam Doak, Freya Gibson and Michelle Inez Simon, Data &amp; Forensics",
        "Date Published": "2025-05-16 16:00:00",
        "Headline": "Israel says the strikes are preparatory moves for a larger operation, which is expected to involve displacing Gaza's entire population. Officials had threatened a new offensive if no hostage deal was reached by the end of President Trump's visit to the region.",
        "Content": "By Ben van der Merwe, Kaitlin Tosh, Sam Doak, Freya Gibson and Michelle Inez Simon, Data & Forensics  A wave of deadly strikes in northern Gaza has marked a significant escalation in Israel's offensive. The Israeli military (IDF) says it has struck \"over 150 terror targets\" across the Gaza Strip in the past 24 hours - an average of one airstrike every ten minutes. At least 109 people have been killed in the strikes, according to the Hamas-run health ministry, bringing the total number killed this week to 284. That number may rise further. On Friday morning, the director of Gaza City's Al Shifa hospital told Al Jazeera that more than 250 people had been killed in the previous 36 hours alone.   Nurse and his family killed in strike The impact of this new bombardment is cataclysmic, as this video of an Israeli airstrike in Jabalia, northern Gaza, verified by Sky News, shows. \n                  NHS waiting list increases for first time in seven months\n                 \n                  Gaza hospital attack: Analysis contradicts Israel's evidence justifying airstrike\n                 \n                  The online drug trade behind QR code stickers plastered on streets across the UK \n                 Other videos show huge smoke clouds rising from airstrikes on residential neighbourhoods surrounding the city's Indonesian Hospital. The hospital's director, Dr Marwan al Sultan, told Sky News: \"There is a shortage of everything except death.\" Among those killed in Jabalia on Friday was 42-year old Yahya Shehab, a nurse for the Palestine Children's Relief Fund (PCRF). He was killed alongside his wife Tamara, 37, and their five children: Sarah, 18, Anas, 16, Maryam, 14, Aya, 12 and Abdul, 11. He is survived by his niece Huda, 27, a civil engineer, who lives nearby with her husband Ahmad Ngat, 31, and their two young sons, Mohammed, seven, and Yusuf, four. Ahmad remembers Yahya as kind and generous, and that he would use his skills as a nurse to treat Mohammed and Yusuf whenever they were sick. \"His kids were great too,\" Ahmad says. \"May God have mercy on them.\" Operation Gideon Chariot  An Israeli official said Friday's strikes were preparatory actions in the lead-up to a larger operation. Earlier this month, Israel's security cabinet approved \"Operation Gideon Chariot\" - a plan to \"capture\" all of Gaza and force its entire population to move to a small enclave in the southern Gaza Strip. At the time, a defence official said the operation would go ahead if no hostage deal was reached by the end of US President Donald Trump's visit to the Middle East. That visit ended on Friday, 16 May.  👉 Follow Trump100 on your podcast app 👈 Hamas had proposed releasing all hostages in exchange for a permanent end to the war. Last month, Hamas turned down Israel's offer of a temporary ceasefire in exchange for the militant group laying down its weapons and releasing half the living hostages. Finance minister Bezalel Smotrich, who sits in the security cabinet, said of Operation Gideon Chariot that Gaza would be \"entirely destroyed\", and that its population will \"leave in great numbers to third countries\".  Ahmad says he is ready to leave Gaza with his family at the earliest opportunity. \"We want to live our lives,\" he says. His wife Huda grieving the loss of her uncle Yahya, is seven months pregnant. The family are constantly struggling to find enough food for her and the children, he says. \"Unfortunately, she suffers greatly,\" Ahmad says. \"She developed gestational diabetes during this pregnancy.\" Israel has prevented the entry of all food, fuel and water since 2 March. On Monday, a UN-backed report warned that one in five people in Gaza were facing starvation. Satellite imagery may show new aid hubs  Under new proposals backed by the US, Israel now intends to control the distribution of aid via private military contractors. The proposals, set to start operating by the end of May, would see aid distributed from militarised compounds in four locations around the Gaza Strip. Satellite imagery from recent weeks shows Israel has constructed four compounds which could be used for aid distribution. Construction began in April and was completed by early May. Three of these are clustered together in the southwest corner of the Gaza Strip, with one in the central Netzarim corridor. None are located in northern Gaza, where Ahmad and Huda's family live. The UN has called this a \"deliberate attempt to weaponise\" aid distribution and has refused to participate. The planned aid distribution system is being coordinated by a new non-profit, the Gaza Humanitarian Foundation (GHF), which was set up in February in Switzerland. Its board includes a former head of World Central Kitchen, as well as people with close ties to the US military and private military contractors. Proposals drawn up by the GHF say the four planned aid distribution sites could feed around 1.2 million people, approximately 60% of Gaza's population. The GHF later requested that Israel establish additional distribution points. Speaking to the UN Security Council on Tuesday, UN Relief chief Tom Fletcher said the plan \"makes starvation a bargaining chip\". \"It is cynical sideshow. A deliberate distraction. A fig leaf for further violence and displacement,\" he said. Read more:Up to a million Palestinians could be 'permanently relocated' to LibyaTrump risks becoming impatient and losing interest in Gaza Large areas of Gaza have already been razed in recent weeks, including vast tracts of the southern city of Rafah, where many had fled during the war's early stages. Sky News analysis of satellite imagery shows approximately two-thirds of Rafah's built-up area (66%) has been reduced entirely to rubble, with buildings across much of the rest of the city showing signs of severe damage. On Thursday, Human Rights Watch executive director Federico Borello said the UK and US have a duty, under the Genocide Convention, to \"stop Israeli authorities from starving civilians in Gaza\". He said: \"Hearing Israeli officials flaunt plans to squeeze Gaza's two million people into an even tinier area while making the rest of the land uninhabitable should be treated like a five-alarm fire in London, Brussels, Paris, and Washington.\" Israeli government spokesman David Mencer said on Friday that Israel's new offensive is intended to secure the release of its hostages. \"Our objective is to get them home and get Hamas to relinquish power,\" he said. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Salman Rushdie attacker who left author blind in one eye jailed",
        "description": "A man convicted of stabbing Salman Rushdie, leaving the author blind in one eye, has been jailed for 25 years.",
        "url": "https://news.sky.com/story/hadi-matar-man-who-stabbed-salman-rushdie-leaving-author-blind-in-one-eye-is-jailed-13368863",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-salman-rushdie-author_6825727.jpg?20250221215754",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-16 14:40:00",
        "Headline": "During the trial, Sir Salman revealed he feared he was dying when the masked attacker plunged a knife into his head and body more than a dozen times.",
        "Content": "A man convicted of stabbing Salman Rushdie, leaving the author blind in one eye, has been jailed for 25 years. Hadi Matar was found guilty of attempted murder and assault in February. Prosecutors had been seeking the maximum sentence of 25 years for the attack in August 2022, along with an additional seven-year term for injuring a second man. During the trial, Sir Salman revealed he feared he was dying when the masked attacker plunged a knife into his head and body more than a dozen times. The attack happened as the 77-year-old was introduced on stage at the Chautauqua Institution in New York for a discussion on writer safety. Sir Salman was stabbed in the head, neck, torso and left hand and suffered damage to his liver and intestines.  The Midnight's Children author spent 17 days at a hospital in Pennsylvania and more than three weeks at a rehabilitation facility in New York City, as he recovered from his injuries. He wrote about the attack and his recovery in his 2024 memoir Knife. Matar will next face a trial on terrorism-related charges. Prosecutors allege the 27-year-old was trying to carry out a decades-old fatwa calling for the author's death. In 1989, Iran's then leader, Ayatollah Ruhollah Khomeini, issued the fatwa in response to the publication of Sir Salman's novel The Satanic Verses, which some Muslims consider blasphemous, causing the Indian born British-American author to go into hiding. In 1998, Iran announced it would not enforce the decree, allowing Sir Salman to travel freely over the last quarter of a century. Read more from Sky News:Army unit charged with investigating sex crimes allowing abusers to 'get away with it'At least 93 killed in Gaza after Israeli strikesMPs criticise Esther Rantzen's assisted dying intervention Matar pleaded not guilty to providing materials to terrorists, attempting to provide material support to Hezbollah and engaging in terrorism transcending national boundaries."
    },
    {
        "title": "Baby gets world's first personalised gene therapy treatment",
        "description": "A baby born with a rare genetic disease is \"growing and thriving\" after getting bespoke gene therapy.",
        "url": "https://news.sky.com/story/baby-gets-worlds-first-personalised-gene-therapy-treatment-13369006",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kj-gene-therapy_6918376.jpg?20250516144127",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-16 13:26:00",
        "Headline": "Nine-and-a-half-month-old KJ Muldoon has a rare metabolic condition that meant he spent the first months of his life in hospital on a very restrictive diet.",
        "Content": "A baby born with a rare genetic disease is \"growing and thriving\" after getting bespoke gene therapy. It's the first time anyone in the world has been given an experimental gene-editing treatment designed specifically for their disease and took scientists just seven months to develop. Nine-and-a-half-month-old KJ Muldoon, from Clifton Heights, Pennsylvania, has a rare metabolic condition - known as severe carbamoyl phosphate synthetase 1 (CPS1) deficiency - that meant he has spent the first months of his life in a US hospital on a very restrictive diet. In February, however, the boy received the first dose of his bespoke treatment and then follow-up doses in March and April. \"We prayed, we talked to people, we gathered information, and we eventually decided that this was the way we were going to go,\" said KJ's father Kyle Muldoon. KJ has been able to eat more normally and has recovered well from illnesses like colds, which can strain the body and exacerbate his symptoms. He also now takes fewer medications. \n                  Two more maternity services in the UK issued with warnings this week\n                 \n                  'I felt I couldn't keep my baby safe': Warning of heat impact on pregnant women and newborns\n                 \n                  Weight-loss jabs for obese kids 'are effective and help prevent mealtime rows'\n                 Some experts estimate severe CPS1 deficiency affects one in a million babies. Those infants lack an enzyme needed to help remove ammonia from the body, so it can build up in their blood and become toxic. \"We're still very much in the early stages of understanding what this medication may have done for KJ,\" said study author Dr Rebecca Ahrens-Nicklas, a gene therapy expert at the Children's Hospital of Philadelphia (CHOP). \"But every day, he's showing us signs that he's growing and thriving.\" Read more from climate, science and technology:Why do the moon's two sides look so different?AIs can make collective decisions and influence each otherWarning of heat impact on pregnant women and newborns Considering how poorly KJ had been, \"any time we see even the smallest milestone that he's meeting - like a little wave or rolling over - that's a big moment for us\", said his mother Nicole Muldoon. The team behind KJ's treatment, made up of experts from CHOP and the University of Pennsylvania, published the results of their work in the New England Journal of Medicine. Gene therapy Gene therapy is an innovative treatment that aims to cure disease at the source, by editing the DNA causing the problem. The scientists working on KJ's case used CRISPR, the gene editing tool that won its inventors the Nobel Prize in 2020. In KJ's case, the team found the disease-causing mutation in his genes and created the treatment to flip a \"letter\" in his genetic code to the correct type. \"This is the first step towards the use of gene editing therapies to treat a wide variety of rare genetic disorders for which there are currently no definitive medical treatments,\" said Dr Kiran Musunuru, a University of Pennsylvania gene-editing expert who co-authored the study. The scientists hope that by publishing the results of their treatment quickly, it'll help others to test out similar bespoke treatments. \"Once someone comes with a breakthrough like this, it will take no time\" for other teams to apply the lessons and move forward, said Carlos Moraes, a neurology professor at the University of Miami, who wasn't involved in the study. \"There are barriers, but I predict that they are going to be crossed in the next five to 10 years. Then the whole field will move as a block because we're pretty much ready.\""
    },
    {
        "title": "Melania Trump statue goes missing from her hometown in Slovenia",
        "description": "A life-size statue of Melania Trump has gone missing from her hometown in Slovenia.",
        "url": "https://news.sky.com/story/melania-trump-statue-goes-missing-from-her-hometown-in-slovenia-13369105",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-bronze-statue-melania-trump_6918708.jpg?20250516195019",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-16 16:23:00",
        "Headline": "The bronze creation was unveiled in the town of Sevnica in central Slovenia, where Ms Trump was born in 1970, during Donald Trump's first term in office in 2020.",
        "Content": "A life-size statue of Melania Trump has gone missing from her hometown in Slovenia. Police are investigating the disappearance of the bronze sculpture of the US first lady, which had replaced a wooden statue of her that had been set on fire. The bronze creation was unveiled in 2020 during Donald Trump's first term in office, in the town of Sevnica in central Slovenia where Ms Trump was born in 1970. Police spokesperson Alenka Drenik Rangus said officers were informed about the theft of the statue on Tuesday and were working to track down those responsible. A picture showed the bronze sculpture had been sawn off at the ankles and removed. The original wooden statue was cut from the trunk of a linden tree and showed Ms Trump in a pale blue dress like the one she wore to Mr Trump's presidential inauguration in 2017. It was unveiled in July 2019 and set ablaze in July 2020. Read more from Sky News:Army unit charged with investigating sex crimes allowing abusers to 'get away with it'At least 93 killed in Gaza after Israeli strikesMPs criticise Esther Rantzen's assisted dying intervention A man who works at a bakery in Sevnica that sells cakes with Ms Trump's name said the stolen statue will not be missed. \"I think no one was really proud at this statue, not even the first lady of the USA,\" Franja Kranjc said. \"So I think it's OK that it's removed.\""
    },
    {
        "title": "Thai construction tycoon among 17 people charged over fatal Bangkok tower collapse",
        "description": "A Thai construction tycoon is among 17 people charged following the collapse of a high-rise tower block in Bangkok, which killed at least 92 people.",
        "url": "https://news.sky.com/story/thai-construction-tycoon-among-17-people-charged-over-fatal-bangkok-tower-collapse-13368873",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-bangkok-thailand-myanmar_6869197.jpg?20250328074436",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-16 10:10:00",
        "Headline": "Initial tests of materials gathered at the site in March indicated substandard steel among the wreckage structure, according to industry ministry officials.",
        "Content": " A Thai construction tycoon is among 17 people charged following the collapse of a high-rise tower block in Bangkok, which killed at least 92 people. The 30-storey development, which was still being constructed, was the only building in the city to come down following tremors emanating from a powerful 7.7 magnitude quake in March in neighbouring Myanmar. Premchai Karnasuta, president of Italian Thai Development, one of Thailand's largest construction companies, and 16 other suspects have been accused of negligence and breaching construction regulations. They deny all the charges. Collectively, they are linked to companies responsible for building design and construction, said Metropolitan Police Bureau deputy commissioner Noppasin Poonsawat. Of those charged, 15 people surrendered to police and appeared in court on Friday for pre-trial proceedings. Premchai arrived in a wheelchair. Two more suspects are scheduled to report to authorities in the coming days. A criminal court issued arrest warrants for the 17 on Thursday. \"Expert assessments revealed that the architectural design did not comply with ministerial regulations or meet the technical standards outlined in the terms of reference,\" Noppasin said. \n                  Gangs behind billion-pound cyber scam industry expanding as they try to dodge government crackdowns - new UN report\n                 \n                  Emergency appeal launched for Myanmar as more than 2,800 killed in earthquake\n                 \n                  A gruelling search for bodies in Sagaing, the city at the Myanmar earthquake's epicentre\n                 Initial tests of materials gathered at the site in March indicated the presence of substandard steel among the wreckage structure, according to industry ministry officials. An investigation was still under way over the causes of the collapse. Italian Thai Development has said it is cooperating with authorities. Thai media have reported allegations of wrongdoing in the project almost every day since the building's collapse, many of them involving alleged irregular documentation for the project. Read more:Myanmar quake: Gruelling search for bodiesWhat it's like to be trapped in rubbleBangkok families face agonising wait for news Rescue teams have so far recovered 92 bodies during a six-week operation at the site. Four people remain missing. The search has been halted in the rubble of the collapsed building, which was to become a new State Audit Office, although efforts will continue to identify remains using DNA. The epicentre of the quake was in central Myanmar, where it killed more than 3,700 people and caused major damage in Mandalay, the country's second biggest city, and the capital, Naypyitaw. Premchai's case is his second major clash with the law. In 2019, he was convicted of wildlife poaching and served about three years in prison. Park rangers found him with a hunting party at a wildlife sanctuary in 2018 with carcasses which included a rare black panther."
    },
    {
        "title": "'He's the chosen one': Meet the 14-year-old British boxer now fighting for Bahrain",
        "description": "Only the most ardent followers of boxing will know of Jayden Price, the 14-year-old from Gloucester.",
        "url": "https://news.sky.com/story/hes-the-chosen-one-meet-the-14-year-old-british-boxer-now-fighting-for-bahrain-13369302",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-jayden-price-boxing_6918956.jpg?20250516231445",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-05-16 23:01:00",
        "Headline": "In three years, Jayden Price is aiming to top the podium at the Los Angeles Olympics - but he won't be representing Team GB, having signed up last month to fight for Bahrain.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  Only the most ardent followers of boxing will know of Jayden Price, the 14-year-old from Gloucester. But, in three years, this multiple English youth champion is aiming to top the podium at the Los Angeles Olympics. It won't, however, be God Save The King playing. No Team GB vest will be worn. Because this is an Olympic dream diverting from southwest England via the Middle East. And now, in exclusive interviews with Sky News, it is time for Jayden to reveal all with his coach and father. \"After the European Championships last year, Bahrain reached out to us wanting to sign me to represent their country. So now I represent Bahrain,\" Jayden explains. \"Obviously it's a special feeling to feel like I'm the one that's been reached out to and chosen to represent them.\" It is a decision, given his family's lack of previous connections to the Gulf nation, that has led to them receiving some disparaging comments. There are, of course, financial motivations such as facilitating and funding Jayden's sporting ambitions, while prioritising his wellbeing and private tuition. It was barely a month ago that a young life was transformed with contracts signed in the presence of Bahraini royalty. Jayden says: \"The agreements have been going on for so long, I had time to think, 'OK this is actually going on now'. Time to get used to it.\" Social media caught the attention of Bahrain Olympic Committee chair Jayden's journey being documented by his father, Lee Price, on social media apparently caught the attention of Bahrain Olympic Committee chairman Sheikh Khaled bin Hamad Al Khalifa, who was keen to engage more youngsters in sport. \"As discussions progressed, the focus shifted toward Jayden's long-term ambitions - particularly his aspirations to compete at the Olympic level,\" Mr Price says. \"The Bahraini sporting authorities then explored how they could support Jayden in achieving these goals. \"Bahrain's support package would allow Jayden to maintain his amateur status through to the 2032 Olympic Games in Brisbane, aligning with his long-term development and Olympic ambitions.\" 'It's good to secure it' One thought was that Jayden wouldn't make the cut yet for Team GB's LA 2028 squad and he would need to go professional to start earning money before the 2032 Games. \"It would have been difficult, because on the GB setup there are a lot of good boys,\" he says. \"I think I could have got there but there was a risk that I couldn't have. So it's good to secure it.\" Bahrain's lucrative deal opens up the possibility of two Olympic appearances while staying in the safer amateur ranks longer, with larger and more padded gloves softening blows. But inevitably when making such a decision, financial factors enter the conversation. \"In addition to the benefits of more international exposure, representing a different country can help create a distinctive personal brand,\" Mr Price says. \"This can open doors to sponsorship opportunities from the Middle East and beyond.\" All eight of Bahrain's Olympic medals have been won by imported athletes Britain, for decades, has chased and embraced investment from the Middle East, particularly in sport. So this could be considered reversing the flow of the pipeline and sharing sporting talent in the other direction. And overseas-born athletes, with no previous connections to Britain, have competed for Team GB. There is just a greater reliance in the former British protectorate with oil and gas wealth to spend and a population of Bahrainis under 800,000. All eight Olympic medals ever won by Bahrain have been won by imported athletes. Can Jayden deliver their first in boxing? \"That was the aim for them, to be fair, to hopefully bring me over and hopefully I can start winning them a lot of medals,\" he says. First gold medal won under Bahrain flag When we meet, there is already a first gold medal won under the flag of Bahrain in the collection of honours we are filming. Under the radar, just a couple of weeks earlier, Jayden was in the Jordanian capital Amman competing in an Asian boxing championship and winning the U15s 43kg class. \"Obviously things like the national anthem, I have to get used to that,\" he says. \"But just being able to compete for Bahrain now, I think it's a great opportunity.\" Facing UK opponent 'would be a little awkward' How would it feel facing a British opponent in the Olympic final? \"Obviously,\" he says. \"It would be a little bit awkward.\" But on hand to guide Jayden is a long-standing coach. Now there are trips to Manama for Amin Khan from his base at the Truth Boxing Club in the shadow of Gloucester Cathedral. Wearing a Bahrain Olympic Committee T-shirt, the scepticism and concerns are addressed directly. \"There's going to be a lot of questions, of course,\" Mr Khan says. \"But this is about what's best for Jayden and we want to give him that opportunity where he can perform at a very high level from a very early age and continue to develop. \"Boxing's still like a working-class sport, but it obviously is costly and obviously this opportunity does give financial benefits but more so is the benefits that I can offer for him in terms of career opportunity and getting to the Olympics.\" 'He's the chosen one' Precise figures are not mentioned in any conversations. Only that Jayden's family will be comfortable without pressure on him to seek work. \"He can stay amateur until the age of 21,\" Mr Khan says. \"In England you probably wouldn't have been able to do that because you're then put under pressure of turning pro and trying to earn an income because there's not much financial backing. \"And also it's a unique selling point as well. He's the poster boy of Bahrain, he's the chosen one.\" Aspirations to be 'one of the greatest' There is little sign of a swagger or boastfulness in almost three hours spent with Jayden during his first filming session of this kind on such a delicate, life-changing matter. Already 66 of 70 boxing contests have been won after a combat journey that began in Brazilian jiu-jitsu and mixed martial arts aged six. How will his career look two decades from now, by the age of 34? \"Hopefully be retired and I would have been the former undisputed champion,\" he says. \"Just one of the greatest.\" Read more:Eurovision's UK hopefuls who sing their trollers' insultsPrison governor jailed over relationship with drug boss Greatness that will be achieved not under the flag of Great Britain but a country he only visited for the first time last month. Transferring sporting allegiance like this will provoke a reaction. The family wants the public to understand that the money on offer was too irresistible to turn down. But this is the support needed to help Jayden become a boxing star - prioritising his welfare and wellbeing beyond the growing wealth."
    },
    {
        "title": "R&B singer Chris Brown denied bail over allegation of causing GBH with intent",
        "description": "Chris Brown has been remanded in custody until 13 June by a judge in Manchester.",
        "url": "https://news.sky.com/story/rb-singer-chris-brown-denied-bail-over-allegation-of-causing-gbh-with-intent-13368812",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-chris-brown_6917859.jpg?20250516000703",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-16 08:23:00",
        "Headline": "The 36-year-old has been remanded in custody until 13 June, meaning he will likely miss some of the dates on his upcoming global tour.",
        "Content": " Chris Brown has been remanded in custody until 13 June by a judge in Manchester. The R&B singer is facing an allegation of causing grievous bodily harm with intent, and has been charged. He is accused of attacking music producer Abraham Diaw with a bottle at the Tape nightclub in central London. The incident allegedly took place back in February 2023. During a hearing at Manchester Magistrates' Court, prosecutor Hannah Nicholls said Brown had committed \"an unprovoked attack with a weapon in a nightclub full of people\". She told the court that Brown had struck Mr Diaw with the bottle several times. He then allegedly chased the victim and proceeded to punch and kick him in an attack caught on CCTV. Brown arrived at the dock flanked by court officials. His hair was bleached blond, and he wore sweatpants and a black T-shirt. \n                  Police name firefighters and business owner killed at former RAF base in Bicester\n                 \n                  Prison governor jailed over relationship with drug boss known as Jesse Pinkman\n                 \n                  Police watchdog to investigate mother's claim she was unlawfully strip-searched by Greater Manchester Police\n                 He spoke to confirm his name and date of birth, but did not enter a plea. District Judge Joanne Hirst said the alleged offence was \"too serious\" to be dealt with in her court, and sent the case to London's Southwark Crown Court. Brown will next appear for a plea and trial preparation hearing in the capital on 13 June after a bail application was denied. The 36-year-old was arrested at a hotel in Manchester in the early hours of Thursday by detectives from the Metropolitan Police. Brown's global tour is due to begin in The Netherlands on 8 June, and he is also scheduled to perform at Manchester's Co-op Live Arena on 15 June. Prior to the court hearing, CPS London North's deputy chief crown prosecutor Adele Kelly said: \"The Crown Prosecution Service reminds all concerned that criminal proceedings against this defendant are active and that he has the right to a fair trial. \"It is extremely important that there should be no reporting, commentary or sharing of information online which could in any way prejudice these proceedings.\" Brown's representatives have been contacted for comment."
    },
    {
        "title": "Cassie Ventura finishes her evidence after days describing alleged rape and 'hundreds' of freak offs",
        "description": "R&B star Cassie Ventura told Sean \"Diddy\" Combs \"I'm not a rag doll, I'm someone's child\", after he allegedly beat her outside a lift at the Intercontinental Hotel in Los Angeles in March 2016, a New York court has heard.",
        "url": "https://news.sky.com/story/cassie-ventura-finishes-her-evidence-after-days-describing-alleged-rape-and-hundreds-of-freak-offs-13369317",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cassie-diddy_6918508.jpg?20250516164535",
        "type": "US",
        "Author": "Bethany Minelle",
        "Date Published": "2025-05-16 23:07:00",
        "Headline": "During the fifth day of the Sean \"Diddy\" Combs sex-trafficking trial in Manhattan, New York, the court heard details of an alleged rape in 2018, a surprise $10m settlement with the Intercontinental Hotel and \"an attack with a skillet of eggs\".",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n R&B star Cassie Ventura told Sean \"Diddy\" Combs \"I'm not a rag doll, I'm someone's child\", after he allegedly beat her outside a lift at the Intercontinental Hotel in Los Angeles in March 2016, a New York court has heard. Footage of Combs appearing to drag and kick the R&B star in a corridor was initially released by CNN in May 2024. Combs subsequently apologised for his actions.  The footage of the incident, which Cassie says took place after she left a \"freak off\" sex session, has since been widely shared and has been shown to the jury in court as evidence for the prosecution. Combs, 55, faces five criminal counts: one count of racketeering conspiracy; two counts of sex trafficking by force, fraud or coercion; and two counts of transportation to engage in prostitution. He denies the allegations against him. Cassie, whose full name is Casandra Ventura, alleges she was physically abused and degraded for years by the powerful hip-hop star and music executive, accusing him of violence, coercion, blackmail and rape. The 38-year-old, who is the star witness for the prosecution, faced a fourth day on the stand, with the hip-hop mogul's defence lawyers concluding their two-day cross-examination. Heavily pregnant, she is expecting her third child in just a few weeks. \n                  Diddy trial: What we have learned from Cassie's testimony\n                 \n                  Cassie challenged over Diddy 'freak off' allegations - as explicit messages read in court\n                 \n                  Cassie breaks down in tears during Sean 'Diddy' Combs trial as she tells of 'personal shame' and alleged rape\n                 Prosecutors say Combs exploited and used his network of employees to facilitate illegal activities, while defence lawyers have been attempting to show jurors she consented to their highly charged \"swingers lifestyle\". The court also heard further details of Cassie's allegation of rape against Combs, information around her stay at a trauma and addiction centre in Arizona and further messages appearing to show her enthusiasm for freak offs. Sean 'Diddy' Combs trial: Day 5 - As it happened Cassie was asked about singer Chris Brown - who she denied dancing with - and tells the court Combs had form for taking her belongings, including her phone, car and watch, when he was angry with her. An audio recording was also played to the court, appearing to show Cassie threatening a man she claimed to have a video of her at a freak off on his phone, screaming: \"I will f*** you up and it won't be my hand\". It was not clear as to whether such a video ever existed. Cassie was also asked about her use of drugs, and said she had struggled with opioid addiction since 2022. She described a 45-day stay at a rehabilitation centre in Arizona in 2023, where she underwent EMDR (Eye Movement Desensitisation and Reprocessing) to help resolve trauma. The centre specialises in treating \"sex and intimacy issues\", but Cassie confirmed she was treated only for trauma. The court also heard about Cassie's allegation of rape against Combs in August or September 2018, by which time she says they had split up. The pair were together, on and off, for about 11 years from 2007 to 2018. 'I have love for the past, what it was' Describing Combs taking her for dinner at an Italian restaurant in Malibu, she says he raped her after driving her home, after \"acting strangely\" during the meal. When asked if she believed his behaviour was due to his \"bipolar disorder\", Cassie answered \"yes\". The jury was then shown a text message which included a heart emoji, sent by Cassie to Combs the following day. When asked if she still had love for him, she said: \"I have love for the past, what it was.\" Cassie confirmed she saw Combs the following month, when she said she had consensual sex with him, during which her now-husband, personal trainer Alex Fine, attempted to FaceTime her. She said she didn't tell Fine she had been raped by Combs at the time, but that he \"punched a wall\" when she later told him. Combs paid close attention to Cassie's cross-examination, leaning in to read transcripts on the monitor in front of him and passing down notes to his lawyer. Cassie did not look at him throughout the trial. A '$10m' settlement with the Intercontinental Towards the end of her questioning by the defence, Cassie was read a message from Combs in September 2012, in which he asked \"do you want to have our last FO [freak off] tonight?\" - to which she responded, \"I don't want to freak off for the last time, I want it to be the first time for the rest of our lives\". In a surprise turn, Cassie also confirmed that an expected settlement of $10m had been agreed with the Intercontinental Hotel in Los Angeles, where she was assaulted. Following her time in court, she released a statement saying she hoped her testimony would help others \"heal from the abuse and fear\". \"For me, the more I heal, the more I can remember,\" she said. \"And the more I can remember, the more I will never forget.\" The next witness, special agent Yasin Binda, detailed items found during a search of Combs's Park Hyatt hotel room in 2004, following his arrest that year. She showed the court images of exhibits including lubricant and baby oil, drugs and a bum bag containing $9,000 (£6,800) in cash. 'Hit over the head with a skillet of eggs' At the end of the day, Dawn Richard, a former member of girl group Danity Kane and trio Dirty Money, gave evidence, telling the court she observed Combs attacking Cassie, including a time he \"hit her over the head with a skillet of eggs\". She went on to say Combs \"dragged\" Cassie upstairs where she \"heard glass breaking\", adding she had \"never seen anything\" like it before - \"he was punching his girlfriend\". Richard said she didn't intervene or report the incident to the police as she was \"scared\". The singer sued Combs last year, accusing him of physical abuse, groping and psychological abuse during her time working with him. Combs has been jailed since September and faces at least 15 years or possibly life in prison if convicted. The trial is set to last for seven more weeks."
    },
    {
        "title": "Salman Rushdie attacker who left author blind in one eye jailed",
        "description": "A man convicted of stabbing Salman Rushdie, leaving the author blind in one eye, has been jailed for 25 years.",
        "url": "https://news.sky.com/story/hadi-matar-man-who-stabbed-salman-rushdie-leaving-author-blind-in-one-eye-is-jailed-13368863",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-salman-rushdie-author_6825727.jpg?20250221215754",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-16 14:40:00",
        "Headline": "During the trial, Sir Salman revealed he feared he was dying when the masked attacker plunged a knife into his head and body more than a dozen times.",
        "Content": "A man convicted of stabbing Salman Rushdie, leaving the author blind in one eye, has been jailed for 25 years. Hadi Matar was found guilty of attempted murder and assault in February. Prosecutors had been seeking the maximum sentence of 25 years for the attack in August 2022, along with an additional seven-year term for injuring a second man. During the trial, Sir Salman revealed he feared he was dying when the masked attacker plunged a knife into his head and body more than a dozen times. The attack happened as the 77-year-old was introduced on stage at the Chautauqua Institution in New York for a discussion on writer safety. Sir Salman was stabbed in the head, neck, torso and left hand and suffered damage to his liver and intestines.  The Midnight's Children author spent 17 days at a hospital in Pennsylvania and more than three weeks at a rehabilitation facility in New York City, as he recovered from his injuries. He wrote about the attack and his recovery in his 2024 memoir Knife. Matar will next face a trial on terrorism-related charges. Prosecutors allege the 27-year-old was trying to carry out a decades-old fatwa calling for the author's death. In 1989, Iran's then leader, Ayatollah Ruhollah Khomeini, issued the fatwa in response to the publication of Sir Salman's novel The Satanic Verses, which some Muslims consider blasphemous, causing the Indian born British-American author to go into hiding. In 1998, Iran announced it would not enforce the decree, allowing Sir Salman to travel freely over the last quarter of a century. Read more from Sky News:Army unit charged with investigating sex crimes allowing abusers to 'get away with it'At least 93 killed in Gaza after Israeli strikesMPs criticise Esther Rantzen's assisted dying intervention Matar pleaded not guilty to providing materials to terrorists, attempting to provide material support to Hezbollah and engaging in terrorism transcending national boundaries."
    },
    {
        "title": "Baby gets world's first personalised gene therapy treatment",
        "description": "A baby born with a rare genetic disease is \"growing and thriving\" after getting bespoke gene therapy.",
        "url": "https://news.sky.com/story/baby-gets-worlds-first-personalised-gene-therapy-treatment-13369006",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kj-gene-therapy_6918376.jpg?20250516144127",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-16 13:26:00",
        "Headline": "Nine-and-a-half-month-old KJ Muldoon has a rare metabolic condition that meant he spent the first months of his life in hospital on a very restrictive diet.",
        "Content": "A baby born with a rare genetic disease is \"growing and thriving\" after getting bespoke gene therapy. It's the first time anyone in the world has been given an experimental gene-editing treatment designed specifically for their disease and took scientists just seven months to develop. Nine-and-a-half-month-old KJ Muldoon, from Clifton Heights, Pennsylvania, has a rare metabolic condition - known as severe carbamoyl phosphate synthetase 1 (CPS1) deficiency - that meant he has spent the first months of his life in a US hospital on a very restrictive diet. In February, however, the boy received the first dose of his bespoke treatment and then follow-up doses in March and April. \"We prayed, we talked to people, we gathered information, and we eventually decided that this was the way we were going to go,\" said KJ's father Kyle Muldoon. KJ has been able to eat more normally and has recovered well from illnesses like colds, which can strain the body and exacerbate his symptoms. He also now takes fewer medications. \n                  Two more maternity services in the UK issued with warnings this week\n                 \n                  'I felt I couldn't keep my baby safe': Warning of heat impact on pregnant women and newborns\n                 \n                  Weight-loss jabs for obese kids 'are effective and help prevent mealtime rows'\n                 Some experts estimate severe CPS1 deficiency affects one in a million babies. Those infants lack an enzyme needed to help remove ammonia from the body, so it can build up in their blood and become toxic. \"We're still very much in the early stages of understanding what this medication may have done for KJ,\" said study author Dr Rebecca Ahrens-Nicklas, a gene therapy expert at the Children's Hospital of Philadelphia (CHOP). \"But every day, he's showing us signs that he's growing and thriving.\" Read more from climate, science and technology:Why do the moon's two sides look so different?AIs can make collective decisions and influence each otherWarning of heat impact on pregnant women and newborns Considering how poorly KJ had been, \"any time we see even the smallest milestone that he's meeting - like a little wave or rolling over - that's a big moment for us\", said his mother Nicole Muldoon. The team behind KJ's treatment, made up of experts from CHOP and the University of Pennsylvania, published the results of their work in the New England Journal of Medicine. Gene therapy Gene therapy is an innovative treatment that aims to cure disease at the source, by editing the DNA causing the problem. The scientists working on KJ's case used CRISPR, the gene editing tool that won its inventors the Nobel Prize in 2020. In KJ's case, the team found the disease-causing mutation in his genes and created the treatment to flip a \"letter\" in his genetic code to the correct type. \"This is the first step towards the use of gene editing therapies to treat a wide variety of rare genetic disorders for which there are currently no definitive medical treatments,\" said Dr Kiran Musunuru, a University of Pennsylvania gene-editing expert who co-authored the study. The scientists hope that by publishing the results of their treatment quickly, it'll help others to test out similar bespoke treatments. \"Once someone comes with a breakthrough like this, it will take no time\" for other teams to apply the lessons and move forward, said Carlos Moraes, a neurology professor at the University of Miami, who wasn't involved in the study. \"There are barriers, but I predict that they are going to be crossed in the next five to 10 years. Then the whole field will move as a block because we're pretty much ready.\""
    },
    {
        "title": "Former FBI director investigated for cryptic post 'threatening' Donald Trump",
        "description": "A former FBI director is being investigated for a social media post interpreted by US officials as a threat against President Donald Trump.",
        "url": "https://news.sky.com/story/former-fbi-director-james-comey-investigated-for-post-threatening-donald-trump-13368759",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-james-comey-donald-trump_6917946.jpg?20250516082020",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-16 06:08:00",
        "Headline": "James Comey, who led the bureau from 2013 until he was fired by Mr Trump in 2017, shared a photo of seashells appearing to form the number 86 47 on Instagram.",
        "Content": "A former FBI director is being investigated for a social media post interpreted by US officials as a threat against President Donald Trump. James Comey, who led the bureau from 2013 until he was fired by Mr Trump in 2017, shared a photo of seashells appearing to form the number 86 47 on Instagram. He captioned the post: \"Cool shell formation on my beach walk.\" Some US officials have interpreted the post as a threat, alleging that 86 47 means to violently remove Mr Trump from office, including by assassination. The number 86 can be used as a verb in the US. It commonly means \"to throw somebody out of a bar for being drunk or disorderly\". One recent meaning of the term is \"to kill\", according to the Merriam-Webster Dictionary, which said it had not adopted this meaning of 86 \"due to its relative recency and sparseness of use\". The number has previously been used in a political context by Matt Gaetz, who was President Donald Trump's pick for attorney general but resigned following a series of sexual misconduct allegations. Mr Gaetz wrote: \"We've now 86'd...\" and listed political opponents he had sparred with who ended up stepping down. Meanwhile, 47 is supposedly representing Mr Trump, who is the 47th US president.  Mr Comey later removed the post, saying he thought the numbers \"were a political message\" and that he was not aware that the numeric arrangement could be associated with violence. \"I didn't realise some folks associate those numbers with violence. It never occurred to me, but I oppose violence of any kind, so I took the post down,\" Mr Comey said. Mr Trump later hit back, claiming that the former FBI director \"knew exactly what it meant\". \n                  Don't get your hopes up of Ukraine peace talks between Donald Trump and Vladimir Putin anytime soon\n                 \n                  Is the Middle East Trump's comfort zone?  \n                 \n                  It's the Trump era and Putin knows how to exploit it\n                  A spokesman for the Secret Service, which is responsible for protecting the president, said they were aware of the post and the agency would \"take rhetoric like this very seriously\". Current FBI Director Kash Patel said the bureau was aware of the post and was conferring with the Secret Service. The Department of Homeland Security and the Secret Service are investigating the post \"calling for the assassination\" of Mr Trump and \"will respond appropriately\", Homeland Security secretary Kristi Noem said on Thursday. Donald Trump Jr. accused Mr Comey of \"casually calling for my dad to be murdered\". A White House deputy chief of staff, Tayor Budowich, said Mr Comey had put out \"what can clearly be interpreted as a hit on the sitting president of the United States\". \"This is deeply concerning to all of us and is being taken seriously,\" Mr Budowich wrote on the social media platform X. Another White House staffer, James Blair, said the post was a \"Clarion Call (...) to terrorists & hostile regimes to kill the President of the United States as he travels in the Middle East\". Read more US news:Smokey Robinson under criminal investigationCassie challenged over Diddy 'freak off' allegations Mr Trump fired Mr Comey in May 2017 for botching an investigation into 2016 democratic presidential nominee Hillary Clinton, the White House said at the time. While Mr Comey was the director of the FBI, the agency opened an investigation into possible collusion between the Trump 2016 presidential campaign and Russia to help get Mr Trump elected."
    },
    {
        "title": "Diddy trial: What we have learned from Cassie's testimony",
        "description": "Singer Cassie is the key witness in the prosecution's case against Sean \"Diddy\" Combs.",
        "url": "https://news.sky.com/story/diddy-trial-what-we-have-learned-from-cassies-testimony-13368767",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cassie-p-diddy-trial_6915575.jpg?20250516080439",
        "type": "US",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-16 06:30:00",
        "Headline": "Casandra Ventura, known in the music industry as Cassie, has given lengthy testimony this week on her on-off relationship with music mogul Sean \"Diddy\" Combs.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Singer Cassie is the key witness in the prosecution's case against Sean \"Diddy\" Combs. The pair were in an on-off relationship for about 11 years, from 2007 to 2018, after she signed to his label, Bad Boy Records. She has alleged she was physically, sexually and mentally abused by Combs for most of this time, accusing him of forcing her into \"hundreds\" of drug-fuelled sex sessions with male escorts, known as \"freak offs\", while he watched. But his lawyers argue the singer, whose full name is Casandra Ventura, was a willing participant who consented to a \"swingers lifestyle\". Sean 'Diddy' Combs trial: Week 1 - Everything that's happened so far Combs, 55, is charged with sex-trafficking, racketeering conspiracy and transportation to engage in prostitution. He has pleaded not guilty to all charges and denied any allegations of sexual abuse. The trial in Manhattan, New York, is expected to last about eight weeks, with evidence from more women who will remain anonymous to come. It is not yet known whether Combs himself will take the stand. Ms Ventura, 38, has consented to being named and her testimony - including allegations about an alleged attack at a hotel in 2016, where Combs was filmed on CCTV seemingly beating and dragging her as she attempted to leave a freak off - is central to the case. Here is what we have learned from her testimony. 'Freak offs became like a job' During her first day of evidence, Ms Ventura told the trial that after signing what was a huge 10-album deal with Combs's Bad Boy Records, she only ever released her first, called Cassie, in 2006. Instead, she said, freak offs with escorts became so frequent - and required recovery time - that they were like a job. She was 22 when, during the first year of their relationship, she said the hip-hop mogul first proposed the idea. Her \"stomach churned\", she said, and she was \"confused, nervous, but also loved him very much\". To jurors, she gave graphic details of these drug and drink-fuelled encounters with male escorts, saying Combs would watch and masturbate, and often record the encounters and watch the videos back. They could last for hours or even days, she said - the longest allegedly for four days. She says she would get no sleep during these encounters, so used drugs to keep herself awake, but also disassociated. \"Freak offs became a job where there was no space to do anything else but to recover and just try to feel normal again,\" Ms Ventura said. Each time, she added, she had to recuperate from lack of sleep, alcohol, drugs \"and other substances\", and \"having sex with a stranger for days\". Combs 'used violence and blackmail' Ms Ventura told jurors Combs was violent to her over the course of their relationship, giving her black eyes and bruises, kicking her and dragging her. The hip-hop star became increasingly controlling, she said, and was allegedly abusive over the smallest perceived slights. \"You make the wrong face, and the next thing I knew I was getting hit in the face,\" she told the court. When asked how frequently Combs became violent with her, Ms Ventura responded: \"Too frequently.\" She said she began feeling as if she could not say no to Combs's demands because \"there were blackmail materials to make me feel like if I didn't do it, it would be held over my head in that way or these things would become public\". Ms Ventura described several alleged violent incidents, including one when she allegedly suffered a \"pretty significant gash\" above her left eye after the rapper threw her into a bed frame. Rather than go to hospital for stitches, his security staff took her to a plastic surgeon in Beverly Hills, she said. Jurors shown explicit images During the second day of Ms Ventura's testimony, the courtroom fell silent as images from freak offs were shown to jurors. These were kept private from the public gallery so that only those who needed to see them could do so. Combs asked Marc Agnifilo, one of his lawyers, to see a binder of the images, and thumbed through it for a few moments before handing it back. The pictures included images of Ms Ventura with escorts. Alleged rape after relationship ended Ms Ventura told the court that Combs raped her at her home in Los Angeles, after she told him she was ending things. \"I just remember crying and saying no, but it was very fast,\" she said, her voice trailing off. She told jurors she did have consensual sex with the rapper on a subsequent occasion. \"We'd been together for over 10 years. You just don't turn feelings off,\" she said. Throughout her testimony she described a complex relationship with a man she loved and was desperate to please, but was also scared of. She has maintained she never wanted to have sex with strangers, but wanted to please him. Why is Cassie testifying? Telling the courtroom, and therefore the world, about her experiences, over four days of questioning, was humiliating and difficult - prosecutor Emily Johnson asked why she put herself through it. Ms Ventura had remained fairly calm and composed throughout her time on the stand, with a few emotional moments, but at this point she broke down as she described her \"personal shame\" to jurors. \"I can't carry this anymore,\" she told the court. \"I can't carry the shame, the guilt, the way he treated people like they were disposable. What's right is right, what's wrong is wrong. I came here to do the right thing.\" Early in 2023, she said she started suffering from \"flashbacks\" and had suicidal thoughts, so went to rehab and trauma therapy. Ms Ventura sued Combs in November 2023, and settled within 24 hours. She received £20m, the trial was told. Combs 'threatened Cassie and Kid Cudi' Ms Ventura's second day of testimony also included details of how she briefly dated Scott Mescudi, better known as singer and rapper Kid Cudi, during a low point in her relationship with Combs in 2011. Combs lunged at her with a corkscrew and kicked her in the back when he found out, jurors heard, and threatened to blow up Mescudi's car. These allegations were also detailed in her lawsuit, which alleged his car did \"explode in his driveway\" around this time. The hotel CCTV 'attack' CCTV from the InterContinental Hotel in Century City, Los Angeles, filmed on 5 March 2016, was first released by CNN in May 2024 - six months after Ms Ventura filed her lawsuit and four months before Combs was charged with the crimes he is now on trial for. It showed Combs, wearing just socks and a towel around his waist, allegedly beating and dragging Ms Ventura in a hallway.  She told the court this happened after she tried to leave a freak off after being hit by Combs during the session. She had the premiere coming up for her first film, The Perfect Match, the court heard. Despite the incident, the pair were pictured at the event together. Messages paint a complex picture Under cross-examination from the defence, sexually explicit messages between Ms Ventura and Combs were read in court. Some showed her expressing apparent enthusiasm about the freak off sex sessions she alleges she was forced into. \"I'm always ready to freak off,\" the court heard Ms Ventura wrote in one message in August 2009. In another, she told Combs about a freak off: \"Can't wait.\" And in another, jurors were told she described a video of one sex session with an escort as \"dope\". Messages from 4 March 2016, the day before the InterContinental Hotel incident, were also read in court. One said: \"Baby I want to FO so bad but I dont want to f*** myself up.\" Ms Ventura told the court this was damage limitation and that she wanted to keep him happy due to her upcoming film premiere. Read more:The rise and fall of Sean CombsDiddy - a timeline of allegationsEverything you need to know about the trial Jurors also heard details of an email she sent in 2009, in which she expressed conflicting feelings about taking part in these sex sessions with escorts. In the email, she told Combs she needed to trust him \"beyond it just being sexual\" - that in order to be more open sexually, \"I need to feel safe, like home\". She told him \"the last time was a mistake but since has made me feel a little dirty, and grimy as opposed to sexual and spontaneous\". This was the reason she was going \"back and forth in my mind with wanting and not wanting to do it\", she wrote. \"I get nervous that I'm just becoming the girlfriend that you get your fantasies off with.\" Diddy 'overdosed at Playboy Mansion' Drug use came up a lot during Ms Ventura's testimony, and she admitted to using drugs including ketamine, ecstasy, MDMA and opiates, saying she needed them in order to get through the freak offs. She also claimed Combs used drugs and said she believes he was addicted to opiates when they were together. Ms Ventura told the court he was taken to hospital after overdosing on opiates at the Playboy Mansion in 2012 - something which was reported by media outlets including TMZ at the time, when it was said he had suffered a migraine. The trial continues."
    },
    {
        "title": "Trump's gift: Why is Air Force One so important to the president?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>       ",
        "url": "https://news.sky.com/story/trumps-gift-why-is-air-force-one-so-important-to-the-president-13368909",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/2372505150457876307_6917410.png?20250515161800",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-16 11:15:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈  Air Force One, sometimes referred to as the 'flying Oval Office', is seen as a global symbol of American power.  It is for this reason, among others, that Donald Trump has come under fire for wanting to accept a Qatari Boeing 747-8 to replace the traditional presidential plane. But why is everyone so riled by the prospects of this new jet? Kenneth T Walsh is a former White House correspondent and author of Air Force One: A History of the Presidents and Their Planes, who has spent over 35 years covering and travelling with presidents. Kenneth joins Niall Paterson to discuss the significance of Air Force One, and memories from his trips on the plane. Producers: Gabriel Radus, Natalie Ktena, Soila ApparicioEditor: Philly Beaumont"
    },
    {
        "title": "Superstar Adele joins backers of music royalties platform Audoo",
        "description": "Adele, the Grammy award-winning artist, has joined the list of music superstars investing in Audoo, a music technology company which helps artists to receive fairer royalty payments.",
        "url": "https://news.sky.com/story/superstar-adele-joins-backers-of-music-royalties-platform-audoo-13368881",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-adele-germany_6439605.jpg?20240131180822",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-16 10:23:00",
        "Headline": "The multi-award-winning singer of Someone Like You has invested a six-figure sum in Audoo, a platform which aims to help musicians receive fairer royalty payments, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Adele, the Grammy award-winning artist, has joined the list of music superstars investing in Audoo, a music technology company which helps artists to receive fairer royalty payments. Sky News has learnt that the British musician and Adam Clayton, the U2 bassist, have injected money into Audoo as part of a £7m funding round. The pair join Sir Elton John, Sir Paul McCartney and ABBA's Bjorn Ulvaeus as shareholders in the company. Changes to Audoo's share register were filed at Companies House in recent days. Audoo, which was established by former musician Ryan Edwards, is trying to address the perennial issue of public performance royalties, in order to ensure musicians are rewarded when their work is played in public venues. Mr Edwards is reported to have been motivated to set up the company after hearing his own music played at football stadia and in bars, without any payment for it. Estimates suggest that artists lose out on billions of dollars of unaccounted royalties each year. \n                  Adele song must be pulled worldwide amid plagiarism claim, Brazilian judge orders\n                 \n                  Adele bids tearful farewell to Las Vegas residency as star admits she doesn't know when she'll perform next\n                 \n                  Adele to step away from music 'for an incredibly long time' to live 'new life'\n                 London-based Audoo uses a monitoring device - which it calls an Audio Meter - to recognise songs played in public venues, and which is said to have a 99% success rate. It has struck what it describes as industry-first partnerships with organisations including the music licensing company PPL/PRS to track and report songs played in public performance locations such as cafes, hair salons, shops and gyms. \"At Audoo, we're incredibly proud of the continued support we're receiving as we work to make music royalties fairer and more transparent for artists and rights-holders around the world through our pioneering technology,\" Mr Edwards told Sky News in a statement on Friday. \"We have successfully reached £7m in our latest funding round. \"This funding marks a pivotal moment for Audoo as we focus on our growth in North America and across Europe, bringing us closer to our mission of revolutionising the global royalty landscape.\" Sources said the new capital would be used partly to finance Audoo's growth in the US. The latest funding round takes the total amount of money raised by the company since its launch to more than $30m. Mr Edwards has spoken of his desire to establish a major presence in Europe and the US because of their status as the world's biggest recorded music markets. Adele's management company did not respond to an enquiry from Sky News."
    },
    {
        "title": "The Sunday Times Rich List: Billionaires fall as King rises to match Rishi Sunak",
        "description": "The King's personal fortune has shot up by &#163;30m to put him on par with Rishi Sunak and his wife Akshata Murty, while the overall number of billionaires in the UK has plummeted, according to The Sunday Times Rich List.",
        "url": "https://news.sky.com/story/the-sunday-times-rich-list-billionaires-fall-as-king-rises-to-match-rishi-sunak-13368850",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-rich-list-sunday-times_6918342.jpg?20250516141544",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-16 09:19:00",
        "Headline": "Sir Jim Ratcliffe has lost billions since becoming a part owner of Manchester United, according to the list which reveals the wealth of the 350 richest people in the UK.",
        "Content": "The King's personal fortune has shot up by £30m to put him on par with Rishi Sunak and his wife Akshata Murty, while the overall number of billionaires in the UK has plummeted, according to The Sunday Times Rich List. The 2025 list, published on Friday, shows the King's personal wealth grew from £610m to £640m, taking him up 20 places to 258 - level with former prime minister Mr Sunak and his wife. The number of overall UK billionaires has fallen to 156 from 165 in 2024, marking the biggest drop since the rich list began 37 years ago. Gopi Hinduja and his family, behind the Indian conglomerate Hinduja Group, topped the list for the fourth year running with £35.3bn. Meanwhile, founder and chairman of global chemicals company Ineos Sir Jim Ratcliffe, who became part owner of Manchester United last year, dropped from fourth place to seventh after his reported wealth went from £23.5bn to £17.05bn. Sir Jim's £6.47bn losses marked the biggest on the list, while Russian-born brothers Igor and Dmitry Bukhman, who built a fortune on mobile games such as Gardenscapes and Fishdom, made the biggest gains with nearly £6.2bn. New entries included makeup mogul Charlotte Tilbury with £350m and Ellen DeGeneres, who left the US for the Cotswolds last year. The Sunday Times said the list was one of its toughest to compile due to Donald Trump's tariffs and the subsequent stock market turbulence, adding many from previous years had dropped off the list and others were no longer eligible having fled Britain after Labour's non-dom crackdown. Read more:Steep rise in equity release - here are pros and consHow British 'geeks' launched one of most lucrative gaming franchises of all time Overall, the combined wealth of those on the list stood at £772.8bn - down 3% from the last list. Speaking to Anna Jones on Sky News Breakfast, Rich List compiler Rob Watts highlighted the story of Tom and Phil Beahon, who own sportswear clothing brand Castore which is now worth £1bn, as one of his favourites. The brothers from Wirral have debuted at joint 345 on the list with an estimated wealth of £350m. Calling their story \"inspiring\", Mr Watts said: \"They dreamed of being sportsmen as lads - one of them got onto the books of Tranmere Rovers and the other played cricket for Lancashire, but their sporting careers were over in their early 20s. \"And they say that failure was critical to driving them to create this £1bn sports kit business that you'll now see being worn by the England cricket team and the England rugby team.\" The top 20: 1. Gopi Hinduja and family - £35.3bn 2. David and Simon Reuben and family - £26.87bn 3. Sir Leonard Blavatnik - £25.73bn 4. Sir James Dyson and family - £20.8bn 5. Idan Ofer - £20.12bn 6. Guy, George, Alannah and Galen Weston and family - £17.75bn 7. Sir Jim Ratcliffe - £17.05bn 8. Lakshmi Mittal and family - £15.44bn 9. John Fredriksen and family - £13.68bn 10. Igor and Dmitry Bukhman - £12.54bn 11. Kirsten and Jorn Rausing - £12.51bn 12. Michael Platt - £12.5bn 13. Charlene de Carvalho-Heineken and Michel de Carvalho - £10.09bn 14. Duke of Westminster and the Grosvenor family - £9.88bn 15. Lord Bamford and family - £9.45bn 16. Denise, John and Peter Coates - £9.44bn 17. Carrie and Francois Perrodo and family - £9.3bn 18. Barnaby and Merlin Swire and family - £9.25bn 19. Marit, Lisbet, Sigrid and Hans Rausing - £9.09bn 20. Alex Gerko - £8.75bn"
    },
    {
        "title": "Cryptocurrency platform Coinbase warns of up to $400m hit from cyber attack ",
        "description": "One of the world&#8217;s leading cryptocurrency exchanges has suffered a cyber attack that could cost it $400m (&#163;301m). ",
        "url": "https://news.sky.com/story/cryptocurrency-platform-coinbase-warns-of-up-to-400m-hit-from-cyber-attack-13368861",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-coinbase-crypto_6918081.jpg?20250516104727",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-16 09:40:00",
        "Headline": "The hackers had paid multiple employees and contractors working in support roles outside the US to collect user data. Everyone involved has been fired, Coinbase said.",
        "Content": "One of the world’s leading cryptocurrency exchanges has suffered a cyber attack that could cost it $400m (£301m).  Hackers breached account data of a \"small subset\" of its customers and then tricked them into sending funds, the company said in a regulatory filing. Coinbase received an email from an unknown threat actor on 11 May, claiming to have information about some customer accounts as well as internal documents. Money blog: 'Game-changing' 100% mortgage launched The hackers did not gain access to login credentials or passwords, but data including names, addresses and emails were stolen, Coinbase said. The hackers had paid multiple employees and contractors working in support roles outside the US to collect the information. Everyone involved has been fired, it said. Coinbase will reimburse all customers who were tricked into sending funds to the attackers - and estimates costs surrounding the hack will total between $180m (£135m) and $400m. \n                  US senators attempt to ban Trump's 'profoundly corrupt' crypto schemes\n                 \n                  Crypto prices rally after Trump names Bitcoin and others for US strategic reserve\n                 \n                  Biggest crypto heist in history, worth $1.5bn, linked to North Korea hackers\n                 The exchange refused to pay a $20m (£15m) ransom to the hackers and is working with law enforcement agencies. It has also established a $20m reward for information on the attackers.  Coinbase is also opening a new US support hub and taking other measures to prevent cyber attacks, it said. This development comes just days before Coinbase is set to join the S&P 500 index - in what is expected to be a landmark moment for crypto. More from Sky News:Co-op updates on cyber attack recoveryUK economy grows more than expected Security remains a challenge for the industry and in February, Dubai-based Bybit disclosed a hack which saw around $1.5bn (£1.19bn) of digital tokens stolen - widely dubbed the biggest crypto heist of all time. \"As our nascent industry grows rapidly, it draws the eye of bad actors, who are becoming increasingly sophisticated in the scope of their attacks,\" said Nick Jones, founder of crypto firm Zumo."
    },
    {
        "title": "Princes Foods-owner picks banks for £700m London listing",
        "description": "The Italian-owned producer of some of Britain's most popular food brands has hired bankers to prepare the ground for a London stock market float.",
        "url": "https://news.sky.com/story/princes-foods-owner-picks-banks-for-163700m-london-listing-13368877",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-princes-food-can-tuna_6300924.png?20231208113228",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-16 10:16:00",
        "Headline": "Newlat Food, the Italian group which bought Princes for £700m last year, is working with banks including BNP Paribas and Peel Hunt on a potential London float, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Italian-owned producer of some of Britain's most popular food brands has hired bankers to prepare the ground for a London stock market float. Sky News has learnt that Newlat Food, which produces tinned fish and fruits, as well as a range of soft drinks, and sunflower oil under the Flora brand, is working with BNP Paribas and Peel Hunt on a UK listing of a large chunk of its business. Unicredit and Rabobank are also said to be involved in the prospective deal. Money blog: 'Game changing' 100% mortgage launched A float, which could value the New Princes portfolio at about £700m, is still being evaluated, according to a statement from the Italian parent this week. It comes less than a year after Newlat acquired Princes from Japan's Mitsubishi Corporation amid competition from private equity bidders. Read more from Sky News:Cryptocurrency platform warns of $400m hit from cyber attack \n                  Money blog: Shoppers disrupted as Tesco site crashes; 100% mortgage launched\n                 \n                  Superstar Adele joins backers of music royalties platform Audoo\n                 \n                  The Sunday Times Rich List: Billionaires fall as King rises to match Rishi Sunak\n                 Newlat said this week that the integration of Princes had taken place ahead of schedule. \"A potential IPO may provide a tangible opportunity to fully drive the growth potential of the food & drinks business, while also enabling the business to secure additional financial resources to accelerate its external growth strategy,\" the company said. \"At this stage, no decisions have been made and there can be no certainty that any such transaction or changes will proceed.\" A listing of New Princes would deliver a fillip to the London Stock Exchange, which has been starved of prominent new listings in the last couple of years. None of the banks involved in the plan would comment on Friday."
    },
    {
        "title": "The cheapest and most expensive region to get a pint in the UK ",
        "description": "Wherever you are when you buy a pint can have a big impact on the price you'll pay.",
        "url": "https://news.sky.com/story/the-cheapest-and-most-expensive-region-to-get-a-pint-in-the-uk-13368790",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-money-blog-beer_6761146.jpg?20241129130536",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-16 07:50:00",
        "Headline": "Data shared with the Money blog has revealed the average price of a pint in the UK and the parts of the country where one will cost you less. ",
        "Content": "Wherever you are when you buy a pint can have a big impact on the price you'll pay. Data shared with Money by consultancy CGA shows that the average cost of a pint in Great Britain is £4.60. A regional breakdown shows that, as expected, London comes in as the most expensive place to buy a pint at £5.44. The South and the South East comes in at second place at £4.94, with the South West also above the national average at £4.63. At the other end of the scale, Wales comes in as the cheapest place to buy a pint at £4.21. Take a look at the full breakdown in our interactive map below. "
    },
    {
        "title": "Anglian Water fined record £1.42m for drinking water failures",
        "description": "Anglian Water has been fined &#163;1.4m for drinking water failures which affected around 1.3 million people.",
        "url": "https://news.sky.com/story/anglian-water-fined-record-163142m-for-drinking-water-failures-13369068",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-drinking-water-glass_6918534.jpg?20250516170757",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-16 15:16:00",
        "Headline": "The water firm apologised and admitted the breach but said the risk to customers was \"very low\".",
        "Content": "Anglian Water has been fined £1.4m for drinking water failures which affected around 1.3 million people. The Drinking Water Inspectorate (DWI) said the company used unapproved plastic-based products to externally coat pipework submerged in drinking water tanks at four different sites. The pipes were installed between 2016 and 2019 and remained until 2021. Anglian Water supplies an area of eastern England from the Humber to the Thames Estuary, \"Contamination of drinking water on any scale is scandalous and a complete disgrace,\" said Environment Secretary Steve Reed. \"The record £1.4m fine handed down sends a clear signal that this criminal behaviour is unacceptable,\" he added. The DWI said its investigation uncovered wider issues, including a lack of staff training, poor oversight of the supply chain, and in some cases, water tanks continued to be used even after the company knew they contained unapproved products. \n                  Money blog: Shoppers disrupted as Tesco site crashes; 100% mortgage launched\n                 \n                  Superstar Adele joins backers of music royalties platform Audoo\n                 \n                  The Sunday Times Rich List: Billionaires fall as King rises to match Rishi Sunak\n                 All of the issues have since been rectified, according to the DWI. Read more from Sky News:Welsh Water fined £1.35m over breachesMinister: 'Water system is failing'Bosses face prison for illegal sewage spills Anglian Water, which reported the failures to the DWI, pleaded guilty at Northampton Crown Court and issued a statement in response. \"We apologise for and regret breaching [the regulations] and accept the judgement for the five sites in 2021. \"The procedures we had in place fell short and as a result, we have since invested significantly to improve these and have shared our learnings across the water industry.\" The DWI reported that the plastic-based coatings within the drinking water tanks had broken down into flakes and powder, which entered the water supply. Anglian Water appeared to dispute this, adding: \"Despite the breach, there was no evidence of any contamination of the water supply and the judge agreed based on independent expert reports that the risk to customers was very low.\" From April, price hikes at Anglian Water saw the average bill rise 19% from £527 to £626 a year, according to Water UK, representing an increase of £99."
    },
    {
        "title": "MPs criticise terminally ill Esther Rantzen's assisted dying intervention",
        "description": "Terminally ill journalist Dame Esther Rantzen was branded \"disrespectful\" and \"insulting\" by MPs during a debate on the assisted dying bill.",
        "url": "https://news.sky.com/story/mps-criticise-terminally-ill-esther-rantzens-assisted-dying-intervention-13369024",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-assisted-dying-ester-rantzen_6760889.jpg?20250516191329",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-16 14:02:00",
        "Headline": "The broadcaster urged all MPs to back the assisted dying bill and suggested some would never change their minds due to undeclared religious beliefs.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Terminally ill journalist Dame Esther Rantzen was branded \"disrespectful\" and \"insulting\" by MPs during a debate on the assisted dying bill. The broadcaster and Childline founder wrote to all MPs ahead of Friday's Commons' debate urging them to vote for what she called a \"crucial reform\". MPs were voting on amendments made to the bill - the report stage - following months of a committee going line by line through it after being introduced last year by Labour MP Kim Leadbeater.   The bill says people with six months to live who have the mental capacity can request medical assistance to legally end their life. Dame Esther, who has stage four lung cancer, suggested many MPs who opposed the bill have \"undeclared personal religious beliefs which mean no precautions would satisfy them\". However, in a highly charged Commons session, some MPs took umbrage with that. Labour MP Florence Eshalomi, who is a Christian and voted against the bill the first time, told the Commons: \"This is frankly insulting to disabled people, hard working professionals up and down the country, who have raised many valid concerns about this bill, to have it dismissed as religious beliefs.\" Jess Asato, a Labour MP who, as a child, cared for her grandmother with serious health problems, said Dame Esther \"accused those of us who have concerns about the bills as having undeclared religious beliefs\". \"Many colleagues found this distasteful and disrespectful,\" said the MP, who previously voted against the bill. Health Secretary Wes Streeting, who voted against the bill last year, backed Ms Asato's criticism as he retweeted her X post saying Dame Esther's comment about faith was \"particularly distasteful\". Ms Asato's Commons comment was met with agreement by many MPs who said: \"Hear, hear.\" Read more:What is in the assisted dying bill?Requirement for High Court judge scrapped 'Clumsy criticism' Conservative MP Dr Kieran Mullan said there had been some \"unhelpful remarks by high profile campaigners\", and while he is not religious he was \"concerned to see a clumsy criticism\" that those objecting to the bill are doing so because of their \"religious beliefs\". In a dig at Dame Esther's comments, Rebecca Paul, Tory MP for Reigate, said she is not against assisted dying \"in principle\" but is against the bill - and wanted to put on the record: \"I have no personal religious beliefs.\" The debate saw some MPs on the verge of tears as they described their own experiences of having debilitating conditions, or having family members in pain. MPs do not have to vote along party lines for the bill. How did MPs vote? An amendment tabled by Ms Leadbeater, which \"expands the protection\" for medical practitioners to clarify they have \"no obligation\" to be part of an assisted death was passed by MPs. It also provides legal protections for medical professionals to ensure they are not subject to any kind of punishment for refusing to carry out an assisted death. Another new clause to allow employers to impose a blanket ban on staff facilitating an assisted death was rejected. Since the bill was first introduced, there have been significant changes, including the replacement of a High Court judge to sign assisted dying off by a three-member expert panel - on top of two doctors having to approve. The time at which assisted dying would come into effect was doubled to four years from when it becomes law, if voted through. Medical colleges pull support Opponents have argued the bill does not have enough safeguards and is being rushed through. Three days before the debate, the Royal College of Psychiatrists pulled its support for the bill over the change that will mean a psychiatrist must be on the panel that decides if someone can die. The next day, the Royal College of Physicians (the largest college) adopted a similar position. However, supporters argue it is time to change the law, with Ms Leadbeater saying: \"If we do not vote to change the law, we are essentially saying that the status quo is acceptable.\""
    },
    {
        "title": "UK has not asked about asylum return hubs, other Balkan countries say",
        "description": "Two other Balkan countries seen as potential destinations for UK migrant returns say they have not been asked by the UK.",
        "url": "https://news.sky.com/story/uk-has-not-asked-about-asylum-return-hubs-other-balkan-countries-say-13369026",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-osmani_6918429.jpg?20250516152338",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-05-16 14:03:00",
        "Headline": "After Albania ruled out accepting rejected immigrants to the UK, the leaders of Kosovo and North Macedonia in the Western Balkans say they have not been approached about it - but would be open to discussions.",
        "Content": "\n          Political correspondent\n              @tamcohen\n Two other Balkan countries seen as potential destinations for UK migrant returns say they have not been asked by the UK. Sir Keir Starmer revealed on Thursday at a news conference with the Albanian Prime Minister Edi Rama that the UK \"is in talks with a number of countries about return hubs\". But the president of Kosovo and prime minister of North Macedonia - both in the western Balkans, a key migration route from Asia and Africa - told Sky News they had not been asked. Politics latest: Latest votes on assisted dying  Vjosa Osmani, the president of Kosovo, said: \"There's been no formal talks with the UK on this issue. It hasn't been raised so far. \"We would be open to discussing it, however I can't say more than that because I don't know the details. I cannot give an answer on a request that hasn't been made so far.\" Ms Osmani called the UK a \"steadfast ally\". UK-supplied technology is being used in Kosovo to stop illicit goods and vulnerable people from reaching British shores. The prime minister of North Macedonia, Hristijan Mickoski, said: \"I'm not informed about this. We should talk with the United Kingdom prime minister later today.\" Asked if formal talks had begun, he said: \"No, not yet.\"  Read more:Starmer 'discussing' hubs with othersWas Albanian snub an embarrassment? Close to 22,000 people used the Western Balkans to enter Europe last year, the Foreign Office said earlier this year. There are reports the UK is in talks with as many as nine countries. There are six countries in the Western Balkans, which are seen as central to UK efforts to tackling illegal migration. Croatia, Bosnia and Herzegovina, and Montenegro are the others, alongside Albania, Kosovo and North Macedonia. David Lammy, the foreign secretary, visited Kosovo last month and on the same trip, he signed an agreement with Serbia to crack down on smuggling gangs. Kosovo, one of Europe's poorest countries, has agreed a deal with Denmark to take 300 of its foreign prisoners to serve out their sentences before deportation - in return for 200 million euros. The deal, struck in 2021, is not up and running yet. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈  On Thursday, the Albanian prime minister publicly slapped down the idea of a UK returns hub in his country, saying their agreement with Italy was a \"one-off\" deal for Rome - their key ally. Mr Rama voiced his displeasure with how Albanians had been \"stigmatised\" in the UK. Chris Philp, the Conservative shadow home secretary, has accused the UK's prime minister of being \"panic mode\" over small boat crossings this year - and restated his stance that the Rwanda deportation scheme should be revived. Sir Keir later met Mr Mickoski for a one-to-one chat at the summit. Return hubs were not mentioned in the readout of their conversation. A Downing Street spokeswoman said the countries had \"signalled an intent to work more closely on shared challenges, including economic growth, trade, defence and security\". \"The leaders also discussed North Macedonia's recent agreement to join the Joint Migration Taskforce, further boosting regional cooperation to prevent irregular migrants transiting the Balkans and disrupting the criminal gangs that facilitate them.\""
    },
    {
        "title": "Ukrainian man in court over fires at properties and car linked to Starmer",
        "description": "A Ukrainian national has been remanded in custody following fires at two properties and a car linked to Prime Minister Sir Keir Starmer.",
        "url": "https://news.sky.com/story/ukrainian-man-roman-lavrynovych-remanded-in-custody-over-fires-at-properties-and-car-linked-to-sir-keir-starmer-13368876",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-fire-starmer_6915167.jpg?20250513131932",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-16 10:07:00",
        "Headline": "Roman Lavrynovych, who has been charged with three counts of arson with intent to endanger life, appeared at Westminster Magistrates' Court on Friday.",
        "Content": "A Ukrainian national has been remanded in custody following fires at two properties and a car linked to Prime Minister Sir Keir Starmer. Roman Lavrynovych appeared at Westminster Magistrates' Court after being charged with three counts of arson with intent to endanger life. The 21-year-old lives in the southeast London suburb of Sydenham. Officers from the Metropolitan Police's Counter Terrorism Command led the investigation because of the connections to the prime minister. Emergency services were called to a fire in the early hours of Monday at a house in Kentish Town, north London, where Sir Keir lived with his family before the election. Damage was caused to the property's entrance, but nobody was hurt. A car was also set alight in the same street last Thursday. There was another blaze at the front door of a house converted into flats in Islington, also linked to the prime minister, on Sunday. One person was taken to safety via an internal staircase by crews wearing breathing apparatus. The head of the Crown Prosecution Service counter terrorism division, Bethan David, said: \"The Crown Prosecution Service reminds all concerned that criminal proceedings against this defendant are now active and that he has the right to a fair trial.\""
    },
    {
        "title": "Kemi Badenoch rules out 'any coalitions' with Reform at 'national level'",
        "description": "Conservative leader Kemi Badenoch has told Sky News that the party will not form \"any coalitions\" with Reform UK \"at national level\".",
        "url": "https://news.sky.com/story/kemi-badenoch-rules-out-any-coalitions-with-reform-at-national-level-13368956",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kemi-badenoch-conservative_6918330.jpg?20250516140532",
        "type": "Politics",
        "Author": "Tomos Evans",
        "Date Published": "2025-05-16 12:18:00",
        "Headline": "The Conservatives' Senedd leader Darren Millar said he would be willing to work with other parties to form a government.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n  Conservative leader Kemi Badenoch has told Sky News that the party will not form \"any coalitions\" with Reform UK \"at national level\". But the party's leader in the Senedd, Darren Millar, said he would be open to working with other parties if it meant seeing the Conservatives in government in Wales. Speaking after she gave a speech at the Welsh Conservatives' annual conference in Llangollen, North Wales, Ms Badenoch said talk of coalitions were a \"distraction\". \"I have always said that at national level we are not forming any coalitions or forming any deals or pacts with Reform,\" she added. \"Talk of coalitions is politicians talking about how they're going to win and sort things out for themselves, not for people out there.\" She told around 250 party faithful that Wales was where the party's \"fight back begins\" after last July's general election defeat, but that the recent local election results in England showed the party was \"not yet out of the woods\". A recent Senedd poll put the party fourth behind Plaid Cymru, Reform UK and Labour. \n                  Top Tory caught admitting Brexit drawback in leaked clip\n                 \n                  The choice facing Labour in face of real Reform UK threat - and it could define Starmer's government\n                 \n                  Kemi Badenoch 'confident' she will lead Tories into next election - despite local results\n                 But Mr Millar, the Conservatives' leader in the Senedd, said the poll \"motivates\" him to \"work harder\". \"Let me tell you something, a bad opinion poll does not discourage me,\" he added. \"We are determined to fix Wales, inspire people, put hope in their hearts, and give them optimism for the future.\" West of England and Wales correspondent Before her speech at the Conservative conference in North Wales, Kemi Badenoch paid a visit to the heritage railway in Llangollen.\n In the glorious sunshine, she stood high up in the driver's spot on the footplate of the steam locomotive. But the train was going nowhere. Political metaphors aside, there was no denial from the UK Conservative leader that the party has a fight on its hands in Wales. Her speech included criticism of Labour's plans for a tourism tax in Wales, the 20mph zones, and Senedd expansion which will see the number of politicians rise from 60 to 96. But there was a Freudian slip. She referred to meeting MSPs, (Members of the Scottish Parliament) rather than MSs, members of the Senedd. Does that demonstrate where her and the party's mind is when it comes to Wales? \"No it doesn’t. What really matters is I'm here, again, because I'm demonstrating our commitment to Wales,\" she said. As she wrapped up, there was of course a standing ovation - but hardly an electric atmosphere. Speaking to Sky News after his speech, Mr Millar said it had been \"a difficult period for the Conservative Party across the United Kingdom\". While he said he was \"aiming to be the leader of the largest party\" in Wales, he acknowledged the new, more proportional voting system would likely mean that \"no one party will have an overall majority\". \"What I've said is, very straightforwardly, that it's in the national interest to get rid of the Labour Party in government in Wales,\" he said. \"It's in the national interest to secure some change and I am prepared to work with others in order to deliver an alternative government.\" He said the voting system in the Senedd was \"very different\" to that of the UK parliament and in order for any party to be in government in Wales, they would have to \"cooperate with other political parties\"."
    },
    {
        "title": "Baby gets world's first personalised gene therapy treatment",
        "description": "A baby born with a rare genetic disease is \"growing and thriving\" after getting bespoke gene therapy.",
        "url": "https://news.sky.com/story/baby-gets-worlds-first-personalised-gene-therapy-treatment-13369006",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kj-gene-therapy_6918376.jpg?20250516144127",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-16 13:26:00",
        "Headline": "Nine-and-a-half-month-old KJ Muldoon has a rare metabolic condition that meant he spent the first months of his life in hospital on a very restrictive diet.",
        "Content": "A baby born with a rare genetic disease is \"growing and thriving\" after getting bespoke gene therapy. It's the first time anyone in the world has been given an experimental gene-editing treatment designed specifically for their disease and took scientists just seven months to develop. Nine-and-a-half-month-old KJ Muldoon, from Clifton Heights, Pennsylvania, has a rare metabolic condition - known as severe carbamoyl phosphate synthetase 1 (CPS1) deficiency - that meant he has spent the first months of his life in a US hospital on a very restrictive diet. In February, however, the boy received the first dose of his bespoke treatment and then follow-up doses in March and April. \"We prayed, we talked to people, we gathered information, and we eventually decided that this was the way we were going to go,\" said KJ's father Kyle Muldoon. KJ has been able to eat more normally and has recovered well from illnesses like colds, which can strain the body and exacerbate his symptoms. He also now takes fewer medications. \n                  Two more maternity services in the UK issued with warnings this week\n                 \n                  'I felt I couldn't keep my baby safe': Warning of heat impact on pregnant women and newborns\n                 \n                  Weight-loss jabs for obese kids 'are effective and help prevent mealtime rows'\n                 Some experts estimate severe CPS1 deficiency affects one in a million babies. Those infants lack an enzyme needed to help remove ammonia from the body, so it can build up in their blood and become toxic. \"We're still very much in the early stages of understanding what this medication may have done for KJ,\" said study author Dr Rebecca Ahrens-Nicklas, a gene therapy expert at the Children's Hospital of Philadelphia (CHOP). \"But every day, he's showing us signs that he's growing and thriving.\" Read more from climate, science and technology:Why do the moon's two sides look so different?AIs can make collective decisions and influence each otherWarning of heat impact on pregnant women and newborns Considering how poorly KJ had been, \"any time we see even the smallest milestone that he's meeting - like a little wave or rolling over - that's a big moment for us\", said his mother Nicole Muldoon. The team behind KJ's treatment, made up of experts from CHOP and the University of Pennsylvania, published the results of their work in the New England Journal of Medicine. Gene therapy Gene therapy is an innovative treatment that aims to cure disease at the source, by editing the DNA causing the problem. The scientists working on KJ's case used CRISPR, the gene editing tool that won its inventors the Nobel Prize in 2020. In KJ's case, the team found the disease-causing mutation in his genes and created the treatment to flip a \"letter\" in his genetic code to the correct type. \"This is the first step towards the use of gene editing therapies to treat a wide variety of rare genetic disorders for which there are currently no definitive medical treatments,\" said Dr Kiran Musunuru, a University of Pennsylvania gene-editing expert who co-authored the study. The scientists hope that by publishing the results of their treatment quickly, it'll help others to test out similar bespoke treatments. \"Once someone comes with a breakthrough like this, it will take no time\" for other teams to apply the lessons and move forward, said Carlos Moraes, a neurology professor at the University of Miami, who wasn't involved in the study. \"There are barriers, but I predict that they are going to be crossed in the next five to 10 years. Then the whole field will move as a block because we're pretty much ready.\""
    },
    {
        "title": "TikTok's new initiative to stop teenagers' late-night doomscrolling",
        "description": "TikTok will now show teenagers guided meditation sessions if they're scrolling past 10pm.&#160;",
        "url": "https://news.sky.com/story/tiktok-brings-in-new-initiative-for-teenagers-scrolling-at-night-13368882",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-tiktok-meditation_6918126.png?20250516113715",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-05-16 10:30:00",
        "Headline": "The company also announced an initiative to give advertising space to mental health charities on the app.",
        "Content": "\n          Science and Technology reporter\n       TikTok will now show teenagers guided meditation sessions if they're scrolling past 10pm.  It is part of the company's attempt to mitigate some of the mental health problems associated with social media, as Big Tech faces increasing pressure to prioritise young people. Now, if a teenager uses TikTok after 10pm, their feed will be interrupted by a meditation exercise aimed at promoting better sleep. If they choose to ignore that prompt, TikTok will later show a second, full-screen prompt that is harder to dismiss. It will also be available to adults using the short video app, but will be switched on by default for under-18s. When testing the feature, 98% of teenagers kept the meditation experience switched on, according to TikTok. The company also announced an initiative to give advertising space to mental health charities on the app. There are growing calls for companies like TikTok to better protect their young users.  In the UK, companies will be fined or even banned from July if they don't take measures to stop harmful content appearing on young people's social media feeds. Read more from climate, science and technology:Why do the moon's two sides look so different?AIs can make collective decisions and influence each otherWarning of heat impact on pregnant women and newborns Under Ofcom's new rules, they will also have to make it easier for young people to report content or complain and sites that show pornography or self-harm content will have to properly verify their users' ages. In Australia, under-16s are going to be banned from using social media from December. \"We want our kids to have a childhood and parents to know we have their backs,\" said Prime Minister Anthony Albanese after the ban was approved by lawmakers. Meta and Snapchat also introduced new measures to protect young people online in recent months, with Meta introducing restricted Teen accounts and Snapchat making it harder for young people to be contacted by adults on their app."
    },
    {
        "title": "Cassie Ventura finishes her evidence after days describing alleged rape and 'hundreds' of freak offs",
        "description": "R&B star Cassie Ventura told Sean \"Diddy\" Combs \"I'm not a rag doll, I'm someone's child\", after he allegedly beat her outside a lift at the Intercontinental Hotel in Los Angeles in March 2016, a New York court has heard.",
        "url": "https://news.sky.com/story/cassie-ventura-finishes-her-evidence-after-days-describing-alleged-rape-and-hundreds-of-freak-offs-13369317",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cassie-diddy_6918508.jpg?20250516164535",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-05-16 23:07:00",
        "Headline": "During the fifth day of the Sean \"Diddy\" Combs sex-trafficking trial in Manhattan, New York, the court heard details of an alleged rape in 2018, a surprise $10m settlement with the Intercontinental Hotel and \"an attack with a skillet of eggs\".",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n R&B star Cassie Ventura told Sean \"Diddy\" Combs \"I'm not a rag doll, I'm someone's child\", after he allegedly beat her outside a lift at the Intercontinental Hotel in Los Angeles in March 2016, a New York court has heard. Footage of Combs appearing to drag and kick the R&B star in a corridor was initially released by CNN in May 2024. Combs subsequently apologised for his actions.  The footage of the incident, which Cassie says took place after she left a \"freak off\" sex session, has since been widely shared and has been shown to the jury in court as evidence for the prosecution. Combs, 55, faces five criminal counts: one count of racketeering conspiracy; two counts of sex trafficking by force, fraud or coercion; and two counts of transportation to engage in prostitution. He denies the allegations against him. Cassie, whose full name is Casandra Ventura, alleges she was physically abused and degraded for years by the powerful hip-hop star and music executive, accusing him of violence, coercion, blackmail and rape. The 38-year-old, who is the star witness for the prosecution, faced a fourth day on the stand, with the hip-hop mogul's defence lawyers concluding their two-day cross-examination. Heavily pregnant, she is expecting her third child in just a few weeks. \n                  Diddy trial: What we have learned from Cassie's testimony\n                 \n                  Cassie challenged over Diddy 'freak off' allegations - as explicit messages read in court\n                 \n                  Cassie breaks down in tears during Sean 'Diddy' Combs trial as she tells of 'personal shame' and alleged rape\n                 Prosecutors say Combs exploited and used his network of employees to facilitate illegal activities, while defence lawyers have been attempting to show jurors she consented to their highly charged \"swingers lifestyle\". The court also heard further details of Cassie's allegation of rape against Combs, information around her stay at a trauma and addiction centre in Arizona and further messages appearing to show her enthusiasm for freak offs. Sean 'Diddy' Combs trial: Day 5 - As it happened Cassie was asked about singer Chris Brown - who she denied dancing with - and tells the court Combs had form for taking her belongings, including her phone, car and watch, when he was angry with her. An audio recording was also played to the court, appearing to show Cassie threatening a man she claimed to have a video of her at a freak off on his phone, screaming: \"I will f*** you up and it won't be my hand\". It was not clear as to whether such a video ever existed. Cassie was also asked about her use of drugs, and said she had struggled with opioid addiction since 2022. She described a 45-day stay at a rehabilitation centre in Arizona in 2023, where she underwent EMDR (Eye Movement Desensitisation and Reprocessing) to help resolve trauma. The centre specialises in treating \"sex and intimacy issues\", but Cassie confirmed she was treated only for trauma. The court also heard about Cassie's allegation of rape against Combs in August or September 2018, by which time she says they had split up. The pair were together, on and off, for about 11 years from 2007 to 2018. 'I have love for the past, what it was' Describing Combs taking her for dinner at an Italian restaurant in Malibu, she says he raped her after driving her home, after \"acting strangely\" during the meal. When asked if she believed his behaviour was due to his \"bipolar disorder\", Cassie answered \"yes\". The jury was then shown a text message which included a heart emoji, sent by Cassie to Combs the following day. When asked if she still had love for him, she said: \"I have love for the past, what it was.\" Cassie confirmed she saw Combs the following month, when she said she had consensual sex with him, during which her now-husband, personal trainer Alex Fine, attempted to FaceTime her. She said she didn't tell Fine she had been raped by Combs at the time, but that he \"punched a wall\" when she later told him. Combs paid close attention to Cassie's cross-examination, leaning in to read transcripts on the monitor in front of him and passing down notes to his lawyer. Cassie did not look at him throughout the trial. A '$10m' settlement with the Intercontinental Towards the end of her questioning by the defence, Cassie was read a message from Combs in September 2012, in which he asked \"do you want to have our last FO [freak off] tonight?\" - to which she responded, \"I don't want to freak off for the last time, I want it to be the first time for the rest of our lives\". In a surprise turn, Cassie also confirmed that an expected settlement of $10m had been agreed with the Intercontinental Hotel in Los Angeles, where she was assaulted. Following her time in court, she released a statement saying she hoped her testimony would help others \"heal from the abuse and fear\". \"For me, the more I heal, the more I can remember,\" she said. \"And the more I can remember, the more I will never forget.\" The next witness, special agent Yasin Binda, detailed items found during a search of Combs's Park Hyatt hotel room in 2004, following his arrest that year. She showed the court images of exhibits including lubricant and baby oil, drugs and a bum bag containing $9,000 (£6,800) in cash. 'Hit over the head with a skillet of eggs' At the end of the day, Dawn Richard, a former member of girl group Danity Kane and trio Dirty Money, gave evidence, telling the court she observed Combs attacking Cassie, including a time he \"hit her over the head with a skillet of eggs\". She went on to say Combs \"dragged\" Cassie upstairs where she \"heard glass breaking\", adding she had \"never seen anything\" like it before - \"he was punching his girlfriend\". Richard said she didn't intervene or report the incident to the police as she was \"scared\". The singer sued Combs last year, accusing him of physical abuse, groping and psychological abuse during her time working with him. Combs has been jailed since September and faces at least 15 years or possibly life in prison if convicted. The trial is set to last for seven more weeks."
    },
    {
        "title": "Salman Rushdie attacker who left author blind in one eye jailed",
        "description": "A man convicted of stabbing Salman Rushdie, leaving the author blind in one eye, has been jailed for 25 years.",
        "url": "https://news.sky.com/story/hadi-matar-man-who-stabbed-salman-rushdie-leaving-author-blind-in-one-eye-is-jailed-13368863",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-salman-rushdie-author_6825727.jpg?20250221215754",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-16 14:40:00",
        "Headline": "During the trial, Sir Salman revealed he feared he was dying when the masked attacker plunged a knife into his head and body more than a dozen times.",
        "Content": "A man convicted of stabbing Salman Rushdie, leaving the author blind in one eye, has been jailed for 25 years. Hadi Matar was found guilty of attempted murder and assault in February. Prosecutors had been seeking the maximum sentence of 25 years for the attack in August 2022, along with an additional seven-year term for injuring a second man. During the trial, Sir Salman revealed he feared he was dying when the masked attacker plunged a knife into his head and body more than a dozen times. The attack happened as the 77-year-old was introduced on stage at the Chautauqua Institution in New York for a discussion on writer safety. Sir Salman was stabbed in the head, neck, torso and left hand and suffered damage to his liver and intestines.  The Midnight's Children author spent 17 days at a hospital in Pennsylvania and more than three weeks at a rehabilitation facility in New York City, as he recovered from his injuries. He wrote about the attack and his recovery in his 2024 memoir Knife. Matar will next face a trial on terrorism-related charges. Prosecutors allege the 27-year-old was trying to carry out a decades-old fatwa calling for the author's death. In 1989, Iran's then leader, Ayatollah Ruhollah Khomeini, issued the fatwa in response to the publication of Sir Salman's novel The Satanic Verses, which some Muslims consider blasphemous, causing the Indian born British-American author to go into hiding. In 1998, Iran announced it would not enforce the decree, allowing Sir Salman to travel freely over the last quarter of a century. Read more from Sky News:Army unit charged with investigating sex crimes allowing abusers to 'get away with it'At least 93 killed in Gaza after Israeli strikesMPs criticise Esther Rantzen's assisted dying intervention Matar pleaded not guilty to providing materials to terrorists, attempting to provide material support to Hezbollah and engaging in terrorism transcending national boundaries."
    },
    {
        "title": "R&B singer Chris Brown denied bail over allegation of causing GBH with intent",
        "description": "Chris Brown has been remanded in custody until 13 June by a judge in Manchester.",
        "url": "https://news.sky.com/story/rb-singer-chris-brown-denied-bail-over-allegation-of-causing-gbh-with-intent-13368812",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-chris-brown_6917859.jpg?20250516000703",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-16 08:23:00",
        "Headline": "The 36-year-old has been remanded in custody until 13 June, meaning he will likely miss some of the dates on his upcoming global tour.",
        "Content": " Chris Brown has been remanded in custody until 13 June by a judge in Manchester. The R&B singer is facing an allegation of causing grievous bodily harm with intent, and has been charged. He is accused of attacking music producer Abraham Diaw with a bottle at the Tape nightclub in central London. The incident allegedly took place back in February 2023. During a hearing at Manchester Magistrates' Court, prosecutor Hannah Nicholls said Brown had committed \"an unprovoked attack with a weapon in a nightclub full of people\". She told the court that Brown had struck Mr Diaw with the bottle several times. He then allegedly chased the victim and proceeded to punch and kick him in an attack caught on CCTV. Brown arrived at the dock flanked by court officials. His hair was bleached blond, and he wore sweatpants and a black T-shirt. \n                  Police name firefighters and business owner killed at former RAF base in Bicester\n                 \n                  Prison governor jailed over relationship with drug boss known as Jesse Pinkman\n                 \n                  Police watchdog to investigate mother's claim she was unlawfully strip-searched by Greater Manchester Police\n                 He spoke to confirm his name and date of birth, but did not enter a plea. District Judge Joanne Hirst said the alleged offence was \"too serious\" to be dealt with in her court, and sent the case to London's Southwark Crown Court. Brown will next appear for a plea and trial preparation hearing in the capital on 13 June after a bail application was denied. The 36-year-old was arrested at a hotel in Manchester in the early hours of Thursday by detectives from the Metropolitan Police. Brown's global tour is due to begin in The Netherlands on 8 June, and he is also scheduled to perform at Manchester's Co-op Live Arena on 15 June. Prior to the court hearing, CPS London North's deputy chief crown prosecutor Adele Kelly said: \"The Crown Prosecution Service reminds all concerned that criminal proceedings against this defendant are active and that he has the right to a fair trial. \"It is extremely important that there should be no reporting, commentary or sharing of information online which could in any way prejudice these proceedings.\" Brown's representatives have been contacted for comment."
    },
    {
        "title": "Diddy trial: What we have learned from Cassie's testimony",
        "description": "Singer Cassie is the key witness in the prosecution's case against Sean \"Diddy\" Combs.",
        "url": "https://news.sky.com/story/diddy-trial-what-we-have-learned-from-cassies-testimony-13368767",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cassie-p-diddy-trial_6915575.jpg?20250516080439",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-16 06:30:00",
        "Headline": "Casandra Ventura, known in the music industry as Cassie, has given lengthy testimony this week on her on-off relationship with music mogul Sean \"Diddy\" Combs.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Singer Cassie is the key witness in the prosecution's case against Sean \"Diddy\" Combs. The pair were in an on-off relationship for about 11 years, from 2007 to 2018, after she signed to his label, Bad Boy Records. She has alleged she was physically, sexually and mentally abused by Combs for most of this time, accusing him of forcing her into \"hundreds\" of drug-fuelled sex sessions with male escorts, known as \"freak offs\", while he watched. But his lawyers argue the singer, whose full name is Casandra Ventura, was a willing participant who consented to a \"swingers lifestyle\". Sean 'Diddy' Combs trial: Week 1 - Everything that's happened so far Combs, 55, is charged with sex-trafficking, racketeering conspiracy and transportation to engage in prostitution. He has pleaded not guilty to all charges and denied any allegations of sexual abuse. The trial in Manhattan, New York, is expected to last about eight weeks, with evidence from more women who will remain anonymous to come. It is not yet known whether Combs himself will take the stand. Ms Ventura, 38, has consented to being named and her testimony - including allegations about an alleged attack at a hotel in 2016, where Combs was filmed on CCTV seemingly beating and dragging her as she attempted to leave a freak off - is central to the case. Here is what we have learned from her testimony. 'Freak offs became like a job' During her first day of evidence, Ms Ventura told the trial that after signing what was a huge 10-album deal with Combs's Bad Boy Records, she only ever released her first, called Cassie, in 2006. Instead, she said, freak offs with escorts became so frequent - and required recovery time - that they were like a job. She was 22 when, during the first year of their relationship, she said the hip-hop mogul first proposed the idea. Her \"stomach churned\", she said, and she was \"confused, nervous, but also loved him very much\". To jurors, she gave graphic details of these drug and drink-fuelled encounters with male escorts, saying Combs would watch and masturbate, and often record the encounters and watch the videos back. They could last for hours or even days, she said - the longest allegedly for four days. She says she would get no sleep during these encounters, so used drugs to keep herself awake, but also disassociated. \"Freak offs became a job where there was no space to do anything else but to recover and just try to feel normal again,\" Ms Ventura said. Each time, she added, she had to recuperate from lack of sleep, alcohol, drugs \"and other substances\", and \"having sex with a stranger for days\". Combs 'used violence and blackmail' Ms Ventura told jurors Combs was violent to her over the course of their relationship, giving her black eyes and bruises, kicking her and dragging her. The hip-hop star became increasingly controlling, she said, and was allegedly abusive over the smallest perceived slights. \"You make the wrong face, and the next thing I knew I was getting hit in the face,\" she told the court. When asked how frequently Combs became violent with her, Ms Ventura responded: \"Too frequently.\" She said she began feeling as if she could not say no to Combs's demands because \"there were blackmail materials to make me feel like if I didn't do it, it would be held over my head in that way or these things would become public\". Ms Ventura described several alleged violent incidents, including one when she allegedly suffered a \"pretty significant gash\" above her left eye after the rapper threw her into a bed frame. Rather than go to hospital for stitches, his security staff took her to a plastic surgeon in Beverly Hills, she said. Jurors shown explicit images During the second day of Ms Ventura's testimony, the courtroom fell silent as images from freak offs were shown to jurors. These were kept private from the public gallery so that only those who needed to see them could do so. Combs asked Marc Agnifilo, one of his lawyers, to see a binder of the images, and thumbed through it for a few moments before handing it back. The pictures included images of Ms Ventura with escorts. Alleged rape after relationship ended Ms Ventura told the court that Combs raped her at her home in Los Angeles, after she told him she was ending things. \"I just remember crying and saying no, but it was very fast,\" she said, her voice trailing off. She told jurors she did have consensual sex with the rapper on a subsequent occasion. \"We'd been together for over 10 years. You just don't turn feelings off,\" she said. Throughout her testimony she described a complex relationship with a man she loved and was desperate to please, but was also scared of. She has maintained she never wanted to have sex with strangers, but wanted to please him. Why is Cassie testifying? Telling the courtroom, and therefore the world, about her experiences, over four days of questioning, was humiliating and difficult - prosecutor Emily Johnson asked why she put herself through it. Ms Ventura had remained fairly calm and composed throughout her time on the stand, with a few emotional moments, but at this point she broke down as she described her \"personal shame\" to jurors. \"I can't carry this anymore,\" she told the court. \"I can't carry the shame, the guilt, the way he treated people like they were disposable. What's right is right, what's wrong is wrong. I came here to do the right thing.\" Early in 2023, she said she started suffering from \"flashbacks\" and had suicidal thoughts, so went to rehab and trauma therapy. Ms Ventura sued Combs in November 2023, and settled within 24 hours. She received £20m, the trial was told. Combs 'threatened Cassie and Kid Cudi' Ms Ventura's second day of testimony also included details of how she briefly dated Scott Mescudi, better known as singer and rapper Kid Cudi, during a low point in her relationship with Combs in 2011. Combs lunged at her with a corkscrew and kicked her in the back when he found out, jurors heard, and threatened to blow up Mescudi's car. These allegations were also detailed in her lawsuit, which alleged his car did \"explode in his driveway\" around this time. The hotel CCTV 'attack' CCTV from the InterContinental Hotel in Century City, Los Angeles, filmed on 5 March 2016, was first released by CNN in May 2024 - six months after Ms Ventura filed her lawsuit and four months before Combs was charged with the crimes he is now on trial for. It showed Combs, wearing just socks and a towel around his waist, allegedly beating and dragging Ms Ventura in a hallway.  She told the court this happened after she tried to leave a freak off after being hit by Combs during the session. She had the premiere coming up for her first film, The Perfect Match, the court heard. Despite the incident, the pair were pictured at the event together. Messages paint a complex picture Under cross-examination from the defence, sexually explicit messages between Ms Ventura and Combs were read in court. Some showed her expressing apparent enthusiasm about the freak off sex sessions she alleges she was forced into. \"I'm always ready to freak off,\" the court heard Ms Ventura wrote in one message in August 2009. In another, she told Combs about a freak off: \"Can't wait.\" And in another, jurors were told she described a video of one sex session with an escort as \"dope\". Messages from 4 March 2016, the day before the InterContinental Hotel incident, were also read in court. One said: \"Baby I want to FO so bad but I dont want to f*** myself up.\" Ms Ventura told the court this was damage limitation and that she wanted to keep him happy due to her upcoming film premiere. Read more:The rise and fall of Sean CombsDiddy - a timeline of allegationsEverything you need to know about the trial Jurors also heard details of an email she sent in 2009, in which she expressed conflicting feelings about taking part in these sex sessions with escorts. In the email, she told Combs she needed to trust him \"beyond it just being sexual\" - that in order to be more open sexually, \"I need to feel safe, like home\". She told him \"the last time was a mistake but since has made me feel a little dirty, and grimy as opposed to sexual and spontaneous\". This was the reason she was going \"back and forth in my mind with wanting and not wanting to do it\", she wrote. \"I get nervous that I'm just becoming the girlfriend that you get your fantasies off with.\" Diddy 'overdosed at Playboy Mansion' Drug use came up a lot during Ms Ventura's testimony, and she admitted to using drugs including ketamine, ecstasy, MDMA and opiates, saying she needed them in order to get through the freak offs. She also claimed Combs used drugs and said she believes he was addicted to opiates when they were together. Ms Ventura told the court he was taken to hospital after overdosing on opiates at the Playboy Mansion in 2012 - something which was reported by media outlets including TMZ at the time, when it was said he had suffered a migraine. The trial continues."
    },
    {
        "title": "Laurence Fox denies encouraging people to damage ULEZ cameras",
        "description": "Laurence Fox has denied encouraging others to damage ultra low emission zone (ULEZ) cameras in London.",
        "url": "https://news.sky.com/story/laurence-fox-denies-encouraging-people-to-damage-ulez-cameras-13368901",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-laurence-fox-london_6918283.jpg?20250516133445",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-16 10:52:00",
        "Headline": "The actor and political activist appears at Westminster Magistrates' Court accused of posting messages on X \"which were capable of encouraging the commission of an either-way offence\".",
        "Content": "Laurence Fox has denied encouraging others to damage ultra low emission zone (ULEZ) cameras in London. The actor and political activist appeared at Westminster Magistrates' Court on Friday accused of posting messages on X \"which were capable of encouraging the commission of an either-way offence\". In the posts, which were shared between 12 September and 4 October 2023, Fox allegedly voiced support for so-called ULEZ \"Blade Runners\", who repeatedly tore down cameras. Transport for London (TfL) recorded 700 incidents of damage to cameras with a cost of more than £920,000 in this period, according to prosecutors. The cameras, which allow TfL to monitor cars entering and exiting the ULEZ area, have repeatedly been vandalised after the zone was expanded to cover all of London at the end of August 2023. Cars that do not meet the ultra low emission standards need to pay a £12.50 daily fee to be driven in the zone, or face a fine. Footage shared online shows the \"Blade Runners\" using angle grinders and other tools to cut the cameras' wires or completely remove the devices. Fox, 46, pleaded not guilty to a charge of intentionally encouraging or assisting the commission of an either-way offence. Read more from Sky News:Two firefighters and one other person die in blazeMan who killed mother at Notting Hill Carnival jailed If found guilty, the charge carries up to 10 years in prison. The former GB News presenter was granted unconditional bail and is due to attend Croydon Crown Court on 13 June."
    },
    {
        "title": "MPs criticise terminally ill Esther Rantzen's assisted dying intervention",
        "description": "Terminally ill journalist Dame Esther Rantzen was branded \"disrespectful\" and \"insulting\" by MPs during a debate on the assisted dying bill.",
        "url": "https://news.sky.com/story/mps-criticise-terminally-ill-esther-rantzens-assisted-dying-intervention-13369024",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-assisted-dying-ester-rantzen_6760889.jpg?20250516191329",
        "type": "Entertainment",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-16 14:02:00",
        "Headline": "The broadcaster urged all MPs to back the assisted dying bill and suggested some would never change their minds due to undeclared religious beliefs.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Terminally ill journalist Dame Esther Rantzen was branded \"disrespectful\" and \"insulting\" by MPs during a debate on the assisted dying bill. The broadcaster and Childline founder wrote to all MPs ahead of Friday's Commons' debate urging them to vote for what she called a \"crucial reform\". MPs were voting on amendments made to the bill - the report stage - following months of a committee going line by line through it after being introduced last year by Labour MP Kim Leadbeater.   The bill says people with six months to live who have the mental capacity can request medical assistance to legally end their life. Dame Esther, who has stage four lung cancer, suggested many MPs who opposed the bill have \"undeclared personal religious beliefs which mean no precautions would satisfy them\". However, in a highly charged Commons session, some MPs took umbrage with that. Labour MP Florence Eshalomi, who is a Christian and voted against the bill the first time, told the Commons: \"This is frankly insulting to disabled people, hard working professionals up and down the country, who have raised many valid concerns about this bill, to have it dismissed as religious beliefs.\" Jess Asato, a Labour MP who, as a child, cared for her grandmother with serious health problems, said Dame Esther \"accused those of us who have concerns about the bills as having undeclared religious beliefs\". \"Many colleagues found this distasteful and disrespectful,\" said the MP, who previously voted against the bill. Health Secretary Wes Streeting, who voted against the bill last year, backed Ms Asato's criticism as he retweeted her X post saying Dame Esther's comment about faith was \"particularly distasteful\". Ms Asato's Commons comment was met with agreement by many MPs who said: \"Hear, hear.\" Read more:What is in the assisted dying bill?Requirement for High Court judge scrapped 'Clumsy criticism' Conservative MP Dr Kieran Mullan said there had been some \"unhelpful remarks by high profile campaigners\", and while he is not religious he was \"concerned to see a clumsy criticism\" that those objecting to the bill are doing so because of their \"religious beliefs\". In a dig at Dame Esther's comments, Rebecca Paul, Tory MP for Reigate, said she is not against assisted dying \"in principle\" but is against the bill - and wanted to put on the record: \"I have no personal religious beliefs.\" The debate saw some MPs on the verge of tears as they described their own experiences of having debilitating conditions, or having family members in pain. MPs do not have to vote along party lines for the bill. How did MPs vote? An amendment tabled by Ms Leadbeater, which \"expands the protection\" for medical practitioners to clarify they have \"no obligation\" to be part of an assisted death was passed by MPs. It also provides legal protections for medical professionals to ensure they are not subject to any kind of punishment for refusing to carry out an assisted death. Another new clause to allow employers to impose a blanket ban on staff facilitating an assisted death was rejected. Since the bill was first introduced, there have been significant changes, including the replacement of a High Court judge to sign assisted dying off by a three-member expert panel - on top of two doctors having to approve. The time at which assisted dying would come into effect was doubled to four years from when it becomes law, if voted through. Medical colleges pull support Opponents have argued the bill does not have enough safeguards and is being rushed through. Three days before the debate, the Royal College of Psychiatrists pulled its support for the bill over the change that will mean a psychiatrist must be on the panel that decides if someone can die. The next day, the Royal College of Physicians (the largest college) adopted a similar position. However, supporters argue it is time to change the law, with Ms Leadbeater saying: \"If we do not vote to change the law, we are essentially saying that the status quo is acceptable.\""
    }
]