[
    {
        "title": "Pope in critical condition after respiratory crisis, Vatican says in latest update",
        "description": "Pope Francis is in a critical condition after a \"prolonged respiratory crisis\" that required a high-flow of oxygen and is \"suffering more than yesterday\", the Vatican has said. ",
        "url": "https://news.sky.com/story/vatican-gives-update-on-pope-francis-as-he-remains-in-hospital-13314420",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pope-francis-at-vatican_6837397.jpg?20250223021435",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-22 07:28:00",
        "Headline": "The 88-year-old is being treated for double pneumonia and chronic bronchitis and has now spent more than a week in hospital. ",
        "Content": "Pope Francis is in a critical condition after a \"prolonged respiratory crisis\" that required a high-flow of oxygen and is \"suffering more than yesterday\", the Vatican has said.  The 88-year-old has been in hospital for more than a week being treated for double pneumonia  and chronic bronchitis. In an update on Saturday evening, the Vatican said \"the Holy Father's condition continues to be critical\", adding that this morning he \"presented with a prolonged asthmatic respiratory crisis\" which required the application of high-flow oxygen. He also had blood transfusions after tests revealed thrombocytopenia, which is associated with anemia.  \"The Holy Father continues to be vigilant and spent the day in an armchair even though he was suffering more than yesterday. At the moment the prognosis is reserved,\" the Vatican's statement said. In an update earlier on Saturday morning - the shortest since Francis was admitted to hospital on 14 February - the Vatican said he will not lead Sunday prayers for the second week running, adding: \"The Pope rested well.\" Francis is likely to prepare a written homily for someone else to read at Sunday's Angelus. \n                  Pope Francis not at risk of death, but he's 'not out of danger' - doctors treating him give update\n                 \n                  The Pope marks a week in hospital - as cardinal suggests he could resign in case of 'serious difficulties'\n                 \n                  Pope Francis 'improving slightly and working from hospital' amid talk of him quitting\n                 Millions of people around the world have been concerned about the Pope's increasingly frail health - and his condition has given rise to speculation over a possible resignation, which the Vatican has not commented on. Doctors on Friday said he was \"not out of danger\" and was expected to remain at Rome's Gemelli hospital for at least another week. Sergio Alfieri, the chief of the pontiff's medical team, said: \"Is he out of danger? No. But if the question is 'is he in danger of death', the answer is 'no'.\" He said Francis was affected by seasonal flu before being taken to hospital and that, \"due to his challenging duties\", he had suffered fatigue. He is also fighting a multipronged infection of bacteria and viruses in the respiratory tract. Read more from Sky News:Trump says US close to Ukraine minerals dealBody of Israeli hostage Shiri Bibas returned The doctors warned that while he did not have sepsis - where germs enter the bloodstream - there was always a risk the infection could spread in his body, and they said that was the biggest concern. Sepsis is a complication of an infection that can lead to organ failure and death. Pope Francis has a history of respiratory illness, having lost part of one of his lungs to pleurisy as a young man. He had an acute case of pneumonia in 2023."
    },
    {
        "title": "Israel postpones release of more than 600 Palestinian prisoners after 'humiliating hostage ceremonies'",
        "description": "The release of more than 600 Palestinian prisoners planned for Saturday has been postponed \"until the release of the next hostages is secured without humiliating ceremonies\", Israel has said.",
        "url": "https://news.sky.com/story/what-we-know-about-the-israeli-hostages-and-palestinian-prisoners-being-released-13314557",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-omer-shem-tov-eliya-cohen_6837377.jpg?20250223001914",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-22 12:54:00",
        "Headline": "Hundreds of Palestinian prisoners had been due to be released on Saturday - but this has been delayed by Israel which has criticised \"humiliating ceremonies\" during the handover of hostages.",
        "Content": "The release of more than 600 Palestinian prisoners planned for Saturday has been postponed \"until the release of the next hostages is secured without humiliating ceremonies\", Israel has said. In a statement early on Sunday, Prime Minister Benjamin Netanyahu's office accused the Palestinian militant group Hamas of \"repeated violations\" as it lashed out at \"disgraceful ceremonies\" during the handover of Israeli captives in Gaza. The Israeli PM's office said: \"In light of the repeated and ongoing violations by Hamas - including the disgraceful ceremonies that dishonour the dignity of our abductees and the cynical use of captives for propaganda purposes - it has been decided to postpone the release of the terrorists that was planned for yesterday until the release of the next group of abductees is secured, and without the humiliating ceremonies.\" The statement came as vehicles apparently carrying prisoners left the open gates of Ofer prison in the occupied West Bank, only to turn around and go back in. The release of 620 Palestinian prisoners had been delayed for several hours and was meant to happen after six Israeli hostages were released on Saturday. Five of the six captives were escorted by masked, armed militants in front of crowds - displays that the United Nations and others have criticised as cruel after previous handovers. The final hostage was released to the Red Cross in private. The Gaza ceasefire deal continues to hold, despite tensions rising earlier in the week when Hamas initially handed over the body of an unidentified Palestinian woman instead of Israeli mother-of-two Shiri Bibas. The hostage-prisoner exchange earmarked for Saturday was supposed to be the last for the first phase of the ceasefire. Israel had been expected to free hundreds of Palestinian prisoners on Saturday, including a man who has been detained for more than 40 years, and many more given life sentences. However, as night fell across the region, they remained behind bars, with Hamas claiming their release had been delayed because some of them had been \"assaulted\". An Israeli spokesperson has denied the assaults and said the Red Cross were present at the prison. Follow latest: Delay to prisoner release due to 'assaults' - Hamas Who are the freed Israeli hostages? The first two hostages released on Saturday were Tal Shoham and Avera Mengistu. Mr Shoham, 40, was visiting his wife's family in Kibbutz Be'eri when Hamas militants stormed into the community during the October 7 attacks in 2023. His wife, two young children and three other relatives were also abducted, but they were freed in an exchange in November 2023. Mr Mengistu, a 39-year-old Ethiopian-Israeli, had been held in Gaza since he entered the territory on his own in 2014. Watching the moment he was freed on TV, his family broke out in song as he walked free for the first time in more than a decade. Later on Saturday, Eliya Cohen, Omer Shem Tov and Omer Wenkert were handed over to the Red Cross in Nuseirat, central Gaza. Mr Shem Tov, 22, was taken during the October 7 attacks on the Nova music festival. The computer programmer had shared his live location with his family, who eventually noticed he was headed towards Gaza and contact with him was lost.  Mr Cohen, 27, was also taken from the Nova festival, alongside his fiancee. Released hostages have said that he was kept in chains and deprived of food and sunlight during his time in captivity, according to reports. Mr Wenkert, 23, was taken from Nova. He suffers from colitis and requires special medical care, it has been reported. Finally, Hisham al Sayed, 28, was handed over in a private ceremony. The Bedouin-Israeli, from the village of Hura in the Negev desert, has been a captive since he crossed into Gaza in 2015. Who were the Palestinian prisoners due to be released? More than 600 Palestinian prisoners had been set to be released on Saturday. According to the prisons office, which is run by Hamas, they included 50 who had been sentenced to life imprisonment, 60 described as having \"high\" sentences, 47 prisoners from the \"Wafa al Ahrar\" 2011 prisoner exchange deal who had since been re-arrested, and 445 who were arrested after 7 October attacks. The \"Wafa al-Ahrar\" deal was the 2011 prisoner exchange agreement that saw the release of captured Israeli soldier Gilad Shalit in exchange for 1027 Palestinian prisoners. Read more:Body of Shiri Bibas returned, family confirmsFragile Gaza ceasefire stumbles from one hurdle to next Among the most high-profile Palestinians who had been set to be released was Nael Barghouti - the longest-serving prisoner, who has been inside for 43 years. Also on the list were several journalists, many of whom covered events at al Shifa hospital, and Yousef al Mansi, a Palestinian minister in Gaza. It had been expected that Dr Hussam Abu Safiya, the director of Kamal Adwan Hospital in Gaza, would be among those being released on Saturday. However it later emerged that he was not on the list of those set to be freed."
    },
    {
        "title": "M4 and M48 closed after human remains found",
        "description": "Two motorways have been shut after human remains were found on the road.&#160;",
        "url": "https://news.sky.com/story/two-motorways-closed-after-human-remains-found-13315303",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-m4-m48-road-closures_6837293.png?20250222215553",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-22 21:40:00",
        "Headline": "Parts of the M4 and M48 motorways near Bristol are set to remain closed until the early hours of Sunday morning after a body was found on the road.",
        "Content": "Two motorways have been shut after human remains were found on the road.  Several drivers reported a body on the carriageway between junctions 20 and 21 of the M4 - between Almondsbury and Awkley - at about 6.40pm this evening. The body is believed to be that of a man in his forties, whose next of kin have been told. A police investigation to establish how the person came to be on the motorway continues. Parts of the M4 and M48 motorways near Bristol are likely to remain closed until the early hours of Sunday morning, Avon and Somerset Police said. In a statement, the force said: \"Police are keen to hear from anyone who was travelling along that stretch of the M4 has any relevant information or dashcam footage.\" The road closures were likely to cause significant delays in and out of Wales tonight, with closures starting on the English side of the Prince of Wales Bridge and the Severn Bridge. \n                  Teenager arrested over suspected 'chilli spray' attack at Bristol Costco\n                 \n                  Police appeal after Burton Albion footballer suffers alleged racist abuse during game\n                 \n                  'Idiot' teen driver sentenced after Bristol car crash left boy, 4, seriously injured\n                 Read more on Sky News:Police hunt van driver after girl, 3, dies in Manchester tram collisionPope in critical condition after respiratory crisis, Vatican says in latest update National Highways said the M4 is shut in both directions between junctions 20 and 21, while the M48 eastbound is closed from junction 1 near Aust. The links from the M5 junction 15 south to the M4 junction 20 west, and the M5 junction 16 north to M4 junction 20 west were also closed."
    },
    {
        "title": "Police hunt van driver after girl, 3, dies in Manchester tram collision",
        "description": "Police are searching for a van driver who fled the scene of a Manchester city centre collision in which a three-year-old girl was killed.",
        "url": "https://news.sky.com/story/girl-3-dies-after-tram-and-van-crash-in-manchester-13314410",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-manchester-death_6836593.jpg?20250222151830",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-22 06:09:00",
        "Headline": "The girl was taken to hospital but died from her injuries. Greater Manchester Police said no arrests have been made. ",
        "Content": " Police are searching for a van driver who fled the scene of a Manchester city centre collision in which a three-year-old girl was killed. The girl, a pedestrian, died after a collision between a tram and a van at about 10am on Saturday morning. The tram forced the van onto the footpath on Mosley Street, where it hit the girl. She was taken to hospital but died from her injuries, Greater Manchester Police (GMP) said. Police said they are following several lines of enquiry to locate the van driver. The force has appealed for witnesses, and said no arrests had been made so far. Assistant chief constable Stephanie Parker said: \"Firstly, I would like to send my condolences to the family of the victim. This is a tragic incident where a young girl has sadly lost her life despite the responding officer's best attempts to save her. \n                  M4 and M48 closed after human remains found\n                 \n                  Don't expect a Love Actually-style moment from the Starmer-Trump meeting\n                 \n                  Jenny Hall: Don't join in search for missing runner, 23, police tell public - as drones deployed\n                 \"Our investigation is ongoing and we are investigating a number of lines of enquiry. This is being treated as an isolated incident with no wider threat to the community. \"I thank the public for their patience with the disruption this incident has caused in the city centre and our officers will remain on patrol into the evening. If you have any concerns please speak to our officers and raise them as they are here to help and assist.\" Read more from Sky News:Drones deployed to look for missing runner'Worst hack in history' as $1.5bn in crypto stolen She added: \"We understand the effect an incident such as this will have had on any witnesses and our thoughts are with everyone concerned.\" A North West Ambulance Service spokesperson said two ambulances, a rapid response vehicle and two air ambulance crews attended the scene. Transport for Greater Manchester said there was continued disruption across the Metrolink after the incident and advised people to check the Bee Network website and app for the latest travel information. Manchester's Bee Network said: \"Due to a road traffic collision on Mosley Street in the city centre, no tram services are operating between St Peter's Square and Piccadilly Gardens.\""
    },
    {
        "title": "Pay back the billions of aid, Trump tells Ukraine",
        "description": "Donald Trump has said a deal for Ukraine's rare earth metals is \"pretty close\" and the US is targeting \"anything we can get\" in exchange for the aid it's provided.",
        "url": "https://news.sky.com/story/pay-back-the-billions-of-aid-trump-tells-ukraine-13315319",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-cpac_6837181.jpg?20250222194955",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-22 22:10:00",
        "Headline": "Despite US optimism, a Ukrainian source says there are \"a number of problematic issues\" as the draft deal only contains \"unilateral commitments\".",
        "Content": " Donald Trump has said a deal for Ukraine's rare earth metals is \"pretty close\" and the US is targeting \"anything we can get\" in exchange for the aid it's provided. Mr Trump told a conference he was determined to get payback for billions of dollars of military hardware and other assistance. However, a source has told Sky News that President Zelenskyy is not ready to accept the agreement that's been drafted. \"I want them to give us something for all the money we put up,\" Mr Trump told the CPAC conference. \"So we're asking for rare earth and oil - anything we can get!\" He claimed European countries had given their aid as a loan but the US had not - meaning they were due some compensation. \"We're going to get our money back because it's not fair,\" Mr Trump told the event in Maryland. \"And we will see, but I think we're pretty close to a deal. We better be close to a deal\". \n                  Think business, not politics: Trump's approach to peacemaking\n                 \n                  Don't expect a Love Actually-style moment from the Starmer-Trump meeting\n                 \n                  Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing\n                 Mr Trump claimed the US had given $350bn in aid, but some international bodies - such as Kiel's Institute for the World Economy - estimate it's around $120bn. Rare earth metals are elements used in high-tech goods such as mobile phones and electric vehicles. Demand is increasing but there are concerns over future availability. Mr Trump's national security adviser, Mike Waltz, told the same conference on Friday that he also believed a deal would be struck.  Despite US optimism, a Ukrainian source said an agreement was not yet close due to \"a number of problematic issues\". They said drafts did not \"reflect a partnership in the agreement and contain only unilateral commitments by Ukraine\". Kyiv is likely to be pressing for robust security guarantees from America in any future peace deal with Russia. Mr Trump's speech on Saturday evening spanned many subjects, taking numerous digs at opponents such as Joe Biden and heralding what he said were numerous achievements since he regained the White House.  He also shouted out visitors in the audience such as Reform leader Nigel Farage, calling him a \"great guy\", and Argentinian President Javier Milei - who spoke to the conference in Spanish on Saturday. Italian premier Giorgia Meloni, seen as a key Trump ally in Europe, also delivered a video message defending the political direction of the continent. \"I know you can perceive Europe as distant and lost, but I can tell you it's not,\" said Ms Meloni - who also reaffirmed support for Ukraine, saying it was resisting \"a brutal aggression\" from Russia. Donald Trump the president is still Donald Trump the businessman. For the president of the United States, everything is transactional, even the business of ending the war in Ukraine. Under the agreement, he wants Ukraine to grant America access to its mineral and oil resources as payback for wartime aid. This deal-making approach aligns with his broader foreign policy perspective, emphasising economic gains. Read the rest of David's analysis President Trump repeated his optimism that a deal to end the war is possible under his watch, saying he was \"dealing\" with both the Ukrainian and Russian leaders. \"I've spoken to President Putin and I think that thing [the war] is going to end,\" he told the conference. Ukraine has insisted it won't accept any deal agreed without its participation, after it was excluded from this week's meeting between top US and Russian diplomats in Saudi Arabia. Read more:Envoy says US is 'with' Ukraine - in contrast to Trump's remarksSombre Starmer and Europe confront emerging new world order Tensions have been rising in recent days between President Trump and President Zelenskyy. The US leader referred to Mr Zelesnkyy as a \"dictator\", apparently in response to the Ukrainian president saying Mr Trump was living in a Russian \"disinformation space\". Sir Keir Starmer again lent his unwavering backing to Ukraine's leader in a phone call on Saturday. Downing Street said the prime minister \"reiterated his ironclad support\" and \"commitment to securing a just and enduring peace to bring an end to Russia's illegal war\". It comes days before Sir Keir and French President Emmanuel Macron head to Washington for tricky talks in which they must press Ukraine's case while keeping the US leader onside. President Trump told a radio show on Friday that the two European leaders \"haven't done anything\" to end the war."
    },
    {
        "title": "One dead and police officers seriously injured in 'terror' stabbing in Mulhouse",
        "description": "One person has been killed and two police officers seriously injured in a knife attack in eastern France.",
        "url": "https://news.sky.com/story/one-dead-and-several-police-officers-injured-in-france-knife-attack-13314844",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-macron-emmanuel_6837057.jpg?20250222184845",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-22 16:23:00",
        "Headline": "The knifeman had reportedly been under house arrest and was on a terror watchlist.",
        "Content": "One person has been killed and two police officers seriously injured in a knife attack in eastern France. A man attacked people in Mulhouse, near the German border, at around 4pm on Saturday. Prosecutors said a 37-year-old Algerian had been arrested and the person who died was a civilian who tried to intervene. \"Horror has just gripped our city,\" mayor Michele Lutz said on Facebook. The man shouted \"Allahu Akbar\" (\"God is greatest\") as he attacked the police officers, prosecutors added. President Macron told BFMTV it was \"beyond doubt\" it was an \"Islamist terrorist act\". He said the interior minister was heading to Mulhouse and would speak later. The attacker is said to have been at a police station - where he was due to sign a document for his detention - but refused and ran into the market where he launched the attack. \n                  Mohamed Amra: 'The Fly' recaptured in Romania nine months after escape that killed two French prison officers\n                 \n                  Thieves buy winning €500,000 lottery ticket with stolen credit card\n                 \n                  British skier, 23, found dead in French Alps\n                 One police officer was stabbed in the neck and another in the chest, according to French media. Three other police sustained very minor injuries. Read more from Sky News:Pope 'suffering more' and in 'critical condition'Trump fires top US military officers The knifeman had reportedly been under house arrest and was on a terror watchlist. The French attack comes a day after a stabbing by a 19-year-old Syrian refugee at Berlin's Holocaust memorial. A Spanish tourist was badly injured but is expected to survive. The attacker is said to have wanted to kill Jewish people after being motivated by the conflict in the Middle East, according to prosecutors."
    },
    {
        "title": "Thieves buy winning €500,000 lottery ticket with stolen credit card",
        "description": "A man whose credit card was stolen and used to buy a winning lottery ticket is appealing for the thieves to come forward - so they can split the cash.&#160;",
        "url": "https://news.sky.com/story/thieves-buy-winning-8364500000-lottery-ticket-with-stolen-credit-card-13314742",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-scratchcard-lottery_6836662.jpg?20250222155746",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-22 15:11:00",
        "Headline": "The victim of the theft is appealing for the thieves to come forward - so they can split the cash.",
        "Content": "A man whose credit card was stolen and used to buy a winning lottery ticket is appealing for the thieves to come forward - so they can split the cash.  The thieves bought a winning €500,000 (£414,000) scratchcard with the stolen card in the French city of Toulouse. But the ticket has not been submitted to claim the prize. The victim of the theft, identified in police documents as Jean-David E, had his backpack containing his bank card stolen from his car earlier this month. He asked his bank to block it but learned his card had already been used in a local shop, where two apparently homeless men had used it to buy a winning scratch card. \"They were so totally happy that they forgot their cigarettes and their belongings and walked out like crazy people,\" Jean-David's lawyer Pierre Debuisson said. He said Jean-David has filed a police complaint about the theft, but is ready to withdraw it if the thieves come forward so that they can share the money. \"It's an incredible story, but it's all true,\" he added. The lawyer launched a national appeal on Thursday, asking the thieves to contact his office to make a deal. \"Without them, no one would have won,\" he told public broadcaster France-2. Read more from Sky News:'Worst hack in history': $1.5bn in crypto stolenTrump fires top military officers  La Francaise des Jeux (FDJ), the state lottery operator, said no one had yet submitted the ticket to claim the prize. Mr Debuisson said prosecutors may try to seize the winnings, considering them illegally obtained gains, and warned the ticket will eventually expire. \"Time is working against us,\" he said. \"You risk nothing... we will share with you,\" he said. \"And you would be able to change your lives.\""
    },
    {
        "title": "M4 and M48 closed after human remains found",
        "description": "Two motorways have been shut after human remains were found on the road.&#160;",
        "url": "https://news.sky.com/story/two-motorways-closed-after-human-remains-found-13315303",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-m4-m48-road-closures_6837293.png?20250222215553",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-22 21:40:00",
        "Headline": "Parts of the M4 and M48 motorways near Bristol are set to remain closed until the early hours of Sunday morning after a body was found on the road.",
        "Content": "Two motorways have been shut after human remains were found on the road.  Several drivers reported a body on the carriageway between junctions 20 and 21 of the M4 - between Almondsbury and Awkley - at about 6.40pm this evening. The body is believed to be that of a man in his forties, whose next of kin have been told. A police investigation to establish how the person came to be on the motorway continues. Parts of the M4 and M48 motorways near Bristol are likely to remain closed until the early hours of Sunday morning, Avon and Somerset Police said. In a statement, the force said: \"Police are keen to hear from anyone who was travelling along that stretch of the M4 has any relevant information or dashcam footage.\" The road closures were likely to cause significant delays in and out of Wales tonight, with closures starting on the English side of the Prince of Wales Bridge and the Severn Bridge. \n                  Teenager arrested over suspected 'chilli spray' attack at Bristol Costco\n                 \n                  Police appeal after Burton Albion footballer suffers alleged racist abuse during game\n                 \n                  'Idiot' teen driver sentenced after Bristol car crash left boy, 4, seriously injured\n                 Read more on Sky News:Police hunt van driver after girl, 3, dies in Manchester tram collisionPope in critical condition after respiratory crisis, Vatican says in latest update National Highways said the M4 is shut in both directions between junctions 20 and 21, while the M48 eastbound is closed from junction 1 near Aust. The links from the M5 junction 15 south to the M4 junction 20 west, and the M5 junction 16 north to M4 junction 20 west were also closed."
    },
    {
        "title": "Police hunt van driver after girl, 3, dies in Manchester tram collision",
        "description": "Police are searching for a van driver who fled the scene of a Manchester city centre collision in which a three-year-old girl was killed.",
        "url": "https://news.sky.com/story/girl-3-dies-after-tram-and-van-crash-in-manchester-13314410",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-manchester-death_6836593.jpg?20250222151830",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-22 06:09:00",
        "Headline": "The girl was taken to hospital but died from her injuries. Greater Manchester Police said no arrests have been made. ",
        "Content": " Police are searching for a van driver who fled the scene of a Manchester city centre collision in which a three-year-old girl was killed. The girl, a pedestrian, died after a collision between a tram and a van at about 10am on Saturday morning. The tram forced the van onto the footpath on Mosley Street, where it hit the girl. She was taken to hospital but died from her injuries, Greater Manchester Police (GMP) said. Police said they are following several lines of enquiry to locate the van driver. The force has appealed for witnesses, and said no arrests had been made so far. Assistant chief constable Stephanie Parker said: \"Firstly, I would like to send my condolences to the family of the victim. This is a tragic incident where a young girl has sadly lost her life despite the responding officer's best attempts to save her. \n                  M4 and M48 closed after human remains found\n                 \n                  Don't expect a Love Actually-style moment from the Starmer-Trump meeting\n                 \n                  Jenny Hall: Don't join in search for missing runner, 23, police tell public - as drones deployed\n                 \"Our investigation is ongoing and we are investigating a number of lines of enquiry. This is being treated as an isolated incident with no wider threat to the community. \"I thank the public for their patience with the disruption this incident has caused in the city centre and our officers will remain on patrol into the evening. If you have any concerns please speak to our officers and raise them as they are here to help and assist.\" Read more from Sky News:Drones deployed to look for missing runner'Worst hack in history' as $1.5bn in crypto stolen She added: \"We understand the effect an incident such as this will have had on any witnesses and our thoughts are with everyone concerned.\" A North West Ambulance Service spokesperson said two ambulances, a rapid response vehicle and two air ambulance crews attended the scene. Transport for Greater Manchester said there was continued disruption across the Metrolink after the incident and advised people to check the Bee Network website and app for the latest travel information. Manchester's Bee Network said: \"Due to a road traffic collision on Mosley Street in the city centre, no tram services are operating between St Peter's Square and Piccadilly Gardens.\""
    },
    {
        "title": "Thousands protest in London ahead of third anniversary of Ukraine war",
        "description": "As thousands of protestors arrived at the Russian embassy in west London this afternoon, a slow, mournful Ukrainian folk song drifted through the air.&#160;",
        "url": "https://news.sky.com/story/thousands-protest-in-london-ahead-of-third-anniversary-of-ukraine-war-13315244",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-russia-ukraine-london_6837231.jpg?20250222201840",
        "type": "UK",
        "Author": "Matthew Thompson",
        "Date Published": "2025-02-22 20:00:00",
        "Headline": "Several Labour politicians spoke at the rally, including Emily Thornberry, who said Britain needed to stand \"visibly and unwaveringly\" with Ukraine.",
        "Content": "\n          Sky News correspondent\n        As thousands of protestors arrived at the Russian embassy in west London this afternoon, a slow, mournful Ukrainian folk song drifted through the air.  The singers - dressed in traditional Ukrainian attire, blood-red ribbons tied around their heads - sang of loss, resilience, and a country still at war. Three years on from the full-scale Russian invasion of Ukraine, the crowd that gathered in London was not just there to mourn but to demand action. Blue and yellow flags snapped in the wind. Signs ranged from the solemn - \"never forget Bucha\" - to the provocative: \"We will rave on Putin's grave.\" Among the protestors were many Ukrainians who had fled Russian bombs. Vlad was just 17 years old when his city of Mariupol was besieged by Putin's forces in the early months of the war. \"I can never go back,\" he told me. \"I saw too much. Bodies in the streets. People burned alive in their homes.\" \n                  Think business, not politics: Trump's approach to peacemaking\n                 \n                  Don't expect a Love Actually-style moment from the Starmer-Trump meeting\n                 \n                  Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing\n                 Even now, he is still confident of a just resolution to the war: \"We have to continue to fight. To speak up for truth, defend our traditions and our culture.\" Others were less optimistic in the face of Donald Trump's very public courting of Vladimir Putin. One man with a sign depicting Trump as a puppet in Putin's hands, who didn't give his name, said: \"I feel like I watch the news every day and it just seems to go from bad to worse. I didn't think Trump would stoop so low. But the things he's said and the actions he's taken just go beyond belief.\" Read more:Starmer tells Zelenskyy this is 'significant moment' for European securityTrump says a key deal on Ukrainian minerals is close - Zelenskyy disagrees Several Labour politicians spoke at the rally, among them Emily Thornberry, chair of the foreign affairs select committee. She said Britain needed to stand \"visibly and unwaveringly\" with Ukraine, and sought common ground with the United States. \"We don't really know what Trump's terms are,\" she told Sky News. \"There's no detail. So we have to just step back and say we agree we should stop the war. It's just that we don't want to capitulate to Putin. What we need is a way of finishing this war which is fair.\" As the march wound its way through the streets of west London, chants of \"Slava Ukraini\" rang out. The crowd's mood was defiant and clear in their response to President Trump: there is only one aggressor, one dictator in this war, and he is in Moscow rather than Kyiv."
    },
    {
        "title": "New evidence shows how UK student protests about Gaza were handled by police and universities",
        "description": "Camping, chaos, and confrontation.",
        "url": "https://news.sky.com/story/new-evidence-shows-how-student-protests-about-gaza-were-handled-by-police-and-universities-13308451",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-palestine-protests_6827524.jpg?20250213120803",
        "type": "UK",
        "Author": "Serena Barker-Singh, news correspondent, and Joely Santa Cruz, data journalist",
        "Date Published": "2025-02-22 04:00:00",
        "Headline": "Sky News and Liberty Investigates look at how universities worked with police, and even private surveillance firms, to deal with pro-Palestinian protests on campuses across the UK - amid ongoing tensions between freedom of speech and student safety.",
        "Content": "By Serena Barker-Singh, news correspondent, and Joely Santa Cruz, data journalist   Camping, chaos, and confrontation. A wave of pro-Palestinian student protest engulfed UK universities last year when thousands protested against the war in Gaza. Most started out peacefully on encampments with students pitching tents on university greens. Now new evidence, uncovered by Sky News and Liberty Investigates, has shed some light on how some of those protests were policed. We've seen instances of universities reporting protesters to police, starting dozens of disciplinaries, and in some instances we found universities collaborating with private surveillance firms. What data tells us about handling of protests Through Freedom of Information requests to more than 150 UK universities by Liberty Investigates, shared with Sky News, we found that at least 40 universities discussed Gaza protest activity with police forces or private intelligence organisations. Thirty-six universities had direct communication with the police. Thirteen universities also discussed protests at meetings with police, including the University of London, Cambridge, and Manchester. Twenty-eight universities launched investigations against as many as 113 students, and staff were investigated for possible disciplinary breaches linked to their pro-Palestinian activism. More than 20 universities also disclosed emails with a professional body for campus security, and correspondence appears to show collaboration between campus security departments and police to monitor student protesters, some even using intelligence from private security firms. Though this is currently the clearest public picture of the scale of protest activity during that time, 47 universities did not provide the information requested. Most universities refused to specify the reasons and outcomes of the disciplinary investigations against students and staff, citing confidentiality issues. Antisemitism on campus The Community Security Trust, a charity that protects British Jews from terrorism and antisemitism, says it would be concerned if the number of student disciplinaries had not risen alongside the uptick of student protests and that otherwise, it would worry universities weren't responding properly to anti-Jewish hatred. Dave Rich, director of policy at the Community Security Trust, said it has seen a rise in the number of antisemitic incidents on student campuses since the 7 October Hamas terrorist attack on Israel in 2023. The Community Security Trust says these incidents have gone up fivefold compared to the previous academic year. David-Lior Banoun Rappaz, an undergraduate student at LSE, says: \"There have definitely been a lot of antisemitic incidents on campus. It's about being in the minority and having the other group being extremely loud about it.\" The rise in antisemitism has also concerned Dov Forman, author, activist and an undergraduate at a London university. \"University is a place where you should develop your opinions, where there should be freedom of speech, but that has to be within the confines of the law, and that can't be at the expense of Jewish students like myself, who at times feel like we're being dehumanised and even criticised on campus.\" Universities UK acts as the collective voice of 141 universities in the UK and insists it is always trying to balance the tension between freedom of speech and freedom of expression. The body also defends the right to police protests and says it is legitimate for universities to liaise with the police, adding that this happens only \"occasionally\" and where action is taken it has to be proportionate. Students feel unsafe after Newcastle incident For some pro-Palestinian student activists at Newcastle, one incident stands out to them, they say, for police using \"heavy-handed tactics\" to break up a protest. On 29 May last year, a rally that was described as non-violent by academics at the university quickly descended into chaos with officers intercepting protesters with batons. From footage obtained for our investigation from protesters who were there, more than 40 officers including dog handlers are seen attending a building being occupied by students. Dozens of officers were earlier seen pushing and struggling with crowds of agitated protesters outside the entrance, before drawing their batons as the police line collapsed and skirmishes broke out. Footage taken outside a different entrance to the university’s Armstrong building shows police carrying and dragging limp protesters out of a building by their limbs. You can make out one student collapsing - who we found out was later taken to hospital by paramedics after having a fit. One student, Ivy*, has photos of bruising on her arm - which she says were caused by being grabbed by an officer. She says \"it was really, really overwhelming\" and \"it took a long time to feel okay afterwards\". Another, Hana*, a medical student volunteering to provide first aid at the protest, shared a medical letter describing her knee injury after she was trampled by the crowd. She says \"as a visibly Muslim woman, being on campus at the time, even being in Newcastle, was just terrifying\". The student protesters we spoke to all said they no longer feel safe on campus. Since the summer, academics have been calling for the university's leadership to explain the handling of the incident. The university maintains there were \"legitimate concerns for public safety\" and explained that is why they contacted the police. Newcastle University said: \"Where protest activity goes beyond the bounds of lawful protest, we reserve the right to seek assistance from the police to ensure the safety of everyone in our community.  All complaints to the University regarding staff and students have been investigated in line with our relevant policies.\" In a statement, a Northumbria Police spokesperson said: \"Police attended the scene to engage with all parties involved, with the safety of everyone in attendance including the protesters, members of the public and officers paramount. \"While the activity mainly passed without incident, a number of protesters outside the building refused to comply with police instruction and seemed intent on gaining entry. The right to a lawful protest is a key part of any democracy, which the police uphold. However, we will not accept people using them as a means to commit crime.\" 'We have a right to speak out' Suffian, a Leeds University student who is head of the Palestinian Society, feels that free speech on this issue is being restricted. He was under a two-month investigation for \"engaging in unauthorised protests and being a member of the encampment\". The 21-year-old said he felt the university was using its disciplinary process to prevent students from taking part in protests. He says: \"There is no right way to protest… no protest should be authorised. \"We have a right as people to speak out about it. No child should be a child of war.\" As part of the disciplinary, he says he attended a meeting where he was shown footage of himself entering a building and leading chants. He was then issued a \"formal warning\". Since filming with him his investigation has concluded and the university says it will not be taking any further action. A spokesperson for the University of Leeds said: \"The right to lawful protest must be carefully balanced between the rights of protesters to assert their views on the one hand and the rights of others to go about their business safely, unimpeded, and free from intimidation and harassment. \"The university has a clearly communicated student code and guidance on protests. Where students engage in misconduct, as outlined in our regulations, they may become subject to disciplinary action.\" * Not their actual names"
    },
    {
        "title": "Low-paid jobs at risk from Labour's tax increases on businesses",
        "description": "Cliff Nicholls runs two trampoline parks and indoor play centres: one in Tamworth in the West Midlands, the other in Bolton, Greater Manchester. He's already feeling the pressure from the government's latest budget measures and has been forced to abandon further investment plans.",
        "url": "https://news.sky.com/story/low-paid-jobs-at-risk-from-labours-tax-increases-on-businesses-13304558",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-employer-nics-story_6831730.png?20250217154315",
        "type": "UK",
        "Author": "Saywah Mahmood",
        "Date Published": "2025-02-22 00:01:00",
        "Headline": "Labour says it will protect workers' incomes but budget changes coming in from April 2025 are putting pressure on employers. Sky News analysis finds early signs that low-paid workers are being affected.",
        "Content": "\n          Data journalist\n              @saywhatsaywah\n  Cliff Nicholls runs two trampoline parks and indoor play centres: one in Tamworth in the West Midlands, the other in Bolton, Greater Manchester. He's already feeling the pressure from the government's latest budget measures and has been forced to abandon further investment plans. \"The national minimum wage increases coming in April, combined with the reduced thresholds for national insurance and the increased rate of employers' national insurance, will have a very significant impact,\" Cliff said. To cut costs, he's already made drastic changes. \"We've had to take some fairly radical decisions, reducing our opening hours, making a senior staff member redundant because of rising business costs, including business rates and national insurance,\" he added. While policies like the National Living Wage (NLW) increase are designed to support low-paid workers, other changes could offset these benefits. One major shift is the reduction in the salary threshold at which businesses start paying employer's national insurance contributions (NICs). Currently, employers begin paying NICs when an employee earns more than £9,100 per year. From April 2025, this threshold will drop to £5,000. At the same time, the employer's NI rate will rise from 13.8% to 15%. Scroll through to see Cliff's staffing finances Under the new system, an employer will be paying nearly £800 more in NICs annually for an employee earning around £23,800 (based on a 37.5-hour week at the new NLW). The rise in NICs will be proportionally higher for employers of lower-paid workers. For example, they will pay around 7% for someone earning £9,000 a year and 3% for an employee on the NLW. But for someone earning £75,000 a year, employers will pay 2% more. Extended employment rights and business rates add pressure Labour also announced a series of employment rights reforms aimed at improving working conditions. These include extending statutory sick pay to lower-paid employees who were previously ineligible and making it available from the first day of illness for all workers. The changes would also enable employees to claim unpaid parental leave from their first day in a job, strengthen protections against unfair dismissal, and enhance rights for those on zero-hours contracts. The government estimates that these employment rights changes will cost businesses around £5bn. Nye Cominetti, principal economist at the Resolution Foundation, said: \"What concerns me is that employer national insurance increases, like the minimum wage and employment rights changes, disproportionately impact low-paid workers. \"For instance, extending statutory sick pay to those previously ineligible adds costs for employers already facing higher NICs and rising wages. In this context, it would have been more sensible to raise tax revenue in a way that didn't hit low-paid workers the hardest.\" But for Cliff, the changes to business rates relief are an even bigger challenge. Budget changes will mean business rates relief will drop from 75% to 45% for retail, leisure, and hospitality businesses, significantly increasing his costs. \"The business rates changes probably have a bigger impact on us than national insurance,\" he explained. \"One of our buildings used to be in a prime edge-of-town retail park 25 years ago. The rental value has dropped significantly since but business rates haven't kept pace. Next year, we'll be paying between £55,000 and £60,000 more just in business rates.\" Cliff is not alone in his concerns. Research conducted by the Federation of Small Businesses found that in the final three months of last year, confidence among small firms fell to its lowest level in a decade, excluding the pandemic. Are these changes impacting inflation? Higher prices for food, goods, and services will also put pressure on working people. New data from the Office for National Statistics shows that inflation rose to 3% in January 2025, the highest level in 10 months. Many businesses had warned this would happen, saying that rising national insurance costs and the increase in the NLW would leave them with no choice but to raise prices. The latest Quarterly Economic Survey by the British Chambers of Commerce, conducted after the budget, surveyed more than 4,800 businesses. It found that more than half expect to increase prices in the next three months, up from 39% in the third quarter of 2024. Businesses are making tough decisions  Signs of pressure are already emerging. Lord Wolfson, a Conservative peer and chief executive of Next, has warned that it will become harder for people to enter the workforce. In an interview with the BBC, he said that the rise in NICs for businesses would hit the retail sector particularly hard, with entry-level jobs most affected. He urged the government to phase in the tax changes rather than implement them in full in April, warning that otherwise, businesses would be forced to cut jobs or reduce working hours. While it is not possible to fully attribute this to budget announcements, early data suggests that the workforce has been shrinking across various industries since October 2024, with the biggest declines in sectors that employ large numbers of lower-paid workers, such as manufacturing, retail, and hospitality. Since the budget, the number of payrolled employees has fallen by more than 10,000 in manufacturing and nearly 9,000 in hospitality. Since the budget, voluntary liquidations have remained consistently high and from December 2024 to January 2025 voluntary business closures have gone up by 9%. While this can't be solely attributed to upcoming budget measures, it does highlight the challenges businesses are facing and the difficult decisions they are making as a result. Read more:Reeves faces pressure to raise taxes or cut public spendingChancellor in danger of squandering new year fightbackReeves responds to expenses allegations An HM Treasury spokesperson said: \"We delivered a once-in-a-parliament budget to wipe the slate clean and deliver the stability businesses need to invest and grow, while protecting working people's payslips from higher taxes, ensuring more than half of employers either see a cut or no change in their National Insurance bills, and delivering a record pay boost for millions of workers. \"Now we are going further and faster to kickstart economic growth and raise living standards, with a majority of business leaders confident that the chancellor's plans will help drive business investment. \"This includes backing businesses to create wealth across Britain by capping corporation tax, making full expensing permanent and permanently cutting business rates for retail, hospitality, and leisure businesses on the high street from next year.\" The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open-source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "British skier, 23, found dead in French Alps",
        "description": "A British skier has been found dead at the bottom of a cliff in the French Alps.",
        "url": "https://news.sky.com/story/british-skier-23-found-dead-in-french-alps-13314491",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-avoriaz-france-alps_6836352.jpg?20250222115446",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-22 11:38:00",
        "Headline": "Local media reports he may have fallen off a cliff the night before he was found.",
        "Content": "A British skier has been found dead at the bottom of a cliff in the French Alps. The body of the 23-year-old man has not yet been formally identified and the circumstances of his death are being investigated, authorities say. He was found on Monday near the Avoriaz ski resort near the town of Morzine, in the Portes du Soleil region. Local prosecutor Xavier Goux-Thiercelin confirmed the death on Friday. Police from two forces are looking into what happened. Read more from Sky News:Vatican gives update on Pope FrancisEverything you need to know about Germany's elections According to local newspaper Le Dauphine Libere, it is thought the man died after accidentally falling off the cliff the night before he was found. The Daily Mail reported that the man had been skiing with friends before attending a party and became lost when trying to ski down the mountain by himself. He was evacuated by helicopter but was pronounced dead, the newspaper reported. A spokesperson for the Foreign, Commonwealth and Development Office said: \"We are supporting the family of a British man who died in France and are in contact with the local authorities.\""
    },
    {
        "title": "Israel postpones release of more than 600 Palestinian prisoners after 'humiliating hostage ceremonies'",
        "description": "The release of more than 600 Palestinian prisoners planned for Saturday has been postponed \"until the release of the next hostages is secured without humiliating ceremonies\", Israel has said.",
        "url": "https://news.sky.com/story/what-we-know-about-the-israeli-hostages-and-palestinian-prisoners-being-released-13314557",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-omer-shem-tov-eliya-cohen_6837377.jpg?20250223001914",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-22 12:54:00",
        "Headline": "Hundreds of Palestinian prisoners had been due to be released on Saturday - but this has been delayed by Israel which has criticised \"humiliating ceremonies\" during the handover of hostages.",
        "Content": "The release of more than 600 Palestinian prisoners planned for Saturday has been postponed \"until the release of the next hostages is secured without humiliating ceremonies\", Israel has said. In a statement early on Sunday, Prime Minister Benjamin Netanyahu's office accused the Palestinian militant group Hamas of \"repeated violations\" as it lashed out at \"disgraceful ceremonies\" during the handover of Israeli captives in Gaza. The Israeli PM's office said: \"In light of the repeated and ongoing violations by Hamas - including the disgraceful ceremonies that dishonour the dignity of our abductees and the cynical use of captives for propaganda purposes - it has been decided to postpone the release of the terrorists that was planned for yesterday until the release of the next group of abductees is secured, and without the humiliating ceremonies.\" The statement came as vehicles apparently carrying prisoners left the open gates of Ofer prison in the occupied West Bank, only to turn around and go back in. The release of 620 Palestinian prisoners had been delayed for several hours and was meant to happen after six Israeli hostages were released on Saturday. Five of the six captives were escorted by masked, armed militants in front of crowds - displays that the United Nations and others have criticised as cruel after previous handovers. The final hostage was released to the Red Cross in private. The Gaza ceasefire deal continues to hold, despite tensions rising earlier in the week when Hamas initially handed over the body of an unidentified Palestinian woman instead of Israeli mother-of-two Shiri Bibas. The hostage-prisoner exchange earmarked for Saturday was supposed to be the last for the first phase of the ceasefire. Israel had been expected to free hundreds of Palestinian prisoners on Saturday, including a man who has been detained for more than 40 years, and many more given life sentences. However, as night fell across the region, they remained behind bars, with Hamas claiming their release had been delayed because some of them had been \"assaulted\". An Israeli spokesperson has denied the assaults and said the Red Cross were present at the prison. Follow latest: Delay to prisoner release due to 'assaults' - Hamas Who are the freed Israeli hostages? The first two hostages released on Saturday were Tal Shoham and Avera Mengistu. Mr Shoham, 40, was visiting his wife's family in Kibbutz Be'eri when Hamas militants stormed into the community during the October 7 attacks in 2023. His wife, two young children and three other relatives were also abducted, but they were freed in an exchange in November 2023. Mr Mengistu, a 39-year-old Ethiopian-Israeli, had been held in Gaza since he entered the territory on his own in 2014. Watching the moment he was freed on TV, his family broke out in song as he walked free for the first time in more than a decade. Later on Saturday, Eliya Cohen, Omer Shem Tov and Omer Wenkert were handed over to the Red Cross in Nuseirat, central Gaza. Mr Shem Tov, 22, was taken during the October 7 attacks on the Nova music festival. The computer programmer had shared his live location with his family, who eventually noticed he was headed towards Gaza and contact with him was lost.  Mr Cohen, 27, was also taken from the Nova festival, alongside his fiancee. Released hostages have said that he was kept in chains and deprived of food and sunlight during his time in captivity, according to reports. Mr Wenkert, 23, was taken from Nova. He suffers from colitis and requires special medical care, it has been reported. Finally, Hisham al Sayed, 28, was handed over in a private ceremony. The Bedouin-Israeli, from the village of Hura in the Negev desert, has been a captive since he crossed into Gaza in 2015. Who were the Palestinian prisoners due to be released? More than 600 Palestinian prisoners had been set to be released on Saturday. According to the prisons office, which is run by Hamas, they included 50 who had been sentenced to life imprisonment, 60 described as having \"high\" sentences, 47 prisoners from the \"Wafa al Ahrar\" 2011 prisoner exchange deal who had since been re-arrested, and 445 who were arrested after 7 October attacks. The \"Wafa al-Ahrar\" deal was the 2011 prisoner exchange agreement that saw the release of captured Israeli soldier Gilad Shalit in exchange for 1027 Palestinian prisoners. Read more:Body of Shiri Bibas returned, family confirmsFragile Gaza ceasefire stumbles from one hurdle to next Among the most high-profile Palestinians who had been set to be released was Nael Barghouti - the longest-serving prisoner, who has been inside for 43 years. Also on the list were several journalists, many of whom covered events at al Shifa hospital, and Yousef al Mansi, a Palestinian minister in Gaza. It had been expected that Dr Hussam Abu Safiya, the director of Kamal Adwan Hospital in Gaza, would be among those being released on Saturday. However it later emerged that he was not on the list of those set to be freed."
    },
    {
        "title": "Pope in critical condition after respiratory crisis, Vatican says in latest update",
        "description": "Pope Francis is in a critical condition after a \"prolonged respiratory crisis\" that required a high-flow of oxygen and is \"suffering more than yesterday\", the Vatican has said. ",
        "url": "https://news.sky.com/story/vatican-gives-update-on-pope-francis-as-he-remains-in-hospital-13314420",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pope-francis-at-vatican_6837397.jpg?20250223021435",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-22 07:28:00",
        "Headline": "The 88-year-old is being treated for double pneumonia and chronic bronchitis and has now spent more than a week in hospital. ",
        "Content": "Pope Francis is in a critical condition after a \"prolonged respiratory crisis\" that required a high-flow of oxygen and is \"suffering more than yesterday\", the Vatican has said.  The 88-year-old has been in hospital for more than a week being treated for double pneumonia  and chronic bronchitis. In an update on Saturday evening, the Vatican said \"the Holy Father's condition continues to be critical\", adding that this morning he \"presented with a prolonged asthmatic respiratory crisis\" which required the application of high-flow oxygen. He also had blood transfusions after tests revealed thrombocytopenia, which is associated with anemia.  \"The Holy Father continues to be vigilant and spent the day in an armchair even though he was suffering more than yesterday. At the moment the prognosis is reserved,\" the Vatican's statement said. In an update earlier on Saturday morning - the shortest since Francis was admitted to hospital on 14 February - the Vatican said he will not lead Sunday prayers for the second week running, adding: \"The Pope rested well.\" Francis is likely to prepare a written homily for someone else to read at Sunday's Angelus. \n                  Pope Francis not at risk of death, but he's 'not out of danger' - doctors treating him give update\n                 \n                  The Pope marks a week in hospital - as cardinal suggests he could resign in case of 'serious difficulties'\n                 \n                  Pope Francis 'improving slightly and working from hospital' amid talk of him quitting\n                 Millions of people around the world have been concerned about the Pope's increasingly frail health - and his condition has given rise to speculation over a possible resignation, which the Vatican has not commented on. Doctors on Friday said he was \"not out of danger\" and was expected to remain at Rome's Gemelli hospital for at least another week. Sergio Alfieri, the chief of the pontiff's medical team, said: \"Is he out of danger? No. But if the question is 'is he in danger of death', the answer is 'no'.\" He said Francis was affected by seasonal flu before being taken to hospital and that, \"due to his challenging duties\", he had suffered fatigue. He is also fighting a multipronged infection of bacteria and viruses in the respiratory tract. Read more from Sky News:Trump says US close to Ukraine minerals dealBody of Israeli hostage Shiri Bibas returned The doctors warned that while he did not have sepsis - where germs enter the bloodstream - there was always a risk the infection could spread in his body, and they said that was the biggest concern. Sepsis is a complication of an infection that can lead to organ failure and death. Pope Francis has a history of respiratory illness, having lost part of one of his lungs to pleurisy as a young man. He had an acute case of pneumonia in 2023."
    },
    {
        "title": "Pay back the billions of aid, Trump tells Ukraine",
        "description": "Donald Trump has said a deal for Ukraine's rare earth metals is \"pretty close\" and the US is targeting \"anything we can get\" in exchange for the aid it's provided.",
        "url": "https://news.sky.com/story/pay-back-the-billions-of-aid-trump-tells-ukraine-13315319",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-cpac_6837181.jpg?20250222194955",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-22 22:10:00",
        "Headline": "Despite US optimism, a Ukrainian source says there are \"a number of problematic issues\" as the draft deal only contains \"unilateral commitments\".",
        "Content": " Donald Trump has said a deal for Ukraine's rare earth metals is \"pretty close\" and the US is targeting \"anything we can get\" in exchange for the aid it's provided. Mr Trump told a conference he was determined to get payback for billions of dollars of military hardware and other assistance. However, a source has told Sky News that President Zelenskyy is not ready to accept the agreement that's been drafted. \"I want them to give us something for all the money we put up,\" Mr Trump told the CPAC conference. \"So we're asking for rare earth and oil - anything we can get!\" He claimed European countries had given their aid as a loan but the US had not - meaning they were due some compensation. \"We're going to get our money back because it's not fair,\" Mr Trump told the event in Maryland. \"And we will see, but I think we're pretty close to a deal. We better be close to a deal\". \n                  Think business, not politics: Trump's approach to peacemaking\n                 \n                  Don't expect a Love Actually-style moment from the Starmer-Trump meeting\n                 \n                  Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing\n                 Mr Trump claimed the US had given $350bn in aid, but some international bodies - such as Kiel's Institute for the World Economy - estimate it's around $120bn. Rare earth metals are elements used in high-tech goods such as mobile phones and electric vehicles. Demand is increasing but there are concerns over future availability. Mr Trump's national security adviser, Mike Waltz, told the same conference on Friday that he also believed a deal would be struck.  Despite US optimism, a Ukrainian source said an agreement was not yet close due to \"a number of problematic issues\". They said drafts did not \"reflect a partnership in the agreement and contain only unilateral commitments by Ukraine\". Kyiv is likely to be pressing for robust security guarantees from America in any future peace deal with Russia. Mr Trump's speech on Saturday evening spanned many subjects, taking numerous digs at opponents such as Joe Biden and heralding what he said were numerous achievements since he regained the White House.  He also shouted out visitors in the audience such as Reform leader Nigel Farage, calling him a \"great guy\", and Argentinian President Javier Milei - who spoke to the conference in Spanish on Saturday. Italian premier Giorgia Meloni, seen as a key Trump ally in Europe, also delivered a video message defending the political direction of the continent. \"I know you can perceive Europe as distant and lost, but I can tell you it's not,\" said Ms Meloni - who also reaffirmed support for Ukraine, saying it was resisting \"a brutal aggression\" from Russia. Donald Trump the president is still Donald Trump the businessman. For the president of the United States, everything is transactional, even the business of ending the war in Ukraine. Under the agreement, he wants Ukraine to grant America access to its mineral and oil resources as payback for wartime aid. This deal-making approach aligns with his broader foreign policy perspective, emphasising economic gains. Read the rest of David's analysis President Trump repeated his optimism that a deal to end the war is possible under his watch, saying he was \"dealing\" with both the Ukrainian and Russian leaders. \"I've spoken to President Putin and I think that thing [the war] is going to end,\" he told the conference. Ukraine has insisted it won't accept any deal agreed without its participation, after it was excluded from this week's meeting between top US and Russian diplomats in Saudi Arabia. Read more:Envoy says US is 'with' Ukraine - in contrast to Trump's remarksSombre Starmer and Europe confront emerging new world order Tensions have been rising in recent days between President Trump and President Zelenskyy. The US leader referred to Mr Zelesnkyy as a \"dictator\", apparently in response to the Ukrainian president saying Mr Trump was living in a Russian \"disinformation space\". Sir Keir Starmer again lent his unwavering backing to Ukraine's leader in a phone call on Saturday. Downing Street said the prime minister \"reiterated his ironclad support\" and \"commitment to securing a just and enduring peace to bring an end to Russia's illegal war\". It comes days before Sir Keir and French President Emmanuel Macron head to Washington for tricky talks in which they must press Ukraine's case while keeping the US leader onside. President Trump told a radio show on Friday that the two European leaders \"haven't done anything\" to end the war."
    },
    {
        "title": "One dead and police officers seriously injured in 'terror' stabbing in Mulhouse",
        "description": "One person has been killed and two police officers seriously injured in a knife attack in eastern France.",
        "url": "https://news.sky.com/story/one-dead-and-several-police-officers-injured-in-france-knife-attack-13314844",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-macron-emmanuel_6837057.jpg?20250222184845",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-22 16:23:00",
        "Headline": "The knifeman had reportedly been under house arrest and was on a terror watchlist.",
        "Content": "One person has been killed and two police officers seriously injured in a knife attack in eastern France. A man attacked people in Mulhouse, near the German border, at around 4pm on Saturday. Prosecutors said a 37-year-old Algerian had been arrested and the person who died was a civilian who tried to intervene. \"Horror has just gripped our city,\" mayor Michele Lutz said on Facebook. The man shouted \"Allahu Akbar\" (\"God is greatest\") as he attacked the police officers, prosecutors added. President Macron told BFMTV it was \"beyond doubt\" it was an \"Islamist terrorist act\". He said the interior minister was heading to Mulhouse and would speak later. The attacker is said to have been at a police station - where he was due to sign a document for his detention - but refused and ran into the market where he launched the attack. \n                  Mohamed Amra: 'The Fly' recaptured in Romania nine months after escape that killed two French prison officers\n                 \n                  Thieves buy winning €500,000 lottery ticket with stolen credit card\n                 \n                  British skier, 23, found dead in French Alps\n                 One police officer was stabbed in the neck and another in the chest, according to French media. Three other police sustained very minor injuries. Read more from Sky News:Pope 'suffering more' and in 'critical condition'Trump fires top US military officers The knifeman had reportedly been under house arrest and was on a terror watchlist. The French attack comes a day after a stabbing by a 19-year-old Syrian refugee at Berlin's Holocaust memorial. A Spanish tourist was badly injured but is expected to survive. The attacker is said to have wanted to kill Jewish people after being motivated by the conflict in the Middle East, according to prosecutors."
    },
    {
        "title": "Starmer tells Zelenskyy this is 'significant moment' for European security ahead of US visit",
        "description": "Sir Keir Starmer and Volodymyr Zelenskyy said this is a \"significant moment\" for European security amid the continued fallout between the Ukrainian leader and Donald Trump.",
        "url": "https://news.sky.com/story/starmer-tells-zelenskyy-this-is-significant-moment-for-european-security-ahead-of-us-visit-13314922",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-keir-starmer-volodymyr-zelenskyy_6801478.jpg?20250116212915",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-22 17:05:00",
        "Headline": "The prime minister also had a call with European Commission president Ursula von der Leyen on Saturday morning ahead of his visit to Washington this week.",
        "Content": " Sir Keir Starmer and Volodymyr Zelenskyy said this is a \"significant moment\" for European security amid the continued fallout between the Ukrainian leader and Donald Trump. In a phone call this morning, the prime minister reiterated the UK's \"ironclad support\" for Ukraine and said he would discuss safeguarding Kyiv's sovereignty with the US president. Sir Keir also spoke with the European Commission president Ursula von der Leyen this morning, in which they agreed that Europe must \"step up\" for the good of collective security on the continent. Sir Keir will meet Mr Trump in the coming days for what will be a critical moment in the fragile relations between America and Europe after the US leader launched an extraordinary verbal attack on Mr Zelenskyy. Mr Trump labelled the Ukrainian leader a \"dictator\" and said the prime minister and French President Emmanuel Macron, both of whom will visit the White House next week, \"haven't done anything\" to end the war. Since Russia's full-scale invasion of Ukraine in 2022, the UK, France and other allies have been providing Kyiv with weapons and aid. Mr Trump has also suggested that Ukraine \"started\" the war. \n                  Think business, not politics: Trump's approach to peacemaking\n                 \n                  Don't expect a Love Actually-style moment from the Starmer-Trump meeting\n                 \n                  Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing\n                  In a Downing Street readout of Sir Keir's call with Mr Zelenskyy, a spokesperson said: \"The prime minister began by reiterating the UK's ironclad support for Ukraine and commitment to securing a just and enduring peace to bring an end to Russia's illegal war. \"The leaders reflected on recent developments in the conflict, as the third anniversary of the full-scale invasion approaches, and agreed on the need to continue working together with allies to achieve peace through strength. \"They agreed that this was a significant moment for the future of Ukraine and European security at large.\" Read more:Envoy says US is 'with' Ukraine - in contrast to Trump's remarksSombre Starmer and Europe confront emerging new world order The spokesperson added: \"The prime minister repeated that Ukraine must be at the heart of any negotiations to end the war and that safeguarding Ukraine's sovereignty was essential to deter future aggression from Russia.\" Meanwhile, a Downing Street spokesperson said of Sir Keir and Ms von der Leyen's call: \"Ahead of the three-year anniversary of Russia's barbaric illegal war, they discussed the need to secure a just and enduring peace in Ukraine, and agreed that Europe must step up for the good of collective European security.\" On Saturday afternoon, Sir Keir also spoke with Finland's president Alexander Stubb and discussed \"the need to secure enduring peace for Ukraine and bring an end to Russia's illegal war\", a Downing Street readout said. \"The leaders agreed the need for Europe to step up support to achieve this, and the prime minister said the UK is ready to play a role in future security guarantees.\" The US president's recent statements, which echo Russian president Vladimir Putin's narrative, and plans to have direct negotiations with Moscow about the end of the war in Ukraine have left European allies and Ukrainian officials worried. Mr Trump told US governors on Friday he \"had very good talks with Putin\" and \"not such good talks with Ukraine\". The US president also said a deal on minerals in Ukraine in exchange for weapons was close, but a source with knowledge of the negotiations told Sky News the Ukrainian president is not ready to sign and sees a \"number of problematic issues\" with the draft agreement."
    },
    {
        "title": "Mohamed Amra: 'The Fly' recaptured in Romania nine months after escape that killed two French prison officers",
        "description": "A suspected drugs boss known as \"The Fly\" has been recaptured nine months after escaping during an ambush that killed two French prison officers.",
        "url": "https://news.sky.com/story/mohamed-amra-the-fly-recaptured-in-romania-nine-months-after-escape-that-killed-two-french-prison-officers-13314864",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-the-fly-mohamed-amra_6554154.jpg?20240514181240",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-22 16:35:00",
        "Headline": "Amra has been linked to a powerful Marseille gang, whilst he was also suspected over two murders.",
        "Content": " A suspected drugs boss known as \"The Fly\" has been recaptured nine months after escaping during an ambush that killed two French prison officers. Mohamed Amra was arrested in Romania on Saturday, said France's interior minister on X. Bruno Retailleau congratulated those who detained the fugitive and thanked Romania for its help - but the exact circumstances are so far unclear. Father-of-two Fabrice Moello, 52, and Arnaud Garcia, 34, who was soon to be a father, were killed during May's escape. Three others were also seriously wounded when the convoy transporting Amra from court to jail was ambushed at a tollbooth near Rouen. CCTV showed a black SUV driving into the front of the prison van, with other video showing at least two armed men in balaclavas circling the car in flames. Hundreds of law enforcement were involved in the manhunt and an Interpol red notice was issued - a global alert for a person's arrest. \n                  One dead and police officers seriously injured in 'terror' stabbing in Mulhouse\n                 \n                  Thieves buy winning €500,000 lottery ticket with stolen credit card\n                 \n                  British skier, 23, found dead in French Alps\n                 Amra - who was 30 at the time of his escape - had multiple convictions for relatively minor offences, but was strongly suspected of being involved in international drug dealing. Police sources have linked him to a powerful Marseille gang, while prosecutors were investigating him over a kidnapping and homicide in the city. Amra is also suspected of ordering the assassination of a Frenchman in Spain in 2023. Read more: Who is 'The Fly'? He had just been sentenced to 18 months for burglary when he escaped. A prison source told Le Parisien that Amra had tried to saw the bars off his cell two days before the ambush and was put in solitary confinement. Read more:One dead and several police officers injured in France knife attack The killing of the prison officers sparked a major protest across France by prison staff. President Emmanuel Macron congratulated those who had been pursuing Amra for months and said his thoughts remained with the victims' families."
    },
    {
        "title": "Man arrested over stabbing at Berlin Holocaust memorial is 19-year-old Syrian refugee",
        "description": "The man arrested for stabbing a Spanish tourist at Berlin's Holocaust memorial is a 19-year-old Syrian refugee, according to prosecutors.",
        "url": "https://news.sky.com/story/man-arrested-over-stabbing-at-berlin-holocaust-memorial-is-19-year-old-syrian-refugee-13314664",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-berlin-holocaust-memorial_6836055.jpg?20250221212400",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-22 14:26:00",
        "Headline": "The man's identity was revealed a day before a much-anticipated election in which immigration has been a major issue.",
        "Content": "The man arrested for stabbing a Spanish tourist at Berlin's Holocaust memorial is a 19-year-old Syrian refugee, according to prosecutors. They said it appeared he'd been planning to kill Jewish people for several weeks and was apparently motivated by the Middle East conflict. The attack happened about 6pm on Friday and he was arrested nearby about three hours later. His hands and trousers were smeared with blood and the suspected weapon was in his backpack. He was also carrying a Koran and a prayer rug, prosecutors added. The suspect is said to have arrived in Germany as an unaccompanied minor in 2023, had no criminal record and was unknown to police. The 30-year-old Spanish man who was stabbed needed emergency surgery after being wounded in the head and neck. Prosecutors said he was in an induced coma but his life was no longer at risk. The stabbing comes a day before Germany's national election in which the far-right and anti-immigration AfD is expected to come second. Campaigning has been overshadowed by a number of attacks by migrants - which appear to have bolstered the party's support. A woman and her two-year-old daughter died when a car drove into a crowd in Munich this month. A 24-year-old Afghan asylum seeker was arrested. Another Afghan national was arrested over the stabbing deaths of a toddler and a 41-year-old man in the Bavarian city of Aschaffenburg last month. In December, a Saudi man, who had lived in Germany for years, killed six people when he drove his car into people at a Christmas market in Magdeburg. Read more:Everything you need to know about Germany's electionsGerman elections are usually dull - but this is different  More than one million migrants arrived in the country from 2015-2016, mostly from Syria, but also from Afghanistan and Iraq, many of them fleeing war and political instability. Prosecutors said they had no evidence the suspect in the Berlin stabbing is linked to any of the other attacks, or to any extremist organisations. He was scheduled to appear before an investigating judge on Saturday."
    },
    {
        "title": "Thieves buy winning €500,000 lottery ticket with stolen credit card",
        "description": "A man whose credit card was stolen and used to buy a winning lottery ticket is appealing for the thieves to come forward - so they can split the cash.&#160;",
        "url": "https://news.sky.com/story/thieves-buy-winning-8364500000-lottery-ticket-with-stolen-credit-card-13314742",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-scratchcard-lottery_6836662.jpg?20250222155746",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-22 15:11:00",
        "Headline": "The victim of the theft is appealing for the thieves to come forward - so they can split the cash.",
        "Content": "A man whose credit card was stolen and used to buy a winning lottery ticket is appealing for the thieves to come forward - so they can split the cash.  The thieves bought a winning €500,000 (£414,000) scratchcard with the stolen card in the French city of Toulouse. But the ticket has not been submitted to claim the prize. The victim of the theft, identified in police documents as Jean-David E, had his backpack containing his bank card stolen from his car earlier this month. He asked his bank to block it but learned his card had already been used in a local shop, where two apparently homeless men had used it to buy a winning scratch card. \"They were so totally happy that they forgot their cigarettes and their belongings and walked out like crazy people,\" Jean-David's lawyer Pierre Debuisson said. He said Jean-David has filed a police complaint about the theft, but is ready to withdraw it if the thieves come forward so that they can share the money. \"It's an incredible story, but it's all true,\" he added. The lawyer launched a national appeal on Thursday, asking the thieves to contact his office to make a deal. \"Without them, no one would have won,\" he told public broadcaster France-2. Read more from Sky News:'Worst hack in history': $1.5bn in crypto stolenTrump fires top military officers  La Francaise des Jeux (FDJ), the state lottery operator, said no one had yet submitted the ticket to claim the prize. Mr Debuisson said prosecutors may try to seize the winnings, considering them illegally obtained gains, and warned the ticket will eventually expire. \"Time is working against us,\" he said. \"You risk nothing... we will share with you,\" he said. \"And you would be able to change your lives.\""
    },
    {
        "title": "Pay back the billions of aid, Trump tells Ukraine",
        "description": "Donald Trump has said a deal for Ukraine's rare earth metals is \"pretty close\" and the US is targeting \"anything we can get\" in exchange for the aid it's provided.",
        "url": "https://news.sky.com/story/pay-back-the-billions-of-aid-trump-tells-ukraine-13315319",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-cpac_6837181.jpg?20250222194955",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-22 22:10:00",
        "Headline": "Despite US optimism, a Ukrainian source says there are \"a number of problematic issues\" as the draft deal only contains \"unilateral commitments\".",
        "Content": " Donald Trump has said a deal for Ukraine's rare earth metals is \"pretty close\" and the US is targeting \"anything we can get\" in exchange for the aid it's provided. Mr Trump told a conference he was determined to get payback for billions of dollars of military hardware and other assistance. However, a source has told Sky News that President Zelenskyy is not ready to accept the agreement that's been drafted. \"I want them to give us something for all the money we put up,\" Mr Trump told the CPAC conference. \"So we're asking for rare earth and oil - anything we can get!\" He claimed European countries had given their aid as a loan but the US had not - meaning they were due some compensation. \"We're going to get our money back because it's not fair,\" Mr Trump told the event in Maryland. \"And we will see, but I think we're pretty close to a deal. We better be close to a deal\". \n                  Think business, not politics: Trump's approach to peacemaking\n                 \n                  Don't expect a Love Actually-style moment from the Starmer-Trump meeting\n                 \n                  Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing\n                 Mr Trump claimed the US had given $350bn in aid, but some international bodies - such as Kiel's Institute for the World Economy - estimate it's around $120bn. Rare earth metals are elements used in high-tech goods such as mobile phones and electric vehicles. Demand is increasing but there are concerns over future availability. Mr Trump's national security adviser, Mike Waltz, told the same conference on Friday that he also believed a deal would be struck.  Despite US optimism, a Ukrainian source said an agreement was not yet close due to \"a number of problematic issues\". They said drafts did not \"reflect a partnership in the agreement and contain only unilateral commitments by Ukraine\". Kyiv is likely to be pressing for robust security guarantees from America in any future peace deal with Russia. Mr Trump's speech on Saturday evening spanned many subjects, taking numerous digs at opponents such as Joe Biden and heralding what he said were numerous achievements since he regained the White House.  He also shouted out visitors in the audience such as Reform leader Nigel Farage, calling him a \"great guy\", and Argentinian President Javier Milei - who spoke to the conference in Spanish on Saturday. Italian premier Giorgia Meloni, seen as a key Trump ally in Europe, also delivered a video message defending the political direction of the continent. \"I know you can perceive Europe as distant and lost, but I can tell you it's not,\" said Ms Meloni - who also reaffirmed support for Ukraine, saying it was resisting \"a brutal aggression\" from Russia. Donald Trump the president is still Donald Trump the businessman. For the president of the United States, everything is transactional, even the business of ending the war in Ukraine. Under the agreement, he wants Ukraine to grant America access to its mineral and oil resources as payback for wartime aid. This deal-making approach aligns with his broader foreign policy perspective, emphasising economic gains. Read the rest of David's analysis President Trump repeated his optimism that a deal to end the war is possible under his watch, saying he was \"dealing\" with both the Ukrainian and Russian leaders. \"I've spoken to President Putin and I think that thing [the war] is going to end,\" he told the conference. Ukraine has insisted it won't accept any deal agreed without its participation, after it was excluded from this week's meeting between top US and Russian diplomats in Saudi Arabia. Read more:Envoy says US is 'with' Ukraine - in contrast to Trump's remarksSombre Starmer and Europe confront emerging new world order Tensions have been rising in recent days between President Trump and President Zelenskyy. The US leader referred to Mr Zelesnkyy as a \"dictator\", apparently in response to the Ukrainian president saying Mr Trump was living in a Russian \"disinformation space\". Sir Keir Starmer again lent his unwavering backing to Ukraine's leader in a phone call on Saturday. Downing Street said the prime minister \"reiterated his ironclad support\" and \"commitment to securing a just and enduring peace to bring an end to Russia's illegal war\". It comes days before Sir Keir and French President Emmanuel Macron head to Washington for tricky talks in which they must press Ukraine's case while keeping the US leader onside. President Trump told a radio show on Friday that the two European leaders \"haven't done anything\" to end the war."
    },
    {
        "title": "Trump fires top US military officers - including America's most senior commander",
        "description": "Donald Trump has purged top military figures in the Pentagon, including firing America's most senior commander.",
        "url": "https://news.sky.com/story/trump-fires-top-us-military-officers-including-americas-most-senior-commander-13314409",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pentagon-usa_6836228.jpg?20250222065411",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-22 06:08:00",
        "Headline": "Donald Trump has sacked America's most senior commander, the first woman to lead a military service and people who ensure enforcement of military justice.",
        "Content": "Donald Trump has purged top military figures in the Pentagon, including firing America's most senior commander. He also pushed out five other admirals and generals in an unprecedented shake-up of US military leadership. The Pentagon had been bracing for mass firings of civilian staff as well as a dramatic overhaul of its budget and a shift in military deployments. Chairman of the Joint Chiefs of Staff, Air Force General Charles 'CQ' Brown - America's highest-ranking general and only the second black general to serve as chairman - was fired with immediate effect. The president will also replace the head of the US Navy, a position held by Admiral Lisa Franchetti, the first woman to lead a military service, and the Air Force vice chief of staff, the Pentagon said. He is also removing the judge advocates general for the Army, Navy and Air Force, critical positions that ensure enforcement of military justice. The campaign to rid the military of leaders who support diversity and equity in the ranks has been condemned by Democrats. By David Blevins, Sky News correspondent The purge of America's top military officials, carried out by President Trump and his Defence Secretary Pete Hegseth, is unprecedented, writes Sky News correspondent David Blevins, in Washington.  Their dismissal late on Friday sent shockwaves through the defence establishment and raised concerns about the direction of military leadership. General Charles Q Brown, chairman of the Joint Chiefs of Staff, was abruptly removed two years into his four-year term. America's most senior military officer comes into office two years into a presidential term, meaning they serve under two presidents. The role is intended to be apolitical but there is no such thing as non-partisan politics in the Trump playbook. Brown's tenure had been marked by a focus on diversity, equity and inclusion, putting him at odds with the administration. Prior to his appointment as defence secretary, Hegseth questioned Brown's promotion, hinting that it had been influenced by race. In his book, The War on Warriors, Hegseth wrote: \"The military standards, once the hallmark for competency, professionalism, and 'mission first' outcomes, have officially been subsumed by woke priorities.\" Supporters of the administration argue the changes are necessary to refocus military priorities in line with the president's objectives. But critics contend that such a sweeping overhaul of leadership undermines the apolitical nature of the military and unsettles the rank and file. Rhode Island's senator Jack Reed, the top Democrat on the Senate Armed Services Committee, said: \"Firing uniformed officers as a type of political loyalty test… erodes the trust and professionalism that our servicemembers require to achieve their missions.\" Representative Seth Moulton, a Massachusetts Democrat, said the firings were \"un-American, unpatriotic, and dangerous for our troops and our national security.\" \"This is the definition of politicising our military,\" he said. Senator Jack Reed of Rhode Island, the top Democrat on the Senate Armed Services Committee, said: \"Firing uniformed leaders as a type of political loyalty test, or for reasons relating to diversity and gender that have nothing to do with performance, erodes the trust and professionalism that our servicemembers require to achieve their missions.\" Read more:Dozens turn out in support of Luigi MangioneFormer Trump adviser denies using 'Nazi' salute During the election, Mr Trump spoke of firing \"woke\" generals and those he saw as responsible for the withdrawal from Afghanistan. Defence secretary and former Fox News personality Pete Hegseth has questioned whether General Brown would have got the job if he were not black. There is no indication his appointment was not based on merit. 👉 Follow Trump 100 on your podcast app 👈 On Friday, Mr Trump said: \"I want to thank General Charles 'CQ' Brown for his over 40 years of service to our country, including as our current Chairman of the Joint Chiefs of Staff. \"He is a fine gentleman and an outstanding leader, and I wish a great future for him and his family.\" It's unclear who Mr Trump will choose to replace the judge advocates. Mr Hegseth previously criticised military lawyers, saying most \"spend more time prosecuting our troops than putting away bad guys\"."
    },
    {
        "title": "New Menendez trial rejected - but resentencing bid could see brothers walk free",
        "description": "A new trial for Lyle and Erik Menendez, after 35 years in prison for the shotgun murder of their parents, has been turned down by the Los Angeles County District Attorney.",
        "url": "https://news.sky.com/story/new-menendez-trial-rejected-but-resentencing-bid-could-see-brothers-walk-free-13314390",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-joseph-lyle-menendez_6695502.jpg?20241020103530",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-22 00:53:00",
        "Headline": "The brothers were found guilty in the 1989 murders of their entertainment executive father, Jose, and their mother, Kitty Menendez.",
        "Content": "A new trial for Lyle and Erik Menendez, after 35 years in prison for the shotgun murder of their parents, has been turned down by the Los Angeles County District Attorney. However, Nathan Hochman said a decision had not been made on a resentencing bid that could lead to their release. The brothers were found guilty in the 1989 murders of their entertainment executive father, Jose, and their mother, Kitty Menendez, and sentenced to life in prison without parole. Their latest bid for freedom focuses on new evidence of their father's sexual abuse. Read more:The real case behind the Netflix dramaMonsters star 'stands with' Menendez brothersWhen could the Menendez brothers be freed? However, Mr Hochman cast doubt on the evidence and said it was not pertinent to the case. \"Sexual abuse in this situation may have been a motivation for Erik and Lyle to do what they did, but it does not constitute self-defence.\" \n                  Pay back the billions of aid, Trump tells Ukraine\n                 \n                  Don't expect a Love Actually-style moment from the Starmer-Trump meeting\n                 \n                  Think business, not politics: Trump's approach to peacemaking\n                 He also said the brothers' own testimony of sexual abuse was untrustworthy because they had told five different explanations for why they committed the murder. The Menendez family called the decision \"abhorrent\" and said he \"discredited the trauma\" experienced by the brothers. \"Abuse does not exist in a vacuum. It leaves lasting scars, rewires the brain, and traps victims in cycles of fear and trauma,\" they said in a statement. \"To say it played no role in Erik and Lyle's action is to ignore decades of psychological research and basic human understanding.\" The family said new evidence should not be needed, as the justice system failed the brothers back then and \"continues to fail them now\". Lyle and Erik Menendez admitted they killed their parents with a shotgun, but said they feared they were about to kill them due to details of their father's long-term molestation of Erik being made public. Prosecutors said at the time there was no evidence of molestation, and many details in the brothers' story of sexual abuse were not permitted in the trial that led to their conviction in 1996. Prosecutors accused the brothers of killing their parents for money. The proposed resentencing for the brothers is still set to be taken up at a March hearing and would make them immediately eligible for parole. The Menendez case was thrust back into the limelight after Monsters, a Netflix drama telling of their story, and a documentary were recently released."
    },
    {
        "title": "Hawaii man celebrates 'freedom Friday' after new DNA evidence ends 30-year prison stint",
        "description": "A Hawaii man who spent 30 years in prison for a murder celebrated \"Freedom Friday\" after a judge ordered him to be released because of new DNA evidence.",
        "url": "https://news.sky.com/story/hawaii-man-celebrates-freedom-friday-after-new-dna-evidence-ends-30-year-prison-stint-13314400",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gordon-cordeiro-hawaii_6836224.jpg?20250222044504",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-22 04:39:00",
        "Headline": "Gordon Cordeiro was convicted of the 1994 killing of Timothy Blaisdell on the island of Maui - he always denied carrying out the murder.",
        "Content": "A Hawaii man who spent 30 years in prison for a murder celebrated \"Freedom Friday\" after a judge ordered him to be released because of new DNA evidence. There were gasps and cries when Judge Kirstin Hamman said \"the sentence is vacated and the defendant is ordered to be released from custody\". She ruled that new evidence, including DNA test results, would be certain to change the outcome of another trial against Gordon Cordeiro. Mr Cordeiro's first trial for the 1994 killing of Timothy Blaisdell on the island of Maui ended in a hung jury, with only one juror voting to convict him. Read more from Sky News:Pope 'not out of danger,' doctors say'Severed hand' found near school in Dublin But he was later found guilty of murder, robbery and attempted murder and sentenced to life without the possibility of parole. The Hawaii Innocence Project took up his case, and argued he must be released on the grounds of new evidence proving his innocence, ineffectiveness of his previous lawyer and prosecutorial misconduct. \n                  Seven injured, three critically, after suspected gas explosion at popular Hawaii resort\n                 \n                  Former classmate arrested after fresh DNA link nearly 50 years after schoolgirl's murder\n                 \n                  Toddler saved from falling into erupting Hawaii volcano 'in the nick of time'\n                 Maui County prosecuting attorney Andrew Martin said he was disappointed in the ruling and that \"none of the judge's findings exonerate him in any way\". Kenneth Lawson, co-director of the Hawaii Innocence Project, said: \"He cried, we all cried. \"He believed that he was going to be exonerated... but having gone through two trials, you lose faith in the justice system. \"To finally hear a judge say, 'I'm vacating your convictions,' that's when it hit him.\" Following his release Mr Cordeiro said: \"I'd like to go see my mum.\" After Cordeiro's conviction, new testing on physical evidence from the scene excluded him as the source of DNA on Blaisdell's body and other crime scene evidence. The Hawaii Innocence Project said a DNA profile of an unidentified person was found on the inside pockets of Mr Blaisdell's jeans. The judge agreed that the new DNA evidence and new information about gunshot residue would change the results of a later trial."
    },
    {
        "title": "Payments watchdog could be abolished in PM's purge of regulators",
        "description": "Britain's payments watchdog is expected to be abolished as part of a purge of regulators being thrashed out in Whitehall.",
        "url": "https://news.sky.com/story/payments-watchdog-could-be-abolished-in-pms-purge-of-regulators-13314470",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-money-fca_6836316.jpg?20250222103535",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-22 10:32:00",
        "Headline": "Ministers are considering whether to scrap the UK's Payment Systems Regulator and fold it into the City watchdog as part of efforts to remove red tape from the economy, Sky News can reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Britain's payments watchdog is expected to be abolished as part of a purge of regulators being thrashed out in Whitehall. Sky News has learnt that ministers and officials are examining whether to scrap the Payment Systems Regulator (PSR) and fold it into the Financial Conduct Authority (FCA). A decision is expected to be taken in principle within weeks, although sources indicated this weekend that the government was \"actively considering\" a decision to scrap the body. If confirmed, it would form part of a crackdown on Britain's economic regulators instigated by Sir Keir Starmer, the prime minister, and Rachel Reeves, the chancellor, as they seek to cut red tape and stimulate economic growth. The chairman of the Competition and Markets Authority (CMA), Marcus Bokkerink, was ousted by ministers last month amid concerns that it was paying too little heed to UK competitiveness. Mr Bokkerink was replaced by Doug Gurr, a former Amazon executive. Since then, both the chair and chief executive of the Financial Ombudsman Service have announced plans to step down. \n                  M4 and M48 closed after human remains found\n                 \n                  Police hunt van driver after girl, 3, dies in Manchester tram collision\n                 \n                  Don't expect a Love Actually-style moment from the Starmer-Trump meeting\n                 Speaking in January, Jonathan Reynolds, the business secretary, signalled that a number of watchdogs could be abolished, saying: \"We've got to genuinely ask ourselves the question: have we got the right number of regulators?\" He did not publicly identify which of them could be axed, although the Financial Times reported this week that the chancellor would order an audit of roughly 130 regulators across the economy to assess whether they were sufficiently focused on growth. On Christmas Eve, the PM and chancellor wrote to about 15 major regulators - including Ofcom, Ofgem and Ofwat - demanding ideas for how to remove bureaucracy from the economy and more proactively encourage growth. Ms Reeves has since held a number of roundtable discussions with the recipients of the letter. The PSR employs roughly 160 people, according to its website, and is directly accountable to parliament. It was created under the Financial Services (Banking Reform) Act 2013, and became operational two years later. The body, which is accountable to parliament, has been criticised by industry and politicians over its regulatory approach, including in relation to fraud reimbursement by financial services firms. Nevertheless, its function is regarded as critical as technology reshapes the global payments industry. David Geale, the interim managing director of the PSR, has been in post since last summer. The watchdog is chaired by Aidene Walsh, a former boss of the financial wellbeing charity, the Fairbanking Foundation. Sheldon Mills, the FCA's executive director, consumers and competition, also sits on the PSR board. One source said scrapping the PSR and folding it into the FCA would make sense for several reasons, including the questions over its performance. \"No other major economy has a standalone payments regulator like this, and it is hard to make the case for it continuing to exist,\" the source said this weekend. The Treasury declined to comment, while the PSR did not respond to an emailed enquiry on Saturday morning."
    },
    {
        "title": "Low-paid jobs at risk from Labour's tax increases on businesses",
        "description": "Cliff Nicholls runs two trampoline parks and indoor play centres: one in Tamworth in the West Midlands, the other in Bolton, Greater Manchester. He's already feeling the pressure from the government's latest budget measures and has been forced to abandon further investment plans.",
        "url": "https://news.sky.com/story/low-paid-jobs-at-risk-from-labours-tax-increases-on-businesses-13304558",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-employer-nics-story_6831730.png?20250217154315",
        "type": "Business",
        "Author": "Saywah Mahmood",
        "Date Published": "2025-02-22 00:01:00",
        "Headline": "Labour says it will protect workers' incomes but budget changes coming in from April 2025 are putting pressure on employers. Sky News analysis finds early signs that low-paid workers are being affected.",
        "Content": "\n          Data journalist\n              @saywhatsaywah\n  Cliff Nicholls runs two trampoline parks and indoor play centres: one in Tamworth in the West Midlands, the other in Bolton, Greater Manchester. He's already feeling the pressure from the government's latest budget measures and has been forced to abandon further investment plans. \"The national minimum wage increases coming in April, combined with the reduced thresholds for national insurance and the increased rate of employers' national insurance, will have a very significant impact,\" Cliff said. To cut costs, he's already made drastic changes. \"We've had to take some fairly radical decisions, reducing our opening hours, making a senior staff member redundant because of rising business costs, including business rates and national insurance,\" he added. While policies like the National Living Wage (NLW) increase are designed to support low-paid workers, other changes could offset these benefits. One major shift is the reduction in the salary threshold at which businesses start paying employer's national insurance contributions (NICs). Currently, employers begin paying NICs when an employee earns more than £9,100 per year. From April 2025, this threshold will drop to £5,000. At the same time, the employer's NI rate will rise from 13.8% to 15%. Scroll through to see Cliff's staffing finances Under the new system, an employer will be paying nearly £800 more in NICs annually for an employee earning around £23,800 (based on a 37.5-hour week at the new NLW). The rise in NICs will be proportionally higher for employers of lower-paid workers. For example, they will pay around 7% for someone earning £9,000 a year and 3% for an employee on the NLW. But for someone earning £75,000 a year, employers will pay 2% more. Extended employment rights and business rates add pressure Labour also announced a series of employment rights reforms aimed at improving working conditions. These include extending statutory sick pay to lower-paid employees who were previously ineligible and making it available from the first day of illness for all workers. The changes would also enable employees to claim unpaid parental leave from their first day in a job, strengthen protections against unfair dismissal, and enhance rights for those on zero-hours contracts. The government estimates that these employment rights changes will cost businesses around £5bn. Nye Cominetti, principal economist at the Resolution Foundation, said: \"What concerns me is that employer national insurance increases, like the minimum wage and employment rights changes, disproportionately impact low-paid workers. \"For instance, extending statutory sick pay to those previously ineligible adds costs for employers already facing higher NICs and rising wages. In this context, it would have been more sensible to raise tax revenue in a way that didn't hit low-paid workers the hardest.\" But for Cliff, the changes to business rates relief are an even bigger challenge. Budget changes will mean business rates relief will drop from 75% to 45% for retail, leisure, and hospitality businesses, significantly increasing his costs. \"The business rates changes probably have a bigger impact on us than national insurance,\" he explained. \"One of our buildings used to be in a prime edge-of-town retail park 25 years ago. The rental value has dropped significantly since but business rates haven't kept pace. Next year, we'll be paying between £55,000 and £60,000 more just in business rates.\" Cliff is not alone in his concerns. Research conducted by the Federation of Small Businesses found that in the final three months of last year, confidence among small firms fell to its lowest level in a decade, excluding the pandemic. Are these changes impacting inflation? Higher prices for food, goods, and services will also put pressure on working people. New data from the Office for National Statistics shows that inflation rose to 3% in January 2025, the highest level in 10 months. Many businesses had warned this would happen, saying that rising national insurance costs and the increase in the NLW would leave them with no choice but to raise prices. The latest Quarterly Economic Survey by the British Chambers of Commerce, conducted after the budget, surveyed more than 4,800 businesses. It found that more than half expect to increase prices in the next three months, up from 39% in the third quarter of 2024. Businesses are making tough decisions  Signs of pressure are already emerging. Lord Wolfson, a Conservative peer and chief executive of Next, has warned that it will become harder for people to enter the workforce. In an interview with the BBC, he said that the rise in NICs for businesses would hit the retail sector particularly hard, with entry-level jobs most affected. He urged the government to phase in the tax changes rather than implement them in full in April, warning that otherwise, businesses would be forced to cut jobs or reduce working hours. While it is not possible to fully attribute this to budget announcements, early data suggests that the workforce has been shrinking across various industries since October 2024, with the biggest declines in sectors that employ large numbers of lower-paid workers, such as manufacturing, retail, and hospitality. Since the budget, the number of payrolled employees has fallen by more than 10,000 in manufacturing and nearly 9,000 in hospitality. Since the budget, voluntary liquidations have remained consistently high and from December 2024 to January 2025 voluntary business closures have gone up by 9%. While this can't be solely attributed to upcoming budget measures, it does highlight the challenges businesses are facing and the difficult decisions they are making as a result. Read more:Reeves faces pressure to raise taxes or cut public spendingChancellor in danger of squandering new year fightbackReeves responds to expenses allegations An HM Treasury spokesperson said: \"We delivered a once-in-a-parliament budget to wipe the slate clean and deliver the stability businesses need to invest and grow, while protecting working people's payslips from higher taxes, ensuring more than half of employers either see a cut or no change in their National Insurance bills, and delivering a record pay boost for millions of workers. \"Now we are going further and faster to kickstart economic growth and raise living standards, with a majority of business leaders confident that the chancellor's plans will help drive business investment. \"This includes backing businesses to create wealth across Britain by capping corporation tax, making full expensing permanent and permanently cutting business rates for retail, hospitality, and leisure businesses on the high street from next year.\" The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open-source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "'Worst hack in history' as $1.5bn in cryptocurrency stolen",
        "description": "Hackers have stolen $1.5bn (&#163;1.19bn) worth of digital money in what could be the biggest-ever cryptocurrency theft. ",
        "url": "https://news.sky.com/story/worst-hack-in-history-as-15bn-in-cryptocurrency-stolen-13314456",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bybit-cryptocurrency_6836297.jpg?20250222093121",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-22 09:23:00",
        "Headline": "The Dubai-based Bybit exchange said an attacker gained control of an Ethereum wallet and transferred its holdings to an unidentified address.",
        "Content": " Hackers have stolen $1.5bn (£1.19bn) worth of digital money in what could be the biggest-ever cryptocurrency theft.  The Dubai-based Bybit exchange said an attacker gained control of an Ethereum wallet and transferred its holdings to an unidentified address. The firm, which has more than 60 million users worldwide, said no other wallets were affected and withdrawals were proceeding normally. \"Bybit is solvent even if this hack loss is not recovered, all of clients assets are 1 to 1 backed, we can cover the loss,\" the company's chief executive officer Ben Zhou said in a post on X. Science correspondent Anyone who owns crypto may well be feeling a little nauseous after the biggest ever theft of funds by hackers. Bybit is the second largest cryptocurrency exchange. It would have had careful security protocols.  And yet somehow their systems were penetrated and an as-yet unidentified individual or group made off with around £1.1 billion in assets. The breach happened while the company was making a routine transfer of Ethereum, the second largest cryptocurrency after Bitcoin, from its offline “cold” wallet to top up its “warm” wallet that covers daily trading. The transfer needed multiple checks and signatures before it went ahead. Yet the attackers seem to have masked the true destination of the funds, and they vanished. Forensic investigators are trying to trace the assets, and perhaps even recover them. They’ll also be looking at how hackers were able to penetrate the company’s security. Firewalls are increasingly sophisticated, holding hackers at bay. So instead criminals often turn their attack on humans. We are the weak point, vulnerable to social engineering and phishing. The latest heist underscores concerns about the security of the cryptocurrency industry. According to blockchain analysists Chainalysis there were 303 hacking incidents in 2024, with assets worth $2.2 billion stolen. Bybit says clients’ money is covered, either by its other assets or loans. But many people will be uneasy, particularly as crypto platforms are largely unregulated, unlike banks. And there are no guarantees of people getting their money back. He said the company received more than 350,000 withdrawal requests following what he described as \"the worst hack in history\", adding: \"ALL withdraws have been processed.\" The theft could be the largest of its kind, with the previous record reportedly an estimated $620m (£490m) of cryptocurrency stolen from the Ronin Network in 2022. Read more from Sky News:Trump fires top military officersVatican gives update on Pope Francis Bybit said its security team, along with forensic experts, was investigating the incident, adding: \"We have reported the case to the appropriate authorities.\" The firm said: \"All client funds are safe, and our operations continue as usual without any disruption.\""
    },
    {
        "title": "'You have to accept her life is not her own': Ruth Davidson and partner Jen reflect on life in politics",
        "description": "Being a politician is not always easy - and neither is it straightforward if you are in a relationship with one.",
        "url": "https://news.sky.com/story/you-have-to-accept-her-life-is-not-her-own-ruth-davidson-and-partner-jen-reflect-on-life-in-politics-13312695",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-electoral-dysfunction_6670735.png?20240830000658",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-22 04:00:00",
        "Headline": "In this week's episode of Electoral Dysfunction, Baroness Davidson gives advice to a caller whose partner is now an MP.",
        "Content": "Being a politician is not always easy - and neither is it straightforward if you are in a relationship with one. Jen Wilson joins her partner Baroness Davidson on Beth Rigby's Electoral Dysfunction podcast where she describes how her life became \"quite intense\" when Ruth led the Scottish Conservatives. A caller tells the podcast that her partner is an MP and asks what they can do to \"protect the sanctity of our friendships and social life locally?\" \"I knew life would be different, but I had no idea quite how different it would become,\" the caller adds. In response, Jen tells the podcast: \"It is definitely quite different being the partner of a politician. It's quite intense because they aren't 9 to 5.\" She says that when Ruth was the Scottish Tory leader from 2011 to 2019, she was \"on call pretty much 24/7\". \"It definitely took lots of adjusting to when we first got together,\" she said. Jen adds: \"The other thing that can be quite tricky is getting the hang of avoiding political debates with people going somewhere. \"And I think your partner's got to maybe get used to it, kind of politely shutting down politics chatter. People come over to try and have big debates with them when you're out and about, we've definitely had people not really understanding that, interrupting a couple, having a nice candlelit dinner, to talk about constituency issues or potholes or the constitution, isn't exactly the right moment. \"So we had to kind of get the hang of that over the years. We've joked previously that Ruth was off duty and asked people to get in contact with her office, and it usually gently gives people the message that is not the right second.\"  Ruth also remembers it as \"very full on\" at the beginning. \"I think to be fair to Jen, I mean, we'd known each other for years before we got together. I was already the Tory Party leader in Scotland when we got together, so it was full on from the very beginning and the boundaries of my work were there that I had to take phone calls, there were weekends, I had to work the evenings.\" Responding to the caller, Ruth adds: \"And if you have a family, you'll have had a rhythm to that and that will have been completely interrupted, not just by four days a week in London and then coming back, but by what you have to do on the ground as an MP if she's going to do the job well, you cannot hold on to everything that you had before. \"You have to accept that her life is not her own - she is in a life of service for the time that she is in parliament.\" Read more:Man jailed for sending 'utterly deplorable' email to Jess PhillipsAgeism against 'boomers' is widespread, MPs say Baroness Harman, who was a Labour MP for 40 years and whose late husband Jack joined her in the Commons in 2010, says she had particular advice for \"a man who is married to a woman MP\". \"And I would say to him in answer to this question, I think you should ask a different question, which is, 'how can I support her in doing what she wants as an MP and being the very best MP she can be because she is a pioneer?'\" Never miss an episode of Electoral Dysfunction wherever you get your podcasts."
    },
    {
        "title": "Low-paid jobs at risk from Labour's tax increases on businesses",
        "description": "Cliff Nicholls runs two trampoline parks and indoor play centres: one in Tamworth in the West Midlands, the other in Bolton, Greater Manchester. He's already feeling the pressure from the government's latest budget measures and has been forced to abandon further investment plans.",
        "url": "https://news.sky.com/story/low-paid-jobs-at-risk-from-labours-tax-increases-on-businesses-13304558",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-employer-nics-story_6831730.png?20250217154315",
        "type": "Politics",
        "Author": "Saywah Mahmood",
        "Date Published": "2025-02-22 00:01:00",
        "Headline": "Labour says it will protect workers' incomes but budget changes coming in from April 2025 are putting pressure on employers. Sky News analysis finds early signs that low-paid workers are being affected.",
        "Content": "\n          Data journalist\n              @saywhatsaywah\n  Cliff Nicholls runs two trampoline parks and indoor play centres: one in Tamworth in the West Midlands, the other in Bolton, Greater Manchester. He's already feeling the pressure from the government's latest budget measures and has been forced to abandon further investment plans. \"The national minimum wage increases coming in April, combined with the reduced thresholds for national insurance and the increased rate of employers' national insurance, will have a very significant impact,\" Cliff said. To cut costs, he's already made drastic changes. \"We've had to take some fairly radical decisions, reducing our opening hours, making a senior staff member redundant because of rising business costs, including business rates and national insurance,\" he added. While policies like the National Living Wage (NLW) increase are designed to support low-paid workers, other changes could offset these benefits. One major shift is the reduction in the salary threshold at which businesses start paying employer's national insurance contributions (NICs). Currently, employers begin paying NICs when an employee earns more than £9,100 per year. From April 2025, this threshold will drop to £5,000. At the same time, the employer's NI rate will rise from 13.8% to 15%. Scroll through to see Cliff's staffing finances Under the new system, an employer will be paying nearly £800 more in NICs annually for an employee earning around £23,800 (based on a 37.5-hour week at the new NLW). The rise in NICs will be proportionally higher for employers of lower-paid workers. For example, they will pay around 7% for someone earning £9,000 a year and 3% for an employee on the NLW. But for someone earning £75,000 a year, employers will pay 2% more. Extended employment rights and business rates add pressure Labour also announced a series of employment rights reforms aimed at improving working conditions. These include extending statutory sick pay to lower-paid employees who were previously ineligible and making it available from the first day of illness for all workers. The changes would also enable employees to claim unpaid parental leave from their first day in a job, strengthen protections against unfair dismissal, and enhance rights for those on zero-hours contracts. The government estimates that these employment rights changes will cost businesses around £5bn. Nye Cominetti, principal economist at the Resolution Foundation, said: \"What concerns me is that employer national insurance increases, like the minimum wage and employment rights changes, disproportionately impact low-paid workers. \"For instance, extending statutory sick pay to those previously ineligible adds costs for employers already facing higher NICs and rising wages. In this context, it would have been more sensible to raise tax revenue in a way that didn't hit low-paid workers the hardest.\" But for Cliff, the changes to business rates relief are an even bigger challenge. Budget changes will mean business rates relief will drop from 75% to 45% for retail, leisure, and hospitality businesses, significantly increasing his costs. \"The business rates changes probably have a bigger impact on us than national insurance,\" he explained. \"One of our buildings used to be in a prime edge-of-town retail park 25 years ago. The rental value has dropped significantly since but business rates haven't kept pace. Next year, we'll be paying between £55,000 and £60,000 more just in business rates.\" Cliff is not alone in his concerns. Research conducted by the Federation of Small Businesses found that in the final three months of last year, confidence among small firms fell to its lowest level in a decade, excluding the pandemic. Are these changes impacting inflation? Higher prices for food, goods, and services will also put pressure on working people. New data from the Office for National Statistics shows that inflation rose to 3% in January 2025, the highest level in 10 months. Many businesses had warned this would happen, saying that rising national insurance costs and the increase in the NLW would leave them with no choice but to raise prices. The latest Quarterly Economic Survey by the British Chambers of Commerce, conducted after the budget, surveyed more than 4,800 businesses. It found that more than half expect to increase prices in the next three months, up from 39% in the third quarter of 2024. Businesses are making tough decisions  Signs of pressure are already emerging. Lord Wolfson, a Conservative peer and chief executive of Next, has warned that it will become harder for people to enter the workforce. In an interview with the BBC, he said that the rise in NICs for businesses would hit the retail sector particularly hard, with entry-level jobs most affected. He urged the government to phase in the tax changes rather than implement them in full in April, warning that otherwise, businesses would be forced to cut jobs or reduce working hours. While it is not possible to fully attribute this to budget announcements, early data suggests that the workforce has been shrinking across various industries since October 2024, with the biggest declines in sectors that employ large numbers of lower-paid workers, such as manufacturing, retail, and hospitality. Since the budget, the number of payrolled employees has fallen by more than 10,000 in manufacturing and nearly 9,000 in hospitality. Since the budget, voluntary liquidations have remained consistently high and from December 2024 to January 2025 voluntary business closures have gone up by 9%. While this can't be solely attributed to upcoming budget measures, it does highlight the challenges businesses are facing and the difficult decisions they are making as a result. Read more:Reeves faces pressure to raise taxes or cut public spendingChancellor in danger of squandering new year fightbackReeves responds to expenses allegations An HM Treasury spokesperson said: \"We delivered a once-in-a-parliament budget to wipe the slate clean and deliver the stability businesses need to invest and grow, while protecting working people's payslips from higher taxes, ensuring more than half of employers either see a cut or no change in their National Insurance bills, and delivering a record pay boost for millions of workers. \"Now we are going further and faster to kickstart economic growth and raise living standards, with a majority of business leaders confident that the chancellor's plans will help drive business investment. \"This includes backing businesses to create wealth across Britain by capping corporation tax, making full expensing permanent and permanently cutting business rates for retail, hospitality, and leisure businesses on the high street from next year.\" The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open-source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "'Worst hack in history' as $1.5bn in cryptocurrency stolen",
        "description": "Hackers have stolen $1.5bn (&#163;1.19bn) worth of digital money in what could be the biggest-ever cryptocurrency theft. ",
        "url": "https://news.sky.com/story/worst-hack-in-history-as-15bn-in-cryptocurrency-stolen-13314456",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bybit-cryptocurrency_6836297.jpg?20250222093121",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-22 09:23:00",
        "Headline": "The Dubai-based Bybit exchange said an attacker gained control of an Ethereum wallet and transferred its holdings to an unidentified address.",
        "Content": " Hackers have stolen $1.5bn (£1.19bn) worth of digital money in what could be the biggest-ever cryptocurrency theft.  The Dubai-based Bybit exchange said an attacker gained control of an Ethereum wallet and transferred its holdings to an unidentified address. The firm, which has more than 60 million users worldwide, said no other wallets were affected and withdrawals were proceeding normally. \"Bybit is solvent even if this hack loss is not recovered, all of clients assets are 1 to 1 backed, we can cover the loss,\" the company's chief executive officer Ben Zhou said in a post on X. Science correspondent Anyone who owns crypto may well be feeling a little nauseous after the biggest ever theft of funds by hackers. Bybit is the second largest cryptocurrency exchange. It would have had careful security protocols.  And yet somehow their systems were penetrated and an as-yet unidentified individual or group made off with around £1.1 billion in assets. The breach happened while the company was making a routine transfer of Ethereum, the second largest cryptocurrency after Bitcoin, from its offline “cold” wallet to top up its “warm” wallet that covers daily trading. The transfer needed multiple checks and signatures before it went ahead. Yet the attackers seem to have masked the true destination of the funds, and they vanished. Forensic investigators are trying to trace the assets, and perhaps even recover them. They’ll also be looking at how hackers were able to penetrate the company’s security. Firewalls are increasingly sophisticated, holding hackers at bay. So instead criminals often turn their attack on humans. We are the weak point, vulnerable to social engineering and phishing. The latest heist underscores concerns about the security of the cryptocurrency industry. According to blockchain analysists Chainalysis there were 303 hacking incidents in 2024, with assets worth $2.2 billion stolen. Bybit says clients’ money is covered, either by its other assets or loans. But many people will be uneasy, particularly as crypto platforms are largely unregulated, unlike banks. And there are no guarantees of people getting their money back. He said the company received more than 350,000 withdrawal requests following what he described as \"the worst hack in history\", adding: \"ALL withdraws have been processed.\" The theft could be the largest of its kind, with the previous record reportedly an estimated $620m (£490m) of cryptocurrency stolen from the Ronin Network in 2022. Read more from Sky News:Trump fires top military officersVatican gives update on Pope Francis Bybit said its security team, along with forensic experts, was investigating the incident, adding: \"We have reported the case to the appropriate authorities.\" The firm said: \"All client funds are safe, and our operations continue as usual without any disruption.\""
    },
    {
        "title": "Scientists find new virus that could infect humans in same way as COVID-19",
        "description": "A newly discovered bat coronavirus could at some point spread to humans like COVID-19, Chinese researchers have found.",
        "url": "https://news.sky.com/story/scientists-find-new-virus-that-could-infect-humans-in-same-way-as-covid-19-13314392",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bat-barbastrelle_6836222.jpg?20250222023106",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-22 02:20:00",
        "Headline": "In lab experiments, HKU5-CoV-2 infected human cells with high ACE2 levels in test tubes and in models of human intestines and airways.",
        "Content": "A newly discovered bat coronavirus could at some point spread to humans like COVID-19, Chinese researchers have found. The virus, HKU5-CoV-2, does not enter human cells as readily as SARS-CoV-2, which causes COVID-19, the scientists reported in the journal Cell. However, they found that the bat virus uses the same cell-surface protein, ACE2, as SARS-CoV-2 to help it enter human cells. In lab experiments, HKU5-CoV-2 infected human cells with high ACE2 levels in test tubes and in models of human intestines and airways. Read more science and technology news:How AI is being used to manipulate German votersNew prostate cancer screening trial announcedDonated placenta saved acid attack victim's eye In further experiments, the researchers identified antibodies and antiviral drugs that are able to target the bat virus. Asked about concerns raised by the report of another pandemic resulting from this new virus, Dr Michael Osterholm, an infectious disease expert at the University of Minnesota, called the reaction to the study \"overblown\". \n                  Older people in England happier and more satisfied now than before COVID, researchers say\n                 \n                  CIA believes lab leak most likely caused COVID outbreak\n                 \n                  COVID inquiry latest: Watch live as Matt Hancock gives evidence\n                 He said there is a lot of immunity in the population to similar COVID-19 and SARS viruses compared with 2019. The study itself noted that the virus has significantly less binding affinity than SARS-CoV-2."
    },
    {
        "title": "Pamela Anderson on reclaiming her life and career, and her new film The Last Showgirl",
        "description": "Pamela Anderson is one of the most recognisable faces in Hollywood.",
        "url": "https://news.sky.com/story/pamela-anderson-on-reclaiming-her-life-and-career-and-her-new-film-the-last-showgirl-13313964",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pamela-anderson-the-last-showgirl_6835613.jpg?20250221141558",
        "type": "Entertainment",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-02-22 00:01:00",
        "Headline": "Former Baywatch star Pamela Anderson returns to the screen in her new film The Last Showgirl alongside Jamie Lee Curtis, Brenda Song, Kiernan Shipka and Dave Bautista.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n  Pamela Anderson is one of the most recognisable faces in Hollywood. Ever since she was spotted on the huge jumbotron screen at a baseball game aged 21, her physical traits have been the overriding subject the world has focused on. Now 57, the actress and model is claiming back her life, her story and forging a new path in her career. \"I feel so free,\" she tells Sky News during a conversation in a London hotel about her latest film The Last Showgirl. \"I write a lot of emotional journals and there's a lot that you can get out. You can go to therapy, or you can talk to your best friend, but there's nothing like an art project to express yourself and heal parts of yourself.\" The Last Showgirl follows a seasoned entertainer who has to plan for her future when her Las Vegas show abruptly ends after a 30-year run. The role almost slipped from her fingers when her old agent passed on the script. \"I have a new agent now,\" she says with a smile. It was her son Brandon who served as a catalyst in her career resurgence after stumbling upon the screenplay and showing it to his mother. \"My sons are so protective of me and their goal is just to say: 'Mom, we just want you to be able to know that you focused on us as kids and we want you to have the opportunity to shine and to reach your potential as an actress'.\" She adds: \"I do have a lot to give, so now I just feel so free. I couldn't have done anything like this when I had kids because my focus was with them. Now that they're grown and they're doing well and they're thriving, that gives me the opportunity to be able to play in this universe.\" The Canadian-American has been the victim of many harsh headlines over the years with her most challenging moments played out in front of the world. One of the toughest moments, when her sex tape with her ex-husband Tommy Lee was leaked, ended up being made into its own TV series starring Oscar nominee Sebastian Stan and English actress Lily James. Anderson had no input in the show and repeatedly called for it to be scrapped. Anderson says that despite the adversity and misogyny she has faced being in the public eye, she feels ready to take on the spotlight again. This time on her terms. \"It was hard for me decades ago, and now I can look at it as a learning experience. And it was a different time. I think that looking at it through my kids' eyes was interesting. \"Talking to my adult children about having a mom who was, you know, objectified in some way and how that felt [for them] and how that shaped them and their experience growing up, being teased in school.\" Her sons, Brandon and Dylan, are now both in their late 20s. Drawing similarities to her character Shelly in The Last Showgirl, Anderson says the film serves as a reflection of the sacrifices, external expectations and realities connected to being a woman and a mother. \"We're doing the best we can with the tools that we have and what we've seen growing up. And there's no perfect way to be a parent, there really isn't - and especially in this industry. \"When I did Playboy, when I was in Baywatch, I wasn't thinking about how it was affecting my kids. I was thinking about just keeping the lights on and living this exciting life and getting through it myself. \"But, you know, it affects everybody around you - your parents, your friends, your kids - and so to kind of look at it from that way [in The Last Showgirl] and to have empathy for the character of Shelly dealing with that... I had some experience to draw from.\" The film also stars Jamie Lee Curtis, Brenda Song and Kiernan Shipka as her close friends and co-workers in a fading corner of the Las Vegas strip. Anderson adds of the film: \"I think this can resonate with any working mom. We all carry this guilt and shame and wish we would have done this or that. And we have to be happy, too.\" The Last Showgirl is out in UK cinemas from Friday 28 February."
    }
]