[
    {
        "title": "Trump to lift sanctions on Syria - as he announces $600bn deal with Saudi Arabia",
        "description": "Donald Trump has said the US will lift long-standing sanctions on Syria and signed a $600bn (&#163;450bn) deal with Saudi Arabia as he visited the nation as part of a tour of the Middle East.",
        "url": "https://news.sky.com/story/trump-to-lift-sanctions-on-syria-as-he-announces-600bn-deal-with-saudi-arabia-13367368",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-saudi-arabia_6915419.jpg?20250513165505",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-13 19:02:00",
        "Headline": "The US president was speaking at a US-Saudi investment conference during a four-day trip to the Middle East.",
        "Content": "Donald Trump has said the US will lift long-standing sanctions on Syria and signed a $600bn (Â£450bn) deal with Saudi Arabia as he visited the nation as part of a tour of the Middle East. The US president revealed the US plans to lift sanctions on Syria following talks with Saudi Arabia's Crown Prince Mohammed bin Salman and Turkish leader Recep Tayyip Erdogan. Mr Trump was speaking at the US-Saudi investment conference during a four-day trip to the region. Analysis: US-Saudi relationship feels tighter than ever as Trump signs flurry of deals  The comments follow Air Force One being escorted by Royal Saudi Air Force F-15s as it approached the kingdom's capital, with Mr Trump welcomed by the crown prince, Saudi's de facto ruler, as he stepped off the plane. President Trump said the relationship between the were nations were \"stronger and more powerful than ever before\", adding it would \"remain that way\".  'Largest defence cooperation agreement' Mr Trump and Prince Mohammed signed several agreements aimed at increasing cooperation between their governments, including a commitment to $600bn in new Saudi investment in the US - though Mr Trump said a trillion dollars (Â£750bn) would be even better. The US also agreed to sell Saudi Arabia an arms package worth nearly $142bn (Â£107bn), which the White House called \"the largest defence cooperation agreement\" Washington has ever done. In his speech, President Trump also urged Iran to take a \"new and a much better path\" and make a new nuclear deal with the US. Speaking at the conference, Mr Trump said he wants to avoid a conflict with Iran but warned of \"maximum pressure\" if his olive branch was rejected. \"As I have shown repeatedly, I am willing to end past conflicts and forge new partnerships for a better and more stable world, even if our differences may be profound,\" he said. \"If Iran's leadership rejects this olive branch... we will have no choice but to inflict massive maximum pressure, drive Iranian oil exports to zero.\" He added: \"Iran will never have a nuclear weapon. But with that said, Iran can have a much brighter future, but we'll never allow America and its allies to be threatened with terrorism or nuclear attack. The choice is theirs to make.\" Read more:Why Trump's idea of using a Qatari jet has faced criticismTrump 'thinking' of going to proposed Zelenskyy-Putin peace talks Normalising relations with Syria Mr Trump said he would ease US sanctions on Syria and move to normalise relations with its new government ahead of a meeting with its new leader Ahmad al Sharaa on Wednesday. The Syrian president was formerly an insurgent who led the overthrow of former leader Bashar al Assad last year. Mr Trump said he wants to give the country \"a chance at peace\" and added: \"There is a new government that will hopefully succeed. I say good luck, Syria. Show us something special.\"  The US leader also said he hoped Saudi Arabia would soon join the Abraham Accords and recognise Israel \"in your own time\". Saudi Arabia has argued its recognition of Israel would be tied to the establishment of a Palestinian state along the lines of Israel's 1967 borders. Mr Trump will travel to Qatar and the United Arab Emirates over the next three days."
    },
    {
        "title": "US-Saudi relationship feels tighter than ever as Trump signs flurry of deals",
        "description": "In today's Saudi Arabia, convention centres resemble palaces.&#160;",
        "url": "https://news.sky.com/story/us-saudi-relationship-feels-tighter-than-ever-as-trump-signs-flurry-of-deals-13367279",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-mohammed-bin-salman_6915608.jpg?20250513213622",
        "type": "Home",
        "Author": "Mark Stone",
        "Date Published": "2025-05-13 16:04:00",
        "Headline": "There are huge challenges like Gaza, but President Trump and Saudi Crown Prince Mohammed bin Salman see big opportunities too. A deal with Iran, a new Syria, and Gulf countries that are global players.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n In today's Saudi Arabia, convention centres resemble palaces.Â  The King Abdul Aziz International Conference Centre was built in 1999 but inside it feels like Versailles. Some might call it kitsch, but it's a startling reflection of how far this country has come - the growth of a nation from desert bedouins to a vastly wealthy regional powerbroker in just one generation. Trump latest: President signs huge arms deal with Saudi Arabia  At a bar overnight, over mocktails and a shisha, I listened to one young Saudi man tell me how his family had watched this transformation. His father, now in his 60s, had lived the change - a child born in a desert tent, an upbringing in a dusty town, his 30s as a mujahideen fighting the Soviets in Afghanistan, his 40s in a deeply conservative Riyadh and now his 60s watching, wide-eyed, the change supercharged in recent years. The last few years' acceleration of change is best reflected in the social transformation. Women, unveiled, can now drive. But that's just the headline. The depth of change has been astonishing. Laws governing every aspect of women's lives have been ripped up. They can work in every industry, and the government. A few years ago they couldn't watch a football match. Now, as the Kingdom prepares for the World Cup, there is a female football league. The leaps forward into international norms have been profound. Through a 'western' lens, there's a way to go - homosexuality is illegal. Political dissent is firmly off limits and the murder of Saudi journalist Jamal Khashoggi is absolutely not openly discussed here. Bluntly, political and economic expedience have moved world leaders and business leaders beyond all that. Read more:Why Trump's idea of using a Qatari jet has faced criticismTrump 'thinking' of going to proposed Zelenskyy-Putin peace talks  The guest list of delegates at the convention centre for the Saudi-US Investment Forum reads like a who's who of America's best business brains. Signing a flurry of different deals worth about $600bn (Â£451bn) of inward investment from Saudi to the US - which actually only represent intentions or 'memorandums of understanding' at this stage - the White House said: \"The deals... represent a new golden era of partnership between the United States and Saudi Arabia. \"From day one, President Trump's America First Trade and Investment Policy has put the American economy, the American worker, and our national security first.\" That's the answer when curious voters in faraway America wonder what this is all about. With opulence and extravagance, this is about a two-way investment and opportunity. There are defence deals - the largest defence sales agreement in history, at nearly $142bn (Â£106bn) - tech deals, and energy deals. Underlying it all is the expectation of diplomatic cooperation, investment to further the geopolitical strategies for both countries on key global challenges.  In the convention centre's gold-clad corridors, outside the plenary hall, there are reminders of the history of this relationship. There is a 'gallery of memories' - the American presidents with the Saudi kings - stretching back to the historic 1945 meeting between Franklin D Roosevelt and King Saud on board the USS Quincy. That laid the foundation for the relationship we now see. Curiously, the only president missing is Barack Obama. Sources suggested to me that this was a 'mistake'. A convenient one, maybe. It's no secret that the US-Saudi relationship was at its most strained during his presidency. Obama's absence would give Trump a chuckle.  Today, the relationship feels tighter than ever. There is a mutual respect between the president and Saudi Crown Prince Mohammed bin Salman - Trump chose Saudi Arabia as his first foreign trip in his last presidency, and he's done so again. But there are differences this time. Both men are more powerful, more self-assured, and of course the region has changed. There are huge challenges like Gaza, but the two men see big opportunities too. A deal with Iran, a new Syria, and Gulf countries that are global players. It's money, money, money here in Riyadh. Will that translate to a better, more prosperous and peaceful world? That's the question."
    },
    {
        "title": "Cassie tells court 'freak offs' became like a job as she alleges years of abuse by Sean 'Diddy' Combs",
        "description": "Sean \"Diddy\" Combs's former girlfriend Cassie has told his sex-trafficking trial that \"freak offs\" with male escorts became like a job, as the music mogul allegedly abused and sexually exploited her for years.",
        "url": "https://news.sky.com/story/cassie-tells-court-freak-offs-became-like-a-job-as-she-alleges-years-of-abuse-by-sean-diddy-combs-13367399",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cassie-sean-diddy-combs_6915488.jpg?20250513182306",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-13 20:15:00",
        "Headline": "During the second day of evidence in the Sean Combs sex-trafficking trial, his former partner Cassie, who is eight months pregnant, spent about six hours on the witness stand, alleging she was degraded and sexually abused for years - which he denies. Her evidence continues on Wednesday.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Sean \"Diddy\" Combs's former girlfriend Cassie has told his sex-trafficking trial that \"freak offs\" with male escorts became like a job, as the music mogul allegedly abused and sexually exploited her for years. The musician and model, whose full name is Casandra Ventura, did not look at Combs as she took to the witness stand in court in Manhattan, New York. Over about six hours, the 38-year-old, who is eight months pregnant with her third child with husband Alex Fine, at times became emotional as she alleged she was degraded by her former partner during their 10-year on-off relationship. Sean 'Diddy' Combs trial: Day 2 - As it happened  Combs, 55, has pleaded not guilty and strenuously denied allegations of sexual abuse. His lawyers argue that although he could be violent, he never veered into sex trafficking and racketeering, and that all sexual encounters were consensual. Ms Ventura, who is the central witness in the prosecutors' case, began by telling the jury how Combs was violent to her over the course of their relationship, giving her black eyes and bruises. The hip-hop star became increasingly controlling, she said, and was allegedly abusive over the smallest perceived slights. \"You make the wrong face, and the next thing I knew I was getting hit in the face,\" she said. Ms Ventura was 19 when she signed to his label, Bad Boy, she said, and 22 when, during the first year of their relationship, Combs first proposed a \"freak off\" - a sexual encounter with a third party. Her \"stomach churned\", she said, and she was \"confused, nervous, but also loved him very much\" and wanted to please him. She described him as \"charming\" but \"polarising\".  'There was no space to do anything else' Throughout her time on the stand, she gave graphic details of these drug and drink-fuelled encounters with male escorts, saying Combs would watch and masturbate, and often record the encounters and watch the videos back. They could last for hours or even days, she said - telling the court the longest went on for four days. They ended up becoming weekly events and took priority over her music career, jurors heard. While she had hits with singles Me & U and Long Way 2 Go in 2006, and signed a 10-album deal with Bad Boy, jurors heard she only released one album. \"Freak-offs became a job where there was no space to do anything else but to recover and just try to feel normal again,\" Ms Ventura said. Each time, she added, she had to recuperate from lack of sleep, alcohol, drugs \"and other substances\", and \"having sex with a stranger for days\". Read more:The rise and fall of Sean CombsDiddy - a timeline of allegationsEverything you need to know about the trial Alleged violence detailed in court Ms Ventura told the court she began feeling as if she could not say no to Combs's demands because \"there were blackmail materials to make me feel like if I didn't do it, it would be held over my head in that way or these things would become public\". She was also worried about potential violence, she told the court. When asked in court how frequently Combs became violent with her, Ms Ventura responded: \"Too frequently.\" The rapper \"would mash me in the head, knock me over, drag me, kick me\", she said. \"Stomp me in the head if I was down\". Ms Ventura also told the court that Combs kept cash, jewellery, guns and \"sometimes tapes from cameras\" in safes at several properties in New York, Los Angeles, Miami and Alpine, New Jersey. \"The guns came out here and there. I always felt it was a little bit of a scare tactic,\" she told the court. Towards the end of her first day of evidence, a surveillance video made public last year, which showed Combs allegedly beating Ms Ventura at a Los Angeles hotel in 2016, was played to jurors in court for a second time. \"How many times has he thrown you like that before?\" prosecutor Emily Johnson asked her. \"Too many to count,\" Ms Ventura replied. On Monday, prosecutors in their opening statement told the court that while Combs's public persona was that of a \"charismatic\" hip-hop mogul, behind the scenes he was violent and abusive. His defence lawyers argued that the case is really about nothing more than the rapper's sexual preferences, which they said should remain private, and do not make him a sex trafficker. The trial is to last about eight weeks. Ms Ventura is set to continue giving evidence on Wednesday."
    },
    {
        "title": "Royal College of Psychiatrists pulls support for assisted dying bill",
        "description": "The Royal College of Psychiatrists (RCP) has pulled its support for the assisted dying bill.",
        "url": "https://news.sky.com/story/royal-college-of-psychiatrists-pulls-support-for-assisted-dying-bill-13367456",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-assisted-dying-euthansia_6746051.jpg?20250514024838",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-13 23:55:00",
        "Headline": "The announcement from the Royal College of Psychiatrists is a blow to supporters of the bill because under an amendment, a psychiatrist would be on the expert panel to assess assisted dying cases.",
        "Content": "The Royal College of Psychiatrists (RCP) has pulled its support for the assisted dying bill. The announcement is a blow to supporters of the bill ahead of its return to the House of Commons on Friday. It comes as plans to legalise assisted dying in Scotland passed the first stage this week. Dr Lade Smith, president of the RCP, said: \"The RCP has reached the conclusion that we are not confident in the Terminally Ill Adults Bill in its current form, and we therefore cannot support the Bill as it stands.\" The move is significant because, under the bill's current stipulations, a panel including a psychiatrist would oversee assisted dying cases. The RCP outlined a number of issues it had with the current bill, including: the bill not making provision for unmet needs, whether assisted suicide is classed as a treatment or not, what the psychiatrists' specific role on the panel would be, and the increased demand the bill puts on psychiatrists. If the college support remains withdrawn, and the bill passes, it isn't clear what effects it may have. \n                  Plans to legalise assisted dying in Scotland pass first stage\n                 \n                  MSPs to vote on assisted dying in Scotland\n                 \n                  Assisted Dying: Hundreds would seek to use service in first year of it being available, government report finds\n                 Kim Leadbeater, the MP behind the bill, has confirmed it will include a clause that means anyone who does not want to be involved in the process will not have to do so. Supporters of the bill argue it would ease the suffering of dying people, while opponents argue it would fail to safeguard some of the most vulnerable people in society. Questions over the bill The more prominent role of a psychiatrist in the bill came about after a previous amendment. Initially, the bill said that after two independent doctors approved an assisted dying case, it would then need to be further approved by a High Court judge. Read more from Sky News:'Sixteen killed' in Israeli strike on Gaza hospitalMenendez brothers' murder sentences reducedPM rejects Enoch Powell comparison But MPs on the parliamentary committee scrutinising the bill voted to remove that clause in March. Instead, Ms Leadbeater proposed a voluntary assisted dying commissioner that included an expert panel with a psychiatrist. She said this was a \"strength, not a weakness,\" but opponents of the bill disagreed, saying removing the High Court judge \"fundamentally weakens protections for the vulnerable\". However, amid changes and amendments to the original bill, there has been growing concern about safeguarding and timeframes, Sky News political correspondent Ali Fortescue reported. Friday's debate was already delayed from 25 April, to give MPs more time to consider amendments. If the bill passes on Friday, it will move to the House of Lords, where it will undergo similar legislative stages, and if it passes that too, it won't come into effect until at least 2029, after its implementation was delayed."
    },
    {
        "title": "'Sixteen killed' in strike on Gaza hospital as Israel says it hit 'Hamas command centre below'",
        "description": "At least 16 people have been killed and 70 others were injured at a hospital in Gaza following an Israeli strike, according to the health ministry.",
        "url": "https://news.sky.com/story/sixteen-killed-in-strike-on-gaza-hospital-as-israel-says-it-hit-hamas-command-centre-below-13367379",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-european-hospital-gaza_6915654.jpg?20250513223324",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-13 19:38:00",
        "Headline": "Nine missiles struck the European Hospital and its courtyard in the south of the Palestinian territory, health officials said.",
        "Content": " At least 16 people have been killed and 70 others were injured at a hospital in Gaza following an Israeli strike, according to the health ministry. Nine missiles hit the European Hospital and its courtyard in the south of the Palestinian territory, officials said. Israel said it had hit a \"Hamas command centre\" beneath the hospital in Khan Younis. Hamas denies exploiting hospitals and civilian properties for military purposes. Middle East latest - Trump signs Saudi arms deal Earlier, a well-known Palestinian photojournalist died following a separate attack on the Nasser Hospital, also in Khan Younis, said the ministry. Hassan Aslih had been accused by Israel of working with Hamas and was recovering from an earlier airstrike. \n                  Could Putin, Zelenskyy and Trump really meet?  \n                 \n                  Ukraine, Gaza and China: Why Trump's Middle East tour takes on new importance\n                 \n                  Trump set for truly consequential week for his presidency and his ability to effect change\n                 Aslih, who has hundreds of thousands of followers on social media, was said by the Israelis to have recorded and uploaded footage of \"looting, arson and murder\" during Hamas's 7 October 2023 attack into Israel that triggered the war in Gaza. Aslih was one of two patients who died in Tuesday's strike on Nasser Hospital, said the health ministry. Several others were wounded. Dozens of people were being treated on the third floor of the hospital building, where the missiles struck, Reuters said, quoting Ahmed Siyyam, a member of Gaza's emergency services. The Israeli military said it \"eliminated significant Hamas terrorists\" in Nasser Hospital, among them Aslih, who it said had \"operated under the guise of a journalist\". Footage showed heavy damage to one of the hospital buildings, including to medical equipment and beds inside. At least 160 journalists and media workers have been killed in Gaza since the start of the war, according to the International Federation of Journalists. Gazan officials accuse Israel of deliberately targeting journalists. Israel denies this and says it tries to avoid harm to civilians. Aslih, who headed the Alam24 news outlet and had previously worked with Western news outlets, was recovering after being wounded last month in a deadly strike on a tent in the Nasser Hospital compound. Read more:Timeline: Key events of war in GazaPope raises Gaza in Sunday message Meanwhile, President Trump has spoken on the phone to Edan Alexander after he was released by Hamas on Monday, as part of ongoing efforts to achieve a permanent ceasefire with Israel. The 21-year-old was believed to be the last living American hostage in Gaza. Some 1,200 people were killed and 251 taken hostage in the 7 October attack on southern Israel, according to Israeli figures. Israel's response has killed more than 52,000 Palestinians, according to local health officials, and destroyed much of the coastal territory. Gaza's health ministry records do not distinguish between civilians and combatants. An aid blockade since March has left the population at critical risk of famine, according to the World Health Organisation, which warned on Tuesday that hunger and malnutrition could have a lasting impact on \"an entire generation\"."
    },
    {
        "title": "Peter Sullivan who has spent 38 years in jail for murder has conviction quashed",
        "description": "A man who has spent 38 years in prison for murder has had his conviction quashed - but insisted he is \"not angry\" or \"bitter\".",
        "url": "https://news.sky.com/story/peter-sullivan-who-has-spent-38-years-in-jail-for-murder-has-conviction-quashed-13363928",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-diane-sindall-peter-sullivan_6910154.jpg?20250508162400",
        "type": "Home",
        "Author": "Greg Milam",
        "Date Published": "2025-05-13 09:00:00",
        "Headline": "The Court of Appeal ruling ends what's thought to be the longest-running miscarriage of justice in British history.",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n  A man who has spent 38 years in prison for murder has had his conviction quashed - but insisted he is \"not angry\" or \"bitter\". The Court of Appeal ruling in the case of Peter Sullivan ends what's thought to be the longest-running miscarriage of justice in British history. He was found guilty of the 1986 murder of 21-year-old Diane Sindall, who had been beaten, raped and left in an alleyway in Birkenhead, Merseyside. Mr Sullivan - who was jailed in 1987 - had always maintained his innocence and first tried to challenge his conviction in 2016, but the Criminal Cases Review Commission (CCRC) declined to refer the case, and he lost his own appeal bid in 2019. Two years later, he again asked the CCRC to refer his case and new tests, ordered by the commission, revealed Mr Sullivan's DNA was not present on samples preserved at the time. At a hearing on Tuesday, lawyers for Mr Sullivan told the Court of Appeal in London that the new evidence showed that Ms Sindall's killer \"was not the defendant\". Mr Sullivan attended the hearing via video link from HMP Wakefield, listening to his conviction being quashed with his head down and arms folded before appearing to weep and putting his hand to his mouth. A relative in court also wept as the judgment was read out. 'The truth shall set you free' In a statement following the ruling, Mr Sullivan - now 68 - said: \"I lost my liberty four decades ago over a crime I did not commit. \"What happened to me was very wrong, but does not detract that what happened... was a heinous and most terrible loss of life.\"  He added: \"It is said the truth shall set you free. It is unfortunate that it does not give a timescale as we advance towards resolving the wrongs done to me. \"I am not angry, I am not bitter. \"I am simply anxious to return to my loved ones and family as I've got to make the most of what is left of the existence I am granted in this world.\" Outside court, Mr Sullivan's sister Kim Smith said she was \"ecstatic\" at seeing her brother's conviction quashed. She told reporters: \"We lost Peter for 39 years and at the end of the day, it's not just us; Peter hasn't won, and neither has the Sindall family. They've lost their daughter, they are not going to get her back. \"We've got Peter back and now we've got to try and build a life around him again. We feel sorry for the Sindalls and it's such a shame this has had to happen in the first place.\" Barristers for the Crown Prosecution Service (CPS) said the DNA evidence was \"sufficient fundamentally to cast doubt on the safety of the conviction\" and that there was \"no credible basis on which the appeal can be opposed\". Lord Justice Holroyde, sitting with Mr Justice Goss and Mr Justice Bryan, said in light of the new DNA evidence \"it is impossible to regard the appellant's conviction as safe\" as he quashed the conviction. Hunt for DNA match Merseyside Police has confirmed detectives are now \"carrying out an extensive investigation in a bid to identify who the new DNA profile belongs to, as to date there is no match on the national DNA database\". Detectives are also contacting individuals identified in the original investigation to request voluntary DNA samples. That initial investigation was the largest in the force's history and, for many officers, the \"frenzied\" nature of the attack made it the worst case they had ever encountered. Ms Sindall, who was engaged to be married, had just left her shift as a part-time barmaid at a pub in Bebington when her small blue van ran out of petrol. She was walking to an all-night garage when she was attacked. Mr Sullivan, who was 29 at the time and described as a loner, initially denied the attack but later signed a confession. Questions have since been raised about whether he had proper legal representation during police interviews. Evidence related to bite marks on Ms Sindall's body, considered crucial at the trial, has also since been called into question. At the time of Mr Sullivan's trial in 1987, DNA technology was not available and subsequent requests for new tests had been refused. 'Nobody felt safe' On the grass verge close to where Ms Sindall's body was found, a memorial stone has been placed in memory of her and \"and all of our sisters who have been raped and murdered\". Her murder sent a chill through the community and led to the creation of the Rape and Sexual Abuse Centre on Merseyside. \"Nobody felt safe, it was a very scary time,\" said the centre's Jo Wood. She says the uncertainty has resurfaced. \"There's someone out who killed Diane Sindall,\" said solicitor Ms Myatt. \"The biggest fear we've got is of the unknown and now we've got an unknown. We don't know who it might be. Who knows who this person is? Are we going to encounter him? \"We might have encountered him, we don't know, we just know that he's out there.\" Ms Sindall's family told Sky News they did not want to comment on the case. Mel John, landlord of the pub where Ms Sindall worked on the night of her death, said: \"I'm glad he's being released if he's innocent. It has been a long time.\" Mr Sullivan is also aware, his solicitor says, of the impact on Ms Sindall's family. \"We are very sensitive and respectful to the fact that there is a victim, Diane Sindall and her family, that will be affected by this process,\" the solicitor said."
    },
    {
        "title": "Civil service relocation and AI officials at heart of government cost cutting measures",
        "description": "AI civil servants and sending human workers out of London are at the heart of the government's plans to cut costs and reduce the size of the state bureaucracy.",
        "url": "https://news.sky.com/story/civil-service-relocation-and-ai-officials-at-heart-of-government-cost-cutting-measures-13367237",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-whitehall-civil-service_6915406.jpg?20250513164224",
        "type": "Home",
        "Author": "Tim Baker",
        "Date Published": "2025-05-13 15:02:00",
        "Headline": "Saving money from the civil service is a key part of the Labour government's attempts to reduce state spending. Conservatives attempts to reduce the number of officials failed after numbers soared during COVID.",
        "Content": "\n          Political reporter\n       AI civil servants and sending human workers out of London are at the heart of the government's plans to cut costs and reduce the size of the state bureaucracy. Shrinking the civil service has been a target of both the current Labour and recent Conservative governments - especially following the growth in the organisation during the pandemic. From a low in 2016 of 384,000 full time workers, in 2024 there were 513,000 civil servants. Politics latest: Your views on PM's migration speech The Department for Science, Innovation and Technology is claiming a new swathe of tools to help sift information submitted to public consultations could save \"75,000 days of manual analysis every year\" - roughly the work of 333 civil servants. However, the time saved is expected to free up existing civil servants to do other work. The suite of AI tools are known as \"Humphrey\", after Humphrey Appleby, the fictional civil servant in the TV comedy Yes, Prime Minister. The government has previously said the introduction of AI would help reduce the civil service headcount - with hopes it could save as much as Â£45bn. Speaking today, Technology Secretary Peter Kyle appeared to take aim at expensive outsourcing contracts, saying: \"No one should be wasting time on something AI can do quicker and better, let alone wasting millions of taxpayer pounds on outsourcing such work to contractors.\"  Move outside of London Other money-saving plans announced today include moving 12,000 civil servants out of London and into regional hubs - with the government hoping it can save almost Â£100m by 2032 by not having to pay for expensive leases of prime office space in the capital. Currently, 95,000 full time civil servants work in London. Tens of millions of pounds a year are expected to be saved by the closure of 102 Petty France, which overlooks St James's Park, and 39 Victoria Street, which is near the previous location of New Scotland Yard. In total, 11 London offices are slated for closure, with workers being relocated to the likes of Aberdeen, Belfast, Darlington, Bristol, Manchester and Cardiff. Read more:More than 1,000 officials to be cutPayouts for departing civil servants cappedReeves hints at 10,000 cuts'Almost certain' AI will lead to cuts The reforms of the civil service are being led by Chancellor of the Duchy of Lancaster Pat McFadden - one of Sir Keir Starmer's most influential ministers. Mr McFadden said: \"To deliver our plan for change, we are taking more decision-making out of Whitehall and moving it closer to communities all across the UK. \"By relocating thousands of civil service roles we will not only save taxpayers money, we will make this government one that better reflects the country it serves. We will also be making sure that government jobs support economic growth throughout the country. \"As we radically reform the state, we are going to make it much easier for talented people everywhere to join the civil service and help us rebuild Britain.\" The government says it wants senior civil servants out of the capital too - with the aim being that half of UK-based senior officials work in regional offices by the end of the decade. The government claims the relocations and growth of regional hubs could add as much as Â£729m to local economies by 2030. Union welcome - cautiously Unions appear to cautiously welcome the changes being proposed. All of Prospect, the PCS and the FDA say it is positive to see better opportunities outside of the capital. However, they have asked for clarity around whether roles may be lost and what will be offered to people transferring. ðŸ‘‰Listen to Politics at Sam and Anne's on your podcast appðŸ‘ˆ Fran Heathcote, the general secretary of the PCS union, said: \"If these government proposals are to be successful however, it's important they do the right thing by workers currently based in London. \"That must include guarantees of no compulsory redundancies, no compulsory relocations and access to more flexible working arrangements to enable them to continue their careers should they wish to do so.\""
    },
    {
        "title": "Peter Sullivan who has spent 38 years in jail for murder has conviction quashed",
        "description": "A man who has spent 38 years in prison for murder has had his conviction quashed - but insisted he is \"not angry\" or \"bitter\".",
        "url": "https://news.sky.com/story/peter-sullivan-who-has-spent-38-years-in-jail-for-murder-has-conviction-quashed-13363928",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-diane-sindall-peter-sullivan_6910154.jpg?20250508162400",
        "type": "UK",
        "Author": "Greg Milam",
        "Date Published": "2025-05-13 09:00:00",
        "Headline": "The Court of Appeal ruling ends what's thought to be the longest-running miscarriage of justice in British history.",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n  A man who has spent 38 years in prison for murder has had his conviction quashed - but insisted he is \"not angry\" or \"bitter\". The Court of Appeal ruling in the case of Peter Sullivan ends what's thought to be the longest-running miscarriage of justice in British history. He was found guilty of the 1986 murder of 21-year-old Diane Sindall, who had been beaten, raped and left in an alleyway in Birkenhead, Merseyside. Mr Sullivan - who was jailed in 1987 - had always maintained his innocence and first tried to challenge his conviction in 2016, but the Criminal Cases Review Commission (CCRC) declined to refer the case, and he lost his own appeal bid in 2019. Two years later, he again asked the CCRC to refer his case and new tests, ordered by the commission, revealed Mr Sullivan's DNA was not present on samples preserved at the time. At a hearing on Tuesday, lawyers for Mr Sullivan told the Court of Appeal in London that the new evidence showed that Ms Sindall's killer \"was not the defendant\". Mr Sullivan attended the hearing via video link from HMP Wakefield, listening to his conviction being quashed with his head down and arms folded before appearing to weep and putting his hand to his mouth. A relative in court also wept as the judgment was read out. 'The truth shall set you free' In a statement following the ruling, Mr Sullivan - now 68 - said: \"I lost my liberty four decades ago over a crime I did not commit. \"What happened to me was very wrong, but does not detract that what happened... was a heinous and most terrible loss of life.\"  He added: \"It is said the truth shall set you free. It is unfortunate that it does not give a timescale as we advance towards resolving the wrongs done to me. \"I am not angry, I am not bitter. \"I am simply anxious to return to my loved ones and family as I've got to make the most of what is left of the existence I am granted in this world.\" Outside court, Mr Sullivan's sister Kim Smith said she was \"ecstatic\" at seeing her brother's conviction quashed. She told reporters: \"We lost Peter for 39 years and at the end of the day, it's not just us; Peter hasn't won, and neither has the Sindall family. They've lost their daughter, they are not going to get her back. \"We've got Peter back and now we've got to try and build a life around him again. We feel sorry for the Sindalls and it's such a shame this has had to happen in the first place.\" Barristers for the Crown Prosecution Service (CPS) said the DNA evidence was \"sufficient fundamentally to cast doubt on the safety of the conviction\" and that there was \"no credible basis on which the appeal can be opposed\". Lord Justice Holroyde, sitting with Mr Justice Goss and Mr Justice Bryan, said in light of the new DNA evidence \"it is impossible to regard the appellant's conviction as safe\" as he quashed the conviction. Hunt for DNA match Merseyside Police has confirmed detectives are now \"carrying out an extensive investigation in a bid to identify who the new DNA profile belongs to, as to date there is no match on the national DNA database\". Detectives are also contacting individuals identified in the original investigation to request voluntary DNA samples. That initial investigation was the largest in the force's history and, for many officers, the \"frenzied\" nature of the attack made it the worst case they had ever encountered. Ms Sindall, who was engaged to be married, had just left her shift as a part-time barmaid at a pub in Bebington when her small blue van ran out of petrol. She was walking to an all-night garage when she was attacked. Mr Sullivan, who was 29 at the time and described as a loner, initially denied the attack but later signed a confession. Questions have since been raised about whether he had proper legal representation during police interviews. Evidence related to bite marks on Ms Sindall's body, considered crucial at the trial, has also since been called into question. At the time of Mr Sullivan's trial in 1987, DNA technology was not available and subsequent requests for new tests had been refused. 'Nobody felt safe' On the grass verge close to where Ms Sindall's body was found, a memorial stone has been placed in memory of her and \"and all of our sisters who have been raped and murdered\". Her murder sent a chill through the community and led to the creation of the Rape and Sexual Abuse Centre on Merseyside. \"Nobody felt safe, it was a very scary time,\" said the centre's Jo Wood. She says the uncertainty has resurfaced. \"There's someone out who killed Diane Sindall,\" said solicitor Ms Myatt. \"The biggest fear we've got is of the unknown and now we've got an unknown. We don't know who it might be. Who knows who this person is? Are we going to encounter him? \"We might have encountered him, we don't know, we just know that he's out there.\" Ms Sindall's family told Sky News they did not want to comment on the case. Mel John, landlord of the pub where Ms Sindall worked on the night of her death, said: \"I'm glad he's being released if he's innocent. It has been a long time.\" Mr Sullivan is also aware, his solicitor says, of the impact on Ms Sindall's family. \"We are very sensitive and respectful to the fact that there is a victim, Diane Sindall and her family, that will be affected by this process,\" the solicitor said."
    },
    {
        "title": "Tory MP Patrick Spencer charged with sexual assaults at Groucho Club ",
        "description": "Conservative MP Patrick Spencer has been charged with two counts of sexual assault allegedly carried out at London's Groucho Club.",
        "url": "https://news.sky.com/story/tory-mp-patrick-spencer-charged-with-sexual-assaults-13367001",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-conservative-patrick-spencer_6915241.jpg?20250513142657",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-13 07:58:00",
        "Headline": "Lawyers acting for Patrick Spencer say he \"categorically denies\" the allegations relating to two different women in August 2023.",
        "Content": "Conservative MP Patrick Spencer has been charged with two counts of sexual assault allegedly carried out at London's Groucho Club. The charges follow two alleged incidents involving two different women at the private members' club in Soho in August 2023, the Crown Prosecution Service (CPS) said. Follow live politics updates: Your views on Starmer's migration speech Spencer - who is the MP for Central Suffolk and North Ipswich - is due to appear at Westminster Magistrates' Court on Monday 16 June. The 37-year-old's lawyers said he \"categorically denies\" the charges and \"will defend the allegations robustly in court\". A Conservative Party spokesman said Spencer has been suspended by the Tories and had the whip withdrawn. The Metropolitan Police said he was charged after attending a voluntary interview at a London police station on 13 March this year. Frank Ferguson, head of the CPS special crime and counter terrorism division, said: \"Following a review of the evidence provided by the Metropolitan Police Service, we have authorised two counts of sexual assault against Patrick Spencer MP. \"The charges follow two alleged incidents involving two separate women at the Groucho Club in central London in August 2023. \"The Crown Prosecution Service reminds all concerned that criminal proceedings against this defendant are now active and that he has the right to a fair trial. \"It is extremely important that there should be no reporting, commentary or sharing of information online which could in any way prejudice these proceedings.\" Spencer was first elected to Parliament last year with a majority of 4,290. It is understood he was asked not to attend the parliamentary estate by the Tory chief whip while police enquiries were ongoing. A Conservative Party spokesman said: \"The Conservative Party believes in integrity and high standards. We have taken immediate action. \"Patrick Spencer MP has been suspended from the Conservative Party, and the whip withdrawn, with immediate effect. \"The Conservative Party cannot comment further on an ongoing legal case.\" Read more from Sky News:Man who spent 38 years in jail for murder has conviction quashedThe online drug trade behind QR code stickers on UK streets The Groucho Club, in Dean Street, opened in 1985 and became a renowned meeting place for A-list celebrities and others, including actors, comedians and media executives. The club was named after the comedian and actor Groucho Marx, who reportedly once said he would refuse to join any club that would have him as a member. It was originally set up as a more relaxed alternative to traditional gentlemen's clubs, according to the venue's website, which adds that members should be in the creative industry \"and share the club's maverick spirit\". Before becoming an MP, Spencer worked in finance for private equity firm IPGL, a company chaired by his father, former Conservative Party treasurer Lord Michael Spencer. He later took a job at the Centre for Social Justice thinktank before becoming a senior adviser at the Department for Education. He made his maiden speech in the Commons in July last year during a debate on the MPs' code of conduct relating to second jobs, during which he said the \"most important thing to the people across my constituency\" was \"restoring a sense of moral probity and public spiritedness to our political system\". Lawyers acting for the MP said in a statement: \"Patrick Spencer categorically denies the charges. \"He has cooperated fully with the police investigation from the moment he became aware of it and he will defend the allegations robustly in court. \"Given that the proceedings are now on foot, no further comment will be made.\""
    },
    {
        "title": "Woman jailed after buying holidays and luxury gifts on company credit card",
        "description": "A woman who led a lavish lifestyle, funded by defrauding her company of more than &#163;184,000, has been jailed for five years and 10 months.",
        "url": "https://news.sky.com/story/woman-jailed-after-buying-holidays-and-luxury-gifts-on-company-credit-card-13367183",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-anita-mirmohammadi_6915239.jpg?20250513141837",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-13 13:11:00",
        "Headline": "Anita Mirmohammadi, 31, spent four years extracting money from her employer to fund trips to Mexico, Turkey and Dubai as well as high-end purchases at shops including Harrods, Selfridges and Mercedes Benz.",
        "Content": "A woman who led a lavish lifestyle, funded by defrauding her company of more than Â£184,000, has been jailed for five years and 10 months. Basildon Crown Court heard Anita Mirmohammadi, 31, of Temple Close in Finchley, north London, used a company credit card and submitted fraudulent invoices to extract money from the firm where she worked in Brentwood, Essex. She was able to fund luxury purchases at Harrods, Selfridges and Mercedes Benz, as well as holidays to Mexico, Turkey and Dubai. Following a seven-day trial, Mirmohammadi was found guilty of fraud by false representation and sentenced on Friday. The court heard she was hired as a manager in her employer's finance team in 2018, entitling her to a company credit card. But it was four years later, in April 2022, when her firm alerted police after carrying out unrelated fraud checks. Essex Police arrested Mirmohammadi at Gatwick Airport as she returned from holiday in Dubai on 22 May 2022. During her interview with officers, she answered no comment to all questions. In a statement, police said her company credit card was used to fund regular spending on Apple, Amazon, eBay, Uber and Zara, as well as Thames Water and Harley Street Dental. 'Selfish and self-obsessed' During sentencing, Judge Shane Collery said: \"She [Mirmohammadi] was not dependent on stealing to survive and her claim that she does care is hard to accept as she gave no thought to the consequences at all. \"She is a selfish, self-obsessed woman who repeated regular dishonesty, which was systemic and sustained and she must have seen what she was doing.\" Read more from Sky News:Murder conviction quashed after 38 yearsTory MP charged with sexual assaultsM&S says hackers stole personal data Detective Constable Karen Venables said: \"This was a calculated, ongoing fraud that would have continued had she not been caught. \"It was clear from the deception we found in these accounts that Mirmohammadi knew what she was doing was wrong and was trying to cover her tracks.\" Police said Â£184,675.89 was siphoned from the company - Â£126,381.19 by credit card and Â£63,294.70 from the business account via invoices. Officers said work was ongoing to identify criminal gains that can be confiscated from Mirmohammadi under the Proceeds of Crime Act. A confiscation hearing is scheduled for November at Basildon Crown Court."
    },
    {
        "title": "Goodison Park to become new home of Everton Women as stadium saved from demolition",
        "description": "Everton's women's team will play at Goodison Park from next season after the club scrapped plans to demolish it.",
        "url": "https://news.sky.com/story/goodison-park-will-become-new-home-of-everton-women-as-stadium-is-saved-from-demolition-13367318",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-everton-wsl-premier-league_6915475.jpg?20250513180741",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-13 16:59:00",
        "Headline": "Plans to demolish the ground and change the site into a mix of new homes, retail, leisure and office space had previously been submitted to Liverpool Council.",
        "Content": "Everton's women's team will play at Goodison Park from next season after the club scrapped plans to demolish it. The famous ground, which was the first major football stadium built in England, has been home to the club's men's side since it opened in 1892. The Toffees are moving to a newly-built stadium at Bramley-Moore Dock from the start of the 2025-26 season and the club has been deciding what to do with Goodison Park. Plans, referred to as the Goodison Legacy project, to demolish Goodison Park and develop the site into a mix of new homes, retail, leisure and office space had previously been submitted to Liverpool Council. The move to save the stadium comes after The Friedkin Group (TFG), the club's owners since December, assessed the project. The club said in a statement that after an \"in-depth review\", TFG decided that \"football must be kept at the heart of Everton's community\". The statement said the move \"addresses Everton Women's rapid growth and need for a larger, more suitable venue than Walton Hall Park\". \n                  Everton FC 'strongly condemns' death threats made against James Tarkowksi after Merseyside derby tackle\n                 \n                  Stake, Everton's shirt sponsor, will leave UK gambling market as advert investigated\n                 \n                  Everton vs Peterborough: Ashley Young 'gutted' after son left on bench for FA Cup tie\n                 It also means the ground will \"remain a central part of Liverpool's sporting and cultural identity\". The women's side currently play at nearby Walton Hall Park, a little over a mile away. Everton captain Megan Finnigan said the move to a stadium that has hosted Premier League football showed \"where the women's game is right now and, more importantly, where it is heading\". She said Goodison Park was \"a magical stadium with a deep heritage and close ties to the local community\". \"Leading the team out for that first home match of next season will be nothing short of a career highlight - and the prospect of what Everton Women can become with such an iconic ground to call our home is hugely exciting.\" Everton chief executive Angus Kinnear said: \"We know how treasured Goodison is, not only to every Evertonian but to the game itself, and being able to keep such an iconic stadium at the heart of the legacy project is something that has been incredibly important to us. \"The women's game has grown significantly in recent years and we believe that growth will continue and accelerate.\" Read more on Sky News:Innocent man freed after 38 years in jailMP charged with sex assaultsWiggins reveals cocaine addiction Julie Makin, secretary of the Everton Women Supporters' Club, said it was \"a real statement of intent, which shows just how committed they are to backing the women's team and making Everton a force at the very top of the women's game in this country, once again\". Goodison Park will also stage some academy matches, while there will be a programme of stadium upgrades ahead of the new season."
    },
    {
        "title": "Civil service relocation and AI officials at heart of government cost cutting measures",
        "description": "AI civil servants and sending human workers out of London are at the heart of the government's plans to cut costs and reduce the size of the state bureaucracy.",
        "url": "https://news.sky.com/story/civil-service-relocation-and-ai-officials-at-heart-of-government-cost-cutting-measures-13367237",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-whitehall-civil-service_6915406.jpg?20250513164224",
        "type": "UK",
        "Author": "Tim Baker",
        "Date Published": "2025-05-13 15:02:00",
        "Headline": "Saving money from the civil service is a key part of the Labour government's attempts to reduce state spending. Conservatives attempts to reduce the number of officials failed after numbers soared during COVID.",
        "Content": "\n          Political reporter\n       AI civil servants and sending human workers out of London are at the heart of the government's plans to cut costs and reduce the size of the state bureaucracy. Shrinking the civil service has been a target of both the current Labour and recent Conservative governments - especially following the growth in the organisation during the pandemic. From a low in 2016 of 384,000 full time workers, in 2024 there were 513,000 civil servants. Politics latest: Your views on PM's migration speech The Department for Science, Innovation and Technology is claiming a new swathe of tools to help sift information submitted to public consultations could save \"75,000 days of manual analysis every year\" - roughly the work of 333 civil servants. However, the time saved is expected to free up existing civil servants to do other work. The suite of AI tools are known as \"Humphrey\", after Humphrey Appleby, the fictional civil servant in the TV comedy Yes, Prime Minister. The government has previously said the introduction of AI would help reduce the civil service headcount - with hopes it could save as much as Â£45bn. Speaking today, Technology Secretary Peter Kyle appeared to take aim at expensive outsourcing contracts, saying: \"No one should be wasting time on something AI can do quicker and better, let alone wasting millions of taxpayer pounds on outsourcing such work to contractors.\"  Move outside of London Other money-saving plans announced today include moving 12,000 civil servants out of London and into regional hubs - with the government hoping it can save almost Â£100m by 2032 by not having to pay for expensive leases of prime office space in the capital. Currently, 95,000 full time civil servants work in London. Tens of millions of pounds a year are expected to be saved by the closure of 102 Petty France, which overlooks St James's Park, and 39 Victoria Street, which is near the previous location of New Scotland Yard. In total, 11 London offices are slated for closure, with workers being relocated to the likes of Aberdeen, Belfast, Darlington, Bristol, Manchester and Cardiff. Read more:More than 1,000 officials to be cutPayouts for departing civil servants cappedReeves hints at 10,000 cuts'Almost certain' AI will lead to cuts The reforms of the civil service are being led by Chancellor of the Duchy of Lancaster Pat McFadden - one of Sir Keir Starmer's most influential ministers. Mr McFadden said: \"To deliver our plan for change, we are taking more decision-making out of Whitehall and moving it closer to communities all across the UK. \"By relocating thousands of civil service roles we will not only save taxpayers money, we will make this government one that better reflects the country it serves. We will also be making sure that government jobs support economic growth throughout the country. \"As we radically reform the state, we are going to make it much easier for talented people everywhere to join the civil service and help us rebuild Britain.\" The government says it wants senior civil servants out of the capital too - with the aim being that half of UK-based senior officials work in regional offices by the end of the decade. The government claims the relocations and growth of regional hubs could add as much as Â£729m to local economies by 2030. Union welcome - cautiously Unions appear to cautiously welcome the changes being proposed. All of Prospect, the PCS and the FDA say it is positive to see better opportunities outside of the capital. However, they have asked for clarity around whether roles may be lost and what will be offered to people transferring. ðŸ‘‰Listen to Politics at Sam and Anne's on your podcast appðŸ‘ˆ Fran Heathcote, the general secretary of the PCS union, said: \"If these government proposals are to be successful however, it's important they do the right thing by workers currently based in London. \"That must include guarantees of no compulsory redundancies, no compulsory relocations and access to more flexible working arrangements to enable them to continue their careers should they wish to do so.\""
    },
    {
        "title": "I was worth my six-figure bonus, says under-fire Thames Water boss",
        "description": "Thames Water chief executive Chris Weston has apologised to customers and promised to turn the failing utility company around.&#160;",
        "url": "https://news.sky.com/story/i-was-worth-my-six-figure-bonus-says-under-fire-water-boss-13367301",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-thames-water-chris-weston_6915393.jpg?20250513163043",
        "type": "UK",
        "Author": "Liz Bates",
        "Date Published": "2025-05-13 16:31:00",
        "Headline": "Thames Water customers have faced significant service disruption in recent years, including a boil water notice in Bramley, near Guildford, last summer and a 40% rise in sewage spills in 2024.",
        "Content": "\n          Political correspondent\n              @wizbates\n  Thames Water chief executive Chris Weston has apologised to customers and promised to turn the failing utility company around.Â  He told Sky News: \"I'm sorry that the service that the customers receiveâ€¦ it's not where we would like it to be, everyone is very committed in terms of trying and sorting it out. \"So, absolutely I'm very sorry about the service some people receive, but it will absolutely get fixed.\" It came after a tense appearance in front of MPs from the Environment, Food and Rural Affairs select committee during which his own bonus of Â£195,000 - which he received after just three months in the role - was called into question. Money blog: Broadband provider hikes prices - but you can get out of it The parliamentary hearing coincides with spiralling bills for customers, who face paying hundreds of pounds more for their water supply over the coming years. He defended the payout, saying he had joined the struggling company in January 2024 because it \"matters to society\". \n                  Thames Water apologises to customers but defends bonuses\n                 \n                  Thames Water delays request for even more expensive bills as six offers of new investment received\n                 \n                  Thames Water avoids being taken into government ownership in coming days after unsuccessful court challenge\n                 He added: \"I think that within the first three months, I did make a difference. I started to put in place the new organisation structure, I started to give people confidence and reassurance about how proud they could be of the job they did and what we were setting out to do.\" Thames Water customers have faced significant service disruption in recent years, including a boil water notice in Bramley, near Guildford, last summer and a 40% rise in sewage spills in 2024. It has also struggled to raise investment, repay its debt pile, which now stands at Â£19bn after an emergency loan prevented it from running out of money and entering state control. Read more from Sky News:M&S says customers' personal data taken by hackersFuture of Nissan's Sunderland plant in doubt Also appearing before the committee was Thames Water chairman Sir Adrian Montague, who tried to reassure MPs that they would get the firm's finances back on track despite recent moments of near collapse. He said: \"The fact of the matter is, as we've noted on several occasions, Thames in the last year has come very close to running out of money entirely. \"There were times in the last year that we had five weeks' liquidity - and running a Â£20bn corporation on five weeks' liquidity, honestly, it's hair-raising.\""
    },
    {
        "title": "Plans to legalise assisted dying in Scotland pass first stage",
        "description": "Plans to legalise assisted dying in Scotland have passed the first stage after MSPs voted in favour of the bill.",
        "url": "https://news.sky.com/story/plans-to-legalise-assisted-dying-in-scotland-pass-first-stage-13367102",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-assisted-dying-holyrood_6914862.jpg?20250513150516",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-13 18:15:00",
        "Headline": "MSP Liam McArthur, who brought forward the bill, says terminally ill Scots and their families are \"desperate to see the law changed\".",
        "Content": "Plans to legalise assisted dying in Scotland have passed the first stage after MSPs voted in favour of the bill. It was tabled in a bid to allow terminally ill adults to seek medical help to end their lives. It passed by 70 votes to 56.   The move comes after MPs voted in favour of similar proposals for England and Wales. Supporters of the bill argue it would ease the suffering of dying Scots, while opponents argue it would fail to safeguard some of the most vulnerable people in society. MSP Liam McArthur, who brought forward the Assisted Dying for Terminally Ill Adults (Scotland) Bill, opened the debate ahead of the stage one vote at the Scottish parliament on Tuesday. The Scottish Liberal Democrat politician said terminally ill Scots and their families are \"desperate to see the law changed\". Campaigners from both sides of the debate staged demonstrations outside Holyrood ahead of the MSPs casting their votes. Actress Liz Carr, a wheelchair user, urged all those with concerns to vote no. A free vote on the bill took place - meaning MSPs were not instructed on how to vote by their parties or the Scottish government. First Minister John Swinney, deputy first Minister Kate Forbes, former first ministers Nicola Sturgeon and Humza Yousaf, and Scottish Labour leader Anas Sarwar had earlier revealed they intended to vote against it. The stage one vote was on the general principles of the bill ahead of any suggested changes. It will now face further votes at the committee stage and in the chamber before potentially becoming law - but not until early next year.  Mr McArthur said assisted dying was a \"choice that for so long, so many of our constituents have asked us to provide\". However, he stressed his bill had \"strict eligibility criteria\" with proposals for two doctors needed to independently certify that someone is both terminally ill and has the mental capacity to request an assisted death. Only those who have lived in Scotland for at least 12 months, and who are registered with a GP in Scotland, would be able to make such a request. Read more:Widow has 'no regrets' over assisted suicide of husbandIsle of Man to legalise assisted dying There would also be a time period of at least two weeks between a request being made and the necessary medication being provided - with the patient having to be able to take this themselves. And while it had originally been planned that people could apply for an assisted death from the age of 16, Mr McArthur confirmed recently that if the bill passed on Tuesday he would seek to amend this to 18. Following the result, Mr McArthur said it was a \"landmark moment for Scotland\". \"I understand that for many colleagues this has been a difficult decision, but I believe the quality of debate today has shown our parliament at its finest,\" he added. Ally Thomson, director of Dignity in Dying Scotland, said it was a \"watershed moment for compassion\", adding: \"Many will be feeling overwhelming relief and gratitude that today our country has moved towards a safer and more compassionate law.\""
    },
    {
        "title": "Sir Bradley Wiggins 'lucky to be here' after cocaine addiction",
        "description": "Sir Bradley Wiggins has revealed he became a cocaine addict after his cycling career ended and is \"lucky to be here\".",
        "url": "https://news.sky.com/story/sir-bradley-wiggins-lucky-to-be-here-after-cocaine-addiction-13367243",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-bradley-wiggins-cycling_6915360.jpg?20250513161054",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-13 15:11:00",
        "Headline": "The five-time Olympic gold medal winner says his children wanted to put him into rehab as they feared the habit could kill him",
        "Content": "Sir Bradley Wiggins has revealed he became a cocaine addict after his cycling career ended and is \"lucky to be here\". The 45-year-old, who won the 2012 Tour de France and five Olympic gold medals during an illustrious career, said his two children wanted to put him in rehab because they feared the habit could kill him. The star of London 2012 said he has been clean for 12 months, has regular therapy sessions, and feels \"a lot more at peace\" with himself.   He told The Observer there were times his son \"thought I was going to be found dead in the morning\". \"I was a functioning addict,\" he said. \"People wouldn't realise. I was high most of the time for many years. \"I was walking a tightrope. I realised I had a huge problem. I had to stop. I'm lucky to be here.\" Since ending his career in 2016, Sir Bradley has spoken about his father's jealousy and being groomed by a coach as a child. Sir Bradley, who was declared bankrupt last year, said disgraced cyclist Lance Armstrong helped his recovery, including offering to pay for therapy. Read more on Sky News:Innocent man freed after 38 years in jailMP charged with sex assaultsDrug trade behind QR code stickers on UK streets Speaking to Cycling Weekly, he said his addiction \"was a way of easing that pain that I lived with\". \"I'm still figuring a lot of this out but what I have got is a lot more control of myself and my triggers; I'm a lot more at peace with myself now which is a really big thing,\" he said."
    },
    {
        "title": "Water park where 11-year-old girl drowned had no deep water warnings, inquest hears",
        "description": "A water park where an 11-year-old girl drowned during a birthday party had no signs warning of deep water, an inquest has heard.",
        "url": "https://news.sky.com/story/water-park-where-11-year-old-girl-drowned-had-no-deep-water-warnings-inquest-hears-13367304",
        "image_url": "https://e3.365dm.com/22/08/1920x1080/skynews-kyra-hill-collect_5872761.jpg?20250513204515",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-13 16:45:00",
        "Headline": "Kyra Hill went missing in a designated swimming area at Liquid Leisure near Windsor, Berkshire, in August 2022. Although signs warned the water was shallow it was actually metres deep in places, a hearing is told.",
        "Content": "A water park where an 11-year-old girl drowned during a birthday party had no signs warning of deep water, an inquest has heard. Kyra Hill went missing in a designated swimming area at Liquid Leisure near Windsor, Berkshire, in August 2022. Although signs warned the water was shallow it was actually metres deep in places, the hearing was told. Kyra was found more than an hour after emergency services were called and was taken to hospital, where she was pronounced dead.   At the time her father told Sky News she was \"left to drown\" and accused the operator of \"neglect\". Senior coroner Heidi Connor told Berkshire Coroner's Court there were \"various sharp drops\" of up to 4.5m (14.7ft) within the swimming zone. The lake was 2.68m (8.8ft) deep where Kyra was seen going under, according to the findings of a report carried out after the incident. But the only signs concerning depth in the designated swimming zone said \"danger shallow water\". The inquest heard there was a 10-minute gap between the first and second searches for Kyra in that part of the lake. Read more from Sky News:Man who has spent 38 years in jail has conviction quashedTory MP charged with sexual assaults at Groucho Club 'Where is Kyra?' A lifeguard named as Abbi, then 17, was on her chair when she spotted splashing that concerned her, the inquest heard. She said: \"I asked the group that I'd gone towards if there was anyone there and I got told no, there was no one - I kept repeating 'was there someone here, was there someone here', and I got told they got out of the water.\" She said someone shouted \"where is Kyra?\". The then-schoolgirl was qualified to perform \"surface-water rescues\" but not underwater ones, and reached the point where Kyra went under in 10 seconds, the inquest heard. She dived repeatedly and left the water to raise the alarm using a radio, the coroner said. A member of the public kept looking in the area and CCTV shows it took another 10 minutes for staff to re-enter the water, the inquest heard. Abbi first entered the water at 3.20pm and a previous hearing was told emergency services were called at 3.55 and Kyra was found just after 5.10pm. Owner says more lifeguards should have been on duty Liquid Leisure owner and director Stuart Marston was asked by the coroner about the lack of deep water signs. He said shallow water signs were erected following a civil claim after someone hit the bottom with their knee. \"We were told to put danger shallow water signs around the facility so people didn't jump in,\" Mr Marston said \"It's very difficult, in hindsight now... if there was a deep water sign there and also shallow water [signs], it would be conflicting.\" The coroner said CCTV showed around 42 people in the water and others on the beach at the time of the incident. One lifeguard was overseeing the area and the coroner put it to Mr Marston the waterpark's policy required at least one lifeguard per 30 participants. He said lifeguards at nearby activities in the same beach area would occasionally check from their stations, but later accepted more lifeguards should have been on duty. The coroner said it should not be forgotten \"this is about your Kyra, an 11-year-old girl who supported Manchester United and who dreamt of a career in law\". The hearing continues."
    },
    {
        "title": "Royal College of Psychiatrists pulls support for assisted dying bill",
        "description": "The Royal College of Psychiatrists (RCP) has pulled its support for the assisted dying bill.",
        "url": "https://news.sky.com/story/royal-college-of-psychiatrists-pulls-support-for-assisted-dying-bill-13367456",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-assisted-dying-euthansia_6746051.jpg?20250514024838",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-13 23:55:00",
        "Headline": "The announcement from the Royal College of Psychiatrists is a blow to supporters of the bill because under an amendment, a psychiatrist would be on the expert panel to assess assisted dying cases.",
        "Content": "The Royal College of Psychiatrists (RCP) has pulled its support for the assisted dying bill. The announcement is a blow to supporters of the bill ahead of its return to the House of Commons on Friday. It comes as plans to legalise assisted dying in Scotland passed the first stage this week. Dr Lade Smith, president of the RCP, said: \"The RCP has reached the conclusion that we are not confident in the Terminally Ill Adults Bill in its current form, and we therefore cannot support the Bill as it stands.\" The move is significant because, under the bill's current stipulations, a panel including a psychiatrist would oversee assisted dying cases. The RCP outlined a number of issues it had with the current bill, including: the bill not making provision for unmet needs, whether assisted suicide is classed as a treatment or not, what the psychiatrists' specific role on the panel would be, and the increased demand the bill puts on psychiatrists. If the college support remains withdrawn, and the bill passes, it isn't clear what effects it may have. \n                  Plans to legalise assisted dying in Scotland pass first stage\n                 \n                  MSPs to vote on assisted dying in Scotland\n                 \n                  Assisted Dying: Hundreds would seek to use service in first year of it being available, government report finds\n                 Kim Leadbeater, the MP behind the bill, has confirmed it will include a clause that means anyone who does not want to be involved in the process will not have to do so. Supporters of the bill argue it would ease the suffering of dying people, while opponents argue it would fail to safeguard some of the most vulnerable people in society. Questions over the bill The more prominent role of a psychiatrist in the bill came about after a previous amendment. Initially, the bill said that after two independent doctors approved an assisted dying case, it would then need to be further approved by a High Court judge. Read more from Sky News:'Sixteen killed' in Israeli strike on Gaza hospitalMenendez brothers' murder sentences reducedPM rejects Enoch Powell comparison But MPs on the parliamentary committee scrutinising the bill voted to remove that clause in March. Instead, Ms Leadbeater proposed a voluntary assisted dying commissioner that included an expert panel with a psychiatrist. She said this was a \"strength, not a weakness,\" but opponents of the bill disagreed, saying removing the High Court judge \"fundamentally weakens protections for the vulnerable\". However, amid changes and amendments to the original bill, there has been growing concern about safeguarding and timeframes, Sky News political correspondent Ali Fortescue reported. Friday's debate was already delayed from 25 April, to give MPs more time to consider amendments. If the bill passes on Friday, it will move to the House of Lords, where it will undergo similar legislative stages, and if it passes that too, it won't come into effect until at least 2029, after its implementation was delayed."
    },
    {
        "title": "'Sixteen killed' in strike on Gaza hospital as Israel says it hit 'Hamas command centre below'",
        "description": "At least 16 people have been killed and 70 others were injured at a hospital in Gaza following an Israeli strike, according to the health ministry.",
        "url": "https://news.sky.com/story/sixteen-killed-in-strike-on-gaza-hospital-as-israel-says-it-hit-hamas-command-centre-below-13367379",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-european-hospital-gaza_6915654.jpg?20250513223324",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-13 19:38:00",
        "Headline": "Nine missiles struck the European Hospital and its courtyard in the south of the Palestinian territory, health officials said.",
        "Content": " At least 16 people have been killed and 70 others were injured at a hospital in Gaza following an Israeli strike, according to the health ministry. Nine missiles hit the European Hospital and its courtyard in the south of the Palestinian territory, officials said. Israel said it had hit a \"Hamas command centre\" beneath the hospital in Khan Younis. Hamas denies exploiting hospitals and civilian properties for military purposes. Middle East latest - Trump signs Saudi arms deal Earlier, a well-known Palestinian photojournalist died following a separate attack on the Nasser Hospital, also in Khan Younis, said the ministry. Hassan Aslih had been accused by Israel of working with Hamas and was recovering from an earlier airstrike. \n                  Could Putin, Zelenskyy and Trump really meet?  \n                 \n                  Ukraine, Gaza and China: Why Trump's Middle East tour takes on new importance\n                 \n                  Trump set for truly consequential week for his presidency and his ability to effect change\n                 Aslih, who has hundreds of thousands of followers on social media, was said by the Israelis to have recorded and uploaded footage of \"looting, arson and murder\" during Hamas's 7 October 2023 attack into Israel that triggered the war in Gaza. Aslih was one of two patients who died in Tuesday's strike on Nasser Hospital, said the health ministry. Several others were wounded. Dozens of people were being treated on the third floor of the hospital building, where the missiles struck, Reuters said, quoting Ahmed Siyyam, a member of Gaza's emergency services. The Israeli military said it \"eliminated significant Hamas terrorists\" in Nasser Hospital, among them Aslih, who it said had \"operated under the guise of a journalist\". Footage showed heavy damage to one of the hospital buildings, including to medical equipment and beds inside. At least 160 journalists and media workers have been killed in Gaza since the start of the war, according to the International Federation of Journalists. Gazan officials accuse Israel of deliberately targeting journalists. Israel denies this and says it tries to avoid harm to civilians. Aslih, who headed the Alam24 news outlet and had previously worked with Western news outlets, was recovering after being wounded last month in a deadly strike on a tent in the Nasser Hospital compound. Read more:Timeline: Key events of war in GazaPope raises Gaza in Sunday message Meanwhile, President Trump has spoken on the phone to Edan Alexander after he was released by Hamas on Monday, as part of ongoing efforts to achieve a permanent ceasefire with Israel. The 21-year-old was believed to be the last living American hostage in Gaza. Some 1,200 people were killed and 251 taken hostage in the 7 October attack on southern Israel, according to Israeli figures. Israel's response has killed more than 52,000 Palestinians, according to local health officials, and destroyed much of the coastal territory. Gaza's health ministry records do not distinguish between civilians and combatants. An aid blockade since March has left the population at critical risk of famine, according to the World Health Organisation, which warned on Tuesday that hunger and malnutrition could have a lasting impact on \"an entire generation\"."
    },
    {
        "title": "Trump to lift sanctions on Syria - as he announces $600bn deal with Saudi Arabia",
        "description": "Donald Trump has said the US will lift long-standing sanctions on Syria and signed a $600bn (&#163;450bn) deal with Saudi Arabia as he visited the nation as part of a tour of the Middle East.",
        "url": "https://news.sky.com/story/trump-to-lift-sanctions-on-syria-as-he-announces-600bn-deal-with-saudi-arabia-13367368",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-saudi-arabia_6915419.jpg?20250513165505",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-13 19:02:00",
        "Headline": "The US president was speaking at a US-Saudi investment conference during a four-day trip to the Middle East.",
        "Content": "Donald Trump has said the US will lift long-standing sanctions on Syria and signed a $600bn (Â£450bn) deal with Saudi Arabia as he visited the nation as part of a tour of the Middle East. The US president revealed the US plans to lift sanctions on Syria following talks with Saudi Arabia's Crown Prince Mohammed bin Salman and Turkish leader Recep Tayyip Erdogan. Mr Trump was speaking at the US-Saudi investment conference during a four-day trip to the region. Analysis: US-Saudi relationship feels tighter than ever as Trump signs flurry of deals  The comments follow Air Force One being escorted by Royal Saudi Air Force F-15s as it approached the kingdom's capital, with Mr Trump welcomed by the crown prince, Saudi's de facto ruler, as he stepped off the plane. President Trump said the relationship between the were nations were \"stronger and more powerful than ever before\", adding it would \"remain that way\".  'Largest defence cooperation agreement' Mr Trump and Prince Mohammed signed several agreements aimed at increasing cooperation between their governments, including a commitment to $600bn in new Saudi investment in the US - though Mr Trump said a trillion dollars (Â£750bn) would be even better. The US also agreed to sell Saudi Arabia an arms package worth nearly $142bn (Â£107bn), which the White House called \"the largest defence cooperation agreement\" Washington has ever done. In his speech, President Trump also urged Iran to take a \"new and a much better path\" and make a new nuclear deal with the US. Speaking at the conference, Mr Trump said he wants to avoid a conflict with Iran but warned of \"maximum pressure\" if his olive branch was rejected. \"As I have shown repeatedly, I am willing to end past conflicts and forge new partnerships for a better and more stable world, even if our differences may be profound,\" he said. \"If Iran's leadership rejects this olive branch... we will have no choice but to inflict massive maximum pressure, drive Iranian oil exports to zero.\" He added: \"Iran will never have a nuclear weapon. But with that said, Iran can have a much brighter future, but we'll never allow America and its allies to be threatened with terrorism or nuclear attack. The choice is theirs to make.\" Read more:Why Trump's idea of using a Qatari jet has faced criticismTrump 'thinking' of going to proposed Zelenskyy-Putin peace talks Normalising relations with Syria Mr Trump said he would ease US sanctions on Syria and move to normalise relations with its new government ahead of a meeting with its new leader Ahmad al Sharaa on Wednesday. The Syrian president was formerly an insurgent who led the overthrow of former leader Bashar al Assad last year. Mr Trump said he wants to give the country \"a chance at peace\" and added: \"There is a new government that will hopefully succeed. I say good luck, Syria. Show us something special.\"  The US leader also said he hoped Saudi Arabia would soon join the Abraham Accords and recognise Israel \"in your own time\". Saudi Arabia has argued its recognition of Israel would be tied to the establishment of a Palestinian state along the lines of Israel's 1967 borders. Mr Trump will travel to Qatar and the United Arab Emirates over the next three days."
    },
    {
        "title": "US-Saudi relationship feels tighter than ever as Trump signs flurry of deals",
        "description": "In today's Saudi Arabia, convention centres resemble palaces.&#160;",
        "url": "https://news.sky.com/story/us-saudi-relationship-feels-tighter-than-ever-as-trump-signs-flurry-of-deals-13367279",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-mohammed-bin-salman_6915608.jpg?20250513213622",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-05-13 16:04:00",
        "Headline": "There are huge challenges like Gaza, but President Trump and Saudi Crown Prince Mohammed bin Salman see big opportunities too. A deal with Iran, a new Syria, and Gulf countries that are global players.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n In today's Saudi Arabia, convention centres resemble palaces.Â  The King Abdul Aziz International Conference Centre was built in 1999 but inside it feels like Versailles. Some might call it kitsch, but it's a startling reflection of how far this country has come - the growth of a nation from desert bedouins to a vastly wealthy regional powerbroker in just one generation. Trump latest: President signs huge arms deal with Saudi Arabia  At a bar overnight, over mocktails and a shisha, I listened to one young Saudi man tell me how his family had watched this transformation. His father, now in his 60s, had lived the change - a child born in a desert tent, an upbringing in a dusty town, his 30s as a mujahideen fighting the Soviets in Afghanistan, his 40s in a deeply conservative Riyadh and now his 60s watching, wide-eyed, the change supercharged in recent years. The last few years' acceleration of change is best reflected in the social transformation. Women, unveiled, can now drive. But that's just the headline. The depth of change has been astonishing. Laws governing every aspect of women's lives have been ripped up. They can work in every industry, and the government. A few years ago they couldn't watch a football match. Now, as the Kingdom prepares for the World Cup, there is a female football league. The leaps forward into international norms have been profound. Through a 'western' lens, there's a way to go - homosexuality is illegal. Political dissent is firmly off limits and the murder of Saudi journalist Jamal Khashoggi is absolutely not openly discussed here. Bluntly, political and economic expedience have moved world leaders and business leaders beyond all that. Read more:Why Trump's idea of using a Qatari jet has faced criticismTrump 'thinking' of going to proposed Zelenskyy-Putin peace talks  The guest list of delegates at the convention centre for the Saudi-US Investment Forum reads like a who's who of America's best business brains. Signing a flurry of different deals worth about $600bn (Â£451bn) of inward investment from Saudi to the US - which actually only represent intentions or 'memorandums of understanding' at this stage - the White House said: \"The deals... represent a new golden era of partnership between the United States and Saudi Arabia. \"From day one, President Trump's America First Trade and Investment Policy has put the American economy, the American worker, and our national security first.\" That's the answer when curious voters in faraway America wonder what this is all about. With opulence and extravagance, this is about a two-way investment and opportunity. There are defence deals - the largest defence sales agreement in history, at nearly $142bn (Â£106bn) - tech deals, and energy deals. Underlying it all is the expectation of diplomatic cooperation, investment to further the geopolitical strategies for both countries on key global challenges.  In the convention centre's gold-clad corridors, outside the plenary hall, there are reminders of the history of this relationship. There is a 'gallery of memories' - the American presidents with the Saudi kings - stretching back to the historic 1945 meeting between Franklin D Roosevelt and King Saud on board the USS Quincy. That laid the foundation for the relationship we now see. Curiously, the only president missing is Barack Obama. Sources suggested to me that this was a 'mistake'. A convenient one, maybe. It's no secret that the US-Saudi relationship was at its most strained during his presidency. Obama's absence would give Trump a chuckle.  Today, the relationship feels tighter than ever. There is a mutual respect between the president and Saudi Crown Prince Mohammed bin Salman - Trump chose Saudi Arabia as his first foreign trip in his last presidency, and he's done so again. But there are differences this time. Both men are more powerful, more self-assured, and of course the region has changed. There are huge challenges like Gaza, but the two men see big opportunities too. A deal with Iran, a new Syria, and Gulf countries that are global players. It's money, money, money here in Riyadh. Will that translate to a better, more prosperous and peaceful world? That's the question."
    },
    {
        "title": "Trump 'thinking' of going to Turkey for proposed Zelenskyy-Putin talks - as Russia silent on attending",
        "description": "Donald Trump has said he is \"thinking\" of going to Turkey on Thursday for potential peace talks between Ukraine and Russia's leaders.",
        "url": "https://news.sky.com/story/trump-thinking-of-going-to-turkey-for-proposed-zelenskyy-putin-talks-as-russia-silent-on-attending-13366932",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-white-house_6914680.jpg?20250513035036",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-13 02:45:00",
        "Headline": "It still isn't clear whether Vladimir Putin will respond to Volodymyr Zelenskyy's invitation to meet in person in Istanbul on Thursday, despite growing pressure in recent days from European leaders.",
        "Content": "Donald Trump has said he is \"thinking\" of going to Turkey on Thursday for potential peace talks between Ukraine and Russia's leaders. The US president, who previously claimed he could end the conflict in a day, has pushed for both sides to meet to bring the fighting to an end. On Sunday, Ukraine's Volodymyr Zelenskyy called out Vladimir Putin to meet him on Thursday in Istanbul, but the Kremlin leader has yet to respond. Speaking late on Monday, Mr Trump said: \"I was thinking about flying over. I don't know where I am going be on Thursday. \"I've got so many meetings. \"There's a possibility there I guess, if I think things can happen.\" Mr Trump has headed to the Middle East this week on the first major foreign trip of his second administration, visiting Saudi Arabia, Qatar and the UAE. Mr Zelenskyy backed the prospect of Mr Trump attending the talks. He said: \"I supported President Trump with the idea of direct talks with Putin. I have openly expressed my readiness to meet. \"And of course, all of us in Ukraine would appreciate it if President Trump could be there with us at this meeting in Turkey.\"  Russia playing for time? However, Kremlin spokesperson Dmitry Peskov, speaking on Monday, refused to say who, if anyone, would be travelling to Turkey from the Russian side. \"Overall, we're determined to seriously look for ways to achieve a long-term peaceful settlement. That is all,\" Mr Peskov said. This came after the \"coalition of the willing\", including Sir Keir Starmer, threatened Russia with fresh sanctions if it failed to comply with an unconditional 30-day ceasefire starting on Monday. Russia effectively rejected this proposal, instead calling for direct negotiations in Istanbul with Ukraine, at which Mr Zelenskyy challenged Mr Putin to make the trip himself. Despite Russia's claims towards wanting peace, Ukraine's allies remained deeply sceptical about prospects for talks and whether Mr Putin was serious. Read more:Why Trump's Middle East tour takes on new importanceSky correspondent on her run-in with Trump loyalistDid Trump blink in the US-China trade war? European Union commission vice president Kaja Kallas said: \"We want to see that Russia also wants peace. \"It takes two to want peace, it takes only one to want war, and we see that Russia clearly wants war.\" Meanwhile, Russia continued its nightly attacks on Ukraine. Overnight into Tuesday, Ukraine said Moscow launched more than 100 drones."
    },
    {
        "title": "French actor Gerard Depardieu found guilty of sexually assaulting two women",
        "description": "French actor Gerard Depardieu has been found guilty of sexually assaulting two women - and handed an 18-month suspended sentence.",
        "url": "https://news.sky.com/story/gerard-depardieu-found-guilty-of-sexual-assault-13367002",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-gerard-depardieu-trial_6867262.jpg?20250326091431",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-05-13 07:59:00",
        "Headline": "The 76-year-old star is given a suspended sentence after being convicted of groping the women during the filming of 2021 movie Les Volets Verts.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n French actor Gerard Depardieu has been found guilty of sexually assaulting two women - and handed an 18-month suspended sentence. Depardieu, 76, was convicted by a court in Paris of groping the women during the filming of the 2021 movie Les Volets Verts (The Green Shutters). Both victims had been working on the film in behind-the-scenes roles. Following his convictions, Depardieu was fined â‚¬29,040 (about Â£24,000) and the court requested that he is registered in the national sex offender database. His lawyer Jeremie Assous said the star, who denied assault and did not attend Tuesday's hearing, will appeal against the verdict.  The two victims said they were scared to speak out at the time and were intimidated by Depardieu. \"I was petrified\", said one of the women, a set designer named Amelie. She told the court that Depardieu had trapped her between his legs as she tried to get past him in a corridor, and had then run his hands over her body. \"He terrified me - he looked like a madman,\" she said. Depardieu had denied the allegations, and had received support from many actors, directors and even at one point, the French president, Emmanuel Macron, who had previously described the actor as \"the pride of France\". However, his victims said that he attacked them - first using obscene, vulgar and explicit language towards the women before sexually assaulting them. The court heard that the actor first used vulgar language to abuse them and then grabbed them and ran his hands over their bodies, making crude sexual advances towards them. 'The end of impunity' Depardieu, who has appeared in more than 200 movies, claimed that he did not even know what sexual assault was. But judge Thierry Donard said Depardieu's explanation of events had been unconvincing and, at times, contradictory. Carine Durrieu-Diebolt, the lawyer representing victim Amelie, told the court that Depardieu had specifically targeted women who did not enjoy a high profile, saying he would never treat a famous actor the way he behaved towards his two victims. \"He is strong with the weak, and weak with the strong,\" she said. Following the verdict, she told reporters: \"It is the victory of two women, but it is the victory of all the women beyond this trial. \"Today we hope to see the end of impunity for an artist in the world of cinema. \"I think that with this decision, we can no longer say that he is not a sexual abuser. And today, as the Cannes Film Festival opens, I'd like the film world to spare a thought for Gerard Depardieu's victims.\" 'Women were put in danger' During cross-examination, Depardieu admitted he had first denied ever touching Amelie, then said he grasped her hips to stop himself from falling over, and then claimed he had grabbed her to get her attention. Amelie described his account as \"obviously completely false\" and said she had been mentally scarred by the encounter. Read more from the trial:What does the trial mean for #MeToo in France?Inside the court during the Depardieu trial Away from the court, Ms Diebolt told Sky News that, after years of being tolerated due to his fame, Depardieu was finally being held accountable for his actions. \"These women were put in danger,\" she said. \"This is about a line of offences that he committed over many years that were tolerated by the world of cinema because it was Gerard Depardieu. \"Because the financial benefits he brings to the industry are so substantial. He did make some excellent films, but all men are equal before the law. \"Nobody warned Amelie about Depardieu's behaviour, so his words and actions came as a terrible surprise for her. She still has traumatic flashbacks.\" Rape allegation Depardieu's reputation is now in tatters, and there may be more allegations to come. Ms Diebolt told Sky News that around 20 other women have said that they were attacked by the actor. And we already know that Depardieu will stand trial again later this year, this time charged with raping the actress Charlotte Arnould. Ms Arnould has accused Depardieu, a friend of her parents, of raping her at his mansion in Paris. When she returned to the house to confront him, she alleges that he raped her once again. Depardieu denies both allegations. If he were to be found guilty, he would face a substantial prison sentence. Depardieu's sexual assault conviction is being seen as an important step forward for France's growing MeToo movement, which he described as \"a terror\" during the proceedings. After a letter of support Depardieu received prior to the trial from prominent actors and directors, a separate group of around 600 artists wrote their own, condemning the culture of \"impunity\" and calling for the actor to be fully investigated. 'Wall of silence' Emmanuelle Dancourt, president of MeToo Media, told me: \"Depardieu is a man with a lot of money around him. \"Everybody could see Depardieu talking badly to women, putting his hand in the wrong place on a woman's body and saying things that are wrong. \"But Gerard Depardieu's best friend is silence. In France, you have a wall of silence, and this means impunity. If you are a man with a lot of power and a lot of money, you can do whatever you want.\" Depardieu's popularity has declined as more and more claims emerged about his conduct. A recent documentary about him featured footage, filmed in North Korea, of the actor making lewd comments as a young girl rode past on a horse. When Mr Macron offered his support to Depardieu, denouncing what he called \"a manhunt\" against the star, another French actor, James Bond star Lea Seydoux, said the president's words had given a \"bad image\" of France. Depardieu was given Russian citizenship as a gift by Vladimir Putin."
    },
    {
        "title": "Kim Kardashian feared she was going to die during Paris heist - and tells robber she forgives him ",
        "description": "Kim Kardashian has told a court she feared she would be raped and killed during an armed robbery in her Paris hotel room in 2016. ",
        "url": "https://news.sky.com/story/kim-kardashian-feared-she-was-going-to-die-during-paris-heist-and-tells-robber-she-forgives-him-13366922",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kim-kardashian-paris_6915472.jpg?20250513180014",
        "type": "World",
        "Author": "Bethany Minelle",
        "Date Published": "2025-05-13 08:42:00",
        "Headline": "Ten defendants are accused of robbing her at gunpoint in the Hotel de Pourtales in the French capital in October 2016.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  Kim Kardashian has told a court she feared she would be raped and killed during an armed robbery in her Paris hotel room in 2016.  The 44-year-old media personality and businesswoman was tearful as she told the judge: \"I was certain he [one of the robbers] was going to rape me.\" \"I absolutely did think I was going to die,\" she added. \"I said a prayer for my family, and for my sister who would walk in [and find me] and that they would have an okay life after what they saw.\" Kardashian faced a group of 10 defendants - dubbed the 'grandpa robbers' by French media - who are accused of robbing her at gunpoint in the Hotel de Pourtales in the French capital in October 2016. She told the court how one of the robbers pulled her across the bed, exposing her naked body under her hotel robe as he tied her up. She also told the court of her \"violation\", explaining she was \"grabbed and tied upâ€¦ dragged from one room to the other\", and calling the whole thing \"a violent act\". \n                  Kim Kardashian to testify in Paris armed robbery trial as proceedings get under way\n                 \n                  Kim Kardashian's Paris robbery trial: Everything you need to know\n                 \n                  Menendez brothers murder case: Prosecutors review new evidence - as Kim Kardashian calls for their release\n                 Kardashian explained: \"Being touched and picked up when you're naked is very violating.\" Additionally, in a bizarre turn of events in the courtroom, three of the defendants offered messages to Kardashian - two in person and one via a written note. Kardashian had no knowledge of the letter until it was read in court and she tearfully said she forgave one of the robbers. Read more: Everything you need to know about the Paris trial Earlier in the day, Kardashian, wearing a black skirt suit, sunglasses, and with her hair pulled back into a chignon, walked up the courthouse steps accompanied by her mother Kris and a large entourage. Giving evidence in the courtroom, she became tearful when describing the robbery, and talking of her \"confusion\" when two men entered her room dressed as police officers, accompanied by the handcuffed concierge. \"I had fallen asleep naked with a robe on, I was flustered,\" Kardashian told the trial. After five hours of intense questioning, Kim Kardashian gave a sign she was feeling the pressure: a giant yawn. Despite being one of the most photographed women in the world, today, any attempt to film her inside the ornate courtroom would have resulted in an â‚¬18,000 (Â£15,000) fine. She spoke of overhauling her life - no longer keeping jewellery at home, introducing security precautions that she admitted may seem extreme, as well as no longer posting on social media in real time. Amid a life lived on screens, she explained to the French court that posting on social media was part of \"American culture\", dubbing the posts \"mini reality shows\". And while Keeping Up With The Kardashians has brought her international fame, with it has come \"violation\" and \"terror\" at her door, leaving her \"hiding in the bushes on the balcony\", no doubt cursing the very fame she so desires. \"Stung deeply\" by those who saw the robbery as just another publicity stunt, the chance to \"tell her story\" was a moment for Kardashian to \"find closure,\" albeit among yet another media circus, with all eyes firmly on her. 'From fatherly to aggressive' Describing the man who tied her up, who she says was \"smaller and stockier\" than the second man with the gun, Kardashian said: \"I feel like because the guy who tied me up could see how frantic I was, at that moment he felt like a fatherâ€¦ It felt like he wanted me to know that I'd be okay if I just shut up.\" She told the court: \"I kept telling them I have babies and I need to get home to my babies.\" But, after the men began arguing in French, the previously \"fatherly\" man went from saying she'd be okay, \"to aggressively grabbing my naked body\". Asked by the judge if she was hit at any point, Kardashian said: \"No, I was not hit. I was picked up and dragged and dropped on the hard floor, but I was not hit.\" She later confirmed she was dragged by her arms, with both her ankles and wrists bound together, and with a gun held towards her neck. Police say the men escaped on bicycles, with around $9m of jewellery, including a $4m engagement ring from Kardashian's then-husband Kanye West. Most of the jewellery was never recovered. 'Your forgiveness is a sun - I'll be forever grateful' During her evidence, the judge read a statement to Kardashian written by one of the defendants, Aomar Ait Khedache, 68, nicknamed \"Old Omar\" - in which he said he \"regretted\" his actions and had been touched by his conscience. He has so far communicated in court only via handwritten notes, saying he was too unwell to talk. He has previously admitted to participating in the heist but denies the prosecution's accusation that he was the ringleader. When asked by the judge if she had a response, Kardashian said: \"I'm obviously emotional about it, this experience changed my life and it changed my family's life.\" Currently in training to be a lawyer, and a vocal criminal justice reform advocate, she said: \"I have always believed in second chancesâ€¦ I try to have empathy always.\" She went on: \"I do appreciate the letter, I forgive you for what has taken place, but it doesn't change the emotion and the feelings and the trauma the way my life is forever changed.\" She thanked him for his letter. Ait Khedache's lawyer shared his response to Kardashian's words, saying: \"This forgiveness is a sun that comes to illuminate me, thank you.\" He added: \"I'll be grateful to you foreverâ€. The judge then spoke to two defendants in the courtroom, starting with Yunice Abbas, 71, who has previously admitted his part in the heist. Abbas stood and spoke directly to Kardashian, his right hand shaking from Parkinson's as he talked, asking for \"forgiveness\" and saying he too had \"regret\" for what he did. A third defendant, Didier Dubreucq, 69, dubbed \"blue eyes\" by the French press, also briefly spoke and offered a few contrite words, saying, \"I am very sorry about what happened to you\", adding: \"I empathise with your pain.\" 'A sound I had never heard - terror' Earlier on Tuesday, in Paris's central criminal court, Kardashian's stylist Simone Harouche described the moment she was woken by the US star's screams of terror and feared she had been \"raped or violated\". Ms Harouche, 45, who says she has worked for Kardashian for many years and has been friends with her since she was 12, told the court she was woken by \"a sound I had never heard from Kimâ€¦ It was terror\". Sleeping in a separate apartment, on the next floor down from Kardashian's, she told the judge: \"When I realised something terrible was going on upstairs... I started looking for my telephone and I started looking for something to help save mine and Kim's life.\" She went on to lock herself in her bathroom and hide in her shower, where she called Kardashian's sister Kourtney and texted her security guard, Pascal Duvier, telling them: \"Something is very wrongâ€¦ Kim is upstairs with men and we need help.\" She said minutes later, Kardashian \"hopped\" into her room, explaining: \"To see my friend with her feet taped and a very light robe with nothing under, and all messed up and pulled, I thought she could have been raped or very violated.\" She said she removed the tape from Kardashian's feet, and her friend was \"beside herself\". The trial, which is being held in front of three judges and six jury members, is due to conclude at the end of this week."
    },
    {
        "title": "Andy Murray to stop working as Novak Djokovic's coach - days before French Open",
        "description": "Novak Djokovic and Andy Murray will \"no longer be working together\", the tennis stars have announced.",
        "url": "https://news.sky.com/story/andy-murray-to-stop-working-as-novak-djokovics-coach-13367007",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-novak-djokovic-andy-murray_6914831.jpg?20250513092600",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-13 08:01:00",
        "Headline": "Djokovic thanks his former tennis rival \"for all the hard work, fun and support\" over the six months Murray that worked as part of his coaching staff.",
        "Content": "Novak Djokovic and Andy Murray will \"no longer be working together\", the tennis stars have announced. Djokovic thanked his former rival \"for all the hard work, fun and support\" over the six months that Murray worked as the head of his coaching staff. The Serbian player added that he \"really enjoyed deepening our friendship together\". Former world number one Murray said: \"Thanks to Novak for the unbelievable opportunity to work together and thanks to his team for all their hard work over the past six months. I wish Novak all the best for the rest of the season.\" The split comes just two weeks before the French Open starts on 25 May, where 24-time Grand Slam champion Djokovic is looking to win his fourth Roland Garros title. The pair started working together ahead of the Australian Open in January, where an injury ended Djokovic's run in his semi-final match against Alexander Zverev. Murray said during the tournament that he had not planned on jumping straight into coaching following his retirement last year, but that Djokovic's offer was too good to turn down. Djokovic sang Murray's praises and highlighted the impact he had had as his coach. Read more from Sky News:Actor Depardieu found guilty of sexual asssaultM&S says customers' personal data taken by hackers The tennis star, who won 24 out of his 36 matches against Murray, said at the Qatar Open in February that the two-time Wimbledon champion would coach him for an \"indefinite\" period, including \"some clay-court tournaments\" this season. However Djokovic, who is currently ranked sixth in the world, and Murray's coaching partnership has ended without any titles. Murray worked with Djokovic in Indian Wells and Miami, where the Serb reached the final but lost to Jakub Mensik. Djokovic's form dipped following the Miami defeat, with the 37-year-old losing his opening matches at Masters tournaments in Monte Carlo and Madrid in April. Djokovic's only title since 2023 was at the Paris Olympics last year, where he won the gold medal after beating Spaniard Carlos Alcaraz in the final."
    },
    {
        "title": "King to host President Macron on first state visit - and why it's such a big deal",
        "description": "The King will host French President Emmanuel Macron and his wife this summer on their first state visit to the UK.",
        "url": "https://news.sky.com/story/king-to-host-french-president-emmanuel-macron-on-first-state-visit-13367008",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-king-charles-emmanuel-macron_6574845.jpg?20250513101624",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-13 08:08:00",
        "Headline": "The Macrons visit to the UK has been announced ahead of Donald Trump, who was given an invite earlier this year but no date has been revealed.",
        "Content": "The King will host French President Emmanuel Macron and his wife this summer on their first state visit to the UK. Buckingham Palace announced the president has accepted the King's invitation and will visit from 8-10 July. Mr Macron and his wife, Brigitte Macron, will stay at Windsor Castle. Foreign Secretary David Lammy said a UK-France summit will happen during their visit \"to grow our economies, safeguard borders and bolster our security\". State visits are grand ceremonial affairs and usually include a carriage ride and a lavish state banquet. It will be the first state visit of a French president since March 2008, when Nicolas Sarkozy was invited by the late Queen. He also stayed at Windsor Castle. The Macrons hosted King Charles and Queen Camilla on a state visit to France in September 2023. \n                  Macron to beat Trump to UK state visit - report\n                 \n                  Russia 'reinterpreting' agreements in Black Sea ceasefire talks, Emmanuel Macron says\n                 \n                  UK, France and Ukraine to work on ceasefire and present plan to Trump, says Starmer\n                 It was meant to be his first state visit as monarch but was postponed due to protests, and he visited Germany, then Romania, ahead of France. The King and Queen were also hosted by Mr Macron in June 2024 when they attended events to mark the 80th anniversary of D-Day in Normandy, but that was not a state visit. The following month, Charles was seen greeting the French president at the European Political Community meeting at Blenheim Palace in Oxfordshire. Royal correspondent The offer of a state banquet is a big deal. They are seen as the ultimate diplomatic gift that the United Kingdom can give, as we quite literally roll out the red carpet for countries we really want to keep on side.  It's why there was so much debate about Trump being given his second and Sir Keir Starmer seeming in such a rush to extend the invitation. But after reports last month that Emmanuel Macron may get a state visit first, it has now been confirmed that the French President and his wife will be heading to Windsor Castle before the US President.  It will be Macron's first state visit, but his bromance with King Charles goes way back to when he was Prince of Wales, particularly spending time together on events related to the environment. But this is more than just the King inviting round an old friend. \n It shows that, as well as wanting to stay in Trump's good books, Europe also remains a priority for the government. We have seen it recently, with Prince William deployed to Estonia and the King and Queen sent to Italy.  A state visit for Macron reinforces that message of friendship, as international relationships have been turned on their head by the American visitor, who will also potentially be heading through the gates of Windsor Castle sometime soon. Read more:M&S says customers' personal data taken by hackersAndy Murray to stop working as Novak Djokovic's coach  Charles, 78, was diagnosed with cancer early last year and has been continuing his duties while undergoing treatment. The King is due to host US President Donald Trump after Sir Keir Starmer gave him an invite in February, but a date for the trip has not yet been announced."
    },
    {
        "title": "White South Africans arrive in US after Trump administration granted them refugee status",
        "description": "Dozens of white South Africans have arrived in the US after the Trump administration granted them refugee status in the country, having deemed them victims of racial discrimination.&#160;",
        "url": "https://news.sky.com/story/white-south-africans-arrive-in-us-after-trump-administration-granted-them-refugee-status-13367062",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-afrikaner-south-africa_6915004.jpg?20250513121401",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-13 12:40:00",
        "Headline": "President Donald Trump invited Afrikaners, the descendants of mainly Dutch settlers, to move to the US in February to escape the alleged discrimination they face in South Africa.",
        "Content": "Dozens of white South Africans have arrived in the US after the Trump administration granted them refugee status in the country, having deemed them victims of racial discrimination.Â  The first 59 Afrikaners were greeted by Christopher Landau, the US deputy secretary of state, at Washington's Dulles International Airport on Monday. President Donald Trump invited Afrikaners, the descendants of mainly Dutch settlers, to move to the US in February to escape the alleged discrimination they face at the hands of the black majority in South Africa. Mr Trump echoed his white South African-born ally Elon Musk on Monday as he told reporters at the White House that there was \"genocide that's taking place\", with Afrikaners being killed. Neither Mr Trump nor Mr Musk provided any evidence for this claim. Mr Trump also denied favouring Afrikaners because they are white, saying that their race \"makes no difference to me\". South Africa said there is no evidence of persecution of Afrikaners or a \"white genocide\", as Mr Musk called it, taking place in the country. \n                  Trump to lift sanctions on Syria - as he announces $600bn deal with Saudi Arabia\n                 \n                  US-Saudi relationship feels tighter than ever as Trump signs flurry of deals\n                 \n                  Trump's biggest 'deals' during second term so far\n                 Mr Landau said many of the South Africans who arrived in the US were farming families who could have the land they worked for generations expropriated. He also repeated Mr Trump's claims that they were facing threats of violence. Mr Trump's order to resettle Afrikaners came after South Africa introduced a land law that enables the state to expropriate land in the public interest. The policy caused concern among some white South Africans, despite no land being seized. Read more from Sky News:Gerard Depardieu found guilty of sexual assaultAndy Murray to stop working as Novak Djokovic's coach The US president cut all financial assistance to the country due to his disapproval of the land policy and South Africa's genocide case at the International Court of Justice against Israel, one of Washington's allies. 'We never expected this land expropriation thing to go so far,\" said one of the arrivals, Charl Kleinhaus, 46, who came to the US with his daughter, son and grandson and is set to resettle in Buffalo, New York. Mr Kleinhaus said that his life was threatened and that people tried to claim his property as their own, but his account could not be independently verified. The US would welcome more Afrikaners in the coming months, according to a spokesperson for the State Department. \"We think that the American government has got the wrong end of the stick here, but we'll continue talking to them,\" Cyril Ramaphosa, South Africa's president, said at a conference in Ivory Coast. Mr Ramaphosa said that the white Afrikaners who arrived in the US had left South Africa because they were against the policies aimed at addressing racial inequality, which has persisted in the country since the apartheid rule of the white minority ended three decades ago."
    },
    {
        "title": "Trump says it would be 'stupid' not to accept Qatari plane - as jet already in the US",
        "description": "Donald Trump has claimed it would be \"stupid\" not to accept the gift of a free Qatari plane to replace Air Force One, with the jet already in the US, according to flight tracking data.",
        "url": "https://news.sky.com/story/trump-says-it-would-be-stupid-not-to-accept-qatari-plane-as-jet-already-in-the-us-13366928",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-air-force-one-jet-plane_6914667.png?20250513020237",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-13 00:43:00",
        "Headline": "Critics of Donald Trump's move to accept an Air Force One replacement from Qatar have warned that it threatens to turn a global symbol of American power into an airborne collection of ethical, legal, security and counterintelligence concerns.",
        "Content": " Donald Trump has claimed it would be \"stupid\" not to accept the gift of a free Qatari plane to replace Air Force One, with the jet already in the US, according to flight tracking data. The US president toured the Boeing 747-8 earlier this year and he is now preparing to accept it as a gift from the Qatari royal family. Despite concerns raised over the president accepting the $400m (Â£303m) gift, Mr Trump told reporters on Monday: \"I think it's a great gesture from Qatar.\" He added: \"I appreciate it very much. I would never be one to turn down that kind of an offer. \"I mean, I could be a stupid person saying: 'No, we don't want a free, very expensive airplane'.\" The jet is currently sitting at San Antonio International Airport, according to tracking data, Sky News' US partner NBC News reported, adding it has been parked there since 3 April. It is the same plane the US leader toured at Palm Beach International Airport on 15 February. Friendly fire Critics of the plan have warned that the move threatens to turn a global symbol of American power into an airborne collection of ethical, legal, security and counterintelligence concerns. In an effort to cut off some opposition, Mr Trump said he would not keep the plane after his term finished, instead donating it to a future presidential library. However, that has done little to quell anger, which has even come from within the Republican party. \"My view is that it would be better if Air Force One were a big, beautiful jet made in the United States of America. That would be ideal,\" said senator Josh Hawley. Senator Rand Paul, when asked whether Mr Trump should accept the plane, simply said: \"No.\"  Some of the most vocal members of his MAGA group of supporters, including Ben Shapiro and Laura Loomer, have voiced their opposition to the move in a rare show of dissent to the president they usually back so vociferously. Mr Trump will likely face questions over the plane in the coming days as he travels to the Middle East, including a stop in Qatar. Inside the 'palace in the sky' The following images are from inside the Boeing 747-8 that Mr Trump is pushing to accept. It shows the luxury jet before any potential refitting it might undergo in the hands of the US president. The 78-year-old has previously complained about Boeing taking too long to deliver the new Air Force One planes commissioned during his first term. The current Air Force One planes were built from scratch near the end of the Cold War and host a range of improved security features, including being hardened against the effects of a nuclear blast and hosting a vast communications suite. A former US official briefed on the replacement project said there would be no time to add the full host capabilities to the Qatari replacement plane. Read more:Trump attacks Europe as he hails China 'reset'Why Trump's Middle East tour takes on new importanceSky correspondent on her run-in with Trump loyalist There are fears Mr Trump would be compromising security by rushing to modify the replacement jet. William Evanina, who served as director of the National Counterintelligence and Security Center during Mr Trump's first term, said checking the Qatari plane for surveillance devices alone would \"take years\". Others have also questioned what it means for the sitting president to accept such an expensive gift."
    },
    {
        "title": "US-Saudi relationship feels tighter than ever as Trump signs flurry of deals",
        "description": "In today's Saudi Arabia, convention centres resemble palaces.&#160;",
        "url": "https://news.sky.com/story/us-saudi-relationship-feels-tighter-than-ever-as-trump-signs-flurry-of-deals-13367279",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-mohammed-bin-salman_6915608.jpg?20250513213622",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-05-13 16:04:00",
        "Headline": "There are huge challenges like Gaza, but President Trump and Saudi Crown Prince Mohammed bin Salman see big opportunities too. A deal with Iran, a new Syria, and Gulf countries that are global players.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n In today's Saudi Arabia, convention centres resemble palaces.Â  The King Abdul Aziz International Conference Centre was built in 1999 but inside it feels like Versailles. Some might call it kitsch, but it's a startling reflection of how far this country has come - the growth of a nation from desert bedouins to a vastly wealthy regional powerbroker in just one generation. Trump latest: President signs huge arms deal with Saudi Arabia  At a bar overnight, over mocktails and a shisha, I listened to one young Saudi man tell me how his family had watched this transformation. His father, now in his 60s, had lived the change - a child born in a desert tent, an upbringing in a dusty town, his 30s as a mujahideen fighting the Soviets in Afghanistan, his 40s in a deeply conservative Riyadh and now his 60s watching, wide-eyed, the change supercharged in recent years. The last few years' acceleration of change is best reflected in the social transformation. Women, unveiled, can now drive. But that's just the headline. The depth of change has been astonishing. Laws governing every aspect of women's lives have been ripped up. They can work in every industry, and the government. A few years ago they couldn't watch a football match. Now, as the Kingdom prepares for the World Cup, there is a female football league. The leaps forward into international norms have been profound. Through a 'western' lens, there's a way to go - homosexuality is illegal. Political dissent is firmly off limits and the murder of Saudi journalist Jamal Khashoggi is absolutely not openly discussed here. Bluntly, political and economic expedience have moved world leaders and business leaders beyond all that. Read more:Why Trump's idea of using a Qatari jet has faced criticismTrump 'thinking' of going to proposed Zelenskyy-Putin peace talks  The guest list of delegates at the convention centre for the Saudi-US Investment Forum reads like a who's who of America's best business brains. Signing a flurry of different deals worth about $600bn (Â£451bn) of inward investment from Saudi to the US - which actually only represent intentions or 'memorandums of understanding' at this stage - the White House said: \"The deals... represent a new golden era of partnership between the United States and Saudi Arabia. \"From day one, President Trump's America First Trade and Investment Policy has put the American economy, the American worker, and our national security first.\" That's the answer when curious voters in faraway America wonder what this is all about. With opulence and extravagance, this is about a two-way investment and opportunity. There are defence deals - the largest defence sales agreement in history, at nearly $142bn (Â£106bn) - tech deals, and energy deals. Underlying it all is the expectation of diplomatic cooperation, investment to further the geopolitical strategies for both countries on key global challenges.  In the convention centre's gold-clad corridors, outside the plenary hall, there are reminders of the history of this relationship. There is a 'gallery of memories' - the American presidents with the Saudi kings - stretching back to the historic 1945 meeting between Franklin D Roosevelt and King Saud on board the USS Quincy. That laid the foundation for the relationship we now see. Curiously, the only president missing is Barack Obama. Sources suggested to me that this was a 'mistake'. A convenient one, maybe. It's no secret that the US-Saudi relationship was at its most strained during his presidency. Obama's absence would give Trump a chuckle.  Today, the relationship feels tighter than ever. There is a mutual respect between the president and Saudi Crown Prince Mohammed bin Salman - Trump chose Saudi Arabia as his first foreign trip in his last presidency, and he's done so again. But there are differences this time. Both men are more powerful, more self-assured, and of course the region has changed. There are huge challenges like Gaza, but the two men see big opportunities too. A deal with Iran, a new Syria, and Gulf countries that are global players. It's money, money, money here in Riyadh. Will that translate to a better, more prosperous and peaceful world? That's the question."
    },
    {
        "title": "Trump's biggest 'deals' during second term so far",
        "description": "Donald Trump has often said that his \"favourite word\" is \"tariff\". Surely \"deal\" would come a close second.",
        "url": "https://news.sky.com/story/trumps-biggest-deals-during-second-term-to-date-13367231",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-white-house_6914680.jpg?20250513035036",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-13 14:46:00",
        "Headline": "Mr Trump has claimed that his work to date is worth $10trn to the US economy but experts have said the values are likely to be much lower and almost impossible to quantify.",
        "Content": "Donald Trump has often said that his \"favourite word\" is \"tariff\". Surely \"deal\" would come a close second. The president's new term in the White House has been dominated by a protectionist agenda aimed at restoring America's domestic manufacturing base and jobs. His primary objective is cutting America's trade deficit - by which the country imports more in value terms, than it exports. That gap, the largest for any country in the world, stands at about $1.1trn (Â£830bn) annually. The threat of, and later, the implementation of stop-start tariffs has flung the global trade order into chaos, with some companies and traditional trading partners taking the opportunity of a \"deal\", when able to. Mr Trump has claimed that his work to date is worth $10trn (Â£7.5trn) to the US economy but experts have said the values are likely to be much lower and almost impossible to quantify. Here, we outline some of the big deals to have been claimed so far in a bid to achieve Mr Trump's economic and trade goals. \n                  Trump to lift sanctions on Syria - as he announces $600bn deal with Saudi Arabia\n                 \n                  US-Saudi relationship feels tighter than ever as Trump signs flurry of deals\n                 \n                  White South Africans arrive in US after Trump administration granted them refugee status\n                  Stargate A boost to AI infrastructure in the US was announced by the president on his first full day back in the White House. The OpenAI-led venture, mostly funded by Japan's Softbank, will see up to $500bn (Â£375bn) spent on data centres up to 2029. It has been widely reported this week that progress has stalled, however, due to US trade tariffs. Apple The iPhone maker announced in February its largest ever spending commitment, of more than $500bn (Â£375bn) over four years. Along with AI data centres, the company has pledged to build an \"advanced\" factory in Texas under Mr Trump's push for US manufacturing growth. Nvidia The world's most valuable chipmaker revealed in April that it was to invest $500bn (Â£375bn) in the US over four years. The company, which makes the majority of its chips in Taiwan currently, said it was to spend the bulk of the money on domestic AI servers. Two manufacturing plants - in Arizona and Texas - will also be expanded under the plans.  US-UK trade deal More of a truce than a comprehensive trade deal - and almost impossible to put a value on given the disruption to date - but this was the first \"deal\" that the Trump administration did to end some tariffs against a country. It sees 25%+ duties on UK-made cars cut to 10% under a quota system that will also see steel tariffs scrapped. However, a 10% levy remains on all other goods. Prime Minister Sir Keir Starmer said that the partially completed agreement would save \"thousands of jobs\".  US-China trade deal The president hailed a \"reset\" in relations with China following a deal, revealed on 12 May, that will end the effective trade embargo between the world's two largest economies. US tariffs of 145% and those imposed by China, of up to 125%, had effectively killed most trade altogether but have been paused for 90 days. They have been replaced by effective rates of 30% and 10% respectively. Saudi Arabia Donald Trump signed a \"$600bn deal\" with Saudi Arabia, which includes the \"largest defence sales agreement in history\" on Tuesday 13 May. He said during his visit to the kingdom that, in addition to purchases of $142bn (Â£107bn) of US-made military equipment, there will also be multi-billion dollar deals in Saudi Arabia with US firms including Amazon, Uber and Oracle."
    },
    {
        "title": "Cassie tells court 'freak offs' became like a job as she alleges years of abuse by Sean 'Diddy' Combs",
        "description": "Sean \"Diddy\" Combs's former girlfriend Cassie has told his sex-trafficking trial that \"freak offs\" with male escorts became like a job, as the music mogul allegedly abused and sexually exploited her for years.",
        "url": "https://news.sky.com/story/cassie-tells-court-freak-offs-became-like-a-job-as-she-alleges-years-of-abuse-by-sean-diddy-combs-13367399",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cassie-sean-diddy-combs_6915488.jpg?20250513182306",
        "type": "US",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-13 20:15:00",
        "Headline": "During the second day of evidence in the Sean Combs sex-trafficking trial, his former partner Cassie, who is eight months pregnant, spent about six hours on the witness stand, alleging she was degraded and sexually abused for years - which he denies. Her evidence continues on Wednesday.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Sean \"Diddy\" Combs's former girlfriend Cassie has told his sex-trafficking trial that \"freak offs\" with male escorts became like a job, as the music mogul allegedly abused and sexually exploited her for years. The musician and model, whose full name is Casandra Ventura, did not look at Combs as she took to the witness stand in court in Manhattan, New York. Over about six hours, the 38-year-old, who is eight months pregnant with her third child with husband Alex Fine, at times became emotional as she alleged she was degraded by her former partner during their 10-year on-off relationship. Sean 'Diddy' Combs trial: Day 2 - As it happened  Combs, 55, has pleaded not guilty and strenuously denied allegations of sexual abuse. His lawyers argue that although he could be violent, he never veered into sex trafficking and racketeering, and that all sexual encounters were consensual. Ms Ventura, who is the central witness in the prosecutors' case, began by telling the jury how Combs was violent to her over the course of their relationship, giving her black eyes and bruises. The hip-hop star became increasingly controlling, she said, and was allegedly abusive over the smallest perceived slights. \"You make the wrong face, and the next thing I knew I was getting hit in the face,\" she said. Ms Ventura was 19 when she signed to his label, Bad Boy, she said, and 22 when, during the first year of their relationship, Combs first proposed a \"freak off\" - a sexual encounter with a third party. Her \"stomach churned\", she said, and she was \"confused, nervous, but also loved him very much\" and wanted to please him. She described him as \"charming\" but \"polarising\".  'There was no space to do anything else' Throughout her time on the stand, she gave graphic details of these drug and drink-fuelled encounters with male escorts, saying Combs would watch and masturbate, and often record the encounters and watch the videos back. They could last for hours or even days, she said - telling the court the longest went on for four days. They ended up becoming weekly events and took priority over her music career, jurors heard. While she had hits with singles Me & U and Long Way 2 Go in 2006, and signed a 10-album deal with Bad Boy, jurors heard she only released one album. \"Freak-offs became a job where there was no space to do anything else but to recover and just try to feel normal again,\" Ms Ventura said. Each time, she added, she had to recuperate from lack of sleep, alcohol, drugs \"and other substances\", and \"having sex with a stranger for days\". Read more:The rise and fall of Sean CombsDiddy - a timeline of allegationsEverything you need to know about the trial Alleged violence detailed in court Ms Ventura told the court she began feeling as if she could not say no to Combs's demands because \"there were blackmail materials to make me feel like if I didn't do it, it would be held over my head in that way or these things would become public\". She was also worried about potential violence, she told the court. When asked in court how frequently Combs became violent with her, Ms Ventura responded: \"Too frequently.\" The rapper \"would mash me in the head, knock me over, drag me, kick me\", she said. \"Stomp me in the head if I was down\". Ms Ventura also told the court that Combs kept cash, jewellery, guns and \"sometimes tapes from cameras\" in safes at several properties in New York, Los Angeles, Miami and Alpine, New Jersey. \"The guns came out here and there. I always felt it was a little bit of a scare tactic,\" she told the court. Towards the end of her first day of evidence, a surveillance video made public last year, which showed Combs allegedly beating Ms Ventura at a Los Angeles hotel in 2016, was played to jurors in court for a second time. \"How many times has he thrown you like that before?\" prosecutor Emily Johnson asked her. \"Too many to count,\" Ms Ventura replied. On Monday, prosecutors in their opening statement told the court that while Combs's public persona was that of a \"charismatic\" hip-hop mogul, behind the scenes he was violent and abusive. His defence lawyers argued that the case is really about nothing more than the rapper's sexual preferences, which they said should remain private, and do not make him a sex trafficker. The trial is to last about eight weeks. Ms Ventura is set to continue giving evidence on Wednesday."
    },
    {
        "title": "Sean 'Diddy' Combs trial: What we know about the 12 members of the jury",
        "description": "The outcome of the Sean \"Diddy\" Combs sex trafficking trial is in the hands of the 12 individuals who have been selected as jurors.&#160;",
        "url": "https://news.sky.com/story/sean-diddy-combs-trial-what-we-know-about-the-12-members-of-the-jury-13366986",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-sean-combs-2022-p-diddy_6754650.jpg?20241122162548",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-13 07:04:00",
        "Headline": "Eight men and four women have been selected to serve on the jury during the high-profile sex trafficking trial. They range from ages 30 to 74 and come from different neighbourhoods across New York. Here is what we know.",
        "Content": "The outcome of the Sean \"Diddy\" Combs sex trafficking trial is in the hands of the 12 individuals who have been selected as jurors.Â  On Monday, the group of jurors - made up of eight men and four women - listened to opening statements from the prosecution and defence as the trial got underway in Manhattan, New York. The 55-year-old hip-hop mogul has strenuously denied the allegations against him and pleaded not guilty to five charges. They are: One count of racketeering conspiracy, two counts of sex trafficking by force, fraud or coercion, and two counts of transportation to engage in prostitution. Members of the jury range in age from 30 to 74, coming from different neighbourhoods across New York, and from a wide range of professions. Here is everything we know about the group tasked with deciding the outcome of the high-profile case.  How were jurors selected? The 12 individuals were whittled down from a pool of 45 prospective jurors last week. During the selection process, each individual was questioned by Judge Arun Subramanian in a legal process known as \"voir dire\" - translated from French as \"to speak the truth\". The process aims to find a panel of 12 main jurors and six alternates who can be fair and impartial. That has been a particularly sensitive issue in this trial, given Combs' celebrity status as an entrepreneur and rap mogul and the worldwide coverage of the case so far. Jurors were quizzed about their hobbies and musical tastes, with some of the younger jurors in their 30s and 40s saying they listen to hip-hop and R&B music - genres that are closely associated with Combs. They were also asked if they had any views on the prosecution or the defence, if they or someone close to them had been a victim of crime, and their beliefs on hiring sex workers, the use of illegal drugs, hip-hop artists and law enforcement. Judge Subramanian then asked jurors whether they had heard of names included on a list of individuals, including celebrities, who may be mentioned during the trial. The list is long, the court heard, with the judge saying it reminded him of Lord Of The Rings.  As jury selection unfolded, Combs sat in court wearing a white shirt with a black crew-neck sweater, grey trousers and glasses. He appeared to express his approval or disapproval at each individual, either with a nod or by shaking his head no, to his attorneys. Read more about how jury selection unfolded in court here. Read more:Diddy on trial: Everything you need to knowSean Combs: A timeline of allegations What to know about those selected The individuals selected to sit on the jury include an investment analyst, a healthcare worker, a massage therapist and a deli worker, according to Sky News' US partner network, NBC News. When called for jury duty, potential jurors are allocated a number, which allows the court to keep track of the individuals and ensures a random selection process. Here is everything we know about those selected for Combs's trial: â€¢ Juror no 2: A 69-year-old male from Manhattan who works as an actor and massage therapist. He listens to classical, jazz and rock music, and his hobbies include music, theatre, cycling and hiking. â€¢ Juror no 5: A 31-year-old male from Manhattan who works as an investment analyst. He enjoys playing sports and video games. â€¢ Juror no 25: A 51-year-old male from Manhattan who has a PhD in molecular biology and neuroscience. He listens to classical music and opera, and his hobbies include art, science, cooking and the outdoors. â€¢ Juror no 28: A 30-year-old female from the New York borough of the Bronx, who works in a deli. She listens to hip-hop and reggaeton and enjoys reading and playing video games. â€¢ Juror no 55: A 42-year-old female from Manhattan who is an aide in a nursing home. She likes to cook and paint, and watch Harry Potter and Disney films. â€¢ Juror no 58: A 41-year-old male from the Bronx who works in communications at a US prison. He listens to reggaeton and '90s hip-hop, and his hobbies include sports and fantasy football. â€¢ Juror no 75: A 68-year-old male from Westchester County, just north of New York City, who is a retired bank worker. He listens to Indian music and plays cricket and volleyball. â€¢ Juror no 116: A 68-year-old male from Westchester County who is retired and used to work at a telecommunications company. He listens to rock music, and likes to bowl and play golf. â€¢ Juror no 160: A 43-year-old female from Westchester County who works as a healthcare worker. She listens to R&B and hip-hop, and likes dancing. â€¢ Juror no 184: A 39-year-old male from the Bronx who is a social worker. He listens to R&B and popular music from West Africa, and enjoys watching sports. â€¢ Juror no 201: A 67-year-old male from Westchester County who works as a logistics analyst. His hobbies include woodworking and cycling. â€¢ Juror no 217: A 74-year-old female from Manhattan who works as a treatment coordinator. She listens to classical music and likes to travel. The six alternate jurors chosen include four men and two women, ranging in age from 24 to 71. Those individuals will hear the entire case but will only participate in the decision-making if one of the 12 main jurors cannot continue. The trial is expected to last around eight weeks."
    },
    {
        "title": "Rapper Tory Lanez 'stabbed 14 times' while serving sentence for Megan Thee Stallion shooting",
        "description": "Rapper Tory Lanez has said he was stabbed 14 times while serving his prison sentence for shooting hip-hop star Megan Thee Stallion in the foot.&#160;",
        "url": "https://news.sky.com/story/rapper-tory-lanez-stabbed-14-times-while-serving-sentence-for-megan-thee-stallion-shooting-13366981",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-tory-lanez-megan-thee-stallion_6914751.jpg?20250513075719",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-13 09:17:00",
        "Headline": "Lanez is serving a 10-year sentence for shooting Megan Thee Stallion, whose legal name is Megan Pete, in the foot after leaving a party at Kylie Jenner's Hollywood Hills home in July 2020.",
        "Content": "Rapper Tory Lanez has said he was stabbed 14 times while serving his prison sentence for shooting hip-hop star Megan Thee Stallion in the foot.Â  Lanez, 32, sustained \"7 wounds to his back, 4 to his torso, 2 to the back of his head, and 1 to the left side of his face\", according to a post on his verified Instagram account. Canadian Lanez, whose legal name is Daystar Peterson, was attacked at the California Correctional Institution in Tehachapi at 7.20am (3.20pm UK time) on Monday, according to a spokesman for the Department of Corrections and Rehabilitation. He was hospitalised following the stabbing, which is being investigated by authorities. \"Both of his lungs collapsed,\" the rapper's social media statement said, adding Lanez was \"now breathing on his own\". \"Despite being in pain, he is talking normally, in good spirits, and deeply thankful to God that he is pulling through. He also wants to thank everyone for their continued prayers and support,\" the post said. Lanez is serving a 10-year sentence for shooting Megan Thee Stallion, 30, in the foot and shouting at her to dance as she walked away from an SUV they drove in after leaving a party at Kylie Jenner's Hollywood Hills home in July 2020. \n                  Megan Thee Stallion granted restraining order against imprisoned Tory Lanez after 2020 shooting\n                 \n                  Tory Lanez sentenced to 10 years in prison for shooting Megan Thee Stallion in the foot\n                 \n                  Rapper Tory Lanez found guilty over shooting of hip hop star Megan Thee Stallion\n                 He was convicted of assault with a semiautomatic firearm, having a loaded, unregistered firearm in a vehicle and discharging a firearm with gross negligence in December 2022. In January, a Los Angeles judge granted her request for a protective order until early 2030 after she alleged Lanez had been harassing her from prison through surrogates. Megan Thee Stallion, whose legal name is Megan Pete, was already a rising hip-hop star at the time of the shooting, and her music's popularity has only soared since. Read more from Sky News:What it was like in court for start of P Diddy trialKim Kardashian's Paris robbery: Everything you need to know She had number one singles with Savage and as a guest on Cardi B's WAP in 2020, winning a Grammy for best new artist a year later. Lanez started to release mixtapes in 2009 and steadily rose in popularity, moving on to major label albums, with his last two reaching the top 10 on the Billboard charts."
    },
    {
        "title": "Trump says it would be 'stupid' not to accept Qatari plane - as jet already in the US",
        "description": "Donald Trump has claimed it would be \"stupid\" not to accept the gift of a free Qatari plane to replace Air Force One, with the jet already in the US, according to flight tracking data.",
        "url": "https://news.sky.com/story/trump-says-it-would-be-stupid-not-to-accept-qatari-plane-as-jet-already-in-the-us-13366928",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-air-force-one-jet-plane_6914667.png?20250513020237",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-13 00:43:00",
        "Headline": "Critics of Donald Trump's move to accept an Air Force One replacement from Qatar have warned that it threatens to turn a global symbol of American power into an airborne collection of ethical, legal, security and counterintelligence concerns.",
        "Content": " Donald Trump has claimed it would be \"stupid\" not to accept the gift of a free Qatari plane to replace Air Force One, with the jet already in the US, according to flight tracking data. The US president toured the Boeing 747-8 earlier this year and he is now preparing to accept it as a gift from the Qatari royal family. Despite concerns raised over the president accepting the $400m (Â£303m) gift, Mr Trump told reporters on Monday: \"I think it's a great gesture from Qatar.\" He added: \"I appreciate it very much. I would never be one to turn down that kind of an offer. \"I mean, I could be a stupid person saying: 'No, we don't want a free, very expensive airplane'.\" The jet is currently sitting at San Antonio International Airport, according to tracking data, Sky News' US partner NBC News reported, adding it has been parked there since 3 April. It is the same plane the US leader toured at Palm Beach International Airport on 15 February. Friendly fire Critics of the plan have warned that the move threatens to turn a global symbol of American power into an airborne collection of ethical, legal, security and counterintelligence concerns. In an effort to cut off some opposition, Mr Trump said he would not keep the plane after his term finished, instead donating it to a future presidential library. However, that has done little to quell anger, which has even come from within the Republican party. \"My view is that it would be better if Air Force One were a big, beautiful jet made in the United States of America. That would be ideal,\" said senator Josh Hawley. Senator Rand Paul, when asked whether Mr Trump should accept the plane, simply said: \"No.\"  Some of the most vocal members of his MAGA group of supporters, including Ben Shapiro and Laura Loomer, have voiced their opposition to the move in a rare show of dissent to the president they usually back so vociferously. Mr Trump will likely face questions over the plane in the coming days as he travels to the Middle East, including a stop in Qatar. Inside the 'palace in the sky' The following images are from inside the Boeing 747-8 that Mr Trump is pushing to accept. It shows the luxury jet before any potential refitting it might undergo in the hands of the US president. The 78-year-old has previously complained about Boeing taking too long to deliver the new Air Force One planes commissioned during his first term. The current Air Force One planes were built from scratch near the end of the Cold War and host a range of improved security features, including being hardened against the effects of a nuclear blast and hosting a vast communications suite. A former US official briefed on the replacement project said there would be no time to add the full host capabilities to the Qatari replacement plane. Read more:Trump attacks Europe as he hails China 'reset'Why Trump's Middle East tour takes on new importanceSky correspondent on her run-in with Trump loyalist There are fears Mr Trump would be compromising security by rushing to modify the replacement jet. William Evanina, who served as director of the National Counterintelligence and Security Center during Mr Trump's first term, said checking the Qatari plane for surveillance devices alone would \"take years\". Others have also questioned what it means for the sitting president to accept such an expensive gift."
    },
    {
        "title": "Trump 'thinking' of going to Turkey for proposed Zelenskyy-Putin talks - as Russia silent on attending",
        "description": "Donald Trump has said he is \"thinking\" of going to Turkey on Thursday for potential peace talks between Ukraine and Russia's leaders.",
        "url": "https://news.sky.com/story/trump-thinking-of-going-to-turkey-for-proposed-zelenskyy-putin-talks-as-russia-silent-on-attending-13366932",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-white-house_6914680.jpg?20250513035036",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-13 02:45:00",
        "Headline": "It still isn't clear whether Vladimir Putin will respond to Volodymyr Zelenskyy's invitation to meet in person in Istanbul on Thursday, despite growing pressure in recent days from European leaders.",
        "Content": "Donald Trump has said he is \"thinking\" of going to Turkey on Thursday for potential peace talks between Ukraine and Russia's leaders. The US president, who previously claimed he could end the conflict in a day, has pushed for both sides to meet to bring the fighting to an end. On Sunday, Ukraine's Volodymyr Zelenskyy called out Vladimir Putin to meet him on Thursday in Istanbul, but the Kremlin leader has yet to respond. Speaking late on Monday, Mr Trump said: \"I was thinking about flying over. I don't know where I am going be on Thursday. \"I've got so many meetings. \"There's a possibility there I guess, if I think things can happen.\" Mr Trump has headed to the Middle East this week on the first major foreign trip of his second administration, visiting Saudi Arabia, Qatar and the UAE. Mr Zelenskyy backed the prospect of Mr Trump attending the talks. He said: \"I supported President Trump with the idea of direct talks with Putin. I have openly expressed my readiness to meet. \"And of course, all of us in Ukraine would appreciate it if President Trump could be there with us at this meeting in Turkey.\"  Russia playing for time? However, Kremlin spokesperson Dmitry Peskov, speaking on Monday, refused to say who, if anyone, would be travelling to Turkey from the Russian side. \"Overall, we're determined to seriously look for ways to achieve a long-term peaceful settlement. That is all,\" Mr Peskov said. This came after the \"coalition of the willing\", including Sir Keir Starmer, threatened Russia with fresh sanctions if it failed to comply with an unconditional 30-day ceasefire starting on Monday. Russia effectively rejected this proposal, instead calling for direct negotiations in Istanbul with Ukraine, at which Mr Zelenskyy challenged Mr Putin to make the trip himself. Despite Russia's claims towards wanting peace, Ukraine's allies remained deeply sceptical about prospects for talks and whether Mr Putin was serious. Read more:Why Trump's Middle East tour takes on new importanceSky correspondent on her run-in with Trump loyalistDid Trump blink in the US-China trade war? European Union commission vice president Kaja Kallas said: \"We want to see that Russia also wants peace. \"It takes two to want peace, it takes only one to want war, and we see that Russia clearly wants war.\" Meanwhile, Russia continued its nightly attacks on Ukraine. Overnight into Tuesday, Ukraine said Moscow launched more than 100 drones."
    },
    {
        "title": "Air Force One: Why Trump's idea of using a Qatari jet as the 'flying Oval Office' has faced criticism ",
        "description": "The two customised Boeing 747-200B aircraft - which become known as Air Force One when the US President steps onboard - are among the most recognisable symbols of America on the global stage.",
        "url": "https://news.sky.com/story/air-force-one-why-trumps-idea-of-using-a-qatari-jet-as-the-flying-oval-office-has-faced-criticism-13367030",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-air-force-one-donald-trump_6915332.jpg?20250513154024",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-13 09:06:00",
        "Headline": "Air Force One is seen as a global symbol of American power. It is for this reason, among others, that Donald Trump has come under fire for wanting to accept a Qatari Boeing 747-8 to replace the traditional presidential plane.",
        "Content": "The two customised Boeing 747-200B aircraft - which become known as Air Force One when the US President steps onboard - are among the most recognisable symbols of America on the global stage. Made by an American company and emblazoned with the words United States of America, the US flag, and the presidential seal, they not only ferry the president around but also provide a \"flying Oval Office\" to allow work to continue. It is for these reasons, among others, that the idea of Mr Trump accepting a Qatari plane to replace Air Force One has led to concerns. Trump latest: Follow live updates Described in some reports as a \"palace in the sky\", the Boeing 747-8 jumbo would be a gift from the Qatari royal family - a move Mr Trump has described as a \"great gesture\". But the move has sparked criticism from opponents - who have raised security fears and concerns over the eligibility of such a gift - as well as from the Republican Party, and even some voices from within Mr Trump's Make America Great Again (MAGA) movement. The 78-year-old has previously complained about Boeing taking too long to deliver the new Air Force One planes commissioned during his first term, and has suggested the Qatari 747-8 could provide a stopgap in place of the current jets. He has also vowed not to keep the plane after his term finishes, instead saying he will donate it to a future presidential library.  The 'flying Oval Office' More than a means of transport, the planes which currently serve as Air Force One are specifically built 747-200B Boeing aircraft. The latest models have 4,000 square feet of interior space and feature various rooms, including a conference room, an office area for senior White House staff, two galleys that can feed up to 100 people, work and rest areas for presidential staff and members of the press and private quarters for the president. A doctor is permanently onboard in case of an emergency, as well as a medical suite that can function as an operating theatre if needed. The Air Force One aircraft also have the ability to refuel mid-flight. The modifications mean it can take on fuel from a tanker aircraft while both are in the air, meaning it has unlimited range and can carry the president wherever he needs. With state-of-the-art navigation, hardened electronics, secure communications systems and an array of defensive countermeasures, it can also function as a \"mobile command centre\" in the event of an attack on the US, according to the White House website. The planes are kept at the high-security compound Joint Base Andrews facility in Maryland, which is just outside of Washington, DC. Development over the years Air Force One planes have been used by the US president since Dwight D Eisenhower in the 1950s. Back then, the VC-137A, a Boeing 707 Stratoliner, was used. The first took Eisenhower to Europe in 1959 and was nicknamed Queenie. At the time, the plane could fly up to 40 passengers, had a special telecommunications section, a conference area, and a stateroom. From there, the Boeing 707 was adopted for presidential use and in 1962, John F Kennedy became the first president to fly in a jet specifically built for the US leader. The current Air Force One planes - which are customised Boeing 747-200B series aircraft, which carry the tail codes 28000 and 29000 - were built from scratch near the end of the Cold War in the 1990s. The aircraft have been used by six presidents, starting during the term of George W Bush, and replacing them has been a long-term priority for Mr Trump. Other world leaders do have similar modes of transport, but not quite on the same level. In the UK, an RAF Voyager plane was sprayed white and had the Union Jack put on its tail back in 2022. The aircraft, named Vespina, is a functioning VIP jet and has been used by the government and the King and Queen for foreign visits. India's Air India One, Germany's Airbus A350s, Japan's Air Force One and Air Force Two and Russia's Il-96-300PU are all aircraft specifically for government officials and dignitaries. Read more from Sky News:Trump 'thinking' of attending proposed Zelenskyy-Putin talksWhy does Saudi Arabia love Trump? Presidential planes, trains and automobiles  Though many people picture the Air Force One planes when they hear the name, the term is actually used to describe the call sign for any aircraft that the president is travelling on. It is even extended to other modes of transport, including Ground Force Once - the fleet of black armoured buses used to transport the president and other dignitaries - and Rail Force Once - a train carriage used by Joe Biden as he made the 10-hour trip from Poland to visit Ukraine in 2023. Cadillac One, also known as The Beast, is the president's official limousine. There are three of these cars in total, which are reported to cost more than Â£1m each. All are complete with bulletproof windows, puncture-resistant tyres and weigh between eight and nine tonnes. The Marine Corps also operates a fleet of helicopters, which are used by the president when a motorcade is not suitable. The call sign for any Marine Corps helicopter carrying the US leader is Marine One. Backdrop of historic moments Air Force One has been the backdrop for some of the most memorable moments in US history. In November 1963, hours after Kennedy was assassinated, Lyndon Johnson was sworn in as president on board the plane. Unlike presidents before and after him, there was no inauguration ceremony, and only a handful of people witnessed Johnson become the 36th president, while the plane sat on the tarmac at Love Field Airport in Dallas, Texas. Richard Nixon took Air Force One when he made a historic trip to Beijing in 1972, becoming the first sitting US president to visit the People's Republic of China. Over the course of the trip, he met Mao Zedong, then chairman of the central committee of the Chinese Communist Party, and other Chinese officials, and negotiated improving relations between China and the US. The day the World Trade Centers were hit on 9 September 2001, George W Bush was in a classroom in Florida. He received news of the attack from his chief of staff Andrew Card, and was rushed to the airport where he travelled on Air Force One, first to Louisiana, then to Nebraska. Whilst in the air, the then president made crucial decisions about security whilst trying to communicate with officials on the ground. He insisted that he return to the White House, where he made an address to the nation."
    },
    {
        "title": "White South Africans arrive in US after Trump administration granted them refugee status",
        "description": "Dozens of white South Africans have arrived in the US after the Trump administration granted them refugee status in the country, having deemed them victims of racial discrimination.&#160;",
        "url": "https://news.sky.com/story/white-south-africans-arrive-in-us-after-trump-administration-granted-them-refugee-status-13367062",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-afrikaner-south-africa_6915004.jpg?20250513121401",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-13 12:40:00",
        "Headline": "President Donald Trump invited Afrikaners, the descendants of mainly Dutch settlers, to move to the US in February to escape the alleged discrimination they face in South Africa.",
        "Content": "Dozens of white South Africans have arrived in the US after the Trump administration granted them refugee status in the country, having deemed them victims of racial discrimination.Â  The first 59 Afrikaners were greeted by Christopher Landau, the US deputy secretary of state, at Washington's Dulles International Airport on Monday. President Donald Trump invited Afrikaners, the descendants of mainly Dutch settlers, to move to the US in February to escape the alleged discrimination they face at the hands of the black majority in South Africa. Mr Trump echoed his white South African-born ally Elon Musk on Monday as he told reporters at the White House that there was \"genocide that's taking place\", with Afrikaners being killed. Neither Mr Trump nor Mr Musk provided any evidence for this claim. Mr Trump also denied favouring Afrikaners because they are white, saying that their race \"makes no difference to me\". South Africa said there is no evidence of persecution of Afrikaners or a \"white genocide\", as Mr Musk called it, taking place in the country. \n                  Trump to lift sanctions on Syria - as he announces $600bn deal with Saudi Arabia\n                 \n                  US-Saudi relationship feels tighter than ever as Trump signs flurry of deals\n                 \n                  Trump's biggest 'deals' during second term so far\n                 Mr Landau said many of the South Africans who arrived in the US were farming families who could have the land they worked for generations expropriated. He also repeated Mr Trump's claims that they were facing threats of violence. Mr Trump's order to resettle Afrikaners came after South Africa introduced a land law that enables the state to expropriate land in the public interest. The policy caused concern among some white South Africans, despite no land being seized. Read more from Sky News:Gerard Depardieu found guilty of sexual assaultAndy Murray to stop working as Novak Djokovic's coach The US president cut all financial assistance to the country due to his disapproval of the land policy and South Africa's genocide case at the International Court of Justice against Israel, one of Washington's allies. 'We never expected this land expropriation thing to go so far,\" said one of the arrivals, Charl Kleinhaus, 46, who came to the US with his daughter, son and grandson and is set to resettle in Buffalo, New York. Mr Kleinhaus said that his life was threatened and that people tried to claim his property as their own, but his account could not be independently verified. The US would welcome more Afrikaners in the coming months, according to a spokesperson for the State Department. \"We think that the American government has got the wrong end of the stick here, but we'll continue talking to them,\" Cyril Ramaphosa, South Africa's president, said at a conference in Ivory Coast. Mr Ramaphosa said that the white Afrikaners who arrived in the US had left South Africa because they were against the policies aimed at addressing racial inequality, which has persisted in the country since the apartheid rule of the white minority ended three decades ago."
    },
    {
        "title": "Thames Water apologises to customers but defends bonuses",
        "description": "The chairman of the UK's biggest water company has apologised to customers but defended staff bonus payments.",
        "url": "https://news.sky.com/story/thames-water-apologises-to-customers-but-defends-bonuses-13367161",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-thames-water-vans-repair-site_6915324.jpg?20250513153358",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-05-13 12:20:00",
        "Headline": "Bonus payments were defended by company management as the chief executive can \nreceive up to 156% of their salary as a bonus, while frontline workers can only earn between 3% and 6%.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The chairman of the UK's biggest water company has apologised to customers but defended staff bonus payments. Sir Adrian Montague, of Thames Water, told MPs on the Environment, Food and Rural Affairs select committee that the utility firm, which supplies 16 million customers in London and parts of south England, was sorry. He said: \"We know the supply interruptions cause inconvenience and sometimes real hardship, and so I think the right thing to do is to start the discussion of the [company's] turnaround plan by acknowledging we haven't always served our customers as well as we should, and through the committee, apologising to them.\" Money blog: How to make money off your old (and empty) beauty containers Customers faced significant service disruption in recent years, including a boil water notice in Bramley, near Guildford, last summer and a 40% rise in sewage spills in 2024. It's also struggled to raise investment, repay its debt pile, which now stands at Â£19bn after an emergency loan prevented it from running out of money and entering state control. Despite the massive debt pile, Sir Adrian defended paying bonuses, saying the company was in \"a competitive marketplace\" and \"we have to keep staff\". \n                  I was worth my six-figure bonus, says under-fire Thames Water boss\n                 \n                  Thames Water delays request for even more expensive bills as six offers of new investment received\n                 \n                  Thames Water avoids being taken into government ownership in coming days after unsuccessful court challenge\n                 \"It's true that this business, like many businesses, needs to reward its staff effectively\", he told committee members. \"We do need to reward [staff] competitively.\"  If bonuses were not paid, \"people will come knocking, they'll try to pick out of us the best staff we've got\", Sir Adrian added. \"But the amounts of bonuses paid to staff is very small compared with the capital cost of the works that we were considering,\" he said. Read more from Sky News:Future of Nissan's Sunderland plant in doubtJob vacancies fall - as employers hit with higher costs In the first three months of his tenure, which began in January 2024, Thames Water's chief executive Chris Weston accepted a bonus of Â£195,000 as part of his Â£2.3m pay package. His bonus can be up to 156% of his salary as a bonus, while frontline workers can only earn between 3% and 6%, he said. When approached by Sky News on Tuesday, Mr Weston said he was sorry for the service that the customers received and \"it's not where we would like it to be, everyone is very committed in terms of trying and sorting it out\". Customer bills are to rise 35% to about Â£588 annually per household by 2030, a figure which Thames Water is seeking to increase. A Defra spokesperson said: \"We inherited a water system that rewarded failure, with polluting water bosses paying themselves unfair multi-million pound bonuses. \"This government says no more. Under the Water Act, from this year undeserved multi-million-pound bonuses will no longer be paid.\""
    },
    {
        "title": "I was worth my six-figure bonus, says under-fire Thames Water boss",
        "description": "Thames Water chief executive Chris Weston has apologised to customers and promised to turn the failing utility company around.&#160;",
        "url": "https://news.sky.com/story/i-was-worth-my-six-figure-bonus-says-under-fire-water-boss-13367301",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-thames-water-chris-weston_6915393.jpg?20250513163043",
        "type": "Business",
        "Author": "Liz Bates",
        "Date Published": "2025-05-13 16:31:00",
        "Headline": "Thames Water customers have faced significant service disruption in recent years, including a boil water notice in Bramley, near Guildford, last summer and a 40% rise in sewage spills in 2024.",
        "Content": "\n          Political correspondent\n              @wizbates\n  Thames Water chief executive Chris Weston has apologised to customers and promised to turn the failing utility company around.Â  He told Sky News: \"I'm sorry that the service that the customers receiveâ€¦ it's not where we would like it to be, everyone is very committed in terms of trying and sorting it out. \"So, absolutely I'm very sorry about the service some people receive, but it will absolutely get fixed.\" It came after a tense appearance in front of MPs from the Environment, Food and Rural Affairs select committee during which his own bonus of Â£195,000 - which he received after just three months in the role - was called into question. Money blog: Broadband provider hikes prices - but you can get out of it The parliamentary hearing coincides with spiralling bills for customers, who face paying hundreds of pounds more for their water supply over the coming years. He defended the payout, saying he had joined the struggling company in January 2024 because it \"matters to society\". \n                  Thames Water apologises to customers but defends bonuses\n                 \n                  Thames Water delays request for even more expensive bills as six offers of new investment received\n                 \n                  Thames Water avoids being taken into government ownership in coming days after unsuccessful court challenge\n                 He added: \"I think that within the first three months, I did make a difference. I started to put in place the new organisation structure, I started to give people confidence and reassurance about how proud they could be of the job they did and what we were setting out to do.\" Thames Water customers have faced significant service disruption in recent years, including a boil water notice in Bramley, near Guildford, last summer and a 40% rise in sewage spills in 2024. It has also struggled to raise investment, repay its debt pile, which now stands at Â£19bn after an emergency loan prevented it from running out of money and entering state control. Read more from Sky News:M&S says customers' personal data taken by hackersFuture of Nissan's Sunderland plant in doubt Also appearing before the committee was Thames Water chairman Sir Adrian Montague, who tried to reassure MPs that they would get the firm's finances back on track despite recent moments of near collapse. He said: \"The fact of the matter is, as we've noted on several occasions, Thames in the last year has come very close to running out of money entirely. \"There were times in the last year that we had five weeks' liquidity - and running a Â£20bn corporation on five weeks' liquidity, honestly, it's hair-raising.\""
    },
    {
        "title": "Trump's biggest 'deals' during second term so far",
        "description": "Donald Trump has often said that his \"favourite word\" is \"tariff\". Surely \"deal\" would come a close second.",
        "url": "https://news.sky.com/story/trumps-biggest-deals-during-second-term-to-date-13367231",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-white-house_6914680.jpg?20250513035036",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-13 14:46:00",
        "Headline": "Mr Trump has claimed that his work to date is worth $10trn to the US economy but experts have said the values are likely to be much lower and almost impossible to quantify.",
        "Content": "Donald Trump has often said that his \"favourite word\" is \"tariff\". Surely \"deal\" would come a close second. The president's new term in the White House has been dominated by a protectionist agenda aimed at restoring America's domestic manufacturing base and jobs. His primary objective is cutting America's trade deficit - by which the country imports more in value terms, than it exports. That gap, the largest for any country in the world, stands at about $1.1trn (Â£830bn) annually. The threat of, and later, the implementation of stop-start tariffs has flung the global trade order into chaos, with some companies and traditional trading partners taking the opportunity of a \"deal\", when able to. Mr Trump has claimed that his work to date is worth $10trn (Â£7.5trn) to the US economy but experts have said the values are likely to be much lower and almost impossible to quantify. Here, we outline some of the big deals to have been claimed so far in a bid to achieve Mr Trump's economic and trade goals. \n                  Trump to lift sanctions on Syria - as he announces $600bn deal with Saudi Arabia\n                 \n                  US-Saudi relationship feels tighter than ever as Trump signs flurry of deals\n                 \n                  White South Africans arrive in US after Trump administration granted them refugee status\n                  Stargate A boost to AI infrastructure in the US was announced by the president on his first full day back in the White House. The OpenAI-led venture, mostly funded by Japan's Softbank, will see up to $500bn (Â£375bn) spent on data centres up to 2029. It has been widely reported this week that progress has stalled, however, due to US trade tariffs. Apple The iPhone maker announced in February its largest ever spending commitment, of more than $500bn (Â£375bn) over four years. Along with AI data centres, the company has pledged to build an \"advanced\" factory in Texas under Mr Trump's push for US manufacturing growth. Nvidia The world's most valuable chipmaker revealed in April that it was to invest $500bn (Â£375bn) in the US over four years. The company, which makes the majority of its chips in Taiwan currently, said it was to spend the bulk of the money on domestic AI servers. Two manufacturing plants - in Arizona and Texas - will also be expanded under the plans.  US-UK trade deal More of a truce than a comprehensive trade deal - and almost impossible to put a value on given the disruption to date - but this was the first \"deal\" that the Trump administration did to end some tariffs against a country. It sees 25%+ duties on UK-made cars cut to 10% under a quota system that will also see steel tariffs scrapped. However, a 10% levy remains on all other goods. Prime Minister Sir Keir Starmer said that the partially completed agreement would save \"thousands of jobs\".  US-China trade deal The president hailed a \"reset\" in relations with China following a deal, revealed on 12 May, that will end the effective trade embargo between the world's two largest economies. US tariffs of 145% and those imposed by China, of up to 125%, had effectively killed most trade altogether but have been paused for 90 days. They have been replaced by effective rates of 30% and 10% respectively. Saudi Arabia Donald Trump signed a \"$600bn deal\" with Saudi Arabia, which includes the \"largest defence sales agreement in history\" on Tuesday 13 May. He said during his visit to the kingdom that, in addition to purchases of $142bn (Â£107bn) of US-made military equipment, there will also be multi-billion dollar deals in Saudi Arabia with US firms including Amazon, Uber and Oracle."
    },
    {
        "title": "Future of Nissan's Sunderland plant in doubt",
        "description": "The future of Nissan's Sunderland operations is in doubt as the Japanese car maker cuts its number of factories and shrinks its workforce even more than previously announced.",
        "url": "https://news.sky.com/story/future-of-nissans-sunderland-plant-in-doubt-as-factories-across-the-world-to-close-13367010",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nissan-sunderland_6915096.jpg?20250513124842",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-05-13 08:11:00",
        "Headline": "The car maker has announced it will shut seven factories and cut 20,000 jobs globally in a bid to slash costs.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The future of Nissan's Sunderland operations is in doubt as the Japanese car maker cuts its number of factories and shrinks its workforce even more than previously announced. The company confirmed on Tuesday it will shut seven factories and cut 20,000 jobs globally in a bid to slash costs. The job losses had been reported by Japanese media ahead of Nissan's announcement. The car maker said it will cut 11,000 more jobs than originally planned, having announced in November that it would axe 9,000 roles in a restructuring. Its number of manufacturing plants will be slashed from 17 to 10. Most job losses - 65% - will come from manufacturing, Nissan chief executive and president Ivan Espinosa told reporters. Around 6,000 workers are employed at Nissan's manufacturing operations in Sunderland. A spokesperson for Nissan UK said it is \"currently in detailed study within the company regarding the announced plant closures\". \"At this stage, we are not able to inform you which plants will be affected,\" the spokesperson added. Mr Espinosa has said, however, the company will assemble more electric vehicles at the Sunderland site. He also confirmed some closures would come in Japan on top of previously announced consolidation in Argentina, Thailand and India. \"There is more to come, and we will inform you in due course,\" he added. Read more from Sky News:M&S says customers' personal data taken by hackersJob vacancies fall - as employers hit with higher costs When asked why the announcement was being made now, he said Nissan \"cannot absorb costs with current revenues\", and there is \"volatility in the market\". The auto industry is among the worst hit by US President Donald Trump's tariffs, as cars and car parts entering the US have been subject to a 25% tax. Cars made in the UK will be subject only to a 10% tariff as part of a deal negotiated between the US and UK.  There is an \"urgent need\" for Nissan to recover, Mr Espinosa said. \"We have a mountain to climb from the losses we are announcing today,\" he added. Sunderland has been host to numerous politicians, including former prime ministers, over the years as Nissan announced in 2023 it was to build a battery-making gigafactory at the location. In 2021, Boris Johnson's government was understood to have committed around Â£100m directly to Nissan and Chinese manufacturer Envision to build the factory."
    },
    {
        "title": "Job vacancies fall - as employers hit with higher costs",
        "description": "Wage rises are slowing, and there are fewer jobs on offer as employers grapple with higher costs, official figures show. ",
        "url": "https://news.sky.com/story/job-vacancies-fall-as-employers-hit-with-higher-costs-13366954",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-payslip-wages_6518639.jpg?20241216121351",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-05-13 05:22:00",
        "Headline": "Wages are rising more slowly than before, but are still above the rate of price rises. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Wage rises are slowing, and there are fewer jobs on offer as employers grapple with higher costs, official figures show.  In the month when minimum wage rose and employers' national insurance increases kicked in, job vacancies fell, according to April data from the Office for National Statistics. Job vacancies have now fallen below the pre-pandemic level of March 2020, down from a peak of 1.3 million in early 2022 to 761,000 last month. Money blog: 'Arnold Clark offered me a coffee cup for a Â£230 mistake' Average weekly earnings continued to rise faster than inflation, at 5.5% down from 5.7%, while pay excluding bonuses grew at a lower 5.6% level, down from 5.9%, in the three months to March, ONS figures showed. It means wages are rising more slowly than before but faster than the rate of price rises. Latest official figures showed inflation stood at 2.6% in March. \n                  UK's top statistician Sir Ian Diamond quits following row over economic data\n                 \n                  Why many assume interest rates will fall further - but no one really has a clue\n                 \n                  Interest rate cut to 4.25% by Bank of England\n                 Wage growth was described as \"relatively strong\" by Liz McKeown, director of economic statistics at the ONS, with increases in public and private sectors \"now showing little difference\". \"The broader picture continues to be of the labour market cooling, with the number of employees on payroll falling in the first quarter of the year. Unemployment also rose in March, the ONS said, ticking up from 4.4% to 4.5% a month earlier. The ONS, however, continued to advise caution in interpreting changes in the monthly unemployment rate due to concerns over the figures' reliability. The exact number of unemployed people is unknown, partly because people do not respond to surveys and answer the phone when the ONS calls. What does it mean for the interest rate? The Bank of England cut the interest rate last week, but has in the past expressed concern over wage rises, which can be inflationary and act against its mission to bring price rises to 2%.  Traders still expect there to be two cuts this year. A cut is priced in for August with a second anticipated in November. By year-end, it's expected that the base interest rate will be 3.75%, down from the current 4.25%."
    },
    {
        "title": "Money Problem: 'Arnold Clark offered me a coffee cup for a Â£230 mistake'",
        "description": "Every Tuesday our Money blog team answers your Money Problems. You can email yours to moneyblog@sky.uk. ",
        "url": "https://news.sky.com/story/money-problem-arnold-clark-offered-me-a-coffee-cup-for-a-163230-mistake-13366976",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-istock-file-generic_6914694.jpg?20250513062858",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-13 06:48:00",
        "Headline": "A reader turned to our Money team for help after being frustrated by the poor customer service she received. Were we able to get her a refund?",
        "Content": "Every Tuesday our Money blog team answers your Money Problems. You can email yours to moneyblog@sky.uk.  Today, we are tackling this issue sent to us by Colette Masters...  I changed cars on 19 March with Arnold Clark Renault Liverpool. The old car had finance to settle which was factored into the deal and the dealer was supposed to pay off the old finance. Four weeks later the finance company took a monthly payment for the old car. I complained to Arnold Clark and have been astounded by the lack of customer care in trying to find a resolution. My husband was told that they would see if they had a coffee cup or something lying around to give me as compensation. We were sorry to hear about your experience - you went into a lot more detail in your message and sent us all your correspondence with the dealership. Our first port of call on this was to see what Arnold Clark had to say. Its press team was responsive and escalated the complaint. Just under a week later, Arnold Clark provided us with this statement: \"We've acknowledged the customer's concern and we're currently in the process of resolving their complaint. We apologise for any inconvenience and appreciate their patience and understanding. \"Our aim is to always provide customer service of the highest level and will continue to work with the customer to fully resolve this.\" Follow the latest in our Money blog Our team then caught up with you, Colette, and learned that they called to offer you a full refund on the overpayment. We could leave this one here, but it's obvious that companies shouldn't need a call from the media to sort these things out, and journalists can't look into every case that comes into our inbox. With that in mind, we asked Complaints Resolver Scott Dixon to run through what he would have done to find a resolution in this case. He wrote... Buying a second-hand car is likely to be the second biggest purchase you are ever likely to make, and it tops my inbox with the most complaints. The Financial Ombudsman Service received more than 68,000 complaints between October and December 2024, with car finance complaints up by 294% on the same time last year. Complaints range from mis-sold finance and faulty vehicles to disputes over rejection rights. A look at the Arnold Clark website shows how much it boasts about putting customers, and fairness first, but your account suggests that wasn't the case here. Read more Money Problems:'I've got a last-minute hen do drop out - do I get her to pay?''I paid a builder Â£500 and they ghosted me''I got a haircut so bad I had to shave it off - what can I do?' Here's what I would do in this situation: Step one: I would lodge a formal complaint to the CEO and other key officials. Search on LinkedIn and RocketReach, which is a search tool for finding key contacts in organisations. You can also look on Companies House or just do a simple Google search for the CEO's email address. They may not read it themselves, but in my experience, it often prompts action. Send all additional correspondence as attachments with a bullet-point timeline so they can clearly see how this has unfolded and explain how badly you have been treated. Cross-reference your experience to the promises on the firm's website. A coffee cup isn't going to cut it. I would seek a written apology acknowledging the poor handling and dire customer service, and a full refund of Â£230 paid due to Arnold Clark failing to settle the finance on time. Ask for a detailed breakdown and confirmation of what has been paid as a settlement figure to the finance company, as there appear to be some discrepancies and misunderstandings, so you know that everything has been settled as agreed. You also want an assurance that no adverse credit reports have been made due to their negligence and incompetence. State that you want a resolution within 14 days from the date of your letter. Step two: Contact your lenders. I would contact both lenders and explain what has happened, and ask that they do not record any missed payments or defaults from this case. Step three: Check your credit file in a couple of months to make sure that everything is in good order and no errors or defaults have been made. If any errors have been made, ask for a \"Notice of Correction\" to be put on your credit file to explain it in more detail to help lenders understand the background if it's incorrect. Step four: Leave reviews online and report to Trading Standards. I would leave a review on Google Reviews to warn others and report this dealership to Trading Standards. This feature is not intended as financial advice - the aim is to give an overview of the things you should think about. Submit your dilemma or consumer dispute via:"
    },
    {
        "title": "Love Home Swap founder Wosskow screened for Channel 4 chair job",
        "description": "A start-up founder who leads a government-backed female entrepreneurship initiative is among the contenders to become the next chair of Channel 4.",
        "url": "https://news.sky.com/story/love-home-swap-founder-wosskow-screened-for-channel-4-chair-job-13367078",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-channel-4-channel-four_6846256.jpg?20250304185310",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-13 10:24:00",
        "Headline": "Debbie Wosskow, who chairs the Invest In Women taskforce, has thrown her hat into the ring to succeed Sir Ian Cheshire as chair of the state-owned broadcaster, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A start-up founder who leads a government-backed female entrepreneurship initiative is among the contenders to become the next chair of Channel 4. Sky News understands that Debbie Wosskow is among the names featuring on a list of candidates to replace Sir Ian Cheshire, who stepped down earlier this year. The race to lead the state-owned broadcaster's board has acquired additional importance in recent weeks after the resignation of Alex Mahon, its long-serving chief executive. Ms Mahon, who was a vocal opponent of the last government's proposed privatisation of Channel 4, is leaving to join Superstruct, a private equity-owned live entertainment company. The appointment of a new chair is expected to take place by the autumn, with the chosen candidate expected to lead the recruitment of Ms Mahon's successor. Dawn Airey, the veteran television executive, is serving as Channel 4's interim chair but has reportedly ruled herself out of the running for the role on a longer-term basis. Ms Wosskow is already on the board of Channel 4, having joined as a non-executive director in January last year. \n                  Channel 4 News admits output featured Hamas official's son also linked to BBC documentary on Gaza\n                 \n                  Countdown champion John Cowen appears in court accused of stabbing quiz rival\n                 \n                  Channel 4 to unveil deeper job cuts as ad downturn bites\n                 It was unclear on Tuesday whether any of the broadcaster's other non-executives have thrown their hat into the ring to succeed Sir Ian. Ms Wosskow, who now jointly chairs the Invest In Women taskforce, founded the home exchange start-up Love Home Swap before selling it to Wyndham in 2017. The appointment of directors of Channel 4 is technically led by Ofcom, the media regulator, in agreement with the culture secretary. Channel 4 has been contacted for comment, while Ms Wosskow declined to comment when approached by Sky News."
    },
    {
        "title": "Treasury holds talks with fintech unicorns about London IPO prospects",
        "description": "The City minister is intensifying efforts to convince some of Britain's most valuable financial technology companies to list in London as \"unicorns\", including Monzo as it steps up preparations to go public.",
        "url": "https://news.sky.com/story/treasury-holds-talks-with-fintech-unicorns-about-london-ipo-prospects-13367038",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-emma-reynolds-mp-labour_6812469.jpg?20250128073838",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-13 09:16:00",
        "Headline": "The chief executives of companies including Clearscore, Monzo, OakNorth and Revolut were pitched the merits of a London listing by the City minister on Tuesday, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The City minister is intensifying efforts to convince some of Britain's most valuable financial technology companies to list in London as \"unicorns\", including Monzo as it steps up preparations to go public. Sky News has learnt that Emma Reynolds, economic secretary to the Treasury, met executives from businesses such as ClearScore, Monzo, OakNorth and Revolut on Tuesday morning. Money latest: Tesco says sorry to customers for Â£100 Clubcard error Antony Jenkins, the former Barclays chief executive who founded 10x Banking Technologies, a banking software provider, also attended the meeting, alongside Dame Julia Hoggett, chief executive of the London Stock Exchange, and Simon Walls, an executive at the Financial Conduct Authority. The summit comes amid a desperate quest by the LSE to attract prominent new listings, with leading tech names including Deliveroo and the cybersecurity software group Darktrace both having been the subject of takeover bids. Last weekend, Sky News revealed that Monzo - now the UK's seventh-largest bank - was in the early stages of lining up investment bankers to work on an initial public offering. Morgan Stanley has been helping the company organise meetings with potential investors ahead of a flotation which could value it at Â£7bn. London currently appears to be the favoured choice of its board for a listing, with the first half of next year seen as the earliest window for an IPO to take place. Revolut, which was most recently valued at $45bn in a secondary share sale, is viewed as being more likely to list in New York in the coming years. Read more from Sky News:M&S says customers' personal data taken by hackersJob vacancies fall - as employers hit with higher costs A Treasury spokesperson said: \"We are determined to make Britain the best place in the world to start up, scale up and list. \"That's why we are cutting red tape, ensuring businesses can access the capital they need to grow and supporting the country's most exciting companies to thrive through our industrial strategy.\""
    },
    {
        "title": "Government hails new agreement with pension providers to boost investment in UK firms",
        "description": "A new government initiative is being launched with pension providers aimed at boosting investment in UK companies.",
        "url": "https://news.sky.com/story/government-hails-new-agreement-with-pension-providers-to-boost-investment-in-uk-firms-13366930",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-city-city-of-london_6584350.jpg?20240618062124",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-13 06:16:00",
        "Headline": "Seventeen workplace pension providers will today sign up to a voluntary initiative called the Mansion House Accord, which ministers say could release Â£25bn directly into the UK economy by 2030.",
        "Content": "A new government initiative is being launched with pension providers aimed at boosting investment in UK companies. Seventeen workplace pension providers will today sign up to a voluntary initiative called the Mansion House Accord, which ministers say could release Â£25bn directly into the UK economy by 2030. Those signing up must commit to allocating at least 10% of the funds they hold in what are known as defined contributions to private markets within the next five years, with at least 5% of the total allocated to the UK, assuming that there is a sufficient supply of suitable assets. It comes amid debate over the international competitiveness of London's capital markets, with a number of large London-listed companies having switched their primary listing to New York. Meanwhile, London's stock markets have lagged behind their international equivalents. Most people with a pension who work for private companies have one based on defined contributions (DC) - which pays out after retirement depending on how much was paid in. The pension providers signing up are: Aegon UK, Aon, Aviva, Legal & General, LifeSight, M&G, Mercer, NatWest Cushon, Nest, now:pensions, Phoenix Group, Royal London, Smart Pension, the People's Pension, SEI, TPT Retirement Solutions and the Universities Superannuation Scheme (USS). \n                  Thames Water apologises to customers but defends bonuses\n                 \n                  I was worth my six-figure bonus, says under-fire Thames Water boss\n                 \n                  Trump's biggest 'deals' during second term so far\n                 Together, the government says they manage around 90% of active savers' defined contribution pensions. The initiative builds on the Mansion House Compact, which was signed in July 2023 and saw 11 UK pension providers committing to the aim of investing 5% of DC defaults in unlisted equities, including venture capital and growth equity, by 2030. At the time, an industry source told Sky's Mark Kleinman that then chancellor Jeremy Hunt was keen to address his concern that returns for British pensioners were lower than international peers. The Financial Times reported in summer of 2023 that Treasury officials were considering regulatory changes to channel more UK pension fund investment into riskier British companies such as start-ups. Mr Hunt tried to boost investment in UK markets with a UK ISA, but it failed to get off the ground. In recent years, British markets have not kept pace with many others. In the last 10 years, the FTSE 100 index has risen around 23%, compared to a 133% increase in the Dow Jones, Germany's Dax index rising 115% and Japan's Nikkei rising 87%. Last year, a string of companies announced plans to move their primary listings from London to New York or elsewhere, with chip designer ARM Holdings opting to float in the US and private equity firm CVC Capital Partners listing in Amsterdam. Chancellor Rachel Reeves said in response to the Mansion House Accord: \"I welcome this bold step by some of our biggest pension funds, which will unlock billions for major infrastructure, clean energy, and exciting start-ups - delivering growth, boosting pension pots, and giving working people greater security in retirement.\" Pensions minister Torsten Bell said: \"Pensions matter hugely, they underpin not just the retirements we all look forward to, but the investment our future prosperity depends on. \"I hugely welcome the pensions industry decision to invest in more productive assets, from growing companies to infrastructure. This supports better outcomes for savers and faster growth for Britain.\" Yvonne Braun, a director at the Association of British Insurers, which is jointly leading the initiative with the Pensions and Lifetime Savings Association (PLSA) and the City of London Corporation, said: \"As major investors, the pensions industry already plays a vital role in driving growth in the UK and globally. \"Investments under the accord will always be made in savers' best interests. It is now critical that government supports the industry's ambition, by facilitating a pipeline of suitable investment opportunities, tackling barriers to investments, and delivering wider pension reforms effectively.\" Alastair King, Lord Mayor of London, said: \"If we want those firms to scale in the UK, we must ensure they have the capital to do so. This is not just about better pension outcomes, it is about building a more dynamic, competitive investment ecosystem.\" Zoe Alexander, director of policy and advocacy at the Pensions and Lifetime Savings Association (PLSA), said: \"UK pension schemes already invest billions in UK growth assets. \"This accord demonstrates the collective ambition of the DC sector to do even more, as well as its confidence that the UK will provide the right opportunities to invest, consistent with schemes' fiduciary duty to members. \"The government, in its turn, has committed to take action to ensure there is a strong pipeline of investable assets for pension schemes. With everyone playing their part, there is great potential to boost returns for savers while providing vital funding to productive growth areas.\""
    },
    {
        "title": "Royal College of Psychiatrists pulls support for assisted dying bill",
        "description": "The Royal College of Psychiatrists (RCP) has pulled its support for the assisted dying bill.",
        "url": "https://news.sky.com/story/royal-college-of-psychiatrists-pulls-support-for-assisted-dying-bill-13367456",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-assisted-dying-euthansia_6746051.jpg?20250514024838",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-13 23:55:00",
        "Headline": "The announcement from the Royal College of Psychiatrists is a blow to supporters of the bill because under an amendment, a psychiatrist would be on the expert panel to assess assisted dying cases.",
        "Content": "The Royal College of Psychiatrists (RCP) has pulled its support for the assisted dying bill. The announcement is a blow to supporters of the bill ahead of its return to the House of Commons on Friday. It comes as plans to legalise assisted dying in Scotland passed the first stage this week. Dr Lade Smith, president of the RCP, said: \"The RCP has reached the conclusion that we are not confident in the Terminally Ill Adults Bill in its current form, and we therefore cannot support the Bill as it stands.\" The move is significant because, under the bill's current stipulations, a panel including a psychiatrist would oversee assisted dying cases. The RCP outlined a number of issues it had with the current bill, including: the bill not making provision for unmet needs, whether assisted suicide is classed as a treatment or not, what the psychiatrists' specific role on the panel would be, and the increased demand the bill puts on psychiatrists. If the college support remains withdrawn, and the bill passes, it isn't clear what effects it may have. \n                  Plans to legalise assisted dying in Scotland pass first stage\n                 \n                  MSPs to vote on assisted dying in Scotland\n                 \n                  Assisted Dying: Hundreds would seek to use service in first year of it being available, government report finds\n                 Kim Leadbeater, the MP behind the bill, has confirmed it will include a clause that means anyone who does not want to be involved in the process will not have to do so. Supporters of the bill argue it would ease the suffering of dying people, while opponents argue it would fail to safeguard some of the most vulnerable people in society. Questions over the bill The more prominent role of a psychiatrist in the bill came about after a previous amendment. Initially, the bill said that after two independent doctors approved an assisted dying case, it would then need to be further approved by a High Court judge. Read more from Sky News:'Sixteen killed' in Israeli strike on Gaza hospitalMenendez brothers' murder sentences reducedPM rejects Enoch Powell comparison But MPs on the parliamentary committee scrutinising the bill voted to remove that clause in March. Instead, Ms Leadbeater proposed a voluntary assisted dying commissioner that included an expert panel with a psychiatrist. She said this was a \"strength, not a weakness,\" but opponents of the bill disagreed, saying removing the High Court judge \"fundamentally weakens protections for the vulnerable\". However, amid changes and amendments to the original bill, there has been growing concern about safeguarding and timeframes, Sky News political correspondent Ali Fortescue reported. Friday's debate was already delayed from 25 April, to give MPs more time to consider amendments. If the bill passes on Friday, it will move to the House of Lords, where it will undergo similar legislative stages, and if it passes that too, it won't come into effect until at least 2029, after its implementation was delayed."
    },
    {
        "title": "Civil service relocation and AI officials at heart of government cost cutting measures",
        "description": "AI civil servants and sending human workers out of London are at the heart of the government's plans to cut costs and reduce the size of the state bureaucracy.",
        "url": "https://news.sky.com/story/civil-service-relocation-and-ai-officials-at-heart-of-government-cost-cutting-measures-13367237",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-whitehall-civil-service_6915406.jpg?20250513164224",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-05-13 15:02:00",
        "Headline": "Saving money from the civil service is a key part of the Labour government's attempts to reduce state spending. Conservatives attempts to reduce the number of officials failed after numbers soared during COVID.",
        "Content": "\n          Political reporter\n       AI civil servants and sending human workers out of London are at the heart of the government's plans to cut costs and reduce the size of the state bureaucracy. Shrinking the civil service has been a target of both the current Labour and recent Conservative governments - especially following the growth in the organisation during the pandemic. From a low in 2016 of 384,000 full time workers, in 2024 there were 513,000 civil servants. Politics latest: Your views on PM's migration speech The Department for Science, Innovation and Technology is claiming a new swathe of tools to help sift information submitted to public consultations could save \"75,000 days of manual analysis every year\" - roughly the work of 333 civil servants. However, the time saved is expected to free up existing civil servants to do other work. The suite of AI tools are known as \"Humphrey\", after Humphrey Appleby, the fictional civil servant in the TV comedy Yes, Prime Minister. The government has previously said the introduction of AI would help reduce the civil service headcount - with hopes it could save as much as Â£45bn. Speaking today, Technology Secretary Peter Kyle appeared to take aim at expensive outsourcing contracts, saying: \"No one should be wasting time on something AI can do quicker and better, let alone wasting millions of taxpayer pounds on outsourcing such work to contractors.\"  Move outside of London Other money-saving plans announced today include moving 12,000 civil servants out of London and into regional hubs - with the government hoping it can save almost Â£100m by 2032 by not having to pay for expensive leases of prime office space in the capital. Currently, 95,000 full time civil servants work in London. Tens of millions of pounds a year are expected to be saved by the closure of 102 Petty France, which overlooks St James's Park, and 39 Victoria Street, which is near the previous location of New Scotland Yard. In total, 11 London offices are slated for closure, with workers being relocated to the likes of Aberdeen, Belfast, Darlington, Bristol, Manchester and Cardiff. Read more:More than 1,000 officials to be cutPayouts for departing civil servants cappedReeves hints at 10,000 cuts'Almost certain' AI will lead to cuts The reforms of the civil service are being led by Chancellor of the Duchy of Lancaster Pat McFadden - one of Sir Keir Starmer's most influential ministers. Mr McFadden said: \"To deliver our plan for change, we are taking more decision-making out of Whitehall and moving it closer to communities all across the UK. \"By relocating thousands of civil service roles we will not only save taxpayers money, we will make this government one that better reflects the country it serves. We will also be making sure that government jobs support economic growth throughout the country. \"As we radically reform the state, we are going to make it much easier for talented people everywhere to join the civil service and help us rebuild Britain.\" The government says it wants senior civil servants out of the capital too - with the aim being that half of UK-based senior officials work in regional offices by the end of the decade. The government claims the relocations and growth of regional hubs could add as much as Â£729m to local economies by 2030. Union welcome - cautiously Unions appear to cautiously welcome the changes being proposed. All of Prospect, the PCS and the FDA say it is positive to see better opportunities outside of the capital. However, they have asked for clarity around whether roles may be lost and what will be offered to people transferring. ðŸ‘‰Listen to Politics at Sam and Anne's on your podcast appðŸ‘ˆ Fran Heathcote, the general secretary of the PCS union, said: \"If these government proposals are to be successful however, it's important they do the right thing by workers currently based in London. \"That must include guarantees of no compulsory redundancies, no compulsory relocations and access to more flexible working arrangements to enable them to continue their careers should they wish to do so.\""
    },
    {
        "title": "Who PM was really trying to echo with 'island of strangers' speech",
        "description": "Sir Keir Starmer is getting used to falling out with some of his MPs over policy decisions - be it on the winter fuel allowance, his approach to the Israel-Hamas war in Gaza or welfare cuts.",
        "url": "https://news.sky.com/story/who-pm-was-really-trying-to-echo-with-island-of-strangers-speech-13367327",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-beth-rigby_6915218.jpg?20250513140605",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-05-13 17:25:00",
        "Headline": "The politician the prime minister was trying to channel was about as far away from Enoch Powell as you could get in the 1960s.",
        "Content": "\n          Political editor\n              @BethRigby\n Sir Keir Starmer is getting used to falling out with some of his MPs over policy decisions - be it on the winter fuel allowance, his approach to the Israel-Hamas war in Gaza or welfare cuts. But on Tuesday the prime minister found himself embroiled in a row with MPs over something entirely different - his language over immigration. The prime minister's argument that Britain \"risked becoming an island of strangers\" if immigration levels are not cut has sparked a backlash from some of his MPs, and the London mayor Sadiq Khan is alarmed that his own leader is using language similar to that of Enoch Powell. Politics latest: Senior Labour figures distance themselves from PM's speech  In his infamous 1968 Rivers Of Blood speech, Powell warned of a future where white people \"found themselves made strangers in their own country\". It was a speech that cost him his shadow cabinet job and made Powell one of the most divisive and controversial politicians in Britain. It is also a speech that the prime minister's team is now frantically trying to distance itself against, with one insider telling me on Tuesday the PM's team hadn't realised the similarity and hadn't intended the comparison. The politician the prime minister was trying to channel was about as far away from Powell as you could get in the 1960s, when the debate of immigration and race relations raged. Sir Keir had wanted to echo former Labour home secretary Roy Jenkins who had always argued that immigration was good for Britain, but needed to be done at a speed the country could absorb. Take this from Jenkins in the House of Commons in 1966: \"Let there be no suggestion that immigration, in reasonable numbers, is a cross that we have to bear, and no pretence that if only those who have come could find jobs back at home our problems would be at an end. \"But it does not follow that we can absorb them without limit. We have to strike a balance. That is what we are trying to do and I feel that we have been reasonably successful in recent months. We cannot lay down absolute numerical quantities, but I think that we have struck a reasonable balance and also that in the past year we have made substantial progress towards producing a healthier atmosphere, in terms of integration, on both sides - amongst both the indigenous and the immigrant community.\"  One person familiar with No 10's approach told me: \"We want a more cohesive society, we are not trying to pick fights. \"But the last Conservative government let in 2.3 million immigrants [in the three years to June 2024] and during that time built about 600,000 homes. That creates competition between people and that is typically at the lower end of the market. Just issuing visas and creating a sense of an unfair system is not a way to build cohesiveness.\" If you look at polling from YouGov, it seems the prime minister is more in step with public mood than those in his party criticising him, with 41% of all voters polled on Tuesday about his \"island of strangers\" remarks agreeing with the sentiment and having no issue with the language.  But it is true too that Labour's approach lands particularly well with Reform voters, with 61% of them supportive of the PM's words. Beyond the battle of language, there will be battles ahead too over whether the prime minister's policies will help or hinder the economy. Read more:What are Sir Keir Starmer's new immigration rules?Starmer's migration package is significant - but is it enough? There has long been an assumption that higher net migration is positive of the economy and public finances, but there is growing concern in Number 10 that the benefits are being overstated, as it fails to take into account the additional resources needed for public services and the effect of lowering wages, which affects productivity growth - none of which is factored into the economic forecasts of the Office of Budget Responsibility. There will be those in business that don't like the cuts to visas. There will be those in government that will worry about the economic impact of cuts to visas - although the chancellor was on the front row for the prime minister's speech on Monday. There will be those on the Labour left that will be uncomfortable about it. I suspect the prime minister will be uncomfortable about the row over his language that has seen him attacked on both sides, as the left accuse him of trying to ape the far right and his opponents accuse him of being a \"chameleon\" for making the opposite argument on immigration when he was running for the Labour leadership in 2020. But where his team think they are right is on the policy, and early polling suggests that voters from across the political divide broadly agree."
    },
    {
        "title": "PM rejects Enoch Powell comparison after 'island of strangers' comment",
        "description": "Sir Keir Starmer has rejected the comparison to Enoch Powell after he said the UK was at risk of becoming an \"island of strangers\" if migration does not come down. ",
        "url": "https://news.sky.com/story/pm-rejects-enoch-powell-comparison-after-island-of-strangers-comment-13367116",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-prime-minister_6913971.jpg?20250512111450",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-05-13 11:21:00",
        "Headline": "The prime minister's official spokesperson doubled down on his speech on migration after many MPs criticised the language. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Sir Keir Starmer has rejected the comparison to Enoch Powell after he said the UK was at risk of becoming an \"island of strangers\" if migration does not come down.  The prime minister's official spokesperson said migrants have made a \"massive contribution\" to society but the Tories \"lost control of the system\" and that is the point he was making. The remark has drawn criticism from Labour backbenchers, who have compared it to the late Conservative MP's inflammatory 1968 \"Rivers of Blood\" speech. In the speech, Mr Powell imagined a future multicultural Britain where the white population would find themselves \"strangers in their own country\" as a result of migration. Among those to make the comparison was the former shadow chancellor John McDonnell, who said on X that \"Talk of an \"island of strangers\" shockingly echoes the divisive language of Enoch Powell\". However, the prime minister's spokesperson said: \"The PM rejects this comparison. He said that migrants have made a massive contribution to society. \"It is also right to say that between 2019 and 2024, the previous government lost control of the system. Migration needs to be controlled, fair and people that come here should integrate.\" \n                  Who PM was really trying to echo with 'island of strangers' speech\n                 \n                  'Why Britain and why now?'\n                 \n                  The unplanned call that sealed PM's deal with Trump - and the bigger challenge he now faces\n                 Asked why the prime minister used such robust language, the spokesperson said he was not going to \"shy away\" from the issue of immigration and the British public want it to be reduced. He added: \"We have welcomed immigrants for decades, but it's too high and must come down. Also, it's important for our domestic skills system, which is good for our economy.\" What has the government announced? Sir Keir made the comment at a news conference in which measures were announced to curb net migration, including banning care homes from recruiting overseas, new English language requirements for visa holders and stricter rules on gaining British citizenship. The package is aimed at reducing the number of people coming to the UK by up to 100,000 per year, though the government has not officially set a target. Enoch Powell was a Tory MP and the shadow defence secretary in the 1960s when a debate was raging about post-war immigration to Britain. By the late 1960s, hundreds of thousands of Commonwealth citizens had exercised their legal right and settled in Britain, and it led to a quiet clampdown by the Labour government on immigration. On 20 April 1968, Powell rose to his feet at a meeting of the Conservative Political Centre in Birmingham and declared Britons had \"found themselves made strangers in their own country\".\n\n Powell went on to say it had led to a shortage of hospital beds, school places, and \"homes and neighbourhoods changed beyond recognition\".\n\n He was swiftly kicked out of the shadow cabinet.\n\n Net migration - the difference between the number of people immigrating and emigrating to a country - soared when the UK left the EU in January 2020. It reached 903,000 in the year to June 2023 before falling to 728,000 in mid-2024. But that is still well above its pre-Brexit high of 329,000 in the year up to June 2015. Sir Keir said parts of the UK's economy \"seem almost addicted to importing cheap labour\" rather than investing in skills at home. However, it is not clear how the government plans to boost the domestic workforce, amid a UK skills shortage and record numbers of people being out of work. According to the ONS, there are 9.2 million people of working age in the UK who are economically inactive, including 1.8m 18-24 year olds. The prime minister's spokesperson said the government is \"focused on upskilling British workers\" and \"especially helping young people in the job sector\" but did not elaborate how.  On care homes, he said, around 40,000 care workers came over on visas for jobs that did not exist, and companies can recruit from that pool. Earlier, a number of Labour MPs came to the prime minister's defence. Rother Valley MP Jake Richards said on X that Sir Keir is \"absolutely right to warn of the risk of becoming an 'island of strangers'. \"Millions of people across the country have similar concerns. This theme must be central to missions across immigration, employment, work and tackling neighbourhood deprivation,\" he said. Shadow justice secretary Robert Jenrick went further, telling Sky News he believes the UK \"already is an island of strangers\", naming several areas \"where we are a very divided and segregated society\". However former Labour home secretary Lord David Blunkett criticised the rhetoric, saying in a speech at a University of Law graduation ceremony: \"I never felt I lived in, or had a part to play in, a country of strangers. \"I thought welcoming people from across the world was a tribute to our society, where people want to make their homes, to build a life and their economy and to contribute to our society. \"I think we need to be kind to each other, but we need a much kinder national world as well.\""
    },
    {
        "title": "Tory MP Patrick Spencer charged with sexual assaults at Groucho Club ",
        "description": "Conservative MP Patrick Spencer has been charged with two counts of sexual assault allegedly carried out at London's Groucho Club.",
        "url": "https://news.sky.com/story/tory-mp-patrick-spencer-charged-with-sexual-assaults-13367001",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-conservative-patrick-spencer_6915241.jpg?20250513142657",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-13 07:58:00",
        "Headline": "Lawyers acting for Patrick Spencer say he \"categorically denies\" the allegations relating to two different women in August 2023.",
        "Content": "Conservative MP Patrick Spencer has been charged with two counts of sexual assault allegedly carried out at London's Groucho Club. The charges follow two alleged incidents involving two different women at the private members' club in Soho in August 2023, the Crown Prosecution Service (CPS) said. Follow live politics updates: Your views on Starmer's migration speech Spencer - who is the MP for Central Suffolk and North Ipswich - is due to appear at Westminster Magistrates' Court on Monday 16 June. The 37-year-old's lawyers said he \"categorically denies\" the charges and \"will defend the allegations robustly in court\". A Conservative Party spokesman said Spencer has been suspended by the Tories and had the whip withdrawn. The Metropolitan Police said he was charged after attending a voluntary interview at a London police station on 13 March this year. Frank Ferguson, head of the CPS special crime and counter terrorism division, said: \"Following a review of the evidence provided by the Metropolitan Police Service, we have authorised two counts of sexual assault against Patrick Spencer MP. \"The charges follow two alleged incidents involving two separate women at the Groucho Club in central London in August 2023. \"The Crown Prosecution Service reminds all concerned that criminal proceedings against this defendant are now active and that he has the right to a fair trial. \"It is extremely important that there should be no reporting, commentary or sharing of information online which could in any way prejudice these proceedings.\" Spencer was first elected to Parliament last year with a majority of 4,290. It is understood he was asked not to attend the parliamentary estate by the Tory chief whip while police enquiries were ongoing. A Conservative Party spokesman said: \"The Conservative Party believes in integrity and high standards. We have taken immediate action. \"Patrick Spencer MP has been suspended from the Conservative Party, and the whip withdrawn, with immediate effect. \"The Conservative Party cannot comment further on an ongoing legal case.\" Read more from Sky News:Man who spent 38 years in jail for murder has conviction quashedThe online drug trade behind QR code stickers on UK streets The Groucho Club, in Dean Street, opened in 1985 and became a renowned meeting place for A-list celebrities and others, including actors, comedians and media executives. The club was named after the comedian and actor Groucho Marx, who reportedly once said he would refuse to join any club that would have him as a member. It was originally set up as a more relaxed alternative to traditional gentlemen's clubs, according to the venue's website, which adds that members should be in the creative industry \"and share the club's maverick spirit\". Before becoming an MP, Spencer worked in finance for private equity firm IPGL, a company chaired by his father, former Conservative Party treasurer Lord Michael Spencer. He later took a job at the Centre for Social Justice thinktank before becoming a senior adviser at the Department for Education. He made his maiden speech in the Commons in July last year during a debate on the MPs' code of conduct relating to second jobs, during which he said the \"most important thing to the people across my constituency\" was \"restoring a sense of moral probity and public spiritedness to our political system\". Lawyers acting for the MP said in a statement: \"Patrick Spencer categorically denies the charges. \"He has cooperated fully with the police investigation from the moment he became aware of it and he will defend the allegations robustly in court. \"Given that the proceedings are now on foot, no further comment will be made.\""
    },
    {
        "title": "I was worth my six-figure bonus, says under-fire Thames Water boss",
        "description": "Thames Water chief executive Chris Weston has apologised to customers and promised to turn the failing utility company around.&#160;",
        "url": "https://news.sky.com/story/i-was-worth-my-six-figure-bonus-says-under-fire-water-boss-13367301",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-thames-water-chris-weston_6915393.jpg?20250513163043",
        "type": "Politics",
        "Author": "Liz Bates",
        "Date Published": "2025-05-13 16:31:00",
        "Headline": "Thames Water customers have faced significant service disruption in recent years, including a boil water notice in Bramley, near Guildford, last summer and a 40% rise in sewage spills in 2024.",
        "Content": "\n          Political correspondent\n              @wizbates\n  Thames Water chief executive Chris Weston has apologised to customers and promised to turn the failing utility company around.Â  He told Sky News: \"I'm sorry that the service that the customers receiveâ€¦ it's not where we would like it to be, everyone is very committed in terms of trying and sorting it out. \"So, absolutely I'm very sorry about the service some people receive, but it will absolutely get fixed.\" It came after a tense appearance in front of MPs from the Environment, Food and Rural Affairs select committee during which his own bonus of Â£195,000 - which he received after just three months in the role - was called into question. Money blog: Broadband provider hikes prices - but you can get out of it The parliamentary hearing coincides with spiralling bills for customers, who face paying hundreds of pounds more for their water supply over the coming years. He defended the payout, saying he had joined the struggling company in January 2024 because it \"matters to society\". \n                  Thames Water apologises to customers but defends bonuses\n                 \n                  Thames Water delays request for even more expensive bills as six offers of new investment received\n                 \n                  Thames Water avoids being taken into government ownership in coming days after unsuccessful court challenge\n                 He added: \"I think that within the first three months, I did make a difference. I started to put in place the new organisation structure, I started to give people confidence and reassurance about how proud they could be of the job they did and what we were setting out to do.\" Thames Water customers have faced significant service disruption in recent years, including a boil water notice in Bramley, near Guildford, last summer and a 40% rise in sewage spills in 2024. It has also struggled to raise investment, repay its debt pile, which now stands at Â£19bn after an emergency loan prevented it from running out of money and entering state control. Read more from Sky News:M&S says customers' personal data taken by hackersFuture of Nissan's Sunderland plant in doubt Also appearing before the committee was Thames Water chairman Sir Adrian Montague, who tried to reassure MPs that they would get the firm's finances back on track despite recent moments of near collapse. He said: \"The fact of the matter is, as we've noted on several occasions, Thames in the last year has come very close to running out of money entirely. \"There were times in the last year that we had five weeks' liquidity - and running a Â£20bn corporation on five weeks' liquidity, honestly, it's hair-raising.\""
    },
    {
        "title": "Man arrested over arson attacks after fire at Sir Keir Starmer's house",
        "description": "A 21-year-old man has been arrested over a series of arson attacks, police have said, after a fire at a house owned by Prime Minister Sir Keir Starmer.",
        "url": "https://news.sky.com/story/man-arrested-over-arson-attacks-after-fire-at-sir-keir-starmers-house-13366942",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sir-keir-starmer-house_6914629.jpg?20250512231945",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-13 05:02:00",
        "Headline": "Police have confirmed the Met's Counter Terrorism Command is leading the investigation because of the \"connections with a high-profile public figure\".",
        "Content": " A 21-year-old man has been arrested over a series of arson attacks, police have said, after a fire at a house owned by Prime Minister Sir Keir Starmer. The suspect was arrested in the early hours of Tuesday on suspicion of arson with intent to endanger life, according to the Metropolitan Police. He remains in custody. Emergency services were called to fires at the doors of two homes in north London within 24 hours of each other - one just after 1.35am on Monday in Kentish Town and the other on Sunday in Islington. Both properties are linked to Sir Keir. Detectives are investigating whether the fires were connected and a car - also linked to Sir Keir - which was set alight last Thursday on the same street as the Kentish Town property also forms part of the probe. Part of the area was cordoned off as police and London Fire Brigade (LFB) investigators examined the scene, while charred ground, apparent evidence of a fire, could be seen on the street. Neighbours described hearing a loud bang and said police officers were looking for a projectile. The prime minister is understood to still own the home, which was damaged by fire on Monday, but nobody was hurt. Pictures showed scorching at the entrance to the property. Sir Keir used to live there before he and his family moved into 10 Downing Street after Labour won last year's general election. It is believed the property is being rented out. In the early hours of Sunday, firefighters dealt with a small fire at the front door of a house converted into flats in nearby Islington, which is also linked to the prime minister. In a statement, police said: \"As a precaution and due to the property having previous connections with a high-profile public figure, officers from the Met's Counter Terrorism Command are leading the investigation into this fire. \"Enquiries are ongoing to establish what caused it. All three fires are being treated as suspicious at this time, and enquiries remain ongoing.\" Read more from Sky News:QR codes linked to online drugsCould UK get US-style 'supermax' jails?Report: IS fighters in UK must face justice The prime minister's official spokesman said the police should be given the \"time and space\" to complete their investigations. He said the security of MPs was taken seriously but stressed Sir Keir was carrying on with his work. Kemi Badenoch has condemned the suspected arson attacks. Writing on X, the Conservative leader said: \"This is a shocking incident. My thoughts are with the prime minister and his family. No one should face these sorts of threats, let alone people in public service. \"It's an attack on our democracy and must never be tolerated.\" Shadow justice secretary Robert Jenrick told Sky News on Tuesday: \"It's important that the prime minister and anyone in public life has their family, their homes, protected. \"It is absolutely wrong, disgraceful, for any individual to take the kind of action that we saw against the prime minister's home.\""
    },
    {
        "title": "Robert Jenrick claims UK 'already island of strangers' - and names locations with 'segregated society'",
        "description": "Robert Jenrick has claimed the UK is \"already an island of strangers\" after the prime minister faced criticism for using that phrase in a speech on migration. ",
        "url": "https://news.sky.com/story/jenrick-claims-uk-already-island-of-strangers-and-names-locations-with-segregated-society-13366987",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-conservative-robert-jenrick_6703995.jpg?20241002121255",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-13 07:04:00",
        "Headline": "The shadow justice secretary tells Sky News \"there are certain places in this country where people are not living side by side\".",
        "Content": "Robert Jenrick has claimed the UK is \"already an island of strangers\" after the prime minister faced criticism for using that phrase in a speech on migration.  The shadow justice secretary told Sky News Breakfast with Wilfred Frost that the UK was not at risk of becoming an \"island of strangers\", as Sir Keir claimed, but that this already the reality. Politics latest: PM under fire for 'island of strangers' phrase Asked if he agreed with the PM's language he said: \"I think we already are. I think there are certain places in this country where people are not living side by side, where we are a very divided and segregated society. \"If you look at the centre of Bradford, for example, 50% of people were not born in the UK. If you look at the centre of Luton, almost 50% of people only arrived in the UK in the last 10 years. If you look at parts of Dagenham, the white British population has reduced by 50% in the last 25 years.\" In 2021, 80.1% of Bradford residents reported their country of birth as England according to the ONS, while in Luton the figure is 60.3% of the local population and in Barking and Dagenham it was 58.2%. In Barking and Dagenham, about 85% of the population identified as white in 2001, which fell to 58.3% in 2011 and 44.9% in 2021. In his speech on Monday announcing a package of measures to reduce net migration, Sir Keir pledged a new system that is \"controlled, selective and fair\". He said without the fair rules, \"we risk becoming an island of strangers, not a nation that walks forward together\". The comment has attracted criticism from within his own party, including Labour MP Sarah Owen, who said it could put the UK on \"a very dark path\".  The chair of the Women and Equalities Select Committee said \"fair and sensible\" checks on immigration \"should not equal blaming all the woes of our country on immigrants\". \"The best way to avoid becoming an 'island of strangers' is investing in communities to thrive - not pitting people against each other,\" she added. \"I've said it before and will say it again, chasing the tail of the right risks taking our country down a very dark path.\" Nadia Whittome, the Labour MP for Nottingham East, also said the phrase mimicked the \"scaremongering of the far-right\", while former shadow chancellor John McDonnell argued it was reminiscent of the late politician Enoch Powell. Home Secretary Yvette Cooper defended the prime minister, pointing out \"he also said we are a diverse nation and that he celebrates that\". She added: \"It is possible to both say that we have had huge benefits through generations by people coming, being part of communities, contributing, and also that that will continue to be important in the future, and also say we have a problem with the immigration system and that net migration needs to come down.\""
    },
    {
        "title": "Weight-loss jabs for obese kids 'are effective and help prevent mealtime rows'",
        "description": "Weight-loss jabs for obese children are effective and help prevent battles around mealtimes, researchers have claimed.",
        "url": "https://news.sky.com/story/weight-loss-jabs-for-obese-kids-are-effective-and-help-prevent-mealtime-rows-13366937",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-weight-health-weight-loss_6914683.jpg?20250513051449",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-13 04:05:00",
        "Headline": "The National Institute for Health and Care Excellence (Nice) previously stopped its appraisal of semaglutide (Wegovy) for use in 12 to 17-year-olds after the manufacturer, Novo Nordisk, said it was unable to provide evidence for submission.",
        "Content": "Weight-loss jabs for obese children are effective and help prevent battles around mealtimes, researchers have claimed. Experts presented the findings at the European Congress on Obesity in Malaga, Spain. They found that the drugs helped obese youngsters lose weight on top of a diet and lifestyle plan. The National Institute for Health and Care Excellence (Nice), however, is \"unable to make a recommendation\" about use of the jabs on teenagers because of a lack of evidence of their impacts. Weight-loss jabs, also known as GLP-1 receptor agonists, work by reducing food cravings but are known to cause nausea, diarrhoea, stomach cramps and vision problems. They are available on the NHS for adults with a high body mass index (BMI) or through private providers. In certain instances where there is a proven clinical need, specialist paediatric clinics can prescribe weight-loss injections. \n                  Weight loss jabs could almost halve risk of obesity-related cancers beyond slimming down, study suggests\n                 \n                  NHS trust accused of 'covering up' concerns about suspended surgeon should be criminally investigated, say families of patients\n                 \n                  'This thing has hijacked my mind': Woman reveals devastating impact of little-known disorder\n                 Dr Annika Janson, from Karolinska University Hospital in Sweden, presented the new research. She said: \"GLP-1 drugs are increasingly used to treat obesity in adults. \"They can also be used in children from the age of 12 and clinical trials have shown children lose 5-16% of their body weight after a year of treatment.\" Alongside this, Dr Janson said the jabs had results \"beyond obesity\". \"The families reported reduced conflicts around food and improved capacity for other lifestyle adaptations,\" she said. She added: \"It was easier to stick to meals and limit snacks. Portions could be downsized. For some children, not being hungry all the time is a new feeling.\" A spokesperson for Novo Nordisk said the company hadn't submitted evidence for NICE appraisal because it lacked \"utility data and risk equations in linking weight loss in adolescents to long-term outcomes.\" It added that, at this time, it had no intention of making an evidence submission. Last year, a report by the Food Foundation said that children in the UK were getting shorter, fatter and sicker due to \"shocking levels\" of poverty and food deprivation. It found that obesity among 10 to 11-year-olds had increased by 30% since 2006, with one in five children classed as obese by the time they leave primary school. It comes as new data presented by Novo Nordisk showed that Wegovy for adults could help protect against heart disease in the earliest stages. Read more from Sky News:'Simple' test can spot heart disease risk 10 years early - studyLines suspended as power cut hits TubeTrailblazing female jockey retires Alongside this, it was said to cut the risk of heart attack, stroke or early death in high-risk patients."
    },
    {
        "title": "Cassie tells court 'freak offs' became like a job as she alleges years of abuse by Sean 'Diddy' Combs",
        "description": "Sean \"Diddy\" Combs's former girlfriend Cassie has told his sex-trafficking trial that \"freak offs\" with male escorts became like a job, as the music mogul allegedly abused and sexually exploited her for years.",
        "url": "https://news.sky.com/story/cassie-tells-court-freak-offs-became-like-a-job-as-she-alleges-years-of-abuse-by-sean-diddy-combs-13367399",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cassie-sean-diddy-combs_6915488.jpg?20250513182306",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-13 20:15:00",
        "Headline": "During the second day of evidence in the Sean Combs sex-trafficking trial, his former partner Cassie, who is eight months pregnant, spent about six hours on the witness stand, alleging she was degraded and sexually abused for years - which he denies. Her evidence continues on Wednesday.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Sean \"Diddy\" Combs's former girlfriend Cassie has told his sex-trafficking trial that \"freak offs\" with male escorts became like a job, as the music mogul allegedly abused and sexually exploited her for years. The musician and model, whose full name is Casandra Ventura, did not look at Combs as she took to the witness stand in court in Manhattan, New York. Over about six hours, the 38-year-old, who is eight months pregnant with her third child with husband Alex Fine, at times became emotional as she alleged she was degraded by her former partner during their 10-year on-off relationship. Sean 'Diddy' Combs trial: Day 2 - As it happened  Combs, 55, has pleaded not guilty and strenuously denied allegations of sexual abuse. His lawyers argue that although he could be violent, he never veered into sex trafficking and racketeering, and that all sexual encounters were consensual. Ms Ventura, who is the central witness in the prosecutors' case, began by telling the jury how Combs was violent to her over the course of their relationship, giving her black eyes and bruises. The hip-hop star became increasingly controlling, she said, and was allegedly abusive over the smallest perceived slights. \"You make the wrong face, and the next thing I knew I was getting hit in the face,\" she said. Ms Ventura was 19 when she signed to his label, Bad Boy, she said, and 22 when, during the first year of their relationship, Combs first proposed a \"freak off\" - a sexual encounter with a third party. Her \"stomach churned\", she said, and she was \"confused, nervous, but also loved him very much\" and wanted to please him. She described him as \"charming\" but \"polarising\".  'There was no space to do anything else' Throughout her time on the stand, she gave graphic details of these drug and drink-fuelled encounters with male escorts, saying Combs would watch and masturbate, and often record the encounters and watch the videos back. They could last for hours or even days, she said - telling the court the longest went on for four days. They ended up becoming weekly events and took priority over her music career, jurors heard. While she had hits with singles Me & U and Long Way 2 Go in 2006, and signed a 10-album deal with Bad Boy, jurors heard she only released one album. \"Freak-offs became a job where there was no space to do anything else but to recover and just try to feel normal again,\" Ms Ventura said. Each time, she added, she had to recuperate from lack of sleep, alcohol, drugs \"and other substances\", and \"having sex with a stranger for days\". Read more:The rise and fall of Sean CombsDiddy - a timeline of allegationsEverything you need to know about the trial Alleged violence detailed in court Ms Ventura told the court she began feeling as if she could not say no to Combs's demands because \"there were blackmail materials to make me feel like if I didn't do it, it would be held over my head in that way or these things would become public\". She was also worried about potential violence, she told the court. When asked in court how frequently Combs became violent with her, Ms Ventura responded: \"Too frequently.\" The rapper \"would mash me in the head, knock me over, drag me, kick me\", she said. \"Stomp me in the head if I was down\". Ms Ventura also told the court that Combs kept cash, jewellery, guns and \"sometimes tapes from cameras\" in safes at several properties in New York, Los Angeles, Miami and Alpine, New Jersey. \"The guns came out here and there. I always felt it was a little bit of a scare tactic,\" she told the court. Towards the end of her first day of evidence, a surveillance video made public last year, which showed Combs allegedly beating Ms Ventura at a Los Angeles hotel in 2016, was played to jurors in court for a second time. \"How many times has he thrown you like that before?\" prosecutor Emily Johnson asked her. \"Too many to count,\" Ms Ventura replied. On Monday, prosecutors in their opening statement told the court that while Combs's public persona was that of a \"charismatic\" hip-hop mogul, behind the scenes he was violent and abusive. His defence lawyers argued that the case is really about nothing more than the rapper's sexual preferences, which they said should remain private, and do not make him a sex trafficker. The trial is to last about eight weeks. Ms Ventura is set to continue giving evidence on Wednesday."
    },
    {
        "title": "Kim Kardashian feared she was going to die during Paris heist - and tells robber she forgives him ",
        "description": "Kim Kardashian has told a court she feared she would be raped and killed during an armed robbery in her Paris hotel room in 2016. ",
        "url": "https://news.sky.com/story/kim-kardashian-feared-she-was-going-to-die-during-paris-heist-and-tells-robber-she-forgives-him-13366922",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kim-kardashian-paris_6915472.jpg?20250513180014",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-05-13 08:42:00",
        "Headline": "Ten defendants are accused of robbing her at gunpoint in the Hotel de Pourtales in the French capital in October 2016.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  Kim Kardashian has told a court she feared she would be raped and killed during an armed robbery in her Paris hotel room in 2016.  The 44-year-old media personality and businesswoman was tearful as she told the judge: \"I was certain he [one of the robbers] was going to rape me.\" \"I absolutely did think I was going to die,\" she added. \"I said a prayer for my family, and for my sister who would walk in [and find me] and that they would have an okay life after what they saw.\" Kardashian faced a group of 10 defendants - dubbed the 'grandpa robbers' by French media - who are accused of robbing her at gunpoint in the Hotel de Pourtales in the French capital in October 2016. She told the court how one of the robbers pulled her across the bed, exposing her naked body under her hotel robe as he tied her up. She also told the court of her \"violation\", explaining she was \"grabbed and tied upâ€¦ dragged from one room to the other\", and calling the whole thing \"a violent act\". \n                  Kim Kardashian to testify in Paris armed robbery trial as proceedings get under way\n                 \n                  Kim Kardashian's Paris robbery trial: Everything you need to know\n                 \n                  Menendez brothers murder case: Prosecutors review new evidence - as Kim Kardashian calls for their release\n                 Kardashian explained: \"Being touched and picked up when you're naked is very violating.\" Additionally, in a bizarre turn of events in the courtroom, three of the defendants offered messages to Kardashian - two in person and one via a written note. Kardashian had no knowledge of the letter until it was read in court and she tearfully said she forgave one of the robbers. Read more: Everything you need to know about the Paris trial Earlier in the day, Kardashian, wearing a black skirt suit, sunglasses, and with her hair pulled back into a chignon, walked up the courthouse steps accompanied by her mother Kris and a large entourage. Giving evidence in the courtroom, she became tearful when describing the robbery, and talking of her \"confusion\" when two men entered her room dressed as police officers, accompanied by the handcuffed concierge. \"I had fallen asleep naked with a robe on, I was flustered,\" Kardashian told the trial. After five hours of intense questioning, Kim Kardashian gave a sign she was feeling the pressure: a giant yawn. Despite being one of the most photographed women in the world, today, any attempt to film her inside the ornate courtroom would have resulted in an â‚¬18,000 (Â£15,000) fine. She spoke of overhauling her life - no longer keeping jewellery at home, introducing security precautions that she admitted may seem extreme, as well as no longer posting on social media in real time. Amid a life lived on screens, she explained to the French court that posting on social media was part of \"American culture\", dubbing the posts \"mini reality shows\". And while Keeping Up With The Kardashians has brought her international fame, with it has come \"violation\" and \"terror\" at her door, leaving her \"hiding in the bushes on the balcony\", no doubt cursing the very fame she so desires. \"Stung deeply\" by those who saw the robbery as just another publicity stunt, the chance to \"tell her story\" was a moment for Kardashian to \"find closure,\" albeit among yet another media circus, with all eyes firmly on her. 'From fatherly to aggressive' Describing the man who tied her up, who she says was \"smaller and stockier\" than the second man with the gun, Kardashian said: \"I feel like because the guy who tied me up could see how frantic I was, at that moment he felt like a fatherâ€¦ It felt like he wanted me to know that I'd be okay if I just shut up.\" She told the court: \"I kept telling them I have babies and I need to get home to my babies.\" But, after the men began arguing in French, the previously \"fatherly\" man went from saying she'd be okay, \"to aggressively grabbing my naked body\". Asked by the judge if she was hit at any point, Kardashian said: \"No, I was not hit. I was picked up and dragged and dropped on the hard floor, but I was not hit.\" She later confirmed she was dragged by her arms, with both her ankles and wrists bound together, and with a gun held towards her neck. Police say the men escaped on bicycles, with around $9m of jewellery, including a $4m engagement ring from Kardashian's then-husband Kanye West. Most of the jewellery was never recovered. 'Your forgiveness is a sun - I'll be forever grateful' During her evidence, the judge read a statement to Kardashian written by one of the defendants, Aomar Ait Khedache, 68, nicknamed \"Old Omar\" - in which he said he \"regretted\" his actions and had been touched by his conscience. He has so far communicated in court only via handwritten notes, saying he was too unwell to talk. He has previously admitted to participating in the heist but denies the prosecution's accusation that he was the ringleader. When asked by the judge if she had a response, Kardashian said: \"I'm obviously emotional about it, this experience changed my life and it changed my family's life.\" Currently in training to be a lawyer, and a vocal criminal justice reform advocate, she said: \"I have always believed in second chancesâ€¦ I try to have empathy always.\" She went on: \"I do appreciate the letter, I forgive you for what has taken place, but it doesn't change the emotion and the feelings and the trauma the way my life is forever changed.\" She thanked him for his letter. Ait Khedache's lawyer shared his response to Kardashian's words, saying: \"This forgiveness is a sun that comes to illuminate me, thank you.\" He added: \"I'll be grateful to you foreverâ€. The judge then spoke to two defendants in the courtroom, starting with Yunice Abbas, 71, who has previously admitted his part in the heist. Abbas stood and spoke directly to Kardashian, his right hand shaking from Parkinson's as he talked, asking for \"forgiveness\" and saying he too had \"regret\" for what he did. A third defendant, Didier Dubreucq, 69, dubbed \"blue eyes\" by the French press, also briefly spoke and offered a few contrite words, saying, \"I am very sorry about what happened to you\", adding: \"I empathise with your pain.\" 'A sound I had never heard - terror' Earlier on Tuesday, in Paris's central criminal court, Kardashian's stylist Simone Harouche described the moment she was woken by the US star's screams of terror and feared she had been \"raped or violated\". Ms Harouche, 45, who says she has worked for Kardashian for many years and has been friends with her since she was 12, told the court she was woken by \"a sound I had never heard from Kimâ€¦ It was terror\". Sleeping in a separate apartment, on the next floor down from Kardashian's, she told the judge: \"When I realised something terrible was going on upstairs... I started looking for my telephone and I started looking for something to help save mine and Kim's life.\" She went on to lock herself in her bathroom and hide in her shower, where she called Kardashian's sister Kourtney and texted her security guard, Pascal Duvier, telling them: \"Something is very wrongâ€¦ Kim is upstairs with men and we need help.\" She said minutes later, Kardashian \"hopped\" into her room, explaining: \"To see my friend with her feet taped and a very light robe with nothing under, and all messed up and pulled, I thought she could have been raped or very violated.\" She said she removed the tape from Kardashian's feet, and her friend was \"beside herself\". The trial, which is being held in front of three judges and six jury members, is due to conclude at the end of this week."
    },
    {
        "title": "Sean 'Diddy' Combs trial: What we know about the 12 members of the jury",
        "description": "The outcome of the Sean \"Diddy\" Combs sex trafficking trial is in the hands of the 12 individuals who have been selected as jurors.&#160;",
        "url": "https://news.sky.com/story/sean-diddy-combs-trial-what-we-know-about-the-12-members-of-the-jury-13366986",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-sean-combs-2022-p-diddy_6754650.jpg?20241122162548",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-13 07:04:00",
        "Headline": "Eight men and four women have been selected to serve on the jury during the high-profile sex trafficking trial. They range from ages 30 to 74 and come from different neighbourhoods across New York. Here is what we know.",
        "Content": "The outcome of the Sean \"Diddy\" Combs sex trafficking trial is in the hands of the 12 individuals who have been selected as jurors.Â  On Monday, the group of jurors - made up of eight men and four women - listened to opening statements from the prosecution and defence as the trial got underway in Manhattan, New York. The 55-year-old hip-hop mogul has strenuously denied the allegations against him and pleaded not guilty to five charges. They are: One count of racketeering conspiracy, two counts of sex trafficking by force, fraud or coercion, and two counts of transportation to engage in prostitution. Members of the jury range in age from 30 to 74, coming from different neighbourhoods across New York, and from a wide range of professions. Here is everything we know about the group tasked with deciding the outcome of the high-profile case.  How were jurors selected? The 12 individuals were whittled down from a pool of 45 prospective jurors last week. During the selection process, each individual was questioned by Judge Arun Subramanian in a legal process known as \"voir dire\" - translated from French as \"to speak the truth\". The process aims to find a panel of 12 main jurors and six alternates who can be fair and impartial. That has been a particularly sensitive issue in this trial, given Combs' celebrity status as an entrepreneur and rap mogul and the worldwide coverage of the case so far. Jurors were quizzed about their hobbies and musical tastes, with some of the younger jurors in their 30s and 40s saying they listen to hip-hop and R&B music - genres that are closely associated with Combs. They were also asked if they had any views on the prosecution or the defence, if they or someone close to them had been a victim of crime, and their beliefs on hiring sex workers, the use of illegal drugs, hip-hop artists and law enforcement. Judge Subramanian then asked jurors whether they had heard of names included on a list of individuals, including celebrities, who may be mentioned during the trial. The list is long, the court heard, with the judge saying it reminded him of Lord Of The Rings.  As jury selection unfolded, Combs sat in court wearing a white shirt with a black crew-neck sweater, grey trousers and glasses. He appeared to express his approval or disapproval at each individual, either with a nod or by shaking his head no, to his attorneys. Read more about how jury selection unfolded in court here. Read more:Diddy on trial: Everything you need to knowSean Combs: A timeline of allegations What to know about those selected The individuals selected to sit on the jury include an investment analyst, a healthcare worker, a massage therapist and a deli worker, according to Sky News' US partner network, NBC News. When called for jury duty, potential jurors are allocated a number, which allows the court to keep track of the individuals and ensures a random selection process. Here is everything we know about those selected for Combs's trial: â€¢ Juror no 2: A 69-year-old male from Manhattan who works as an actor and massage therapist. He listens to classical, jazz and rock music, and his hobbies include music, theatre, cycling and hiking. â€¢ Juror no 5: A 31-year-old male from Manhattan who works as an investment analyst. He enjoys playing sports and video games. â€¢ Juror no 25: A 51-year-old male from Manhattan who has a PhD in molecular biology and neuroscience. He listens to classical music and opera, and his hobbies include art, science, cooking and the outdoors. â€¢ Juror no 28: A 30-year-old female from the New York borough of the Bronx, who works in a deli. She listens to hip-hop and reggaeton and enjoys reading and playing video games. â€¢ Juror no 55: A 42-year-old female from Manhattan who is an aide in a nursing home. She likes to cook and paint, and watch Harry Potter and Disney films. â€¢ Juror no 58: A 41-year-old male from the Bronx who works in communications at a US prison. He listens to reggaeton and '90s hip-hop, and his hobbies include sports and fantasy football. â€¢ Juror no 75: A 68-year-old male from Westchester County, just north of New York City, who is a retired bank worker. He listens to Indian music and plays cricket and volleyball. â€¢ Juror no 116: A 68-year-old male from Westchester County who is retired and used to work at a telecommunications company. He listens to rock music, and likes to bowl and play golf. â€¢ Juror no 160: A 43-year-old female from Westchester County who works as a healthcare worker. She listens to R&B and hip-hop, and likes dancing. â€¢ Juror no 184: A 39-year-old male from the Bronx who is a social worker. He listens to R&B and popular music from West Africa, and enjoys watching sports. â€¢ Juror no 201: A 67-year-old male from Westchester County who works as a logistics analyst. His hobbies include woodworking and cycling. â€¢ Juror no 217: A 74-year-old female from Manhattan who works as a treatment coordinator. She listens to classical music and likes to travel. The six alternate jurors chosen include four men and two women, ranging in age from 24 to 71. Those individuals will hear the entire case but will only participate in the decision-making if one of the 12 main jurors cannot continue. The trial is expected to last around eight weeks."
    },
    {
        "title": "French actor Gerard Depardieu found guilty of sexually assaulting two women",
        "description": "French actor Gerard Depardieu has been found guilty of sexually assaulting two women - and handed an 18-month suspended sentence.",
        "url": "https://news.sky.com/story/gerard-depardieu-found-guilty-of-sexual-assault-13367002",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-gerard-depardieu-trial_6867262.jpg?20250326091431",
        "type": "Entertainment",
        "Author": "Adam Parsons",
        "Date Published": "2025-05-13 07:59:00",
        "Headline": "The 76-year-old star is given a suspended sentence after being convicted of groping the women during the filming of 2021 movie Les Volets Verts.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n French actor Gerard Depardieu has been found guilty of sexually assaulting two women - and handed an 18-month suspended sentence. Depardieu, 76, was convicted by a court in Paris of groping the women during the filming of the 2021 movie Les Volets Verts (The Green Shutters). Both victims had been working on the film in behind-the-scenes roles. Following his convictions, Depardieu was fined â‚¬29,040 (about Â£24,000) and the court requested that he is registered in the national sex offender database. His lawyer Jeremie Assous said the star, who denied assault and did not attend Tuesday's hearing, will appeal against the verdict.  The two victims said they were scared to speak out at the time and were intimidated by Depardieu. \"I was petrified\", said one of the women, a set designer named Amelie. She told the court that Depardieu had trapped her between his legs as she tried to get past him in a corridor, and had then run his hands over her body. \"He terrified me - he looked like a madman,\" she said. Depardieu had denied the allegations, and had received support from many actors, directors and even at one point, the French president, Emmanuel Macron, who had previously described the actor as \"the pride of France\". However, his victims said that he attacked them - first using obscene, vulgar and explicit language towards the women before sexually assaulting them. The court heard that the actor first used vulgar language to abuse them and then grabbed them and ran his hands over their bodies, making crude sexual advances towards them. 'The end of impunity' Depardieu, who has appeared in more than 200 movies, claimed that he did not even know what sexual assault was. But judge Thierry Donard said Depardieu's explanation of events had been unconvincing and, at times, contradictory. Carine Durrieu-Diebolt, the lawyer representing victim Amelie, told the court that Depardieu had specifically targeted women who did not enjoy a high profile, saying he would never treat a famous actor the way he behaved towards his two victims. \"He is strong with the weak, and weak with the strong,\" she said. Following the verdict, she told reporters: \"It is the victory of two women, but it is the victory of all the women beyond this trial. \"Today we hope to see the end of impunity for an artist in the world of cinema. \"I think that with this decision, we can no longer say that he is not a sexual abuser. And today, as the Cannes Film Festival opens, I'd like the film world to spare a thought for Gerard Depardieu's victims.\" 'Women were put in danger' During cross-examination, Depardieu admitted he had first denied ever touching Amelie, then said he grasped her hips to stop himself from falling over, and then claimed he had grabbed her to get her attention. Amelie described his account as \"obviously completely false\" and said she had been mentally scarred by the encounter. Read more from the trial:What does the trial mean for #MeToo in France?Inside the court during the Depardieu trial Away from the court, Ms Diebolt told Sky News that, after years of being tolerated due to his fame, Depardieu was finally being held accountable for his actions. \"These women were put in danger,\" she said. \"This is about a line of offences that he committed over many years that were tolerated by the world of cinema because it was Gerard Depardieu. \"Because the financial benefits he brings to the industry are so substantial. He did make some excellent films, but all men are equal before the law. \"Nobody warned Amelie about Depardieu's behaviour, so his words and actions came as a terrible surprise for her. She still has traumatic flashbacks.\" Rape allegation Depardieu's reputation is now in tatters, and there may be more allegations to come. Ms Diebolt told Sky News that around 20 other women have said that they were attacked by the actor. And we already know that Depardieu will stand trial again later this year, this time charged with raping the actress Charlotte Arnould. Ms Arnould has accused Depardieu, a friend of her parents, of raping her at his mansion in Paris. When she returned to the house to confront him, she alleges that he raped her once again. Depardieu denies both allegations. If he were to be found guilty, he would face a substantial prison sentence. Depardieu's sexual assault conviction is being seen as an important step forward for France's growing MeToo movement, which he described as \"a terror\" during the proceedings. After a letter of support Depardieu received prior to the trial from prominent actors and directors, a separate group of around 600 artists wrote their own, condemning the culture of \"impunity\" and calling for the actor to be fully investigated. 'Wall of silence' Emmanuelle Dancourt, president of MeToo Media, told me: \"Depardieu is a man with a lot of money around him. \"Everybody could see Depardieu talking badly to women, putting his hand in the wrong place on a woman's body and saying things that are wrong. \"But Gerard Depardieu's best friend is silence. In France, you have a wall of silence, and this means impunity. If you are a man with a lot of power and a lot of money, you can do whatever you want.\" Depardieu's popularity has declined as more and more claims emerged about his conduct. A recent documentary about him featured footage, filmed in North Korea, of the actor making lewd comments as a young girl rode past on a horse. When Mr Macron offered his support to Depardieu, denouncing what he called \"a manhunt\" against the star, another French actor, James Bond star Lea Seydoux, said the president's words had given a \"bad image\" of France. Depardieu was given Russian citizenship as a gift by Vladimir Putin."
    },
    {
        "title": "Rapper Tory Lanez 'stabbed 14 times' while serving sentence for Megan Thee Stallion shooting",
        "description": "Rapper Tory Lanez has said he was stabbed 14 times while serving his prison sentence for shooting hip-hop star Megan Thee Stallion in the foot.&#160;",
        "url": "https://news.sky.com/story/rapper-tory-lanez-stabbed-14-times-while-serving-sentence-for-megan-thee-stallion-shooting-13366981",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-tory-lanez-megan-thee-stallion_6914751.jpg?20250513075719",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-13 09:17:00",
        "Headline": "Lanez is serving a 10-year sentence for shooting Megan Thee Stallion, whose legal name is Megan Pete, in the foot after leaving a party at Kylie Jenner's Hollywood Hills home in July 2020.",
        "Content": "Rapper Tory Lanez has said he was stabbed 14 times while serving his prison sentence for shooting hip-hop star Megan Thee Stallion in the foot.Â  Lanez, 32, sustained \"7 wounds to his back, 4 to his torso, 2 to the back of his head, and 1 to the left side of his face\", according to a post on his verified Instagram account. Canadian Lanez, whose legal name is Daystar Peterson, was attacked at the California Correctional Institution in Tehachapi at 7.20am (3.20pm UK time) on Monday, according to a spokesman for the Department of Corrections and Rehabilitation. He was hospitalised following the stabbing, which is being investigated by authorities. \"Both of his lungs collapsed,\" the rapper's social media statement said, adding Lanez was \"now breathing on his own\". \"Despite being in pain, he is talking normally, in good spirits, and deeply thankful to God that he is pulling through. He also wants to thank everyone for their continued prayers and support,\" the post said. Lanez is serving a 10-year sentence for shooting Megan Thee Stallion, 30, in the foot and shouting at her to dance as she walked away from an SUV they drove in after leaving a party at Kylie Jenner's Hollywood Hills home in July 2020. \n                  Megan Thee Stallion granted restraining order against imprisoned Tory Lanez after 2020 shooting\n                 \n                  Tory Lanez sentenced to 10 years in prison for shooting Megan Thee Stallion in the foot\n                 \n                  Rapper Tory Lanez found guilty over shooting of hip hop star Megan Thee Stallion\n                 He was convicted of assault with a semiautomatic firearm, having a loaded, unregistered firearm in a vehicle and discharging a firearm with gross negligence in December 2022. In January, a Los Angeles judge granted her request for a protective order until early 2030 after she alleged Lanez had been harassing her from prison through surrogates. Megan Thee Stallion, whose legal name is Megan Pete, was already a rising hip-hop star at the time of the shooting, and her music's popularity has only soared since. Read more from Sky News:What it was like in court for start of P Diddy trialKim Kardashian's Paris robbery: Everything you need to know She had number one singles with Savage and as a guest on Cardi B's WAP in 2020, winning a Grammy for best new artist a year later. Lanez started to release mixtapes in 2009 and steadily rose in popularity, moving on to major label albums, with his last two reaching the top 10 on the Billboard charts."
    },
    {
        "title": "What it was like in court for start of P Diddy trial - as gasps heard from public gallery",
        "description": "In September 2023, crowds packed Times Square, cheering, and taking pictures as Sean \"Diddy\" Combs received the key to the city, an honour bestowed on him by the New York City mayor who called Combs the \"bad boy of entertainment\".&#160;",
        "url": "https://news.sky.com/story/p-diddy-used-to-be-the-hottest-ticket-in-town-he-never-imagined-it-would-be-like-this-13366929",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sean-combs_6914677.jpg?20250513021528",
        "type": "Entertainment",
        "Author": "Martha Kelner",
        "Date Published": "2025-05-13 00:58:00",
        "Headline": "The hip hop mogul's fall from grace has been sharp and shocking, says Sky's Martha Kelner, who was at the court when he blew a kiss to the family he may never see again as a free man.",
        "Content": "\n          US correspondent\n              @marthakelner\n In September 2023, crowds packed Times Square, cheering, and taking pictures as Sean \"Diddy\" Combs received the key to the city, an honour bestowed on him by the New York City mayor who called Combs the \"bad boy of entertainment\".Â  Less than two years later and just three miles down the road, people were now queueing around the block to secure a spot to see him inside the courtroom to face charges of sex trafficking, racketeering and transportation for prostitution. Sean 'Diddy' Combs trial: As it happened The fall from grace of this music mogul has been sharp and shocking. The contrast of the image of him that day, holding a giant gold plated key aloft, his sleek black hair neatly groomed and wearing expensive jewellery with the man sitting at the defence table is stark. After spending seven months imprisoned at the Brooklyn Metropolitan Detention Center, Combs's hair is now fully grey, his beard overgrown. His mother Janice arrived at the court in a black SUV. I asked her how her son was feeling ahead of the first day of evidence in this case but she remained stony faced. \n                  Cassie tells court 'freak offs' became like a job as she alleges years of abuse by Sean 'Diddy' Combs\n                 \n                  Sean 'Diddy' Combs trial: What we know about the 12 members of the jury\n                 \n                  Sean 'Diddy' Combs forced women into 'freak offs', jurors told - as hotel CCTV is played in court\n                 Combs's sons Justin and King and his 17-year-old twin daughters, D'Lila Star and Jessie James, followed behind in a large people carrier van with other family members. When Combs was escorted into the courtroom he waved and blew a kiss to his family, who were seated in the second row of the public gallery. They may never again see him as a free man, with the most serious charges against him carrying a possible life prison sentence. Combs, who was wearing a cream jumper, grey trousers and dark-rimmed glasses embraced members of his defence team when he arrived. He listened intently as the prosecution painted a picture of a violent monster, sometimes taking notes. Read more: Combs forced women into 'freak offs', jurors told Combs used his business empire and considerable power, the government said, to force women into sex, to beat them and then to cover it up. There were gasps from the public gallery in the overflow courtroom as prosecutor Emily Johnson delivered the opening statement, especially as she mentioned disturbing detail about Combs's alleged drug-fuelled sex parties, which he called \"freak offs\". Read more:The rise and fall of Sean 'Diddy' CombsDiddy - a timeline of allegationsEverything you need to know about the trial The prosecution's star witness will be Cassie Ventura. The pop star was in a relationship with Combs for eleven years. Her husband Alex Fine was in court as the trial began in earnest and Cassie is expected to begin giving evidence on Tuesday morning. She is heavily pregnant and may choose to make a low profile entrance into the courthouse, avoiding the scrum of national and international media outside. Even before the first day concluded, people were already queuing for a seat in the public gallery tomorrow. Those at the front of the line are being paid (between $25 to $40 an hour) to hold a spot for others. These \"professional line sitters\" will be here outside the courthouse overnight when it is expected to rain. P Diddy is used to being the hottest ticket in town but he presumably never imagined it would be in these circumstances. He denies all the charges against him."
    }
]