[
    {
        "title": "Israel resumes airdrops into Gaza - as baby girl dies weighing less than when she was born",
        "description": "Israel has resumed airdrops of aid into Gaza, as reports and condemnation of starvation and famine continue to spread.",
        "url": "https://news.sky.com/story/israel-resumes-airdrops-into-gaza-as-baby-girl-dies-weighing-less-than-when-she-was-born-13402351",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestinians-israel_6974842.jpg?20250726224543",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-26 23:26:00",
        "Headline": "The Hamas-run health ministry in Gaza says 127 people have died from malnutrition-related causes, including 85 children.",
        "Content": " Israel has resumed airdrops of aid into Gaza, as reports and condemnation of starvation and famine continue to spread. In a statement, the Israel Defence Forces added that humanitarian corridors would also be established for United Nations convoys to deliver aid into the region, though it did not say when or where. While the IDF \"emphasises that combat operations have not ceased\" - and reiterated claims there is \"no starvation\" in Gaza - it said: \"The airdrops will include seven pallets of aid containing flour, sugar and canned food to be provided by international organisations.\"  The military added that it is prepared to implement \"humanitarian pauses\" in densely populated areas. Reports suggest aid has already been dropped into Gaza, with some injured after fighting broke out. In other developments, Bob Geldof has accused Israeli authorities of \"lying\" about starvation in the territory - telling Sunday Morning With Trevor Phillips that the IDF is \"dangling food in front of starving, panicked, exhausted mothers\". He told Sky News: \"This month, up to now, 1,000 children or 1,000 people have died of starvation. I'm really not interested in what either of these sides are saying.\" \n                  Bob Geldof accuses Israeli authorities of 'lying' about starvation in Gaza\n                 \n                  Scottish Labour MSPs heap pressure on Starmer to recognise Palestinian state\n                 \n                  25% of young children and pregnant women malnourished in Gaza, charity says, as PM vows to fly critical medical cases to UK \n                  Israel cut off all supplies to Gaza from the start of March. It then reopened it with new restrictions in May, but said the supply had to be controlled to prevent it from being stolen by Hamas militants. On Saturday, reports referencing US government data said that there was no evidence Hamas had stolen aid from UN agencies. The IDF's international spokesperson, Lieutenant Colonel Nadav Shoshani, described such reports as \"fake news\" and said Hamas thefts have been \"well documented\".  Airdrops 'expensive and inefficient' It comes as the Hamas-run health ministry in Gaza said that, as of Saturday, 127 people have died from malnutrition-related causes, including 85 children. They include a five-month-old girl who weighed less than when she was born, with a doctor at Nasser Hospital describing it as a case of \"severe, severe starvation\". Health workers have also been weakened by hunger, with some putting themselves on IV drips so they can keep treating badly malnourished patients.  On Friday, Israel said it would allow foreign countries to airdrop aid into Gaza - but the UN Relief and Works Agency has warned this will not reverse \"deepening starvation\". UNRWA head Philippe Lazzarini described the method as \"expensive\" and \"inefficient\", adding: \"It is a distraction and screensmoke. A manmade hunger can only be addressed by political will. \"Lift the siege, open the gates and guarantee safe movements and dignified access to people in need.\" He added that UNRWA has the equivalent of 6,000 trucks in Jordan and Egypt waiting for permission to enter Gaza.  MSF, also known as Doctors Without Borders, warned on Friday that 25% of young children and pregnant women in Gaza are now malnourished, and said the lack of food and water on the ground was \"unconscionable\". The UN also estimates that Israeli forces have killed more than 1,000 people seeking food - the majority near the militarised distribution sites of the US-backed aid distribution scheme run by the Gaza Humanitarian Foundation. Read more:What does recognising a Palestinian state mean?British surgeon claims IDF 'deliberately' shooting boys In a statement on Friday, the IDF had said it \"categorically rejects the claims of intentional harm to civilians\", and reports of incidents at aid distribution sites were \"under examination\". The GHF has also previously disputed that these deaths were connected with its organisation's operations, with director Johnnie Moore telling Sky News: \"We just want to feed Gazans. That's the only thing that we want to do.\""
    },
    {
        "title": "Bob Geldof accuses Israeli authorities of 'lying' about starvation in Gaza",
        "description": "Bob Geldof has accused the Israeli authorities of \"lying\" about starvation in Gaza - after Israel's government spokesperson claimed there was \"no famine caused by Israel\".",
        "url": "https://news.sky.com/story/bob-geldof-accuses-israeli-authorities-of-lying-about-starvation-in-gaza-13402178",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-khan-younis-palestinian_6973145.jpg?20250725072441",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-26 14:33:00",
        "Headline": "Appearing on Sunday Morning with Trevor Phillips, Bob Geldof said 1,000 children or people have died of starvation this month.",
        "Content": " Bob Geldof has accused the Israeli authorities of \"lying\" about starvation in Gaza - after Israel's government spokesperson claimed there was \"no famine caused by Israel\". Earlier this week, David Mencer claimed that Hamas \"starves its own people\" while on The News Hour with Mark Austin, denying that Israel was responsible for mass hunger in Gaza. Appearing on Sunday Morning with Trevor Phillips, Geldof said the claims are false. Follow latest: Gaza aid airdrops a 'smokescreen' and 'distraction'  Sir Trevor asked the Live Aid organiser: \"The Israeli view is that there is no famine caused by Israel, there's a manmade shortage, but it's been engineered by Hamas. \"I guess the Israelis would say we don't see much criticism from your side of Hamas.\" In response, Geldof said \"that's a false equivalence\" and \"the Israeli authorities are lying\". The singer then added: \"They're lying. [Benjamin] Netanyahu lies, is a liar. The IDF are lying. They're dangling food in front of starving, panicked, exhausted mothers. \"And while they arrive to accept the tiny amount of food that this sort of set up pantomime outfit, the Gaza Humanitarian Front, I would call it, as they dangle it, then they're shot wantonly. \"This month, up to now, 1,000 children or 1,000 people have died of starvation. I'm really not interested in what either of these sides are saying.\"  In the Sky News interview earlier this week, Mr Mencer added: \"This suffering exists because Hamas made it so. Here are the facts. Aid is flowing, through the Gaza Humanitarian Foundation. Millions of meals are being delivered directly to civilians.\" He also claimed that, since May, more than 4,400 aid trucks had entered Gaza carrying supplies. It comes after MSF, also known as Doctors Without Borders, warned 25% of young children and pregnant women in Gaza are now malnourished. The charity said Israel's \"deliberate use of starvation as a weapon\" has reached unprecedented levels, and said that at one of its clinics in Gaza City, rates of severe malnutrition in children under five have trebled over the past two weeks. MSF then described the lack of food and water on the ground \"unconscionable\".  In a statement to Sky News, an Israeli security official said that \"despite the false claims that are being spread, the State of Israel does not limit the number of humanitarian aid trucks entering the Gaza Strip\". It then blamed other groups for issues delivering aid. They said: \"Over the past month, we have witnessed a significant decline in the collection of aid from the crossings into the Gaza Strip by international aid organisations. \"The delays in collection by the UN and international organisations harm the situation and the food security of Gaza's residents.\" Read more:What does recognising a Palestinian state mean?Surgeon claims IDF 'deliberately' shooting boys at Gaza aid pointsSecurity shot at Palestinians at Gaza aid centre - ex-guard The IDF also told Sky News: \"The IDF allows the American civilian organisation (GHF) to distribute aid to Gaza residents independently, and operates in proximity to the new distribution zones to enable the distribution alongside the continuation of IDF operational activities in the Gaza Strip. \"Following incidents in which harm to civilians who arrived at distribution facilities was reported, thorough examinations were conducted in the Southern Command and instructions were issued to forces in the field following lessons learned. \"The aforementioned incidents are under review by the competent authorities in the IDF.\" You can watch the full interview on Sunday Morning with Trevor Phillips at 8.30am this morning - and throughout the day on Sky News."
    },
    {
        "title": "There seems no end in sight to asylum hotel protests - as five intense minutes by a roundabout in Norwich proved",
        "description": "It was an unlikely backdrop for a protest - a large roundabout on the outskirts of Norwich.",
        "url": "https://news.sky.com/story/there-seems-no-end-in-sight-to-asylum-hotel-protests-as-five-intense-minutes-by-a-roundabout-in-norwich-proved-13402308",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-norwich-asylum-emma-birchley_6974760.jpg?20250726201922",
        "type": "Home",
        "Author": "Emma Birchley",
        "Date Published": "2025-07-26 18:19:00",
        "Headline": "Witnesses say one of the pro-immigration protesters near the Brook Hotel had approached the much larger group wearing a balaclava - in seconds, the pent-up fury spilt over as an angry crowd surged towards the police.",
        "Content": "\n          News correspondent\n        It was an unlikely backdrop for a protest - a large roundabout on the outskirts of Norwich. But behind the trees flanking one of the carriageways was the reason hundreds had come - another hotel being used to house asylum seekers. Just as towns and cities around the country have seen protests in recent days, most prominently in Epping in Essex where at least 18 arrests have been made, this time the focus was the Brook Hotel. It started peacefully - bar the beeping of horns of passing cars and the chants from protesters on both sides. But in a flash, it all changed. Witnesses say one of the pro-immigration protesters had approached the much larger group wearing a balaclava and in seconds the pent-up fury spilt over as an angry crowd surged towards the police, shouting and swearing. Some tried and failed to hold back the furious crowd urging peace as a small group of police and protesters rolled down a verge, while backup officers emerged from a side road. \n                  Man suffers cardiac arrest onboard boat trying to reach UK \n                 \n                  Epping council demands government 'immediately' close asylum hotel – as Home Office works to 'restore order'\n                 \n                  Epping disorder: Police launch appeal to find two men\n                 But as quickly as it started, it was all over - an intense five minutes that seemed to take the wind out of their anger. Trying to find anyone willing to speak was almost impossible: \"We don't talk to the mainstream media,\" a common phrase. But David Beane, from nearby Costessey, a veteran and the father of an eight-year-old boy, had clear views he wanted to share. \"I know homeless people from the forces. I got out of the force, no dental treatment, I can't get a doctors. They get everything,\" he said. \"I'm all up for immigrants coming, but sign the paperwork. You show who you are, you come in, you abide by our laws.\" It was David's first time at a protest. Another local man attending was Glen. \"They're in there, free rent, free everything,\" he said. Referring to the hotel, he added: \"Do you know they are even getting meal tickets to go in that pub with, and they supply meals in there?\" Read more:Asylum seekers threatened with homelessness if they refuse hotel moveWhat is the UK-France migrant returns deal, who will be returned and how many? There have been protests in nearby Diss too this week. The Park Hotel in the town has now informed the Home Office that it will close altogether if it is ever made to house single men rather than families at the location. Back in Norwich, torrential rain was enough the bring an end to the day's event. Only a few stragglers remained two-and-a-half hours after it had all begun. But it seems likely they will be back. There seems to be no end in sight to the current spate of disruption."
    },
    {
        "title": "Huge security operation as Donald Trump tees off at his Scottish golf course",
        "description": "Donald Trump has been spotted on his golf course in Scotland, with a massive security operation keeping both media and locals at a distance.",
        "url": "https://news.sky.com/story/huge-security-operation-as-donald-trump-tees-off-at-his-scottish-golf-course-13402055",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-golf-turnberry-scotland_6974238.jpg?20250726112759",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-26 10:30:00",
        "Headline": "Roads were closed and police and army personnel searched the golf course before the US president teed off on Saturday, the first full day of his UK visit.",
        "Content": " Donald Trump has been spotted on his golf course in Scotland, with a massive security operation keeping both media and locals at a distance. Roads were closed around the Turnberry course as a large number of police and army, and navy personnel were seen searching the grounds before the US president teed off on Saturday, the first full day of his UK visit. Sniffer dogs patrolled the course, snipers were deployed, a police helicopter hovered overhead and a boat sat off the coast. His first round of golf came hours after an attack on Europe, in which the US president told Europe to \"get your act together\" on immigration, which he said was \"killing\" the continent. But he had words of praise for Sir Keir Starmer after touching down in Ayrshire on Friday, describing him as a \"good man\" while adding he is \"slightly more liberal than I am\". Mr Trump is due to have talks with Sir Keir and Scottish First Minister John Swinney, as well as discussing trade with European Commission President Ursula von der Leyen. The president headed straight to the resort, which he bought in 2014 and which he wants to see host The Open, after landing. Scotland correspondent We heard him before we saw him. It was the surreal moment Donald Trump trundled over the Turnberry course with music blaring from his golf buggy. The songs of choice were even more interesting given the crisis facing the US president amid the Jeffrey Epstein saga. Bridge Over Troubled Water by Simon and Garfunkel was the hit swirling around as the wind projected the music beyond a wall of police that had formed to protect the president. It was an eyebrow-raising moment to say the least. Mr Trump waved at the Sky News camera as I shouted a question about Scottish hospitality. It was a different story when I pivoted the topic to Epstein. He hit a shot and sped off. The 20-strong entourage of buggies followed him as he carried on his journey. Some may wonder why all the fuss over a man playing golf? But this is the president, and the kitchen sink has been thrown at the policing operation. Moments before we spotted Mr Trump, army and navy personnel were seen sweeping the grassy banks. Sniffer dogs patrolled the course while snipers watched over in a bid to fend off any intruders. The circus involved the police helicopter hovering overhead and the marine unit bobbing about off the choppy Ayrshire coast. Saturday is for play, and on Sunday it's politics. But, as ever, the Trump show is unpredictable. Saturday will be the first real test of Police Scotland during the visit as it looks to control the demonstrations in Aberdeen and Edinburgh, as well as any that spring up near the president's course. The force has asked for support from others around the UK to bolster officer numbers, with both organisations representing senior officers and the rank-and-file claiming there is likely to be an impact on policing across the country for the duration of the visit. Before the visit started, Mr Swinney appealed to Scots to protest \"peacefully and within the law\". Hundreds of protesters had gathered in both cities by early afternoon, with demonstrators in the centre of Aberdeen seen waving banners with anti-Trump slogans, while one came dressed as the president with a large papier mache head. Some members of the crowd also showed their support for Gaza, waving Palestinian flags. On the golf course, the US president was followed by more than a dozen other buggies. Mr Trump is expected to open a second course at another of his golf resorts in Balmedie in Aberdeenshire while he is in the country."
    },
    {
        "title": "Donald Trump able to enjoy round of golf at Turnberry as protesters speak out from hundreds of miles away",
        "description": "The US president has come to Turnberry to play but it appears as if anti-Trump protesters have not.",
        "url": "https://news.sky.com/story/donald-trump-able-to-enjoy-round-of-golf-at-turnberry-as-protesters-speak-out-from-hundreds-of-miles-away-13402149",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-edinburgh_6974499.jpg?20250726153725",
        "type": "Home",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-07-26 13:54:00",
        "Headline": "While demonstrations have taken place in Edinburgh and Aberdeen in opposition to the US president's Scotland trip, Turnberry remains a ghost town.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n The US president has come to Turnberry to play but it appears as if anti-Trump protesters have not. While demonstrations have taken place in Edinburgh and Aberdeen in opposition to Donald Trump's Scotland trip, the South Ayrshire village remains a ghost town. The security detail has the Trump Turnberry golf resort locked down tight. Uninvited guests may have been deterred by the area's coastal location and lack of amenities, including easily accessible toilet facilities. A stretch of Turnberry Beach next to Mr Trump's golf course is being blocked by Police Scotland, as is the nearby access path. The rest of the sandy shore is open, with prime space for a demonstration, but those looking for a quick route to the water face a treacherous field trip to get there, as one woman unfortunately found out when she got a nasty electric shock from a surrounding live wire fence. The president has been able to enjoy the start of his private visit in relative peace. He's even been out for a round of golf.  Meanwhile, hundreds of demonstrators insisted that Mr Trump is \"not welcome\" in Scotland. Rallies held in both Edinburgh and Aberdeen by the Stop Trump Coalition saw hundreds of protesters gather to voice their opposition to the president. In Edinburgh, almost 100 miles away from Turnberry, protester Rachel told Sky News: \"I don't really have enough time to tell you how many reasons I have for disliking Donald Trump. \"But the big thing in my mind is his climate denialism.\" Rachel, who brought a set of bagpipes to the rally, added: \"I wanted to be here today, and I wanted to bring the pipes because they're a symbol of Scotland and I want to use this symbol of Scotland to say that he's not welcome here.\" Another woman, who was dressed up like a character from The Handmaid's Tale, branded the president a \"convicted felon\". Last year, Mr Trump was convicted by a New York jury of falsifying business records. The protester said: \"We should not be opening Scotland or the UK to somebody with his background. He's an abhorrent human being with absolutely no saving graces.\" In Aberdeen, almost 200 miles away from Turnberry, Scottish Greens MSP Maggie Chapman told the crowd: \"He believes that climate change isn't real, he believes that cutting services for those in the world with the least is the right thing to do. \"We say no to all of those things, not in our name, never in our name.\" 👉 Follow Trump100 on your podcast app 👈 Speaking later, the MSP also branded Mr Trump a \"convicted felon\". She said: \"He is not welcome in Scotland, he is certainly not welcome in Aberdeenshire. We know that he is a convicted felon.\" She added: \"We also know that all of the promises he has repeatedly made to Scotland have come to nothing, there hasn't been the development of jobs or houses that he promised when he opened his course in Aberdeenshire a few years ago.\" During the rally, chants of \"Trump, Trump, Trump, out, out, out\" could be heard, along with \"Donald, Donald, hear us shout, all of Scotland wants you out\".  Earlier on Saturday, First Minister John Swinney announced public money to support a tournament at the Trump International golf links in Aberdeenshire. The 2025 Nexo Championship - previously known as the Scottish Championship - is set to take place there next month, supported by £180,000 of public funding. Mr Swinney, who is expected to meet the president next week, said: \"The Scottish government recognises the importance and benefits of golf and golf events, including boosting tourism and our economy.\" However, Scottish Greens co-leader Patrick Harvie likened the awarding of public cash to the tournament to \"handing some pocket money to the school bully\"."
    },
    {
        "title": "Bob Geldof accuses Israeli authorities of 'lying' about starvation in Gaza",
        "description": "Bob Geldof has accused the Israeli authorities of \"lying\" about starvation in Gaza - after Israel's government spokesperson claimed there was \"no famine caused by Israel\".",
        "url": "https://news.sky.com/story/bob-geldof-accuses-israeli-authorities-of-lying-about-starvation-in-gaza-13402178",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-khan-younis-palestinian_6973145.jpg?20250725072441",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-26 14:33:00",
        "Headline": "Appearing on Sunday Morning with Trevor Phillips, Bob Geldof said 1,000 children or people have died of starvation this month.",
        "Content": " Bob Geldof has accused the Israeli authorities of \"lying\" about starvation in Gaza - after Israel's government spokesperson claimed there was \"no famine caused by Israel\". Earlier this week, David Mencer claimed that Hamas \"starves its own people\" while on The News Hour with Mark Austin, denying that Israel was responsible for mass hunger in Gaza. Appearing on Sunday Morning with Trevor Phillips, Geldof said the claims are false. Follow latest: Gaza aid airdrops a 'smokescreen' and 'distraction'  Sir Trevor asked the Live Aid organiser: \"The Israeli view is that there is no famine caused by Israel, there's a manmade shortage, but it's been engineered by Hamas. \"I guess the Israelis would say we don't see much criticism from your side of Hamas.\" In response, Geldof said \"that's a false equivalence\" and \"the Israeli authorities are lying\". The singer then added: \"They're lying. [Benjamin] Netanyahu lies, is a liar. The IDF are lying. They're dangling food in front of starving, panicked, exhausted mothers. \"And while they arrive to accept the tiny amount of food that this sort of set up pantomime outfit, the Gaza Humanitarian Front, I would call it, as they dangle it, then they're shot wantonly. \"This month, up to now, 1,000 children or 1,000 people have died of starvation. I'm really not interested in what either of these sides are saying.\"  In the Sky News interview earlier this week, Mr Mencer added: \"This suffering exists because Hamas made it so. Here are the facts. Aid is flowing, through the Gaza Humanitarian Foundation. Millions of meals are being delivered directly to civilians.\" He also claimed that, since May, more than 4,400 aid trucks had entered Gaza carrying supplies. It comes after MSF, also known as Doctors Without Borders, warned 25% of young children and pregnant women in Gaza are now malnourished. The charity said Israel's \"deliberate use of starvation as a weapon\" has reached unprecedented levels, and said that at one of its clinics in Gaza City, rates of severe malnutrition in children under five have trebled over the past two weeks. MSF then described the lack of food and water on the ground \"unconscionable\".  In a statement to Sky News, an Israeli security official said that \"despite the false claims that are being spread, the State of Israel does not limit the number of humanitarian aid trucks entering the Gaza Strip\". It then blamed other groups for issues delivering aid. They said: \"Over the past month, we have witnessed a significant decline in the collection of aid from the crossings into the Gaza Strip by international aid organisations. \"The delays in collection by the UN and international organisations harm the situation and the food security of Gaza's residents.\" Read more:What does recognising a Palestinian state mean?Surgeon claims IDF 'deliberately' shooting boys at Gaza aid pointsSecurity shot at Palestinians at Gaza aid centre - ex-guard The IDF also told Sky News: \"The IDF allows the American civilian organisation (GHF) to distribute aid to Gaza residents independently, and operates in proximity to the new distribution zones to enable the distribution alongside the continuation of IDF operational activities in the Gaza Strip. \"Following incidents in which harm to civilians who arrived at distribution facilities was reported, thorough examinations were conducted in the Southern Command and instructions were issued to forces in the field following lessons learned. \"The aforementioned incidents are under review by the competent authorities in the IDF.\" You can watch the full interview on Sunday Morning with Trevor Phillips at 8.30am this morning - and throughout the day on Sky News."
    },
    {
        "title": "There seems no end in sight to asylum hotel protests - as five intense minutes by a roundabout in Norwich proved",
        "description": "It was an unlikely backdrop for a protest - a large roundabout on the outskirts of Norwich.",
        "url": "https://news.sky.com/story/there-seems-no-end-in-sight-to-asylum-hotel-protests-as-five-intense-minutes-by-a-roundabout-in-norwich-proved-13402308",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-norwich-asylum-emma-birchley_6974760.jpg?20250726201922",
        "type": "UK",
        "Author": "Emma Birchley",
        "Date Published": "2025-07-26 18:19:00",
        "Headline": "Witnesses say one of the pro-immigration protesters near the Brook Hotel had approached the much larger group wearing a balaclava - in seconds, the pent-up fury spilt over as an angry crowd surged towards the police.",
        "Content": "\n          News correspondent\n        It was an unlikely backdrop for a protest - a large roundabout on the outskirts of Norwich. But behind the trees flanking one of the carriageways was the reason hundreds had come - another hotel being used to house asylum seekers. Just as towns and cities around the country have seen protests in recent days, most prominently in Epping in Essex where at least 18 arrests have been made, this time the focus was the Brook Hotel. It started peacefully - bar the beeping of horns of passing cars and the chants from protesters on both sides. But in a flash, it all changed. Witnesses say one of the pro-immigration protesters had approached the much larger group wearing a balaclava and in seconds the pent-up fury spilt over as an angry crowd surged towards the police, shouting and swearing. Some tried and failed to hold back the furious crowd urging peace as a small group of police and protesters rolled down a verge, while backup officers emerged from a side road. \n                  Man suffers cardiac arrest onboard boat trying to reach UK \n                 \n                  Epping council demands government 'immediately' close asylum hotel – as Home Office works to 'restore order'\n                 \n                  Epping disorder: Police launch appeal to find two men\n                 But as quickly as it started, it was all over - an intense five minutes that seemed to take the wind out of their anger. Trying to find anyone willing to speak was almost impossible: \"We don't talk to the mainstream media,\" a common phrase. But David Beane, from nearby Costessey, a veteran and the father of an eight-year-old boy, had clear views he wanted to share. \"I know homeless people from the forces. I got out of the force, no dental treatment, I can't get a doctors. They get everything,\" he said. \"I'm all up for immigrants coming, but sign the paperwork. You show who you are, you come in, you abide by our laws.\" It was David's first time at a protest. Another local man attending was Glen. \"They're in there, free rent, free everything,\" he said. Referring to the hotel, he added: \"Do you know they are even getting meal tickets to go in that pub with, and they supply meals in there?\" Read more:Asylum seekers threatened with homelessness if they refuse hotel moveWhat is the UK-France migrant returns deal, who will be returned and how many? There have been protests in nearby Diss too this week. The Park Hotel in the town has now informed the Home Office that it will close altogether if it is ever made to house single men rather than families at the location. Back in Norwich, torrential rain was enough the bring an end to the day's event. Only a few stragglers remained two-and-a-half hours after it had all begun. But it seems likely they will be back. There seems to be no end in sight to the current spate of disruption."
    },
    {
        "title": "Age verification tools on adult websites bypassed in seconds",
        "description": "Ethical hackers have shown Sky News how new age verification systems can be bypassed on pornographic websites in a matter of seconds.",
        "url": "https://news.sky.com/story/hackers-prove-age-verification-systems-on-pornography-sites-can-be-bypassed-in-seconds-13401733",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-age-verification-tools_6974078.jpg?20250726013240",
        "type": "UK",
        "Author": "Mickey Carroll, science and technology reporter and Francesca Casonato, video journalist",
        "Date Published": "2025-07-26 00:26:00",
        "Headline": "Using widely available technology, well-known ethical hackers Chris Kubecka and Paula Popovici quickly accessed numerous pornography sites without ever verifying their ages.",
        "Content": "By Mickey Carroll, science and technology reporter and Francesca Casonato, video journalist   Ethical hackers have shown Sky News how new age verification systems can be bypassed on pornographic websites in a matter of seconds. On Friday, toughened rules came into force that mean companies hosting adult content online must block under-18s using \"highly effective age verification\". That could include AI tools that use pictures to estimate someone's age, bank or ID checks, or more technical solutions using browser cookies. But hours later, two ethical hackers demonstrated just how simple it is to get around the measures designed to protect young people on the internet. Using widely available technology, Chris Kubecka and Paula Popovici quickly accessed numerous pornography sites without ever verifying their ages.  Their devices were running standard software, and the tricks they used were simple. This, Ms Kubecka said, showed the systems will not be effective at stopping under-18s from accessing explicit content online. \n                  What is Tea - the women-only app with millions of users?\n                 \n                  New internet rules enforced from today - but this grieving mother is sceptical they will work\n                 \n                  New internet rules come into force - here's what is changing\n                 The simplicity of their method was confirmed by multiple viewers, who contacted Sky News to say they had also managed to bypass the systems. One viewer said it had taken him \"less than 30 seconds\". Read more:Grieving mother is sceptical new rules will workOfcom rules: Here's what is changing Although Sky News has verified the methods used by Ms Kubecka and Ms Popovici, we won't give details or name any software used. Some of the explicit websites they checked had not turned on any age verification, despite declaring in June that they would. In response to our findings, Ofcom said these checks \"will help stop young children from stumbling across porn\". The regulator added: \"While the new rules have only been in place for a matter of hours, we will be actively assessing compliance to make sure platforms have age checks in place and that they are highly effective. \"Companies that fall short can expect to face enforcement action.\"  A spokesperson for the Department for Science, Innovation and Technology told Sky News: \"We expect these laws to be robustly implemented by tech companies. If they fail to do so, the regulator is ready to take severe enforcement action, including tough fines.\" There is also a risk that age verification could push users towards more dangerous corners of the internet in search of pornography. By 10am on Friday, data suggested an extra 66,000 internet users in the UK had begun using the dark web. Ms Kubecka fears this number may only increase. \"That is one of the concerns that I have because I don't want illegal or extreme content being normalised in our teens,\" she said.  Google Trends data shows searches for online tools to help people bypass age verification have surged, too. Ofcom told Sky News it had been clear that sites \"must not encourage or direct users to get around age checks\". \"People should be aware that children and adults who use [certain software] to bypass age checks will not benefit from the wider protections offered by our online safety rules.\" Despite those warnings, in the days running up to the rules being enforced, advertising data shows companies were targeting UK users and promoting tools that could bypass the verification. \"Platforms have clear legal obligations and must actively prevent children from circumventing safety measures, including blocking content that promotes ... workarounds targeting young users.\""
    },
    {
        "title": "England's captain Leah Williamson says Lionesses are 'connected to what it means for nation' ahead of Women's Euros final",
        "description": "Leah Williamson has said England are \"aware\" and \"connected\" to what it would mean for the nation if they were to beat Spain in Sunday's Women's Euros final. ",
        "url": "https://news.sky.com/story/englands-captain-leah-williamson-says-lionesses-are-connected-to-what-it-means-for-nation-ahead-of-womens-euros-final-13402183",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-leah-williamson-euros_6974923.jpg?20250727033424",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-26 14:43:00",
        "Headline": "England play Spain on Sunday looking to avenge their 1-0 loss they suffered in the 2023 World Cup final. ",
        "Content": " Leah Williamson has said England are \"aware\" and \"connected\" to what it would mean for the nation if they were to beat Spain in Sunday's Women's Euros final.  The Lionesses have led a charmed life in the knockout stages of the tournament they won at Wembley four years ago. England captain Williamson was asked by Sky News' Rob Harris at a news conference what it would mean to have the chance to lift a trophy again, and if she could grasp what it would mean for the nation. \"I think we are connected to what it means to the nation, as connected as we can be being away from home,\" she said. \"The opportunity of tomorrow and what's on offer is the best thing in football. \"We came to the tournament and wanted to be in it until the end, and have a chance to fight for that trophy. \"I think we don't necessarily carry the weight of it [the expectations] and how much it means to people, but we are aware of it because it means the same to us. \"We recognise the opportunity and will do everything we can to take it.\" \n                  Women's Euros final: The Lionesses face Spain tonight - and they're seeking revenge \n                 \n                  Man suffers cardiac arrest onboard boat trying to reach UK \n                 \n                  Unlicensed Botox-like injections spark outbreak of disease many doctors have never treated\n                 Read more from Sky News:Sarina Wiegman on the Euros finalFrom ball girl to teenage super-sub: Who is England's Michelle Agyemang?  England needed two late goals to stay in the quarter-final against Sweden before winning in a penalty shootout. They looked to be out in the semi-final against Italy before Michelle Agyemang equalised deep in added time, and Chloe Kelly scored a 119th-minute winner with another shootout imminent.  Having needed some good fortune to reach the final, the Lionesses now face the Spain team that beat them 1-0 in the World Cup final in Sydney in 2023. And while Williamson acknowledged that their opponents are \"the best at what they do\", she doesn't believe that England are the underdogs going into Sunday's battle.  \"We need to be at our best to beat Spain,\" she said. \"I think they need to be at their best to beat us too. \"I don't think there's a clear underdog in this but we go in against the world champions tomorrow and that's not an easy job. We'll prepare as best we can for that challenge.\" England boss Sarina Wiegman said her side would \"do everything\" to win in Basel. She also admitted to feeling nerves on the sidelines in big moments, despite maintaining a steely demeanour. \"I'm having a heart attack too, I just don't show it,\" she said. \"We want to be best prepared. We try to prepare on what can happen in the game and what we need. That is how the squad is built. \"We figured out what we need if we need to change things. We have spoken through all the scenarios but during the game, it's what you think is necessary. When we want to change, we can do it.\" She also revealed that forward Lauren James would be available, despite having been forced off at half-time of the Lionesses' extra-time semi-final comeback. \"We had 23 players on the pitch today and everyone came through, so if everyone recovers well then we have 23 players available for tomorrow,\" Wiegman said. \"I think we have many players that can impact, and we know that [James] can have an impact too, so that will be nice.\" The Prince of Wales has wished the Lionesses good luck as they aim for back-to-back European titles. William, patron of the FA, will be in Basel, Switzerland, to cheer the team on Sunday. He said: \"Good luck to the Lionesses tomorrow. \"The nation is so proud you are through to the final, after some stunning comebacks! We are all cheering you on! W.\""
    },
    {
        "title": "Huge security operation as Donald Trump tees off at his Scottish golf course",
        "description": "Donald Trump has been spotted on his golf course in Scotland, with a massive security operation keeping both media and locals at a distance.",
        "url": "https://news.sky.com/story/huge-security-operation-as-donald-trump-tees-off-at-his-scottish-golf-course-13402055",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-golf-turnberry-scotland_6974238.jpg?20250726112759",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-26 10:30:00",
        "Headline": "Roads were closed and police and army personnel searched the golf course before the US president teed off on Saturday, the first full day of his UK visit.",
        "Content": " Donald Trump has been spotted on his golf course in Scotland, with a massive security operation keeping both media and locals at a distance. Roads were closed around the Turnberry course as a large number of police and army, and navy personnel were seen searching the grounds before the US president teed off on Saturday, the first full day of his UK visit. Sniffer dogs patrolled the course, snipers were deployed, a police helicopter hovered overhead and a boat sat off the coast. His first round of golf came hours after an attack on Europe, in which the US president told Europe to \"get your act together\" on immigration, which he said was \"killing\" the continent. But he had words of praise for Sir Keir Starmer after touching down in Ayrshire on Friday, describing him as a \"good man\" while adding he is \"slightly more liberal than I am\". Mr Trump is due to have talks with Sir Keir and Scottish First Minister John Swinney, as well as discussing trade with European Commission President Ursula von der Leyen. The president headed straight to the resort, which he bought in 2014 and which he wants to see host The Open, after landing. Scotland correspondent We heard him before we saw him. It was the surreal moment Donald Trump trundled over the Turnberry course with music blaring from his golf buggy. The songs of choice were even more interesting given the crisis facing the US president amid the Jeffrey Epstein saga. Bridge Over Troubled Water by Simon and Garfunkel was the hit swirling around as the wind projected the music beyond a wall of police that had formed to protect the president. It was an eyebrow-raising moment to say the least. Mr Trump waved at the Sky News camera as I shouted a question about Scottish hospitality. It was a different story when I pivoted the topic to Epstein. He hit a shot and sped off. The 20-strong entourage of buggies followed him as he carried on his journey. Some may wonder why all the fuss over a man playing golf? But this is the president, and the kitchen sink has been thrown at the policing operation. Moments before we spotted Mr Trump, army and navy personnel were seen sweeping the grassy banks. Sniffer dogs patrolled the course while snipers watched over in a bid to fend off any intruders. The circus involved the police helicopter hovering overhead and the marine unit bobbing about off the choppy Ayrshire coast. Saturday is for play, and on Sunday it's politics. But, as ever, the Trump show is unpredictable. Saturday will be the first real test of Police Scotland during the visit as it looks to control the demonstrations in Aberdeen and Edinburgh, as well as any that spring up near the president's course. The force has asked for support from others around the UK to bolster officer numbers, with both organisations representing senior officers and the rank-and-file claiming there is likely to be an impact on policing across the country for the duration of the visit. Before the visit started, Mr Swinney appealed to Scots to protest \"peacefully and within the law\". Hundreds of protesters had gathered in both cities by early afternoon, with demonstrators in the centre of Aberdeen seen waving banners with anti-Trump slogans, while one came dressed as the president with a large papier mache head. Some members of the crowd also showed their support for Gaza, waving Palestinian flags. On the golf course, the US president was followed by more than a dozen other buggies. Mr Trump is expected to open a second course at another of his golf resorts in Balmedie in Aberdeenshire while he is in the country."
    },
    {
        "title": "Donald Trump able to enjoy round of golf at Turnberry as protesters speak out from hundreds of miles away",
        "description": "The US president has come to Turnberry to play but it appears as if anti-Trump protesters have not.",
        "url": "https://news.sky.com/story/donald-trump-able-to-enjoy-round-of-golf-at-turnberry-as-protesters-speak-out-from-hundreds-of-miles-away-13402149",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-edinburgh_6974499.jpg?20250726153725",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-07-26 13:54:00",
        "Headline": "While demonstrations have taken place in Edinburgh and Aberdeen in opposition to the US president's Scotland trip, Turnberry remains a ghost town.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n The US president has come to Turnberry to play but it appears as if anti-Trump protesters have not. While demonstrations have taken place in Edinburgh and Aberdeen in opposition to Donald Trump's Scotland trip, the South Ayrshire village remains a ghost town. The security detail has the Trump Turnberry golf resort locked down tight. Uninvited guests may have been deterred by the area's coastal location and lack of amenities, including easily accessible toilet facilities. A stretch of Turnberry Beach next to Mr Trump's golf course is being blocked by Police Scotland, as is the nearby access path. The rest of the sandy shore is open, with prime space for a demonstration, but those looking for a quick route to the water face a treacherous field trip to get there, as one woman unfortunately found out when she got a nasty electric shock from a surrounding live wire fence. The president has been able to enjoy the start of his private visit in relative peace. He's even been out for a round of golf.  Meanwhile, hundreds of demonstrators insisted that Mr Trump is \"not welcome\" in Scotland. Rallies held in both Edinburgh and Aberdeen by the Stop Trump Coalition saw hundreds of protesters gather to voice their opposition to the president. In Edinburgh, almost 100 miles away from Turnberry, protester Rachel told Sky News: \"I don't really have enough time to tell you how many reasons I have for disliking Donald Trump. \"But the big thing in my mind is his climate denialism.\" Rachel, who brought a set of bagpipes to the rally, added: \"I wanted to be here today, and I wanted to bring the pipes because they're a symbol of Scotland and I want to use this symbol of Scotland to say that he's not welcome here.\" Another woman, who was dressed up like a character from The Handmaid's Tale, branded the president a \"convicted felon\". Last year, Mr Trump was convicted by a New York jury of falsifying business records. The protester said: \"We should not be opening Scotland or the UK to somebody with his background. He's an abhorrent human being with absolutely no saving graces.\" In Aberdeen, almost 200 miles away from Turnberry, Scottish Greens MSP Maggie Chapman told the crowd: \"He believes that climate change isn't real, he believes that cutting services for those in the world with the least is the right thing to do. \"We say no to all of those things, not in our name, never in our name.\" 👉 Follow Trump100 on your podcast app 👈 Speaking later, the MSP also branded Mr Trump a \"convicted felon\". She said: \"He is not welcome in Scotland, he is certainly not welcome in Aberdeenshire. We know that he is a convicted felon.\" She added: \"We also know that all of the promises he has repeatedly made to Scotland have come to nothing, there hasn't been the development of jobs or houses that he promised when he opened his course in Aberdeenshire a few years ago.\" During the rally, chants of \"Trump, Trump, Trump, out, out, out\" could be heard, along with \"Donald, Donald, hear us shout, all of Scotland wants you out\".  Earlier on Saturday, First Minister John Swinney announced public money to support a tournament at the Trump International golf links in Aberdeenshire. The 2025 Nexo Championship - previously known as the Scottish Championship - is set to take place there next month, supported by £180,000 of public funding. Mr Swinney, who is expected to meet the president next week, said: \"The Scottish government recognises the importance and benefits of golf and golf events, including boosting tourism and our economy.\" However, Scottish Greens co-leader Patrick Harvie likened the awarding of public cash to the tournament to \"handing some pocket money to the school bully\"."
    },
    {
        "title": "Israel resumes airdrops into Gaza - as baby girl dies weighing less than when she was born",
        "description": "Israel has resumed airdrops of aid into Gaza, as reports and condemnation of starvation and famine continue to spread.",
        "url": "https://news.sky.com/story/israel-resumes-airdrops-into-gaza-as-baby-girl-dies-weighing-less-than-when-she-was-born-13402351",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestinians-israel_6974842.jpg?20250726224543",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-26 23:26:00",
        "Headline": "The Hamas-run health ministry in Gaza says 127 people have died from malnutrition-related causes, including 85 children.",
        "Content": " Israel has resumed airdrops of aid into Gaza, as reports and condemnation of starvation and famine continue to spread. In a statement, the Israel Defence Forces added that humanitarian corridors would also be established for United Nations convoys to deliver aid into the region, though it did not say when or where. While the IDF \"emphasises that combat operations have not ceased\" - and reiterated claims there is \"no starvation\" in Gaza - it said: \"The airdrops will include seven pallets of aid containing flour, sugar and canned food to be provided by international organisations.\"  The military added that it is prepared to implement \"humanitarian pauses\" in densely populated areas. Reports suggest aid has already been dropped into Gaza, with some injured after fighting broke out. In other developments, Bob Geldof has accused Israeli authorities of \"lying\" about starvation in the territory - telling Sunday Morning With Trevor Phillips that the IDF is \"dangling food in front of starving, panicked, exhausted mothers\". He told Sky News: \"This month, up to now, 1,000 children or 1,000 people have died of starvation. I'm really not interested in what either of these sides are saying.\" \n                  Bob Geldof accuses Israeli authorities of 'lying' about starvation in Gaza\n                 \n                  Scottish Labour MSPs heap pressure on Starmer to recognise Palestinian state\n                 \n                  25% of young children and pregnant women malnourished in Gaza, charity says, as PM vows to fly critical medical cases to UK \n                  Israel cut off all supplies to Gaza from the start of March. It then reopened it with new restrictions in May, but said the supply had to be controlled to prevent it from being stolen by Hamas militants. On Saturday, reports referencing US government data said that there was no evidence Hamas had stolen aid from UN agencies. The IDF's international spokesperson, Lieutenant Colonel Nadav Shoshani, described such reports as \"fake news\" and said Hamas thefts have been \"well documented\".  Airdrops 'expensive and inefficient' It comes as the Hamas-run health ministry in Gaza said that, as of Saturday, 127 people have died from malnutrition-related causes, including 85 children. They include a five-month-old girl who weighed less than when she was born, with a doctor at Nasser Hospital describing it as a case of \"severe, severe starvation\". Health workers have also been weakened by hunger, with some putting themselves on IV drips so they can keep treating badly malnourished patients.  On Friday, Israel said it would allow foreign countries to airdrop aid into Gaza - but the UN Relief and Works Agency has warned this will not reverse \"deepening starvation\". UNRWA head Philippe Lazzarini described the method as \"expensive\" and \"inefficient\", adding: \"It is a distraction and screensmoke. A manmade hunger can only be addressed by political will. \"Lift the siege, open the gates and guarantee safe movements and dignified access to people in need.\" He added that UNRWA has the equivalent of 6,000 trucks in Jordan and Egypt waiting for permission to enter Gaza.  MSF, also known as Doctors Without Borders, warned on Friday that 25% of young children and pregnant women in Gaza are now malnourished, and said the lack of food and water on the ground was \"unconscionable\". The UN also estimates that Israeli forces have killed more than 1,000 people seeking food - the majority near the militarised distribution sites of the US-backed aid distribution scheme run by the Gaza Humanitarian Foundation. Read more:What does recognising a Palestinian state mean?British surgeon claims IDF 'deliberately' shooting boys In a statement on Friday, the IDF had said it \"categorically rejects the claims of intentional harm to civilians\", and reports of incidents at aid distribution sites were \"under examination\". The GHF has also previously disputed that these deaths were connected with its organisation's operations, with director Johnnie Moore telling Sky News: \"We just want to feed Gazans. That's the only thing that we want to do.\""
    },
    {
        "title": "Bob Geldof accuses Israeli authorities of 'lying' about starvation in Gaza",
        "description": "Bob Geldof has accused the Israeli authorities of \"lying\" about starvation in Gaza - after Israel's government spokesperson claimed there was \"no famine caused by Israel\".",
        "url": "https://news.sky.com/story/bob-geldof-accuses-israeli-authorities-of-lying-about-starvation-in-gaza-13402178",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-khan-younis-palestinian_6973145.jpg?20250725072441",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-26 14:33:00",
        "Headline": "Appearing on Sunday Morning with Trevor Phillips, Bob Geldof said 1,000 children or people have died of starvation this month.",
        "Content": " Bob Geldof has accused the Israeli authorities of \"lying\" about starvation in Gaza - after Israel's government spokesperson claimed there was \"no famine caused by Israel\". Earlier this week, David Mencer claimed that Hamas \"starves its own people\" while on The News Hour with Mark Austin, denying that Israel was responsible for mass hunger in Gaza. Appearing on Sunday Morning with Trevor Phillips, Geldof said the claims are false. Follow latest: Gaza aid airdrops a 'smokescreen' and 'distraction'  Sir Trevor asked the Live Aid organiser: \"The Israeli view is that there is no famine caused by Israel, there's a manmade shortage, but it's been engineered by Hamas. \"I guess the Israelis would say we don't see much criticism from your side of Hamas.\" In response, Geldof said \"that's a false equivalence\" and \"the Israeli authorities are lying\". The singer then added: \"They're lying. [Benjamin] Netanyahu lies, is a liar. The IDF are lying. They're dangling food in front of starving, panicked, exhausted mothers. \"And while they arrive to accept the tiny amount of food that this sort of set up pantomime outfit, the Gaza Humanitarian Front, I would call it, as they dangle it, then they're shot wantonly. \"This month, up to now, 1,000 children or 1,000 people have died of starvation. I'm really not interested in what either of these sides are saying.\"  In the Sky News interview earlier this week, Mr Mencer added: \"This suffering exists because Hamas made it so. Here are the facts. Aid is flowing, through the Gaza Humanitarian Foundation. Millions of meals are being delivered directly to civilians.\" He also claimed that, since May, more than 4,400 aid trucks had entered Gaza carrying supplies. It comes after MSF, also known as Doctors Without Borders, warned 25% of young children and pregnant women in Gaza are now malnourished. The charity said Israel's \"deliberate use of starvation as a weapon\" has reached unprecedented levels, and said that at one of its clinics in Gaza City, rates of severe malnutrition in children under five have trebled over the past two weeks. MSF then described the lack of food and water on the ground \"unconscionable\".  In a statement to Sky News, an Israeli security official said that \"despite the false claims that are being spread, the State of Israel does not limit the number of humanitarian aid trucks entering the Gaza Strip\". It then blamed other groups for issues delivering aid. They said: \"Over the past month, we have witnessed a significant decline in the collection of aid from the crossings into the Gaza Strip by international aid organisations. \"The delays in collection by the UN and international organisations harm the situation and the food security of Gaza's residents.\" Read more:What does recognising a Palestinian state mean?Surgeon claims IDF 'deliberately' shooting boys at Gaza aid pointsSecurity shot at Palestinians at Gaza aid centre - ex-guard The IDF also told Sky News: \"The IDF allows the American civilian organisation (GHF) to distribute aid to Gaza residents independently, and operates in proximity to the new distribution zones to enable the distribution alongside the continuation of IDF operational activities in the Gaza Strip. \"Following incidents in which harm to civilians who arrived at distribution facilities was reported, thorough examinations were conducted in the Southern Command and instructions were issued to forces in the field following lessons learned. \"The aforementioned incidents are under review by the competent authorities in the IDF.\" You can watch the full interview on Sunday Morning with Trevor Phillips at 8.30am this morning - and throughout the day on Sky News."
    },
    {
        "title": "25% of young children and pregnant women malnourished in Gaza, charity says, as PM vows to fly critical medical cases to UK ",
        "description": "A charity has warned 25% of young children and pregnant women in Gaza are now malnourished, with Sir Keir Starmer vowing to evacuate children who need \"critical medical assistance\" to the UK.",
        "url": "https://news.sky.com/story/25-of-young-children-and-pregnant-women-malnourished-in-gaza-charity-says-as-pm-vows-to-fly-critical-medical-cases-to-uk-13401950",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-nasser_6974083.jpg?20250726033037",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-26 02:34:00",
        "Headline": "\"Those who go to the Gaza Humanitarian Foundation's food distributions know that they have the same chance of receiving a sack of flour as they do of leaving with a bullet in their head,\" Doctors Without Borders claims.",
        "Content": " A charity has warned 25% of young children and pregnant women in Gaza are now malnourished, with Sir Keir Starmer vowing to evacuate children who need \"critical medical assistance\" to the UK. MSF, also known as Doctors Without Borders, said Israel's \"deliberate use of starvation as a weapon\" has reached unprecedented levels - with patients and healthcare workers both fighting to survive. It claimed that, at one of its clinics in Gaza City, rates of severe malnutrition in children under five have trebled over the past two weeks - and described the lack of food and water on the ground as \"unconscionable\". The charity also criticised the high number of fatalities seen at aid distribution sites, with one British surgeon accusing IDF soldiers of shooting civilians \"almost like a game of target practice\". MSF's deputy medical coordinator in Gaza, Dr Mohammed Abu Mughaisib, said: \"Those who go to the Gaza Humanitarian Foundation's food distributions know that they have the same chance of receiving a sack of flour as they do of leaving with a bullet in their head.\" The UN also estimates that Israeli forces have killed more than 1,000 people seeking food - the majority near the militarised distribution sites of the US-backed aid distribution scheme run by the GHF.  In a statement on Friday, the IDF had said it \"categorically rejects the claims of intentional harm to civilians\", and reports of incidents at aid distribution sites were \"under examination\". The GHF has also previously disputed that these deaths were connected with its organisation's operations, with director Johnnie Moore telling Sky News: \"We just want to feed Gazans. That's the only thing that we want to do.\" Israel says it has let enough food into Gaza and has accused the UN of failing to distribute it, in what the foreign ministry has labelled as \"a deliberate ploy\" to defame the country. 'Humanitarian catastrophe must end' In a video message posted on X late last night, Sir Keir Starmer condemned the scenes in Gaza as \"appalling\" and \"unrelenting\" - and said \"the images of starvation and desperation are utterly horrifying\". The prime minister added: \"The denial of aid to children and babies is completely unjustifiable, just as the continued captivity of hostages is completely unjustifiable. \"Hundreds of civilians have been killed while seeking aid - children, killed, whilst collecting water. It is a humanitarian catastrophe, and it must end.\"  Sir Keir confirmed that the British government is now \"accelerating efforts\" to evacuate children from Gaza who need critical medical assistance, so they can be brought to the UK for specialist treatment. Israel has now said that foreign countries will be able to airdrop aid into Gaza. While the PM says the UK will now \"do everything we can\" to get supplies in via this route, he said this decision has come \"far too late\". Read more:WHO: Gaza faces 'manmade' starvationUN: People in Gaza 'walking corpses' Last year, the RAF dropped aid into Gaza, but humanitarian organisations warned it wasn't enough and was potentially dangerous. In March 2024, five people were killed when an aid parachute failed and supplies fell on them. For now, Sir Keir has rejected calls to follow French President Emmanuel Macron and recognise a Palestinian state - despite more than 220 MPs signing a cross-party letter to demand he takes this step. The prime minister is instead demanding a ceasefire and \"lasting peace\" - and says he will only consider an independent state as part of a negotiated peace deal."
    },
    {
        "title": "Five killed after Russia and Ukraine trade aerial bombardments",
        "description": "At least five people have been killed after Russia and Ukraine traded aerial bombardments overnight, officials have said.",
        "url": "https://news.sky.com/story/five-killed-after-russia-and-ukraine-trade-aerial-bombardments-13402113",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ukraine-dnipro_6974450.jpg?20250726144310",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-26 12:39:00",
        "Headline": "Russia targeted Ukraine with 208 drones and 27 missiles overnight, officials said. Russia's Defence Ministry said its air defences shot down or intercepted a total of 54 Ukrainian drones.",
        "Content": "At least five people have been killed after Russia and Ukraine traded aerial bombardments overnight, officials have said. In Ukraine, the southern region of Dnipro and the northeastern region of Sumy were attacked by rockets and drones. The head of the Dnipro regional administration, Serhii Lysak, said at least three people had died and at least five were injured. In the city of Dnipro, a multi-storey building and businesses were damaged in the strike, and a fire engulfed a shopping centre in the region. The military administration in Sumy said three people were injured. Over three hours, Ukraine's second-largest city, Kharkiv, was hit by four guided aerial bombs, two ballistic missiles and 15 drones. In a Telegram post, its mayor, Ihor Terekhov, said high-rise residential buildings, local businesses, roads and the communication network were damaged. He said at least five people were injured, including three rescue workers hit in a double tap strike, where a second attack targets emergency workers trying to help those wounded in the initial attack. In total, Russia targeted Ukraine with 208 drones and 27 missiles overnight, according to the daily air force report. It said air defence and electronic warfare took down or intercepted 183 drones and 17 missiles, but hits from 10 missiles and 25 drones had been recorded in nine locations, according to preliminary data. Read more:25% of young children now malnourished in Gaza, charity saysHuge security operation as Trump tees off at his golf course Officials in Russia said Ukrainian drones targeted several regions overnight, with a drone attack on the border region of Rostov killing two people, according to acting governor Yuri Slyusar. In the neighbouring Stavropol region, drones hit an industrial facility, governor Vladimir Vladimirov said on Telegram. The attack sparked a brief fire, he added. Drones also targeted Moscow but were shot down, according to mayor Sergei Sobyanin. They also targeted an industrial facility in the Penza region southeast of the capital, governor Oleg Melnichenko said. Russia's Defence Ministry said its air defences shot down or intercepted a total of 54 Ukrainian drones."
    },
    {
        "title": "Plane plunges 300ft in 36 seconds to avoid another aircraft",
        "description": "A US passenger plane made a dramatic plunge minutes after take-off to dodge another aircraft - injuring two cabin crew and causing passengers to shoot out of their seats.",
        "url": "https://news.sky.com/story/plane-plunges-300ft-in-36-seconds-to-avoid-other-aircraft-13401958",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-southwest-near-miss_6974084.jpg?20250726043058",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-26 03:26:00",
        "Headline": "Concerns have been raised about aviation safety in the US following a series of recent incidents. In January, a mid-air collision in Washington DC killed 67 people.",
        "Content": "A US passenger plane made a dramatic plunge minutes after take-off to dodge another aircraft - injuring two cabin crew and causing passengers to shoot out of their seats. The Southwest flight had just taken off from Burbank in California when the pilot received an alert about a nearby plane. Data from FlightAware shows the aircraft dropped by 91m (300ft) in just 36 seconds. Those on board said they felt panicked, and some feared the plane was about to crash. Comedian Jimmy Dore posted on X: \"Pilot had to dive aggressively to avoid mid-air collision … myself and plenty of people flew out of their seats and bumped heads on ceiling, a flight attendant needed medical attention.\" Stef Zambrano saw a woman who wasn't wearing her seatbelt thrown out of her seat, who then said: \"I want to get off this plane. I want to be on the ground.\" Another passenger, Steve Ulasewicz, told NBC Los Angeles that it felt like the plane was in freefall for 10 seconds. \"People were screaming. You know, it was pandemonium. People thought the plane was going down,\" he added. \n                  Michigan: 11 people stabbed in US supermarket - with six in critical condition\n                 \n                  Snipers, Secret Service sweeps and a personal chef on standby: Scotland awaits Trump's arrival\n                 \n                  Ghislaine Maxwell answered justice department questions 'about 100 different people', her lawyer says\n                 The aircraft was able to continue to its destination of Las Vegas, where it safely landed without any further incident. It is believed the Boeing 737 was in the same vicinity as a Hawker Hunter Mk. 58, a British fighter jet. Southwest is now working with the Federal Aviation Administration \"to further understand the circumstances\" of the event. Read more US news:Trump issues warning as he arrives in ScotlandUS justice department interviews Ghislaine Maxwell  This is the second time in a week that a passenger plane has had to make abrupt flight manoeuvres to avoid a potential mid-air collision. Concerns have been raised about aviation safety in the US following a series of recent incidents. In January, a mid-air collision in Washington DC killed 67 people."
    },
    {
        "title": "Dozens killed and tens of thousands flee as border fighting between Thailand and Cambodia escalates",
        "description": "At least 33 people have been killed and more than 168,000 forced to flee their homes in Thailand and Cambodia - as Donald Trump says both countries have agreed to immediate ceasefire talks.",
        "url": "https://news.sky.com/story/dozens-killed-and-tens-of-thousands-flee-as-border-fighting-between-thailand-and-cambodia-escalates-13402002",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-cambodia-thailand_6974141.jpg?20250726092205",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-26 07:27:00",
        "Headline": "The UN has called for a peaceful solution to the latest flare-up in the long-running border conflict between the two nations.",
        "Content": " At least 33 people have been killed and more than 168,000 forced to flee their homes in Thailand and Cambodia - as Donald Trump says both countries have agreed to immediate ceasefire talks. Cambodian authorities reported 12 new deaths on Saturday, bringing its toll to 13, while Thai officials said a soldier was killed, raising the number of deaths to 20 - mostly civilians. New flashpoints emerged on Saturday more than 100 km (60 miles) from other conflict points along the long-contested border. There were clashes in the early morning in the neighbouring Thai coastal province of Trat and Cambodia's Pursat Province, both sides said. Later on Saturday, the US president said that the leaders of both countries had agreed to meet for immediate talks on ending the three-day-long conflict. Posting on Truth Social while on a state visit to the UK, Mr Trump said he had spoken to Cambodian Prime Minister Hun Manet and Thailand's acting prime minister Phumtham Wechayachai on ending fighting. He also threatened to suspend trade agreement talks, and said: \"They are also looking to get back to the 'Trading Table' with the United States, which we think is inappropriate to do until such time as the fighting STOPS.\" In a post on Facebook, Mr Wechayachai thanked Mr Trump and said Thailand \"agrees in principle to have a ceasefire in place\" - but added that he \"would like to see sincere intention from the Cambodian side\". Read more:Why have tensions escalated?Clashes before, but this time feels different - analysis Mr Trump's intervention came after the UN Security Council unanimously called on both sides to show restraint and resolve the dispute peacefully on Friday evening, a council diplomat speaking on condition of anonymity said. Cambodia's defence ministry said earlier that Thailand had launched \"a deliberate, unprovoked, and unlawful military attack\" but Mr Wechayachai said Bangkok had exercised the \"utmost restraint and patience in the face of [Phnom Penh's] provocations and aggression\". Cambodia's information minister Neth Pheaktra said on Saturday that the clashes had forced 10,865 Cambodian families - 37,635 people - in three border provinces to evacuate, while Thai officials said more than 131,000 people had fled their border villages. Villages around Cambodia's Oddar Meanchey province were largely deserted, as people loaded their belongings on homemade tractors or sheltered in makeshift underground bunkers, covering them with wood, tarpaulin and zinc sheets to shield themselves from shelling. Several hundred residents went to a remote Buddhist temple where plastic tents were set up under the trees.  There have been frequent flare-ups along the 500-mile (800 km) frontier the two nations share, and 20 people died in the last serious clashes in 2011. Tensions rose again in May when a Cambodian soldier was killed in a skirmish and escalated further when a land mine wounded five Thai soldiers on Wednesday. The situation grew into a full-blown diplomatic crisis as Bangkok closed the border and expelled the Cambodian ambassador. Both sides reinforced their troops on the border, and clashes broke out the following day. On Friday, the Thai military reported clashes in multiple areas along the border, including near the ancient Ta Muen Thom temple claimed by both sides."
    },
    {
        "title": "Plane plunges 300ft in 36 seconds to avoid another aircraft",
        "description": "A US passenger plane made a dramatic plunge minutes after take-off to dodge another aircraft - injuring two cabin crew and causing passengers to shoot out of their seats.",
        "url": "https://news.sky.com/story/plane-plunges-300ft-in-36-seconds-to-avoid-other-aircraft-13401958",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-southwest-near-miss_6974084.jpg?20250726043058",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-26 03:26:00",
        "Headline": "Concerns have been raised about aviation safety in the US following a series of recent incidents. In January, a mid-air collision in Washington DC killed 67 people.",
        "Content": "A US passenger plane made a dramatic plunge minutes after take-off to dodge another aircraft - injuring two cabin crew and causing passengers to shoot out of their seats. The Southwest flight had just taken off from Burbank in California when the pilot received an alert about a nearby plane. Data from FlightAware shows the aircraft dropped by 91m (300ft) in just 36 seconds. Those on board said they felt panicked, and some feared the plane was about to crash. Comedian Jimmy Dore posted on X: \"Pilot had to dive aggressively to avoid mid-air collision … myself and plenty of people flew out of their seats and bumped heads on ceiling, a flight attendant needed medical attention.\" Stef Zambrano saw a woman who wasn't wearing her seatbelt thrown out of her seat, who then said: \"I want to get off this plane. I want to be on the ground.\" Another passenger, Steve Ulasewicz, told NBC Los Angeles that it felt like the plane was in freefall for 10 seconds. \"People were screaming. You know, it was pandemonium. People thought the plane was going down,\" he added. \n                  Michigan: 11 people stabbed in US supermarket - with six in critical condition\n                 \n                  Snipers, Secret Service sweeps and a personal chef on standby: Scotland awaits Trump's arrival\n                 \n                  Ghislaine Maxwell answered justice department questions 'about 100 different people', her lawyer says\n                 The aircraft was able to continue to its destination of Las Vegas, where it safely landed without any further incident. It is believed the Boeing 737 was in the same vicinity as a Hawker Hunter Mk. 58, a British fighter jet. Southwest is now working with the Federal Aviation Administration \"to further understand the circumstances\" of the event. Read more US news:Trump issues warning as he arrives in ScotlandUS justice department interviews Ghislaine Maxwell  This is the second time in a week that a passenger plane has had to make abrupt flight manoeuvres to avoid a potential mid-air collision. Concerns have been raised about aviation safety in the US following a series of recent incidents. In January, a mid-air collision in Washington DC killed 67 people."
    },
    {
        "title": "Company at heart of Coldplay viral video releases tongue-in-cheek clip - with a big twist ",
        "description": "The company at the centre of a viral video at a Coldplay concert has released a tongue-in-cheek clip on social media - featuring Gwyneth Paltrow as a \"temporary spokesperson\".",
        "url": "https://news.sky.com/story/company-at-heart-of-coldplay-viral-video-releases-tongue-in-cheek-clip-with-a-big-twist-13401966",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-coldplay-andy-byron_6968322.jpg?20250719094855",
        "type": "US",
        "Author": "Connor Sephton",
        "Date Published": "2025-07-26 04:10:00",
        "Headline": "Gwyneth Paltrow, who used to be married to Coldplay frontman Chris Martin, stars as a \"very temporary spokesperson\" in the newly released video.",
        "Content": "\n          News reporter\n              @ConnorSephton\n  The company at the centre of a viral video at a Coldplay concert has released a tongue-in-cheek clip on social media - featuring Gwyneth Paltrow as a \"temporary spokesperson\". Astronomer was thrust into the spotlight after two of the tech firm's senior executives were filmed embracing on a kiss cam during a gig in Boston. Andy Byron subsequently resigned as chief executive officer - while the woman in the video, Kristin Cabot, stepped down as chief people officer a few days later.  Paltrow, who used to be married to Coldplay frontman Chris Martin, is seen sitting at a desk in the new video uploaded to X - and begins by thanking the public for their interest in Astronomer. She adds: \"I've been hired on a very temporary basis to speak on behalf of the 300-plus employees at Astronomer. \"Astronomer has gotten a lot of questions over the last few days - and they wanted me to answer the most common ones.\" A question is then typed out on the screen that reads: \"OMG, what the actual…\" \n                  Gregg Wallace speaks out after MasterChef sacking\n                 \n                  Top Boy actor Micheal Ward charged with two counts of rape\n                 \n                  Grammy-winning jazz singer Dame Cleo Laine dies\n                 Before the final word appears, the video cuts back to Paltrow, who goes on to promote some of the services Astronomer offers. In a subtle nod to the countless column inches the company has attracted, Paltrow adds: \"We've been thrilled so many people have a newfound interest in data workflow automation.\" Another question then pops up on screen, which begins to type out: \"How is your social media team holding up?\" But before the sentence fully appears, Paltrow abruptly interrupts by declaring that Astronomer has spaces at an upcoming conference in September. \"We'll now be returning to what we do best: delivering game-changing results for our customers,\" she adds at the end of the video. The marketing stunt is a sign that Astronomer is trying to put a positive spin on the scandal, which sparked feverish speculation online. After Mr Byron resigned, the company had said in a statement: \"Astronomer is committed to the values and culture that have guided us since our founding. \"Our leaders are expected to set the standard in both conduct and accountability, and recently, that standard was not met.\" Pete DeJoy, who has taken over as interim CEO, admitted on Monday that the company has faced an \"unusual and surreal\" amount of attention in recent days. On LinkedIn, he wrote: \"While I would never have wished for it to happen like this, Astronomer is now a household name.\""
    },
    {
        "title": "Huge security operation as Donald Trump tees off at his Scottish golf course",
        "description": "Donald Trump has been spotted on his golf course in Scotland, with a massive security operation keeping both media and locals at a distance.",
        "url": "https://news.sky.com/story/huge-security-operation-as-donald-trump-tees-off-at-his-scottish-golf-course-13402055",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-golf-turnberry-scotland_6974238.jpg?20250726112759",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-26 10:30:00",
        "Headline": "Roads were closed and police and army personnel searched the golf course before the US president teed off on Saturday, the first full day of his UK visit.",
        "Content": " Donald Trump has been spotted on his golf course in Scotland, with a massive security operation keeping both media and locals at a distance. Roads were closed around the Turnberry course as a large number of police and army, and navy personnel were seen searching the grounds before the US president teed off on Saturday, the first full day of his UK visit. Sniffer dogs patrolled the course, snipers were deployed, a police helicopter hovered overhead and a boat sat off the coast. His first round of golf came hours after an attack on Europe, in which the US president told Europe to \"get your act together\" on immigration, which he said was \"killing\" the continent. But he had words of praise for Sir Keir Starmer after touching down in Ayrshire on Friday, describing him as a \"good man\" while adding he is \"slightly more liberal than I am\". Mr Trump is due to have talks with Sir Keir and Scottish First Minister John Swinney, as well as discussing trade with European Commission President Ursula von der Leyen. The president headed straight to the resort, which he bought in 2014 and which he wants to see host The Open, after landing. Scotland correspondent We heard him before we saw him. It was the surreal moment Donald Trump trundled over the Turnberry course with music blaring from his golf buggy. The songs of choice were even more interesting given the crisis facing the US president amid the Jeffrey Epstein saga. Bridge Over Troubled Water by Simon and Garfunkel was the hit swirling around as the wind projected the music beyond a wall of police that had formed to protect the president. It was an eyebrow-raising moment to say the least. Mr Trump waved at the Sky News camera as I shouted a question about Scottish hospitality. It was a different story when I pivoted the topic to Epstein. He hit a shot and sped off. The 20-strong entourage of buggies followed him as he carried on his journey. Some may wonder why all the fuss over a man playing golf? But this is the president, and the kitchen sink has been thrown at the policing operation. Moments before we spotted Mr Trump, army and navy personnel were seen sweeping the grassy banks. Sniffer dogs patrolled the course while snipers watched over in a bid to fend off any intruders. The circus involved the police helicopter hovering overhead and the marine unit bobbing about off the choppy Ayrshire coast. Saturday is for play, and on Sunday it's politics. But, as ever, the Trump show is unpredictable. Saturday will be the first real test of Police Scotland during the visit as it looks to control the demonstrations in Aberdeen and Edinburgh, as well as any that spring up near the president's course. The force has asked for support from others around the UK to bolster officer numbers, with both organisations representing senior officers and the rank-and-file claiming there is likely to be an impact on policing across the country for the duration of the visit. Before the visit started, Mr Swinney appealed to Scots to protest \"peacefully and within the law\". Hundreds of protesters had gathered in both cities by early afternoon, with demonstrators in the centre of Aberdeen seen waving banners with anti-Trump slogans, while one came dressed as the president with a large papier mache head. Some members of the crowd also showed their support for Gaza, waving Palestinian flags. On the golf course, the US president was followed by more than a dozen other buggies. Mr Trump is expected to open a second course at another of his golf resorts in Balmedie in Aberdeenshire while he is in the country."
    },
    {
        "title": "Bread producers Hovis and Kingsmill close in on historic merger",
        "description": "The owners of Hovis and Kingsmill are closing in on a definitive agreement to merge two of Britain's most famous grocery brands following months of talks.",
        "url": "https://news.sky.com/story/bread-producers-hovis-and-kingsmill-close-in-on-historic-merger-13401970",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-hovis-bread_6904232.jpg?20250503064806",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-26 05:38:00",
        "Headline": "Associated British Foods, which owns Kingsmill's parent Allied Bakeries, could agree a deal worth about £70m to buy rival brand Hovis within the next week, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owners of Hovis and Kingsmill are closing in on a definitive agreement to merge two of Britain's most famous grocery brands following months of talks. Sky News has learnt that Associated British Foods (ABF), the London-listed company which owns Kingsmill's immediate parent, Allied Bakeries, has proposed paying roughly £75m to acquire Hovis from its long-term private equity backers. Banking sources said that a deal could be formally agreed to combine the businesses as early as the end of next week, although they cautioned that the complexity of the transaction meant that the timing could yet slip. Confirmation of a tie-up would come nearly three months after Sky News revealed that ABF and Endless - Hovis's owner since 2020 - were in discussions. Industry sources have estimated that a combined group could benefit from up to £50m of annual cost savings from a merger. ABF has also been exploring options for the future of Allied Bakeries separate from its talks with Hovis in the event that a deal could not be agreed or is prevented from completing by competition regulators. If it does go ahead, the merger will unite two historic bread producers under common ownership, with Allied Bakeries having been founded in 1935 by Willard Garfield Weston, part of the family which continues to control ABF. Hovis traces its history back even further, having been created in 1890 when Herbert Grime scooped a £25 prize for coming up with the name Hovis, which was derived from the Latin 'Hominis Vis' - meaning \"strength of man\". Persistent inflation, competition from speciality bread producers and shifting consumer habits towards lower-carb diets have combined to impair breadmakers' financial health in recent decades, however. In accounts filed at Companies House earlier this month, Hovis said it had \"achieved positive financial progress despite continued tough trading conditions\". The company reported sales of £439.6m in the 52 weeks to 28 September last year, down from £477.6m in the 53 weeks to 30 September 2023. Earnings before interest, tax, depreciation and amortisation fell from £20.9m to £18.7m, which Hovis said was the result of the revenue decline and higher distribution costs. \"Overall bread share remained stable, despite significant price inflation and the ongoing cost-of-living crisis, demonstrating the resilience of the Hovis brand and its iconic status as one of Britain's most loved food brands,\" the accounts said. This week, the trade publication The Grocer reported that Britain's big four supermarkets, including Asda and Sainsbury's, had delisted a number of Hovis-branded products. The publication quoted a Hovis spokeswoman as saying that the company was \"aware of some adjustments to Hovis product lines in certain stores\". \"We remain fully committed to working collaboratively with our retail partners to grow our mutual businesses.\" The overall UK bakery market is estimated to be worth about £5bn in annual sales, with the equivalent of 11 million loaves being sold each day. Critical to the prospects of a merger of Allied Bakeries, which also owns the Sunblest and Allinson's bread brands, and Hovis taking place will be the view of the Competition and Markets Authority (CMA) at a time when economic regulators are under intense pressure from the government to support growth. Warburtons, the family-owned business which is the largest bakery group in Britain, is estimated to have a 34% share of the branded wrapped sliced bread sector, with Hovis on 24% and Allied on 17%, according to industry insiders. A merger of Hovis and Kingsmill would give the combined group the largest share of that segment of the market, although one source said Warburtons' overall turnover would remain higher because of the breadth of its product range. Responding to Sky News' report in May of the talks, ABF said: \"Allied Bakeries continues to face a very challenging market. \"We are evaluating strategic options for Allied Bakeries against this backdrop and we remain committed to increasing long-term shareholder value.\" In a separate presentation to analysts, ABF - which is also in the process of closing its Vivergo bioethanol plant in Hull after pleading for government support - described the losses at Allied, which also owns own-label bread manufacturer Speedibake, as unsustainable. The company does not disclose details of Allied Bakeries' financial performance. Prior to its ownership by Endless, Hovis was owned by Mr Kipling-maker Premier Foods and the Gores family. At the time of the most recent takeover, High Wycombe-based Hovis employed about 2,700 people and operated eight bakery sites, as well as its own flour mill. Hovis's current chief executive, Jon Jenkins, is a former boss of Allied Milling and Baking. This weekend, ABF declined to comment, while Endless could not be reached for comment."
    },
    {
        "title": "25% of young children and pregnant women malnourished in Gaza, charity says, as PM vows to fly critical medical cases to UK ",
        "description": "A charity has warned 25% of young children and pregnant women in Gaza are now malnourished, with Sir Keir Starmer vowing to evacuate children who need \"critical medical assistance\" to the UK.",
        "url": "https://news.sky.com/story/25-of-young-children-and-pregnant-women-malnourished-in-gaza-charity-says-as-pm-vows-to-fly-critical-medical-cases-to-uk-13401950",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-nasser_6974083.jpg?20250726033037",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-26 02:34:00",
        "Headline": "\"Those who go to the Gaza Humanitarian Foundation's food distributions know that they have the same chance of receiving a sack of flour as they do of leaving with a bullet in their head,\" Doctors Without Borders claims.",
        "Content": " A charity has warned 25% of young children and pregnant women in Gaza are now malnourished, with Sir Keir Starmer vowing to evacuate children who need \"critical medical assistance\" to the UK. MSF, also known as Doctors Without Borders, said Israel's \"deliberate use of starvation as a weapon\" has reached unprecedented levels - with patients and healthcare workers both fighting to survive. It claimed that, at one of its clinics in Gaza City, rates of severe malnutrition in children under five have trebled over the past two weeks - and described the lack of food and water on the ground as \"unconscionable\". The charity also criticised the high number of fatalities seen at aid distribution sites, with one British surgeon accusing IDF soldiers of shooting civilians \"almost like a game of target practice\". MSF's deputy medical coordinator in Gaza, Dr Mohammed Abu Mughaisib, said: \"Those who go to the Gaza Humanitarian Foundation's food distributions know that they have the same chance of receiving a sack of flour as they do of leaving with a bullet in their head.\" The UN also estimates that Israeli forces have killed more than 1,000 people seeking food - the majority near the militarised distribution sites of the US-backed aid distribution scheme run by the GHF.  In a statement on Friday, the IDF had said it \"categorically rejects the claims of intentional harm to civilians\", and reports of incidents at aid distribution sites were \"under examination\". The GHF has also previously disputed that these deaths were connected with its organisation's operations, with director Johnnie Moore telling Sky News: \"We just want to feed Gazans. That's the only thing that we want to do.\" Israel says it has let enough food into Gaza and has accused the UN of failing to distribute it, in what the foreign ministry has labelled as \"a deliberate ploy\" to defame the country. 'Humanitarian catastrophe must end' In a video message posted on X late last night, Sir Keir Starmer condemned the scenes in Gaza as \"appalling\" and \"unrelenting\" - and said \"the images of starvation and desperation are utterly horrifying\". The prime minister added: \"The denial of aid to children and babies is completely unjustifiable, just as the continued captivity of hostages is completely unjustifiable. \"Hundreds of civilians have been killed while seeking aid - children, killed, whilst collecting water. It is a humanitarian catastrophe, and it must end.\"  Sir Keir confirmed that the British government is now \"accelerating efforts\" to evacuate children from Gaza who need critical medical assistance, so they can be brought to the UK for specialist treatment. Israel has now said that foreign countries will be able to airdrop aid into Gaza. While the PM says the UK will now \"do everything we can\" to get supplies in via this route, he said this decision has come \"far too late\". Read more:WHO: Gaza faces 'manmade' starvationUN: People in Gaza 'walking corpses' Last year, the RAF dropped aid into Gaza, but humanitarian organisations warned it wasn't enough and was potentially dangerous. In March 2024, five people were killed when an aid parachute failed and supplies fell on them. For now, Sir Keir has rejected calls to follow French President Emmanuel Macron and recognise a Palestinian state - despite more than 220 MPs signing a cross-party letter to demand he takes this step. The prime minister is instead demanding a ceasefire and \"lasting peace\" - and says he will only consider an independent state as part of a negotiated peace deal."
    },
    {
        "title": "Scottish Labour MSPs heap pressure on Starmer to recognise Palestinian state",
        "description": "Sir Keir Starmer is coming under even more pressure to immediately recognise Palestine as a state, &#160;this time from the Scottish Labour leader and all his Labour MSPs.",
        "url": "https://news.sky.com/story/scottish-labour-msps-heap-pressure-on-starmer-to-recognise-palestinian-state-13402014",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sir-keir-starmer-downing-street_6974188.jpg?20250726104810",
        "type": "Politics",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-07-26 08:35:00",
        "Headline": "Some 21 Scottish Labour MSPs, including deputy leader Jackie Baillie, have signed a statement urging the prime minister to recognise Palestine.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n Sir Keir Starmer is coming under even more pressure to immediately recognise Palestine as a state,  this time from the Scottish Labour leader and all his Labour MSPs. Some 21 Scottish Labour MSPs, including deputy leader Jackie Baillie, have signed a statement urging the prime minister to recognise Palestine. Middle East latest: Pressure on Starmer to recognise Palestinian state They wrote: \"Our position is clear and longstanding. The UK should recognise the State of Palestine, to uphold Labour's manifesto commitment and to preserve the two-state solution. \"In the face of mass atrocities in Gaza and accelerated annexation of the West Bank, the demand for action is immediate and indisputable. This is an existential moment for the Palestinian people. \"Recognition is not about rewarding Hamas, who need to immediately release all hostages and play no further role in Gaza. Recognition makes clear the Palestinian Authority's de jure administration of Gaza and sets out a path to move towards de facto control in the nearest possible future. \"State recognition must be the first step - not the end goal - of a peace process that has been deferred for far too long. It should allow two equal sides to negotiate peace, security, prosperity and equal rights for all. The Arab Peace Initiative outlined a comprehensive plan that can guarantee security, recognition and bilateral relations, with the full support of the region. \"We urge the British government to take this step, which would be backed by a majority of the Labour movement.\" It comes after 221 MPs from nine parties signed a letter addressed to the prime minister on Friday calling for the same request. It was coordinated by a senior Labour politician and chair of the International Development Committee, Sarah Champion. Read more:25% of young children now malnourished in Gaza, charity saysTrump issues warning to leaders as he arrives in Scotland The Scottish Labour leader, Anas Sarwar, had already made the demand for Palestinian statehood shortly before the prime minister announced he would hold emergency talks with his French and German counterparts about the worsening humanitarian situation in Gaza. That call is yet to take place but Sir Keir released a statement on Friday calling the situation in Gaza \"appalling\" and \"unrelenting\".  He has so far rejected all calls to back Palestinian statehood. The government says it is already providing funding for the UN agency for Palestinian refugees and working to secure the release of hostages held by Hamas, but immediate recognition of Palestinian statehood will be a much more controversial move. Ministers have indicated their plan to recognise Palestine would be \"at a time that is most conducive to the peace process\" without further clarity on when that might be. They have also indicated it would not be suitable to speculate about future sanctions, as this could reduce their impact. In a tweet, Mr Sarwar said Israeli Prime Minister Benjamin Netanyahu had broken international law and accused him of having \"no interest\" in a peaceful resolution to the crisis. The government last month sanctioned two Israeli ministers over their comments about the war in Gaza in a significant break with Donald Trump and the US. Itamar Ben-Gvir and Bezalel Smotrich had their assets frozen and have been banned from entering the UK."
    },
    {
        "title": "Eighty years on from Labour's landslide, the humanitarian crisis in Gaza brings Clement Attlee's failure on Israel and Palestine to mind",
        "description": "Here's one for the aficionados: 26 July 2025 marks the 80th anniversary of Labour's landslide victory in the 1945 general election.",
        "url": "https://news.sky.com/story/eighty-years-on-from-labours-landslide-the-humanitarian-crisis-in-gaza-brings-clement-attlees-failure-on-israel-and-palestine-to-mind-13402284",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-clement-attlee-labour_6974692.jpg?20250726183521",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-07-26 17:29:00",
        "Headline": "If Clement Attlee's NHS, welfare state and nationalisation are viewed as successes by Labour trade unionists and MPs, his government's policy on Palestine is widely agreed to have been a failure.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Here's one for the aficionados: 26 July 2025 marks the 80th anniversary of Labour's landslide victory in the 1945 general election. Trade unionists and Labour MPs are celebrating, claiming the nation still owes a debt of gratitude for the historic achievements of Clement Attlee's government. Yet today, as the world watches the humanitarian crisis in Gaza with horror, it's worth recalling that one of Attlee's biggest failures was his Israel-Palestine policy. (Oh, and while Attlee's health minister Aneurin Bevan boasted he \"stuffed their mouths with gold\" to overcome doctors' opposition to the NHS, today doctors are on strike over pay again.) The 1945 election took place on 5 July, the same date Sir Keir Starmer entered 10 Downing Street last year. But with British armed forces still serving overseas in 1945, it took until 26 July to declare the result.  Labour won 393 seats in 1945, compared with 411 last year. But while Sir Keir's Labour only won 34% of the votes, Mr Attlee won nearly 50%. But then, there was no insurgent Reform UK back then. Celebrating the 80th anniversary, Joanne Thomas, who became general secretary of the shopworkers' union Usdaw in April this year, said the Attlee government left a lasting legacy. \"Usdaw's predecessor unions were proud to play a role in the 1945 election victory and to see 18 of our members elected,\" she said. \"Not least a hero of our union 'Red Ellen', a fiery trade union organiser who led the Jarrow hunger march and went on to serve as education minister.\" Wilkinson was indeed red. Attlee biographer Trevor Burridge wrote: \"Ellen Wilkinson was made minister of education despite the fact that she had actively campaigned against his leadership.\" She was MP for Jarrow, not a million miles from the current education secretary and Starmer super-loyalist Bridget Phillipson's Houghton and Sunderland South constituency. But not even her best friends would call her red! Ellen Wilkinson was also the only woman in Attlee's 1945 cabinet. Last year, Sir Keir made history by appointing 11 women to his cabinet. Labour MP Marie Tidball, elected last year, joined the tributes to Attlee. \"He transformed Britain for working people and this legacy laid the foundations for Britain today - our NHS, welfare state and homes for heroes. \"Those public services meant I could grow up to fulfil my potential. Labour legend.\" But if Attlee's NHS, welfare state and nationalisation are viewed as successes by Labour trade unionists and MPs, his government's policy on Palestine is widely agreed to have been a failure. In his acclaimed biography of Attlee's foreign secretary, \"Ernest Bevin: Labour's Churchill\", former Blairite cabinet minister Andrew Adonis wrote: \"Why did Bevin get Israel/Palestine so wrong?\" Adonis says Bevin's policy on Palestine \"led to the precise opposite of its declared intention of stability and the peaceful co-existence of the Jewish and Palestinian communities within one state at peace with its neighbours\". He concluded: \"Instead, Bevin's legacy was a Jewish state of Israel, much larger than even most of its advocates previously favoured, in periodic war and perpetual tension with both its Palestinians and its Arab neighbours.\" Where did Bevin go wrong? Adonis wrote: \"In the first place, because, during the three key years 1945-48, he did not agree that his central policy objective was 'good relations with the United States'.\" Read more from Sky News:Starmer caught between Trump, Macron and MPs over PalestineEpstein questions keep coming as White House tightens grip on who answers themBob Geldof accuses Israeli authorities of 'lying' about starvation in Gaza As Sir Keir Starmer prepares to meet Donald Trump in Scotland, 80 years after the historic Attlee victory, that's clearly not a mistake the current Labour PM has made in his relations with the US president. \"I like your prime minister,\" the president said as he arrived in Scotland, \"he's slightly more liberal than I am, but I like him\". So, 80 years on from Attlee, lessons have been learned. So far, so good, that is."
    },
    {
        "title": "Age verification tools on adult websites bypassed in seconds",
        "description": "Ethical hackers have shown Sky News how new age verification systems can be bypassed on pornographic websites in a matter of seconds.",
        "url": "https://news.sky.com/story/hackers-prove-age-verification-systems-on-pornography-sites-can-be-bypassed-in-seconds-13401733",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-age-verification-tools_6974078.jpg?20250726013240",
        "type": "Technology",
        "Author": "Mickey Carroll, science and technology reporter and Francesca Casonato, video journalist",
        "Date Published": "2025-07-26 00:26:00",
        "Headline": "Using widely available technology, well-known ethical hackers Chris Kubecka and Paula Popovici quickly accessed numerous pornography sites without ever verifying their ages.",
        "Content": "By Mickey Carroll, science and technology reporter and Francesca Casonato, video journalist   Ethical hackers have shown Sky News how new age verification systems can be bypassed on pornographic websites in a matter of seconds. On Friday, toughened rules came into force that mean companies hosting adult content online must block under-18s using \"highly effective age verification\". That could include AI tools that use pictures to estimate someone's age, bank or ID checks, or more technical solutions using browser cookies. But hours later, two ethical hackers demonstrated just how simple it is to get around the measures designed to protect young people on the internet. Using widely available technology, Chris Kubecka and Paula Popovici quickly accessed numerous pornography sites without ever verifying their ages.  Their devices were running standard software, and the tricks they used were simple. This, Ms Kubecka said, showed the systems will not be effective at stopping under-18s from accessing explicit content online. \n                  What is Tea - the women-only app with millions of users?\n                 \n                  New internet rules enforced from today - but this grieving mother is sceptical they will work\n                 \n                  New internet rules come into force - here's what is changing\n                 The simplicity of their method was confirmed by multiple viewers, who contacted Sky News to say they had also managed to bypass the systems. One viewer said it had taken him \"less than 30 seconds\". Read more:Grieving mother is sceptical new rules will workOfcom rules: Here's what is changing Although Sky News has verified the methods used by Ms Kubecka and Ms Popovici, we won't give details or name any software used. Some of the explicit websites they checked had not turned on any age verification, despite declaring in June that they would. In response to our findings, Ofcom said these checks \"will help stop young children from stumbling across porn\". The regulator added: \"While the new rules have only been in place for a matter of hours, we will be actively assessing compliance to make sure platforms have age checks in place and that they are highly effective. \"Companies that fall short can expect to face enforcement action.\"  A spokesperson for the Department for Science, Innovation and Technology told Sky News: \"We expect these laws to be robustly implemented by tech companies. If they fail to do so, the regulator is ready to take severe enforcement action, including tough fines.\" There is also a risk that age verification could push users towards more dangerous corners of the internet in search of pornography. By 10am on Friday, data suggested an extra 66,000 internet users in the UK had begun using the dark web. Ms Kubecka fears this number may only increase. \"That is one of the concerns that I have because I don't want illegal or extreme content being normalised in our teens,\" she said.  Google Trends data shows searches for online tools to help people bypass age verification have surged, too. Ofcom told Sky News it had been clear that sites \"must not encourage or direct users to get around age checks\". \"People should be aware that children and adults who use [certain software] to bypass age checks will not benefit from the wider protections offered by our online safety rules.\" Despite those warnings, in the days running up to the rules being enforced, advertising data shows companies were targeting UK users and promoting tools that could bypass the verification. \"Platforms have clear legal obligations and must actively prevent children from circumventing safety measures, including blocking content that promotes ... workarounds targeting young users.\""
    },
    {
        "title": "Gregg Wallace speaks out after MasterChef sacking",
        "description": "Gregg Wallace has spoken about his sacking from MasterChef after inappropriate behaviour while working for the BBC - but insisted he is \"not a groper, a sex pest or a flasher\".",
        "url": "https://news.sky.com/story/gregg-wallace-apologises-to-anyone-he-has-hurt-but-insists160im-not-a-groper-13401954",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-gregg-wallace-masterchef-host_6763965.jpg?20241204093832",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-26 02:00:00",
        "Headline": "Wallace suggests some criticism about his conduct could be explained by his autism: \"I know I am odd. I know I struggle to read people.... but I don't think I am a wrong 'un\".",
        "Content": "Gregg Wallace has spoken about his sacking from MasterChef after inappropriate behaviour while working for the BBC - but insisted he is \"not a groper, a sex pest or a flasher\". Wallace, 60, has apologised after a report, commissioned by the cooking show's production company Banijay UK, found 45 out of 83 allegations were substantiated. In an interview with The Sun, he said: \"I know I have said things that offended people... I understand that now - and to anyone I have hurt, I am so sorry. \"I don't expect anyone to have any sympathy with me but I don't think I am a wrong 'un.\"  MasterChef co-host John Torode also had an allegation that he used an \"extremely offensive racist term\" upheld, as part of the same investigation. Torode, who insisted he had \"absolutely no recollection\" of the alleged incident, has not had his contract for the show renewed. Wallace has now defended Torode, saying: \"I've known John for 30 years and he is not a racist. \n                  MasterChef series filmed last year to be broadcast after allegations against presenters upheld\n                 \n                  BBC reveals highest-earning stars - as pay list published\n                 \n                  Head of BBC addresses future of MasterChef - as annual report released\n                 \"There is no way that man is a ­racist. No way. And my sympathies go out to John because I don't want anybody to go through what I've been through.\" At one point, Wallace became tearful during the interview when describing the impact of the investigation on his family. \"I have seen myself written about in the same sentence as Jimmy Savile and Huw Edwards, paedophiles and sex offenders. That is just so, so horrific.\" In respect to the specific allegation of unwanted touching, Wallace denied groping a woman and said that, while he was attempting to flirt with her, he did believe the contact it was consensual. \"She gave me her phone number. I considered that to be intimacy. It was 15 years ago. Me, drunk, at a party, with my hand on a girl's bum,\" he said. He also accepted he had briefly appeared with a sock on his private parts in front of four colleagues in MasterChef studio. But he said his is not a flasher, and people were either \"amused or bemused\" but not distressed. Read more from Sky News:Actor Micheal Ward charged with rapeJazz singer Dame Cleo Laine diesBBC reveals highest-earning stars On the broader allegations about using inappropriate language, Wallace accepted the criticism and suggested that some of his conduct could be explained by his autism and his background. \"I know I am odd. I know I struggle to read people. I know people find me weird. Autism is a... registered disability. Just because you can't see it doesn't mean it's not real.\" He also blamed his former career: \"I'm a greengrocer from Peckham. I thrived in Covent Garden's fruit and veg market. In that environment that is jovial and crude. It is learned behaviour.\" Wallace told the newspaper he is now scared to appear in public: \"I go out now in a disguise - a baseball cap and sunglasses, I don't want people to see me. I'm scared.\" On Wednesday, the BBC confirmed a series of MasterChef filmed last year, before allegations against presenters Gregg Wallace and John Torode were upheld, will still be broadcast."
    },
    {
        "title": "Company at heart of Coldplay viral video releases tongue-in-cheek clip - with a big twist ",
        "description": "The company at the centre of a viral video at a Coldplay concert has released a tongue-in-cheek clip on social media - featuring Gwyneth Paltrow as a \"temporary spokesperson\".",
        "url": "https://news.sky.com/story/company-at-heart-of-coldplay-viral-video-releases-tongue-in-cheek-clip-with-a-big-twist-13401966",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-coldplay-andy-byron_6968322.jpg?20250719094855",
        "type": "Entertainment",
        "Author": "Connor Sephton",
        "Date Published": "2025-07-26 04:10:00",
        "Headline": "Gwyneth Paltrow, who used to be married to Coldplay frontman Chris Martin, stars as a \"very temporary spokesperson\" in the newly released video.",
        "Content": "\n          News reporter\n              @ConnorSephton\n  The company at the centre of a viral video at a Coldplay concert has released a tongue-in-cheek clip on social media - featuring Gwyneth Paltrow as a \"temporary spokesperson\". Astronomer was thrust into the spotlight after two of the tech firm's senior executives were filmed embracing on a kiss cam during a gig in Boston. Andy Byron subsequently resigned as chief executive officer - while the woman in the video, Kristin Cabot, stepped down as chief people officer a few days later.  Paltrow, who used to be married to Coldplay frontman Chris Martin, is seen sitting at a desk in the new video uploaded to X - and begins by thanking the public for their interest in Astronomer. She adds: \"I've been hired on a very temporary basis to speak on behalf of the 300-plus employees at Astronomer. \"Astronomer has gotten a lot of questions over the last few days - and they wanted me to answer the most common ones.\" A question is then typed out on the screen that reads: \"OMG, what the actual…\" \n                  Gregg Wallace speaks out after MasterChef sacking\n                 \n                  Top Boy actor Micheal Ward charged with two counts of rape\n                 \n                  Grammy-winning jazz singer Dame Cleo Laine dies\n                 Before the final word appears, the video cuts back to Paltrow, who goes on to promote some of the services Astronomer offers. In a subtle nod to the countless column inches the company has attracted, Paltrow adds: \"We've been thrilled so many people have a newfound interest in data workflow automation.\" Another question then pops up on screen, which begins to type out: \"How is your social media team holding up?\" But before the sentence fully appears, Paltrow abruptly interrupts by declaring that Astronomer has spaces at an upcoming conference in September. \"We'll now be returning to what we do best: delivering game-changing results for our customers,\" she adds at the end of the video. The marketing stunt is a sign that Astronomer is trying to put a positive spin on the scandal, which sparked feverish speculation online. After Mr Byron resigned, the company had said in a statement: \"Astronomer is committed to the values and culture that have guided us since our founding. \"Our leaders are expected to set the standard in both conduct and accountability, and recently, that standard was not met.\" Pete DeJoy, who has taken over as interim CEO, admitted on Monday that the company has faced an \"unusual and surreal\" amount of attention in recent days. On LinkedIn, he wrote: \"While I would never have wished for it to happen like this, Astronomer is now a household name.\""
    },
    {
        "title": "Company at heart of Coldplay viral video releases tongue-in-cheek clip - with a big twist ",
        "description": "The company at the centre of a viral video at a Coldplay concert has released a tongue-in-cheek clip on social media - featuring Gwyneth Paltrow as a \"temporary spokesperson\".",
        "url": "https://news.sky.com/story/company-at-heart-of-coldplay-viral-video-releases-tongue-in-cheek-clip-with-a-big-twist-13401966",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-coldplay-andy-byron_6968322.jpg?20250719094855",
        "type": "Strange",
        "Author": "Connor Sephton",
        "Date Published": "2025-07-26 04:10:00",
        "Headline": "Gwyneth Paltrow, who used to be married to Coldplay frontman Chris Martin, stars as a \"very temporary spokesperson\" in the newly released video.",
        "Content": "\n          News reporter\n              @ConnorSephton\n  The company at the centre of a viral video at a Coldplay concert has released a tongue-in-cheek clip on social media - featuring Gwyneth Paltrow as a \"temporary spokesperson\". Astronomer was thrust into the spotlight after two of the tech firm's senior executives were filmed embracing on a kiss cam during a gig in Boston. Andy Byron subsequently resigned as chief executive officer - while the woman in the video, Kristin Cabot, stepped down as chief people officer a few days later.  Paltrow, who used to be married to Coldplay frontman Chris Martin, is seen sitting at a desk in the new video uploaded to X - and begins by thanking the public for their interest in Astronomer. She adds: \"I've been hired on a very temporary basis to speak on behalf of the 300-plus employees at Astronomer. \"Astronomer has gotten a lot of questions over the last few days - and they wanted me to answer the most common ones.\" A question is then typed out on the screen that reads: \"OMG, what the actual…\" \n                  Gregg Wallace speaks out after MasterChef sacking\n                 \n                  Top Boy actor Micheal Ward charged with two counts of rape\n                 \n                  Grammy-winning jazz singer Dame Cleo Laine dies\n                 Before the final word appears, the video cuts back to Paltrow, who goes on to promote some of the services Astronomer offers. In a subtle nod to the countless column inches the company has attracted, Paltrow adds: \"We've been thrilled so many people have a newfound interest in data workflow automation.\" Another question then pops up on screen, which begins to type out: \"How is your social media team holding up?\" But before the sentence fully appears, Paltrow abruptly interrupts by declaring that Astronomer has spaces at an upcoming conference in September. \"We'll now be returning to what we do best: delivering game-changing results for our customers,\" she adds at the end of the video. The marketing stunt is a sign that Astronomer is trying to put a positive spin on the scandal, which sparked feverish speculation online. After Mr Byron resigned, the company had said in a statement: \"Astronomer is committed to the values and culture that have guided us since our founding. \"Our leaders are expected to set the standard in both conduct and accountability, and recently, that standard was not met.\" Pete DeJoy, who has taken over as interim CEO, admitted on Monday that the company has faced an \"unusual and surreal\" amount of attention in recent days. On LinkedIn, he wrote: \"While I would never have wished for it to happen like this, Astronomer is now a household name.\""
    }
]