[
    {
        "title": "Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today",
        "description": "Sir Keir Starmer and Rachel Reeves have hinted at tax rises to come when the chancellor delivers the budget later this month.",
        "url": "https://news.sky.com/story/starmer-and-reeves-hint-at-tax-rises-to-come-ahead-of-unusual-pre-budget-speech-today-13463353",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-keir-starmer_7071216.jpg?20251103232800",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-03 16:54:00",
        "Headline": "The chancellor will address the nation from Downing Street on Tuesday morning, weeks before she delivers her second budget. It comes amid rampant speculation she will break Labour's manifesto commitments on tax rises.",
        "Content": " Sir Keir Starmer and Rachel Reeves have hinted at tax rises to come when the chancellor delivers the budget later this month. In a Downing Street speech this morning, Ms Reeves will address \"speculation\" that an increase in income tax will be announced during the highly-anticipated statement on 26 November. Politics Hub: Follow chancellor's speech live Sky News political editor Beth Rigby said it was \"highly unusual\" for the chancellor to make such a speech, but the Treasury believes she must \"try to prepare the ground and make the argument for another big tax-raising budget\". \"I will make the choices necessary to deliver strong foundations for our economy - for this year, and years to come,\" Ms Reeves will say. Last night, Sir Keir gave Labour MPs a taste of what's to come by warning of the need for \"tough but fair\" decisions. Speaking at a party meeting in Westminster, he said the budget \"takes place against a difficult economic backdrop\". \"It's becoming clearer the long-term impact of Tory austerity, their botched Brexit deal and the pandemic on Britain's productivity is worse than even we feared,\" the prime minister said. \"Faced with that, we will make the tough but fair decisions to renew our country and build it for the long term.\" Political editor I don't need to tell you how difficult and contested this is going to be. Only a year ago, the chancellor unveiled the biggest tax-raising budget since 1993 and said it was a \"once in a parliament event\". MPs will be fearing a massive backlash should manifesto promises on not raising income tax (and VAT and national insurance) for working people be broken. Government figures know how hard it's going to be but argue the chancellor has to level with the public about the hard choices ahead and what is driving her decision-making. It comes after Sir Keir refused to confirm at Prime Minister's Questions last week that the budget would honour his party's manifesto pledge not to raise income tax, national insurance or VAT. Having raised taxes in last year's budget, notably national insurance on employers, Ms Reeves has also previously promised not to \"come back for more\" during this parliament.  The PM and chancellor's warnings come after reports suggested the Office for Budget Responsibility is expected to downgrade its productivity growth forecast for the UK by about 0.3 percentage points. That would leave Ms Reeves with a larger than expected fiscal black hole to fill, possibly up to £30bn. Read more: What taxes could rise? She is said to be considering a proposal from The Resolution Foundation, a left-leaning thinktank close to the government, to raise income tax by 2p but cut national insurance by the same amount. The thinktank, which used to be headed by Torsten Bell, a Labour MP who is now a key aide to Ms Reeves and a pensions minister, said the move would raise vital cash while protecting working people.  Reeves to prioritise NHS and cost of living Giving a further flavour of what to expect, Ms Reeves will this morning vow to make \"important choices that will shape our economy for years to come\". \"It is important that people understand the circumstances we are facing, the principles guiding my choices - and why I believe they will be the right choices for the country,\" she will add. Ms Reeves will say her priorities are cutting national debt, easing the cost of living and protecting the NHS. \"It will be a budget led by this government's values,\" she's set to say. \"Of fairness and opportunity and focused squarely on the priorities of the British people: protecting our NHS, reducing our national debt and improving the cost of living.\""
    },
    {
        "title": "How frontline workers deal with trauma of young driver deaths",
        "description": "We're sat in a silent, empty, cardiac treatment room - on the other side of the door, you can hear the bustle of the largest A&E and major trauma ward in Devon.",
        "url": "https://news.sky.com/story/how-frontline-workers-deal-with-trauma-of-young-driver-deaths-13463129",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-consultant-plymouth_7070641.jpg?20251104020537",
        "type": "Home",
        "Author": "Dan Whitehead",
        "Date Published": "2025-11-03 10:12:00",
        "Headline": "Sky News has spent the last year reporting on a long-running campaign - led by grieving families - to get the government to toughen rules on new young drivers within its Road Safety Strategy, which is set to be announced soon.",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n  We're sat in a silent, empty, cardiac treatment room - on the other side of the door, you can hear the bustle of the largest A&E and major trauma ward in Devon. Ambulances arrive, patients are wheeled on stretchers, families wait pensively. Consultant Dr Anne Hicks, from Derriford Hospital in Plymouth, is with me - she's worked in emergency care for more than 30 years. There is a long pause when I ask what the hardest part of her job is. \"I don't think it's looking after the trauma patients,\" she says. \"The toughest part is talking to the relatives. I get huge satisfaction from doing it well - but I can remember the face of every relative I think I've ever spoken to.\" She, like many of her colleagues, has had to tell the parents of teenagers killed in car crashes the worst news. \"The tragedy is nothing to what that parent feels when you tell them their child has gone. That their child has died.\" This is the so-called ripple effect - so many lives impacted by deaths on our roads, beyond the immediate family. Sky News has spent the last year reporting on a long-running campaign - led by grieving families - to get the government to toughen rules on new young drivers within its Road Safety Strategy, which is set to be announced soon. But as well as relatives, there is a whole other group impacted by deaths on Britain's roads. Emergency service workers are often the first to arrive at some of the most horrific and distressing scenes. We've been given access inside Derriford Hospital in Plymouth and Devon Air Ambulance - to understand how frontline workers deal with such trauma. Grant Thompson is a paramedic with the air ambulance team based at Exeter Airport. We're inside the medical stockroom, used to refill the chopper after each callout. He remembers a callout last summer. 'A shock to the system' \"It was one of those jobs when you're not expecting, I suppose, what you're going to see,\" he says. \"We started realising this was going to be a bad job. You started thinking, 'how are we going to split up as a team?' We got there reasonably quickly and three of these young people actually died at the scene, which was quite difficult. \"It was trying to give the best care you can for everybody - they were quite severely injured. It's always a shock to the system when you get to those jobs. It can be tricky. It can be tricky.\" Those three young deaths were among more than 1,600 on Britain's roads last year - with nearly 130,000 injured. Some 22% of those fatalities involved a young person behind the wheel. New data released by the Department for Transport also shows male drivers aged 17-24 are four times more likely to be killed or seriously injured than all drivers aged over 25. Read more from Sky News:PM and chancellor hit at tax risesThe underground squad with lives in their hands Death is one thing, life-changing injuries another. Inside the major trauma unit at Derriford, ward manager Larissa Heard says she's seen the \"whole scale\" of reaction. \"Some patients are amazingly resilient and take it really well - for others it is absolutely life-changing, and they are hysterical,\" she says. \"This could be the first time that they're actually seeing their injuries in full light. It might be the first time that they're actually aware they've had an amputation or are actually paralysed. \"So having to manage that for us can be really hard.\" 'It's only afterwards the impact hits you' As we chat, an 18-year-old who has lost a leg in a car crash pushes himself past us; staff say there are always victims of RTCs on the ward. Treating the physical and mental scars of collisions is, of course, their job. Like all those in the NHS, that responsibility comes first. \"I don't think you feel it until you get the lovely thank-you cards at the end, and you find out the patients you looked after knew your name,\" says Catie Crisp, a trainee advanced clinical practitioner. \"It's only afterwards the impact hits you: 'I can take a deep breath now, that was really hard, that was really emotional.'\" A possible solution? Like the families who lost children, emergency workers would welcome any measure that could reduce the number of young people injured and killed. Graduated driving licences (GDLs) place restrictions on new young drivers in the first few months of driving, such as a ban on driving late at night and with a car full of people - factors so often part of fatal accidents.  In Canada, one of the first countries to introduce GDLs, it takes at least 20 months to gain a full driving licence, with learners earning certain freedoms in stages. Deaths among young drivers are down 83% in the five years to 2022, compared to the same period before GDLs were brought in. For emergency consultant Dr Tim Nutbeam, introducing a similar scheme would be a step in the right direction: \"I believe in evidence informed practice and for me the evidence from Canada, from other parts of the world is really strong. I believe GDL saves lives. \"I've got four children. One of them in a couple of years will be driving. I as a parent will be making sure a similar structure to GDL is in place to try to keep her safe.\" But the Department for Transport says it is not considering them. A spokesperson told Sky News: \"Every death on our roads is a tragedy and our thoughts are with everyone who has lost a loved one in this way. \"Whilst we are not considering graduated driving licences, we absolutely recognise that young people are disproportionately victims of tragic incidents on our roads and continue to tackle this through our THINK! campaign. \"We are considering other measures to address this problem and protect young drivers, as part of our upcoming strategy for road safety - the first in over a decade.\" 'They need to reconsider' For those representing emergency service workers, the government's position must change. \"In my view, the evidence is overwhelming that they need to reconsider it,\" says Philip Secombe - the joint lead on road safety for the Association of Police and Crime Commissioners. \"We need to look at not restricting our young drivers, but actually safeguarding them, and their passengers and other road users.\" Back at the Devon Air Ambulance base, Grant explains how the ripple effect can spread far and wide. \"The loss of any life is tragic and affects a lot of people and clinicians as well, but I think when there's a young person who survives as well, they've got to walk with that for the rest of their lives, 60 odd years or whatever it'll be, that you've got to carry that with you - and more than likely it'd be one of your friends. \"I just hope that shapes people's attitudes to save driving. You know, these are my mates, my best mates in the world, in my car, I need to adapt my driving to come out safe of this.\""
    },
    {
        "title": "Thousands targeted in 'killing fields' around Sudanese city in paramilitary group's hands",
        "description": "Thousands who fled a key frontline city in Sudan's war as it fell to paramilitaries were targeted in killing fields around it by the group, after the military's top brass secured their own safe passage.",
        "url": "https://news.sky.com/story/tens-of-thousands-missing-in-killing-fields-around-city-in-hands-of-sudans-paramilitary-group-13463324",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sudan-yousra-graphic_7070938.png?20251103174650",
        "type": "Home",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-11-03 16:03:00",
        "Headline": "A Sky News joint investigation with Sudan War Monitor and Lighthouse Reports reveals the harrowing fate of civilians and soldiers who fled Al Fashir in the hours after senior commanders and officers left the infantry division.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  Thousands who fled a key frontline city in Sudan's war as it fell to paramilitaries were targeted in killing fields around it by the group, after the military's top brass secured their own safe passage. Warning: Some readers may find content in this article distressing. More than 60,000 people are still missing and humanitarians fear that Al Fashir's remaining 200,000 residents are being held hostage by Rapid Support Forces (RSF) fighters. In our investigation with Sudan War Monitor and Lighthouse Reports, we can reveal the harrowing fate of civilians and soldiers who fled the city in the hours after senior commanders and officers left the infantry division. Some 70,000 people have escaped Al Fashir since it was captured on 26 October, according to the DTM matrix of the International Organisation for Migration (IOM), but fewer than 10,000 people are accounted for in the nearest safe displacement zones. In an effort to track down the missing, we analysed dozens of videos and followed crowds of civilians on their way out. In this first video, we see a group, and two men - the first with a yellow hoodie and black jacket walking beside a dirt berm along with women and children. In a later video, we see a crowd of captives that includes the two men - in the same yellow hoodie and red turban. A video of men sitting on the ground under RSF armed guard shows the women walking through freely, showing they had been separated. In another video, we see the man in a red turban in a queue of men who start to run as RSF fighters chase and beat them. A source on the ground told us that this single group had around 2,000 captives and only 200 of them arrived at the nearest displacement shelter in Tawila, around 45 miles from Al Fashir. We geolocated one of the videos of the group walking approximately 5km (three miles) from the nearby town of Geurnei. There, hundreds were rounded up in school buildings. 'They would execute people in front of us' The families of doctors held there told Sky News the RSF asked them to pay ransoms to secure their release. A man who survived captivity in Geurnei with his wife told us he was held with around 300-400 families after being robbed and harassed on his way out of Al Fashir. \"We got to the school and they caught up with us. They starting targeting people - elderly and young - and took them to be detained,\" said Abdelhamid. \"They would select people and execute them in front of us and then say - 'bury your brother' - and we would cover them with soil. I saw them kill 18 people with my own eyes and then people had to bury them with their bare hands.\" Satellite images from 30 October show mounds of dirt that appear to be new graves added to an existing cemetery, near school buildings in Geurnei. Read more:UAE is 'main backer' behind Sudan war - intelligence officerTens of thousands killed in two days in Sudan city, analysts believe Others were executed in the fields outside of Al Fashir. In a video shared on social media, a vehicle is shown pursuing civilians in the countryside. The driver films as two fighters, one in an RSF patch, stop an unarmed man. One asks what the man is carrying, and shoots him at point-blank range. The car continues forward, accelerating towards and narrowly avoiding two unarmed men. He asks one man if he is carrying anything and says he is \"acting as if you are Arab\". After the driver says \"kill them all\", the camera turns back to the man, who appears to have been shot. The driver then urges those with him to hurry to catch up with those ahead. This brutality comes after the RSF encircled, starved and shelled Al Fashir for 18 months in their battle with the military for the last regional capital in Darfur under state control. Several high-level sources told us that top state commanders, officers and political leaders made arrangements for their own safe passage in over 100 vehicles, including some armoured cars, before the 6th infantry division was captured by the RSF in the morning hours of 26 October. Earlier this year, Al Fashir was being suffocated to death by the paramilitary Rapid Support Forces (RSF) as they pushed to claim full control of the Darfur region as a base for their parallel government, after the military recaptured the capital Khartoum and other key sites in central Sudan.  On Monday, famine conditions were confirmed in Al Fashir and Kadugli, another besieged city in Sudan's south, by the UN-backed Integrated Food Security Phase Classification (IPC). Inside Al Fashir, thousands were bombarded by almost daily shelling from surrounding RSF troops. The RSF physically reinforced their siege with a berm – a raised earth mound. First spotted by Yale Humanitarian Research Lab, the berm is visible from space.    The Sudan war started in April 2023, when long-simmering tensions between the Sudanese army and the RSF broke out in Khartoum. The US special envoy to Sudan estimates that 150,000 have been killed, but the exact figure is unknown. Close to 12 million people have been displaced. After 18 months of surviving forced starvation and shelling, the regional capital and symbolic battleground of Al Fashir fell to the RSF at the end of October. What does the head of the SAF say? The commander in chief of the Sudanese Armed Forces (SAF) Abdel Fattah Al Burhan has said the withdrawal was to spare the city from further destruction, indiscriminate shelling and drone attacks. In response to our findings, he told Sky News: \"The decision to withdraw was unanimous among the armed forces, regular forces, and the joint security committee. \"The withdrawal began with an attack by drones on forces blocking one of the crossings, destroying their positions. \"Later, the forces fought until they broke through the barrier and moved to a location outside the city. \"During the withdrawal, the forces lost more than 300 martyrs, and most of their vehicles were destroyed. They remain besieged. \"They did not leave soldiers behind. Those who remained were tasked with securing the withdrawal, and they performed their duty as required.\" But instead of a co-ordinated withdrawal, a soldier left behind describes an abandoned command. 'They completely abandoned us' \"The division commander had left the garrison. They completely abandoned us and we were suddenly surrounded 26 to 1 in the morning hours. Suddenly, everything collapsed on us in the defence. We asked what was going on and were told everyone fled,\" he said. \"Shortly after, bombs started falling on us. Brigadier General Adam, the artillery commander, refused to withdraw, saying that the division commander had already withdrawn without informing him of the order. The brigadier general, six colonels, and a naval colonel were also captured.\" Testimony from a civilian who fled that morning paints a picture of chaos. He said: \"There was no co-ordination over withdrawal, and it seemed to be a surprise to the remaining fighters on the frontline. Some were leaving the city and others were fighting battles with the RSF.\" As the RSF entered Al Fashir, he told us civilians were massacred. \"The streets were covered in bodies. I saw it for myself. The RSF came into the city and butchered everyone they found. They did not discern between a child, a civilian or the elderly - they executed everyone, a full genocide.\" High-resolution satellite imagery captured by Vantor shows burnt vehicles grouped together south of the berm the RSF built to besiege Al Fashir. A video we located at the site shows dozens of bodies, in fatigues and civilian clothing, lying lifeless on the ground by burning cars. Mounting concern over 200,000 people Fears are mounting over the fate of around 200,000 people left in Al Fashir. A top RSF commander with knowledge of the operations in the city told us that at least 7,000 people have been killed in Al Fashir in the first five days of capture. He said RSF fighters systemically targeted civilians from non-Arab tribes and killed groups of 300 to 400 people in some areas. Civilian sources close to the RSF corroborated his death toll, which we cannot independently verify on the ground. Al Fashir is in a complete telecommunications blackout. The United Nations Office for the Coordination of Humanitarian Affairs (UNOCHA) in Sudan has shared in a post on X that their \"Humanitarian partners in Sudan are being blocked from reaching A Fashir, North Darfur. \"Civilians are trapped inside, their condition unknown. Aid workers are ready to deliver life-saving support. Access needs to be granted now, in line with international humanitarian law.\" The RSF has circulated videos on its social media channels showing trucks delivering aid to Al Fashir's emaciated civilians. This comes after months of volunteers and aid workers being killed by RSF fighters while trying to bring in relief during their 18-month siege of enforced starvation and relentless shelling. What does the RSF say? The spokesperson for the RSF's political administration TASIS, Dr Alaa Nugud, told Sky News that there is a big fake media campaign prepared for the \"Al Fashir liberation\" and denounced the death toll of at least 7,000, shared by one of their top commanders, as \"totally rubbish\". In response to our report, he said: \"Never happened that TASIS forces or any of its constituents killed civilians based on ethnic background, on the other hand this is what was done by SAF and the Muslim brotherhood National Congress Party doctrine during their 39 years of rule. \"SAF's military intelligence was igniting these ethnic clashes throughout years they used religion to flame war in south Sudan and used racism and ethnicity to ignite war in Darfur.\" He added that \"RSF and TASIS forces evacuated more than 800,000 civilians outside Al Fashir\". \"Could they not provide or grant safe passage to civilians? The reality is that the insurance of the continuation of the war and spoiling of all peace platforms… the continuation of this war is the main cause of all atrocities. \"The atrocities are consequences of this war, not the cause of the war. So to stop all these atrocities we have to stop the war and this is not there in SAF agenda.\" The RSF is accused of committing war crimes and crimes against humanity across Sudan since the war started in April 2023. The Biden administration accused the RSF of committing genocide in Darfur in 2024, two decades after the group was first accused of genocide in the region as the Janjaweed. Our previous reporting on Sky News has supported allegations that the UAE militarily supports the RSF, though the country officially denies it. Additional reporting by Mohamed Zakarea, Sam Doak, Annoa Abekah-Mensah, Aziz Al Nour, Julia Steers, Jack Sapoch, and Klaas van Dijken. This story was a joint Sky News data and forensics investigation with Sudan War Monitor and Lighthouse Reports. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Police reviewing three further incidents - including stabbing of boy, 14 - after train knife attack",
        "description": "Police say they are reviewing three further incidents, including the stabbing of a 14-year-old boy, after a man appeared in court in connection with a mass knife attack on a train.",
        "url": "https://news.sky.com/story/man-32-charged-with-10-counts-of-attempted-murder-after-train-stabbings-13462394",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-huntingdon-cambridgeshire_7070443.jpg?20251103100904",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-03 13:00:00",
        "Headline": "Anthony Williams, 32, has appeared in court charged with 11 counts of attempted murder over the mass stabbing on Saturday, and another attack hours earlier at a London station.",
        "Content": " Police say they are reviewing three further incidents, including the stabbing of a 14-year-old boy, after a man appeared in court in connection with a mass knife attack on a train. Anthony Williams has been charged with 11 counts of attempted murder over Saturday's mass stabbing, and another attack hours earlier at a London station. The 32-year-old, of no fixed abode, was remanded in custody on Monday when he appeared at Peterborough Magistrates' Court. Williams has been charged with 10 counts of attempted murder, one count of actual bodily harm and one count of possession of a bladed article following the attack on the Doncaster to London King's Cross LNER service. Read more: 'Heroic' train staff commended after mass stabbing as details of victims emerge Earlier, British Transport Police (BTP) said Williams had also been charged with another count of attempted murder and possession of a bladed article in connection with an incident on a London train in the early hours of 1 November. The force said a victim suffered facial injuries after being attacked at 12.46am with a knife on a train at Pontoon Dock station on the Docklands Light Railway (DLR) in east London. The suspect had left the location before police arrived and officers subsequently identified Williams as a suspect, the force added. Meanwhile, Home Secretary Shabana Mahmood said police in Cambridgeshire were investigating whether the same man committed \"further offences\" earlier. Police there said they were looking at a series of incidents on Friday and Saturday, including one in which a teenager was stabbed. In a statement, Cambridgeshire Constabulary said a barbers in the Fletton area of Peterborough reported a man with a knife on Friday evening, and again on Saturday morning when police were not able to locate the suspect. A third incident \"that police also believe may be linked\" involved a 14-year-old who was stabbed on Friday evening by a man with a knife in the city centre, the statement added. The teenager suffered minor injuries. The force has referred itself to the police watchdog. British Transport Police will include the stabbing of the 14-year-old and the incident at the barber's shop as part of its investigation into the train attack. Armed officers were deployed to Huntingdon, Cambridgeshire, on Saturday evening where the LNER train was stopped and detained Williams within eight minutes of the first 999 call. Footage of his arrest has emerged, showing a man on the ground surrounded by officers and a barking police dog, with the sound of a Taser being deployed. Another man, also detained, was later released after officers established he was not involved. Prosecutor: Williams is 'risk' to public Williams wore a grey tracksuit when he appeared in court on Monday in handcuffs. He spoke softly to confirm his details and when asked his address, mumbled \"no fixed abode\". He was not asked to enter pleas.  Opposing bail for Williams, prosecutor Olaide Esan told the hearing: \"The defendant has attempted to murder 11 people in total. These are serious allegations. These are very serious offences. \"The defendant is a risk to the trains and to the members of the public.\" He allegedly used a \"large kitchen knife\" in both attacks, according to court documents. Read more from Sky News:Major incident declared in CumbriaBritish teen sentenced over drugs chargesAir India survivor says trauma 'broke' him The court heard Williams faces an assault charge after allegedly attacking a male police officer in custody, leaving him with a \"broken nose\", Ms Olaide said. Williams is due to appear at Cambridge Crown Court on 1 December. Transport Secretary Heidi Alexander told Sky News that BTP would be \"increasing the visible patrols at stations\" over the next few days. \"But generally, our trains are some of the most safest forms of public transport anywhere in the world,\" she added."
    },
    {
        "title": "Huntingdon train stabbing victim 'didn't have much choice' but to fight back",
        "description": "A victim of the Cambridgeshire train stabbings has spoken of the injuries he suffered as the prime minister hailed the bravery of those on board during the incident on Saturday night.",
        "url": "https://news.sky.com/story/heroic-staff-commended-after-huntingdon-train-stabbing-as-details-of-victims-emerge-13463383",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-stephen-crean-huntingdon_7070951.jpg?20251103180359",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-03 18:05:00",
        "Headline": "The football fan, who had been returning home after watching Nottingham Forest's 2-2 draw with Manchester United, says he had no chance to escape as the suspect approached.",
        "Content": "A victim of the Cambridgeshire train stabbings has spoken of the injuries he suffered as the prime minister hailed the bravery of those on board during the incident on Saturday night. Stephen Crean said he \"didn't have much choice\" but to fight back as the knifeman approached him. The 61-year-old said passengers ran into the buffet car after a young woman ran through his carriage shouting: \"Knife, knife, there's a man with a big knife.\" During the incident, Mr Crean said he \"got caught\" by the knife on his fingers, head, torso and arm, and will need plastic surgery. The football fan, who had been returning home after watching Nottingham Forest's 2-2 draw with Manchester United, said he had no chance to escape as the suspect approached. He said he managed to get into a train toilet after the confrontation. Speaking about his decision to fight back, Mr Crean said: \"Probably not many people would've done it, but then you're leaving people behind you vulnerable.\" On being described as a hero, he said: \"It's lovely that people are saying nice things about me.\" Armed officers were deployed to Huntingdon station after being alerted to the attack at 7.42pm on Saturday. They detained a man within eight minutes of the first 999 call. Read more: Police reviewing three further incidents after train attack Earlier, Sir Keir Starmer commended the \"heroic\" driver and staff and told the House of Commons on Monday the \"brave action\" of those who responded to the attack \"saved countless lives\". The prime minister told the Commons: \"I want to put on record in this House my own tribute to the police, the first responders, and in particular, to the heroic actions of both the driver and members of staff on board the Doncaster to London train, where such a vile and horrific attack took place this weekend.\" \"We all share in the revulsion of this shocking incident, but there's no doubt that their collective action, their brave action, saved countless lives, and I know the whole country is grateful for that,\" he continued. His comments came as more details emerged about some of the people injured in the mass stabbing. Home Secretary Shabana Mahmood said on Monday that there were 13 casualties, eight of whom remain in hospital. Scunthorpe United have confirmed their defender Jonathan Gjoshe was among those hurt. He is in hospital with non-life-threatening injuries. Railway worker's 'incredible bravery' One of those seriously injured was a London North Eastern Railway (LNER) staff member, who tried to protect passengers during the attack. Transport Secretary Heidi Alexander told Sky News the man, who has not been named, is now in a critical but stable condition.  She told the Mornings with Ridge and Frost programme: \"He went in to do his job, and he left work a hero. And there are people who are alive today because of his actions and his bravery.\" The train's driver has been commended for his quick thinking after diverting the locomotive to Huntingdon, Cambridgeshire, when passengers alerted him to the ongoing attack. In a statement, Andrew Johnson, who is ex-Royal Navy and has been driving trains for almost 20 years, said: \"As train drivers, we hold a lot of responsibility. \"We practise our emergency response and keep up to date with our knowledge of the route, so if needed, we know exactly where to stop and what to do. \"The action I took is the same as any other driver. I think my colleagues onboard were the real heroes and I'd like to pay tribute to their bravery.\" LNER's managing director David Horne said: \"Andrew's actions are testament to the expertise and skills he has built over his career, both on the railway and in the military.\" He added: \"Our thoughts remain with our colleague in hospital.\" Read more from Sky News:Air India survivor says trauma 'broke' himMan in court over Westminster blackmail allegation Anthony Williams, 32, has been charged with 10 counts of attempted murder over the mass stabbing, and one count of attempted murder over another attack hours earlier at a London station."
    },
    {
        "title": "Self-styled 'Anglo Jihadi' guilty of planning attack on shopping centre",
        "description": "A gym instructor who called himself the \"Anglo Jihadi\" has been found guilty of planning a bomb and chemical attack on a major shopping centre.",
        "url": "https://news.sky.com/story/self-styled-anglo-jihadi-guilty-of-planning-attack-on-shopping-centre-13463365",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-leeds-crown-jordan-richardson_7070772.jpg?20251103151344",
        "type": "Home",
        "Author": "Duncan Gardham, security journalist",
        "Date Published": "2025-11-03 17:24:00",
        "Headline": "Jordan Richardson, 21, from Howden, East Yorkshire, was convicted after police found a handwritten note with instructions on how to make mustard gas.",
        "Content": "By Duncan Gardham, security journalist  A gym instructor who called himself the \"Anglo Jihadi\" has been found guilty of planning a bomb and chemical attack on a major shopping centre. Jordan Richardson, 21, a Muslim convert from Howden, East Yorkshire, was convicted after he was caught carrying around a recipe for mustard gas in his rucksack. Richardson also had a link to an ISIS bomb-making video used by the Manchester Arena bomber, showing how to make the high explosive TATP. He was arrested on his way to work in nearby Goole on 19 December last year, carrying a backpack containing handwritten notes on pieces of notepaper. One read: \"Reach hidden vantage point, apply gas mask, outfit, load crossbow, throw all grenades into crowd, shoot bystanders, stab anyone who come close, do not get taken alive.\" A second note contained the ingredients and instructions on how to make mustard gas, a chemical warfare blister agent that can be fatal if inhaled. Richardson was found guilty of preparing acts of terrorism by acquiring weapons, researching explosive substances, identifying possible locations, and considering the steps required for an attack. \n                  Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today\n                 \n                  How frontline workers deal with trauma of young driver deaths\n                 \n                  Police reviewing three further incidents - including stabbing of boy, 14 - after train knife attack\n                 He was also found guilty of three counts of encouraging terrorism and two counts of possessing bomb-making instructions useful for terrorism. He will be sentenced next month. 'Real-world threat' Detective Chief Superintendent James Dunkerley, head of Counter-Terrorism Policing North East, said: \"Jordan Richardson was preparing to conduct an attack on members of the public, and to become a martyr to others who share his ideology. \"This case shows the real-world threat that terrorist content online poses, and how quickly people who view this content can radicalise themselves.\" Bethan David, from the Crown Prosecution Service, said Richardson was a \"dangerous individual\" intent on \"causing violence in the name of his ideology\". Richardson 'wanted to carry out jihad' When police searched Richardson's home, they found a combat knife in a sheath and a crossbow purchased from an online store called SuperGuns UK on 12 August for £35.95. While on remand in prison awaiting trial, Richardson told a prison officer that he was a supporter of the Islamic State. He operated Instagram accounts in his own name but later adopted the name Abu Bakr al Aziz and the username Anglo Jihadi, Leeds Crown Court was told. In online messages, Richardson said he wanted to conduct jihad and kill infidels and called himself a terrorist. In one message, he wrote: \"Inshallah, I pray to be a jihad and to be martyred for Allah.\" In October last year, Richardson said he wanted to get married and to study to become a high school teacher so that he could radicalise children. If he did not manage that, he would travel abroad to fight jihad. He wrote he had contacted a Syrian fighter on Telegram and talked about travelling to destinations, including \"Palestine, Syria and Iraq in furtherance of his extreme ideology\", according to police. Katherine Robinson, prosecuting, told the jury that \"one of the features of the defendant's mindset was that he regularly expressed a wish to kill Jews\". He converted to Islam the day after Ramadan in April last year, and his interest in Islam developed into a focus on extremism, the prosecutor said. 'Just start killing people brutally' Richardson joined the extremist group Islamic State, shared material that encouraged terrorist activity, and gave advice on how to become involved in terrorism, the prosecutor added. He stated he wanted to establish the caliphate, to fight and live under Shariah law, and shared ISIS videos featuring violence, including beheadings. Richardson also talked about the need to get weapons and discussed making 3D firearms, including how to make the metal parts with hand tools. In November, he suggested an attack on the Meadowhall shopping centre near Sheffield, one of the largest in the country, to another user. He also shared a video of the shopping centre with the graphic overlaid: \"How life feels when you finally give up and just start killing people brutally\". Read more from Sky News:Worker trapped after medieval tower collapses in RomeTrains disrupted after Glasgow-London service derails in Cumbria Ms Robinson said he was \"considering possible locations for an attack\" and \"proactively\" suggesting Meadowhall shopping centre as a target. In December, he shared a link to the ISIS bomb-making video used by the Manchester Arena bomber, showing how to make TATP, saved screenshots for the recipe on his iPhone, and looked up the ingredients of TATP, including hydrogen peroxide. Richardson also expressed homophobic views, including that LGBTQ people were a \"cancer on the country\", and shared ISIS videos threatening gay people and adding: \"Me coming to Goole Pride tomorrow - it's a joke don't worry.\" He told the court he was working at a gym in Goole and spending time looking at extremist material on his mobile phone while on reception. His mother had moved away, he had split up with his girlfriend and he would spend his time in his flat playing on his X-box games console and chat online."
    },
    {
        "title": "Worker trapped under collapsed medieval tower for 11 hours dies ",
        "description": "A man who was trapped under the rubble of a collapsed medieval tower in central Rome has died, according to local media. ",
        "url": "https://news.sky.com/story/torre-dei-conti-worker-trapped-after-medieval-tower-collapses-during-renovation-work-in-rome-13463249",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rome-italy-torre-dei-conti_7070633.jpg?20251103132241",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-03 15:49:00",
        "Headline": "Rescue efforts at the Torre dei Conti were hampered by the risk of further collapses, the emergency services said.",
        "Content": " A man who was trapped under the rubble of a collapsed medieval tower in central Rome has died, according to local media.  Crowds who gathered around the 13th-century Torre dei Conti, near the Colosseum, cheered when the man was pulled free by the emergency services on Monday evening. Crews worked into the night to free the worker, having to navigate the risk of further collapses of the structure. However, Italian news outlet Corriere della Sera reported after midnight on Tuesday that the worker had died. Italian Prime Minister Giorgia Meloni named the man as Octay Stroici in a statement after midnight, saying she \"shares deep sorrow and condolences, on behalf of myself and the government, for the tragic loss\". \"​We are close to his family and colleagues at this time of unspeakable suffering,\" she added. Another worker was seriously injured when the Torre dei Conti collapsed twice on Monday while it had been undergoing renovation work. \n                  Five mountaineers die after avalanche in Italy\n                 \n                  Prosecutors get new information about 2007 murder of Meredith Kercher in Perugia\n                 \n                  Italian anti-mafia police investigate after journalist's car explodes\n                 Italy's national fire department spokesman Luca Cari said one worker was in hospital in a critical condition, while three other workers were pulled out unharmed. Hundreds of tourists watched as firefighters used a mobile ladder to bring a stretcher to the upper level to rescue the worker from the 29-metre (95 ft) tower, where he was trapped by the first collapse, sometime before noon. But, during the attempt, another part of the structure collapsed, sending up a cloud of debris and forcing firefighters to retreat quickly. 'I saw the tower collapse' Large clouds of dust filled the area after the incidents, along with the sound of collapsing masonry, leaving the structure standing, but with significant internal damage. Gelato shop worker Queen Paglinawan, 27, said she heard the two loud noises from the town in quick succession. She said: \"I was working and then I heard some like falling, and then I saw the tower collapse in a diagonal way.\" German student Viktoria Braeu, 18, said: \"We were just at the Colosseum … and we were just walking to get some food. ... And then we were like, 'It's probably not long until it's going to go down,' and then it just started erupting.' Four firefighters later approached the first-floor window on two mobile ladders, but were quickly pulled back when dust began to rise. Drone used to see worker No firefighters were injured in the ongoing operation. A drone was then flown up to check the condition of the trapped worker. Read more on Sky News:Charges over train stabbingsCrash survivor - trauma 'broke' meTeen held on drug charges freed Torre dei Conti (Tower of the Counts) has not been used since 2006 and was being worked on as part of a four-year renovation project due to end next year, Rome city authorities said. The surrounding area was closed off to pedestrians during the work. Located on Via dei Fori Imperiali, the tower was built in 1238 by Pope Innocent III for his family and was originally twice as high, but was scaled down after damage from earthquakes in the 14th and 17th centuries."
    },
    {
        "title": "Judge rejects plea deal for funeral home owner accused of stashing nearly 190 decomposing bodies",
        "description": "A judge in Colorado has rejected a plea deal for a funeral home owner accused of storing nearly 190 decomposing bodies in a bug-infested building, after relatives of the deceased argued the proposed 15 to 20-year sentence was far too lenient.",
        "url": "https://news.sky.com/story/judge-rejects-plea-deal-for-funeral-home-owner-accused-of-stashing-nearly-190-decomposing-bodies-13463516",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-funeral-home-colorado-funeral-home_7071196.jpg?20251103224030",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-03 22:10:00",
        "Headline": "Carie Hallford and her husband, Jon, are accused of storing bodies in a bug-infested building, giving families fake ashes, and defrauding the federal government of nearly $900,000 (£684,800).",
        "Content": "A judge in Colorado has rejected a plea deal for a funeral home owner accused of storing nearly 190 decomposing bodies in a bug-infested building, after relatives of the deceased argued the proposed 15 to 20-year sentence was far too lenient. State district judge Eric Bentley said the proposed sentence \"did not adequately reflect the harm caused by these offences\", taking the unusual step of rejecting a plea agreement reached between prosecutors and the defence. Carie Hallford and her husband, Jon Hallford, ran the Return to Nature Funeral Home. They are accused of leaving dozens of bodies to decompose between 2019 and 2023 in a building in Penrose, Colorado, around 103 miles south of Denver, while giving families fake ashes.  In court on Monday, multiple family members opposed the plea deal, describing the anguish of discovering that their relatives' remains were not in the urns or ashes they had laid to rest. Tanya Wilson said her mother had been placed on a floor covered in maggots, \"leaving her mark on that floor, and leaving a permanent mark on my soul\". Samantha Naranjo said it had been hard for her \"to get excited to decorate my home with skeletons\" for Halloween, as tears choked her words, \"when all I can think of is the building that my grandmother's body lay in\". Last year, both Hallfords pleaded guilty to 191 counts of corpse abuse, and Carie Hallford's lawyer argued on Monday that the plea deal was reasonable and would provide closure. However, Judge Bentley has now rejected the plea agreements. Read more from Sky News:Worker rescued from collapsed medieval tower after 11 hours'Vile and dangerous' strangulation pornography to be banned On Monday, several family members called for Carie Hallford to receive nearly 200 years in prison, assigning roughly one year for each body found. \"We are not asking for revenge, we are asking for acknowledgment, for the court to see each victim as the human being that they were,\" said Derrick Johnson, whose mother's remains were also kept in the building. In August, authorities revealed their initial inspection of the funeral home uncovered 24 decomposing bodies hidden behind a secret door. The investigation is ongoing, with officials reporting slow progress in identifying the remains, some of which have been left unattended for more than 10 years. In addition, both Hallfords have admitted in federal court to defrauding the US Small Business Administration of nearly $900,000 (£684,800) in pandemic relief funds and accepting payments from clients for cremations that were never carried out. Authorities said the couple spent lavishly, purchasing a GMC Yukon, luxury treatments, holidays, jewellery, and cryptocurrency. After pleading guilty in federal court, Jon Hallford received a 20-year prison sentence, while Carie Hallford's federal sentencing is scheduled for December."
    },
    {
        "title": "'Vile and dangerous' strangulation pornography to be banned",
        "description": "Strangulation pornography will be banned following a review which found such images&#160;have helped to establish it as a sexual norm.",
        "url": "https://news.sky.com/story/vile-and-dangerous-strangulation-pornography-to-be-banned-13463440",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-phone-file_7071163.jpg?20251103214759",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-03 19:39:00",
        "Headline": "Non-fatal strangulation is already an offence in its own right, but it is not currently illegal to show it online.",
        "Content": "Strangulation pornography will be banned following a review which found such images have helped to establish it as a sexual norm. The possession and publication of images depicting strangulation and suffocation will be criminalised under the Crime and Policing Bill, which is currently making its way through parliament. Non-fatal strangulation is already an offence in its own right, but it is not currently illegal to show it online. Conservative peer Baroness Bertin warned earlier this year that there has been a \"total absence of government scrutiny\" of the pornography industry.  Her independent review, published in February, referred to worrying anecdotal evidence from teachers about students asking how to choke girls during sex. People acting out choking in their sex lives \"may face devastating consequences\", she said in the review. \n                  Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today\n                 \n                  Politics latest: Farage predicts early general election in 2027 due to 'economic collapse'\n                 \n                  Jeremy Corbyn reveals the number of people who have joined Your Party\n                 On Monday, the government confirmed it was putting forward amendments to the Crime and Policing Bill, which is due to come back before peers in the House of Lords for further scrutiny next week. As well as making strangulation or suffocation in pornography illegal, duties will be placed on online platforms to stop the spread of such images, the Ministry of Justice (MoJ) said. Another amendment will extend the time limit for victims of intimate image abuse, which can include so-called \"revenge porn\", to come forward to report such crimes. Currently, victims have six months to do so, but this will be extended to three years. Victims minister Alex Davies-Jones said the government \"will not stand by while women are violated online and victimised by violent pornography which is allowed to normalise harm\". She added: \"We are sending a strong message that dangerous and sexist behaviour will not be tolerated.\" Of strangulation pornography, Technology Secretary Liz Kendall said: \"Viewing and sharing this kind of material online is not only deeply distressing, it is vile and dangerous. Those who post or promote such content are contributing to a culture of violence and abuse that has no place in our society. \"We're also holding tech companies to account and making sure they stop this content before it can spread. We are determined to make sure women and girls can go online without fear of violence or exploitation.\"  The government said if the amendments were accepted, possession or publication of strangulation or suffocation in pornography would become a priority offence under the Online Safety Act. Technology firms would be legally required to take steps to stop such violent content reaching internet users, rather than simply waiting for it to be reported. The government suggested this could be done through moderation tools, stricter content policies or automated systems being used to detect and hide images. The British Board of Film Classification (BBFC) welcomed the planned changes, but said they must \"mark the beginning of broader reform to ensure parity between online and offline content standards\". Its chief executive David Austin said: \"Harmful depictions of non-consensual, violent and abusive activity continue to be readily accessible to UK users.\" The BBFC said it stands ready to take on \"the formal role of auditing online pornography\", which would be \"a natural extension of the role we have carried out offline for decades\". Bernie Ryan, chief executive of the Institute For Addressing Strangulation, welcomed the proposed ban, saying the \"serious risks posed by unregulated online content, especially to children and young people\" must be recognised. She added: \"Strangulation is a serious form of violence, often used in domestic abuse to control, silence or terrify. \"When it's portrayed in pornography, particularly without context, it can send confusing and harmful messages to young people about what is normal or acceptable in intimate relationships. Our research shows there is no safe way to strangle.\""
    },
    {
        "title": "Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today",
        "description": "Sir Keir Starmer and Rachel Reeves have hinted at tax rises to come when the chancellor delivers the budget later this month.",
        "url": "https://news.sky.com/story/starmer-and-reeves-hint-at-tax-rises-to-come-ahead-of-unusual-pre-budget-speech-today-13463353",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-keir-starmer_7071216.jpg?20251103232800",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-03 16:54:00",
        "Headline": "The chancellor will address the nation from Downing Street on Tuesday morning, weeks before she delivers her second budget. It comes amid rampant speculation she will break Labour's manifesto commitments on tax rises.",
        "Content": " Sir Keir Starmer and Rachel Reeves have hinted at tax rises to come when the chancellor delivers the budget later this month. In a Downing Street speech this morning, Ms Reeves will address \"speculation\" that an increase in income tax will be announced during the highly-anticipated statement on 26 November. Politics Hub: Follow chancellor's speech live Sky News political editor Beth Rigby said it was \"highly unusual\" for the chancellor to make such a speech, but the Treasury believes she must \"try to prepare the ground and make the argument for another big tax-raising budget\". \"I will make the choices necessary to deliver strong foundations for our economy - for this year, and years to come,\" Ms Reeves will say. Last night, Sir Keir gave Labour MPs a taste of what's to come by warning of the need for \"tough but fair\" decisions. Speaking at a party meeting in Westminster, he said the budget \"takes place against a difficult economic backdrop\". \"It's becoming clearer the long-term impact of Tory austerity, their botched Brexit deal and the pandemic on Britain's productivity is worse than even we feared,\" the prime minister said. \"Faced with that, we will make the tough but fair decisions to renew our country and build it for the long term.\" Political editor I don't need to tell you how difficult and contested this is going to be. Only a year ago, the chancellor unveiled the biggest tax-raising budget since 1993 and said it was a \"once in a parliament event\". MPs will be fearing a massive backlash should manifesto promises on not raising income tax (and VAT and national insurance) for working people be broken. Government figures know how hard it's going to be but argue the chancellor has to level with the public about the hard choices ahead and what is driving her decision-making. It comes after Sir Keir refused to confirm at Prime Minister's Questions last week that the budget would honour his party's manifesto pledge not to raise income tax, national insurance or VAT. Having raised taxes in last year's budget, notably national insurance on employers, Ms Reeves has also previously promised not to \"come back for more\" during this parliament.  The PM and chancellor's warnings come after reports suggested the Office for Budget Responsibility is expected to downgrade its productivity growth forecast for the UK by about 0.3 percentage points. That would leave Ms Reeves with a larger than expected fiscal black hole to fill, possibly up to £30bn. Read more: What taxes could rise? She is said to be considering a proposal from The Resolution Foundation, a left-leaning thinktank close to the government, to raise income tax by 2p but cut national insurance by the same amount. The thinktank, which used to be headed by Torsten Bell, a Labour MP who is now a key aide to Ms Reeves and a pensions minister, said the move would raise vital cash while protecting working people.  Reeves to prioritise NHS and cost of living Giving a further flavour of what to expect, Ms Reeves will this morning vow to make \"important choices that will shape our economy for years to come\". \"It is important that people understand the circumstances we are facing, the principles guiding my choices - and why I believe they will be the right choices for the country,\" she will add. Ms Reeves will say her priorities are cutting national debt, easing the cost of living and protecting the NHS. \"It will be a budget led by this government's values,\" she's set to say. \"Of fairness and opportunity and focused squarely on the priorities of the British people: protecting our NHS, reducing our national debt and improving the cost of living.\""
    },
    {
        "title": "How frontline workers deal with trauma of young driver deaths",
        "description": "We're sat in a silent, empty, cardiac treatment room - on the other side of the door, you can hear the bustle of the largest A&E and major trauma ward in Devon.",
        "url": "https://news.sky.com/story/how-frontline-workers-deal-with-trauma-of-young-driver-deaths-13463129",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-consultant-plymouth_7070641.jpg?20251104020537",
        "type": "UK",
        "Author": "Dan Whitehead",
        "Date Published": "2025-11-03 10:12:00",
        "Headline": "Sky News has spent the last year reporting on a long-running campaign - led by grieving families - to get the government to toughen rules on new young drivers within its Road Safety Strategy, which is set to be announced soon.",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n  We're sat in a silent, empty, cardiac treatment room - on the other side of the door, you can hear the bustle of the largest A&E and major trauma ward in Devon. Ambulances arrive, patients are wheeled on stretchers, families wait pensively. Consultant Dr Anne Hicks, from Derriford Hospital in Plymouth, is with me - she's worked in emergency care for more than 30 years. There is a long pause when I ask what the hardest part of her job is. \"I don't think it's looking after the trauma patients,\" she says. \"The toughest part is talking to the relatives. I get huge satisfaction from doing it well - but I can remember the face of every relative I think I've ever spoken to.\" She, like many of her colleagues, has had to tell the parents of teenagers killed in car crashes the worst news. \"The tragedy is nothing to what that parent feels when you tell them their child has gone. That their child has died.\" This is the so-called ripple effect - so many lives impacted by deaths on our roads, beyond the immediate family. Sky News has spent the last year reporting on a long-running campaign - led by grieving families - to get the government to toughen rules on new young drivers within its Road Safety Strategy, which is set to be announced soon. But as well as relatives, there is a whole other group impacted by deaths on Britain's roads. Emergency service workers are often the first to arrive at some of the most horrific and distressing scenes. We've been given access inside Derriford Hospital in Plymouth and Devon Air Ambulance - to understand how frontline workers deal with such trauma. Grant Thompson is a paramedic with the air ambulance team based at Exeter Airport. We're inside the medical stockroom, used to refill the chopper after each callout. He remembers a callout last summer. 'A shock to the system' \"It was one of those jobs when you're not expecting, I suppose, what you're going to see,\" he says. \"We started realising this was going to be a bad job. You started thinking, 'how are we going to split up as a team?' We got there reasonably quickly and three of these young people actually died at the scene, which was quite difficult. \"It was trying to give the best care you can for everybody - they were quite severely injured. It's always a shock to the system when you get to those jobs. It can be tricky. It can be tricky.\" Those three young deaths were among more than 1,600 on Britain's roads last year - with nearly 130,000 injured. Some 22% of those fatalities involved a young person behind the wheel. New data released by the Department for Transport also shows male drivers aged 17-24 are four times more likely to be killed or seriously injured than all drivers aged over 25. Read more from Sky News:PM and chancellor hit at tax risesThe underground squad with lives in their hands Death is one thing, life-changing injuries another. Inside the major trauma unit at Derriford, ward manager Larissa Heard says she's seen the \"whole scale\" of reaction. \"Some patients are amazingly resilient and take it really well - for others it is absolutely life-changing, and they are hysterical,\" she says. \"This could be the first time that they're actually seeing their injuries in full light. It might be the first time that they're actually aware they've had an amputation or are actually paralysed. \"So having to manage that for us can be really hard.\" 'It's only afterwards the impact hits you' As we chat, an 18-year-old who has lost a leg in a car crash pushes himself past us; staff say there are always victims of RTCs on the ward. Treating the physical and mental scars of collisions is, of course, their job. Like all those in the NHS, that responsibility comes first. \"I don't think you feel it until you get the lovely thank-you cards at the end, and you find out the patients you looked after knew your name,\" says Catie Crisp, a trainee advanced clinical practitioner. \"It's only afterwards the impact hits you: 'I can take a deep breath now, that was really hard, that was really emotional.'\" A possible solution? Like the families who lost children, emergency workers would welcome any measure that could reduce the number of young people injured and killed. Graduated driving licences (GDLs) place restrictions on new young drivers in the first few months of driving, such as a ban on driving late at night and with a car full of people - factors so often part of fatal accidents.  In Canada, one of the first countries to introduce GDLs, it takes at least 20 months to gain a full driving licence, with learners earning certain freedoms in stages. Deaths among young drivers are down 83% in the five years to 2022, compared to the same period before GDLs were brought in. For emergency consultant Dr Tim Nutbeam, introducing a similar scheme would be a step in the right direction: \"I believe in evidence informed practice and for me the evidence from Canada, from other parts of the world is really strong. I believe GDL saves lives. \"I've got four children. One of them in a couple of years will be driving. I as a parent will be making sure a similar structure to GDL is in place to try to keep her safe.\" But the Department for Transport says it is not considering them. A spokesperson told Sky News: \"Every death on our roads is a tragedy and our thoughts are with everyone who has lost a loved one in this way. \"Whilst we are not considering graduated driving licences, we absolutely recognise that young people are disproportionately victims of tragic incidents on our roads and continue to tackle this through our THINK! campaign. \"We are considering other measures to address this problem and protect young drivers, as part of our upcoming strategy for road safety - the first in over a decade.\" 'They need to reconsider' For those representing emergency service workers, the government's position must change. \"In my view, the evidence is overwhelming that they need to reconsider it,\" says Philip Secombe - the joint lead on road safety for the Association of Police and Crime Commissioners. \"We need to look at not restricting our young drivers, but actually safeguarding them, and their passengers and other road users.\" Back at the Devon Air Ambulance base, Grant explains how the ripple effect can spread far and wide. \"The loss of any life is tragic and affects a lot of people and clinicians as well, but I think when there's a young person who survives as well, they've got to walk with that for the rest of their lives, 60 odd years or whatever it'll be, that you've got to carry that with you - and more than likely it'd be one of your friends. \"I just hope that shapes people's attitudes to save driving. You know, these are my mates, my best mates in the world, in my car, I need to adapt my driving to come out safe of this.\""
    },
    {
        "title": "Police reviewing three further incidents - including stabbing of boy, 14 - after train knife attack",
        "description": "Police say they are reviewing three further incidents, including the stabbing of a 14-year-old boy, after a man appeared in court in connection with a mass knife attack on a train.",
        "url": "https://news.sky.com/story/man-32-charged-with-10-counts-of-attempted-murder-after-train-stabbings-13462394",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-huntingdon-cambridgeshire_7070443.jpg?20251103100904",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-03 13:00:00",
        "Headline": "Anthony Williams, 32, has appeared in court charged with 11 counts of attempted murder over the mass stabbing on Saturday, and another attack hours earlier at a London station.",
        "Content": " Police say they are reviewing three further incidents, including the stabbing of a 14-year-old boy, after a man appeared in court in connection with a mass knife attack on a train. Anthony Williams has been charged with 11 counts of attempted murder over Saturday's mass stabbing, and another attack hours earlier at a London station. The 32-year-old, of no fixed abode, was remanded in custody on Monday when he appeared at Peterborough Magistrates' Court. Williams has been charged with 10 counts of attempted murder, one count of actual bodily harm and one count of possession of a bladed article following the attack on the Doncaster to London King's Cross LNER service. Read more: 'Heroic' train staff commended after mass stabbing as details of victims emerge Earlier, British Transport Police (BTP) said Williams had also been charged with another count of attempted murder and possession of a bladed article in connection with an incident on a London train in the early hours of 1 November. The force said a victim suffered facial injuries after being attacked at 12.46am with a knife on a train at Pontoon Dock station on the Docklands Light Railway (DLR) in east London. The suspect had left the location before police arrived and officers subsequently identified Williams as a suspect, the force added. Meanwhile, Home Secretary Shabana Mahmood said police in Cambridgeshire were investigating whether the same man committed \"further offences\" earlier. Police there said they were looking at a series of incidents on Friday and Saturday, including one in which a teenager was stabbed. In a statement, Cambridgeshire Constabulary said a barbers in the Fletton area of Peterborough reported a man with a knife on Friday evening, and again on Saturday morning when police were not able to locate the suspect. A third incident \"that police also believe may be linked\" involved a 14-year-old who was stabbed on Friday evening by a man with a knife in the city centre, the statement added. The teenager suffered minor injuries. The force has referred itself to the police watchdog. British Transport Police will include the stabbing of the 14-year-old and the incident at the barber's shop as part of its investigation into the train attack. Armed officers were deployed to Huntingdon, Cambridgeshire, on Saturday evening where the LNER train was stopped and detained Williams within eight minutes of the first 999 call. Footage of his arrest has emerged, showing a man on the ground surrounded by officers and a barking police dog, with the sound of a Taser being deployed. Another man, also detained, was later released after officers established he was not involved. Prosecutor: Williams is 'risk' to public Williams wore a grey tracksuit when he appeared in court on Monday in handcuffs. He spoke softly to confirm his details and when asked his address, mumbled \"no fixed abode\". He was not asked to enter pleas.  Opposing bail for Williams, prosecutor Olaide Esan told the hearing: \"The defendant has attempted to murder 11 people in total. These are serious allegations. These are very serious offences. \"The defendant is a risk to the trains and to the members of the public.\" He allegedly used a \"large kitchen knife\" in both attacks, according to court documents. Read more from Sky News:Major incident declared in CumbriaBritish teen sentenced over drugs chargesAir India survivor says trauma 'broke' him The court heard Williams faces an assault charge after allegedly attacking a male police officer in custody, leaving him with a \"broken nose\", Ms Olaide said. Williams is due to appear at Cambridge Crown Court on 1 December. Transport Secretary Heidi Alexander told Sky News that BTP would be \"increasing the visible patrols at stations\" over the next few days. \"But generally, our trains are some of the most safest forms of public transport anywhere in the world,\" she added."
    },
    {
        "title": "Huntingdon train stabbing victim 'didn't have much choice' but to fight back",
        "description": "A victim of the Cambridgeshire train stabbings has spoken of the injuries he suffered as the prime minister hailed the bravery of those on board during the incident on Saturday night.",
        "url": "https://news.sky.com/story/heroic-staff-commended-after-huntingdon-train-stabbing-as-details-of-victims-emerge-13463383",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-stephen-crean-huntingdon_7070951.jpg?20251103180359",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-03 18:05:00",
        "Headline": "The football fan, who had been returning home after watching Nottingham Forest's 2-2 draw with Manchester United, says he had no chance to escape as the suspect approached.",
        "Content": "A victim of the Cambridgeshire train stabbings has spoken of the injuries he suffered as the prime minister hailed the bravery of those on board during the incident on Saturday night. Stephen Crean said he \"didn't have much choice\" but to fight back as the knifeman approached him. The 61-year-old said passengers ran into the buffet car after a young woman ran through his carriage shouting: \"Knife, knife, there's a man with a big knife.\" During the incident, Mr Crean said he \"got caught\" by the knife on his fingers, head, torso and arm, and will need plastic surgery. The football fan, who had been returning home after watching Nottingham Forest's 2-2 draw with Manchester United, said he had no chance to escape as the suspect approached. He said he managed to get into a train toilet after the confrontation. Speaking about his decision to fight back, Mr Crean said: \"Probably not many people would've done it, but then you're leaving people behind you vulnerable.\" On being described as a hero, he said: \"It's lovely that people are saying nice things about me.\" Armed officers were deployed to Huntingdon station after being alerted to the attack at 7.42pm on Saturday. They detained a man within eight minutes of the first 999 call. Read more: Police reviewing three further incidents after train attack Earlier, Sir Keir Starmer commended the \"heroic\" driver and staff and told the House of Commons on Monday the \"brave action\" of those who responded to the attack \"saved countless lives\". The prime minister told the Commons: \"I want to put on record in this House my own tribute to the police, the first responders, and in particular, to the heroic actions of both the driver and members of staff on board the Doncaster to London train, where such a vile and horrific attack took place this weekend.\" \"We all share in the revulsion of this shocking incident, but there's no doubt that their collective action, their brave action, saved countless lives, and I know the whole country is grateful for that,\" he continued. His comments came as more details emerged about some of the people injured in the mass stabbing. Home Secretary Shabana Mahmood said on Monday that there were 13 casualties, eight of whom remain in hospital. Scunthorpe United have confirmed their defender Jonathan Gjoshe was among those hurt. He is in hospital with non-life-threatening injuries. Railway worker's 'incredible bravery' One of those seriously injured was a London North Eastern Railway (LNER) staff member, who tried to protect passengers during the attack. Transport Secretary Heidi Alexander told Sky News the man, who has not been named, is now in a critical but stable condition.  She told the Mornings with Ridge and Frost programme: \"He went in to do his job, and he left work a hero. And there are people who are alive today because of his actions and his bravery.\" The train's driver has been commended for his quick thinking after diverting the locomotive to Huntingdon, Cambridgeshire, when passengers alerted him to the ongoing attack. In a statement, Andrew Johnson, who is ex-Royal Navy and has been driving trains for almost 20 years, said: \"As train drivers, we hold a lot of responsibility. \"We practise our emergency response and keep up to date with our knowledge of the route, so if needed, we know exactly where to stop and what to do. \"The action I took is the same as any other driver. I think my colleagues onboard were the real heroes and I'd like to pay tribute to their bravery.\" LNER's managing director David Horne said: \"Andrew's actions are testament to the expertise and skills he has built over his career, both on the railway and in the military.\" He added: \"Our thoughts remain with our colleague in hospital.\" Read more from Sky News:Air India survivor says trauma 'broke' himMan in court over Westminster blackmail allegation Anthony Williams, 32, has been charged with 10 counts of attempted murder over the mass stabbing, and one count of attempted murder over another attack hours earlier at a London station."
    },
    {
        "title": "'Vile and dangerous' strangulation pornography to be banned",
        "description": "Strangulation pornography will be banned following a review which found such images&#160;have helped to establish it as a sexual norm.",
        "url": "https://news.sky.com/story/vile-and-dangerous-strangulation-pornography-to-be-banned-13463440",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-phone-file_7071163.jpg?20251103214759",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-03 19:39:00",
        "Headline": "Non-fatal strangulation is already an offence in its own right, but it is not currently illegal to show it online.",
        "Content": "Strangulation pornography will be banned following a review which found such images have helped to establish it as a sexual norm. The possession and publication of images depicting strangulation and suffocation will be criminalised under the Crime and Policing Bill, which is currently making its way through parliament. Non-fatal strangulation is already an offence in its own right, but it is not currently illegal to show it online. Conservative peer Baroness Bertin warned earlier this year that there has been a \"total absence of government scrutiny\" of the pornography industry.  Her independent review, published in February, referred to worrying anecdotal evidence from teachers about students asking how to choke girls during sex. People acting out choking in their sex lives \"may face devastating consequences\", she said in the review. \n                  Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today\n                 \n                  Politics latest: Farage predicts early general election in 2027 due to 'economic collapse'\n                 \n                  Jeremy Corbyn reveals the number of people who have joined Your Party\n                 On Monday, the government confirmed it was putting forward amendments to the Crime and Policing Bill, which is due to come back before peers in the House of Lords for further scrutiny next week. As well as making strangulation or suffocation in pornography illegal, duties will be placed on online platforms to stop the spread of such images, the Ministry of Justice (MoJ) said. Another amendment will extend the time limit for victims of intimate image abuse, which can include so-called \"revenge porn\", to come forward to report such crimes. Currently, victims have six months to do so, but this will be extended to three years. Victims minister Alex Davies-Jones said the government \"will not stand by while women are violated online and victimised by violent pornography which is allowed to normalise harm\". She added: \"We are sending a strong message that dangerous and sexist behaviour will not be tolerated.\" Of strangulation pornography, Technology Secretary Liz Kendall said: \"Viewing and sharing this kind of material online is not only deeply distressing, it is vile and dangerous. Those who post or promote such content are contributing to a culture of violence and abuse that has no place in our society. \"We're also holding tech companies to account and making sure they stop this content before it can spread. We are determined to make sure women and girls can go online without fear of violence or exploitation.\"  The government said if the amendments were accepted, possession or publication of strangulation or suffocation in pornography would become a priority offence under the Online Safety Act. Technology firms would be legally required to take steps to stop such violent content reaching internet users, rather than simply waiting for it to be reported. The government suggested this could be done through moderation tools, stricter content policies or automated systems being used to detect and hide images. The British Board of Film Classification (BBFC) welcomed the planned changes, but said they must \"mark the beginning of broader reform to ensure parity between online and offline content standards\". Its chief executive David Austin said: \"Harmful depictions of non-consensual, violent and abusive activity continue to be readily accessible to UK users.\" The BBFC said it stands ready to take on \"the formal role of auditing online pornography\", which would be \"a natural extension of the role we have carried out offline for decades\". Bernie Ryan, chief executive of the Institute For Addressing Strangulation, welcomed the proposed ban, saying the \"serious risks posed by unregulated online content, especially to children and young people\" must be recognised. She added: \"Strangulation is a serious form of violence, often used in domestic abuse to control, silence or terrify. \"When it's portrayed in pornography, particularly without context, it can send confusing and harmful messages to young people about what is normal or acceptable in intimate relationships. Our research shows there is no safe way to strangle.\""
    },
    {
        "title": "Jeremy Corbyn reveals the number of people who have joined Your Party",
        "description": "Your Party membership stands at 50,000, Sky News can reveal.",
        "url": "https://news.sky.com/story/jeremy-corbyn-reveals-the-number-of-people-who-have-joined-your-party-13463413",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-zarah-sultana-jeremy-corbyn_7047994.jpg?20251024151019",
        "type": "UK",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-11-03 18:58:00",
        "Headline": "Insiders fear that factional infighting has spurred members into joining the rival Green Party, led by Zack Polanksi.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n Your Party membership stands at 50,000, Sky News can reveal. The figure is well short of the 800,000 people who expressed interest when it launched, and it is significantly below the 100,000 to 200,000 insiders hoped would join officially as members following its launch in July. It puts the Zarah Sultana and Jeremy Corbyn-led party close behind the Liberal Democrats, whose membership has fallen to 60,000. Politics latest: Farage predicts early general election in 2027  While still deemed to be respectable to those involved in the party, the membership update has been taken as a warning that the factional infighting between Ms Sultana and Mr Corbyn has damaged its hopes of immediately building a mass movement. However, Your Party said it expects membership to increase as more members move over from the \"unauthorised\" membership portal launched by Ms Sultana on 18 September. Tensions between the two leaders reached a boiling point when Ms Sultana sent out unauthorised emails encouraging paid membership without Mr Corbyn's consent - while also claiming her actions were the result of being sidelined by a \"sexist boys club\". Mr Corbyn is expected to announce the 50,000 figure at a rally in Islington on Monday evening. He said: \"I am excited to announce that 50,000 people have now become members of Your Party. \"This major milestone reflects what Your Party is all about: a mass, democratic movement for change. From local rallies to mass regional assemblies, people up and down the country are coming together to build this party from the ground up. \"This is just the beginning. At the end of this month, we will host our founding conference. This will be the moment that members come together to launch our mass, democratic movement for real change.\" Ms Sultana's decision to launch her own membership portal in September culminated in a standoff over the control of £800,000 worth of donations, which has only just been resolved. The pot of money had been held by an entity called MOU operations - controlled by former Labour MP Beth Winter, former Labour mayor Jamie Driscoll and former South African politician Andrew Feinstein - who have now all quit. Sky News revealed last week that Ms Sultana now had sole control of the £800,000 and that she has assured Mr Corbyn that the money will be transferred to the party as a whole. It is understood the money has not yet been transferred in full. The money collected by MOU in membership fees is not expected to be transferred to Your Party as those who paid are entitled to a refund. Some 20,000 people signed up to Ms Sultana's portal but Your Party still does not have access to their emails, meaning there is no way of contacting them.  There are concerns within Your Party that the direct beneficiary of the row has been the Greens, led by Zack Polanski, whose membership has more than doubled to 150,000 people. Following the publication of the figures, Mr Polanski described the Greens as the \"only real opposition left in British politics\". Pointing to the threat he also poses to the Labour Party, which has slumped to 17 points in the polls, Mr Polanski said his desire was not to be \"disappointed\" with Labour but to \"replace them\". According to Labour's annual accounts published in August, party membership now stands at 333,235 - down from a peak of 532,046 at the end of 2019, when Mr Corbyn was still Labour leader. However, Sir Keir Starmer still leads the largest party in the UK. Read more:Inside Jeremy Corbyn's new party and the battle for leadershipThe battle for Your Party's soul continues As of August this year, the Conservatives were reported to have 123,000 members, while their rivals Reform have 266,172. In recent weeks, Ms Sultana - who has spoken favourably about some form of electoral pact with the Greens - has sought to draw clearer dividing lines with Mr Polanski. In a recent interview with Politics Joe, the Coventry South MP described Your Party as \"anti-Zionist\" and also suggested the UK should leave the military alliance NATO immediately. Mr Polanski, who is Jewish, has said he is proud of his identity but that he does not describe himself as a Zionist. He has also taken a more cautious stance on NATO than Ms Sultana, saying that while he supported the UK's eventual withdrawal he was not advocating for it to leave the alliance."
    },
    {
        "title": "Pregnant British teenager held on drugs charges freed from Georgian jail ",
        "description": "A pregnant British teenager has been released from jail in Georgia after being held on drug smuggling charges.",
        "url": "https://news.sky.com/story/pregnant-british-teenager-held-on-drugs-charges-freed-from-georgian-jail-13463070",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-bella-culley-georgia_7070515.jpg?20251103105607",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-03 10:09:00",
        "Headline": "Asked how she felt, Bella May Culley said she was \"happy\" and told reporters that she did not expect to be released.",
        "Content": " A pregnant British teenager has been released from jail in Georgia after being held on drug smuggling charges. Bella May Culley, 19, of Billingham, County Durham, was arrested in May at Tbilisi Airport and accused of attempting to smuggle 12kg of marijuana and 2kg of hashish into the country. She was found guilty by a Georgian court on Monday and sentenced to five months and 25 days in prison, the total time she had already spent in custody. Her family also paid a 500,000 lari (about £138,000) as part of a plea deal aimed at reducing her sentence. Culley and her mother, Lyanne Kennedy, both cried as the verdict was read. Wearing a cream blazer, the teenager looked overwhelmed as she was released from custody on Monday. Asked how she felt, she said she was \"happy\" and told reporters she did not expect to be freed. Culley's mother held her daughter's hand as she was released. Georgian prosecutors were considering a two-year sentence, but \"decided to consider the time she has already served,\" case prosecutor Vakhtang Tsalughelashvili told The Associated Press. Culley's lawyer, Malkhaz Salakhaia, said she would be given her passport and would be free to leave the country on Monday.  The teenager pleaded not guilty to the charges after her arrest, saying she was tortured in Thailand and forced to carry the drugs. Culley initially pleaded not guilty at a hearing in July to possession and trafficking illegal drugs. She initially faced a maximum penalty of up to 15 years or life imprisonment, but was in talks with prosecutors about a potential plea bargain. Read more from Sky News:Mexican mayor killed during Day Of The Dead festivitiesAt least 20 dead after magnitude 6.3 earthquake in Afghanistan In Georgia, a nation of 3.7 million in the South Caucasus, the law allows for financial plea agreements that can be reached to reduce or eliminate a prison sentence in certain cases. Such plea agreements are often obtained in drug-related cases. Culley was reported missing in Thailand before her arrest at Tbilisi Airport on 10 May."
    },
    {
        "title": "Joey Barton 'crossed line between free speech and crime' with X posts, jury hears",
        "description": "Joey Barton \"crossed the line between free speech and a crime\" with social media posts about broadcaster Jeremy Vine and female sports pundits Eni Aluko and Lucy Ward, a jury has heard.",
        "url": "https://news.sky.com/story/joey-barton-crossed-line-between-free-speech-and-crime-with-x-posts-aimed-at-tv-star-and-sports-pundits-court-hears-13463472",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-joey-barton_7071128.jpg?20251103205201",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-03 20:45:00",
        "Headline": "The former Manchester City player shared a number of posts, including likening two female football commentators to Fred and Rose West.",
        "Content": "Joey Barton \"crossed the line between free speech and a crime\" with social media posts about broadcaster Jeremy Vine and female sports pundits Eni Aluko and Lucy Ward, a jury has heard. The former footballer is on trial at Liverpool Crown Court and stands accused of 12 counts of sending a grossly offensive electronic communication with intent to cause distress or anxiety. The charges relate to a series of posts the 43-year-old made on social media site X between January and March last year. The prosecution told the jurors that Barton had more than two million followers on X and that his comments on the platform \"may well be characterised as cutting, caustic, controversial and forthright\". Peter Wright KC said: \"Some may even consider some of them humorous. \"Everyone is entitled to express views that are all of those things.\" He continued: \"What someone is not entitled to do is to post communications electronically that are - applying those standards - beyond the pale of what is tolerable in society.\" Barton, from Widnes, Cheshire, denies the allegations. What did Joey Barton post on X? Following a televised FA Cup tie, the former Manchester City player likened Aluko and Ward to the \"Fred and Rose West of commentary\" and said the former was \"only there to tick boxes\". The court heard Barton later posted an image of the serial killers with the pundits' faces superimposed on to them and said: \"We've established they cannot take a joke and understand metaphors. So, I'll leave you with this.\" In a separate post, he said of Aluko: \"She's clearly in the Joseph Stalin/Pol Pot category... She's murdered hundreds of thousands if not millions of football ears in the last few years.\" Read more from Sky News:'Heroic' train staff praised for stabbing response'Anglo Jihadi' guilty of planning shopping centre attack The jury heard TV and radio presenter Vine responded to Barton's comparisons by posting on X: \"What's going on with @Joey7Barton ? I just glanced at the Rose West thing ... genuinely, is it possible we are dealing with a brain injury here? \"A brain injury can cause changes to a person's character, eg disinhibition, anti-social behaviour. I sincerely hope he is okay.\" Prosecutor Mr Wright told the jury: \"The defendant did not read these interventions as an expression of concern for his wellbeing, but rather as an insult. \"He sent a post to Jeremy Vine's X account in which he referred to him as 'you big bike nonce'.\" The court was told Barton later replied to a post in which Vine had celebrated the birthdate of Elvis Presley by writing: \"Elvis was a Nonce As well. Priscilla was underage and Elvis has a history of that kind of thing.\" Mr Wright told jurors: \"We say this defamatory, frankly puerile and infantile behaviour by a grown man in respect of these people was, and is, beyond the pale of what is tolerable in society and therefore characterised as criminal.\""
    },
    {
        "title": "Self-styled 'Anglo Jihadi' guilty of planning attack on shopping centre",
        "description": "A gym instructor who called himself the \"Anglo Jihadi\" has been found guilty of planning a bomb and chemical attack on a major shopping centre.",
        "url": "https://news.sky.com/story/self-styled-anglo-jihadi-guilty-of-planning-attack-on-shopping-centre-13463365",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-leeds-crown-jordan-richardson_7070772.jpg?20251103151344",
        "type": "UK",
        "Author": "Duncan Gardham, security journalist",
        "Date Published": "2025-11-03 17:24:00",
        "Headline": "Jordan Richardson, 21, from Howden, East Yorkshire, was convicted after police found a handwritten note with instructions on how to make mustard gas.",
        "Content": "By Duncan Gardham, security journalist  A gym instructor who called himself the \"Anglo Jihadi\" has been found guilty of planning a bomb and chemical attack on a major shopping centre. Jordan Richardson, 21, a Muslim convert from Howden, East Yorkshire, was convicted after he was caught carrying around a recipe for mustard gas in his rucksack. Richardson also had a link to an ISIS bomb-making video used by the Manchester Arena bomber, showing how to make the high explosive TATP. He was arrested on his way to work in nearby Goole on 19 December last year, carrying a backpack containing handwritten notes on pieces of notepaper. One read: \"Reach hidden vantage point, apply gas mask, outfit, load crossbow, throw all grenades into crowd, shoot bystanders, stab anyone who come close, do not get taken alive.\" A second note contained the ingredients and instructions on how to make mustard gas, a chemical warfare blister agent that can be fatal if inhaled. Richardson was found guilty of preparing acts of terrorism by acquiring weapons, researching explosive substances, identifying possible locations, and considering the steps required for an attack. \n                  Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today\n                 \n                  How frontline workers deal with trauma of young driver deaths\n                 \n                  Police reviewing three further incidents - including stabbing of boy, 14 - after train knife attack\n                 He was also found guilty of three counts of encouraging terrorism and two counts of possessing bomb-making instructions useful for terrorism. He will be sentenced next month. 'Real-world threat' Detective Chief Superintendent James Dunkerley, head of Counter-Terrorism Policing North East, said: \"Jordan Richardson was preparing to conduct an attack on members of the public, and to become a martyr to others who share his ideology. \"This case shows the real-world threat that terrorist content online poses, and how quickly people who view this content can radicalise themselves.\" Bethan David, from the Crown Prosecution Service, said Richardson was a \"dangerous individual\" intent on \"causing violence in the name of his ideology\". Richardson 'wanted to carry out jihad' When police searched Richardson's home, they found a combat knife in a sheath and a crossbow purchased from an online store called SuperGuns UK on 12 August for £35.95. While on remand in prison awaiting trial, Richardson told a prison officer that he was a supporter of the Islamic State. He operated Instagram accounts in his own name but later adopted the name Abu Bakr al Aziz and the username Anglo Jihadi, Leeds Crown Court was told. In online messages, Richardson said he wanted to conduct jihad and kill infidels and called himself a terrorist. In one message, he wrote: \"Inshallah, I pray to be a jihad and to be martyred for Allah.\" In October last year, Richardson said he wanted to get married and to study to become a high school teacher so that he could radicalise children. If he did not manage that, he would travel abroad to fight jihad. He wrote he had contacted a Syrian fighter on Telegram and talked about travelling to destinations, including \"Palestine, Syria and Iraq in furtherance of his extreme ideology\", according to police. Katherine Robinson, prosecuting, told the jury that \"one of the features of the defendant's mindset was that he regularly expressed a wish to kill Jews\". He converted to Islam the day after Ramadan in April last year, and his interest in Islam developed into a focus on extremism, the prosecutor said. 'Just start killing people brutally' Richardson joined the extremist group Islamic State, shared material that encouraged terrorist activity, and gave advice on how to become involved in terrorism, the prosecutor added. He stated he wanted to establish the caliphate, to fight and live under Shariah law, and shared ISIS videos featuring violence, including beheadings. Richardson also talked about the need to get weapons and discussed making 3D firearms, including how to make the metal parts with hand tools. In November, he suggested an attack on the Meadowhall shopping centre near Sheffield, one of the largest in the country, to another user. He also shared a video of the shopping centre with the graphic overlaid: \"How life feels when you finally give up and just start killing people brutally\". Read more from Sky News:Worker trapped after medieval tower collapses in RomeTrains disrupted after Glasgow-London service derails in Cumbria Ms Robinson said he was \"considering possible locations for an attack\" and \"proactively\" suggesting Meadowhall shopping centre as a target. In December, he shared a link to the ISIS bomb-making video used by the Manchester Arena bomber, showing how to make TATP, saved screenshots for the recipe on his iPhone, and looked up the ingredients of TATP, including hydrogen peroxide. Richardson also expressed homophobic views, including that LGBTQ people were a \"cancer on the country\", and shared ISIS videos threatening gay people and adding: \"Me coming to Goole Pride tomorrow - it's a joke don't worry.\" He told the court he was working at a gym in Goole and spending time looking at extremist material on his mobile phone while on reception. His mother had moved away, he had split up with his girlfriend and he would spend his time in his flat playing on his X-box games console and chat online."
    },
    {
        "title": "Woman 'tormented' Madeleine McCann's parents in stalking campaign, court told",
        "description": "A woman who falsely claimed to be Madeleine McCann is very manipulative and \"tormented\" the missing girl's parents during a stalking campaign, a prosecutor has said.&#160;",
        "url": "https://news.sky.com/story/woman-tormented-madeleine-mccanns-parents-in-stalking-campaign-court-told-13463450",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-julia-wandelt-madeleine-mccann_7044386.jpg?20251006193949",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-03 19:44:00",
        "Headline": "Julia Wandelt, 24, from southwest Poland, and her co-defendant Karen Spragg, 61, from Cardiff, both deny one count of stalking. ",
        "Content": "A woman who falsely claimed to be Madeleine McCann is very manipulative and \"tormented\" the missing girl's parents during a stalking campaign, a prosecutor has said.  Julia Wandelt, 24, from southwest Poland, is on trial at Leicester Crown Court along with Karen Spragg, 61, from Cardiff, accused of one count of stalking the McCann family by calling and messaging them and turning up at their home. In his closing statement to the jury on Monday, Crown counsel Michael Duck KC said Wandelt and Spragg were involved in \"cruel and unforgiving\" stalking despite knowing their actions were wrong. As it happened: McCann's alleged stalker confronts parents at family home \"This case is about Julia Wandelt and Karen Spragg, individually and subsequently as a team, causing very significant distress to Kate and Gerry McCann,\" Mr Duck said. The British couple's daughter disappeared aged three during a family holiday in Portugal in 2007. The defendants were \"tormenting the McCanns over a period of time,\" including a visit to their family home last December, he said, adding that comments they made outside the property showed Spragg \"was not just a hanger-on but an enthusiastic encourager of what was taking place\". \n                  Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today\n                 \n                  How frontline workers deal with trauma of young driver deaths\n                 \n                  Police reviewing three further incidents - including stabbing of boy, 14 - after train knife attack\n                 \"It demonstrates that these two defendants simply wanted to impose their will on the McCanns,\" Mr Duck said. \"They cared only about their own agenda. They knew what they were doing was wrong.\" Distress was 'blindingly obvious' Mr Duck told the jury it was \"blindingly obvious\" that distress had been caused to the McCanns - the charge the defendants face - as Wandelt and Spragg had co-authored a letter delivered to the family apologising to Mrs McCann \"for causing you so much distress\". \"I am going to suggest, and I don't apologise for it, that they each were manipulative and capable of being so, and determined in the manner in which they achieved their aims,\" he said. Mr Duck emphasised that there was never any evidence to support Wandelt's claim that she was Madeleine. \"Julia Wandelt sought to persuade herself and others that she was Madeleine McCann,\" Mr Duck continued. \"But when you actually analyse the evidence, that's based on nothing other than her own assertions.\" Read more from Sky News:Man who died in knife attack was stabbed 14 timesPregnant British teenager held on drugs charges freed from jail Wandelt briefly left the dock during Mr Duck's remarks after becoming upset. She told the court last week that she \"didn't care anymore\" when the lack of scientific evidence linking her to the McCanns was pointed out. Spragg has decided not to give evidence. Trial judge Mrs Justice Cutts instructed the jurors on Monday to put aside any feelings of sympathy they might have for the McCanns, the defendants, or both. \"Emotion of any kind does not assist in deciding whether the allegation against each defendant is satisfactorily proved,\" she said. Wandelt and Spragg both deny one count of stalking and the trial continues."
    },
    {
        "title": "Thousands targeted in 'killing fields' around Sudanese city in paramilitary group's hands",
        "description": "Thousands who fled a key frontline city in Sudan's war as it fell to paramilitaries were targeted in killing fields around it by the group, after the military's top brass secured their own safe passage.",
        "url": "https://news.sky.com/story/tens-of-thousands-missing-in-killing-fields-around-city-in-hands-of-sudans-paramilitary-group-13463324",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sudan-yousra-graphic_7070938.png?20251103174650",
        "type": "World",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-11-03 16:03:00",
        "Headline": "A Sky News joint investigation with Sudan War Monitor and Lighthouse Reports reveals the harrowing fate of civilians and soldiers who fled Al Fashir in the hours after senior commanders and officers left the infantry division.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  Thousands who fled a key frontline city in Sudan's war as it fell to paramilitaries were targeted in killing fields around it by the group, after the military's top brass secured their own safe passage. Warning: Some readers may find content in this article distressing. More than 60,000 people are still missing and humanitarians fear that Al Fashir's remaining 200,000 residents are being held hostage by Rapid Support Forces (RSF) fighters. In our investigation with Sudan War Monitor and Lighthouse Reports, we can reveal the harrowing fate of civilians and soldiers who fled the city in the hours after senior commanders and officers left the infantry division. Some 70,000 people have escaped Al Fashir since it was captured on 26 October, according to the DTM matrix of the International Organisation for Migration (IOM), but fewer than 10,000 people are accounted for in the nearest safe displacement zones. In an effort to track down the missing, we analysed dozens of videos and followed crowds of civilians on their way out. In this first video, we see a group, and two men - the first with a yellow hoodie and black jacket walking beside a dirt berm along with women and children. In a later video, we see a crowd of captives that includes the two men - in the same yellow hoodie and red turban. A video of men sitting on the ground under RSF armed guard shows the women walking through freely, showing they had been separated. In another video, we see the man in a red turban in a queue of men who start to run as RSF fighters chase and beat them. A source on the ground told us that this single group had around 2,000 captives and only 200 of them arrived at the nearest displacement shelter in Tawila, around 45 miles from Al Fashir. We geolocated one of the videos of the group walking approximately 5km (three miles) from the nearby town of Geurnei. There, hundreds were rounded up in school buildings. 'They would execute people in front of us' The families of doctors held there told Sky News the RSF asked them to pay ransoms to secure their release. A man who survived captivity in Geurnei with his wife told us he was held with around 300-400 families after being robbed and harassed on his way out of Al Fashir. \"We got to the school and they caught up with us. They starting targeting people - elderly and young - and took them to be detained,\" said Abdelhamid. \"They would select people and execute them in front of us and then say - 'bury your brother' - and we would cover them with soil. I saw them kill 18 people with my own eyes and then people had to bury them with their bare hands.\" Satellite images from 30 October show mounds of dirt that appear to be new graves added to an existing cemetery, near school buildings in Geurnei. Read more:UAE is 'main backer' behind Sudan war - intelligence officerTens of thousands killed in two days in Sudan city, analysts believe Others were executed in the fields outside of Al Fashir. In a video shared on social media, a vehicle is shown pursuing civilians in the countryside. The driver films as two fighters, one in an RSF patch, stop an unarmed man. One asks what the man is carrying, and shoots him at point-blank range. The car continues forward, accelerating towards and narrowly avoiding two unarmed men. He asks one man if he is carrying anything and says he is \"acting as if you are Arab\". After the driver says \"kill them all\", the camera turns back to the man, who appears to have been shot. The driver then urges those with him to hurry to catch up with those ahead. This brutality comes after the RSF encircled, starved and shelled Al Fashir for 18 months in their battle with the military for the last regional capital in Darfur under state control. Several high-level sources told us that top state commanders, officers and political leaders made arrangements for their own safe passage in over 100 vehicles, including some armoured cars, before the 6th infantry division was captured by the RSF in the morning hours of 26 October. Earlier this year, Al Fashir was being suffocated to death by the paramilitary Rapid Support Forces (RSF) as they pushed to claim full control of the Darfur region as a base for their parallel government, after the military recaptured the capital Khartoum and other key sites in central Sudan.  On Monday, famine conditions were confirmed in Al Fashir and Kadugli, another besieged city in Sudan's south, by the UN-backed Integrated Food Security Phase Classification (IPC). Inside Al Fashir, thousands were bombarded by almost daily shelling from surrounding RSF troops. The RSF physically reinforced their siege with a berm – a raised earth mound. First spotted by Yale Humanitarian Research Lab, the berm is visible from space.    The Sudan war started in April 2023, when long-simmering tensions between the Sudanese army and the RSF broke out in Khartoum. The US special envoy to Sudan estimates that 150,000 have been killed, but the exact figure is unknown. Close to 12 million people have been displaced. After 18 months of surviving forced starvation and shelling, the regional capital and symbolic battleground of Al Fashir fell to the RSF at the end of October. What does the head of the SAF say? The commander in chief of the Sudanese Armed Forces (SAF) Abdel Fattah Al Burhan has said the withdrawal was to spare the city from further destruction, indiscriminate shelling and drone attacks. In response to our findings, he told Sky News: \"The decision to withdraw was unanimous among the armed forces, regular forces, and the joint security committee. \"The withdrawal began with an attack by drones on forces blocking one of the crossings, destroying their positions. \"Later, the forces fought until they broke through the barrier and moved to a location outside the city. \"During the withdrawal, the forces lost more than 300 martyrs, and most of their vehicles were destroyed. They remain besieged. \"They did not leave soldiers behind. Those who remained were tasked with securing the withdrawal, and they performed their duty as required.\" But instead of a co-ordinated withdrawal, a soldier left behind describes an abandoned command. 'They completely abandoned us' \"The division commander had left the garrison. They completely abandoned us and we were suddenly surrounded 26 to 1 in the morning hours. Suddenly, everything collapsed on us in the defence. We asked what was going on and were told everyone fled,\" he said. \"Shortly after, bombs started falling on us. Brigadier General Adam, the artillery commander, refused to withdraw, saying that the division commander had already withdrawn without informing him of the order. The brigadier general, six colonels, and a naval colonel were also captured.\" Testimony from a civilian who fled that morning paints a picture of chaos. He said: \"There was no co-ordination over withdrawal, and it seemed to be a surprise to the remaining fighters on the frontline. Some were leaving the city and others were fighting battles with the RSF.\" As the RSF entered Al Fashir, he told us civilians were massacred. \"The streets were covered in bodies. I saw it for myself. The RSF came into the city and butchered everyone they found. They did not discern between a child, a civilian or the elderly - they executed everyone, a full genocide.\" High-resolution satellite imagery captured by Vantor shows burnt vehicles grouped together south of the berm the RSF built to besiege Al Fashir. A video we located at the site shows dozens of bodies, in fatigues and civilian clothing, lying lifeless on the ground by burning cars. Mounting concern over 200,000 people Fears are mounting over the fate of around 200,000 people left in Al Fashir. A top RSF commander with knowledge of the operations in the city told us that at least 7,000 people have been killed in Al Fashir in the first five days of capture. He said RSF fighters systemically targeted civilians from non-Arab tribes and killed groups of 300 to 400 people in some areas. Civilian sources close to the RSF corroborated his death toll, which we cannot independently verify on the ground. Al Fashir is in a complete telecommunications blackout. The United Nations Office for the Coordination of Humanitarian Affairs (UNOCHA) in Sudan has shared in a post on X that their \"Humanitarian partners in Sudan are being blocked from reaching A Fashir, North Darfur. \"Civilians are trapped inside, their condition unknown. Aid workers are ready to deliver life-saving support. Access needs to be granted now, in line with international humanitarian law.\" The RSF has circulated videos on its social media channels showing trucks delivering aid to Al Fashir's emaciated civilians. This comes after months of volunteers and aid workers being killed by RSF fighters while trying to bring in relief during their 18-month siege of enforced starvation and relentless shelling. What does the RSF say? The spokesperson for the RSF's political administration TASIS, Dr Alaa Nugud, told Sky News that there is a big fake media campaign prepared for the \"Al Fashir liberation\" and denounced the death toll of at least 7,000, shared by one of their top commanders, as \"totally rubbish\". In response to our report, he said: \"Never happened that TASIS forces or any of its constituents killed civilians based on ethnic background, on the other hand this is what was done by SAF and the Muslim brotherhood National Congress Party doctrine during their 39 years of rule. \"SAF's military intelligence was igniting these ethnic clashes throughout years they used religion to flame war in south Sudan and used racism and ethnicity to ignite war in Darfur.\" He added that \"RSF and TASIS forces evacuated more than 800,000 civilians outside Al Fashir\". \"Could they not provide or grant safe passage to civilians? The reality is that the insurance of the continuation of the war and spoiling of all peace platforms… the continuation of this war is the main cause of all atrocities. \"The atrocities are consequences of this war, not the cause of the war. So to stop all these atrocities we have to stop the war and this is not there in SAF agenda.\" The RSF is accused of committing war crimes and crimes against humanity across Sudan since the war started in April 2023. The Biden administration accused the RSF of committing genocide in Darfur in 2024, two decades after the group was first accused of genocide in the region as the Janjaweed. Our previous reporting on Sky News has supported allegations that the UAE militarily supports the RSF, though the country officially denies it. Additional reporting by Mohamed Zakarea, Sam Doak, Annoa Abekah-Mensah, Aziz Al Nour, Julia Steers, Jack Sapoch, and Klaas van Dijken. This story was a joint Sky News data and forensics investigation with Sudan War Monitor and Lighthouse Reports. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Israeli military's former top lawyer arrested",
        "description": "Israel's former top military lawyer has been arrested after admitting leaking a video of soldiers allegedly abusing a Palestinian prisoner.",
        "url": "https://news.sky.com/story/israeli-militarys-former-top-lawyer-arrested-over-leaked-video-as-bodies-of-45-palestinians-handed-over-13463216",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-yifat-tomer-yerushalmi_7070646.jpg?20251103123523",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-03 11:33:00",
        "Headline": "Ex-military advocate Major General Yifat Tomer-Yerushalmi was said to have been taken into custody after a search for her whereabouts amid fears for her safety.",
        "Content": "Israel's former top military lawyer has been arrested after admitting leaking a video of soldiers allegedly abusing a Palestinian prisoner. The growing scandal comes as Israel handed over the bodies of 45 Palestinians, according to health officials in Gaza. An Israeli official said ex-military advocate Major General Yifat Tomer-Yerushalmi was taken into custody overnight on Sunday - just a few days after resigning from her post, reported the Associated Press news agency. She was arrested when a search was carried out along the Tel Aviv beach after concerns for her safety were raised by her family, reported Israel's Channel 12. Former chief military prosecutor Colonel Matan Solomesh was also arrested overnight as part of the investigation into the leaked video, reported Israel's Army Radio. The leaked footage was aired last year purporting to show an incident involving soldiers and a Palestinian prisoner at the Sde Teiman detention facility in southern Israel. The developments came as the bodies of the Palestinians were received at Nasser Hospital, in Gaza, on Monday morning, a Gaza health ministry spokesperson told the Associated Press. The release of the bodies came a day after Israel said Hamas had handed over the remains of three Israeli troops taken hostage on 7 October 2023. Israel said the troops were killed in the attack on southern Israel before their bodies were dragged by militants back to Gaza. A Hamas statement said the remains were found on Sunday in a tunnel in southern Gaza. The three troops have been identified as Captain Omer Neutra, an American-Israeli, Staff Sergeant Oz Daniel and Colonel Assaf Hamami, according to the office of Israeli Prime Minister Benjamin Netanyahu. Since the ceasefire started on 10 October, Palestinian militants have released the remains of 20 hostages, with eight now remaining in Gaza. Hamas has released one or two bodies every few days.  Israel has demanded faster progress and, in some cases, has said the remains were not those of any hostage. Hamas has said the work to return the bodies has been complicated by the widespread devastation in Gaza. Israel has been releasing the remains of 15 Palestinians for each hostage returned. Health officials in Gaza have struggled to identify bodies without access to DNA kits. Read more from Sky News:Train 'struck a landslide' before derailment in CumbriaTwo Louvre heist suspects 'convicted over theft in 2015'  Only 75 of the 225 Palestinian bodies returned since the ceasefire began have been identified, according to Gaza's health ministry. About 1,200 people were killed and 251 kidnapped in the Hamas terror attack that sparked the war two years ago. Officials in Hamas-run Gaza say more than 68,600 Palestinians have died."
    },
    {
        "title": "Only survivor of Air India Flight 171 crash tells Sky News the trauma 'broke' him",
        "description": "The only survivor of the Air India crash has told Sky News he has been \"broken down\" by the trauma.",
        "url": "https://news.sky.com/story/sole-survivor-of-air-india-crash-tells-sky-news-the-trauma-broke-him-13460691",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ahmedabad-plane-crash_6944966.jpg?20250618101311",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-03 06:00:00",
        "Headline": "Briton Viswashkumar Ramesh was the only person to walk away from the crash in Ahmedabad, Gujarat, in June, with his younger brother among the victims. His representatives say Air India's compensation payment doesn't \"touch the sides\" of his needs. ",
        "Content": " The only survivor of the Air India crash has told Sky News he has been \"broken down\" by the trauma. Air India Flight 171 crashed into a building, killing 241 people on board, just after take-off in Ahmedabad, Gujarat, on 12 June, with Briton Viswashkumar Ramesh the only passenger who walked away from the wreckage. In an interview with Sophy Ridge on the new Mornings with Ridge and Frost programme, Mr Ramesh faltered, stumbled and regularly lapsed into long silence as he tried to recall the day. Warning: This article contains details some may find distressing Mr Ramesh, 40, was in the now-fabled seat 11a, which was located next to an emergency door that he managed to climb out of after the Boeing 787 Dreamliner crashed. His younger brother, Ajaykumar, seated in a different row on the plane, could not escape. Months on, Mr Ramesh wanted to share the impact of that day in an attempt to try to regain control of his life - and to pressure Air India into addressing the catastrophic effect of the crash on him and his family. But it is clearly traumatic to talk about. \"It's very painful talking about the plane,\" he says softly. Asked by Ridge if he can speak about what happened on board, he falls silent. Just after the crash, from his hospital bed, Mr Ramesh told cable news channel DD India \"there were bodies all around me\" when he stood up after the crash. A further 19 people had been killed on the ground. In hospital, he was still pleading for help in finding his brother. \"How is your life now?\" Ridge asks. He says the crash has left him feeling \"very broke down\", adding it's much the same for the rest of his family. He does not leave the house, he says, instead sitting alone in his bedroom, doing \"nothing\". \"I just think about my brother,\" he adds. \"For me, he was everything.\" He says he still cannot believe Ajaykumar is dead - but that's as much as he can bring himself to say about him. Ridge acknowledges the contrast between Mr Ramesh's own survival - \"a miracle\" - and the \"nightmare\" of losing his brother. It echoes the sentiment of Mr Ramesh's other brother, Nayankumar, who told Sky News in June: \"I've got no words to describe it. It's a miracle that he [Viswashkumar] survived - but what about the other miracle for my other brother?\"  Mr Ramesh says he is still suffering physical discomfort too, dealing with knee, shoulder and back pain, along with burns to his left arm. His wife, he says, has to help him shower. He and his wife live in Leicester with their four-year-old son, Divang. \"I have a four-year-old, so I know what four-year-olds are like,\" Ridge says. \"They're a handful but they can bring a lot joy as well. How has he been since the tragedy happened?\" Mr Ramesh says Divang is \"okay\" but, with his eyes lowered, adds: \"I'm not talking properly with my son.\" \"Does he come to your room?\" Ridge asks. He shakes his head. Mr Ramesh was joined by Leicester community leader Sanjiv Patel and his adviser and spokesperson Radd Seiger for support as he spoke to Ridge. \"Sophy… this is an important question that you're asking,\" says Mr Seiger. \"You're a parent, I'm a parent, and we all know that being a parent is a privilege, isn't it? But it takes a lot of energy… you need to be in a good place to be a good parent, to have that from the moment they wake up to the moment they go to bed. \"You need to be in a good place and we can all see… he's [Mr Ramesh] been robbed of that and I think it's just a chore for him to just get through the day, let alone be a husband, be a father.\" What's next for the crash's sole survivor? Mr Seiger and Mr Patel say the list of what he needs to get his life back on track is \"endless\" but that it starts with \"practical things\" such as financial support. Mr Ramesh and Ajaykumar used \"all their savings\" to set up a fishing business in India, which saw them frequently flying there together from the UK. The business has stopped running since the crash, meaning Mr Ramesh's extended family in both the UK and India has no income, according to Mr Patel. For them, it amounts to an \"existential threat\", he adds. They say Air India has offered Mr Ramesh a flat interim payment of £21,500 - a one-off sum given to a claimant in advance of reaching the end of a personal injury claim. A spokesperson for Tata Group, Air India's parent company, told Sky News that Mr Ramesh had accepted the payment and that it had been transferred to him. But Mr Seiger says the sum \"doesn't even touch the sides\" when it comes to everything Mr Ramesh needs while he is unable to work or leave his home - from help with transporting his son to school, to food, to medical and psychiatric support. They are petitioning for more than just cash payments, which they suggest reduces Mr Ramesh to \"a number on a spreadsheet\". Rather, they want Air India's chief executive Campbell Wilson to meet with him, his family and the families of other victims in the crash, to hear about their struggles and \"talk as humans\". Mr Patel said: \"Meet the people. Understand what they're going through. Relying on bureaucratic machinery to deal with real lives [of people] who are going through real trauma - the pain of that, the financial consequences - that is the day-to-day - how lives have been destroyed, and not just the immediate family, but extended families too.\" A spokesperson for Air India told Sky News: \"We are deeply conscious of our responsibility to provide Mr Ramesh with support through what must have been an unimaginable period. Care for him - and indeed all families affected by the tragedy - remains our absolute priority. \"Senior leaders from across Tata Group continue to visit families to express their deepest condolences. An offer has been made to Mr Ramesh's representatives to arrange such a meeting, we will continue to reach out and we very much hope to receive a positive response. \"We are keenly aware this continues to be an incredibly difficult time for all affected and continue to offer the support, compassion, and care we can in the circumstances.\" Mr Patel also claims the UK government took away Mr Ramesh's family's Universal Credit after they went to India following the disaster. Read more:Families prepared for court fight over disaster which left 260 deadPlane suffered 'no mechanical fault' before crash According to the government's website, those receiving Universal Credit can continue to do so if they go abroad for one month. This can be extended to two months if \"a close relative dies while you're abroad and it would not be reasonable for you to come back to the UK\", it states. They are calling on Prime Minister Keir Starmer to look into the family's circumstances and pressure Air India into doing more to help. Mr Patel appeals to him, saying: \"Take action today. If this was your family, what would you do? And if you understand that, you'll know what to do.\" He suggests the UK government can also be doing more directly to help families in Britain who have been \"devastated\" by the crash. \"So while we wait for Air India to do what's right, there's what the UK authorities and the system can do as being right to serve the citizens in support during this tragic time,\" he adds. The Department for Work and Pensions told Sky News: \"Our thoughts remain with the loved ones affected by this devastating tragedy. \"Our policy ensures people travelling abroad due to a bereavement can continue receiving Universal Credit for up to two months, rather than the standard one-month limit. Those who are abroad for longer periods would not be able to continue receiving the benefit. \"People can make a new claim once they return to the UK. This approach strikes a balance between our commitment to ensuring people get the support they need and our duty to the taxpayer.\"  :: Watch Mornings with Ridge and Frost on weekdays Monday to Thursday, from 7am to 10am on Sky News"
    },
    {
        "title": "Worker trapped under collapsed medieval tower for 11 hours dies ",
        "description": "A man who was trapped under the rubble of a collapsed medieval tower in central Rome has died, according to local media. ",
        "url": "https://news.sky.com/story/torre-dei-conti-worker-trapped-after-medieval-tower-collapses-during-renovation-work-in-rome-13463249",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rome-italy-torre-dei-conti_7070633.jpg?20251103132241",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-03 15:49:00",
        "Headline": "Rescue efforts at the Torre dei Conti were hampered by the risk of further collapses, the emergency services said.",
        "Content": " A man who was trapped under the rubble of a collapsed medieval tower in central Rome has died, according to local media.  Crowds who gathered around the 13th-century Torre dei Conti, near the Colosseum, cheered when the man was pulled free by the emergency services on Monday evening. Crews worked into the night to free the worker, having to navigate the risk of further collapses of the structure. However, Italian news outlet Corriere della Sera reported after midnight on Tuesday that the worker had died. Italian Prime Minister Giorgia Meloni named the man as Octay Stroici in a statement after midnight, saying she \"shares deep sorrow and condolences, on behalf of myself and the government, for the tragic loss\". \"​We are close to his family and colleagues at this time of unspeakable suffering,\" she added. Another worker was seriously injured when the Torre dei Conti collapsed twice on Monday while it had been undergoing renovation work. \n                  Five mountaineers die after avalanche in Italy\n                 \n                  Prosecutors get new information about 2007 murder of Meredith Kercher in Perugia\n                 \n                  Italian anti-mafia police investigate after journalist's car explodes\n                 Italy's national fire department spokesman Luca Cari said one worker was in hospital in a critical condition, while three other workers were pulled out unharmed. Hundreds of tourists watched as firefighters used a mobile ladder to bring a stretcher to the upper level to rescue the worker from the 29-metre (95 ft) tower, where he was trapped by the first collapse, sometime before noon. But, during the attempt, another part of the structure collapsed, sending up a cloud of debris and forcing firefighters to retreat quickly. 'I saw the tower collapse' Large clouds of dust filled the area after the incidents, along with the sound of collapsing masonry, leaving the structure standing, but with significant internal damage. Gelato shop worker Queen Paglinawan, 27, said she heard the two loud noises from the town in quick succession. She said: \"I was working and then I heard some like falling, and then I saw the tower collapse in a diagonal way.\" German student Viktoria Braeu, 18, said: \"We were just at the Colosseum … and we were just walking to get some food. ... And then we were like, 'It's probably not long until it's going to go down,' and then it just started erupting.' Four firefighters later approached the first-floor window on two mobile ladders, but were quickly pulled back when dust began to rise. Drone used to see worker No firefighters were injured in the ongoing operation. A drone was then flown up to check the condition of the trapped worker. Read more on Sky News:Charges over train stabbingsCrash survivor - trauma 'broke' meTeen held on drug charges freed Torre dei Conti (Tower of the Counts) has not been used since 2006 and was being worked on as part of a four-year renovation project due to end next year, Rome city authorities said. The surrounding area was closed off to pedestrians during the work. Located on Via dei Fori Imperiali, the tower was built in 1238 by Pope Innocent III for his family and was originally twice as high, but was scaled down after damage from earthquakes in the 14th and 17th centuries."
    },
    {
        "title": "At least 20 dead and 150 injured after magnitude 6.3 earthquake in north Afghanistan",
        "description": "At least 20 people have died after a magnitude 6.3 earthquake in Afghanistan, the Taliban has said.",
        "url": "https://news.sky.com/story/at-least-seven-dead-and-150-injured-after-magnitude-63-earthquake-in-north-afghanistan-13463004",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-afghan-red-crescent_7070258.jpg?20251103101421",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-03 02:11:00",
        "Headline": "The US Geological Survey suggested \"significant casualties are likely and the disaster is potentially widespread\" after the earthquake in Mazar-e Sharif.",
        "Content": "At least 20 people have died after a magnitude 6.3 earthquake in Afghanistan, the Taliban has said. The tremor was recorded near the city of Mazar-e Sharif, in the northern Balkh province, at around 12.59am on Monday (8.29pm in the UK). The Taliban Health Ministry added that 320 were injured, while ministry spokesperson Sharfat Zaman said the number of dead and injured might rise. The US Geological Survey (USGS) has issued an orange alert on its system of quake impacts, and suggested that \"significant casualties are likely and the disaster is potentially widespread\". Previous events at that alert level have required a regional or national level response, according to the USGS's alert system. Balkh province spokesperson Haji Zaid added the earthquake destroyed part of the city's holy shrine, known as the Blue Mosque. The United Nations in Afghanistan said on X that it is on the ground assessing needs and delivering aid, and \"we stand with the affected communities and will provide the necessary support\". \n                  Afghanistan to boycott Twenty20 cricket tri-series in Pakistan after 'strike killed three local players'\n                 \n                  Pakistan agrees to ceasefire with Afghanistan after days of bloodshed\n                 \n                  Border crossings between Pakistan and Afghanistan remain closed as clashes continue\n                 Mazar-e Sharif is the fifth-largest city in Afghanistan, with a population of around 523,000. Located on two major active fault lines, Afghanistan is particularly vulnerable to earthquakes: More than 1,400 people were killed and at least 3,250 others injured after a magnitude 6.0 earthquake hit the country's eastern regions in September.  That tremor wiped out villages in the Mazar Dara valley, which Sky's Asia correspondent Cordelia Lynch visited in October. In 2015, an earthquake struck northeastern Afghanistan, killing several hundred people in Afghanistan and nearby northern Pakistan. Read more from Sky News:Dad of man who vanished 12 years ago believes son was murderedTwo Louvre jewellery heist suspects 'convicted over theft in 2015' Four large earthquakes also struck in the Herat province in 2023, each magnitude 6.3. The Taliban said at the time that at least 2,445 people had died."
    },
    {
        "title": "Mexican mayor killed by gunman during Day Of The Dead festivities",
        "description": "A mayor has been shot dead in front of dozens of people in Mexico during Day Of The Dead festivities.",
        "url": "https://news.sky.com/story/mexican-mayor-killed-by-gunman-during-day-of-the-dead-festivities-13463115",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-carlos-manzo-rodriguez_7070446.jpg?20251103094913",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-03 09:34:00",
        "Headline": "Carlos Alberto Manzo Rodriguez was an outspoken critic of organised crime and was often seen wearing a bulletproof vest after taking office last year.",
        "Content": "A mayor has been shot dead in front of dozens of people in Mexico during Day Of The Dead festivities. Carlos Alberto Manzo Rodriguez, who was the mayor of the Uruapan municipality in the violence-plagued western state of Michoacan, was shot seven times by an unidentified man on Saturday night, the authorities said. The 40-year-old was an outspoken critic of organised crime and was attacked in the centre of Uruapan at a candlelit event as part of the festivities. He was taken to hospital where he later died, according to state prosecutor Carlos Torres Pina. A city council member and a bodyguard were also injured in the attack. The attacker was killed at the scene and two other suspects were arrested, Mexico's security ministry said. The weapon used in the attack was linked to two armed clashes between rival criminal groups operating in the region, officials added. Mr Rodriguez was pictured among the crowds shortly before being attacked. Michoacan is one of Mexico's most violent states and is a battleground among various criminal groups fighting for control of territory, drug distribution routes and other illegal activities. Hundreds of people, dressed in black and holding up photographs of Mr Rodriguez, took to the streets of Uruapan for the funeral procession. Mr Rodriguez, who was often seen wearing a bulletproof vest, had been under close protection since last December, three months after taking office. His security was reinforced in May with extra police and National Guard officers. Read more from Sky News:At least 20 dead in Afghanistan earthquakeFive mountaineers die after avalanche in Italy  In an interview in September with Mexican journalist Joaquin Lopez-Doriga, he said: \"I don't want to be just another mayor on the list of those executed, those whose lives have been taken from them.\" Mexican President Claudia Sheinbaum condemned the murder as \"vile\". She promised there would be justice and also called an emergency meeting of her security cabinet. In October 2024, the mayor of Chilpancingo, a southwestern city which is the capital of Guerrero state, was murdered just days after taking office."
    },
    {
        "title": "Prince William to attend Earthshot Prize and COP30 in Brazil - with his team hoping to refocus attention away from Andrew",
        "description": "Prince William has spoken of the need for people to \"work together with optimism and courage\" on the environment as he heads for Brazil, hoping to leave behind the problems of his uncle, Andrew Mountbatten Windsor.",
        "url": "https://news.sky.com/story/prince-william-to-attend-earthshot-prize-and-cop30-in-brazil-with-his-team-hoping-to-refocus-attention-away-from-andrew-13463000",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-andrew-windsor-prince-william_7070243.jpg?20251102234213",
        "type": "World",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-11-03 00:01:00",
        "Headline": "There is no doubt that the climate crisis is the most consequential of global issues. But can what Prince William says or does drag attention away from what has been a monumental royal scandal?",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  Prince William has spoken of the need for people to \"work together with optimism and courage\" on the environment as he heads for Brazil, hoping to leave behind the problems of his uncle, Andrew Mountbatten Windsor. William will arrive in Rio de Janeiro on Monday to mark the fifth year of his Earthshot Prize awards, arguably the most important week of his year, with him and his team hoping it isn't derailed by any further revelations around his uncle Andrew. In the coming days, he will visit some of Rio's most iconic sights before attending the Earthshot Awards on Wednesday evening at the Museum of Tomorrow. On Thursday, he will then travel on to Belem for the UN's climate conference COP30, where he will deliver a landmark speech on behalf of the King and the UK government. Before starting his journey to Rio, William wrote: \"With the world's eyes turning to Brazil this week, there is no better place to celebrate bold climate leadership. \"Hosting The Earthshot Prize allows us to not only recognise those driving change, but to be inspired by them. When we work together with optimism and courage, a more sustainable future is within our reach.\" Rio, as the location of his latest overseas tour, couldn't be more eye-catching, and may be exactly what the Royal Family need after a particularly tumultuous few weeks. \n                  Donald Trump says he feels 'badly' for royals after Andrew stripped of titles over Epstein row\n                 \n                  What do people in Sandringham think of Andrew Mountbatten Windsor moving there?\n                 \n                  Andrew urged to 'be a man'  and tell police about his time with Epstein \n                 US President Donald Trump weighed in on the removal of Andrew's titles on Sunday, telling reporters on Air Force One that \"it's a terrible thing that's happened to the family, that's been a tragic situation and it's too bad\". Read more:What do people in Sandringham think of Andrew moving there?Email exchange between Andrew and Epstein releasedAnalysis: Removal of Andrew's titles is seismic  One person who it seems will be following William's work closely this week will be his father. We're told the King and his heir have had several discussions ahead of the visit, talking particularly about the speech he will give at COP30. Historically, the King has delivered several keynote speeches at the UN climate conference as part of his lifelong commitment to environmental issues. After many questions about how heavily involved Prince William has been in the actions taken against his uncle Andrew, it will be William's global leadership on the climate crisis that his team are hoping to emphasise this week. It will be the first time the Earthshot awards have taken place so close to, and in the same country as, the COP summit. Jason Knauf, the awards chief executive, told Sky News: \"Earthshot events are, you know, Prince William's favourite kind of moment of the year. And he works really, really hard to make sure that all of our finalists feel supported, that we get the most out of the incredible network that he's built, and that we reach as many people as possible. \"So, you know, this is what he does best. It's going to be a great week. So we're just delighted to be here.\" There is no doubt that the climate crisis is the most consequential of global issues. But can what William says or does drag attention away from what has been a monumental royal scandal? We wait to see over the coming days."
    },
    {
        "title": "UK must increase North Sea drilling to boost economy, says US ambassador",
        "description": "The US ambassador to the UK has said Britain should carry out \"more drilling and more production\" in the North Sea.",
        "url": "https://news.sky.com/story/uk-must-increase-north-sea-drilling-to-boost-economy-says-us-ambassador-13461350",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-north-sea-oil-platform_7063511.jpg?20251027064537",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-03 06:00:00",
        "Headline": "In a wide-ranging interview with Wilfred Frost, Warren Stephens also gives his views on getting tough with Russian President Vladimir Putin and the future of relations with China.",
        "Content": " The US ambassador to the UK has said Britain should carry out \"more drilling and more production\" in the North Sea. In his first broadcast interview in the job, Warren Stephens urged the UK to make the most of its own oil and gas reserves to cut energy costs and boost the economy. \"Electricity costs are four times ours in the UK, versus the US,\" he told Mornings with Ridge and Frost. \"I want the UK economy to be as strong as it possibly can be, so the UK can be the best ally to the US that it possibly can be. \"Having a growing economy is essential to that - and the electricity costs make it very difficult.\" Mr Stephens told Wilfred Frost he hoped Britain would \"examine the policies in the North Sea and frankly, make some changes to it that allows for more drilling and more production\". \"You're using oil and gas, but you're importing it. Why not use your own?\" he asked. \n                  Petrofac administration not a great start to the week for Ed Miliband though relief could come\n                 \n                  More than 2,000 jobs at risk as oil and gas company enters administration\n                 \n                  Renewable energy produces more electricity than coal for the first time, experts say\n                 The ambassador said he had held meetings with Sir Keir Starmer on the energy issue while US President Donald Trump was in the room, and that the prime minister was \"absolutely\" listening to the US view. \"I think there are members of the government that are listening,\" Mr Stephens told Sky News. \"There is a little bit of movement to make changes on the policy and I'll hope that will continue.\" Energy Secretary Ed Miliband has said the UK should be prioritising net zero by 2030 to limit climate change, rather than issuing new oil and gas drilling licences. However, the ambassador said it would take \"all energy for all countries to compete\" in the future, given the huge power demands of data centres and AI. \"I don't think Ed Miliband is necessarily wrong,\" said Mr Stephens. \"But I think it's an incorrect policy to ignore your fossil fuel reserves, both in the North Sea and onshore.\" The ambassador hosted Mr Trump on the first night of his second UK state visit in September - a trip that was seen as a success by both sides. Mr Stephens said Mr Trump and Sir Keir had a \"great relationship\" and pointed to the historic ties between Britain and the US as a major factor in June's trade deal and the favourable tariff rate on the UK. \"The president really loves this country,\" the ambassador told Sky News. \"I don't think it's coincidental that the tariff rates on the UK are generally a third, or at worst half, of what a lot of other countries are facing. \"I think the prime minister and his team did a great job of positioning the United Kingdom to be the first trade deal, but also the best one that's been struck.\" Mr Stephens - who began his job in London in May - also touched on the Ukraine war and said Mr Trump's patience with Russia was \"wearing thin\". The Alaska summit between Mr Trump and Vladimir Putin failed to produce a breakthrough, and the US leader has admitted the Russian president may be \"playing\" him so he can continue the fighting. Read more from Sky News:Trump accused of 'new low point' with refugee orderTrump's opinion of Xi meeting brushes over thornier issues The ambassador told Sky News he had always favoured a tough stance on Russia and was \"delighted\" when Mr Trump sanctioned Russia's two biggest oil firms a few weeks ago. However, he emphasised the president's call that other countries must stop buying Russian energy to really tighten the screw. Lead presenter \"You're using oil and gas, but you're importing it. Why not use your own?\" It's a reasonable question for President Trump's top representative here in the UK – ambassador Warren Stephens – to ask, particularly given that our exclusive interview was taking place in the UK's oil capital, Aberdeen.\n The ambassador told me that he and President Trump have repeatedly lobbied Prime Minister Starmer on the topic, and somewhat strikingly said the PM was \"absolutely listening\", adding: \"I think there are certainly members of the government that are listening. And there is a little bit of movement to make some changes to the policy.\" Well, one member of the government who is seemingly not listening, and happens to be spending most of this week at the UN Climate Change Conference in Brazil, is Energy Secretary Ed Miliband.  \"It's going to take all energy for all countries to compete in the 21st century for AI and data centres,\" the ambassador told me. \"And so, I don't think Ed Miliband is necessarily wrong, but I think it's an incorrect policy to ignore your fossil fuel reserves, both in the North Sea and onshore.\" Not wrong, but the incorrect policy. That's Trumpian diplomacy for you. His comments on Russia, China and free speech were also fascinating. On the latter, he said that in the US someone might get \"cancelled for saying something, but they're not going to get arrested.\" \"The president, has been, I would say, careful in ramping up pressure on Russia. But I think his patience is wearing out,\" said Mr Stephens. \"One of the problems is a lot of European countries still depend on Russian gas,\" he added. \"We're mindful of that. We understand that, but until we can really cut off their ability to sell oil and gas around the world, they're going to have money and Putin seems intent on continuing the war.\" The ambassador also struck a cautious but hopeful tone on future US and UK relations with China. It comes after Mr Trump said his meeting this week with President Xi Jinping was a \"12/10\", raising hopes the trade war between the superpowers could be simmering down. China's huge economy is too big to ignore - but it remains a major spy threat; the head of MI5 warned last month of an increase in \"state threat activity\" from Beijing (as well as Russia and Iran). Mr Stephens praised the country's economy and said it would be \"terrific\" if China could one day be considered a partner.  But he warned \"impatient\" China is ruthlessly focused on itself only, and would like to see the US and the West weakened. \"There's certainly things we want to be able to do with China,\" added the ambassador. \"And I know the UK wants to do things with China. The United States does, too - and we should. But I think we always need to keep in the back of our mind that China does not have our interests at heart.\" :: Watch Mornings with Ridge and Frost on weekdays Monday to Thursday, from 7am to 10am on Sky News"
    },
    {
        "title": "Judge rejects plea deal for funeral home owner accused of stashing nearly 190 decomposing bodies",
        "description": "A judge in Colorado has rejected a plea deal for a funeral home owner accused of storing nearly 190 decomposing bodies in a bug-infested building, after relatives of the deceased argued the proposed 15 to 20-year sentence was far too lenient.",
        "url": "https://news.sky.com/story/judge-rejects-plea-deal-for-funeral-home-owner-accused-of-stashing-nearly-190-decomposing-bodies-13463516",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-funeral-home-colorado-funeral-home_7071196.jpg?20251103224030",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-03 22:10:00",
        "Headline": "Carie Hallford and her husband, Jon, are accused of storing bodies in a bug-infested building, giving families fake ashes, and defrauding the federal government of nearly $900,000 (£684,800).",
        "Content": "A judge in Colorado has rejected a plea deal for a funeral home owner accused of storing nearly 190 decomposing bodies in a bug-infested building, after relatives of the deceased argued the proposed 15 to 20-year sentence was far too lenient. State district judge Eric Bentley said the proposed sentence \"did not adequately reflect the harm caused by these offences\", taking the unusual step of rejecting a plea agreement reached between prosecutors and the defence. Carie Hallford and her husband, Jon Hallford, ran the Return to Nature Funeral Home. They are accused of leaving dozens of bodies to decompose between 2019 and 2023 in a building in Penrose, Colorado, around 103 miles south of Denver, while giving families fake ashes.  In court on Monday, multiple family members opposed the plea deal, describing the anguish of discovering that their relatives' remains were not in the urns or ashes they had laid to rest. Tanya Wilson said her mother had been placed on a floor covered in maggots, \"leaving her mark on that floor, and leaving a permanent mark on my soul\". Samantha Naranjo said it had been hard for her \"to get excited to decorate my home with skeletons\" for Halloween, as tears choked her words, \"when all I can think of is the building that my grandmother's body lay in\". Last year, both Hallfords pleaded guilty to 191 counts of corpse abuse, and Carie Hallford's lawyer argued on Monday that the plea deal was reasonable and would provide closure. However, Judge Bentley has now rejected the plea agreements. Read more from Sky News:Worker rescued from collapsed medieval tower after 11 hours'Vile and dangerous' strangulation pornography to be banned On Monday, several family members called for Carie Hallford to receive nearly 200 years in prison, assigning roughly one year for each body found. \"We are not asking for revenge, we are asking for acknowledgment, for the court to see each victim as the human being that they were,\" said Derrick Johnson, whose mother's remains were also kept in the building. In August, authorities revealed their initial inspection of the funeral home uncovered 24 decomposing bodies hidden behind a secret door. The investigation is ongoing, with officials reporting slow progress in identifying the remains, some of which have been left unattended for more than 10 years. In addition, both Hallfords have admitted in federal court to defrauding the US Small Business Administration of nearly $900,000 (£684,800) in pandemic relief funds and accepting payments from clients for cremations that were never carried out. Authorities said the couple spent lavishly, purchasing a GMC Yukon, luxury treatments, holidays, jewellery, and cryptocurrency. After pleading guilty in federal court, Jon Hallford received a 20-year prison sentence, while Carie Hallford's federal sentencing is scheduled for December."
    },
    {
        "title": "Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today",
        "description": "Sir Keir Starmer and Rachel Reeves have hinted at tax rises to come when the chancellor delivers the budget later this month.",
        "url": "https://news.sky.com/story/starmer-and-reeves-hint-at-tax-rises-to-come-ahead-of-unusual-pre-budget-speech-today-13463353",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-keir-starmer_7071216.jpg?20251103232800",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-03 16:54:00",
        "Headline": "The chancellor will address the nation from Downing Street on Tuesday morning, weeks before she delivers her second budget. It comes amid rampant speculation she will break Labour's manifesto commitments on tax rises.",
        "Content": " Sir Keir Starmer and Rachel Reeves have hinted at tax rises to come when the chancellor delivers the budget later this month. In a Downing Street speech this morning, Ms Reeves will address \"speculation\" that an increase in income tax will be announced during the highly-anticipated statement on 26 November. Politics Hub: Follow chancellor's speech live Sky News political editor Beth Rigby said it was \"highly unusual\" for the chancellor to make such a speech, but the Treasury believes she must \"try to prepare the ground and make the argument for another big tax-raising budget\". \"I will make the choices necessary to deliver strong foundations for our economy - for this year, and years to come,\" Ms Reeves will say. Last night, Sir Keir gave Labour MPs a taste of what's to come by warning of the need for \"tough but fair\" decisions. Speaking at a party meeting in Westminster, he said the budget \"takes place against a difficult economic backdrop\". \"It's becoming clearer the long-term impact of Tory austerity, their botched Brexit deal and the pandemic on Britain's productivity is worse than even we feared,\" the prime minister said. \"Faced with that, we will make the tough but fair decisions to renew our country and build it for the long term.\" Political editor I don't need to tell you how difficult and contested this is going to be. Only a year ago, the chancellor unveiled the biggest tax-raising budget since 1993 and said it was a \"once in a parliament event\". MPs will be fearing a massive backlash should manifesto promises on not raising income tax (and VAT and national insurance) for working people be broken. Government figures know how hard it's going to be but argue the chancellor has to level with the public about the hard choices ahead and what is driving her decision-making. It comes after Sir Keir refused to confirm at Prime Minister's Questions last week that the budget would honour his party's manifesto pledge not to raise income tax, national insurance or VAT. Having raised taxes in last year's budget, notably national insurance on employers, Ms Reeves has also previously promised not to \"come back for more\" during this parliament.  The PM and chancellor's warnings come after reports suggested the Office for Budget Responsibility is expected to downgrade its productivity growth forecast for the UK by about 0.3 percentage points. That would leave Ms Reeves with a larger than expected fiscal black hole to fill, possibly up to £30bn. Read more: What taxes could rise? She is said to be considering a proposal from The Resolution Foundation, a left-leaning thinktank close to the government, to raise income tax by 2p but cut national insurance by the same amount. The thinktank, which used to be headed by Torsten Bell, a Labour MP who is now a key aide to Ms Reeves and a pensions minister, said the move would raise vital cash while protecting working people.  Reeves to prioritise NHS and cost of living Giving a further flavour of what to expect, Ms Reeves will this morning vow to make \"important choices that will shape our economy for years to come\". \"It is important that people understand the circumstances we are facing, the principles guiding my choices - and why I believe they will be the right choices for the country,\" she will add. Ms Reeves will say her priorities are cutting national debt, easing the cost of living and protecting the NHS. \"It will be a budget led by this government's values,\" she's set to say. \"Of fairness and opportunity and focused squarely on the priorities of the British people: protecting our NHS, reducing our national debt and improving the cost of living.\""
    },
    {
        "title": "UK must increase North Sea drilling to boost economy, says US ambassador",
        "description": "The US ambassador to the UK has said Britain should carry out \"more drilling and more production\" in the North Sea.",
        "url": "https://news.sky.com/story/uk-must-increase-north-sea-drilling-to-boost-economy-says-us-ambassador-13461350",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-north-sea-oil-platform_7063511.jpg?20251027064537",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-03 06:00:00",
        "Headline": "In a wide-ranging interview with Wilfred Frost, Warren Stephens also gives his views on getting tough with Russian President Vladimir Putin and the future of relations with China.",
        "Content": " The US ambassador to the UK has said Britain should carry out \"more drilling and more production\" in the North Sea. In his first broadcast interview in the job, Warren Stephens urged the UK to make the most of its own oil and gas reserves to cut energy costs and boost the economy. \"Electricity costs are four times ours in the UK, versus the US,\" he told Mornings with Ridge and Frost. \"I want the UK economy to be as strong as it possibly can be, so the UK can be the best ally to the US that it possibly can be. \"Having a growing economy is essential to that - and the electricity costs make it very difficult.\" Mr Stephens told Wilfred Frost he hoped Britain would \"examine the policies in the North Sea and frankly, make some changes to it that allows for more drilling and more production\". \"You're using oil and gas, but you're importing it. Why not use your own?\" he asked. \n                  Petrofac administration not a great start to the week for Ed Miliband though relief could come\n                 \n                  More than 2,000 jobs at risk as oil and gas company enters administration\n                 \n                  Renewable energy produces more electricity than coal for the first time, experts say\n                 The ambassador said he had held meetings with Sir Keir Starmer on the energy issue while US President Donald Trump was in the room, and that the prime minister was \"absolutely\" listening to the US view. \"I think there are members of the government that are listening,\" Mr Stephens told Sky News. \"There is a little bit of movement to make changes on the policy and I'll hope that will continue.\" Energy Secretary Ed Miliband has said the UK should be prioritising net zero by 2030 to limit climate change, rather than issuing new oil and gas drilling licences. However, the ambassador said it would take \"all energy for all countries to compete\" in the future, given the huge power demands of data centres and AI. \"I don't think Ed Miliband is necessarily wrong,\" said Mr Stephens. \"But I think it's an incorrect policy to ignore your fossil fuel reserves, both in the North Sea and onshore.\" The ambassador hosted Mr Trump on the first night of his second UK state visit in September - a trip that was seen as a success by both sides. Mr Stephens said Mr Trump and Sir Keir had a \"great relationship\" and pointed to the historic ties between Britain and the US as a major factor in June's trade deal and the favourable tariff rate on the UK. \"The president really loves this country,\" the ambassador told Sky News. \"I don't think it's coincidental that the tariff rates on the UK are generally a third, or at worst half, of what a lot of other countries are facing. \"I think the prime minister and his team did a great job of positioning the United Kingdom to be the first trade deal, but also the best one that's been struck.\" Mr Stephens - who began his job in London in May - also touched on the Ukraine war and said Mr Trump's patience with Russia was \"wearing thin\". The Alaska summit between Mr Trump and Vladimir Putin failed to produce a breakthrough, and the US leader has admitted the Russian president may be \"playing\" him so he can continue the fighting. Read more from Sky News:Trump accused of 'new low point' with refugee orderTrump's opinion of Xi meeting brushes over thornier issues The ambassador told Sky News he had always favoured a tough stance on Russia and was \"delighted\" when Mr Trump sanctioned Russia's two biggest oil firms a few weeks ago. However, he emphasised the president's call that other countries must stop buying Russian energy to really tighten the screw. Lead presenter \"You're using oil and gas, but you're importing it. Why not use your own?\" It's a reasonable question for President Trump's top representative here in the UK – ambassador Warren Stephens – to ask, particularly given that our exclusive interview was taking place in the UK's oil capital, Aberdeen.\n The ambassador told me that he and President Trump have repeatedly lobbied Prime Minister Starmer on the topic, and somewhat strikingly said the PM was \"absolutely listening\", adding: \"I think there are certainly members of the government that are listening. And there is a little bit of movement to make some changes to the policy.\" Well, one member of the government who is seemingly not listening, and happens to be spending most of this week at the UN Climate Change Conference in Brazil, is Energy Secretary Ed Miliband.  \"It's going to take all energy for all countries to compete in the 21st century for AI and data centres,\" the ambassador told me. \"And so, I don't think Ed Miliband is necessarily wrong, but I think it's an incorrect policy to ignore your fossil fuel reserves, both in the North Sea and onshore.\" Not wrong, but the incorrect policy. That's Trumpian diplomacy for you. His comments on Russia, China and free speech were also fascinating. On the latter, he said that in the US someone might get \"cancelled for saying something, but they're not going to get arrested.\" \"The president, has been, I would say, careful in ramping up pressure on Russia. But I think his patience is wearing out,\" said Mr Stephens. \"One of the problems is a lot of European countries still depend on Russian gas,\" he added. \"We're mindful of that. We understand that, but until we can really cut off their ability to sell oil and gas around the world, they're going to have money and Putin seems intent on continuing the war.\" The ambassador also struck a cautious but hopeful tone on future US and UK relations with China. It comes after Mr Trump said his meeting this week with President Xi Jinping was a \"12/10\", raising hopes the trade war between the superpowers could be simmering down. China's huge economy is too big to ignore - but it remains a major spy threat; the head of MI5 warned last month of an increase in \"state threat activity\" from Beijing (as well as Russia and Iran). Mr Stephens praised the country's economy and said it would be \"terrific\" if China could one day be considered a partner.  But he warned \"impatient\" China is ruthlessly focused on itself only, and would like to see the US and the West weakened. \"There's certainly things we want to be able to do with China,\" added the ambassador. \"And I know the UK wants to do things with China. The United States does, too - and we should. But I think we always need to keep in the back of our mind that China does not have our interests at heart.\" :: Watch Mornings with Ridge and Frost on weekdays Monday to Thursday, from 7am to 10am on Sky News"
    },
    {
        "title": "Nigel Farage pivots on economy - will his original supporters be in favour?",
        "description": "Nigel Farage has long known he would need to overhaul Reform UK's offer on the economy, not least because of the scale of the attack it faced over conference season.",
        "url": "https://news.sky.com/story/nigel-farage-pivots-on-economy-will-his-original-supporters-be-in-favour-13463288",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nigel-farage-reform-uk_7070774.jpg?20251103152317",
        "type": "Business",
        "Author": "Sam Coates",
        "Date Published": "2025-11-03 14:16:00",
        "Headline": "As Nigel Farage threatens a benefits crackdown and becomes the only party to put changes to the triple lock on the table, will Reform UK's original voters still be as strongly in favour?",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Nigel Farage has long known he would need to overhaul Reform UK's offer on the economy, not least because of the scale of the attack it faced over conference season. According to the Institute for Fiscal Studies, last year's manifesto plans would cost nearly £90bn per year, with spending increases alone of £50bn. They claimed they would pay for these through £150bn per year of reductions in other spending, covering public services, debt interest and working-age benefits - eyewatering sums that the other parties felt left Reform UK exposed. So in traditional Nigel Farage fashion, Monday comes the pivot. Politics live: Farage predicts early general election in 2027 In a speech in the City, Farage said that large upfront tax cuts were no longer on the agenda because of the state of the economy. He said significant but \"sensible\" deregulation was needed to take advantage of post-Brexit freedoms, and put public sector pensions and even the triple lock (up for consideration but no decisions have been made) on the table. \n                  Nigel Farage says Reform UK could cut minimum wage for young people - and defends U-turn on tax pledges\n                 \n                  Tories and Reform: From feud to love-in?\n                 \n                  Caerphilly by-election: Just like that! In Tommy Cooper's birthplace, Farage nowhere to be seen as Reform loses\n                 \"We want to cut taxes. Of course we do. But we understand substantial tax cuts given the dire state of debt and our finances are not realistic,\" he told the 100-strong audience. Read more politics news:Security scanners at train stations ruled outEx-councillor in court over Westminster blackmail allegation Farage has to walk a fine line He was unapologetic that he could not say when or by how much taxes would be lowered. He said: \"If I'm right and that election comes in 2027, then the economy will be in an even worse state than any of us in this room can even predict. How can anybody project on pensions and thresholds or any of those things between now and then?\" But he must walk a fine line - both claiming to be consistent as a politician while changing his stance. And more broadly, given we have had \"Brexit Nigel\" and \"trade-union Nigel\" and \"small state Nigel\" and \"nationalisation Nigel\" - which all, I pointed out to him, line up like Barbies on a toy shelf today - I asked him why we should now suddenly trust \"fiscal responsibility Nigel\" and that this survives to and beyond the next general election? His answer was instructive - saying that while his principles and ideology has been consistent, he conceded the practical application has had to evolve. 👉Listen to Politics at Sam and Anne's on your podcast app👈 He said: \"I believe in pretty much the same sort of things I believed in 30 years ago. The difference is I now understand more than I did the role of the state in strategic industries. \"That's why Richard Tice and I went to Scunthorpe... Have I adapted over 30 years into believing that the country needs an industrial strategy? \"Yes. Do I believe that actually, in certain failing industries, you know, a short-term partial nationalisation where, by the way, the bondholders and shareholders get wiped out? It doesn't cost the government to do it.\" Interesting insight This is an interesting insight into a politician who was associated with a certain strand of conservatism. He hopes political evolution works in his favour. But the history of candour in British politics does not always favour the brave, as George Osborne discovered in late 2009. As Farage threatens a benefits crackdown and becomes the only party to put changes to the triple lock on the table, will Reform UK's original voters still be as strongly in favour?"
    },
    {
        "title": "Buyout firm Epiris plots £230m swoop on Next 15 divisions",
        "description": "The private equity firm which owns the Las Iguanas and Cafe Rouge restaurant chains is in talks to buy a sizeable chunk of Next 15 Group, the London-listed marketing services group.",
        "url": "https://news.sky.com/story/buyout-firm-epiris-plots-163230m-swoop-on-next-15-divisions-13463269",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-next-fifteen-next15_7070718.jpg?20251103134618",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-03 13:33:00",
        "Headline": "The London-listed marketing services group is in talks about a sale of subsidiaries including MHP Communications, a financial public relations firm, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity firm which owns the Las Iguanas and Cafe Rouge restaurant chains is in talks to buy a sizeable chunk of Next 15 Group, the London-listed marketing services group. Sky News has learnt that Epiris, which owns the Big Table casual dining group and also counted auctioneer Bonhams among its recent investments, has approached Next 15 Group about a deal. City sources said on Monday that Epiris's offer included Next 15 subsidiaries MHP Communications, a leading financial public relations firm. M Booth, a consumer marketing operation; Outcast, another PR agency; and Activate, a business-to-business demand generation specialist, are also said to form part of the deal perimeter.  Ares Management, the private credit giant, is understood to have been approached by Epiris to help finance its offer. Discussions between Epiris and Next 15 are said to be ongoing, although insiders cautioned that a transaction was not certain to materialise. \n                  Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today\n                 \n                  UK must increase North Sea drilling to boost economy, says US ambassador\n                 \n                  Major bank now letting you borrow 6.5x income for mortgage - if you earn enough | Money blog\n                 Sky News reported the approach to Next 15 earlier this year, although the identity of the bidder was unclear at that stage. Next 15 is a marketing services conglomerate which is effectively a smaller replica of industry giants such as Publicis and WPP, the latter of which is engulfed in strategic uncertainty. Sir Martin Sorrell, the WPP founder who now runs S4 Capital, has also been in talks about taking the business private. A sale of its Marker division would leave Next 15 focused on its remaining technology and data-driven client businesses.Next 15 issued a profit warning and changed its leadership earlier this year as it disclosed \"potential serious misconduct\" related to Mach49, a Silicon Valley advisory business it owns. Tim Dyson, its chief executive for over three decades, has retired and been replaced by Sam Knights, the boss of Shopper Media Group, one of its subsidiaries. The group has already been engaged in selling a number of units. Next 15 has a market value of about £420m after seeing its stock rally in recent months. The shares, which were trading at about 404.5p on Monday afternoon, are broadly flat over the last year. Epiris, Ares and Next 15 all declined to comment."
    },
    {
        "title": "Ryanair boss hits out at chancellor over growth as profits climb 42%",
        "description": "Ryanair's boss has accused the chancellor of having no idea how to grow the UK economy as the airline reported that hikes to fares had delivered a 42% rise in half-year profits.",
        "url": "https://news.sky.com/story/ryanair-profits-climb-42-on-the-back-of-fare-hikes-13463029",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rachel-reeves_7067209.jpg?20251030175955",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-03 06:19:00",
        "Headline": "Europe's largest airline by passenger numbers says it remains cautiously optimistic it is on track to secure fare growth across its financial year as a whole.",
        "Content": " Ryanair's boss has accused the chancellor of having no idea how to grow the UK economy as the airline reported that hikes to fares had delivered a 42% rise in half-year profits. Michael O'Leary told Sky's Mornings with Ridge and Frost programme that Rachel Reeves \"hasn't the rashers how to deliver growth\" while taking aim at a planned rise in air passenger duty slated for next April. He called for the hike, revealed at her first budget last October, to be reversed in her speech to the Commons on 26 November - a budget business believes could further harm private sector investment. \"Until she starts cutting these insane taxes and stop trying to tax wealth, the UK economy is doomed to continue to fail\", he said. \"But, in a bizarre way, that's probably good for Ryanair's business because as people get more price sensitive, more and more of them will fly Ryanair,\" he concluded. Mr O'Leary was speaking after the no-frills carrier, which is Europe's largest airline by passenger numbers, reported profit after tax for the six months to the end of September of €2.54bn (£2.2bn). The better-than-expected sum followed a second quarter recovery for fares - the cost of a seat before add-ons - in the wake of a 7% decline across its last financial year. \n                  Furious Ryanair boss warns 100,000 passengers could have flights cancelled next week\n                 \n                  Bonuses to rise for Ryanair staff spotting oversized baggage\n                 \n                  Ryanair to increase size of underseat free bag by 20% following EU proposals\n                  Ryanair said revenues per passenger were up 9% over the six months, helped by a 13% rise in fares and higher revenues from additional things like baggage fees and seat selection. It reported record passenger numbers of 119 million for the half year - the summer season that tends to be the most profitable - and guided that fares, despite some discounting, were on track to end the financial year on a positive footing. The airline raised its passenger traffic forecast due to earlier-than-expected deliveries of more efficient Boeing aircraft and strong first-half demand. Ryanair said it expected to fly 207 million passengers in the year to the end of March, up from an earlier forecast of 206 million. Mr O'Leary told investors: \"While Q3 forward bookings are slightly ahead of (PY) prior year, particularly across the Oct. mid-term and Christmas peaks, we would caution that we face more challenging PY fare comps in H2 (second half) making fare growth more challenging\"."
    },
    {
        "title": "Pest controller reveals first sign you have an infestation - and the one job he'll 'never forget'",
        "description": "Each week, the Money blog speaks to someone from a different profession to discover what it's really like. This week we chat to pest controller from Bespoke Pest Control, Stephen Wales.",
        "url": "https://news.sky.com/story/pest-controller-reveals-first-sign-you-have-an-infestation-and-the-one-job-hell-never-forget-13463108",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rat-rodent-pest_7070435.jpg?20251103093605",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-03 09:15:00",
        "Headline": "Stephen Wales says he \"definitely gets grossed out\" by some infestations - and tells of how a common small animal in your loft \"can sound like a wild animal on the rampage\".",
        "Content": "Each week, the Money blog speaks to someone from a different profession to discover what it's really like. This week we chat to pest controller from Bespoke Pest Control, Stephen Wales. New technicians start with about £26,000 a year... with training, like BPCA or NPTA qualifications in rodent and insect control, you can climb to £30,000-£40,000 after five to 10 years, especially if you're tackling infestations in busy city restaurants or historic buildings. Pay depends on the employer. Bigger firms often offer clear paths to promotion, and you can boost earnings with bonuses for signing up clients or overtime for late-night call-outs. Pests have their seasons - the most common are... rats. They sneak in through damaged drains and gaps around buildings, especially in cities, and they breed rapidly; one pair can lead to over 1,000 offspring in a year, so a small problem can quickly escalate. In the summer, the most common are wasps. Head to the Money blog for latest consumer finance tips Access is the most common reason people get pests in their homes... Mice can squeeze through a gap as small as a biro and rats only need a hole about the width of your thumb. Bed bugs are different; they hitchhike home with you in luggage after travel or in second-hand furniture. A squirrel racing around a loft at 3am... can sound like a wild animal on the rampage - I've had customers convinced they had something the size of an elephant above their bedroom. I definitely get grossed out... Usually by the property rather than the pests. One pub in east London was so overrun with mice that the cellar floor looked like it was moving. But the worst part was upstairs: the previous owners had kept their dog shut in the hallway, and there were inches of dog mess built up across the floor. That's a job I'll never forget. \n                  'I've sculpted the late Queen and charge upwards of £40,000'\n                 \n                  'I'm self-taught celeb photographer, can earn up to six figures for one job and work with celebrities all over the world'\n                 \n                  'I'm a recruitment specialist - here's how to nail your interview and perfect your CV'\n                 I was made redundant from my gardening job with the council... and a neighbour who worked at Rentokil suggested I apply. I didn't think I'd enjoy it, but during the seven-week training, I quickly realised it was the perfect job for me - lots of variety, problem-solving and meeting new people. I've never looked back. Most pest control myths don't work... conkers don't repel spiders, and mice prefer chocolate or peanut butter over cheese. The only one with a bit of truth is strong scents like peppermint oil, which may deter some spiders temporarily. But the real answer is always proofing, hygiene and quick action. The first sign that I'm dealing with a problem is... smell, especially with a serious rat infestation. They tend to use one area as a toilet, and the ammonia smell is very strong. And the smell of a dead rodent is unforgettable once you've experienced it. Pest controllers are not very accurately portrayed in films... we're often portrayed as a comedy role, or only noticed during a scare story like the recent Paris bed bug headlines. In reality, we protect public health and ensure places like restaurants, takeaways and supermarkets keep people safe from pests. Sometimes we're called to cases of delusional parasitosis... where someone genuinely believes they are infested even though there are no pests present. These situations require patience, respect and support; it's about helping the person, not just the property. Some buildings are more prone to pests than others... Older buildings often have ageing drains and gaps that give pests easy entry. Newer houses can have issues too, such as insects brought in during construction, or rats accessing extensions built over old drains. Any weakness in a building can become a pest's welcome mat. I've definitely seen an increase in bed bugs over my career... They were rare when I started, but now they're much more common because of increased travel and the popularity of second-hand furniture. They hitchhike their way into homes and spread easily. Bed bugs are the hardest pests to get rid of... because they're extremely good at hiding, resistant to treatments, and you often need to treat multiple rooms. It's very labour-intensive work. I've not really been tempted to keep a pest as a pet... I'm not bringing home fleas or cockroaches! But if I had to choose, it would be a rat; they're very clever, social and surprisingly affectionate when they're not chewing through someone's wiring. The longest job I've worked on was... a fried-chicken shop in north London that was infested with rats in the false ceiling. They were feeding on food scraps outside, so I had to slowly change their routine and lure them towards control points. It took a lot of late nights, but I eventually removed more than 40 rats. The most expensive job I charge for is... bed bug treatments. They're time-consuming and detailed, and often involve multiple rooms. Some rat jobs can also be expensive, especially when we need to carry out drain surveys to find how they're getting in. I love tackling pests, but if I had to pick a downside... it's the paperwork and ever-changing regulations. As a self-employed technician, I handle every invoice and rodenticide and insecticide log myself. Keeping up with new rules can be time-consuming - not the worst part of the job, but definitely the least enjoyable. Read more from Sky News:What it's really like being a bodyguard'We're protecting UK from paralysing attack - and our salaries can be limitless'The private investigator - 'here's how much we cost'£200k salaries - secrets of a pilot Keeping your home completely pest-free is impossible... but here are my three top tips to reduce the risk... As a self-employed technician, I contribute to a private pension... back when I worked for other pest control companies, they offered workplace pensions, typically contributing around 3Ǉ% of a technician's salary, matched by the employee. As for retirement, I'm in no rush to stop. I still get a buzz from helping customers, so I plan to ease into smaller jobs, like home inspections, in my late 60s."
    },
    {
        "title": "Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today",
        "description": "Sir Keir Starmer and Rachel Reeves have hinted at tax rises to come when the chancellor delivers the budget later this month.",
        "url": "https://news.sky.com/story/starmer-and-reeves-hint-at-tax-rises-to-come-ahead-of-unusual-pre-budget-speech-today-13463353",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-keir-starmer_7071216.jpg?20251103232800",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-03 16:54:00",
        "Headline": "The chancellor will address the nation from Downing Street on Tuesday morning, weeks before she delivers her second budget. It comes amid rampant speculation she will break Labour's manifesto commitments on tax rises.",
        "Content": " Sir Keir Starmer and Rachel Reeves have hinted at tax rises to come when the chancellor delivers the budget later this month. In a Downing Street speech this morning, Ms Reeves will address \"speculation\" that an increase in income tax will be announced during the highly-anticipated statement on 26 November. Politics Hub: Follow chancellor's speech live Sky News political editor Beth Rigby said it was \"highly unusual\" for the chancellor to make such a speech, but the Treasury believes she must \"try to prepare the ground and make the argument for another big tax-raising budget\". \"I will make the choices necessary to deliver strong foundations for our economy - for this year, and years to come,\" Ms Reeves will say. Last night, Sir Keir gave Labour MPs a taste of what's to come by warning of the need for \"tough but fair\" decisions. Speaking at a party meeting in Westminster, he said the budget \"takes place against a difficult economic backdrop\". \"It's becoming clearer the long-term impact of Tory austerity, their botched Brexit deal and the pandemic on Britain's productivity is worse than even we feared,\" the prime minister said. \"Faced with that, we will make the tough but fair decisions to renew our country and build it for the long term.\" Political editor I don't need to tell you how difficult and contested this is going to be. Only a year ago, the chancellor unveiled the biggest tax-raising budget since 1993 and said it was a \"once in a parliament event\". MPs will be fearing a massive backlash should manifesto promises on not raising income tax (and VAT and national insurance) for working people be broken. Government figures know how hard it's going to be but argue the chancellor has to level with the public about the hard choices ahead and what is driving her decision-making. It comes after Sir Keir refused to confirm at Prime Minister's Questions last week that the budget would honour his party's manifesto pledge not to raise income tax, national insurance or VAT. Having raised taxes in last year's budget, notably national insurance on employers, Ms Reeves has also previously promised not to \"come back for more\" during this parliament.  The PM and chancellor's warnings come after reports suggested the Office for Budget Responsibility is expected to downgrade its productivity growth forecast for the UK by about 0.3 percentage points. That would leave Ms Reeves with a larger than expected fiscal black hole to fill, possibly up to £30bn. Read more: What taxes could rise? She is said to be considering a proposal from The Resolution Foundation, a left-leaning thinktank close to the government, to raise income tax by 2p but cut national insurance by the same amount. The thinktank, which used to be headed by Torsten Bell, a Labour MP who is now a key aide to Ms Reeves and a pensions minister, said the move would raise vital cash while protecting working people.  Reeves to prioritise NHS and cost of living Giving a further flavour of what to expect, Ms Reeves will this morning vow to make \"important choices that will shape our economy for years to come\". \"It is important that people understand the circumstances we are facing, the principles guiding my choices - and why I believe they will be the right choices for the country,\" she will add. Ms Reeves will say her priorities are cutting national debt, easing the cost of living and protecting the NHS. \"It will be a budget led by this government's values,\" she's set to say. \"Of fairness and opportunity and focused squarely on the priorities of the British people: protecting our NHS, reducing our national debt and improving the cost of living.\""
    },
    {
        "title": "'Vile and dangerous' strangulation pornography to be banned",
        "description": "Strangulation pornography will be banned following a review which found such images&#160;have helped to establish it as a sexual norm.",
        "url": "https://news.sky.com/story/vile-and-dangerous-strangulation-pornography-to-be-banned-13463440",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-phone-file_7071163.jpg?20251103214759",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-03 19:39:00",
        "Headline": "Non-fatal strangulation is already an offence in its own right, but it is not currently illegal to show it online.",
        "Content": "Strangulation pornography will be banned following a review which found such images have helped to establish it as a sexual norm. The possession and publication of images depicting strangulation and suffocation will be criminalised under the Crime and Policing Bill, which is currently making its way through parliament. Non-fatal strangulation is already an offence in its own right, but it is not currently illegal to show it online. Conservative peer Baroness Bertin warned earlier this year that there has been a \"total absence of government scrutiny\" of the pornography industry.  Her independent review, published in February, referred to worrying anecdotal evidence from teachers about students asking how to choke girls during sex. People acting out choking in their sex lives \"may face devastating consequences\", she said in the review. \n                  Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today\n                 \n                  Politics latest: Farage predicts early general election in 2027 due to 'economic collapse'\n                 \n                  Jeremy Corbyn reveals the number of people who have joined Your Party\n                 On Monday, the government confirmed it was putting forward amendments to the Crime and Policing Bill, which is due to come back before peers in the House of Lords for further scrutiny next week. As well as making strangulation or suffocation in pornography illegal, duties will be placed on online platforms to stop the spread of such images, the Ministry of Justice (MoJ) said. Another amendment will extend the time limit for victims of intimate image abuse, which can include so-called \"revenge porn\", to come forward to report such crimes. Currently, victims have six months to do so, but this will be extended to three years. Victims minister Alex Davies-Jones said the government \"will not stand by while women are violated online and victimised by violent pornography which is allowed to normalise harm\". She added: \"We are sending a strong message that dangerous and sexist behaviour will not be tolerated.\" Of strangulation pornography, Technology Secretary Liz Kendall said: \"Viewing and sharing this kind of material online is not only deeply distressing, it is vile and dangerous. Those who post or promote such content are contributing to a culture of violence and abuse that has no place in our society. \"We're also holding tech companies to account and making sure they stop this content before it can spread. We are determined to make sure women and girls can go online without fear of violence or exploitation.\"  The government said if the amendments were accepted, possession or publication of strangulation or suffocation in pornography would become a priority offence under the Online Safety Act. Technology firms would be legally required to take steps to stop such violent content reaching internet users, rather than simply waiting for it to be reported. The government suggested this could be done through moderation tools, stricter content policies or automated systems being used to detect and hide images. The British Board of Film Classification (BBFC) welcomed the planned changes, but said they must \"mark the beginning of broader reform to ensure parity between online and offline content standards\". Its chief executive David Austin said: \"Harmful depictions of non-consensual, violent and abusive activity continue to be readily accessible to UK users.\" The BBFC said it stands ready to take on \"the formal role of auditing online pornography\", which would be \"a natural extension of the role we have carried out offline for decades\". Bernie Ryan, chief executive of the Institute For Addressing Strangulation, welcomed the proposed ban, saying the \"serious risks posed by unregulated online content, especially to children and young people\" must be recognised. She added: \"Strangulation is a serious form of violence, often used in domestic abuse to control, silence or terrify. \"When it's portrayed in pornography, particularly without context, it can send confusing and harmful messages to young people about what is normal or acceptable in intimate relationships. Our research shows there is no safe way to strangle.\""
    },
    {
        "title": "Jeremy Corbyn reveals the number of people who have joined Your Party",
        "description": "Your Party membership stands at 50,000, Sky News can reveal.",
        "url": "https://news.sky.com/story/jeremy-corbyn-reveals-the-number-of-people-who-have-joined-your-party-13463413",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-zarah-sultana-jeremy-corbyn_7047994.jpg?20251024151019",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-11-03 18:58:00",
        "Headline": "Insiders fear that factional infighting has spurred members into joining the rival Green Party, led by Zack Polanksi.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n Your Party membership stands at 50,000, Sky News can reveal. The figure is well short of the 800,000 people who expressed interest when it launched, and it is significantly below the 100,000 to 200,000 insiders hoped would join officially as members following its launch in July. It puts the Zarah Sultana and Jeremy Corbyn-led party close behind the Liberal Democrats, whose membership has fallen to 60,000. Politics latest: Farage predicts early general election in 2027  While still deemed to be respectable to those involved in the party, the membership update has been taken as a warning that the factional infighting between Ms Sultana and Mr Corbyn has damaged its hopes of immediately building a mass movement. However, Your Party said it expects membership to increase as more members move over from the \"unauthorised\" membership portal launched by Ms Sultana on 18 September. Tensions between the two leaders reached a boiling point when Ms Sultana sent out unauthorised emails encouraging paid membership without Mr Corbyn's consent - while also claiming her actions were the result of being sidelined by a \"sexist boys club\". Mr Corbyn is expected to announce the 50,000 figure at a rally in Islington on Monday evening. He said: \"I am excited to announce that 50,000 people have now become members of Your Party. \"This major milestone reflects what Your Party is all about: a mass, democratic movement for change. From local rallies to mass regional assemblies, people up and down the country are coming together to build this party from the ground up. \"This is just the beginning. At the end of this month, we will host our founding conference. This will be the moment that members come together to launch our mass, democratic movement for real change.\" Ms Sultana's decision to launch her own membership portal in September culminated in a standoff over the control of £800,000 worth of donations, which has only just been resolved. The pot of money had been held by an entity called MOU operations - controlled by former Labour MP Beth Winter, former Labour mayor Jamie Driscoll and former South African politician Andrew Feinstein - who have now all quit. Sky News revealed last week that Ms Sultana now had sole control of the £800,000 and that she has assured Mr Corbyn that the money will be transferred to the party as a whole. It is understood the money has not yet been transferred in full. The money collected by MOU in membership fees is not expected to be transferred to Your Party as those who paid are entitled to a refund. Some 20,000 people signed up to Ms Sultana's portal but Your Party still does not have access to their emails, meaning there is no way of contacting them.  There are concerns within Your Party that the direct beneficiary of the row has been the Greens, led by Zack Polanski, whose membership has more than doubled to 150,000 people. Following the publication of the figures, Mr Polanski described the Greens as the \"only real opposition left in British politics\". Pointing to the threat he also poses to the Labour Party, which has slumped to 17 points in the polls, Mr Polanski said his desire was not to be \"disappointed\" with Labour but to \"replace them\". According to Labour's annual accounts published in August, party membership now stands at 333,235 - down from a peak of 532,046 at the end of 2019, when Mr Corbyn was still Labour leader. However, Sir Keir Starmer still leads the largest party in the UK. Read more:Inside Jeremy Corbyn's new party and the battle for leadershipThe battle for Your Party's soul continues As of August this year, the Conservatives were reported to have 123,000 members, while their rivals Reform have 266,172. In recent weeks, Ms Sultana - who has spoken favourably about some form of electoral pact with the Greens - has sought to draw clearer dividing lines with Mr Polanski. In a recent interview with Politics Joe, the Coventry South MP described Your Party as \"anti-Zionist\" and also suggested the UK should leave the military alliance NATO immediately. Mr Polanski, who is Jewish, has said he is proud of his identity but that he does not describe himself as a Zionist. He has also taken a more cautious stance on NATO than Ms Sultana, saying that while he supported the UK's eventual withdrawal he was not advocating for it to leave the alliance."
    },
    {
        "title": "Nigel Farage says Reform UK could cut minimum wage for young people - and defends U-turn on tax pledges",
        "description": "Nigel Farage has said Reform UK could cut the minimum wage for young people, saying there is \"an argument\" that it is currently \"too high\".",
        "url": "https://news.sky.com/story/nigel-farage-says-reform-uk-could-cut-minimum-wage-for-young-people-and-defends-u-turn-on-tax-pledges-13463252",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-reform-uk-nigel-farage_7070673.jpg?20251103170914",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-03 14:24:00",
        "Headline": "Mr Farage gave a wide-ranging news conference setting out Reform UK's economic plans, and defending claims of U-turning on 2024 election manifesto pledges.",
        "Content": "Nigel Farage has said Reform UK could cut the minimum wage for young people, saying there is \"an argument\" that it is currently \"too high\". Speaking at a news conference, he also said his manifesto promises at the last general election to bring in sweeping tax cuts were \"only ever aspirations\", and \"substantial tax cuts\" are \"not realistic\". In a broader defence of his insurgent party, Mr Farage insisted Reform UK is \"not a one-man band\", and he is building a team with expertise across a wide range of policy areas. Politics latest: Home secretary to make statement about stabbing attack The Reform UK leader made the comments in a speech and news conference with journalists in the City of London in which he pledged the party would be \"the most pro-business, the most pro-entrepreneurship government that has been seen in this country in modern times\". Asked in the news conference afterwards if he believes the minimum wage is too high, Mr Farage replied: \"There's an argument that minimum wage is too high for younger workers, particularly given that we've lowered the level at which NIC [employers' national insurance] is paid to £5,000 a year.\" This is a reference to Chancellor Rachel Reeves's decision at the last budget to reduce the threshold at which employers start paying national insurance contributions from £9,100 per year in salary to £5,000.  Making the argument that the change puts too much of a tax burden on businesses, stifling growth, Mr Farage told the chancellor to \"do one or the other, do one or the other - either lift the cap at which NI is due, or lower the minimum wage for younger workers\". The current hourly national minimum wage for apprentices and people under 18 is £7.55, for 18-20 year olds is £10, and for aged 21 and over is £12.21. Read more:Badenoch marks first year as Tory leaderMinister rules out airport-style security at train stations Manifesto tax cuts 'only ever aspirations' But Mr Farage is also being accused of U-turning on the tax cuts he pledged in Reform UK's 2024 general election manifesto, which was called \"Our Contract With You\". Key measures in the document included raising the minimum threshold of income tax to £20,000, raising the higher rate threshold from £50,271 to £70,000, abolishing stamp duty for properties below £750,000, and abolishing taxes on inheritances below £2m. But speaking on Monday, the Reform UK leader said: \"We want to cut taxes. Of course, we do. But we understand - substantial tax cuts, given the dire state of debt and our finances, are not realistic at this current moment in time.\" He said he would make \"some relatively modest changes\" immediately, which included scrapping the inheritance tax imposed on family farms, as well as family-run business, and \"raise the thresholds at which people start to pay tax\" - although he was not specific about the level at which he would put the thresholds. Challenged by a journalist on whether he is breaking his promises in order to join the mainstream of economic thinking, the Reform UK leader insisted the promises included in the party's 2024 manifesto \"were only ever aspirations\", and the changes made today are about the party \"being realistic about the state of the economy\".  'It's not a one-man band' Mr Farage also insisted that the Reform UK project is not his alone, saying they will be announcing new people to cover various different policy areas in the coming weeks. He said: \"What I've tried to do really hard this year is to get away from this idea, this criticism, that somehow it's a one-man band. It's not a one-man band. \"There's a broadening team. They're sitting there in front of you on the front row - from David Bull, to Lee Anderson, to Richard Tice, to Danny Kruger, and indeed Zia Yusuf as well. And there are others, and there'll be more.\" He also explained he is not yet ready to say who his chancellor might be, or who would fill the top cabinet roles in a potential future Reform government. Reform UK is 'in chaos' In response to the speech, a Labour Party spokesperson said: \"Nigel Farage has promised a return to damaging austerity, taking an axe to public services, with no cuts off the table. He complained the minimum wage is too high for young workers, while doubling down on his golden giveaway to foreign billionaires. \"Reform would slash the NHS, schools, and pensions - and cancel Labour's investment in local roads, rail, and clean energy, putting millions of jobs at risk and wreaking havoc on family finances. \"Only this Labour government is fixing the long-term damage to our economy to renew Britain. And the Conservative shadow chancellor Sir Mel Stride said Mr Farage \"left the public with far more questions than answers\" by not specifying which parts of his manifesto his party stands by. He added Reform could not be taken seriously on the economy \"when their promises disintegrate after five minutes, and they remain committed to extra welfare spending and a huge expansion of the state\". \"After this rambling, incoherent speech, it is clear Reform's economy policy is in chaos,\" Sir Mel said. \"Farage might claim he's not a 'one-man band', but he can't even tell us who his chancellor would be. This is not serious, it is just more announcements without a plan.\""
    },
    {
        "title": "Nigel Farage pivots on economy - will his original supporters be in favour?",
        "description": "Nigel Farage has long known he would need to overhaul Reform UK's offer on the economy, not least because of the scale of the attack it faced over conference season.",
        "url": "https://news.sky.com/story/nigel-farage-pivots-on-economy-will-his-original-supporters-be-in-favour-13463288",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nigel-farage-reform-uk_7070774.jpg?20251103152317",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-11-03 14:16:00",
        "Headline": "As Nigel Farage threatens a benefits crackdown and becomes the only party to put changes to the triple lock on the table, will Reform UK's original voters still be as strongly in favour?",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Nigel Farage has long known he would need to overhaul Reform UK's offer on the economy, not least because of the scale of the attack it faced over conference season. According to the Institute for Fiscal Studies, last year's manifesto plans would cost nearly £90bn per year, with spending increases alone of £50bn. They claimed they would pay for these through £150bn per year of reductions in other spending, covering public services, debt interest and working-age benefits - eyewatering sums that the other parties felt left Reform UK exposed. So in traditional Nigel Farage fashion, Monday comes the pivot. Politics live: Farage predicts early general election in 2027 In a speech in the City, Farage said that large upfront tax cuts were no longer on the agenda because of the state of the economy. He said significant but \"sensible\" deregulation was needed to take advantage of post-Brexit freedoms, and put public sector pensions and even the triple lock (up for consideration but no decisions have been made) on the table. \n                  Nigel Farage says Reform UK could cut minimum wage for young people - and defends U-turn on tax pledges\n                 \n                  Tories and Reform: From feud to love-in?\n                 \n                  Caerphilly by-election: Just like that! In Tommy Cooper's birthplace, Farage nowhere to be seen as Reform loses\n                 \"We want to cut taxes. Of course we do. But we understand substantial tax cuts given the dire state of debt and our finances are not realistic,\" he told the 100-strong audience. Read more politics news:Security scanners at train stations ruled outEx-councillor in court over Westminster blackmail allegation Farage has to walk a fine line He was unapologetic that he could not say when or by how much taxes would be lowered. He said: \"If I'm right and that election comes in 2027, then the economy will be in an even worse state than any of us in this room can even predict. How can anybody project on pensions and thresholds or any of those things between now and then?\" But he must walk a fine line - both claiming to be consistent as a politician while changing his stance. And more broadly, given we have had \"Brexit Nigel\" and \"trade-union Nigel\" and \"small state Nigel\" and \"nationalisation Nigel\" - which all, I pointed out to him, line up like Barbies on a toy shelf today - I asked him why we should now suddenly trust \"fiscal responsibility Nigel\" and that this survives to and beyond the next general election? His answer was instructive - saying that while his principles and ideology has been consistent, he conceded the practical application has had to evolve. 👉Listen to Politics at Sam and Anne's on your podcast app👈 He said: \"I believe in pretty much the same sort of things I believed in 30 years ago. The difference is I now understand more than I did the role of the state in strategic industries. \"That's why Richard Tice and I went to Scunthorpe... Have I adapted over 30 years into believing that the country needs an industrial strategy? \"Yes. Do I believe that actually, in certain failing industries, you know, a short-term partial nationalisation where, by the way, the bondholders and shareholders get wiped out? It doesn't cost the government to do it.\" Interesting insight This is an interesting insight into a politician who was associated with a certain strand of conservatism. He hopes political evolution works in his favour. But the history of candour in British politics does not always favour the brave, as George Osborne discovered in late 2009. As Farage threatens a benefits crackdown and becomes the only party to put changes to the triple lock on the table, will Reform UK's original voters still be as strongly in favour?"
    },
    {
        "title": "Ex-Labour councillor appears in court over Westminster blackmail allegation",
        "description": "An ex-Labour councillor has appeared in court charged with blackmail after an investigation into an alleged Westminster honeytrap.",
        "url": "https://news.sky.com/story/ex-labour-councillor-appears-in-court-over-westminster-blackmail-allegation-13463279",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-oliver-steadman-court_7070737.jpg?20251103143118",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-03 13:52:00",
        "Headline": "Oliver Steadman, 28, has been charged with one count of blackmail and five counts of sending offensive, indecent, obscene or menacing messages by a public communication network.",
        "Content": "An ex-Labour councillor has appeared in court charged with blackmail after an investigation into an alleged Westminster honeytrap. Oliver Steadman, 28, is charged with one count of blackmailing then-senior Conservative MP William Wragg for the contact telephone numbers of up to 12 people. Mr Wragg resigned the party whip in April 2024 after he admitted giving politicians' phone numbers to a suspected scammer he met on a dating app. Steadman, of Islington, north London, has also been charged with five counts of sending offensive, indecent, obscene or menacing messages by a public communication network. He appeared at Westminster Magistrates' Court on Monday. During the brief hearing, Steadman, who wore a dark suit, spoke only to confirm his name, date of birth and address. The charges span the period 8 October 2023 to 31 March 2024. \n                  Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today\n                 \n                  Politics latest: Farage predicts early general election in 2027 due to 'economic collapse'\n                 \n                  'Vile and dangerous' strangulation pornography to be banned\n                 Prosecutor Vincent Scully said they are all linked. Steadman was granted unconditional bail and is due to next appear at Southwark Crown Court on 1 December."
    },
    {
        "title": "Government rules out airport-style security scanners at train stations following stabbing attack",
        "description": "The transport secretary has ruled out installing airport-style security scanners in stations, following an alleged stabbing attack on a train on Saturday evening.",
        "url": "https://news.sky.com/story/government-rules-out-airport-style-security-scanners-at-train-stations-following-stabbing-attack-13463117",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-armed-police-st-pancras_7070430.jpg?20251103093407",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-03 09:41:00",
        "Headline": "Heidi Alexander told Sky News that the government does not want to make \"life impossible for everyone\" by dramatically expanding train station security checks.",
        "Content": " The transport secretary has ruled out installing airport-style security scanners in stations, following an alleged stabbing attack on a train on Saturday evening. Speaking to Mornings with Ridge and Frost on Sky News on Monday, Heidi Alexander said the government did not want to make \"life impossible for everyone\". Chris Philp, the Conservative shadow home secretary, has called for \"tough and radical action\" to tackle knife crime, including rolling out live facial recognition technology in town centres and train stations. Politics latest: Farage to set out economic policies The questions around security on public transport comes after 10 people were injured in an alleged mass stabbing attack on a high-speed train on Saturday, and a train staff member - hailed as a hero for confronting the attacker - remains in a critical but stable condition. A 32-year-old man from Peterborough has been charged with 11 counts of attempted murder following the attack on the Doncaster to London King's Cross LNER service near Huntingdon, and another at a station on London's Docklands Light Railway (DLR), early on Saturday morning. Asked by Mornings presenter Sophy Ridge if airport-style scanners should be installed at railway stations to ensure public safety on trains, the transport secretary replied: \"I don't think airport-style scanners would be the way to go. \"I understand why you asked the question, and I understand why some of your viewers might be wondering about that. \"We have thousands of railway stations across the UK, and those stations have multiple entrances, multiple platforms. So what we can't do is make life impossible for everyone. \"But we do need to take sensible and proportionate steps to make the public transport network safe.\" She also said there will be increased \"visible\" police patrols at train stations for \"the next few days\" to provide reassurance to the travelling public. News correspondent For commuters at King's Cross station in London - one of the busiest in the country - it will have been hard not to think of Friday night's incident in Cambridgeshire.\n\n This morning, I caught the train with passengers heading into the capital, ready for a new week.  Pulling into the concourse, we were immediately met with a handful of police community support officers watching passengers as they spilled off the train. Home to the Eurostar service, the presence of armed police is a familiar sight at King's Cross and London St Pancras.\n But today additional officers from the Met have been deployed to major stations. \n\n The idea is to reassure passengers they are safe on the train network.\n\n Outside the station, we met grandparents Tracy and Darren from Yorkshire who had travelled down on Saturday morning on the same LNER service that was affected on Friday for a Marti Pellow concert at the O2.\n\n \"We were absolutely terrified, we were both really scared,\" Tracy told me.\n\n \"We got on the same train line that it happened the night before.\"\n\n Darren and Tracy are returning to Yorkshire this morning. They are among many who would welcome additional security on the railways.\n\n Darren says: \"I'm not going to lie, it makes you worry about like your safety. Are you safe on the trains? No, you're not.\"\n\n Today's additional police presence is meant to provide reassurance - but will just two days of extra security be enough to calm the concern?\n\n  Ms Alexander went on to say that, while she does not want to minimise the \"horrific\" attack on Saturday, the trains in the UK are \"some of the most safest [sic] forms of public transport anywhere in the world\", saying that for every million journeys, there are 27 crimes committed. She added: \"For me, one crime is one crime too many. So we will, after this, review all of our security measures, because that is the right thing to do.\" But Conservative shadow home secretary Chris Philp told Mornings with Ridge and Frost that there needs to be more \"surge hotspot policing in high crime areas\" to tackle knife crime, and the use of \"live facial recognition to identify wanted criminals as they wander round, including as they go to train stations, so they can be arrested\". \"We also need more stop and search as well because stop and search takes knives off the streets,\" he added.  Last week, the government released new data showing that knife homicides have fallen by 18% in a year, while knife crime overall has dropped by 5% - the first reduction in four years. The Home Office attributed that to the use of hotspot patrols, knife arches that can detect knives in environments like schools, drones, and plain clothes officers, as well as partnerships with campaigners and charities."
    },
    {
        "title": "Farage rips into Keminomics",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>",
        "url": "https://news.sky.com/story/farage-rips-into-keminomics-13462988",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-politics-sam-coates_7021320.jpg?20250915170446",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-03 07:45:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈 As speculation grows as to what could and could not be included in the budget, do Reform UK have a credible and alternative plan for the economy? Sam and Anne discuss how and where Nigel Farage will pitch his party on the economic front ahead of a key speech in the city, described by some as \"bombproof\". The duo also consider which sectors could be impacted by the upcoming budget and how the government might sell potential tax rises to voters."
    },
    {
        "title": "Attendance allowance: The helpful weekly benefit more than 1m Britons are missing out on",
        "description": "Around 1.9 million people in Britain are claiming attendance allowance, according to the&#160;latest figures&#160;from the Department of Work and Pensions.&#160;",
        "url": "https://news.sky.com/story/attendance-allowance-the-helpful-weekly-benefit-more-than-1m-britons-are-missing-out-on-13463284",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-money-istock_7065633.jpg?20251029092113",
        "type": "Strange",
        "Author": "Jess Sharp",
        "Date Published": "2025-11-03 14:05:00",
        "Headline": "Are you among the one million people missing out on a benefit worth up to £110.40 a week? Here's everything to know about attendance allowance.",
        "Content": "\n          Money live reporter\n              @JournoJess97\n Around 1.9 million people in Britain are claiming attendance allowance, according to the latest figures from the Department of Work and Pensions.  But as many as 1.1 million are thought to be missing out on the helpful benefit that can give you up to £110.40 a week. Here we explain what attendance allowance is, who can claim it and how to apply for it... What is it?  Attendance allowance is a non-means tested benefit available to pensioners with a disability or health condition that is so severe that they require someone to help them complete daily tasks. In Scotland, the benefit is called the pension age disability payment. Find latest tips and deals in the Money blog Who can claim it? To claim, you must be state pension age and have needed care or support for at least six months. This could be due to an illness, physical or mental disability or a learning difficulty. If you are terminally ill, you can claim without waiting for six months. According to the latest data, the majority of claimants in February had arthritis, followed by dementia and heart disease. You must be in Great Britain when you claim and have been in the country for at least two of the past three years. If you claim disability living allowance, personal independence payment, adult disability payment or Scottish adult disability living allowance, you will not be eligible. You can't usually get attendance allowance if you live in a care home and the council is paying for your care. If you are paying for your place in a care home, you can still claim. Read more from Money:Why millions of Britons are off work long-term sickWill two major airlines cough up for reader's £4,000 wheelchair?'I lent my neighbour £1,000 and they won't give it back' How much can you get?  It is paid at two different rates, and how much you are entitled to depends on the level of care you need. This means that even if you're not currently getting support from a carer, as long as you can show you need it, you could be eligible for the benefit. It is tax-free and not means-tested, so how much you earn or the amount you have in savings will not affect your payments. Here's a look at the rates and how they are determined... How to claim If you think you might be eligible for attendance allowance, you can apply online here or by post. To apply, you'll need: Within three weeks of applying, you will get a text or letter detailing when you will find out if you can claim the payments. You might be required to have an assessment to work out how much your condition is affecting your life. You will get a letter when a decision has been made that explains the outcome. In this letter, you will find out when you'll get your first payment. The amount will be paid straight into your bank account, and you will typically receive it every four weeks. If you're terminally ill If you are of state pension age and a medical professional has said you might have 12 months or less to live, you will get the higher rate of £110.40 a week, and you will not need to wait six months to apply. You can claim for yourself, or someone can make the claim on your behalf, as long as they have your permission. You will need to ask a medical professional to fill in an SR1 form. They will either give it to you or send it directly to the Department for Work and Pensions. You will then apply in the way detailed above."
    }
]