[
    {
        "title": "Greenland issue the most serious crisis in transatlantic relations in decades - where do we go from here?",
        "description": "Keir Starmer had wanted this week to get on with his \"cost of living tour\" of the country to tap into voters' concerns in this all-important election year.",
        "url": "https://news.sky.com/story/greenland-issue-the-most-serious-crisis-in-transatlantic-relations-in-decades-where-do-we-go-from-here-13495988",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-greenland_7135134.jpg?20260114133538",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-18 19:26:00",
        "Headline": "The prime minister will attempt to negotiate with Trump to see off the tariff threat, but he will not back down over the principle of the sovereignty of Denmark. ",
        "Content": "\n          Political editor\n              @BethRigby\n Keir Starmer had wanted this week to get on with his \"cost of living tour\" of the country to tap into voters' concerns in this all-important election year. Donald Trump's Greenland threat obstructed that: Over the weekend, the prime minister and his team have been locked in talks in Downing Street, and with European allies, over how to respond to President Trump's latest audacious move. The president's threat to apply an additional levy on goods from France, Germany, the Netherlands, Norway, Sweden and Finland from 1 February is a moment of huge escalation in tensions between allies over Greenland that has astonished and angered. \"It's through the looking glass,\" opined one official. \"We don't know if he's going to back down, what if he doesn't?\"  Starmer holds 'short and cordial' call with Trump over Greenland tariff move - latest updates For now, the prime minister and his team are working to get him to do exactly that. \"As before, we're taking a deep breath and using relationships to figure out exactly where the US are before reacting to every social media post,\" said one figure involved. \"What the PM has said publicly illustrates how we feel and how we have been working on it this weekend.\" Read more: Why Trump says the US 'needs' Greenland - and what the fallout could be Mr Starmer said on Saturday that the decision to impose 10% tariffs on the UK and seven other European countries was \"completely wrong\" and reiterated his position that the future of Greenland is \"a matter for the Greenlanders and the Danes\". On Sunday, the UK issued another joint statement with Denmark, Finland, France, Germany, the Netherlands, Norway and Sweden, warning that \"tariff threats undermine transatlantic relations and risk a dangerous downward spiral\". This escalation appears to have perhaps been sparked by the decision by these eight European NATO members to carry out a reconnaissance mission to Greenland in recent days. Prime Minister Meloni of Italy, who spoke to President Trump on Sunday morning, said the White House may have misunderstood the military exercise and not realised it was directed against Russia and China and not the US. \"There could have been a problem of understanding and communication,\" she said. \"It seems to me that the risk is that the initiatives of some European countries were interpreted as anti-American, which is clearly not the intention.\" Allies have since reiterated that point, saying in their Sunday statement that they were \"committed to strengthening Arctic security as a shared transatlantic interest\". The \"pre-co-ordinated Danish exercise Arctic Endurance, conducted with Allies, respond to this necessity. It poses no threat to anyone\". The allies' intention is to work with the US to strengthen High North security, and this will be the message the prime minister will make when he speaks on the latest developments this week. Read more:How NATO's collective defence clause worksAnalysis: Trump likely gambling he can get away with Greenland grabColombia, Cuba, Mexico, Greenland or Iran - where could Trump strike next? One senior government official said the Trump administration was \"not listening to calibrated language when the UK and other European capitals [say they] believe in Arctic security\". European leaders at the annual Davos summit this week - the PM is currently not expected to be attending - will want impress upon him that allies want to work with the US through NATO. But the big unknown is whether the US wants to work with European allies through NATO. When it comes to Greenland and security in the High North, President Trump seems to want to work unilaterally. He has made it clear from the early days of his administration that he wants to annex Greenland, build a bigger America and use this landmass to strengthen US security. The Danes have clearly told President Trump that he could massively expand US security presence on Greenland, as written into previous treaties, but that doesn't seem to be enough. It is almost as if President Trump, not a fan of multilateralism, is trying to undermine NATO, just as he is undermining the United Nations by drawing up a Board of Peace to supervise Gaza's transitional administration. He's also asking 60 countries to contribute $1bn if they want their membership on the board to extend beyond three years. After fulfilling its initial aim to end the conflict in Gaza, the board would then expand to tackle conflicts elsewhere. On both fronts, President Trump is choosing to turn away from international bodies. It is a clear pattern. Last week, he announced his intent to withdraw the US from 66 multilateral forums and retracted billions of dollars in spending from international organisations. This latest rupture is a reflection of how, in just a year, the certainties that have underpinned our global order have come undone. The US has shifted from being the foundation stone of the Western alliance to an unreliable ally. The threats over Greenland must be a red line for the UK and other allies. On that, the UK is clear. The prime minister will attempt to negotiate with Trump to see off the tariff threat, but he will not back down over the principle of the sovereignty of Denmark. Expect Keir Starmer to reiterate the UK's position while also trying to reiterate the UK's close relationship with the US. I would not expect the PM to use the language of President Macron, who spoke of intimidation and threats, over President Trump's tariff warning. Instead, the PM will make the case this week that the tariffs are not sensible and not in the interests of the UK or the US. Back on to what he wants to spend his time talking about, the cost of living, he is also expected to draw a clear line between the need to engage in international affairs to try to drive down household bills at home. But this is a difficult moment for a prime minister who has prided himself on his ability to negotiate with President Trump to secure better trading terms with the UK. Lib Dem leader Ed Davey said on Sunday the PM's \"US policy lies in tatters\" as NATO allies are \"punished\" by Trump for \"doing the right thing\". As for the tariffs, as of Sunday, the government were not sure about the implications of the Trump threat, with information scant on how this particular 10% tariff might apply. It is possible that the threat will fall away - as happened with the 100% levy on films made outside the US. But these tensions could also escalate - and all the options are deeply worrying. From levies and trade wars, to the disintegration of NATO and withdrawal of support for Ukraine. What if the US did decide to use force to take Greenland? Would European armies end up in conflict with the US? All of it seems unconscionable in a situation that is fast becoming the most serious crisis in transatlantic relations in decades. The UK will do all it can to try to de-escalate, but it won't back down."
    },
    {
        "title": "Conservative MP Andrew Rosindell defects to Reform UK",
        "description": "Andrew Rosindell has become the second Conservative MP to defect to Reform UK within a week.",
        "url": "https://news.sky.com/story/conservative-mp-andrew-rosindell-defects-to-reform-uk-13496013",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-andrew-rosindell-reform_7139146.jpg?20260118201331",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-18 22:00:00",
        "Headline": "The MP for Romford announced he had decided to resign from his position as a shadow foreign office minister, days after Robert Jenrick did the same.",
        "Content": "Andrew Rosindell has become the second Conservative MP to defect to Reform UK within a week. The MP for Romford, Essex, announced on Sunday evening he had decided to resign from his position as a shadow foreign office minister in Kemi Badenoch's frontbench and as a member of the Conservative Party. The move came after former senior Tory Robert Jenrick defected on Thursday. It takes the total number of MPs in Reform UK to seven. Both Nigel Farage and Mr Jenrick welcomed Mr Rosindell to the party, calling him a \"patriot\". Mr Rosindell, who has been an MP since 2001, said it was time to put \"country before party\" in a statement announcing his defection. \"Since joining the Conservative Party at the age of 14, I have been a loyal and committed supporter of the principles advocated by Margaret Thatcher that have always underpinned my own political beliefs,\" he wrote. \"However, the time has come to put country before party. \"The failure of the Conservative Party both when in government and more recently in opposition to actively hold the government to account on the issue of Chagossian self-determination and the defence of British sovereignty, represents a clear red line for me.\" Political correspondent Andrew Rosindell certainly isn't as high profile as Robert Jenrick or Nadhim Zahawi, the two Conservatives who defected to Reform UK last week.  But Rosindell was a junior shadow minister who had been a member of the Tory party since the age of 14,  elected to parliament 23 years ago. The move increases Reform UK's number of seats in parliament to seven. That's a 40% increase since the start of the year.  What's more potentially embarrassing for Kemi Badenoch is that his stated reasons for jumping ship echo the devastating critique made by Jenrick just last week about his \"rotten\" former party. \"Sadly, I now believe that the Conservative Party is irreparably bound to the mistakes of previous governments and unwilling to take meaningful accountability,\" he said.  It's particularly painful as it amplifies the attacks Labour have been making on the Tories since winning the last election. Last Friday Badenoch told Sky News her party was more united because of the defenestration of her rival Jenrick. She insisted no other shadow cabinet members would follow.  Andrew Rosindell wasn't in the shadow cabinet, and he's survived a series of controversies – but his loss is still embarrassing, however much Tory sources suggest Reform are welcome to him. We'll have to wait to find out if these recent defections and Nigel Farage's 7 May deadline for anyone considering following suit will lead to a rush of other new recruits.  But the momentum is certainly with Reform and against the Tories, and that's clearly not a comfortable position for Kemi Badenoch to be in.  A Conservative Party source said Mr Rosindell had threatened to defect for months but denied he was doing so until as recently as Saturday. \"The Conservative Party supported Rosindell throughout his many troubles, and he's responded by stabbing his friends, colleagues and activists in the back. Reform are welcome to him,\" the source said. Meanwhile, Labour Party chairwoman Anna Turley said the \"stench of a failed and drying Tory party engulfs Reform\" and a spokesperson for the Liberal Democrats said Mr Rosindell's defection \"isn't a political earthquake\". \"It's a change of rosette for a career politician worried about getting a P45,\" they said. \"The public are fed up hearing about how Britain is broken from the very same people who broke it.\" Read more:All the former Conservative MPs who have defected to Reform?Jenrick defection makes it more likely Reform will win general election, says Yusuf Andrew Rosindell first joined the Tory party at the age of 14. He was elected to represent Romford, Essex, in 2001 and was re-elected in 2024. In parliament, he has previously served as shadow minister for home affairs between 2007 – 2010 and was a long-time advocate of Britain's withdrawal from the European Union. He belonged to a small group of Conservatives who voted against the Brexit withdrawal agreement each time it was put before the House. Rosindell also long campaigned for the Union flag to be flown on all public buildings across the UK, according to his website.  In 2010, it was granted that the Union flag will be flown every day and all year from the Victoria Tower of the Palace of Westminster, which Rosindell had been campaigning for. He is now chairman of the Flags & Heraldry Committee group in Parliament. Following the defection of Mr Rosindell, Mr Jenrick and, before that, former Conservative chancellor Nadhim Zahawi, Tory leader Kemi Badenoch said she was \"100% confident\" she would not see any more of her shadow cabinet leave for Reform. It comes as the party, headed by Mr Farage has set 7 May - the date of crucial local elections in which they hope to make significant gains - as a cut-off point for admitting current and former MPs, as well as for local councillors to defect. Asked if she would be on alert for MPs seeking to switch sides before the elections, Ms Badenoch told the Press Association news agency: \"I think people should be wondering why they set that deadline.\""
    },
    {
        "title": "Hillsborough Law debate withdrawn after backlash from campaigners and MPs",
        "description": "The government has pulled an amendment to its&#160;proposed Hillsborough&#160;Law amid concerns from campaigners and some MPs that intelligence agencies could use it&#160;to \"hide serious failures\" from the public.",
        "url": "https://news.sky.com/story/hillsborough-law-debate-withdrawn-after-backlash-from-campaigners-and-mps-13495967",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-hillsborough-family_7139098.jpg?20260118185443",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-18 18:44:00",
        "Headline": "The government says it will work with campaigners and bereaved families to bring forward amendments when the bill reaches the House of Lords. ",
        "Content": "The government has pulled an amendment to its proposed Hillsborough Law amid concerns from campaigners and some MPs that intelligence agencies could use it to \"hide serious failures\" from the public. It has also withdrawn the legislation from Monday's parliamentary agenda entirely after initially planning for its report stage and third reading to go ahead and then bring forward amendments in the House of Lords. Sky News' deputy political editor Sam Coates said one figure close to the talks described the situation as \"absolutely mental\". The law, officially called the Public Office (Accountability) Bill, is designed to make sure authorities face criminal sanctions if they attempt to cover up the facts behind disasters such as the 1989 Hillsborough tragedy, the Grenfell Tower fire and infected blood scandal. One of the amendments suggested by the government this week meant that spies would be within the scope of the legislation. However, they would only be forced to tell the truth if the head of their service approved it. Campaign group Hillsborough Law Now argued that it could allow intelligence services to \"hide serious failures behind a vague claim of national security\". Now, the government has decided not to push ahead with the amendment, but to work with campaigners and bereaved families to bring forward amendments when the bill reaches the Lords. \n                  Hillsborough Law delayed after backlash\n                 \n                  Hillsborough families hit out at report into disaster - as it finds 12 police officers would have faced gross misconduct cases\n                 \n                  Hillsborough: Long-awaited report into Britain's worst-ever sporting disaster to be published today\n                 Read more:Hillsborough Law: What is it, why was it delayed and what happens next?Hillsborough campaigners hail 'momentous' step as bill introduced \"This legislation will right the wrongs of the past, changing the balance of power to ensure the state can never hide from the people it should serve and putting a legal duty on officials to respond openly and honestly when things go wrong,\" said a government spokesperson. \"The bill will make the police, intelligence agencies and the whole of government more scrutinised than they have ever been, but we can never compromise on national security. \"We will continue to work with all parties to make sure the bill is the strongest it can possibly be, without compromising national security.\" Hillsborough Law Now welcomed the move, posting on X: \"We welcome the government listening to the campaign, families, MPs and supporters by withdrawing their security services amendment. \"We shall engage further with government to ensure the bill fully applies to the security services whilst not jeopardising national security.\" Before the amendment was withdrawn, Liverpool City Region mayor Steve Rotheram and Greater Manchester mayor Andy Burnham said it risked \"undermining the spirit of the legislation\" and \"creates too broad an opt-out\" for the security services. Liverpool West Derby MP Ian Byrne had said he would not be able to support the legislation with the government's amendments included because of \"security service carve-outs\". He had tabled amendments of his own that seek to ensure the duty of candour applies to intelligence officers without such exceptions."
    },
    {
        "title": "Greenland crisis: Unleashing Europe's most powerful trade weapon on the US was previously unthinkable - not anymore",
        "description": "The mood in Brussels is a mixture of determination and deep concern.",
        "url": "https://news.sky.com/story/greenland-crisis-unleashing-europes-most-powerful-trade-weapon-on-the-us-was-previously-unthinkable-not-anymore-13495977",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-eu-flags-trump_7139182.jpg?20260118212410",
        "type": "Home",
        "Author": "Alistair Bunkall",
        "Date Published": "2026-01-18 19:24:00",
        "Headline": "Days away from the World Economic Forum, where European leaders and Trump will gather, EU ambassadors met in Brussels to discuss how to respond to the US president's tariff threats over Greenland. ",
        "Content": "\n          Europe correspondent\n              @AliBunkallSKY\n The mood in Brussels is a mixture of determination and deep concern. There is, finally, a realisation that President Trump isn't bluffing in his desire to \"own\" Greenland and a recognition that diplomacy with the erratic US leader might not work this time. There is also unanimous agreement in European capitals that a forced seizure of Greenland cannot be allowed and the tariffs announced on Saturday against eight countries, including the UK, are wrong. This is fast becoming the biggest transatlantic crisis in generations.  Trump latest: Follow live updates There is no agreement in yet on how to respond. EU Ambassadors met in Brussels late on Sunday evening to discuss options and assess national positions. French President Emmanuel Macron is pushing for the strongest response: triggering the EU's anti-coercion instrument. This is a lever originally designed to fend off states hostile to the EU, such as China, not something to be used against one of the continent's historically closest allies. Taking this option would allow the EU to impose retaliatory tariffs on the US, limit US investment and trade with Europe and restrict access to the single market. It's the bloc's most powerful trade weapon; it's never been triggered before and using it against Washington would have been previously unthinkable. Not any longer. It would almost certainly prompt a backlash from Trump, but it would show the EU is no longer willing to be pushed around by the White House. Another option being considered is delaying the ratification of the EU-US trade deal that was agreed last summer. The EU might feel like it's on firm ground here, having finally signed a major free trade agreement this weekend with five South American countries known as the Mercosur bloc. The countries involved in this agreement account for around 30% of global GDP and the deal will affect around 700 million consumers. Although a suspension of the EU-US trade deal would also impact Europe, Brussels might feel it's in a stronger position than Washington here. The third option is to continue with diplomacy and keep fingers crossed for a breakthrough. Trump said the new tariffs won't kick in until 1 February - that gives the EU and London a window to act. Trump has repeatedly threatened tariffs against countries, only to then delay, reduce or quietly scrap them. The World Economic Forum gets under way in the Swiss resort of Davos this week. Read more from Sky News:Greenland situation is critical for Europe and NATOUS 'wants countries to pay $1bn to stay on Gaza peace board' Many of Europe's leaders will be there, as will Trump and the NATO secretary general. It will be an opportunity for some of them to get in the same room and have face-to-face talks with the US president. But they will need a stick to wield, so Brussels has only a few days to come up with agreed measures of retaliation to use as leverage and then hope Trump climbs down the ladder."
    },
    {
        "title": "Doctors warn of 'horrific' impact of tech and devices on children and young people's health",
        "description": "Doctors and medical experts have warned of the growing evidence of \"health harms\" from tech and devices on children and young people in the UK.",
        "url": "https://news.sky.com/story/doctors-warn-of-horrific-impact-of-tech-and-devices-on-young-peoples-health-13495803",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-mobile-phone-child_7098058.jpg?20260118131341",
        "type": "Home",
        "Author": "Bethany Minelle, news reporter",
        "Date Published": "2026-01-18 10:55:00",
        "Headline": "The Academy of Medical Royal Colleges says it wants to highlight the risks of unrestricted content and screen time to children and young people.",
        "Content": "By Bethany Minelle, news reporter  Doctors and medical experts have warned of the growing evidence of \"health harms\" from tech and devices on children and young people in the UK. The Academy of Medical Royal Colleges (AoMRC) said frontline clinicians have given personal testimony about \"horrific cases they have treated in primary, secondary and community settings throughout the NHS and across most medical specialities\". The body, which represents 23 medical royal colleges and faculties, plans to gather evidence to establish the issues healthcare professionals and specialists are seeing repeatedly that may be attributed to tech and devices. It intends to highlight the sometimes-hidden risks of unrestricted content and screen time to children and young people and provide guidance to the medical profession about how to identify and manage the harm being done. The academy said it already had \"evidence of the impact on children and young people's physical and mental health both from excessive screen time as well as exposure to harmful online content\". It says the work is due to be completed within three months. The letter was sent to Health Secretary Wes Streeting and Science and Technology Secretary Liz Kendall. \n                  Mum of baby who fell seriously ill after being given now-recalled infant formula calls for investigation\n                 \n                  Screen time linked to poor speech development in under-fives, say ministers as parents offered new guidance\n                 \n                  'My daughter was diagnosed with childhood dementia before she turned four - what we were told is criminal'\n                 Chief executive of the National Institute for Health Research, Lucy Chappell, and the UK government's chief medical adviser, Sir Chris Whitty, were also sent a copy. Dr Jeanette Dickson, chair of the academy, told The Sunday Times: \"Without doubt, we are seeing the beginning of a public health emergency with our own eyes. Everywhere we look, we see children and adults glued to their screens. \"I really worry for children, some of whom are self-evidently imprisoned in a digital bubble.\" Recent government research linked screen time to poor speech development in under-fives. It comes as the government prepares to announce plans to restrict the use of social media for under-16s. A consultation is expected to be launched this week. Options range from a full ban to limited interventions, including time restrictions and tighter algorithm controls. In December, Australia introduced a ban on under-16s having social media accounts. Many other countries around the world, including France, Denmark, Norway and Malaysia, are now considering similar bans. However, some children's and online safety organisations say a blanket ban is not the right way forward. A joint statement, signed by 43 child protection charities and online safety groups, including the NSPCC and the Molly Rose Foundation, alongside academics and bereaved families, warned of serious unintended consequences that could put children at greater risk. They wrote: \"Though well-intentioned, blanket bans on social media would fail to deliver the improvement in children's safety and wellbeing that they so urgently need. They are a blunt response that fails to address the successive shortcomings of tech companies and governments to act decisively and sooner.\" Andy Burrows, chief executive of the Molly Rose Foundation, told Sky News: \"We're really concerned that parents and parliamentarians are being presented with a false binary right now, the idea that either we proceed with an outright ban and or we continue with the appalling status quo in which children are coming to harm. Those simply aren't the only options available to us\". He also called on Prime Minister Sir Keir Starmer to \"do the right thing\". Mr Burrows said: \"What we've seen is an online safety act that was watered down because of the political chaos over the last few years. It is not strong enough. It is not being enforced robustly enough. \"But we can take action… We can make sure that the tech companies face the fines and the criminal sanctions that will finally make them address these issues. But it needs Keir Starmer to be listening to this groundswell of concern from parents, from experts, and then to do the right thing.\" In another statement, Chris Sherwood, chief executive of the NSPCC, highlighted the \"countless children\" for whom the internet is \"a lifeline,\" describing it as \"a source of community, identity, and vital support\". He said: \"A blanket ban would take those spaces away overnight and risks driving teenagers into darker, unregulated corners of the internet.\" Mr Sherwood also urged change from online platforms themselves, saying: \"Tech companies must be held accountable by Government and Ofcom for their harmful design choices, their reckless algorithms, and their failure to take responsibility for dangerous content.\""
    },
    {
        "title": "US 'wants countries to pay $1bn to stay on Gaza peace board'",
        "description": "Donald Trump wants countries to pay $1bn to be permanent members of the US-backed Board of Peace, according to reports.",
        "url": "https://news.sky.com/story/us-wants-countries-to-pay-1bn-to-stay-on-gaza-peace-board-13495801",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-tony-blair_7137765.jpg?20260118164503",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-18 10:53:00",
        "Headline": "Israel says they have not coordinated with the US over the structure of the Trump-backed Board of Peace.",
        "Content": "Donald Trump wants countries to pay $1bn to be permanent members of the US-backed Board of Peace, according to reports. The Board of Peace will form a key part of the Gaza peace process but a statement from the office of Israeli prime minister Benjamin Netanyahu has said the US did not coordinate its creation with them. Israel's foreign minister Gideon Saar would raise the issue with US Secretary of State Marco ‍Rubio, the statement added. The Board of Peace, unveiled by the White House ‌on Friday, will be chaired by Donald Trump and tasked with supervising Gaza's transitional administration. It would include 11 members who will be part of an executive board, plus additional members. The US administration has reached out to around 60 countries to contribute $1 billion (£747 million) if they want their membership on the board to extend beyond three years, according to a draft charter seen by Reuters and first reported by Bloomberg News. The executive board includes Turkish Foreign Minister Hakan Fidan, despite Israel's opposition to any Turkish role in Gaza. \n                  High-speed trains collide after one derails in Spain, killing at least 21 - follow live\n                 \n                  Trump latest: Starmer holds 'short and cordial' call with Trump over Greenland tariff move\n                 \n                  Greenland crisis: Unleashing Europe's most powerful trade weapon on the US was previously unthinkable - not anymore\n                 Other members on the \"founding executive board\" include Mr Trump's special envoy for the Middle East Steve Witkoff, his son-in-law Jared Kushner, who both helped negotiate the peace plan, and Mr Rubio. Former British Prime Minister Sir Tony Blair, the UN special coordinator for the Middle East peace process Sigrid Kaag, as well as Nickolay Mladenov, former UN Middle East envoy, who has been appointed High Representative for Gaza, are also part of the executive board. Other members include US deputy national security adviser Robert Gabriel, billionaire Marc Rowan, and World Bank president Ajay Banga, who is Israeli. Jordan's foreign ministry said Sunday that King Abdullah has also received an invitation from President Trump to join. The offices of the Egyptian and Turkish presidents have confirmed they have been invited. The leaders of France, Germany, Australia and Canada were also reportedly among those invited to sit on the board. European Commission President Ursula von der Leyen had been invited to represent the European Union. Read more from Sky News:Backlash after Trump's tariff threatRapper describes 'massacre' on Iran's streetsMajor General Jasper Jeffers will command an \"International Stabilisation Force\", responsible for security operations, demilitarisation, and safe delivery of humanitarian aid, the White House said. In a post on Truth Social, Mr Trump called the board \"the Greatest and Most Prestigious Board ever assembled at any time, any place\". After fulfilling its initial aim to end the conflict in Gaza, the board would then expand to tackle conflicts elsewhere, Mr Trump said in an interview this week. \"It's going to, in my opinion, start with Gaza and then do conflicts as they arise,\" he told Reuters. This week marked the start of the second phase of President Trump's 20-point plan to end the war in Gaza, which was first unveiled in September. A fragile ceasefire came into effect in October 2025, but the enclave continues to see episodes of deadly violence, with Israel and Hamas accusing each other of violating the peace deal. In October 2023, Hamas-led militants launched a surprise attack on Israel, which claimed the lives of some 1,200 people, with 251 others taken hostage. The attack was soon followed by an Israeli offensive on Gaza, which lasted two years and killed a further 70,000 people, according to Gaza's Hamas-run health ministry."
    },
    {
        "title": "Senegal win Africa Cup of Nations after players storm off pitch during dramatic final",
        "description": null,
        "url": "https://news.sky.com/story/africa-cup-of-nations-players-storm-off-pitch-in-protest-during-dramatic-final-13496010",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-afcon-senegal_7139202.jpg?20260118220346",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-18 21:48:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "Jenrick defection makes it more likely Reform will win general election, says senior party figure Zia Yusuf",
        "description": "A leading Reform figure has told Sky News that Robert Jenrick's defection to the party is a \"really important milestone\" and \"makes it more likely that we win the next general election\".",
        "url": "https://news.sky.com/story/jenrick-defection-makes-it-more-likely-reform-will-win-general-election-says-senior-party-figure-zia-yusuf-13495813",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-robert-jenrick-nigel-farage_7136454.jpg?20260115174105",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-18 11:12:00",
        "Headline": "Zia Yusuf has said Robert Jenrick is \"clear-eyed about all of the different ways the Tories betrayed this country\".",
        "Content": "A leading Reform figure has told Sky News that Robert Jenrick's defection to the party is a \"really important milestone\" and \"makes it more likely that we win the next general election\". Until he was kicked out of the Conservative Party by leader Kemi Badenoch on Thursday, Mr Jenrick was the shadow justice secretary and had served more than 11 years as a Tory MP. Ms Badenoch said she had found out he was plotting to defect in \"a way designed to be as damaging as possible\" and then sacked him. Hours later, Mr Jenrick was unveiled as the latest high-profile recruit to Reform UK by leader Nigel Farage, in a week where the party had already welcomed former Tory chancellor, Nadhim Zahawi. Politics latest - follow live Mr Jenrick has conceded he was \"resolved\" to switch to Reform before he was given the boot. Speaking about Mr Jenrick's switch, Reform's head of policy Zia Yusuf told Sky News: \"My assessment is this is a man who is thoughtful, who is clear-eyed about all of the different ways the Tories betrayed this country and wants to help Nigel, help me, help Richard [Tice] and everyone at Reform repair that damage.\" \n                  Conservative MP Andrew Rosindell defects to Reform UK\n                 \n                  Life raft backdrop a baffling choice for Kemi Badenoch's Aberdeen visit given latest defection\n                 \n                  Number of councils that have requested delay to local elections revealed - is yours one of them?\n                 Speaking on Sunday Morning with Trevor Phillips, Mr Yusuf said: \"I also think it's crystal clear that him arriving at Reform makes it more likely that we win the next general election, and I think that's a really important milestone in order for us to do that, to turn the country around.\" Mr Yusuf also said Reform UK would not make a pact with the Conservative Party and \"there isn't space for two centre-right parties\". 'The new sheriff in town' It follows reports that Mr Jenrick's plan for his defection referred to him as \"the new sheriff in town\" and \"the biggest defection story Reform has ever had\". The leaked plan also mentioned Mr Zahawi's defection, suggesting it was prepared in recent days, according to The Mail on Sunday and The Sunday Times. A source close to Mr Jenrick denied he was involved with the document, and said it shows \"Rob is just a member of Nigel's team and wants to help get him in as prime minister\". Asked about whether Mr Jenrick referred to himself as the \"sheriff\", Mr Yusuf told Sky News: \"Any time a politician moves from one party to another, particularly defecting between two fierce rivals, there's going to be briefing and counter briefing.\" But he added that \"what matters is... serving the British people\". He also declined to say what role Mr Jenrick could serve in the party, but said Mr Farage will be \"making those decisions now\". Badenoch says she's 'cleaning out the rubbish' Mr Yusuf also confirmed that Reform intends to \"destroy\" the Conservative Party. He told Sir Trevor: \"There isn't space for two centre-right parties in this country. There just isn't under our electoral system. \"So I'm afraid, we must replace, the Tory. You can call it destroy, replace, whatever it means - but we will not do a pact with the Tories.\" Mr Jenrick has continued his attacks on his former party, writing in The Sun on Sunday that the Tories have \"almost become the party of posh people\" and many are \"so out of touch\". Reform has set a deadline of 7 May (the day of local elections), after which the party has said it will not take any more Conservative Party defectors. It follows accusations that Mr Farage's party is becoming packed with ex-Tory ministers and MPs, while Ms Badenoch wrote in The Times that she is \"cleaning out the rubbish from the Conservative Party\". After this was put to Mr Yusuf on Sky News, he responded: \"Well, if Kemi Badenoch is focused on taking out the rubbish, there'll be nothing at CCHQ (Conservative Campaign Headquarters) or within the parliamentary party.\""
    },
    {
        "title": "Eight skiers killed in Austrian avalanches",
        "description": "Eight people have been killed in a series of avalanches in Austria, authorities say.",
        "url": "https://news.sky.com/story/eight-skiers-killed-in-austrian-avalanches-13495767",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-austria-skiers-avalanche_7138687.jpg?20260118083622",
        "type": "Home",
        "Author": "Bethany Minelle, news reporter",
        "Date Published": "2026-01-18 08:29:00",
        "Headline": "Heavy snowfall has led to fatalities in Austria, with authorities giving \"clear and repeated warnings\" about the avalanche risk.",
        "Content": "By Bethany Minelle, news reporter  Eight people have been killed in a series of avalanches in Austria, authorities say. Three Czech skiers were killed in the Pusterwald area of ​​the Murtal district in Styria shortly before 4.30pm (3.30pm UK time) on Saturday, according to police. It was reported a total of seven skiers were caught up in that avalanche in central Austria, including the three who were completely buried. The remaining four were evacuated to safety. In the Salzburg Pongau region of western Austria, an avalanche killed four skiers. They died in the Gastein Valley, south of the city of Salzburg, after a snow slide swept away seven people. Mountain rescue was alerted to the avalanche at around 2pm local time on Saturday (1pm UK time). \n                  Gustav Klimt's Portrait of Elisabeth Lederer sells for £180m at auction, a record for modern art\n                 \n                  Austria gunman had 'significant passion' for school shootings, police say\n                 \n                  King and Queen 'shocked and saddened' by school shooting in Austria\n                 Two people were seriously injured, and a third escaped unharmed. \"This tragedy painfully demonstrates how serious the current avalanche situation is,\" said Gerhard Kremser, district head of the Pongau mountain rescue service, noting the \"clear and repeated warnings\" about the avalanche risk. Four rescue helicopters, mountain rescue and Red Cross dog teams, and a crisis intervention team were deployed to the scene. About 90 minutes earlier, a female skier died after being buried under an avalanche in the nearby Bad Hofgastein area of Salzburg Pongau, at an altitude of about 2,200m (7,200ft), according to the Pongau mountain rescue service. Parts of Europe have been hit by heavy snowfall over the last week. The Salzburg avalanche warning service, which provides daily bulletins on snow conditions and avalanche danger in the region, raised the danger level for Saturday to \"level 3\" out of five, signalling considerable danger. Winter sports enthusiasts have been warned that cracks and settling noises when walking on snow indicate danger, with wind-drifted snow proving particularly dangerous. Last weekend, a British skier in his 50s died in the French Alps while skiing off-piste in La Plagne."
    },
    {
        "title": "Man arrested on suspicion of murder after woman dies in the street",
        "description": "A man has been arrested on suspicion of murder after a woman was found seriously injured in the street last night, police said.",
        "url": "https://news.sky.com/story/man-arrested-on-suspicion-of-murder-after-woman-dies-in-the-street-13495819",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-catherine-gardens-police_7138817.png?20260118123216",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-18 12:10:00",
        "Headline": "Officers were called to Catherine Gardens in Thorpe St Andrew, outside Norwich, just before 11.45pm on Saturday following reports of a woman injured in the street.",
        "Content": "A man has been arrested on suspicion of murder after a woman was found seriously injured in the street last night, police said. Officers were called to Catherine Gardens in Thorpe St Andrew, outside Norwich, just before 11.45pm on Saturday following reports of a woman injured in the street. Emergency services attended but the woman, in her 40s, was pronounced dead at the scene. A man, in his 60s, was arrested in Dereham Road in Norwich on Sunday morning on suspicion of murder. He is currently in custody. Yarmouth Road is closed between the Pound Lane and School Avenue junctions, a statement by Norfolk Constabulary adds. Detective Superintendent Stacey Murray said: \"We are in the early stages of this investigation working to establish the sequence of events which led to the woman's death. \"However, we do believe this to be an incident in which both parties were known to each other. \"We would urge anyone with information that could help the investigation, whether it concerns the incident itself or the events leading up to it, to get in touch.\""
    },
    {
        "title": "Conservative MP Andrew Rosindell defects to Reform UK",
        "description": "Andrew Rosindell has become the second Conservative MP to defect to Reform UK within a week.",
        "url": "https://news.sky.com/story/conservative-mp-andrew-rosindell-defects-to-reform-uk-13496013",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-andrew-rosindell-reform_7139146.jpg?20260118201331",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-18 22:00:00",
        "Headline": "The MP for Romford announced he had decided to resign from his position as a shadow foreign office minister, days after Robert Jenrick did the same.",
        "Content": "Andrew Rosindell has become the second Conservative MP to defect to Reform UK within a week. The MP for Romford, Essex, announced on Sunday evening he had decided to resign from his position as a shadow foreign office minister in Kemi Badenoch's frontbench and as a member of the Conservative Party. The move came after former senior Tory Robert Jenrick defected on Thursday. It takes the total number of MPs in Reform UK to seven. Both Nigel Farage and Mr Jenrick welcomed Mr Rosindell to the party, calling him a \"patriot\". Mr Rosindell, who has been an MP since 2001, said it was time to put \"country before party\" in a statement announcing his defection. \"Since joining the Conservative Party at the age of 14, I have been a loyal and committed supporter of the principles advocated by Margaret Thatcher that have always underpinned my own political beliefs,\" he wrote. \"However, the time has come to put country before party. \"The failure of the Conservative Party both when in government and more recently in opposition to actively hold the government to account on the issue of Chagossian self-determination and the defence of British sovereignty, represents a clear red line for me.\" Political correspondent Andrew Rosindell certainly isn't as high profile as Robert Jenrick or Nadhim Zahawi, the two Conservatives who defected to Reform UK last week.  But Rosindell was a junior shadow minister who had been a member of the Tory party since the age of 14,  elected to parliament 23 years ago. The move increases Reform UK's number of seats in parliament to seven. That's a 40% increase since the start of the year.  What's more potentially embarrassing for Kemi Badenoch is that his stated reasons for jumping ship echo the devastating critique made by Jenrick just last week about his \"rotten\" former party. \"Sadly, I now believe that the Conservative Party is irreparably bound to the mistakes of previous governments and unwilling to take meaningful accountability,\" he said.  It's particularly painful as it amplifies the attacks Labour have been making on the Tories since winning the last election. Last Friday Badenoch told Sky News her party was more united because of the defenestration of her rival Jenrick. She insisted no other shadow cabinet members would follow.  Andrew Rosindell wasn't in the shadow cabinet, and he's survived a series of controversies – but his loss is still embarrassing, however much Tory sources suggest Reform are welcome to him. We'll have to wait to find out if these recent defections and Nigel Farage's 7 May deadline for anyone considering following suit will lead to a rush of other new recruits.  But the momentum is certainly with Reform and against the Tories, and that's clearly not a comfortable position for Kemi Badenoch to be in.  A Conservative Party source said Mr Rosindell had threatened to defect for months but denied he was doing so until as recently as Saturday. \"The Conservative Party supported Rosindell throughout his many troubles, and he's responded by stabbing his friends, colleagues and activists in the back. Reform are welcome to him,\" the source said. Meanwhile, Labour Party chairwoman Anna Turley said the \"stench of a failed and drying Tory party engulfs Reform\" and a spokesperson for the Liberal Democrats said Mr Rosindell's defection \"isn't a political earthquake\". \"It's a change of rosette for a career politician worried about getting a P45,\" they said. \"The public are fed up hearing about how Britain is broken from the very same people who broke it.\" Read more:All the former Conservative MPs who have defected to Reform?Jenrick defection makes it more likely Reform will win general election, says Yusuf Andrew Rosindell first joined the Tory party at the age of 14. He was elected to represent Romford, Essex, in 2001 and was re-elected in 2024. In parliament, he has previously served as shadow minister for home affairs between 2007 – 2010 and was a long-time advocate of Britain's withdrawal from the European Union. He belonged to a small group of Conservatives who voted against the Brexit withdrawal agreement each time it was put before the House. Rosindell also long campaigned for the Union flag to be flown on all public buildings across the UK, according to his website.  In 2010, it was granted that the Union flag will be flown every day and all year from the Victoria Tower of the Palace of Westminster, which Rosindell had been campaigning for. He is now chairman of the Flags & Heraldry Committee group in Parliament. Following the defection of Mr Rosindell, Mr Jenrick and, before that, former Conservative chancellor Nadhim Zahawi, Tory leader Kemi Badenoch said she was \"100% confident\" she would not see any more of her shadow cabinet leave for Reform. It comes as the party, headed by Mr Farage has set 7 May - the date of crucial local elections in which they hope to make significant gains - as a cut-off point for admitting current and former MPs, as well as for local councillors to defect. Asked if she would be on alert for MPs seeking to switch sides before the elections, Ms Badenoch told the Press Association news agency: \"I think people should be wondering why they set that deadline.\""
    },
    {
        "title": "Hillsborough Law debate withdrawn after backlash from campaigners and MPs",
        "description": "The government has pulled an amendment to its&#160;proposed Hillsborough&#160;Law amid concerns from campaigners and some MPs that intelligence agencies could use it&#160;to \"hide serious failures\" from the public.",
        "url": "https://news.sky.com/story/hillsborough-law-debate-withdrawn-after-backlash-from-campaigners-and-mps-13495967",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-hillsborough-family_7139098.jpg?20260118185443",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-18 18:44:00",
        "Headline": "The government says it will work with campaigners and bereaved families to bring forward amendments when the bill reaches the House of Lords. ",
        "Content": "The government has pulled an amendment to its proposed Hillsborough Law amid concerns from campaigners and some MPs that intelligence agencies could use it to \"hide serious failures\" from the public. It has also withdrawn the legislation from Monday's parliamentary agenda entirely after initially planning for its report stage and third reading to go ahead and then bring forward amendments in the House of Lords. Sky News' deputy political editor Sam Coates said one figure close to the talks described the situation as \"absolutely mental\". The law, officially called the Public Office (Accountability) Bill, is designed to make sure authorities face criminal sanctions if they attempt to cover up the facts behind disasters such as the 1989 Hillsborough tragedy, the Grenfell Tower fire and infected blood scandal. One of the amendments suggested by the government this week meant that spies would be within the scope of the legislation. However, they would only be forced to tell the truth if the head of their service approved it. Campaign group Hillsborough Law Now argued that it could allow intelligence services to \"hide serious failures behind a vague claim of national security\". Now, the government has decided not to push ahead with the amendment, but to work with campaigners and bereaved families to bring forward amendments when the bill reaches the Lords. \n                  Hillsborough Law delayed after backlash\n                 \n                  Hillsborough families hit out at report into disaster - as it finds 12 police officers would have faced gross misconduct cases\n                 \n                  Hillsborough: Long-awaited report into Britain's worst-ever sporting disaster to be published today\n                 Read more:Hillsborough Law: What is it, why was it delayed and what happens next?Hillsborough campaigners hail 'momentous' step as bill introduced \"This legislation will right the wrongs of the past, changing the balance of power to ensure the state can never hide from the people it should serve and putting a legal duty on officials to respond openly and honestly when things go wrong,\" said a government spokesperson. \"The bill will make the police, intelligence agencies and the whole of government more scrutinised than they have ever been, but we can never compromise on national security. \"We will continue to work with all parties to make sure the bill is the strongest it can possibly be, without compromising national security.\" Hillsborough Law Now welcomed the move, posting on X: \"We welcome the government listening to the campaign, families, MPs and supporters by withdrawing their security services amendment. \"We shall engage further with government to ensure the bill fully applies to the security services whilst not jeopardising national security.\" Before the amendment was withdrawn, Liverpool City Region mayor Steve Rotheram and Greater Manchester mayor Andy Burnham said it risked \"undermining the spirit of the legislation\" and \"creates too broad an opt-out\" for the security services. Liverpool West Derby MP Ian Byrne had said he would not be able to support the legislation with the government's amendments included because of \"security service carve-outs\". He had tabled amendments of his own that seek to ensure the duty of candour applies to intelligence officers without such exceptions."
    },
    {
        "title": "Greenland issue the most serious crisis in transatlantic relations in decades - where do we go from here?",
        "description": "Keir Starmer had wanted this week to get on with his \"cost of living tour\" of the country to tap into voters' concerns in this all-important election year.",
        "url": "https://news.sky.com/story/greenland-issue-the-most-serious-crisis-in-transatlantic-relations-in-decades-where-do-we-go-from-here-13495988",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-greenland_7135134.jpg?20260114133538",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-18 19:26:00",
        "Headline": "The prime minister will attempt to negotiate with Trump to see off the tariff threat, but he will not back down over the principle of the sovereignty of Denmark. ",
        "Content": "\n          Political editor\n              @BethRigby\n Keir Starmer had wanted this week to get on with his \"cost of living tour\" of the country to tap into voters' concerns in this all-important election year. Donald Trump's Greenland threat obstructed that: Over the weekend, the prime minister and his team have been locked in talks in Downing Street, and with European allies, over how to respond to President Trump's latest audacious move. The president's threat to apply an additional levy on goods from France, Germany, the Netherlands, Norway, Sweden and Finland from 1 February is a moment of huge escalation in tensions between allies over Greenland that has astonished and angered. \"It's through the looking glass,\" opined one official. \"We don't know if he's going to back down, what if he doesn't?\"  Starmer holds 'short and cordial' call with Trump over Greenland tariff move - latest updates For now, the prime minister and his team are working to get him to do exactly that. \"As before, we're taking a deep breath and using relationships to figure out exactly where the US are before reacting to every social media post,\" said one figure involved. \"What the PM has said publicly illustrates how we feel and how we have been working on it this weekend.\" Read more: Why Trump says the US 'needs' Greenland - and what the fallout could be Mr Starmer said on Saturday that the decision to impose 10% tariffs on the UK and seven other European countries was \"completely wrong\" and reiterated his position that the future of Greenland is \"a matter for the Greenlanders and the Danes\". On Sunday, the UK issued another joint statement with Denmark, Finland, France, Germany, the Netherlands, Norway and Sweden, warning that \"tariff threats undermine transatlantic relations and risk a dangerous downward spiral\". This escalation appears to have perhaps been sparked by the decision by these eight European NATO members to carry out a reconnaissance mission to Greenland in recent days. Prime Minister Meloni of Italy, who spoke to President Trump on Sunday morning, said the White House may have misunderstood the military exercise and not realised it was directed against Russia and China and not the US. \"There could have been a problem of understanding and communication,\" she said. \"It seems to me that the risk is that the initiatives of some European countries were interpreted as anti-American, which is clearly not the intention.\" Allies have since reiterated that point, saying in their Sunday statement that they were \"committed to strengthening Arctic security as a shared transatlantic interest\". The \"pre-co-ordinated Danish exercise Arctic Endurance, conducted with Allies, respond to this necessity. It poses no threat to anyone\". The allies' intention is to work with the US to strengthen High North security, and this will be the message the prime minister will make when he speaks on the latest developments this week. Read more:How NATO's collective defence clause worksAnalysis: Trump likely gambling he can get away with Greenland grabColombia, Cuba, Mexico, Greenland or Iran - where could Trump strike next? One senior government official said the Trump administration was \"not listening to calibrated language when the UK and other European capitals [say they] believe in Arctic security\". European leaders at the annual Davos summit this week - the PM is currently not expected to be attending - will want impress upon him that allies want to work with the US through NATO. But the big unknown is whether the US wants to work with European allies through NATO. When it comes to Greenland and security in the High North, President Trump seems to want to work unilaterally. He has made it clear from the early days of his administration that he wants to annex Greenland, build a bigger America and use this landmass to strengthen US security. The Danes have clearly told President Trump that he could massively expand US security presence on Greenland, as written into previous treaties, but that doesn't seem to be enough. It is almost as if President Trump, not a fan of multilateralism, is trying to undermine NATO, just as he is undermining the United Nations by drawing up a Board of Peace to supervise Gaza's transitional administration. He's also asking 60 countries to contribute $1bn if they want their membership on the board to extend beyond three years. After fulfilling its initial aim to end the conflict in Gaza, the board would then expand to tackle conflicts elsewhere. On both fronts, President Trump is choosing to turn away from international bodies. It is a clear pattern. Last week, he announced his intent to withdraw the US from 66 multilateral forums and retracted billions of dollars in spending from international organisations. This latest rupture is a reflection of how, in just a year, the certainties that have underpinned our global order have come undone. The US has shifted from being the foundation stone of the Western alliance to an unreliable ally. The threats over Greenland must be a red line for the UK and other allies. On that, the UK is clear. The prime minister will attempt to negotiate with Trump to see off the tariff threat, but he will not back down over the principle of the sovereignty of Denmark. Expect Keir Starmer to reiterate the UK's position while also trying to reiterate the UK's close relationship with the US. I would not expect the PM to use the language of President Macron, who spoke of intimidation and threats, over President Trump's tariff warning. Instead, the PM will make the case this week that the tariffs are not sensible and not in the interests of the UK or the US. Back on to what he wants to spend his time talking about, the cost of living, he is also expected to draw a clear line between the need to engage in international affairs to try to drive down household bills at home. But this is a difficult moment for a prime minister who has prided himself on his ability to negotiate with President Trump to secure better trading terms with the UK. Lib Dem leader Ed Davey said on Sunday the PM's \"US policy lies in tatters\" as NATO allies are \"punished\" by Trump for \"doing the right thing\". As for the tariffs, as of Sunday, the government were not sure about the implications of the Trump threat, with information scant on how this particular 10% tariff might apply. It is possible that the threat will fall away - as happened with the 100% levy on films made outside the US. But these tensions could also escalate - and all the options are deeply worrying. From levies and trade wars, to the disintegration of NATO and withdrawal of support for Ukraine. What if the US did decide to use force to take Greenland? Would European armies end up in conflict with the US? All of it seems unconscionable in a situation that is fast becoming the most serious crisis in transatlantic relations in decades. The UK will do all it can to try to de-escalate, but it won't back down."
    },
    {
        "title": "Doctors warn of 'horrific' impact of tech and devices on children and young people's health",
        "description": "Doctors and medical experts have warned of the growing evidence of \"health harms\" from tech and devices on children and young people in the UK.",
        "url": "https://news.sky.com/story/doctors-warn-of-horrific-impact-of-tech-and-devices-on-young-peoples-health-13495803",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-mobile-phone-child_7098058.jpg?20260118131341",
        "type": "UK",
        "Author": "Bethany Minelle, news reporter",
        "Date Published": "2026-01-18 10:55:00",
        "Headline": "The Academy of Medical Royal Colleges says it wants to highlight the risks of unrestricted content and screen time to children and young people.",
        "Content": "By Bethany Minelle, news reporter  Doctors and medical experts have warned of the growing evidence of \"health harms\" from tech and devices on children and young people in the UK. The Academy of Medical Royal Colleges (AoMRC) said frontline clinicians have given personal testimony about \"horrific cases they have treated in primary, secondary and community settings throughout the NHS and across most medical specialities\". The body, which represents 23 medical royal colleges and faculties, plans to gather evidence to establish the issues healthcare professionals and specialists are seeing repeatedly that may be attributed to tech and devices. It intends to highlight the sometimes-hidden risks of unrestricted content and screen time to children and young people and provide guidance to the medical profession about how to identify and manage the harm being done. The academy said it already had \"evidence of the impact on children and young people's physical and mental health both from excessive screen time as well as exposure to harmful online content\". It says the work is due to be completed within three months. The letter was sent to Health Secretary Wes Streeting and Science and Technology Secretary Liz Kendall. \n                  Mum of baby who fell seriously ill after being given now-recalled infant formula calls for investigation\n                 \n                  Screen time linked to poor speech development in under-fives, say ministers as parents offered new guidance\n                 \n                  'My daughter was diagnosed with childhood dementia before she turned four - what we were told is criminal'\n                 Chief executive of the National Institute for Health Research, Lucy Chappell, and the UK government's chief medical adviser, Sir Chris Whitty, were also sent a copy. Dr Jeanette Dickson, chair of the academy, told The Sunday Times: \"Without doubt, we are seeing the beginning of a public health emergency with our own eyes. Everywhere we look, we see children and adults glued to their screens. \"I really worry for children, some of whom are self-evidently imprisoned in a digital bubble.\" Recent government research linked screen time to poor speech development in under-fives. It comes as the government prepares to announce plans to restrict the use of social media for under-16s. A consultation is expected to be launched this week. Options range from a full ban to limited interventions, including time restrictions and tighter algorithm controls. In December, Australia introduced a ban on under-16s having social media accounts. Many other countries around the world, including France, Denmark, Norway and Malaysia, are now considering similar bans. However, some children's and online safety organisations say a blanket ban is not the right way forward. A joint statement, signed by 43 child protection charities and online safety groups, including the NSPCC and the Molly Rose Foundation, alongside academics and bereaved families, warned of serious unintended consequences that could put children at greater risk. They wrote: \"Though well-intentioned, blanket bans on social media would fail to deliver the improvement in children's safety and wellbeing that they so urgently need. They are a blunt response that fails to address the successive shortcomings of tech companies and governments to act decisively and sooner.\" Andy Burrows, chief executive of the Molly Rose Foundation, told Sky News: \"We're really concerned that parents and parliamentarians are being presented with a false binary right now, the idea that either we proceed with an outright ban and or we continue with the appalling status quo in which children are coming to harm. Those simply aren't the only options available to us\". He also called on Prime Minister Sir Keir Starmer to \"do the right thing\". Mr Burrows said: \"What we've seen is an online safety act that was watered down because of the political chaos over the last few years. It is not strong enough. It is not being enforced robustly enough. \"But we can take action… We can make sure that the tech companies face the fines and the criminal sanctions that will finally make them address these issues. But it needs Keir Starmer to be listening to this groundswell of concern from parents, from experts, and then to do the right thing.\" In another statement, Chris Sherwood, chief executive of the NSPCC, highlighted the \"countless children\" for whom the internet is \"a lifeline,\" describing it as \"a source of community, identity, and vital support\". He said: \"A blanket ban would take those spaces away overnight and risks driving teenagers into darker, unregulated corners of the internet.\" Mr Sherwood also urged change from online platforms themselves, saying: \"Tech companies must be held accountable by Government and Ofcom for their harmful design choices, their reckless algorithms, and their failure to take responsibility for dangerous content.\""
    },
    {
        "title": "Starmer begins pushback against Trump as president threatens tariffs over Greenland",
        "description": "It's hardly a Love Actually moment of brave UK defiance in the face of a domineering US president - but Sir Keir Starmer has clearly decided it's time to start pushing back.",
        "url": "https://news.sky.com/story/keir-starmer-begins-pushback-against-trump-as-president-threatens-tariffs-over-greenland-13495726",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-keir-starmer_7138587.jpg?20260118235218",
        "type": "UK",
        "Author": "Amanda Akass",
        "Date Published": "2026-01-18 00:29:00",
        "Headline": "The prime minister has worked hard to build a special relationship with Donald Trump, but that relationship has become decidedly abusive.",
        "Content": "\n          Political correspondent\n              @amandaakass\n It's hardly a Love Actually moment of brave UK defiance in the face of a domineering US president - but Sir Keir Starmer has clearly decided it's time to start pushing back. Donald Trump, he has said, is \"completely wrong\" to slap tariffs on the UK and other European countries \"for pursuing the collective security of NATO allies.\" He's not going as far as President Macron, who has pledged never to change course in the face of \"intimidation or threat\". But while the PM has previously been clear about the UK's staunch support for Denmark - he's usually very cautious in his dealings with the mercurial president. Starmer has invested huge political capital and personal energy in developing a personal connection with Donald Trump, despite their obvious differences. Indeed the PM's efforts at strengthening the so-called special relationship - particularly in the service of Ukraine - have been widely seen as one of the more successful aspects of his bumpy premiership thus far. But that relationship has become decidedly abusive - Trump accuses the UK and other European allies of \"playing a very dangerous game\" in travelling to Greenland \"for purposes unknown\". \n                  Greenland issue the most serious crisis in transatlantic relations in decades - where do we go from here?\n                 \n                  Greenland crisis: Unleashing Europe's most powerful trade weapon on the US was previously unthinkable - not anymore\n                 \n                  'Our position on Greenland is non-negotiable', says minister amid Trump tariff threat\n                 The UK has sent just one single military officer to Greenland to carry out a reconnaissance mission ahead of a future joint exercise in the area, alongside a handful of troops from other countries. While this was clearly done in solidarity with the Danes and Greenlanders, the idea was also precisely to demonstrate that NATO has been listening to the president's concerns about Greenland. The PM's statement stressed he has \"made [it] clear that Arctic Security matters for the whole of NATO and allies should all do more together to address the threat from Russia\". It's a topic he has repeatedly discussed in phone calls with Trump and other European leaders over the past few weeks, following the White House's resurgent interest in Greenland. But it's clear from the president's Truth Social post that no amount of NATO positioning - certainly not a handful of soldiers on a training exercise - is going to change his mind. He's now absolutely fixated on taking over Greenland - commandeering what would be the 51st state of the US. In such extraordinary circumstances, Starmer's key political opponents have actually come out in support of his position on Greenland - and against Trump. Conservative leader Kemi Badenoch said she agreed with him, also describing Trump's approach as \"completely wrong\". Nigel Farage said Reform UK \"certainly don't\" agree with the US government. Liberal Democrat Ed Davey, who has a long track record in criticising the government's cosy relationship with Donald Trump, called for \"the PM to stand firm against the bully in the White House\". Read more:Why does Trump want to take over Greenland?Poll reveals what Americans think about Greenland schemeTrump says US will act on Greenland 'whether they like it or not' Many backbenchers have been much more gung-ho in their insults and calls for action. Former Lib Dem leader Tim Farron asked \"if Starmer, Badenoch and Farage *still* think it's worth shamelessly appeasing this wombat?\" Conservative backbencher Simon Hoare described Trump as a \"gangster pirate\" and called for the King's visit to be cancelled. Tory former army officer Ben Obese-Jecty MP demanded the PM \"defend British interests\" and questioned why the Americans had reduced the number of their troops based in Greenland from thousands to around 150 if its security is really so important to the US. In perhaps the most scathing assessment, Conservative MP Alicia Kearns MP asked \"what has all Labour's sycophantic fawning achieved in the national interest?\" That's surely a raw question in Downing Street this weekend as the PM and his team attempt to strategise their response. How can they really stand up to an American president on the march under the threat of an international trade war? Further tariffs of 10 and 25% - presumably on top of the existing 10% tariff on most baseline goods exported to the US - will hardly help in the mission to drive growth into the tottering British economy. Could we see an emergency visit to Washington by the group of leaders, as they did last summer in support of Ukrainian President Volodymyr Zelenskyy? Might Italian Prime Minister Georgia Meloni, not currently on Trump's hit list, be prevailed upon to use her own influence with the US? Is there any more ring-kissing that can be done? Counter tariffs? Or will they be forced to capitulate - and give up Greenland, and the principle of NATO solidarity with it? Whatever happens, Trump has made his position abundantly clear. The path for European leaders is much less so."
    },
    {
        "title": "Water supply issues for thousands in Kent days after week-long outage",
        "description": "Thousands of people in Kent are once again experiencing water supply issues days after similar disruption.",
        "url": "https://news.sky.com/story/water-supply-issues-for-thousands-in-kent-days-after-week-long-outage-13495871",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-tunbridge-wells-bottled_7097664.jpg?20251201144753",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-18 15:28:00",
        "Headline": "An estimated 4,500 homes in several rural areas around Maidstone are affected, with hundreds in Tunbridge Wells experiencing little to no water.",
        "Content": "Thousands of people in Kent are once again experiencing water supply issues days after similar disruption. An estimated 4,500 properties in several rural areas around Maidstone and hundreds more in Tunbridge Wells are experiencing little to no water, South East Water (SEW) said. The company put the issues down to an electrical fault at a treatment works and the slow recovery of drinking water in storage tanks. Affected properties in Maidstone, predominately in Harrietsham, Kingswood, Coxheath, Headcorn and surrounding villages are expected to have their supply restored by the end of Sunday.  While disruption is expected to continue until Monday for customers in the Bidborough area of Tunbridge Wells. South East Water apologised to customers, adding bottled water stations were open to those affected. The problem is the latest in a long line of issues for the beleaguered water company, which faced heavy criticism last week after some 30,000 homes in Kent and West Sussex had disrupted water supply for six days. The outage prompted Kent County Council to declare a major incident and water regulator Ofwat to launch a probe into the company. The regulator said it was investigating whether SEW had breached its licence conditions by failing to meet customer service standards obligations or by offering appropriate support to those affected. Months before that, in November and December, Tunbridge Wells suffered a sustained outage, with 24,000 properties in and around the town left without drinkable water for almost two weeks. Read more from Sky News:Iraq veterans living with 'ticking time bomb'Doctors warn of impact of tech and devices on children Lynn Parker, Ofwat senior director for enforcement, said the last six weeks had been \"miserable for businesses and households across Kent and Sussex, with repeated supply problems\". If the regulator decides SEW has breached the conditions and should be stripped of the licence, the supplier could fall into a special administration regime until a new buyer was found. On Friday, Mathew Dean, SEW's incident manager, said: \"We are very sorry to every single one of our customers who have been affected. \"We know and understand how difficult going without water for such a long period of time is and how difficult it makes everyday life.\""
    },
    {
        "title": "Man arrested on suspicion of murder after woman dies in the street",
        "description": "A man has been arrested on suspicion of murder after a woman was found seriously injured in the street last night, police said.",
        "url": "https://news.sky.com/story/man-arrested-on-suspicion-of-murder-after-woman-dies-in-the-street-13495819",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-catherine-gardens-police_7138817.png?20260118123216",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-18 12:10:00",
        "Headline": "Officers were called to Catherine Gardens in Thorpe St Andrew, outside Norwich, just before 11.45pm on Saturday following reports of a woman injured in the street.",
        "Content": "A man has been arrested on suspicion of murder after a woman was found seriously injured in the street last night, police said. Officers were called to Catherine Gardens in Thorpe St Andrew, outside Norwich, just before 11.45pm on Saturday following reports of a woman injured in the street. Emergency services attended but the woman, in her 40s, was pronounced dead at the scene. A man, in his 60s, was arrested in Dereham Road in Norwich on Sunday morning on suspicion of murder. He is currently in custody. Yarmouth Road is closed between the Pound Lane and School Avenue junctions, a statement by Norfolk Constabulary adds. Detective Superintendent Stacey Murray said: \"We are in the early stages of this investigation working to establish the sequence of events which led to the woman's death. \"However, we do believe this to be an incident in which both parties were known to each other. \"We would urge anyone with information that could help the investigation, whether it concerns the incident itself or the events leading up to it, to get in touch.\""
    },
    {
        "title": "Jenrick defection makes it more likely Reform will win general election, says senior party figure Zia Yusuf",
        "description": "A leading Reform figure has told Sky News that Robert Jenrick's defection to the party is a \"really important milestone\" and \"makes it more likely that we win the next general election\".",
        "url": "https://news.sky.com/story/jenrick-defection-makes-it-more-likely-reform-will-win-general-election-says-senior-party-figure-zia-yusuf-13495813",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-robert-jenrick-nigel-farage_7136454.jpg?20260115174105",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-18 11:12:00",
        "Headline": "Zia Yusuf has said Robert Jenrick is \"clear-eyed about all of the different ways the Tories betrayed this country\".",
        "Content": "A leading Reform figure has told Sky News that Robert Jenrick's defection to the party is a \"really important milestone\" and \"makes it more likely that we win the next general election\". Until he was kicked out of the Conservative Party by leader Kemi Badenoch on Thursday, Mr Jenrick was the shadow justice secretary and had served more than 11 years as a Tory MP. Ms Badenoch said she had found out he was plotting to defect in \"a way designed to be as damaging as possible\" and then sacked him. Hours later, Mr Jenrick was unveiled as the latest high-profile recruit to Reform UK by leader Nigel Farage, in a week where the party had already welcomed former Tory chancellor, Nadhim Zahawi. Politics latest - follow live Mr Jenrick has conceded he was \"resolved\" to switch to Reform before he was given the boot. Speaking about Mr Jenrick's switch, Reform's head of policy Zia Yusuf told Sky News: \"My assessment is this is a man who is thoughtful, who is clear-eyed about all of the different ways the Tories betrayed this country and wants to help Nigel, help me, help Richard [Tice] and everyone at Reform repair that damage.\" \n                  Conservative MP Andrew Rosindell defects to Reform UK\n                 \n                  Life raft backdrop a baffling choice for Kemi Badenoch's Aberdeen visit given latest defection\n                 \n                  Number of councils that have requested delay to local elections revealed - is yours one of them?\n                 Speaking on Sunday Morning with Trevor Phillips, Mr Yusuf said: \"I also think it's crystal clear that him arriving at Reform makes it more likely that we win the next general election, and I think that's a really important milestone in order for us to do that, to turn the country around.\" Mr Yusuf also said Reform UK would not make a pact with the Conservative Party and \"there isn't space for two centre-right parties\". 'The new sheriff in town' It follows reports that Mr Jenrick's plan for his defection referred to him as \"the new sheriff in town\" and \"the biggest defection story Reform has ever had\". The leaked plan also mentioned Mr Zahawi's defection, suggesting it was prepared in recent days, according to The Mail on Sunday and The Sunday Times. A source close to Mr Jenrick denied he was involved with the document, and said it shows \"Rob is just a member of Nigel's team and wants to help get him in as prime minister\". Asked about whether Mr Jenrick referred to himself as the \"sheriff\", Mr Yusuf told Sky News: \"Any time a politician moves from one party to another, particularly defecting between two fierce rivals, there's going to be briefing and counter briefing.\" But he added that \"what matters is... serving the British people\". He also declined to say what role Mr Jenrick could serve in the party, but said Mr Farage will be \"making those decisions now\". Badenoch says she's 'cleaning out the rubbish' Mr Yusuf also confirmed that Reform intends to \"destroy\" the Conservative Party. He told Sir Trevor: \"There isn't space for two centre-right parties in this country. There just isn't under our electoral system. \"So I'm afraid, we must replace, the Tory. You can call it destroy, replace, whatever it means - but we will not do a pact with the Tories.\" Mr Jenrick has continued his attacks on his former party, writing in The Sun on Sunday that the Tories have \"almost become the party of posh people\" and many are \"so out of touch\". Reform has set a deadline of 7 May (the day of local elections), after which the party has said it will not take any more Conservative Party defectors. It follows accusations that Mr Farage's party is becoming packed with ex-Tory ministers and MPs, while Ms Badenoch wrote in The Times that she is \"cleaning out the rubbish from the Conservative Party\". After this was put to Mr Yusuf on Sky News, he responded: \"Well, if Kemi Badenoch is focused on taking out the rubbish, there'll be nothing at CCHQ (Conservative Campaign Headquarters) or within the parliamentary party.\""
    },
    {
        "title": "Greenland crisis: Unleashing Europe's most powerful trade weapon on the US was previously unthinkable - not anymore",
        "description": "The mood in Brussels is a mixture of determination and deep concern.",
        "url": "https://news.sky.com/story/greenland-crisis-unleashing-europes-most-powerful-trade-weapon-on-the-us-was-previously-unthinkable-not-anymore-13495977",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-eu-flags-trump_7139182.jpg?20260118212410",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2026-01-18 19:24:00",
        "Headline": "Days away from the World Economic Forum, where European leaders and Trump will gather, EU ambassadors met in Brussels to discuss how to respond to the US president's tariff threats over Greenland. ",
        "Content": "\n          Europe correspondent\n              @AliBunkallSKY\n The mood in Brussels is a mixture of determination and deep concern. There is, finally, a realisation that President Trump isn't bluffing in his desire to \"own\" Greenland and a recognition that diplomacy with the erratic US leader might not work this time. There is also unanimous agreement in European capitals that a forced seizure of Greenland cannot be allowed and the tariffs announced on Saturday against eight countries, including the UK, are wrong. This is fast becoming the biggest transatlantic crisis in generations.  Trump latest: Follow live updates There is no agreement in yet on how to respond. EU Ambassadors met in Brussels late on Sunday evening to discuss options and assess national positions. French President Emmanuel Macron is pushing for the strongest response: triggering the EU's anti-coercion instrument. This is a lever originally designed to fend off states hostile to the EU, such as China, not something to be used against one of the continent's historically closest allies. Taking this option would allow the EU to impose retaliatory tariffs on the US, limit US investment and trade with Europe and restrict access to the single market. It's the bloc's most powerful trade weapon; it's never been triggered before and using it against Washington would have been previously unthinkable. Not any longer. It would almost certainly prompt a backlash from Trump, but it would show the EU is no longer willing to be pushed around by the White House. Another option being considered is delaying the ratification of the EU-US trade deal that was agreed last summer. The EU might feel like it's on firm ground here, having finally signed a major free trade agreement this weekend with five South American countries known as the Mercosur bloc. The countries involved in this agreement account for around 30% of global GDP and the deal will affect around 700 million consumers. Although a suspension of the EU-US trade deal would also impact Europe, Brussels might feel it's in a stronger position than Washington here. The third option is to continue with diplomacy and keep fingers crossed for a breakthrough. Trump said the new tariffs won't kick in until 1 February - that gives the EU and London a window to act. Trump has repeatedly threatened tariffs against countries, only to then delay, reduce or quietly scrap them. The World Economic Forum gets under way in the Swiss resort of Davos this week. Read more from Sky News:Greenland situation is critical for Europe and NATOUS 'wants countries to pay $1bn to stay on Gaza peace board' Many of Europe's leaders will be there, as will Trump and the NATO secretary general. It will be an opportunity for some of them to get in the same room and have face-to-face talks with the US president. But they will need a stick to wield, so Brussels has only a few days to come up with agreed measures of retaliation to use as leverage and then hope Trump climbs down the ladder."
    },
    {
        "title": "Greenland issue the most serious crisis in transatlantic relations in decades - where do we go from here?",
        "description": "Keir Starmer had wanted this week to get on with his \"cost of living tour\" of the country to tap into voters' concerns in this all-important election year.",
        "url": "https://news.sky.com/story/greenland-issue-the-most-serious-crisis-in-transatlantic-relations-in-decades-where-do-we-go-from-here-13495988",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-greenland_7135134.jpg?20260114133538",
        "type": "World",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-18 19:26:00",
        "Headline": "The prime minister will attempt to negotiate with Trump to see off the tariff threat, but he will not back down over the principle of the sovereignty of Denmark. ",
        "Content": "\n          Political editor\n              @BethRigby\n Keir Starmer had wanted this week to get on with his \"cost of living tour\" of the country to tap into voters' concerns in this all-important election year. Donald Trump's Greenland threat obstructed that: Over the weekend, the prime minister and his team have been locked in talks in Downing Street, and with European allies, over how to respond to President Trump's latest audacious move. The president's threat to apply an additional levy on goods from France, Germany, the Netherlands, Norway, Sweden and Finland from 1 February is a moment of huge escalation in tensions between allies over Greenland that has astonished and angered. \"It's through the looking glass,\" opined one official. \"We don't know if he's going to back down, what if he doesn't?\"  Starmer holds 'short and cordial' call with Trump over Greenland tariff move - latest updates For now, the prime minister and his team are working to get him to do exactly that. \"As before, we're taking a deep breath and using relationships to figure out exactly where the US are before reacting to every social media post,\" said one figure involved. \"What the PM has said publicly illustrates how we feel and how we have been working on it this weekend.\" Read more: Why Trump says the US 'needs' Greenland - and what the fallout could be Mr Starmer said on Saturday that the decision to impose 10% tariffs on the UK and seven other European countries was \"completely wrong\" and reiterated his position that the future of Greenland is \"a matter for the Greenlanders and the Danes\". On Sunday, the UK issued another joint statement with Denmark, Finland, France, Germany, the Netherlands, Norway and Sweden, warning that \"tariff threats undermine transatlantic relations and risk a dangerous downward spiral\". This escalation appears to have perhaps been sparked by the decision by these eight European NATO members to carry out a reconnaissance mission to Greenland in recent days. Prime Minister Meloni of Italy, who spoke to President Trump on Sunday morning, said the White House may have misunderstood the military exercise and not realised it was directed against Russia and China and not the US. \"There could have been a problem of understanding and communication,\" she said. \"It seems to me that the risk is that the initiatives of some European countries were interpreted as anti-American, which is clearly not the intention.\" Allies have since reiterated that point, saying in their Sunday statement that they were \"committed to strengthening Arctic security as a shared transatlantic interest\". The \"pre-co-ordinated Danish exercise Arctic Endurance, conducted with Allies, respond to this necessity. It poses no threat to anyone\". The allies' intention is to work with the US to strengthen High North security, and this will be the message the prime minister will make when he speaks on the latest developments this week. Read more:How NATO's collective defence clause worksAnalysis: Trump likely gambling he can get away with Greenland grabColombia, Cuba, Mexico, Greenland or Iran - where could Trump strike next? One senior government official said the Trump administration was \"not listening to calibrated language when the UK and other European capitals [say they] believe in Arctic security\". European leaders at the annual Davos summit this week - the PM is currently not expected to be attending - will want impress upon him that allies want to work with the US through NATO. But the big unknown is whether the US wants to work with European allies through NATO. When it comes to Greenland and security in the High North, President Trump seems to want to work unilaterally. He has made it clear from the early days of his administration that he wants to annex Greenland, build a bigger America and use this landmass to strengthen US security. The Danes have clearly told President Trump that he could massively expand US security presence on Greenland, as written into previous treaties, but that doesn't seem to be enough. It is almost as if President Trump, not a fan of multilateralism, is trying to undermine NATO, just as he is undermining the United Nations by drawing up a Board of Peace to supervise Gaza's transitional administration. He's also asking 60 countries to contribute $1bn if they want their membership on the board to extend beyond three years. After fulfilling its initial aim to end the conflict in Gaza, the board would then expand to tackle conflicts elsewhere. On both fronts, President Trump is choosing to turn away from international bodies. It is a clear pattern. Last week, he announced his intent to withdraw the US from 66 multilateral forums and retracted billions of dollars in spending from international organisations. This latest rupture is a reflection of how, in just a year, the certainties that have underpinned our global order have come undone. The US has shifted from being the foundation stone of the Western alliance to an unreliable ally. The threats over Greenland must be a red line for the UK and other allies. On that, the UK is clear. The prime minister will attempt to negotiate with Trump to see off the tariff threat, but he will not back down over the principle of the sovereignty of Denmark. Expect Keir Starmer to reiterate the UK's position while also trying to reiterate the UK's close relationship with the US. I would not expect the PM to use the language of President Macron, who spoke of intimidation and threats, over President Trump's tariff warning. Instead, the PM will make the case this week that the tariffs are not sensible and not in the interests of the UK or the US. Back on to what he wants to spend his time talking about, the cost of living, he is also expected to draw a clear line between the need to engage in international affairs to try to drive down household bills at home. But this is a difficult moment for a prime minister who has prided himself on his ability to negotiate with President Trump to secure better trading terms with the UK. Lib Dem leader Ed Davey said on Sunday the PM's \"US policy lies in tatters\" as NATO allies are \"punished\" by Trump for \"doing the right thing\". As for the tariffs, as of Sunday, the government were not sure about the implications of the Trump threat, with information scant on how this particular 10% tariff might apply. It is possible that the threat will fall away - as happened with the 100% levy on films made outside the US. But these tensions could also escalate - and all the options are deeply worrying. From levies and trade wars, to the disintegration of NATO and withdrawal of support for Ukraine. What if the US did decide to use force to take Greenland? Would European armies end up in conflict with the US? All of it seems unconscionable in a situation that is fast becoming the most serious crisis in transatlantic relations in decades. The UK will do all it can to try to de-escalate, but it won't back down."
    },
    {
        "title": "US 'wants countries to pay $1bn to stay on Gaza peace board'",
        "description": "Donald Trump wants countries to pay $1bn to be permanent members of the US-backed Board of Peace, according to reports.",
        "url": "https://news.sky.com/story/us-wants-countries-to-pay-1bn-to-stay-on-gaza-peace-board-13495801",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-tony-blair_7137765.jpg?20260118164503",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-18 10:53:00",
        "Headline": "Israel says they have not coordinated with the US over the structure of the Trump-backed Board of Peace.",
        "Content": "Donald Trump wants countries to pay $1bn to be permanent members of the US-backed Board of Peace, according to reports. The Board of Peace will form a key part of the Gaza peace process but a statement from the office of Israeli prime minister Benjamin Netanyahu has said the US did not coordinate its creation with them. Israel's foreign minister Gideon Saar would raise the issue with US Secretary of State Marco ‍Rubio, the statement added. The Board of Peace, unveiled by the White House ‌on Friday, will be chaired by Donald Trump and tasked with supervising Gaza's transitional administration. It would include 11 members who will be part of an executive board, plus additional members. The US administration has reached out to around 60 countries to contribute $1 billion (£747 million) if they want their membership on the board to extend beyond three years, according to a draft charter seen by Reuters and first reported by Bloomberg News. The executive board includes Turkish Foreign Minister Hakan Fidan, despite Israel's opposition to any Turkish role in Gaza. \n                  High-speed trains collide after one derails in Spain, killing at least 21 - follow live\n                 \n                  Trump latest: Starmer holds 'short and cordial' call with Trump over Greenland tariff move\n                 \n                  Greenland crisis: Unleashing Europe's most powerful trade weapon on the US was previously unthinkable - not anymore\n                 Other members on the \"founding executive board\" include Mr Trump's special envoy for the Middle East Steve Witkoff, his son-in-law Jared Kushner, who both helped negotiate the peace plan, and Mr Rubio. Former British Prime Minister Sir Tony Blair, the UN special coordinator for the Middle East peace process Sigrid Kaag, as well as Nickolay Mladenov, former UN Middle East envoy, who has been appointed High Representative for Gaza, are also part of the executive board. Other members include US deputy national security adviser Robert Gabriel, billionaire Marc Rowan, and World Bank president Ajay Banga, who is Israeli. Jordan's foreign ministry said Sunday that King Abdullah has also received an invitation from President Trump to join. The offices of the Egyptian and Turkish presidents have confirmed they have been invited. The leaders of France, Germany, Australia and Canada were also reportedly among those invited to sit on the board. European Commission President Ursula von der Leyen had been invited to represent the European Union. Read more from Sky News:Backlash after Trump's tariff threatRapper describes 'massacre' on Iran's streetsMajor General Jasper Jeffers will command an \"International Stabilisation Force\", responsible for security operations, demilitarisation, and safe delivery of humanitarian aid, the White House said. In a post on Truth Social, Mr Trump called the board \"the Greatest and Most Prestigious Board ever assembled at any time, any place\". After fulfilling its initial aim to end the conflict in Gaza, the board would then expand to tackle conflicts elsewhere, Mr Trump said in an interview this week. \"It's going to, in my opinion, start with Gaza and then do conflicts as they arise,\" he told Reuters. This week marked the start of the second phase of President Trump's 20-point plan to end the war in Gaza, which was first unveiled in September. A fragile ceasefire came into effect in October 2025, but the enclave continues to see episodes of deadly violence, with Israel and Hamas accusing each other of violating the peace deal. In October 2023, Hamas-led militants launched a surprise attack on Israel, which claimed the lives of some 1,200 people, with 251 others taken hostage. The attack was soon followed by an Israeli offensive on Gaza, which lasted two years and killed a further 70,000 people, according to Gaza's Hamas-run health ministry."
    },
    {
        "title": "'State of catastrophe' in Chile as deadly wildfires rage",
        "description": "At least 16 people have been killed and nearly 20,000 people have fled to safety after wildfires, as a \"state of catastrophe\" was declared in Chile.",
        "url": "https://news.sky.com/story/state-of-catastrophe-in-chile-as-deadly-wildfires-rage-13495867",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-chile-biobio_7138914.jpg?20260118151201",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-18 15:08:00",
        "Headline": "Strong winds and unusually high temperatures are making the situation worse, according to authorities, as thousands of people flee their homes.",
        "Content": "At least 16 people have been killed and nearly 20,000 people have fled to safety after wildfires, as a \"state of catastrophe\" was declared in Chile. Firefighters were battling 24 different fires across the country on Sunday morning, with the worst burning in the Nuble and Bio Bio regions, where the government declared an emergency. The regions are around 500km (310 miles) south of the capital Santiago.   \"In light of ‌the serious ongoing wildfires, I have decided to declare a state of ‌catastrophe in the regions of Nuble and Bio Bío. All resources are available,\" posted Chilean President Gabriel Boric on X. Evacuation efforts saw nearly 20,000 people leaving their homes as more than 250 properties were destroyed, according to Chilean authorities. Security minister Luis ​Cordero told reporters 15 deaths had been confirmed in Bio Bio after the government confirmed a death in Nuble on Saturday. Almost 33 square miles are already burned, with multiple communities affected. Strong winds and unusually high temperatures are making the situation worse, authorities say. Read more news from around the world:US 'wants countries to pay $1bn to stay on Gaza peace board''Experienced terrorist' killed by US strikes in Syria Much of Chile is under extreme heat alerts, with temperatures expected to reach up to 38C (100F) from Santiago to Bío Bío on Sunday and Monday. Since the beginning of year, both Chile and Argentina have experienced extreme temperatures and heatwaves, with devastating wildfires in Argentina's Patagonia earlier this month."
    },
    {
        "title": "Trump is not bluffing, Greenland situation is critical for Europe and NATO",
        "description": "\"The situation is critical&#8230;\"&#160;Those are the four words a top European diplomat&#160;chose when we discussed Donald Trump's position on Greenland.",
        "url": "https://news.sky.com/story/trump-is-not-bluffing-greenland-situation-is-critical-for-europe-and-nato-13495736",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-eu_7138626.jpg?20260118041448",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2026-01-18 06:00:00",
        "Headline": "There appears to be no compatibility at all between the positions of President Trump and the EU when it comes to Greenland.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n \"The situation is critical…\" Those are the four words a top European diplomat chose when we discussed Donald Trump's position on Greenland. Others have used similar language… \"unprecedented\", \"extraordinary\", \"urgent\", \"serious\". Honestly, this is truly a bizarre situation for America's European allies to be in. But most of all, for the people of Greenland, this feels truly existential. Too often in this whole debate it seems to be forgotten that Greenland is a nation, a people, a culture. Here are five takeaways from conversations I have been having here in Washington - what all this means and what next. Trump isn't bluffing First, notwithstanding Trump's \"Art of the Deal\" tactics, it is the Danish government's view - underlined following their foreign ministers' meeting with Trump's team this past week - that the American president is serious. \n                  Greenland crisis: Unleashing Europe's most powerful trade weapon on the US was previously unthinkable - not anymore\n                 \n                  'Our position on Greenland is non-negotiable', says minister amid Trump tariff threat\n                 \n                  Trump claim linking paracetamol use during pregnancy to autism debunked by review\n                 He wants ownership of Greenland. The challenge is to find a compromise - a middle ground - if there is one. No compatibility  That's the second point: there appears to be no compatibility at all between President Trump's position and the EU/Danish/Greenland position. The Danish government has tried to remind the Americans - most recently in this past week's top-level meeting - that they are flexible and open to dialogue and common ground. The only red line the Danes have is any discussion about ceding territory and sovereignty. The Americans can place as many troops as they want in Greenland, they can rename a base \"Fort Trump\" if they want, they can discuss access to critical minerals. All of that is possible. Everything except handing over Greenland and its people to America. Yet I am told that privately, the American position matches Trump's public rhetoric. It amounts to: \"We appreciate all your offers and your cooperation, but now the president believes the only way to secure Greenland from Chinese and Russian threats is if it becomes American territory.\" That makes any dialogue difficult and it's hard to see where any compromise might be found. There may be pressure on Denmark to \"cut a deal\" but it's hard to see what the middle ground is and what any deal would look like. Incidentally, the sense I get here in Washington is that within the US administration there are varying views on the wisdom of Trump's Greenland position. But as we know, the president calls the shots, and no one questions him. Will Europe capitulate? The third point is whether Europeans will, again, capitulate to Trump. They've repeatedly bent the knee to the American president, bowing to his demands and petrified of what his tariff threats could do. But this time, the sense I'm getting is they are tired of his games. They'll hold firm, maybe, because ceding a European territory to America under duress or otherwise is unthinkable, surely. Still - if he follows through with the tariffs, they will hurt. Greenland's strategic importance  It's worth underlining that there are unquestionable strategic reasons for Greenland to be close to the US. The Arctic is opening up and as ice melts, the \"high north\" is increasingly a new frontier where world powers will compete for control. European countries and Greenland all recognise this. But the European argument is that it is possible for the US to be much closer to Greenland without Greenland becoming America. It's been two decades since the Americans last asked for any sufficient military expansion of its forces in Greenland. Read more:Why does Trump want to take over Greenland?Poll reveals what Americans think about Greenland scheme Trump's view is that the only way to deter hypothetical future attempts by Russia or China to take Greenland is to make it American territory. He says Danish sovereignty would not deter them. It is telling that he is ignoring the fact that Greenland is protected by NATO's Article 5 commitment that an attack on one member is an attack on all. Awkward for the UK A final thought. Trump's hostile takeover threats on Greenland are awkward for the UK. While other European governments have seen Trump as an unreliable ally, Prime Minister Sir Keir Starmer has consistently suggested that Britain has a handle on President Trump; knows how to deal with him, hence the \"superior\" trade deal it secured. That's all looking a bit uncomfortable now as the American president doubles down again on his hostile takeover of Greenland."
    },
    {
        "title": "Senegal win Africa Cup of Nations after players storm off pitch during dramatic final",
        "description": null,
        "url": "https://news.sky.com/story/africa-cup-of-nations-players-storm-off-pitch-in-protest-during-dramatic-final-13496010",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-afcon-senegal_7139202.jpg?20260118220346",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-18 21:48:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "'Experienced terrorist' killed by US strikes in Syria after deadly ambush left three Americans dead",
        "description": "An \"experienced terrorist leader\" with ties to al Qaeda has been killed in US strikes, after an Islamic State ambush last month left three Americans dead.",
        "url": "https://news.sky.com/story/experienced-terrorist-killed-by-us-strikes-in-syria-after-deadly-ambush-left-three-americans-dead-13495724",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-usaf-air-force_7138592.jpg?20260118010114",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-18 00:17:00",
        "Headline": "\"There is no safe place for those who conduct, plot, or inspire attacks on American citizens,\" warned Admiral Brad Cooper.",
        "Content": "An \"experienced terrorist leader\" with ties to al Qaeda has been killed in US strikes, after an Islamic State ambush last month left three Americans dead. Bilal Hasan al Jasim had direct links to the ambush, which killed two US soldiers and a civilian interpreter in Syria, according to officials. Now he too has been killed in a third round of retaliatory strikes in Syria, which targeted the northwest of the country on Friday. US Central Command (CENTCOM) described Jasim as \"an experienced terrorist leader who plotted attacks and was directly connected\" to the 13 December ambush. \"The death of a terrorist operative linked to the deaths of three Americans demonstrates our resolve in pursuing terrorists who attack our forces,\" said Admiral Brad Cooper, CENTCOM commander. \"There is no safe place for those who conduct, plot, or inspire attacks on American citizens and our warfighters. We will find you.\" Defence secretary Pete Hegseth, in a post on X, added: \"We will never forget, and never relent.\" \n                  Aafia Siddiqui: Doctor accused of terrorism calls for presidential pardon before Biden hands over to Trump\n                 \n                  Controversial plea deal for 9/11 suspects revoked in dramatic U-turn\n                 \n                  Doctor, 88, reunited with family after being held captive by al Qaeda-linked militants for seven years\n                 The ambush last month killed Sgt Edgar Brian Torres-Tovar, Sgt William Nathaniel Howard and civilian interpreter Ayad Mansoor Sakat. In the aftermath, Donald Trump launched an operation against \"ISIS thugs\" who were regrouping after Syrian dictator Bashar al Assad was deposed in December 2024. Read more:US carries out large-scale strikes against IS targets in SyriaBritish forces bomb underground IS facility in Syria The US president emphasised that American forces were fighting alongside Syrian troops, and that Syrian president Ahmed al Sharaa was \"extremely angry\" about the ambush. So far, the US military claims to have hit more than 100 ISIS targets in Syria."
    },
    {
        "title": "Ceasefire declared between Syrian government and Kurdish-led forces",
        "description": "A ceasefire has been declared between Syrian government troops and US-backed Kurdish-led forces, according to state media.",
        "url": "https://news.sky.com/story/syrian-army-seizes-oil-and-gas-fields-after-fighting-kurdish-led-forces-13495795",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-syria-tabqa-syrian-army_7138924.jpg?20260118152654",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-18 10:19:00",
        "Headline": "The takeover of the Omar oil field to the east of the Euphrates River was a major blow to the Kurdish group as it provided a key source of revenue.",
        "Content": "A ceasefire has been declared between Syrian government troops and US-backed Kurdish-led forces, according to state media. Fighting had intensified recently, with Syrian troops seizing the country's largest oil field as well as a gas field from the group. Now, the government troops will secure all oil and gas fields in the area around Deir Ezzor and Raqqa, \"to ensure the return of resources to the Syrian state\", according to Syrian news agency Sana. All US-backed Syrian Democratic Forces (SDF) military groups are to withdraw, although military and security personnel will be integrated into the Syrian Ministries of Defense and Interior, with military ranks.  The government has made a commitment not to harm the employees and fighters of the SDF or the civil administration in either Deir Ezzor or Raqqa. The loss of the Omar oil field to the east of the Euphrates River was a major blow to the Kurdish-led group as it provided a key source of revenue. The Syrian army also captured the Conoco gas ‌field in the eastern Deir Zor province, as part of an advance into areas of northeast Syria controlled by the historically American-supported ​SDF. Syrian government officials said the oil wealth the militia had controlled to sustain its self-administered region had deprived the state of much-needed revenue. Last week, Syrian President Ahmed al Sharaa said it was unacceptable for a militia to control a quarter of the country and hold its main oil and commodities resources. The Syrian army ‍also took control of the northern city of Tabqa and its adjacent dam, as well as the major Freedom Dam, formerly known as the Baath Dam, west of Raqqa late on Saturday. The advance continued despite Washington's calls to halt the offensive. Brad Cooper, who heads the US ‍military's Central Command, said on X on Saturday that Syrian troops should \"cease any offensive actions in areas\" between the city of Aleppo and the town of Tabqa, about 100 miles (160km) further east. The US has had to recalibrate its Syria policy to balance years of support for the SDF - which fought against Islamic State - with Washington's support for Syria's new president, whose rebel forces ousted dictator Bashar al Assad in late 2024. Kurdish-led forces were overwhelmed following offensives ‍led by Arab tribal fighters, a government source said, allowing the Syrian government and its tribal allies to move into a more than 150km (93 mile) stretch of territory starting from Baghouz near ⁠the Iraqi border towards key towns including ‌al Shuhail and Busayra. The ‌latest violence has deepened the fractures between the government led by Mr Sharaa, who has vowed to reunify Syria after 14 years of war, and ‍local Kurdish authorities wary of his Islamist-led administration. Syrian Kurdish authorities have ​not acknowledged the loss of territory. Read more:'Experienced terrorist' killed by US strikes in SyriaRapper describes 'massacre' on Iran's streets In the days leading up to the capture of the oil and gas fields, Syrian troops had amassed around a cluster of villages that lie just west of the Euphrates and called on the SDF personnel stationed there to move their forces on the ​opposite bank of the river. SDF fighters withdrew from the area ​early on Saturday, but later accused Syrian troops of violating the agreement by pushing further east into towns and oilfields not included in the deal. The initial withdrawal deal included the main town of Deir Hafer, east of Aleppo, and some surrounding villages, with predominantly ‌Arab residents. The Syrian army said four of its troops had been killed in attacks by Kurdish militants. The SDF said some of its fighters had been killed, but did not provide a number. 👉 Tap here to follow The World with Richard Engel and Yalda Hakim wherever you get your podcasts 👈France's President ‌Emmanuel Macron said on X on Sunday he ​had spoken to Mr Sharaa to express ​his concern ​about the ongoing government offensive against ‍Western-backed Kurdish forces and called for a \"⁠permanent ceasefire\". The two sides engaged in talks last year to integrate Kurdish-run military and civilian bodies into the Syrian government by the end of 2025. But after the deadline passed with little progress, clashes broke out in the northern city of Aleppo earlier this month."
    },
    {
        "title": "Trump is not bluffing, Greenland situation is critical for Europe and NATO",
        "description": "\"The situation is critical&#8230;\"&#160;Those are the four words a top European diplomat&#160;chose when we discussed Donald Trump's position on Greenland.",
        "url": "https://news.sky.com/story/trump-is-not-bluffing-greenland-situation-is-critical-for-europe-and-nato-13495736",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-eu_7138626.jpg?20260118041448",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2026-01-18 06:00:00",
        "Headline": "There appears to be no compatibility at all between the positions of President Trump and the EU when it comes to Greenland.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n \"The situation is critical…\" Those are the four words a top European diplomat chose when we discussed Donald Trump's position on Greenland. Others have used similar language… \"unprecedented\", \"extraordinary\", \"urgent\", \"serious\". Honestly, this is truly a bizarre situation for America's European allies to be in. But most of all, for the people of Greenland, this feels truly existential. Too often in this whole debate it seems to be forgotten that Greenland is a nation, a people, a culture. Here are five takeaways from conversations I have been having here in Washington - what all this means and what next. Trump isn't bluffing First, notwithstanding Trump's \"Art of the Deal\" tactics, it is the Danish government's view - underlined following their foreign ministers' meeting with Trump's team this past week - that the American president is serious. \n                  Greenland crisis: Unleashing Europe's most powerful trade weapon on the US was previously unthinkable - not anymore\n                 \n                  'Our position on Greenland is non-negotiable', says minister amid Trump tariff threat\n                 \n                  Trump claim linking paracetamol use during pregnancy to autism debunked by review\n                 He wants ownership of Greenland. The challenge is to find a compromise - a middle ground - if there is one. No compatibility  That's the second point: there appears to be no compatibility at all between President Trump's position and the EU/Danish/Greenland position. The Danish government has tried to remind the Americans - most recently in this past week's top-level meeting - that they are flexible and open to dialogue and common ground. The only red line the Danes have is any discussion about ceding territory and sovereignty. The Americans can place as many troops as they want in Greenland, they can rename a base \"Fort Trump\" if they want, they can discuss access to critical minerals. All of that is possible. Everything except handing over Greenland and its people to America. Yet I am told that privately, the American position matches Trump's public rhetoric. It amounts to: \"We appreciate all your offers and your cooperation, but now the president believes the only way to secure Greenland from Chinese and Russian threats is if it becomes American territory.\" That makes any dialogue difficult and it's hard to see where any compromise might be found. There may be pressure on Denmark to \"cut a deal\" but it's hard to see what the middle ground is and what any deal would look like. Incidentally, the sense I get here in Washington is that within the US administration there are varying views on the wisdom of Trump's Greenland position. But as we know, the president calls the shots, and no one questions him. Will Europe capitulate? The third point is whether Europeans will, again, capitulate to Trump. They've repeatedly bent the knee to the American president, bowing to his demands and petrified of what his tariff threats could do. But this time, the sense I'm getting is they are tired of his games. They'll hold firm, maybe, because ceding a European territory to America under duress or otherwise is unthinkable, surely. Still - if he follows through with the tariffs, they will hurt. Greenland's strategic importance  It's worth underlining that there are unquestionable strategic reasons for Greenland to be close to the US. The Arctic is opening up and as ice melts, the \"high north\" is increasingly a new frontier where world powers will compete for control. European countries and Greenland all recognise this. But the European argument is that it is possible for the US to be much closer to Greenland without Greenland becoming America. It's been two decades since the Americans last asked for any sufficient military expansion of its forces in Greenland. Read more:Why does Trump want to take over Greenland?Poll reveals what Americans think about Greenland scheme Trump's view is that the only way to deter hypothetical future attempts by Russia or China to take Greenland is to make it American territory. He says Danish sovereignty would not deter them. It is telling that he is ignoring the fact that Greenland is protected by NATO's Article 5 commitment that an attack on one member is an attack on all. Awkward for the UK A final thought. Trump's hostile takeover threats on Greenland are awkward for the UK. While other European governments have seen Trump as an unreliable ally, Prime Minister Sir Keir Starmer has consistently suggested that Britain has a handle on President Trump; knows how to deal with him, hence the \"superior\" trade deal it secured. That's all looking a bit uncomfortable now as the American president doubles down again on his hostile takeover of Greenland."
    },
    {
        "title": "Huge NASA rocket reaches launch pad after painstaking 1mph journey",
        "description": "NASA's enormous rocket that will soon carry astronauts around the moon has reached its launch pad.",
        "url": "https://news.sky.com/story/huge-nasa-rocket-reaches-launch-pad-after-painstaking-1mph-journey-13495639",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nasa-artemis_7137906.jpg?20260117143153",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-18 00:01:00",
        "Headline": "Artemis 2 is scheduled for lift-off next month and will see four astronauts travel around the moon for the first time in 50 years.",
        "Content": "NASA's enormous rocket that will soon carry astronauts around the moon has reached its launch pad. The painstaking 11.5-hour journey from the hangar saw the rocket move upright for four miles, loaded on to the back of a Crawler Transporter 2. The transporter itself weighs 3 million kilograms and is roughly half the size of a football pitch, while the rocket is taller than Big Ben. The transporter burned a litre of diesel every 3.5m of the trip, travelling at just one mile per hour most of the time.  Artemis 2 is scheduled for lift-off next month and will see four astronauts travel around the moon for the first time in 50 years. The next mission, Artemis 3, plans to land NASA astronauts on the moon's surface. As the rocket was making its way to the launch pad, the four astronauts told reporters what they planned on taking into space with them. Mission commander Reid Wiseman said he has a blank piece of paper and a pen and pencil. \"I can't wait to write some thoughts on that. I don't know what to expect, and I don't want to go in with any preconceived notions,\" he said. Science correspondent NASA is in a tight space race with China to return to the lunar surface and establish a moon base.\n\n Delays in the development of the SpaceX Starship, which is due to shuttle astronauts from the Orion capsule, while it orbits the moon, down to the surface, have pushed back US plans.\n\n NASA has said the Artemis landing could now be 2028, three years later than original planned.\n\n China hopes to land taikonauts on the surface by 2030.\n\n The destination this time is the moon's rugged south pole, where no humans have been before. Scientists believe there is water ice deep frozen in the permanently shaded craters.\n\n That water could sustain a moon base, providing drinking water as well as oxygen to breath and the components of rocket fuel to explore further into the solar system.\n\n There are also big plans to study the moon's geology, and perhaps one day even mine minerals to transport back to Earth.\n\n Mission pilot Victor Glover will take his Bible with him, along with an heirloom from each of his daughters and his wife. \"For me, it's handwritten notes from people I love,\" said mission specialist Christina Koch. \"The idea I can hold in my hands way out there something that they held in their hands. It's really special to me.\" Mission specialist Jeremy Hansen said he's put four moon pendants worn by his wife and children on to the rocket. \"I collected them back this summer and now they're on that vehicle, rolling to the pad,\" he said. Although the Artemis rocket is 13m shorter than the Saturn V that launched the Apollo missions, it's about 15% more powerful. It has 8.8 million pounds of thrust, roughly the same as 28 jumbo jets and can lift 27 tonnes to deep space. Because of its size, it needs to reach a speed of 24,000mph to break free of the Earth's gravity and head to the moon. Read more space stories:ISS astronauts back after first ever emergency returnRacing to replace the International Space StationInside the lab trying to protect the astronauts of the future Once the rocket is safely on its launch pad, crews will start even more rigorous testing. The fuelling test, called a \"wet dress rehearsal\", is scheduled to take place on 2 February, four days before the first launch window. Based on the rocket's performance during that test, NASA will decide if Artemis 2 will be ready for a 6 February launch. In addition to the fuelling tests, NASA will need to perform a series of Space Launch System rocket and Orion crew capsule checks, as well as a run through with the Artemis 2 astronaut crew."
    },
    {
        "title": "'Our position on Greenland is non-negotiable', says minister amid Trump tariff threat",
        "description": "The UK government's position on Greenland is \"non-negotiable\" and the island's future is \"for the people of Greenland\", a senior minister has told Sky News.",
        "url": "https://news.sky.com/story/our-position-on-greenland-is-non-negotiable-says-minister-amid-trump-tariff-threat-13495792",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lisa-nandy-donald-trump_7138768.png?20260118105943",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-18 10:05:00",
        "Headline": "The culture secretary's comments come after Donald Trump announced he will be imposing 10% tariffs on the UK and other European countries - in an attempt to purchase Greenland.",
        "Content": "The UK government's position on Greenland is \"non-negotiable\" and the island's future is \"for the people of Greenland\", a senior minister has told Sky News. It follows Donald Trump announcing on Saturday he will be imposing 10% tariffs on the UK and other European nations from 1 February, which will then rise to 25% from 1 June, until a deal is reached for Washington to purchase the territory. The US president said the tariffs \"on any and all goods\" sent to the US would hit the UK, Denmark, Norway, Sweden, France, Germany, the Netherlands and Finland. Greenland, in the North Atlantic Ocean, is a semi-autonomous region, whose foreign and defence policies are set by Denmark. Politics live - follow latest But the UK has insisted the US should have no say in Greenland's future, with Sir Keir Starmer hitting back on Saturday evening that the tariffs are \"completely wrong\". Asked for her reaction to the tariffs, Culture Secretary Lisa Nandy told Sky News: \"The prime minister was very clear last night that we believe that this decision on tariffs is completely wrong. \n                  Greenland crisis: Unleashing Europe's most powerful trade weapon on the US was previously unthinkable - not anymore\n                 \n                  Trump is not bluffing, Greenland situation is critical for Europe and NATO\n                 \n                  Trump claim linking paracetamol use during pregnancy to autism debunked by review\n                 \"The future of Greenland is for the people of Greenland and the people of the Kingdom of Denmark to determine and for them alone. We've been consistent about that.\" Speaking to Sunday Morning with Trevor Phillips, she added: \"Our position on Greenland is non-negotiable. We've made that very clear. And we'll continue to make that clear.\" The cabinet minister also insisted the government has conveyed this to their US counterparts, and that she believes the two nations \"need to work together - not divide ourselves from one another\". Challenged on whether she could rule out the UK ever supporting the US purchasing Greenland, Ms Nandy responded that the government \"wouldn't support anything\" that Greenlanders would not support. The senior government minister also refused to say if the UK would impose reciprocal tariffs on the US, arguing that \"we have to have good relationships with countries all over the world in order to be able to have those serious conversations about future decisions that the other countries may or may not make\". Zia Yusuf, Reform UK's head of policy, also told Sky News that his party is \"gravely concerned\" by US tariffs. \"Bigger tariffs, on this country will make it even harder for British manufacturers, even harder for British workers. So we are very, very concerned about it,\" he said. \"Nigel's been clear about our concern about this.\" He was also asked by Sir Trevor whether Nigel Farage would be willing to use his longstanding friendship with Mr Trump to pick up the phone and try to ease the tariffs. Mr Yusuf responded that Reform UK's leader has not spoken to the president as it is \"not his place\" as \"Sir Keir Starmer is the prime minister of this country\". Challenged that it could be Mr Farage's patriotic duty to use his friendship, Mr Yusuf responded: \"If the prime minister of this country or the foreign secretary called Nigel and said, could you make that call? I very much doubt he would say no. \"But again, it's not his place to do that.\" Annalena Baerbock, the president of the United Nations General Assembly, also insisted that it is up to those in Greenland to decide their own future. She told Sky News: \"The right of sovereignty lies with the people in every country, and the people of Greenland, the people of Denmark have been crystal clear about it, that it's self-determination.\" The former foreign minister of Germany added that \"international law is very clear\" on sovereignty, and that the UN charter is \"crystal clear\" about annexation and the use of war. \"It's forbidden, if not agreed in the international community\", Ms Baerbock said. EU ambassadors are due to hold an emergency meeting in Brussels at 5pm local time on Sunday, in response to the tariff threat - but it is unclear if the UK will be attending."
    },
    {
        "title": "Asda-owner closes in on £275m deal to buy NCC unit Escode",
        "description": "The private equity firm which owns a controlling stake in Asda is closing in on a &#163;275m deal to buy a division of the listed cybersecurity company NCC Group.",
        "url": "https://news.sky.com/story/asda-owner-closes-in-on-163275m-deal-to-buy-ncc-unit-escode-13495951",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-stock-cyber-hack_6950483.jpg?20250625150140",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-18 18:24:00",
        "Headline": "TDR Capital is in advanced talks to buy the software escrow division as soon as this week, leaving NCC Group listed in London as a pure-play cybersecurity company, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity firm which owns a controlling stake in Asda is closing in on a £275m deal to buy a division of the listed cybersecurity company NCC Group. Sky News has learnt that TDR Capital is in late-stage talks to buy Escode, which has been the subject of acquisition talks since last summer. Banking sources said a deal between TDR and NCC for Escode, which specialises in software escrow and verification services, could be struck in the early part of this week. TDR is said to have seen off competition from a string of rival suitors, with other buyout firms which showed interest in Escode said to have included Cap10, Platinum Equity and Montague Private Equity. If completed, the deal would leave NCC as a pure-play cybersecurity service company, with a repositioning of the remaining unit towards higher value, recurring revenue streams. NCC has said that if the sale of Escode goes ahead, it would consider a significant return of capital to shareholders, beyond a previously announced initial share buyback programme. Last summer, Sky News revealed that NCC had also appointed advisors to explore a sale of the cybersecurity business. Read more from Sky News:Government to unveil radical overhaul of merger probesThe parking loopholes and tricks every driver should know NCC employs about 2,200 people across Europe, North America and Asia-Pacific. On Friday, its shares closed at 139.8p, giving it a market capitalisation of about £440m. NCC and TDR declined to comment."
    },
    {
        "title": "Government to unveil radical overhaul of merger probes",
        "description": "The government will this week unveil plans for a radical overhaul of the way mergers are scrutinised in Britain including reforms that observers say will entrench the power of the competition regulator's boss.",
        "url": "https://news.sky.com/story/government-to-unveil-radical-overhaul-of-merger-probes-13495807",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-peter-kyle_7134077.jpg?20260113113725",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-18 11:23:00",
        "Headline": "Competition regulators' scrutiny of corporate mergers and takeovers, as well as entire industry sectors, faces its most significant shake-up in decades this week, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The government will this week unveil plans for a radical overhaul of the way mergers are scrutinised in Britain including reforms that observers say will entrench the power of the competition regulator's boss. Sky News has learnt that the Department for Business and Trade (DBT) is to announce the abolition of the Competition and Markets Authority's (CMA) panels system, under which independent experts convene to assess whether corporate deals raise serious anti-trust concerns. A government source said the CMA's ability to examine certain types of mergers, such as those involving two foreign companies, could be curtailed under new limits on the watchdog's jurisdictional powers. They added that officials had also been considering scrapping the ability for those affected by merger decisions to appeal against the verdicts on their merits, while leaving intact the ability to seek judicial reviews. The CMA's current practice of wide-ranging market investigations into entire industries will also be refined, with the CMA's market studies and market investigations processes merged into a single procedure which lasts between six and 12 months. Read more from Sky News:Met Police chief calls for overhaul of 'out of date' policing systemUS 'wants countries to pay $1bn to stay on Gaza peace board' Sources said the CMA would also establish a board sub-committee to scrutinise mergers which are subject to the more detailed Phase-2 investigations and another to supervise the wider market studies. \n                  Asda-owner closes in on £275m deal to buy NCC unit Escode\n                 \n                  Rolls-Royce hands 'Turbo Tufan' multimillion pound annual pay boost\n                 \n                  Starmer begins pushback against Trump as president threatens tariffs over Greenland\n                 One insider said the CMA chief executive, Sarah Cardell, would be eligible to serve on at least one of these board sub-committees, which they added would have the effect of giving the body's boss much greater influence over the cases it investigates. The mergers sub-committee is expected to be augmented by external expert figures, which critics may argue effectively replicates the existing panels system in an inferior way. Currently, deals including the merger of bread producers Hovis and Kingsmill are the subject of Phase-2 investigations, while the CMA has been conducting a long-running probe into the operation of the UK's veterinary services market. A Whitehall source described the proposed changes as the most significant for decades. Peter Kyle, the business and trade secretary, is due to attend this week's World Economic Forum in Davos, Switzerland, and could announce the plans there by saying that they will aid the government's focus on boosting economic growth. The government is said to believe that the reforms will accelerate decision-making, providing greater certainty to business. They will come a year after the former chairman of the CMA, Marcus Bokkerink, was ousted by ministers including the chancellor, Rachel Reeves, as part of a push to deregulate and bolster Britain's anaemic growth figures. However, ministers are expected to face questions about whether the proposals risk undermining the independence of merger investigations. \"There is a risk in relation to what an interventionist politician could do as it makes the system more vulnerable to political influence and gives far more discretion to the CMA's CEO and board to be more or less interventionist,\" one regulatory lawyer said this weekend. Neither DBT nor the CMA would respond to questions about the planned overhaul."
    },
    {
        "title": "Starmer begins pushback against Trump as president threatens tariffs over Greenland",
        "description": "It's hardly a Love Actually moment of brave UK defiance in the face of a domineering US president - but Sir Keir Starmer has clearly decided it's time to start pushing back.",
        "url": "https://news.sky.com/story/keir-starmer-begins-pushback-against-trump-as-president-threatens-tariffs-over-greenland-13495726",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-keir-starmer_7138587.jpg?20260118235218",
        "type": "Business",
        "Author": "Amanda Akass",
        "Date Published": "2026-01-18 00:29:00",
        "Headline": "The prime minister has worked hard to build a special relationship with Donald Trump, but that relationship has become decidedly abusive.",
        "Content": "\n          Political correspondent\n              @amandaakass\n It's hardly a Love Actually moment of brave UK defiance in the face of a domineering US president - but Sir Keir Starmer has clearly decided it's time to start pushing back. Donald Trump, he has said, is \"completely wrong\" to slap tariffs on the UK and other European countries \"for pursuing the collective security of NATO allies.\" He's not going as far as President Macron, who has pledged never to change course in the face of \"intimidation or threat\". But while the PM has previously been clear about the UK's staunch support for Denmark - he's usually very cautious in his dealings with the mercurial president. Starmer has invested huge political capital and personal energy in developing a personal connection with Donald Trump, despite their obvious differences. Indeed the PM's efforts at strengthening the so-called special relationship - particularly in the service of Ukraine - have been widely seen as one of the more successful aspects of his bumpy premiership thus far. But that relationship has become decidedly abusive - Trump accuses the UK and other European allies of \"playing a very dangerous game\" in travelling to Greenland \"for purposes unknown\". \n                  Greenland issue the most serious crisis in transatlantic relations in decades - where do we go from here?\n                 \n                  Greenland crisis: Unleashing Europe's most powerful trade weapon on the US was previously unthinkable - not anymore\n                 \n                  'Our position on Greenland is non-negotiable', says minister amid Trump tariff threat\n                 The UK has sent just one single military officer to Greenland to carry out a reconnaissance mission ahead of a future joint exercise in the area, alongside a handful of troops from other countries. While this was clearly done in solidarity with the Danes and Greenlanders, the idea was also precisely to demonstrate that NATO has been listening to the president's concerns about Greenland. The PM's statement stressed he has \"made [it] clear that Arctic Security matters for the whole of NATO and allies should all do more together to address the threat from Russia\". It's a topic he has repeatedly discussed in phone calls with Trump and other European leaders over the past few weeks, following the White House's resurgent interest in Greenland. But it's clear from the president's Truth Social post that no amount of NATO positioning - certainly not a handful of soldiers on a training exercise - is going to change his mind. He's now absolutely fixated on taking over Greenland - commandeering what would be the 51st state of the US. In such extraordinary circumstances, Starmer's key political opponents have actually come out in support of his position on Greenland - and against Trump. Conservative leader Kemi Badenoch said she agreed with him, also describing Trump's approach as \"completely wrong\". Nigel Farage said Reform UK \"certainly don't\" agree with the US government. Liberal Democrat Ed Davey, who has a long track record in criticising the government's cosy relationship with Donald Trump, called for \"the PM to stand firm against the bully in the White House\". Read more:Why does Trump want to take over Greenland?Poll reveals what Americans think about Greenland schemeTrump says US will act on Greenland 'whether they like it or not' Many backbenchers have been much more gung-ho in their insults and calls for action. Former Lib Dem leader Tim Farron asked \"if Starmer, Badenoch and Farage *still* think it's worth shamelessly appeasing this wombat?\" Conservative backbencher Simon Hoare described Trump as a \"gangster pirate\" and called for the King's visit to be cancelled. Tory former army officer Ben Obese-Jecty MP demanded the PM \"defend British interests\" and questioned why the Americans had reduced the number of their troops based in Greenland from thousands to around 150 if its security is really so important to the US. In perhaps the most scathing assessment, Conservative MP Alicia Kearns MP asked \"what has all Labour's sycophantic fawning achieved in the national interest?\" That's surely a raw question in Downing Street this weekend as the PM and his team attempt to strategise their response. How can they really stand up to an American president on the march under the threat of an international trade war? Further tariffs of 10 and 25% - presumably on top of the existing 10% tariff on most baseline goods exported to the US - will hardly help in the mission to drive growth into the tottering British economy. Could we see an emergency visit to Washington by the group of leaders, as they did last summer in support of Ukrainian President Volodymyr Zelenskyy? Might Italian Prime Minister Georgia Meloni, not currently on Trump's hit list, be prevailed upon to use her own influence with the US? Is there any more ring-kissing that can be done? Counter tariffs? Or will they be forced to capitulate - and give up Greenland, and the principle of NATO solidarity with it? Whatever happens, Trump has made his position abundantly clear. The path for European leaders is much less so."
    },
    {
        "title": "Greenland issue the most serious crisis in transatlantic relations in decades - where do we go from here?",
        "description": "Keir Starmer had wanted this week to get on with his \"cost of living tour\" of the country to tap into voters' concerns in this all-important election year.",
        "url": "https://news.sky.com/story/greenland-issue-the-most-serious-crisis-in-transatlantic-relations-in-decades-where-do-we-go-from-here-13495988",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-greenland_7135134.jpg?20260114133538",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-18 19:26:00",
        "Headline": "The prime minister will attempt to negotiate with Trump to see off the tariff threat, but he will not back down over the principle of the sovereignty of Denmark. ",
        "Content": "\n          Political editor\n              @BethRigby\n Keir Starmer had wanted this week to get on with his \"cost of living tour\" of the country to tap into voters' concerns in this all-important election year. Donald Trump's Greenland threat obstructed that: Over the weekend, the prime minister and his team have been locked in talks in Downing Street, and with European allies, over how to respond to President Trump's latest audacious move. The president's threat to apply an additional levy on goods from France, Germany, the Netherlands, Norway, Sweden and Finland from 1 February is a moment of huge escalation in tensions between allies over Greenland that has astonished and angered. \"It's through the looking glass,\" opined one official. \"We don't know if he's going to back down, what if he doesn't?\"  Starmer holds 'short and cordial' call with Trump over Greenland tariff move - latest updates For now, the prime minister and his team are working to get him to do exactly that. \"As before, we're taking a deep breath and using relationships to figure out exactly where the US are before reacting to every social media post,\" said one figure involved. \"What the PM has said publicly illustrates how we feel and how we have been working on it this weekend.\" Read more: Why Trump says the US 'needs' Greenland - and what the fallout could be Mr Starmer said on Saturday that the decision to impose 10% tariffs on the UK and seven other European countries was \"completely wrong\" and reiterated his position that the future of Greenland is \"a matter for the Greenlanders and the Danes\". On Sunday, the UK issued another joint statement with Denmark, Finland, France, Germany, the Netherlands, Norway and Sweden, warning that \"tariff threats undermine transatlantic relations and risk a dangerous downward spiral\". This escalation appears to have perhaps been sparked by the decision by these eight European NATO members to carry out a reconnaissance mission to Greenland in recent days. Prime Minister Meloni of Italy, who spoke to President Trump on Sunday morning, said the White House may have misunderstood the military exercise and not realised it was directed against Russia and China and not the US. \"There could have been a problem of understanding and communication,\" she said. \"It seems to me that the risk is that the initiatives of some European countries were interpreted as anti-American, which is clearly not the intention.\" Allies have since reiterated that point, saying in their Sunday statement that they were \"committed to strengthening Arctic security as a shared transatlantic interest\". The \"pre-co-ordinated Danish exercise Arctic Endurance, conducted with Allies, respond to this necessity. It poses no threat to anyone\". The allies' intention is to work with the US to strengthen High North security, and this will be the message the prime minister will make when he speaks on the latest developments this week. Read more:How NATO's collective defence clause worksAnalysis: Trump likely gambling he can get away with Greenland grabColombia, Cuba, Mexico, Greenland or Iran - where could Trump strike next? One senior government official said the Trump administration was \"not listening to calibrated language when the UK and other European capitals [say they] believe in Arctic security\". European leaders at the annual Davos summit this week - the PM is currently not expected to be attending - will want impress upon him that allies want to work with the US through NATO. But the big unknown is whether the US wants to work with European allies through NATO. When it comes to Greenland and security in the High North, President Trump seems to want to work unilaterally. He has made it clear from the early days of his administration that he wants to annex Greenland, build a bigger America and use this landmass to strengthen US security. The Danes have clearly told President Trump that he could massively expand US security presence on Greenland, as written into previous treaties, but that doesn't seem to be enough. It is almost as if President Trump, not a fan of multilateralism, is trying to undermine NATO, just as he is undermining the United Nations by drawing up a Board of Peace to supervise Gaza's transitional administration. He's also asking 60 countries to contribute $1bn if they want their membership on the board to extend beyond three years. After fulfilling its initial aim to end the conflict in Gaza, the board would then expand to tackle conflicts elsewhere. On both fronts, President Trump is choosing to turn away from international bodies. It is a clear pattern. Last week, he announced his intent to withdraw the US from 66 multilateral forums and retracted billions of dollars in spending from international organisations. This latest rupture is a reflection of how, in just a year, the certainties that have underpinned our global order have come undone. The US has shifted from being the foundation stone of the Western alliance to an unreliable ally. The threats over Greenland must be a red line for the UK and other allies. On that, the UK is clear. The prime minister will attempt to negotiate with Trump to see off the tariff threat, but he will not back down over the principle of the sovereignty of Denmark. Expect Keir Starmer to reiterate the UK's position while also trying to reiterate the UK's close relationship with the US. I would not expect the PM to use the language of President Macron, who spoke of intimidation and threats, over President Trump's tariff warning. Instead, the PM will make the case this week that the tariffs are not sensible and not in the interests of the UK or the US. Back on to what he wants to spend his time talking about, the cost of living, he is also expected to draw a clear line between the need to engage in international affairs to try to drive down household bills at home. But this is a difficult moment for a prime minister who has prided himself on his ability to negotiate with President Trump to secure better trading terms with the UK. Lib Dem leader Ed Davey said on Sunday the PM's \"US policy lies in tatters\" as NATO allies are \"punished\" by Trump for \"doing the right thing\". As for the tariffs, as of Sunday, the government were not sure about the implications of the Trump threat, with information scant on how this particular 10% tariff might apply. It is possible that the threat will fall away - as happened with the 100% levy on films made outside the US. But these tensions could also escalate - and all the options are deeply worrying. From levies and trade wars, to the disintegration of NATO and withdrawal of support for Ukraine. What if the US did decide to use force to take Greenland? Would European armies end up in conflict with the US? All of it seems unconscionable in a situation that is fast becoming the most serious crisis in transatlantic relations in decades. The UK will do all it can to try to de-escalate, but it won't back down."
    },
    {
        "title": "Conservative MP Andrew Rosindell defects to Reform UK",
        "description": "Andrew Rosindell has become the second Conservative MP to defect to Reform UK within a week.",
        "url": "https://news.sky.com/story/conservative-mp-andrew-rosindell-defects-to-reform-uk-13496013",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-andrew-rosindell-reform_7139146.jpg?20260118201331",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-18 22:00:00",
        "Headline": "The MP for Romford announced he had decided to resign from his position as a shadow foreign office minister, days after Robert Jenrick did the same.",
        "Content": "Andrew Rosindell has become the second Conservative MP to defect to Reform UK within a week. The MP for Romford, Essex, announced on Sunday evening he had decided to resign from his position as a shadow foreign office minister in Kemi Badenoch's frontbench and as a member of the Conservative Party. The move came after former senior Tory Robert Jenrick defected on Thursday. It takes the total number of MPs in Reform UK to seven. Both Nigel Farage and Mr Jenrick welcomed Mr Rosindell to the party, calling him a \"patriot\". Mr Rosindell, who has been an MP since 2001, said it was time to put \"country before party\" in a statement announcing his defection. \"Since joining the Conservative Party at the age of 14, I have been a loyal and committed supporter of the principles advocated by Margaret Thatcher that have always underpinned my own political beliefs,\" he wrote. \"However, the time has come to put country before party. \"The failure of the Conservative Party both when in government and more recently in opposition to actively hold the government to account on the issue of Chagossian self-determination and the defence of British sovereignty, represents a clear red line for me.\" Political correspondent Andrew Rosindell certainly isn't as high profile as Robert Jenrick or Nadhim Zahawi, the two Conservatives who defected to Reform UK last week.  But Rosindell was a junior shadow minister who had been a member of the Tory party since the age of 14,  elected to parliament 23 years ago. The move increases Reform UK's number of seats in parliament to seven. That's a 40% increase since the start of the year.  What's more potentially embarrassing for Kemi Badenoch is that his stated reasons for jumping ship echo the devastating critique made by Jenrick just last week about his \"rotten\" former party. \"Sadly, I now believe that the Conservative Party is irreparably bound to the mistakes of previous governments and unwilling to take meaningful accountability,\" he said.  It's particularly painful as it amplifies the attacks Labour have been making on the Tories since winning the last election. Last Friday Badenoch told Sky News her party was more united because of the defenestration of her rival Jenrick. She insisted no other shadow cabinet members would follow.  Andrew Rosindell wasn't in the shadow cabinet, and he's survived a series of controversies – but his loss is still embarrassing, however much Tory sources suggest Reform are welcome to him. We'll have to wait to find out if these recent defections and Nigel Farage's 7 May deadline for anyone considering following suit will lead to a rush of other new recruits.  But the momentum is certainly with Reform and against the Tories, and that's clearly not a comfortable position for Kemi Badenoch to be in.  A Conservative Party source said Mr Rosindell had threatened to defect for months but denied he was doing so until as recently as Saturday. \"The Conservative Party supported Rosindell throughout his many troubles, and he's responded by stabbing his friends, colleagues and activists in the back. Reform are welcome to him,\" the source said. Meanwhile, Labour Party chairwoman Anna Turley said the \"stench of a failed and drying Tory party engulfs Reform\" and a spokesperson for the Liberal Democrats said Mr Rosindell's defection \"isn't a political earthquake\". \"It's a change of rosette for a career politician worried about getting a P45,\" they said. \"The public are fed up hearing about how Britain is broken from the very same people who broke it.\" Read more:All the former Conservative MPs who have defected to Reform?Jenrick defection makes it more likely Reform will win general election, says Yusuf Andrew Rosindell first joined the Tory party at the age of 14. He was elected to represent Romford, Essex, in 2001 and was re-elected in 2024. In parliament, he has previously served as shadow minister for home affairs between 2007 – 2010 and was a long-time advocate of Britain's withdrawal from the European Union. He belonged to a small group of Conservatives who voted against the Brexit withdrawal agreement each time it was put before the House. Rosindell also long campaigned for the Union flag to be flown on all public buildings across the UK, according to his website.  In 2010, it was granted that the Union flag will be flown every day and all year from the Victoria Tower of the Palace of Westminster, which Rosindell had been campaigning for. He is now chairman of the Flags & Heraldry Committee group in Parliament. Following the defection of Mr Rosindell, Mr Jenrick and, before that, former Conservative chancellor Nadhim Zahawi, Tory leader Kemi Badenoch said she was \"100% confident\" she would not see any more of her shadow cabinet leave for Reform. It comes as the party, headed by Mr Farage has set 7 May - the date of crucial local elections in which they hope to make significant gains - as a cut-off point for admitting current and former MPs, as well as for local councillors to defect. Asked if she would be on alert for MPs seeking to switch sides before the elections, Ms Badenoch told the Press Association news agency: \"I think people should be wondering why they set that deadline.\""
    },
    {
        "title": "Hillsborough Law debate withdrawn after backlash from campaigners and MPs",
        "description": "The government has pulled an amendment to its&#160;proposed Hillsborough&#160;Law amid concerns from campaigners and some MPs that intelligence agencies could use it&#160;to \"hide serious failures\" from the public.",
        "url": "https://news.sky.com/story/hillsborough-law-debate-withdrawn-after-backlash-from-campaigners-and-mps-13495967",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-hillsborough-family_7139098.jpg?20260118185443",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-18 18:44:00",
        "Headline": "The government says it will work with campaigners and bereaved families to bring forward amendments when the bill reaches the House of Lords. ",
        "Content": "The government has pulled an amendment to its proposed Hillsborough Law amid concerns from campaigners and some MPs that intelligence agencies could use it to \"hide serious failures\" from the public. It has also withdrawn the legislation from Monday's parliamentary agenda entirely after initially planning for its report stage and third reading to go ahead and then bring forward amendments in the House of Lords. Sky News' deputy political editor Sam Coates said one figure close to the talks described the situation as \"absolutely mental\". The law, officially called the Public Office (Accountability) Bill, is designed to make sure authorities face criminal sanctions if they attempt to cover up the facts behind disasters such as the 1989 Hillsborough tragedy, the Grenfell Tower fire and infected blood scandal. One of the amendments suggested by the government this week meant that spies would be within the scope of the legislation. However, they would only be forced to tell the truth if the head of their service approved it. Campaign group Hillsborough Law Now argued that it could allow intelligence services to \"hide serious failures behind a vague claim of national security\". Now, the government has decided not to push ahead with the amendment, but to work with campaigners and bereaved families to bring forward amendments when the bill reaches the Lords. \n                  Hillsborough Law delayed after backlash\n                 \n                  Hillsborough families hit out at report into disaster - as it finds 12 police officers would have faced gross misconduct cases\n                 \n                  Hillsborough: Long-awaited report into Britain's worst-ever sporting disaster to be published today\n                 Read more:Hillsborough Law: What is it, why was it delayed and what happens next?Hillsborough campaigners hail 'momentous' step as bill introduced \"This legislation will right the wrongs of the past, changing the balance of power to ensure the state can never hide from the people it should serve and putting a legal duty on officials to respond openly and honestly when things go wrong,\" said a government spokesperson. \"The bill will make the police, intelligence agencies and the whole of government more scrutinised than they have ever been, but we can never compromise on national security. \"We will continue to work with all parties to make sure the bill is the strongest it can possibly be, without compromising national security.\" Hillsborough Law Now welcomed the move, posting on X: \"We welcome the government listening to the campaign, families, MPs and supporters by withdrawing their security services amendment. \"We shall engage further with government to ensure the bill fully applies to the security services whilst not jeopardising national security.\" Before the amendment was withdrawn, Liverpool City Region mayor Steve Rotheram and Greater Manchester mayor Andy Burnham said it risked \"undermining the spirit of the legislation\" and \"creates too broad an opt-out\" for the security services. Liverpool West Derby MP Ian Byrne had said he would not be able to support the legislation with the government's amendments included because of \"security service carve-outs\". He had tabled amendments of his own that seek to ensure the duty of candour applies to intelligence officers without such exceptions."
    },
    {
        "title": "'Our position on Greenland is non-negotiable', says minister amid Trump tariff threat",
        "description": "The UK government's position on Greenland is \"non-negotiable\" and the island's future is \"for the people of Greenland\", a senior minister has told Sky News.",
        "url": "https://news.sky.com/story/our-position-on-greenland-is-non-negotiable-says-minister-amid-trump-tariff-threat-13495792",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lisa-nandy-donald-trump_7138768.png?20260118105943",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-18 10:05:00",
        "Headline": "The culture secretary's comments come after Donald Trump announced he will be imposing 10% tariffs on the UK and other European countries - in an attempt to purchase Greenland.",
        "Content": "The UK government's position on Greenland is \"non-negotiable\" and the island's future is \"for the people of Greenland\", a senior minister has told Sky News. It follows Donald Trump announcing on Saturday he will be imposing 10% tariffs on the UK and other European nations from 1 February, which will then rise to 25% from 1 June, until a deal is reached for Washington to purchase the territory. The US president said the tariffs \"on any and all goods\" sent to the US would hit the UK, Denmark, Norway, Sweden, France, Germany, the Netherlands and Finland. Greenland, in the North Atlantic Ocean, is a semi-autonomous region, whose foreign and defence policies are set by Denmark. Politics live - follow latest But the UK has insisted the US should have no say in Greenland's future, with Sir Keir Starmer hitting back on Saturday evening that the tariffs are \"completely wrong\". Asked for her reaction to the tariffs, Culture Secretary Lisa Nandy told Sky News: \"The prime minister was very clear last night that we believe that this decision on tariffs is completely wrong. \n                  Greenland crisis: Unleashing Europe's most powerful trade weapon on the US was previously unthinkable - not anymore\n                 \n                  Trump is not bluffing, Greenland situation is critical for Europe and NATO\n                 \n                  Trump claim linking paracetamol use during pregnancy to autism debunked by review\n                 \"The future of Greenland is for the people of Greenland and the people of the Kingdom of Denmark to determine and for them alone. We've been consistent about that.\" Speaking to Sunday Morning with Trevor Phillips, she added: \"Our position on Greenland is non-negotiable. We've made that very clear. And we'll continue to make that clear.\" The cabinet minister also insisted the government has conveyed this to their US counterparts, and that she believes the two nations \"need to work together - not divide ourselves from one another\". Challenged on whether she could rule out the UK ever supporting the US purchasing Greenland, Ms Nandy responded that the government \"wouldn't support anything\" that Greenlanders would not support. The senior government minister also refused to say if the UK would impose reciprocal tariffs on the US, arguing that \"we have to have good relationships with countries all over the world in order to be able to have those serious conversations about future decisions that the other countries may or may not make\". Zia Yusuf, Reform UK's head of policy, also told Sky News that his party is \"gravely concerned\" by US tariffs. \"Bigger tariffs, on this country will make it even harder for British manufacturers, even harder for British workers. So we are very, very concerned about it,\" he said. \"Nigel's been clear about our concern about this.\" He was also asked by Sir Trevor whether Nigel Farage would be willing to use his longstanding friendship with Mr Trump to pick up the phone and try to ease the tariffs. Mr Yusuf responded that Reform UK's leader has not spoken to the president as it is \"not his place\" as \"Sir Keir Starmer is the prime minister of this country\". Challenged that it could be Mr Farage's patriotic duty to use his friendship, Mr Yusuf responded: \"If the prime minister of this country or the foreign secretary called Nigel and said, could you make that call? I very much doubt he would say no. \"But again, it's not his place to do that.\" Annalena Baerbock, the president of the United Nations General Assembly, also insisted that it is up to those in Greenland to decide their own future. She told Sky News: \"The right of sovereignty lies with the people in every country, and the people of Greenland, the people of Denmark have been crystal clear about it, that it's self-determination.\" The former foreign minister of Germany added that \"international law is very clear\" on sovereignty, and that the UN charter is \"crystal clear\" about annexation and the use of war. \"It's forbidden, if not agreed in the international community\", Ms Baerbock said. EU ambassadors are due to hold an emergency meeting in Brussels at 5pm local time on Sunday, in response to the tariff threat - but it is unclear if the UK will be attending."
    },
    {
        "title": "Jenrick defection makes it more likely Reform will win general election, says senior party figure Zia Yusuf",
        "description": "A leading Reform figure has told Sky News that Robert Jenrick's defection to the party is a \"really important milestone\" and \"makes it more likely that we win the next general election\".",
        "url": "https://news.sky.com/story/jenrick-defection-makes-it-more-likely-reform-will-win-general-election-says-senior-party-figure-zia-yusuf-13495813",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-robert-jenrick-nigel-farage_7136454.jpg?20260115174105",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-18 11:12:00",
        "Headline": "Zia Yusuf has said Robert Jenrick is \"clear-eyed about all of the different ways the Tories betrayed this country\".",
        "Content": "A leading Reform figure has told Sky News that Robert Jenrick's defection to the party is a \"really important milestone\" and \"makes it more likely that we win the next general election\". Until he was kicked out of the Conservative Party by leader Kemi Badenoch on Thursday, Mr Jenrick was the shadow justice secretary and had served more than 11 years as a Tory MP. Ms Badenoch said she had found out he was plotting to defect in \"a way designed to be as damaging as possible\" and then sacked him. Hours later, Mr Jenrick was unveiled as the latest high-profile recruit to Reform UK by leader Nigel Farage, in a week where the party had already welcomed former Tory chancellor, Nadhim Zahawi. Politics latest - follow live Mr Jenrick has conceded he was \"resolved\" to switch to Reform before he was given the boot. Speaking about Mr Jenrick's switch, Reform's head of policy Zia Yusuf told Sky News: \"My assessment is this is a man who is thoughtful, who is clear-eyed about all of the different ways the Tories betrayed this country and wants to help Nigel, help me, help Richard [Tice] and everyone at Reform repair that damage.\" \n                  Conservative MP Andrew Rosindell defects to Reform UK\n                 \n                  Life raft backdrop a baffling choice for Kemi Badenoch's Aberdeen visit given latest defection\n                 \n                  Number of councils that have requested delay to local elections revealed - is yours one of them?\n                 Speaking on Sunday Morning with Trevor Phillips, Mr Yusuf said: \"I also think it's crystal clear that him arriving at Reform makes it more likely that we win the next general election, and I think that's a really important milestone in order for us to do that, to turn the country around.\" Mr Yusuf also said Reform UK would not make a pact with the Conservative Party and \"there isn't space for two centre-right parties\". 'The new sheriff in town' It follows reports that Mr Jenrick's plan for his defection referred to him as \"the new sheriff in town\" and \"the biggest defection story Reform has ever had\". The leaked plan also mentioned Mr Zahawi's defection, suggesting it was prepared in recent days, according to The Mail on Sunday and The Sunday Times. A source close to Mr Jenrick denied he was involved with the document, and said it shows \"Rob is just a member of Nigel's team and wants to help get him in as prime minister\". Asked about whether Mr Jenrick referred to himself as the \"sheriff\", Mr Yusuf told Sky News: \"Any time a politician moves from one party to another, particularly defecting between two fierce rivals, there's going to be briefing and counter briefing.\" But he added that \"what matters is... serving the British people\". He also declined to say what role Mr Jenrick could serve in the party, but said Mr Farage will be \"making those decisions now\". Badenoch says she's 'cleaning out the rubbish' Mr Yusuf also confirmed that Reform intends to \"destroy\" the Conservative Party. He told Sir Trevor: \"There isn't space for two centre-right parties in this country. There just isn't under our electoral system. \"So I'm afraid, we must replace, the Tory. You can call it destroy, replace, whatever it means - but we will not do a pact with the Tories.\" Mr Jenrick has continued his attacks on his former party, writing in The Sun on Sunday that the Tories have \"almost become the party of posh people\" and many are \"so out of touch\". Reform has set a deadline of 7 May (the day of local elections), after which the party has said it will not take any more Conservative Party defectors. It follows accusations that Mr Farage's party is becoming packed with ex-Tory ministers and MPs, while Ms Badenoch wrote in The Times that she is \"cleaning out the rubbish from the Conservative Party\". After this was put to Mr Yusuf on Sky News, he responded: \"Well, if Kemi Badenoch is focused on taking out the rubbish, there'll be nothing at CCHQ (Conservative Campaign Headquarters) or within the parliamentary party.\""
    },
    {
        "title": "Starmer begins pushback against Trump as president threatens tariffs over Greenland",
        "description": "It's hardly a Love Actually moment of brave UK defiance in the face of a domineering US president - but Sir Keir Starmer has clearly decided it's time to start pushing back.",
        "url": "https://news.sky.com/story/keir-starmer-begins-pushback-against-trump-as-president-threatens-tariffs-over-greenland-13495726",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-keir-starmer_7138587.jpg?20260118235218",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2026-01-18 00:29:00",
        "Headline": "The prime minister has worked hard to build a special relationship with Donald Trump, but that relationship has become decidedly abusive.",
        "Content": "\n          Political correspondent\n              @amandaakass\n It's hardly a Love Actually moment of brave UK defiance in the face of a domineering US president - but Sir Keir Starmer has clearly decided it's time to start pushing back. Donald Trump, he has said, is \"completely wrong\" to slap tariffs on the UK and other European countries \"for pursuing the collective security of NATO allies.\" He's not going as far as President Macron, who has pledged never to change course in the face of \"intimidation or threat\". But while the PM has previously been clear about the UK's staunch support for Denmark - he's usually very cautious in his dealings with the mercurial president. Starmer has invested huge political capital and personal energy in developing a personal connection with Donald Trump, despite their obvious differences. Indeed the PM's efforts at strengthening the so-called special relationship - particularly in the service of Ukraine - have been widely seen as one of the more successful aspects of his bumpy premiership thus far. But that relationship has become decidedly abusive - Trump accuses the UK and other European allies of \"playing a very dangerous game\" in travelling to Greenland \"for purposes unknown\". \n                  Greenland issue the most serious crisis in transatlantic relations in decades - where do we go from here?\n                 \n                  Greenland crisis: Unleashing Europe's most powerful trade weapon on the US was previously unthinkable - not anymore\n                 \n                  'Our position on Greenland is non-negotiable', says minister amid Trump tariff threat\n                 The UK has sent just one single military officer to Greenland to carry out a reconnaissance mission ahead of a future joint exercise in the area, alongside a handful of troops from other countries. While this was clearly done in solidarity with the Danes and Greenlanders, the idea was also precisely to demonstrate that NATO has been listening to the president's concerns about Greenland. The PM's statement stressed he has \"made [it] clear that Arctic Security matters for the whole of NATO and allies should all do more together to address the threat from Russia\". It's a topic he has repeatedly discussed in phone calls with Trump and other European leaders over the past few weeks, following the White House's resurgent interest in Greenland. But it's clear from the president's Truth Social post that no amount of NATO positioning - certainly not a handful of soldiers on a training exercise - is going to change his mind. He's now absolutely fixated on taking over Greenland - commandeering what would be the 51st state of the US. In such extraordinary circumstances, Starmer's key political opponents have actually come out in support of his position on Greenland - and against Trump. Conservative leader Kemi Badenoch said she agreed with him, also describing Trump's approach as \"completely wrong\". Nigel Farage said Reform UK \"certainly don't\" agree with the US government. Liberal Democrat Ed Davey, who has a long track record in criticising the government's cosy relationship with Donald Trump, called for \"the PM to stand firm against the bully in the White House\". Read more:Why does Trump want to take over Greenland?Poll reveals what Americans think about Greenland schemeTrump says US will act on Greenland 'whether they like it or not' Many backbenchers have been much more gung-ho in their insults and calls for action. Former Lib Dem leader Tim Farron asked \"if Starmer, Badenoch and Farage *still* think it's worth shamelessly appeasing this wombat?\" Conservative backbencher Simon Hoare described Trump as a \"gangster pirate\" and called for the King's visit to be cancelled. Tory former army officer Ben Obese-Jecty MP demanded the PM \"defend British interests\" and questioned why the Americans had reduced the number of their troops based in Greenland from thousands to around 150 if its security is really so important to the US. In perhaps the most scathing assessment, Conservative MP Alicia Kearns MP asked \"what has all Labour's sycophantic fawning achieved in the national interest?\" That's surely a raw question in Downing Street this weekend as the PM and his team attempt to strategise their response. How can they really stand up to an American president on the march under the threat of an international trade war? Further tariffs of 10 and 25% - presumably on top of the existing 10% tariff on most baseline goods exported to the US - will hardly help in the mission to drive growth into the tottering British economy. Could we see an emergency visit to Washington by the group of leaders, as they did last summer in support of Ukrainian President Volodymyr Zelenskyy? Might Italian Prime Minister Georgia Meloni, not currently on Trump's hit list, be prevailed upon to use her own influence with the US? Is there any more ring-kissing that can be done? Counter tariffs? Or will they be forced to capitulate - and give up Greenland, and the principle of NATO solidarity with it? Whatever happens, Trump has made his position abundantly clear. The path for European leaders is much less so."
    },
    {
        "title": "Doctors warn of 'horrific' impact of tech and devices on children and young people's health",
        "description": "Doctors and medical experts have warned of the growing evidence of \"health harms\" from tech and devices on children and young people in the UK.",
        "url": "https://news.sky.com/story/doctors-warn-of-horrific-impact-of-tech-and-devices-on-young-peoples-health-13495803",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-mobile-phone-child_7098058.jpg?20260118131341",
        "type": "Technology",
        "Author": "Bethany Minelle, news reporter",
        "Date Published": "2026-01-18 10:55:00",
        "Headline": "The Academy of Medical Royal Colleges says it wants to highlight the risks of unrestricted content and screen time to children and young people.",
        "Content": "By Bethany Minelle, news reporter  Doctors and medical experts have warned of the growing evidence of \"health harms\" from tech and devices on children and young people in the UK. The Academy of Medical Royal Colleges (AoMRC) said frontline clinicians have given personal testimony about \"horrific cases they have treated in primary, secondary and community settings throughout the NHS and across most medical specialities\". The body, which represents 23 medical royal colleges and faculties, plans to gather evidence to establish the issues healthcare professionals and specialists are seeing repeatedly that may be attributed to tech and devices. It intends to highlight the sometimes-hidden risks of unrestricted content and screen time to children and young people and provide guidance to the medical profession about how to identify and manage the harm being done. The academy said it already had \"evidence of the impact on children and young people's physical and mental health both from excessive screen time as well as exposure to harmful online content\". It says the work is due to be completed within three months. The letter was sent to Health Secretary Wes Streeting and Science and Technology Secretary Liz Kendall. \n                  Mum of baby who fell seriously ill after being given now-recalled infant formula calls for investigation\n                 \n                  Screen time linked to poor speech development in under-fives, say ministers as parents offered new guidance\n                 \n                  'My daughter was diagnosed with childhood dementia before she turned four - what we were told is criminal'\n                 Chief executive of the National Institute for Health Research, Lucy Chappell, and the UK government's chief medical adviser, Sir Chris Whitty, were also sent a copy. Dr Jeanette Dickson, chair of the academy, told The Sunday Times: \"Without doubt, we are seeing the beginning of a public health emergency with our own eyes. Everywhere we look, we see children and adults glued to their screens. \"I really worry for children, some of whom are self-evidently imprisoned in a digital bubble.\" Recent government research linked screen time to poor speech development in under-fives. It comes as the government prepares to announce plans to restrict the use of social media for under-16s. A consultation is expected to be launched this week. Options range from a full ban to limited interventions, including time restrictions and tighter algorithm controls. In December, Australia introduced a ban on under-16s having social media accounts. Many other countries around the world, including France, Denmark, Norway and Malaysia, are now considering similar bans. However, some children's and online safety organisations say a blanket ban is not the right way forward. A joint statement, signed by 43 child protection charities and online safety groups, including the NSPCC and the Molly Rose Foundation, alongside academics and bereaved families, warned of serious unintended consequences that could put children at greater risk. They wrote: \"Though well-intentioned, blanket bans on social media would fail to deliver the improvement in children's safety and wellbeing that they so urgently need. They are a blunt response that fails to address the successive shortcomings of tech companies and governments to act decisively and sooner.\" Andy Burrows, chief executive of the Molly Rose Foundation, told Sky News: \"We're really concerned that parents and parliamentarians are being presented with a false binary right now, the idea that either we proceed with an outright ban and or we continue with the appalling status quo in which children are coming to harm. Those simply aren't the only options available to us\". He also called on Prime Minister Sir Keir Starmer to \"do the right thing\". Mr Burrows said: \"What we've seen is an online safety act that was watered down because of the political chaos over the last few years. It is not strong enough. It is not being enforced robustly enough. \"But we can take action… We can make sure that the tech companies face the fines and the criminal sanctions that will finally make them address these issues. But it needs Keir Starmer to be listening to this groundswell of concern from parents, from experts, and then to do the right thing.\" In another statement, Chris Sherwood, chief executive of the NSPCC, highlighted the \"countless children\" for whom the internet is \"a lifeline,\" describing it as \"a source of community, identity, and vital support\". He said: \"A blanket ban would take those spaces away overnight and risks driving teenagers into darker, unregulated corners of the internet.\" Mr Sherwood also urged change from online platforms themselves, saying: \"Tech companies must be held accountable by Government and Ofcom for their harmful design choices, their reckless algorithms, and their failure to take responsibility for dangerous content.\""
    },
    {
        "title": "Huge NASA rocket reaches launch pad after painstaking 1mph journey",
        "description": "NASA's enormous rocket that will soon carry astronauts around the moon has reached its launch pad.",
        "url": "https://news.sky.com/story/huge-nasa-rocket-reaches-launch-pad-after-painstaking-1mph-journey-13495639",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nasa-artemis_7137906.jpg?20260117143153",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-18 00:01:00",
        "Headline": "Artemis 2 is scheduled for lift-off next month and will see four astronauts travel around the moon for the first time in 50 years.",
        "Content": "NASA's enormous rocket that will soon carry astronauts around the moon has reached its launch pad. The painstaking 11.5-hour journey from the hangar saw the rocket move upright for four miles, loaded on to the back of a Crawler Transporter 2. The transporter itself weighs 3 million kilograms and is roughly half the size of a football pitch, while the rocket is taller than Big Ben. The transporter burned a litre of diesel every 3.5m of the trip, travelling at just one mile per hour most of the time.  Artemis 2 is scheduled for lift-off next month and will see four astronauts travel around the moon for the first time in 50 years. The next mission, Artemis 3, plans to land NASA astronauts on the moon's surface. As the rocket was making its way to the launch pad, the four astronauts told reporters what they planned on taking into space with them. Mission commander Reid Wiseman said he has a blank piece of paper and a pen and pencil. \"I can't wait to write some thoughts on that. I don't know what to expect, and I don't want to go in with any preconceived notions,\" he said. Science correspondent NASA is in a tight space race with China to return to the lunar surface and establish a moon base.\n\n Delays in the development of the SpaceX Starship, which is due to shuttle astronauts from the Orion capsule, while it orbits the moon, down to the surface, have pushed back US plans.\n\n NASA has said the Artemis landing could now be 2028, three years later than original planned.\n\n China hopes to land taikonauts on the surface by 2030.\n\n The destination this time is the moon's rugged south pole, where no humans have been before. Scientists believe there is water ice deep frozen in the permanently shaded craters.\n\n That water could sustain a moon base, providing drinking water as well as oxygen to breath and the components of rocket fuel to explore further into the solar system.\n\n There are also big plans to study the moon's geology, and perhaps one day even mine minerals to transport back to Earth.\n\n Mission pilot Victor Glover will take his Bible with him, along with an heirloom from each of his daughters and his wife. \"For me, it's handwritten notes from people I love,\" said mission specialist Christina Koch. \"The idea I can hold in my hands way out there something that they held in their hands. It's really special to me.\" Mission specialist Jeremy Hansen said he's put four moon pendants worn by his wife and children on to the rocket. \"I collected them back this summer and now they're on that vehicle, rolling to the pad,\" he said. Although the Artemis rocket is 13m shorter than the Saturn V that launched the Apollo missions, it's about 15% more powerful. It has 8.8 million pounds of thrust, roughly the same as 28 jumbo jets and can lift 27 tonnes to deep space. Because of its size, it needs to reach a speed of 24,000mph to break free of the Earth's gravity and head to the moon. Read more space stories:ISS astronauts back after first ever emergency returnRacing to replace the International Space StationInside the lab trying to protect the astronauts of the future Once the rocket is safely on its launch pad, crews will start even more rigorous testing. The fuelling test, called a \"wet dress rehearsal\", is scheduled to take place on 2 February, four days before the first launch window. Based on the rocket's performance during that test, NASA will decide if Artemis 2 will be ready for a 6 February launch. In addition to the fuelling tests, NASA will need to perform a series of Space Launch System rocket and Orion crew capsule checks, as well as a run through with the Artemis 2 astronaut crew."
    }
]