[
    {
        "title": "October 7: Two lives torn apart by day that changed everything",
        "description": "For a long time, Rita Lifshitz would come back to Kibbutz Nir Oz every week, sit outside the house of her father-in-law, Oded, and have a drink.",
        "url": "https://news.sky.com/story/october-7-two-lives-torn-apart-by-the-day-that-changed-everything-13446218",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rita-lipshitz-sabah-al-qarra_7044546.jpg?20251006235313",
        "type": "Home",
        "Author": "Adam Parsons",
        "Date Published": "2025-10-06 19:01:35",
        "Headline": "Sky's Middle East correspondent meets two women whose lives were torn apart by October 7 - the day Hamas launched its terror attack on Israel in 2023, the day on which everything changed in this part of the Middle East.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  For a long time, Rita Lifshitz would come back to Kibbutz Nir Oz every week, sit outside the house of her father-in-law, Oded, and have a drink. To raise a glass to the people who had gone. To remember October 7. Follow updates on Israel-Hamas war \"We used to drink a beer every weekend,\" she tells me, her eyes trained on the small little table on the patio where they would sit and talk. \"So for 500 days I came to have a beer outside the table. Here I put the beer for grandpa and I put the beer for me. He was my psychologist for 500 days. \"He was only a few kilometres from me and I just imagine him coming in with a big smile.\" Around her, the charred remains of violence, death, and devastation. The burnt-out wreckage of happy lives that came to a horrific end. I spent two hours walking around this kibbutz with Rita. She showed me the places where friends had been murdered, where loved ones had been taken hostage, and where her best friend had been shot and then dragged away, his blood still smeared over the floor of his home. \"It is a trauma,\" she says. \"And all of us, the whole kibbutz, wakes up every morning to the 7th of October.\" On the morning of 7 October 2023, this small kibbutz, which sits within sight of the border with Gaza, was overrun by Hamas fighters. In total, 117 people, more than a quarter of those who were there that morning, were either killed or kidnapped. No other kibbutz suffered such a high proportion of casualties. Among them, Oded Lifshitz and his wife, Yocheved. Both were in their 80s, and both had volunteered for charities promoting peaceful relations with Gazans. Both were taken hostage on October 7. Oded used to drive sick children from Gaza and take them to Israeli hospitals for treatment. Now we stand in the charred remains of their home. Yocheved was eventually released after 16 days as a hostage, but Oded died in captivity. His body was not returned until earlier this year, but he had probably died a year earlier. And now we stand in the charred remains of their house. To Rita, this place is both a touchstone to a happier time and also a stark warning of inhumanity. A panel of metal is all that is left of the piano that Oded loved to play. The couple's crockery is still scattered in a corner, thrown there when their furniture was upended. \"They started firing rockets at us at 6.30 in the morning, but we didn't worry because they have been firing rockets at us for 20 years,\" says Rita. \"There was one day we had 800 rockets land round here, so we are not scared of rockets. We didn't get any information about what was happening, no warning. \"The first we knew was when two people working in the fields saw Hamas, and they were the first ones to be killed.\" It is believed that around 540 fighters attacked the kibbutz - far more than Nir Oz's entire population. It was a massacre. Only six houses escaped attack. The nursery school workshops, gardens - all of them shot, burnt, destroyed. We move to the far end of the home, picking our way through the debris that still litters the floor. There is a steel door, the entrance to the bomb shelter where Oded and Yocheved often slept and where they tried to hide. Their beds are still here, blackened and burnt. In the door are bullet holes - Oded had done his best to hold the door shut, but he was shot in the hand and the attackers stormed in. 'The death road' The last time Yocheved saw her husband was him lying on the floor, bleeding. As she was taken away, rolled into a carpet, she didn't know if he was dead or alive. To walk around this kibbutz is to witness the scars of trauma again and again. A black flag outside a house means someone died there. A yellow flag designates that an occupant was taken hostage. There is a road that Rita calls \"the death road,\" where almost every house has at least one flag outside. Read more about the war in Gaza:Trump's Gaza peace plan explainedSky News reports from inside Gaza City We go into the home of one friend, who was murdered in the living room. Her clothes are still there, her handbag hangs on the bedroom door. It feels so intrusive to be here, but Rita insists the world needs to see. We see Natan, a long-term resident who is now 88 years old. His home was one of only six to escape being ransacked, because the Hamas attackers couldn't work out how to get through the front door. He says he came back as soon as he could, despite the destruction around him, insistent he is not fearful. \"This is my home,\" he says emphatically. Rita takes me to the home of her best friend, Itzhak Elgarat. Unlike most of the homes, his was not set ablaze, so it still looks now as it did then. A bottle of olive oil is on the side, cooking ingredients laid out, a couple of bottles of wine set on the table. But also bullet holes strewn across the walls, in the furniture. Possessions thrown around and, horrendously, Itzhak's blood still smeared across the walls, the floor, and the door where he was shot. The other side I climb a set of stairs, which used to belong to a house that has now been demolished. You can see Gaza in the near distance, across a few fields. And over there, not so long ago, Sabah might have been looking back. Just as Rita's life has been torn apart by the war, so has Sabah's. For Rita, it is the mental torment of what happened on October 7, the struggle to process and to move on. For Sabah, it is something more fundamental. A Gazan displaced from Khan Younis, she once lived in a grand home near the border, only a couple of miles from Kibbutz Nir Oz, as the crow flies. It was a home for multiple generations, the pride of her life, \"a place meant to give us stability and peace\". Since then, she has been displaced 13 times, and she worries that her home has been reduced to rubble. \"Personally, I long to go back to even the ruins of my house, to sit among the rubble, simply to be there,\" she says. \"Even that would be better than this life. At least then I might find a little peace.\" The last time she saw her home, it had been hit by an explosion. Some of it was destroyed, but other parts were habitable. But since then, Sabah has been told that it has been damaged by both fire and military action - news that devastated her. She says: \"Someone told me 'your house was the very first thing they burned. The fire raged inside for three days. And after they burned it, they brought in an armoured vehicle and blew it up'. \"Just imagine losing your home. When they told me what happened to mine, I spent nearly ten days doing nothing but crying. \"It feels like your soul is torn away. Your spirit leaves you.\" She insists that this story is not just about October 7, not just about Hamas, but about decades of struggle that led to this point, about Palestinian anger and accusations that they are oppressed by Israel. \"This goes back generations. What happened on October 7 was not the beginning of the story. I remember my father, my grandfather, and their fathers before them telling what they had endured. We have lived our entire lives under this weight. \"This land is ours, our homeland. We did not buy it. It has been passed down from our ancestors, generation to generation. That is why it is not easy for me, or for any of us, to surrender it. \"The truth is that we are exhausted. We are an oppressed people. October 7 was just one day, but for us, it has felt like living through hundreds of October 7th's, over and over again.\""
    },
    {
        "title": "Netanyahu is learning limits of what can be achieved by military power alone",
        "description": "It is hard to remember the Middle East before October 7 2023, so much has changed in the wake of its horrendous events.",
        "url": "https://news.sky.com/story/netanyahu-is-learning-the-limits-of-what-can-be-achieved-by-military-power-alone-13446244",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-benjamin-netanyahu_7021331.jpg?20250915131512",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-10-06 20:27:20",
        "Headline": "Conceived in the wake of one genocide, Israel is accused of perpetrating another, which has potentially grave repercussions for its future. And having invested more in military action than creative diplomacy, Benjamin Netanyahu's Israel is now increasingly isolated.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  It is hard to remember the Middle East before October 7 2023, so much has changed in the wake of its horrendous events. Before the attack, the region's geopolitical tectonic plates were grinding, but an uneasy status quo held sway and observed certain rules. Follow latest updates on the Israel-Hamas war But that day unleashed an earthquake, changing everything. In two years of turmoil since, the region's rulebook has been torn to pieces. The first rule: Israel would manage the threat from Hamas but not try to eradicate it. Israel's policy of dividing and ruling the Palestinians' rival factions had come back to bite them. Instead, Israelis insisted in one voice after October 7th, no more 'mowing the grass', their euphemism for cutting Hamas down to size, from time to time. This time, the job must be finished. That would change the way Israelis waged their war in Gaza. Not least in the way they would tolerate many more civilians dying, in the name of defeating their enemy. If the target's rank was high enough, the deaths of scores of civilians, women, and children would be acceptable. Watch The World: War in Gaza Special  The outcome has been an unprecedentedly high civilian death toll. Israel's war on Hamas has now killed more than 67,000 people in Gaza, most of them civilians, according to the Hamas-run health ministry, which does not differentiate between civilians or combatants. Its impact will be felt for generations to come, not least no doubt on the potential radicalisation of those who have survived. And it has seen Israel, a nation conceived in the wake of one genocide, accused of perpetrating another. That stain, justified or not, has implications for Israel's psyche and own sense of identity. And it has potentially grave repercussions for its future. Abroad, popular support for Israel has fallen most of all among the young and most of all where it needs it most: America. The rule that supporting Israel will always be a vote-winner in the US is also now in question. But the rules have changed Israel's borders and in the way it has chosen to wield its increasingly hegemonic military power even more dramatically. Read more from Sky News:Peace plan - what you need to knowTrump urges peace talks 'move fast' Israel's leaders found a new boldness in the wake of October 7, at the same time as technological and tactical advances gave them the tools to pursue it. The pager operation against Hezbollah that crippled the Shiite Lebanese militia was planned long before October 7. But it reached operational utility just as Israel found the risk appetite to implement it. It was decisive in the events that led to the assassination of Hezbollah leader Hassan Nasrallah. Since 2006 and Israel's last war with Hezbollah, the rule held that neither would risk provoking another. It would be too devastating for both. The pager attack disabled Hezbollah's ability to launch tens of thousands of missiles, after months of attritive attacks on them by Israel. For as long as Hezbollah held that arsenal of missiles, it was assumed Israel would not risk attacking Iran. With that neutralised, Israel could now take on its ultimate enemies there. The rules were rewritten in the skies over Iran and Israel in their first direct attacks on each other in April and October last year. Then, in June this year, Israel unleashed a devastating 12-day war on Iran, joined in its closing stages by US warplanes too. But after reaching that zenith in military supremacy, Israel has since overreached. A failed airstrike on Hamas leaders in Doha, Qatar, provoked the anger of allies, most crucially Donald Trump. In the prelude to this anniversary, Benjamin Netanyahu is learning the limits of what can be achieved by military power alone. Having invested more in military action than constructive diplomacy, Netanyahu's Israel is now increasingly isolated. Israel's leader finds himself hemmed in by a US president being leant on by Arab allies. Trump will not tolerate Israel annexing the West Bank and wants a deal that offers a \"credible pathway\" to a future Palestinian state. Netanyahu needs to show he can still bring the remaining hostages home, that fighting the war this long was justified, and he has a plan for what happens the day after. And if the war is being drawn to a close, with American mediation and the support of Arab partners and allies, they all have responsibilities too. To find a better new status quo with far better rules, to make sure the carnage and regionwide turmoil of the last two years can be brought to a close and never repeated."
    },
    {
        "title": "PM condemns 'un-British' plans for protests on anniversary of Hamas terror attack",
        "description": "Sir Keir Starmer has condemned plans for pro-Palestine protests two years to the day since the October 7 attacks on Israel, labelling them \"un-British\".",
        "url": "https://news.sky.com/story/pm-condemns-un-british-plans-for-protests-on-anniversary-of-hamas-terror-attack-13446240",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-palestine-protesters_7040785.jpg?20251004040817",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-06 20:02:55",
        "Headline": "UK political leaders have acknowledged rising antisemitism in the UK following the October 7 Hamas terrorist attack on Israel, which triggered the war in Gaza.",
        "Content": " Sir Keir Starmer has condemned plans for pro-Palestine protests two years to the day since the October 7 attacks on Israel, labelling them \"un-British\". Writing in The Times, the prime minister said demonstrations set to take place at several universities today showed a lack of respect for others, claiming previous rallies had been used by some as a \"despicable excuse to attack British Jews\". Follow latest updates on the Israel-Hamas war In a statement marking the second anniversary of the Hamas attack, when 1,200 people were killed and 251 others taken hostage, Sir Keir said the UK's Jewish communities had \"endured rising antisemitism\" since then - including last week's attack on a synagogue in Manchester, in which two worshippers were killed. Adrian Daulby, 53, and Melvin Cravitz, 66, died in the attack at Heaton Park synagogue in Crumpsall on Thursday. 'A stain on who we are' Mr Daulby, a member of the congregation, was shot accidentally when police fired on attacker Jihad al Shamie. The synagogue's rabbi told Sky News it happened as Mr Daulby \"was holding the doors to make sure everyone inside stayed safe\". The family of Mr Cravitz - a worshipper at the synagogue who police originally stated was a security guard - said he would \"do anything to help anyone\". Sir Keir described the attack as \"horrifying\", adding: \"This is a stain on who we are, and this country will always stand tall and united against those who wish harm and hatred upon Jewish communities.\"  Ministers had urged protesters to rethink attending a rally in support of the banned group Palestine Action over the weekend, given its proximity to the synagogue attack. It went ahead, and nearly 500 people were arrested. Police have since been given new powers to impose conditions upon repeat protests. 'A living nightmare' Of October 7, the prime minister said it was \"the worst attack on the Jewish people since the Holocaust\". \"The brutal, cold-blooded torture and murder of Jews in their own homes. \"And the taking of hostages, including British citizens, some of whom remain in Gaza today. \"Since that awful day, so many have endured a living nightmare. When I spoke with some of the families of the British hostages, I promised them in person that we will not cease in our efforts to bring their loved ones home.\"  PM welcomes Trump's peace efforts In his statement, Sir Keir also spoke about the government's priorities in the Middle East, which he said included releasing the hostages, getting more aid into Gaza, and a ceasefire \"that can lead to a lasting and just peace as a step towards a two-state solution\". The government last month recognised Palestine as a state to \"revive the hope of peace\". Read more: What recognising Palestine actually means He said he welcomed US efforts to mediate a deal between Israel and Hamas. Officials from both sides wrapped up initial talks at an Egyptian resort on Monday, regarding the terms proposed by Donald Trump last week. Mr Trump's 20-point peace plan includes the disarmament of Hamas, which would have no role in Gaza's future governance. The US president would lead an interim administration with the help of Sir Tony Blair, among others. He has demanded Israel stop bombing Gaza, though airstrikes have continued. Israel's war on Hamas has now killed more than 67,000 people in Gaza, most of them civilians, according to the Hamas-run health ministry, which does not differentiate between civilians or combatants.  Antisemitism 'a terrible scourge' Conservative leader Kemi Badenoch also criticised pro-Palestine protests in a statement marking the October 7 anniversary, claiming some \"turn into hate marches on our streets\". She said the government's decision to recognise a Palestinian state \"has rewarded the terrorists that perpetrated the October 7 atrocities\". \"Appeasement does not work,\" she said, adding: \"There are still 48 hostages held captive in Gaza. They must come home now.\" Liberal Democrat leader Sir Ed Davey described antisemitism as a \"terrible scourge\" and said: \"We stand in solidarity with British Jews, the people of Israel and Jewish communities around the world against terrorism, and against antisemitism in all its forms.\" Of the peace talks, he added: \"We desperately hope that they will finally see the hostages returned home to their families, a lasting bilateral ceasefire, Hamas out of power in Gaza for good - and set us on the path to a two-state solution that offers both Israelis and Palestinians the peace and security they deserve.\""
    },
    {
        "title": "46 people arrested as Met Police disrupts crime network suspected of smuggling up to 40,000 stolen phones to China",
        "description": "The Metropolitan Police have arrested 46 people after disrupting a criminal network suspected of smuggling up to 40,000 stolen phones from the UK to China. ",
        "url": "https://news.sky.com/story/46-people-arrested-as-met-police-disrupts-network-suspected-of-smuggling-up-to-40000-stolen-phones-to-china-13446094",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-met-police-crime-phone-thefts_6820504.png?20250205164504",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-06 14:19:01",
        "Headline": "The force's investigation began last year, when a box containing around 1,000 iPhones - almost all of which had been stolen - was found at a warehouse near Heathrow Airport.",
        "Content": " The Metropolitan Police have arrested 46 people after disrupting a criminal network suspected of smuggling up to 40,000 stolen phones from the UK to China.  A months-long investigation began last December when a box on its way to Hong Kong was found at a warehouse near Heathrow Airport containing around 1,000 iPhones. Officers discovered almost all of the phones had been stolen, the force said. It then launched Operation Echosteep, bringing in specialist detectives to track down the suspects. They intercepted further shipments and used forensics to identify two men in their 30s, who were arrested on suspicion of handling stolen goods on 23 September. They have since been charged and remanded in custody. A number of phones were found in the men's car and around 2,000 more devices were found at properties linked to them, the Met Police said. Detective Inspector Mark Gavin, the senior investigating officer for Operation Echosteep, said: \"This group specifically targeted Apple products because of their profitability overseas. \"We discovered street thieves were being paid up to £300 per handset and uncovered evidence of devices being sold for up to $5,000 (£3,700) in China.\" Police call on phone manufacturers to do more Commander Andrew Featherstone, the Met's lead for tackling phone theft, has described the operation as \"the largest crackdown on mobile phone theft and robbery in the UK\". He continued: \"We've shown how serious we are about tackling this issue, but we need more help from the industry. \"We're calling on phone manufacturers such as Apple and Samsung to do more to support us and protect their customers - especially around phone security and re-use.\" A total of 46 people have been arrested during two weeks of what the force has described as \"targeted and precise activity\". These include the arrests of 11 people during an operation targeting gangs robbing courier vans delivering the new iPhone 17 and the arrest of two men in their 30s - on suspicion of money laundering and handling stolen goods - after officers recovered almost £40,000 in cash at a phone shop in north London. Read more:Police launch vape-spiking crackdown'Kardashian of Cheshire' jailed Another man was charged with handling stolen goods after being stopped with 10 suspected stolen phones at Heathrow Airport on 20 September. Further enquiries revealed the man - who also had two iPads, two laptops and two Rolex watches - had travelled between London and Algeria more than 200 times in two years, the force said. London mayor Sadiq Khan said it is \"simply too easy and profitable\" for criminals \"making millions by repurposing stolen phones and selling them abroad\". \"I will continue to call on the mobile phone industry to go harder and faster in designing out this crime by making stolen devices unusable,\" he said. \"We need coordinated global action to shut down this trade and build a safer London for everyone.\""
    },
    {
        "title": "Renewable energy produces more electricity than coal for the first time, experts say",
        "description": "For the first time in history, renewable energy has produced more of the world's electricity than coal, according to a new analysis of global energy trends.",
        "url": "https://news.sky.com/story/renewable-energy-produces-more-electricity-than-coal-for-the-first-time-experts-say-13446220",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-solar-panel-roof-housebuilding_6929219.jpg?20250527223901",
        "type": "Home",
        "Author": "Tom Clarke",
        "Date Published": "2025-10-06 19:07:54",
        "Headline": "Solar and wind are now growing fast enough to not only meet the world's growing appetite for electricity, but to outstrip it.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n For the first time in history, renewable energy has produced more of the world's electricity than coal, according to a new analysis of global energy trends. In the first half of 2025, solar and wind energy outstripped growth in global electricity demand and led to a small but significant reduction in the use of fossil fuels compared to the year before, clean energy analysts Ember said. The finding coincides with the International Energy Agency (IEA) forecasting a doubling of global clean energy capacity by 2030. \"We are seeing the first signs of a crucial turning point,\" said Ember's electricity analyst, Malgorzata Wiatros-Motyka. Deployment of renewable generation, particularly in developing economies, has outpaced new fossil fuel power in recent years. 'The beginning of a shift' But many experts warned the increase would not be enough to meet rising global demand for electricity, let alone start to reduce emissions and therefore combat global warming. Ms Watros-Motyka said: \"Solar and wind are now growing fast enough to not only meet the world's growing appetite for electricity - this marks the beginning of a shift where clean power is keeping pace with demand growth.\" The IEA analysis of renewable energy trends predicts global renewable generation will increase by 4,600 gigawatts by 2030 - a growth equivalent, it says, to the current total power generation of China, the EU, and Japan combined. IEA executive director Fatih Birol said solar photovoltaic, or solar PV (the technology that converts sunlight into electricity using solar panels made up of photovoltaic cells), \"is on course to account for some 80% of the increase in the world's renewable capacity over the next five years\". \"In addition to growth in established markets, solar is set to surge in economies such as Saudi Arabia, Pakistan and several Southeast Asian countries,\" he added.  The trend is not even, however. Ember's analysis found renewable generation outstripped coal in both China and India in the first half of 2025, but in the US and Europe, the reverse was true. Rocketing electricity demand in the US, driven in large part by electricity for AI and datacentres, saw more reliance on coal and gas generation, despite an increase in renewable electricity capacity. In the EU, lower output from wind farms and hydroelectric plants led to a higher reliance on fossil fuels. The reports highlight the challenges of switching economies from fossil fuel-powered electricity grids to those dominated by renewables. They also don't rule out future shifts in fossil fuel emissions if demand accelerates or supply chains for renewables are constrained in some countries. The growth of offshore wind for example, is now forecast to slow due to policy changes in places like the US and materials costs in Europe, according to the IEA. Read more on Sky News:Alarm over Tory climate plansChanges to eco rules for new homesCan Arctic be refreezed?  However, the growth in green power also reflects potential opportunities missed by countries like the US, and right-wing politicians in Europe, who reject renewable electricity on ideological or cost grounds. In nearly all markets, the agency concludes, solar panels are the cheapest and easiest-to-install form of generation. US President Donald Trump, who recently told the United Nations climate change was the \"greatest con job\", might want to study the numbers, too. His administration has committed to increasing US oil and gas exports and abandoning support for renewable energy. According to a separate analysis by Ember, the US sold around $80bn (£59bn) in oil and gas in July, while China exported $120bn (£89bn)-worth of green technology in the same month."
    },
    {
        "title": "Government offers trainee teachers up to £31,000 tax-free incentives to boost recruitment",
        "description": "The government has announced new financial incentives worth up to &#163;31,000 tax-free for trainee teachers in maths, physics, chemistry and computing, in an effort to tackle long-standing recruitment challenges in England's schools.",
        "url": "https://news.sky.com/story/government-offers-trainee-teachers-up-to-16331000-tax-free-incentives-to-boost-recruitment-13446276",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/school-students-teachers_6967281.jpg?20250717190116",
        "type": "Home",
        "Author": "Anjum Peerbacos",
        "Date Published": "2025-10-06 22:07:13",
        "Headline": "The Department for Education wants to attract more people with science and engineering backgrounds into teaching, all while grappling with a major recruitment and retention challenge.",
        "Content": "\n          Education reporter\n       The government has announced new financial incentives worth up to £31,000 tax-free for trainee teachers in maths, physics, chemistry and computing, in an effort to tackle long-standing recruitment challenges in England's schools. From next year, bursaries and scholarships will be available to those training through both school-based and university routes, with the Department for Education hoping to attract more people with science and engineering backgrounds into the classroom. Trainees in further education will also be eligible for up to £31,000 in shortage subjects, £10,000 for English, and £15,000 for those training to work with children who have special educational needs and disabilities (SEND). For the first time, Postgraduate Teaching Apprenticeships will receive the same level of funding as other training routes, with schools able to claim up to £29,000 to train apprentices in maths, chemistry, physics, and computing. These subjects have faced persistent teacher shortages in recent years. Recruitment data shows the Department for Education filled just 62% of its target for secondary trainees last year, though projections from the National Foundation for Educational Research (NFER) suggest this could rise to 85% for 2025/26. Jack Worth, education workforce Lead at NFER, said bursaries play a crucial role in boosting recruitment. \"Our research has shown bursaries are very effective for recruiting more teachers and retaining additional teachers long-term, particularly in shortage subjects such as physics and maths,\" he said. \"This announcement could go a long way towards helping the government meet its pledge to recruit and retain 6,500 additional teachers.\"  Teaching is 'highly stressful' But while the new incentives may bring more trainees into the profession, teachers say retention remains the real challenge. Amanda, a science coordinator at a secondary school in north London, told Sky News: \"The tax-free incentive is certainly a massive pull factor to attract teacher trainees with science or engineering backgrounds, but to keep them, that's a very different story. \"Although we have many teacher training routes to cater for different preferences, that doesn't change the fact that teaching is a highly stressful vocation. \"And expectations have increased massively over the last ten years; many social and economic issues have fallen on teachers' shoulders. \"Of course we should care about children's wellbeing, but the government needs to acknowledge that our roles have become much more demanding without the equivalent investment.\" Amanda added: \"Workload and working hours have consistently been a major issue, and with less funding and rising costs, it's becoming harder for schools to retain teachers, especially those from science or engineering backgrounds.\" Read more from Sky News:PM condemns 'un-British' protest plansWorld hits 'crucial turning point' in renewables use The Institute of Physics has warned that one in four secondary schools still has no specialist physics teacher, underlining the scale of the problem. The Department for Education says there's progress and has reported a 33% rise in people training to teach physics and a 42% increase in computing trainees this year. Yet, as teachers like Amanda point out, financial incentives may help bring people in, but culture, workload, and pay are what will keep them there. Education Secretary Bridget Phillipson said the government is \"determined to bring more brilliant teachers into classrooms\". She said: \"We need talented people with the passion and drive to inspire the next generation, making school a place pupils want to be, boosting outcomes and transforming lives. \"Inspirational teachers changed my life and change the lives of millions of children every day. \"This government is determined to have more brilliant teachers, in more schools, improving the life chances of more young people.\""
    },
    {
        "title": "Bitcoin's price is at record highs. Is it sustainable?",
        "description": "Bitcoin is trading at all-time highs, surging beyond &#163;93,000 for the first time.",
        "url": "https://news.sky.com/story/bitcoins-price-is-at-record-highs-is-it-sustainable-13446153",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-bitcoin-file_7044296.jpg?20251006172428",
        "type": "Home",
        "Author": "Connor Sephton",
        "Date Published": "2025-10-06 16:29:52",
        "Headline": "While some argue Bitcoin remains cheap at £93,000, critics argue it's a house of cards that'll come crashing down. Sky News speaks to those on both sides of the debate.",
        "Content": "\n          News reporter\n              @ConnorSephton\n Bitcoin is trading at all-time highs, surging beyond £93,000 for the first time. The world's biggest cryptocurrency has doubled in value over the past 12 months - buoyed by Donald Trump's return to the White House. However, its 10% surge over the past week is down to one specific factor: the US government shutdown.  Experts have told Sky News that the drama unfolding in Washington is undermining trust in the dollar - and pushing investors to alternatives. Bitwise senior associate Max Shannon said stubbornly high inflation, which erodes spending power, is another factor. Some countries are also increasing their monetary supply - watering down the value of cash in circulation - with government borrowing on the rise. That's led to what's known as a \"debasement trade\", where investors pile their cash into so-called \"hard\" assets like Bitcoin and gold instead. Bitcoin has a fixed supply, meaning no more than 21 million will ever exist. Almost 95% of them are already in circulation, with a small number of coins entering the market every day. Enthusiasts argue this creates a form of scarcity that pushes prices up, as demand for BTC is considerably higher than supply. The latest figures from the Financial Conduct Authority suggest about seven million people in the UK have invested in cryptocurrencies. A single coin can be broken up into 100 million pieces, meaning many have a tiny chunk of Bitcoin in their portfolios. But much of the current enthusiasm for Bitcoin isn't coming from everyday investors - instead, it's institutions leading the charge. Deep-pocketed companies and individuals are buying into exchange-traded funds (ETFs) on Wall Street that track Bitcoin's value - allowing them to gain indirect exposure to BTC's price rises without owning it directly. A staggering $3.5bn (£2.6bn) flowed into these products last week. Samson Mow is the chief executive of JAN3, a company that promotes Bitcoin adoption. He played a role in El Salvador becoming the first country in the world to adopt this cryptocurrency as legal tender. While that experiment didn't achieve widespread success, the Central American nation continues to invest in BTC - with estimated profits of more than £350m as a result. When asked why Bitcoin has hit all-time highs, Mow told Sky News: \"Bitcoin has been a ball pushed underwater for months - this move up was inevitable. Raw demand has simply caught up with the incredibly limited supply.\" He pointed to how 6.7% of Bitcoin's supply is now tied up in ETFs - with Strategy, a company that has the goal of accruing as much BTC as possible, owning a further 3%. This means there's less to go around overall, in what Mow describes as \"the beginning of a massive supply shock\". The entrepreneur believes a single Bitcoin will one day be worth $500,000 (£371,000), meaning the cryptocurrency's total market capitalisation would surge to $10trn (£7.4trn). That's more than double what Nvidia's currently worth as the world's most valuable company, and would make BTC the second-largest asset after gold. Mow shrugged off any suggestion Bitcoin's dramatic price rises aren't sustainable - and insists the only thing that's \"definitely not sustainable\" is BTC's value remaining as low as it is. \"There are only 21 million BTC. Most corporations, billionaires, and even millionaires still have no exposure to Bitcoin. Nation-states have yet to seriously begin accumulation too, but many that we're engaged with are very interested and are looking to move quickly,\" he said. Of course, not everyone shares his enthusiasm. Critics argue Bitcoin lacks intrinsic value, with some claiming it's \"worse than a Ponzi scheme\". David Gerard, a journalist who's deeply sceptical of the crypto industry, told Sky News that Bitcoin suffers from thin trading volumes - resulting in \"unfeasibly volatile prices\" and an \"easily manipulated market\". \"Bitcoin trading is overwhelmingly in unregulated offshore exchanges, so Bitcoin is not a well-functioning market in the sense of, say, stocks,\" he said. \"If investors treat Bitcoin as a well-regulated market, they will get burned. ETFs are regulated instruments, the way Bitcoin's price is set is not.\" Read more from Sky News:Reform UK to accept crypto donationsThe pros and cons of digital IDs  Gerard has railed against BTC for years, and wrote a book condemning the sector in July 2017. But in the eight years since it was published, Bitcoin's price has risen by more than 5,200%. Has this changed his views? \"Everything that's structurally wrong with Bitcoin is still wrong with Bitcoin,\" he said. \"Anyone who sees the big number and thinks 'time to get in' is the sucker the big boys are making their money from. \"You can definitely make money in Bitcoin! But statistically, you're much more likely to be the sucker.\" Some banks, including Morgan Stanley, now encourage their clients to allocate 2% to 4% of their portfolios into crypto - but doing so when prices are so high is risky. While it's possible Bitcoin could keep on rising, this is an asset also known for punishing pullbacks that have seen investors, including people right here in the UK, lose a lot of money. This tends to happen every four years. BTC surged to a record price of $20,000 in December 2017, but plunged by more than 80% a year later - falling below $4,000. Another all-time high of $69,000 then followed in November 2021 - but 12 months on, a spectacular crash dragged it back down to $17,000, a 75% drop. Four years on in October 2025, here we are again: BTC has never been higher. History doesn't always repeat itself - but if past performance is a guide, 2026 could prove challenging."
    },
    {
        "title": "Manchester synagogue attacker Jihad al Shamie 'shared ISIS videos, ranted and asked for large sums of money', his friends say",
        "description": "The synagogue killer, Jihad al Shamie, radicalised himself after searching online for videos of the Islamic State terror group, according to a friend.&#160;",
        "url": "https://news.sky.com/story/manchester-synagogue-attacker-jihad-al-shamie-shared-isis-videos-ranted-and-asked-for-large-sums-of-money-his-friends-say-13446162",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-jihad-al-shamie-manchester_7039830.png?20251003094632",
        "type": "Home",
        "Author": "Martin Brunt",
        "Date Published": "2025-10-06 16:47:59",
        "Headline": "The terrorist's behaviour became unpredictable, friends say, including watching Islamic State videos, asking for money and sudden bursts of temper.",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n The synagogue killer, Jihad al Shamie, radicalised himself after searching online for videos of the Islamic State terror group, according to a friend.  The man, Qas, said al Shamie \"started using [encrypted messaging app] Telegram and searching for ISIS videos. \"Once, he even tried to show me one at the shisha lounge. I told him to go away and asked how he even got access to that content, and he said it was through Telegram. After that, I didn't see him for a long time until I heard what had happened.\"  Another friend, Asim, told Sky News he met al Shamie through their shared interest in computers. He said he noticed a difference in al Shamie a year ago. Asim said al Shamie \"changed a bit, I felt his thoughts were a bit too radical for me. He was a nice guy, very quiet and softly-spoken. I was shocked about what he did. \"He started asking me for money - not small amounts, but thousands,\" Asim explained. \"When I refused, he became angry. I'd never seen that side of him before.\" Earlier this year, al Shamie was working as a call handler for the RAC motoring organisation. He was employed through an agency as a part-time temp from December to the end of March, when he was no longer needed. Last year, al Shamie had money problems and was subject to a government debt relief order, which meant that his debts would be paid off in a year if he agreed to certain restrictions. Money appeared to be one of many problems. A former friend of al Shamie described how he became increasingly withdrawn and \"in his own world\" after a steroid addiction had led to heavier drug use. They said his behaviour became strange and unpredictable. \"I once noticed on his phone that he had several notifications from dating apps, which confused me because I knew he was married,\" the friend said. \"You could be having a normal conversation with him, and suddenly he would flip and start ranting. I eventually blocked him.\"  Multiple marriages and 'obsessed' with dating app It's believed the terrorist married several wives in Islamic wedding ceremonies, one of them even before he split up from the mother of his young child. He reportedly became obsessed with an Islamic dating app, and sent abusive messages to an ex-girlfriend, hit her and told her to dress more conservatively during their brief on-off relationship. The woman, who was 18 at the time, told the Manchester Evening News: \"He used to say 'I want you to be dedicated to the cause', and he used to sit there and make me watch videos, like extreme videos, that I had no interest in. \"I am Muslim and of course I love to learn more, but this stuff were things that I have been raised to not agree with. He used to always say I was taught the wrong way and I wasn't taught right. He was basically just trying to groom me into what he thought.\" She said he would message girls on his Muzmatch - now Muzz - dating app, using false names such as Valentino and Ahmed. \"He kept getting banned because of his speech and what he was sending,\" she said. \"There were times when he would send me videos of him with other girls, and the girls were quite young.\" 'Rape fantasies' The woman said al Shamie told her he had \"rape fantasies\", and that he \"used to say weird stuff, it was just insane. I can't believe I stayed as long as I did\". His marriage collapsed after he secretly wed an NHS nurse, a widow, who had converted to Islam. A neighbour, Geoff Halliwell, who cleaned the family's windows for many years at their home in Prestwich, told Sky News al Shamie had lived there with his wife and young child, but he believed left six months earlier. Mr Halliwell said: \"There was the mother and three lads, but one moved away. We're talking about the eldest, he had a wife and kid, but she moved out some time ago. \"There was no sign of radicalisation, nothing like that. We never talked politics. Just 'good morning, how are you? Lovely day, isn't it?' \"He was fine, the whole thing has come out of the blue. He was a smashing lad to talk to, so were the other two lads.\" Mr Halliwell said the father left the family home about 10 years ago, but sometimes visited. Read more:Families pay tribute to 'kind and heroic' victimsPolice given extra time to question four arrestedSynagogue security guard 'feared they would die' He thought he had moved to France because sometimes he turned up in a French-registered car. Faraj al Shamie, a trauma surgeon who has worked for the International Committee of the Red Cross in Africa, condemned his son's attack on the synagogue. He said in a statement: \"The al Shamie family in the UK and abroad strongly condemns this heinous act, which targeted peaceful, innocent civilians. We fully distance ourselves from this attack and express our deep shock and sorrow over what has happened.\" But, two years ago, on 7 October, he praised the actions of Hamas terrorists for their attack on Israel in which 1,200 were killed and 251 taken back to Gaza as hostages. Al Shamie wrote on Facebook: \"The scenes broadcast by the Al-Aqsa Martyrs Brigades of a group of fighters storming an Israeli army camp using simple means, namely balloons and motorcycles, prove beyond a shadow of a doubt that Israel will not remain.\" Additional reporting by Shakir Ahmed, specialist producer and Rebecca Spencer, crime producer"
    },
    {
        "title": "Security guard reveals new details of Manchester synagogue attack",
        "description": "A security guard who helped barricade the doors during the Manchester synagogue attack has told Sky News he thought \"we are all going to die\" - as he watched two of his friends get struck by what's believed to be a police bullet.&#160;",
        "url": "https://news.sky.com/story/security-guard-reveals-new-details-of-manchester-synagogue-attack-13445873",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-scene-believed-manchester_7039004.jpg?20251006121140",
        "type": "Home",
        "Author": "Katie Barnfield",
        "Date Published": "2025-10-06 09:41:22",
        "Headline": "Ivor Rosenberg was working as a volunteer security guard on the morning Jihad al Shamie, 35, launched his attack on the Heaton Park Hebrew Congregation Synagogue in Crumpsall.",
        "Content": "\n          North of England correspondent\n        A security guard who helped barricade the doors during the Manchester synagogue attack has told Sky News he thought \"we are all going to die\" - as he watched two of his friends get struck by what's believed to be a police bullet.  Ivor Rosenberg was a working volunteer security guard on the morning Jihad al Shamie, 35, launched his attack on the Heaton Park Hebrew Congregation Synagogue in Crumpsall. He described first confronting al Shamie outside the synagogue some minutes earlier, thinking \"he's up to no good\" - after he told different people conflicting stories about how he was looking for his car and a pub. \"He looked at me and said 'what are you looking at?',\" Mr Rosenberg told Sky News. \"I just said, 'I don't know'... he said 'you're very brave inside the fence'... and he walked away.\" Mr Rosenberg said he started walking back up the stairs towards the synagogue when he heard \"an almighty bang\". \"I turned around and I saw the car smashed into the wall of the gate,\" he said. He described Alan Levy, the synagogue chairman, managing to lock the main door as he ran straight to the office and dialled 999. \"I was screaming at them - 'we're under attack, we're under attack!',\" he said. \"I could hear him banging on the doors, trying to get in - threatening to kill everyone.\"  Mr Rosenberg said he looked out of the window and saw al Shamie banging on the synagogue door with a \"large knife\". \"I was terrified,\" he said. After running to get chairs to put up against the synagogue door, he described holding the doors shut with a group of nine or 10 others from the synagogue. It was then that he saw a bullet come through the door - hitting two of his friends. After the police initially opened fire on al Shamie, Mr Rosenberg said he saw him trying to get up. \"I screamed - he's getting up again,\" he said. \"I stood back and we could hear a shot. \"Yoni - who was standing just a couple of feet away from me - dropped down to the ground.\"  Yoni Finlay is currently recovering in hospital. He is one of two men that Greater Manchester Police believe they accidentally struck with gunfire while trying to shoot al Shamie. The other is Adrian Daulby, 53, who died from his injuries. Melvin Cravitz, 66, who was among those who helped to prevent al Shamie from entering the synagogue, also died. Mr Rosenberg described seeing a \"bullet hole\" in the door - and believes the same bullet hit both Mr Finlay and Mr Daulby, who was also behind the door with him at the time. He said at first he believed Mr Finlay, a friend of his for many years, was intentionally ducking to avoid the gunfire. He then quickly realised he had been injured. \"He said 'I've been hit'. I think the bullet came through him and hit Mr Daulby. I thought 'we're all going to die' for a minute. It was terrifying,\" Mr Rosenberg said. \"I took my jacket off and cradled Yoni's head. It was very, very scary.\" Mr Rosenberg said both of the men were \"heroes\" - and has had updates that Mr Finlay is continuing to recover in hospital.  Two other men also remain in hospital with serious injuries - a security guard with car-impact injuries and a community worker with stab wounds. Mr Rosenberg said that he is still struggling to come to terms with what happened that day. \"I'm okay until someone asks me how I'm doing - then it's hard,\" he said. This afternoon, Mr Rosenberg was one of the guests at Adrian Daulby's funeral. Attending with him was Laurence Abramson - the oldest living member of Heaton Park Synagogue. Mr Abramson was heading into the synagogue for prayers as al Shamie launched his attack, and watched it unfold from outside. He recalls the police opening fire on al Shamie, as they tried to stop him from getting inside. \"I was just approaching the synagogue, crossing the road - and I heard 'bang, bang, bang',\" Mr Abramson said. \"The gunshot sounds have been with me all the time. I sleep and I can hear them.\" Now 86-years-old, he told us he has been a member of the Heaton Park Synagogue for 80 years. \"My father was a founding member of that shul,\" he said. \"I had my Bar Mitzvah there, I got married there. It means too much to me.\" Remembering Mr Daulby, Mr Rosenberg said: \"He was the nicest, quietest man you could ever meet.\" He said the members of the synagogue are struggling to come to terms with the loss. \"Life goes on - but we'll get through it. It will be hard, but we'll do it,\" he said. Read more:Families pay tribute to 'kind and heroic' victimsPolice given extra time to question four arrested Al Shamie was shot dead by police. Four people arrested on suspicion of preparing terrorist acts remain in custody after police were granted a further five days to question them on Saturday."
    },
    {
        "title": "Half of Tory members do not want Kemi Badenoch to lead party into next election, says poll",
        "description": "Half of all Conservative members think Kemi Badenoch should not lead the party into the next election, according to an exclusive Sky News Tory members poll.",
        "url": "https://news.sky.com/story/half-of-tory-members-do-not-want-kemi-badenoch-to-lead-party-into-next-election-says-poll-13446008",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-kemi-badenoch-conservatives_6980470.jpg?20250802075030",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2025-10-06 11:41:52",
        "Headline": "Having lost to Ms Badenoch a year ago, Robert Jenrick is now comfortably the members' favourite.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Half of all Conservative members think Kemi Badenoch should not lead the party into the next election, according to an exclusive Sky News Tory members poll. The YouGov poll found 46% think the current Tory leader should stay in place when the country next goes to the polls, while 50% say she should not. Tory members are split as to whether she will make it that far. A total of 49% think she will be out before the election, compared with 47% who think she'll still be in place. Politics latest: Tories pledge to abolish business rates for high street shops and pubs The Tory leader will hope that this week's conference in Manchester will steady her leadership. But asked who they would prefer as leader of the Conservative Party, 46% of Tory members picked Robert Jenrick, comfortably ahead of the 39% who said Ms Badenoch. In all, 11% said neither and 4% don't know. The poll of 652 Conservative members was taken between 26 September and 2 October. \n                  Brutal findings of new poll in line with views of gloomy Tory MPs\n                 \n                  Robert Jenrick announces plans to abolish Sentencing Council amid 'two-tier justice' row\n                 \n                  Tories to scrap business rates on high street pubs and shops\n                 Having lost to Ms Badenoch a year ago, Mr Jenrick is now comfortably the members' favourite, and would beat Boris Johnson, James Cleverly and Priti Patel. Badenoch would narrowly beat Johnson if they went head to head. The poll also asked whether members had a favourable or unfavourable opinion of leaders. It showed 70% had a favourable opinion of Badenoch and 29% holding an unfavourable view. While 73% had a favourable opinion of Jenrick and 20% had an unfavourable opinion. Read more:Brutal findings of new poll in line with views of gloomy Tory MPsBadenoch praises Thatcher but faces fight with grandeesActive plot against Kemi Badenoch at party conference Ms Badenoch rejects any kind of electoral pact with Reform UK at the next election, but this is out of step with Tory members. The poll finds 64% support an electoral pact, meaning Reform and the Tories would not stand candidates against each other in target seats, while 31% do not. Almost half of Tory members - 46% - would support a full blown merger with Reform UK, against 48% who would oppose a merger. Party members are very clear that in a hung parliament, they would not want to see Tory MPs putting a Labour prime minister back in Number 10. Tory members oppose a coalition with Labour by 93% to 6%. However 73% would welcome a coalition with Reform UK in a hung parliament, with 25% against."
    },
    {
        "title": "46 people arrested as Met Police disrupts crime network suspected of smuggling up to 40,000 stolen phones to China",
        "description": "The Metropolitan Police have arrested 46 people after disrupting a criminal network suspected of smuggling up to 40,000 stolen phones from the UK to China. ",
        "url": "https://news.sky.com/story/46-people-arrested-as-met-police-disrupts-network-suspected-of-smuggling-up-to-40000-stolen-phones-to-china-13446094",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-met-police-crime-phone-thefts_6820504.png?20250205164504",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-06 14:19:01",
        "Headline": "The force's investigation began last year, when a box containing around 1,000 iPhones - almost all of which had been stolen - was found at a warehouse near Heathrow Airport.",
        "Content": " The Metropolitan Police have arrested 46 people after disrupting a criminal network suspected of smuggling up to 40,000 stolen phones from the UK to China.  A months-long investigation began last December when a box on its way to Hong Kong was found at a warehouse near Heathrow Airport containing around 1,000 iPhones. Officers discovered almost all of the phones had been stolen, the force said. It then launched Operation Echosteep, bringing in specialist detectives to track down the suspects. They intercepted further shipments and used forensics to identify two men in their 30s, who were arrested on suspicion of handling stolen goods on 23 September. They have since been charged and remanded in custody. A number of phones were found in the men's car and around 2,000 more devices were found at properties linked to them, the Met Police said. Detective Inspector Mark Gavin, the senior investigating officer for Operation Echosteep, said: \"This group specifically targeted Apple products because of their profitability overseas. \"We discovered street thieves were being paid up to £300 per handset and uncovered evidence of devices being sold for up to $5,000 (£3,700) in China.\" Police call on phone manufacturers to do more Commander Andrew Featherstone, the Met's lead for tackling phone theft, has described the operation as \"the largest crackdown on mobile phone theft and robbery in the UK\". He continued: \"We've shown how serious we are about tackling this issue, but we need more help from the industry. \"We're calling on phone manufacturers such as Apple and Samsung to do more to support us and protect their customers - especially around phone security and re-use.\" A total of 46 people have been arrested during two weeks of what the force has described as \"targeted and precise activity\". These include the arrests of 11 people during an operation targeting gangs robbing courier vans delivering the new iPhone 17 and the arrest of two men in their 30s - on suspicion of money laundering and handling stolen goods - after officers recovered almost £40,000 in cash at a phone shop in north London. Read more:Police launch vape-spiking crackdown'Kardashian of Cheshire' jailed Another man was charged with handling stolen goods after being stopped with 10 suspected stolen phones at Heathrow Airport on 20 September. Further enquiries revealed the man - who also had two iPads, two laptops and two Rolex watches - had travelled between London and Algeria more than 200 times in two years, the force said. London mayor Sadiq Khan said it is \"simply too easy and profitable\" for criminals \"making millions by repurposing stolen phones and selling them abroad\". \"I will continue to call on the mobile phone industry to go harder and faster in designing out this crime by making stolen devices unusable,\" he said. \"We need coordinated global action to shut down this trade and build a safer London for everyone.\""
    },
    {
        "title": "PM condemns 'un-British' plans for protests on anniversary of Hamas terror attack",
        "description": "Sir Keir Starmer has condemned plans for pro-Palestine protests two years to the day since the October 7 attacks on Israel, labelling them \"un-British\".",
        "url": "https://news.sky.com/story/pm-condemns-un-british-plans-for-protests-on-anniversary-of-hamas-terror-attack-13446240",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-palestine-protesters_7040785.jpg?20251004040817",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-06 20:02:55",
        "Headline": "UK political leaders have acknowledged rising antisemitism in the UK following the October 7 Hamas terrorist attack on Israel, which triggered the war in Gaza.",
        "Content": " Sir Keir Starmer has condemned plans for pro-Palestine protests two years to the day since the October 7 attacks on Israel, labelling them \"un-British\". Writing in The Times, the prime minister said demonstrations set to take place at several universities today showed a lack of respect for others, claiming previous rallies had been used by some as a \"despicable excuse to attack British Jews\". Follow latest updates on the Israel-Hamas war In a statement marking the second anniversary of the Hamas attack, when 1,200 people were killed and 251 others taken hostage, Sir Keir said the UK's Jewish communities had \"endured rising antisemitism\" since then - including last week's attack on a synagogue in Manchester, in which two worshippers were killed. Adrian Daulby, 53, and Melvin Cravitz, 66, died in the attack at Heaton Park synagogue in Crumpsall on Thursday. 'A stain on who we are' Mr Daulby, a member of the congregation, was shot accidentally when police fired on attacker Jihad al Shamie. The synagogue's rabbi told Sky News it happened as Mr Daulby \"was holding the doors to make sure everyone inside stayed safe\". The family of Mr Cravitz - a worshipper at the synagogue who police originally stated was a security guard - said he would \"do anything to help anyone\". Sir Keir described the attack as \"horrifying\", adding: \"This is a stain on who we are, and this country will always stand tall and united against those who wish harm and hatred upon Jewish communities.\"  Ministers had urged protesters to rethink attending a rally in support of the banned group Palestine Action over the weekend, given its proximity to the synagogue attack. It went ahead, and nearly 500 people were arrested. Police have since been given new powers to impose conditions upon repeat protests. 'A living nightmare' Of October 7, the prime minister said it was \"the worst attack on the Jewish people since the Holocaust\". \"The brutal, cold-blooded torture and murder of Jews in their own homes. \"And the taking of hostages, including British citizens, some of whom remain in Gaza today. \"Since that awful day, so many have endured a living nightmare. When I spoke with some of the families of the British hostages, I promised them in person that we will not cease in our efforts to bring their loved ones home.\"  PM welcomes Trump's peace efforts In his statement, Sir Keir also spoke about the government's priorities in the Middle East, which he said included releasing the hostages, getting more aid into Gaza, and a ceasefire \"that can lead to a lasting and just peace as a step towards a two-state solution\". The government last month recognised Palestine as a state to \"revive the hope of peace\". Read more: What recognising Palestine actually means He said he welcomed US efforts to mediate a deal between Israel and Hamas. Officials from both sides wrapped up initial talks at an Egyptian resort on Monday, regarding the terms proposed by Donald Trump last week. Mr Trump's 20-point peace plan includes the disarmament of Hamas, which would have no role in Gaza's future governance. The US president would lead an interim administration with the help of Sir Tony Blair, among others. He has demanded Israel stop bombing Gaza, though airstrikes have continued. Israel's war on Hamas has now killed more than 67,000 people in Gaza, most of them civilians, according to the Hamas-run health ministry, which does not differentiate between civilians or combatants.  Antisemitism 'a terrible scourge' Conservative leader Kemi Badenoch also criticised pro-Palestine protests in a statement marking the October 7 anniversary, claiming some \"turn into hate marches on our streets\". She said the government's decision to recognise a Palestinian state \"has rewarded the terrorists that perpetrated the October 7 atrocities\". \"Appeasement does not work,\" she said, adding: \"There are still 48 hostages held captive in Gaza. They must come home now.\" Liberal Democrat leader Sir Ed Davey described antisemitism as a \"terrible scourge\" and said: \"We stand in solidarity with British Jews, the people of Israel and Jewish communities around the world against terrorism, and against antisemitism in all its forms.\" Of the peace talks, he added: \"We desperately hope that they will finally see the hostages returned home to their families, a lasting bilateral ceasefire, Hamas out of power in Gaza for good - and set us on the path to a two-state solution that offers both Israelis and Palestinians the peace and security they deserve.\""
    },
    {
        "title": "Government offers trainee teachers up to £31,000 tax-free incentives to boost recruitment",
        "description": "The government has announced new financial incentives worth up to &#163;31,000 tax-free for trainee teachers in maths, physics, chemistry and computing, in an effort to tackle long-standing recruitment challenges in England's schools.",
        "url": "https://news.sky.com/story/government-offers-trainee-teachers-up-to-16331000-tax-free-incentives-to-boost-recruitment-13446276",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/school-students-teachers_6967281.jpg?20250717190116",
        "type": "UK",
        "Author": "Anjum Peerbacos",
        "Date Published": "2025-10-06 22:07:13",
        "Headline": "The Department for Education wants to attract more people with science and engineering backgrounds into teaching, all while grappling with a major recruitment and retention challenge.",
        "Content": "\n          Education reporter\n       The government has announced new financial incentives worth up to £31,000 tax-free for trainee teachers in maths, physics, chemistry and computing, in an effort to tackle long-standing recruitment challenges in England's schools. From next year, bursaries and scholarships will be available to those training through both school-based and university routes, with the Department for Education hoping to attract more people with science and engineering backgrounds into the classroom. Trainees in further education will also be eligible for up to £31,000 in shortage subjects, £10,000 for English, and £15,000 for those training to work with children who have special educational needs and disabilities (SEND). For the first time, Postgraduate Teaching Apprenticeships will receive the same level of funding as other training routes, with schools able to claim up to £29,000 to train apprentices in maths, chemistry, physics, and computing. These subjects have faced persistent teacher shortages in recent years. Recruitment data shows the Department for Education filled just 62% of its target for secondary trainees last year, though projections from the National Foundation for Educational Research (NFER) suggest this could rise to 85% for 2025/26. Jack Worth, education workforce Lead at NFER, said bursaries play a crucial role in boosting recruitment. \"Our research has shown bursaries are very effective for recruiting more teachers and retaining additional teachers long-term, particularly in shortage subjects such as physics and maths,\" he said. \"This announcement could go a long way towards helping the government meet its pledge to recruit and retain 6,500 additional teachers.\"  Teaching is 'highly stressful' But while the new incentives may bring more trainees into the profession, teachers say retention remains the real challenge. Amanda, a science coordinator at a secondary school in north London, told Sky News: \"The tax-free incentive is certainly a massive pull factor to attract teacher trainees with science or engineering backgrounds, but to keep them, that's a very different story. \"Although we have many teacher training routes to cater for different preferences, that doesn't change the fact that teaching is a highly stressful vocation. \"And expectations have increased massively over the last ten years; many social and economic issues have fallen on teachers' shoulders. \"Of course we should care about children's wellbeing, but the government needs to acknowledge that our roles have become much more demanding without the equivalent investment.\" Amanda added: \"Workload and working hours have consistently been a major issue, and with less funding and rising costs, it's becoming harder for schools to retain teachers, especially those from science or engineering backgrounds.\" Read more from Sky News:PM condemns 'un-British' protest plansWorld hits 'crucial turning point' in renewables use The Institute of Physics has warned that one in four secondary schools still has no specialist physics teacher, underlining the scale of the problem. The Department for Education says there's progress and has reported a 33% rise in people training to teach physics and a 42% increase in computing trainees this year. Yet, as teachers like Amanda point out, financial incentives may help bring people in, but culture, workload, and pay are what will keep them there. Education Secretary Bridget Phillipson said the government is \"determined to bring more brilliant teachers into classrooms\". She said: \"We need talented people with the passion and drive to inspire the next generation, making school a place pupils want to be, boosting outcomes and transforming lives. \"Inspirational teachers changed my life and change the lives of millions of children every day. \"This government is determined to have more brilliant teachers, in more schools, improving the life chances of more young people.\""
    },
    {
        "title": "Manchester synagogue attacker Jihad al Shamie 'shared ISIS videos, ranted and asked for large sums of money', his friends say",
        "description": "The synagogue killer, Jihad al Shamie, radicalised himself after searching online for videos of the Islamic State terror group, according to a friend.&#160;",
        "url": "https://news.sky.com/story/manchester-synagogue-attacker-jihad-al-shamie-shared-isis-videos-ranted-and-asked-for-large-sums-of-money-his-friends-say-13446162",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-jihad-al-shamie-manchester_7039830.png?20251003094632",
        "type": "UK",
        "Author": "Martin Brunt",
        "Date Published": "2025-10-06 16:47:59",
        "Headline": "The terrorist's behaviour became unpredictable, friends say, including watching Islamic State videos, asking for money and sudden bursts of temper.",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n The synagogue killer, Jihad al Shamie, radicalised himself after searching online for videos of the Islamic State terror group, according to a friend.  The man, Qas, said al Shamie \"started using [encrypted messaging app] Telegram and searching for ISIS videos. \"Once, he even tried to show me one at the shisha lounge. I told him to go away and asked how he even got access to that content, and he said it was through Telegram. After that, I didn't see him for a long time until I heard what had happened.\"  Another friend, Asim, told Sky News he met al Shamie through their shared interest in computers. He said he noticed a difference in al Shamie a year ago. Asim said al Shamie \"changed a bit, I felt his thoughts were a bit too radical for me. He was a nice guy, very quiet and softly-spoken. I was shocked about what he did. \"He started asking me for money - not small amounts, but thousands,\" Asim explained. \"When I refused, he became angry. I'd never seen that side of him before.\" Earlier this year, al Shamie was working as a call handler for the RAC motoring organisation. He was employed through an agency as a part-time temp from December to the end of March, when he was no longer needed. Last year, al Shamie had money problems and was subject to a government debt relief order, which meant that his debts would be paid off in a year if he agreed to certain restrictions. Money appeared to be one of many problems. A former friend of al Shamie described how he became increasingly withdrawn and \"in his own world\" after a steroid addiction had led to heavier drug use. They said his behaviour became strange and unpredictable. \"I once noticed on his phone that he had several notifications from dating apps, which confused me because I knew he was married,\" the friend said. \"You could be having a normal conversation with him, and suddenly he would flip and start ranting. I eventually blocked him.\"  Multiple marriages and 'obsessed' with dating app It's believed the terrorist married several wives in Islamic wedding ceremonies, one of them even before he split up from the mother of his young child. He reportedly became obsessed with an Islamic dating app, and sent abusive messages to an ex-girlfriend, hit her and told her to dress more conservatively during their brief on-off relationship. The woman, who was 18 at the time, told the Manchester Evening News: \"He used to say 'I want you to be dedicated to the cause', and he used to sit there and make me watch videos, like extreme videos, that I had no interest in. \"I am Muslim and of course I love to learn more, but this stuff were things that I have been raised to not agree with. He used to always say I was taught the wrong way and I wasn't taught right. He was basically just trying to groom me into what he thought.\" She said he would message girls on his Muzmatch - now Muzz - dating app, using false names such as Valentino and Ahmed. \"He kept getting banned because of his speech and what he was sending,\" she said. \"There were times when he would send me videos of him with other girls, and the girls were quite young.\" 'Rape fantasies' The woman said al Shamie told her he had \"rape fantasies\", and that he \"used to say weird stuff, it was just insane. I can't believe I stayed as long as I did\". His marriage collapsed after he secretly wed an NHS nurse, a widow, who had converted to Islam. A neighbour, Geoff Halliwell, who cleaned the family's windows for many years at their home in Prestwich, told Sky News al Shamie had lived there with his wife and young child, but he believed left six months earlier. Mr Halliwell said: \"There was the mother and three lads, but one moved away. We're talking about the eldest, he had a wife and kid, but she moved out some time ago. \"There was no sign of radicalisation, nothing like that. We never talked politics. Just 'good morning, how are you? Lovely day, isn't it?' \"He was fine, the whole thing has come out of the blue. He was a smashing lad to talk to, so were the other two lads.\" Mr Halliwell said the father left the family home about 10 years ago, but sometimes visited. Read more:Families pay tribute to 'kind and heroic' victimsPolice given extra time to question four arrestedSynagogue security guard 'feared they would die' He thought he had moved to France because sometimes he turned up in a French-registered car. Faraj al Shamie, a trauma surgeon who has worked for the International Committee of the Red Cross in Africa, condemned his son's attack on the synagogue. He said in a statement: \"The al Shamie family in the UK and abroad strongly condemns this heinous act, which targeted peaceful, innocent civilians. We fully distance ourselves from this attack and express our deep shock and sorrow over what has happened.\" But, two years ago, on 7 October, he praised the actions of Hamas terrorists for their attack on Israel in which 1,200 were killed and 251 taken back to Gaza as hostages. Al Shamie wrote on Facebook: \"The scenes broadcast by the Al-Aqsa Martyrs Brigades of a group of fighters storming an Israeli army camp using simple means, namely balloons and motorcycles, prove beyond a shadow of a doubt that Israel will not remain.\" Additional reporting by Shakir Ahmed, specialist producer and Rebecca Spencer, crime producer"
    },
    {
        "title": "Robert Jenrick announces plans to abolish Sentencing Council amid 'two-tier justice' row",
        "description": "The Conservatives have announced they will abolish the independent body that advises courts on sentences in a bid to stop what it has called \"two-tier justice\".",
        "url": "https://news.sky.com/story/robert-jenrick-announces-plans-to-abolish-sentencing-council-amid-two-tier-justice-row-13446039",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-robert-jenrick-conservative_7044130.jpg?20251006143240",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-06 12:21:21",
        "Headline": "Shadow justice secretary Robert Jenrick says ministers will instead issue advice to courts on sentencing instead of an \"unaccountable quango\".",
        "Content": "The Conservatives have announced they will abolish the independent body that advises courts on sentences in a bid to stop what it has called \"two-tier justice\". Shadow justice secretary Robert Jenrick said that ministers, rather than the Sentencing Council, would be responsible for setting sentencing policy if the Tories return to power at the next election. Speaking while the Conservative Party conference was under way in Manchester, Mr Jenrick branded the council \"not fit for purpose\". \"Never again can the British people face the prospect of two-tier justice,\" he continued. \"We are slipping into a two-tier nightmare under Keir Starmer. All too frequently the law is not applied equally. No more - every single person in this country must be treated exactly the same, regardless of their background.\" Politics latest: Tories pledge to abolish business rates for high street shops and pubs The Sentencing Council, which sets out guidance for courts in England and Wales, found itself at the centre of controversy earlier this year after it advised judges to factor in the backgrounds of offenders as part of the sentencing process. \n                  Brutal findings of new poll in line with views of gloomy Tory MPs\n                 \n                  Half of Tory members do not want Kemi Badenoch to lead party into next election, says poll\n                 \n                  Tories to scrap business rates on high street pubs and shops\n                 The proposed guidelines - which never came into force as they were suspended - said courts should \"normally consider\" ordering a pre-sentence report (PSR) for criminals if they were from an ethnic, cultural minority or faith minority community, transgender, under the age of 25, pregnant or female. PSRs are taken into account when considering a criminal's sentence. The council said at the time that the recommendation was aimed at reflecting disparities in sentencing outcomes. According to the most recent government statistics, since 2018 white defendants are more likely to have a shorter jail sentence than any other ethnic group. However, the Tories called it an example of \"two-tier\" justice, arguing it was biased against Christians and straight white men.  Shabana Mahmood, the current home secretary who was justice secretary at the time, also expressed her \"displeasure\" at the body's recommendations, arguing that \"as someone who is from an ethnic minority background myself, I do not stand for any differential treatment before the law\". Following the row, it was confirmed that the justice secretary - now David Lammy - will be given the power to veto any changes to sentencing guidelines proposed by the council. It means the Sentencing Council will be unable to issue new guidelines without the explicit approval of the justice secretary or the lady chief justice, who is head of the judiciary. But Mr Jenrick wants to go further by abolishing the council altogether. \"The public are sick of voting for tougher sentences and getting the opposite,\" he said. \"So in future the justice secretary, accountable to parliament, will be responsible for setting sentencing policy. No longer will an unaccountable quango be able to subvert the will of the British people for criminals to be properly punished.\" Read more:Badenoch praises Thatcher but faces fight with grandeesActive plot against Badenoch at party conference A Labour spokesperson said: \"This is yet more rank hypocrisy from a Conservative Party that wrecked our justice system and left Labour to pick up the pieces. \"After 14 years of Tory neglect, our prisons were left bursting at the seams because they didn't build enough prisons, our courts overwhelmed, and public confidence in the justice system was left shattered. \"The Conservatives backed the proposed changes to pre-sentencing reports when they were announced and did nothing to stop them when they were in government. Labour took action the moment we uncovered their mistake. \"This is just another cynical gimmick from Jenrick, a man who constantly undermines the independence of the judiciary just to further his own career.\""
    },
    {
        "title": "Half of Tory members do not want Kemi Badenoch to lead party into next election, says poll",
        "description": "Half of all Conservative members think Kemi Badenoch should not lead the party into the next election, according to an exclusive Sky News Tory members poll.",
        "url": "https://news.sky.com/story/half-of-tory-members-do-not-want-kemi-badenoch-to-lead-party-into-next-election-says-poll-13446008",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-kemi-badenoch-conservatives_6980470.jpg?20250802075030",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-10-06 11:41:52",
        "Headline": "Having lost to Ms Badenoch a year ago, Robert Jenrick is now comfortably the members' favourite.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Half of all Conservative members think Kemi Badenoch should not lead the party into the next election, according to an exclusive Sky News Tory members poll. The YouGov poll found 46% think the current Tory leader should stay in place when the country next goes to the polls, while 50% say she should not. Tory members are split as to whether she will make it that far. A total of 49% think she will be out before the election, compared with 47% who think she'll still be in place. Politics latest: Tories pledge to abolish business rates for high street shops and pubs The Tory leader will hope that this week's conference in Manchester will steady her leadership. But asked who they would prefer as leader of the Conservative Party, 46% of Tory members picked Robert Jenrick, comfortably ahead of the 39% who said Ms Badenoch. In all, 11% said neither and 4% don't know. The poll of 652 Conservative members was taken between 26 September and 2 October. \n                  Brutal findings of new poll in line with views of gloomy Tory MPs\n                 \n                  Robert Jenrick announces plans to abolish Sentencing Council amid 'two-tier justice' row\n                 \n                  Tories to scrap business rates on high street pubs and shops\n                 Having lost to Ms Badenoch a year ago, Mr Jenrick is now comfortably the members' favourite, and would beat Boris Johnson, James Cleverly and Priti Patel. Badenoch would narrowly beat Johnson if they went head to head. The poll also asked whether members had a favourable or unfavourable opinion of leaders. It showed 70% had a favourable opinion of Badenoch and 29% holding an unfavourable view. While 73% had a favourable opinion of Jenrick and 20% had an unfavourable opinion. Read more:Brutal findings of new poll in line with views of gloomy Tory MPsBadenoch praises Thatcher but faces fight with grandeesActive plot against Kemi Badenoch at party conference Ms Badenoch rejects any kind of electoral pact with Reform UK at the next election, but this is out of step with Tory members. The poll finds 64% support an electoral pact, meaning Reform and the Tories would not stand candidates against each other in target seats, while 31% do not. Almost half of Tory members - 46% - would support a full blown merger with Reform UK, against 48% who would oppose a merger. Party members are very clear that in a hung parliament, they would not want to see Tory MPs putting a Labour prime minister back in Number 10. Tory members oppose a coalition with Labour by 93% to 6%. However 73% would welcome a coalition with Reform UK in a hung parliament, with 25% against."
    },
    {
        "title": "Badenoch didn't 'have enough confidence' but now 'blossoming', says shadow cabinet minister",
        "description": "Kemi Badenoch did not have \"enough confidence\" as Tory leader to begin with, but is now \"blossoming\", a shadow cabinet minister has said.\n",
        "url": "https://news.sky.com/story/badenoch-didnt-have-enough-confidence-but-now-blossoming-says-shadow-cabinet-minister-13446217",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-victoria-atkins-beth-rigby_7044080.jpg?20251006135143",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-06 18:52:10",
        "Headline": "Victoria Atkins also spoke about her \"sadness\" at the Tories' plan to leave the EHCR but said it was the right thing to \"deal with the politics of today\". ",
        "Content": "Kemi Badenoch did not have \"enough confidence\" as Tory leader to begin with, but is now \"blossoming\", a shadow cabinet minister has said.\n Speaking from the Conservative Party Conference in Manchester, Victoria Atkins told the Sky News Electoral Dysfunction podcast with political editor Beth Rigby that Ms Badenoch was now \"going with her instinct\". Asked what Ms Badenoch's strengths and weaknesses are, the shadow environment secretary said: \"She doesn't have enough confidence in herself, in that I know that she has been really wanting to listen and absorb this year. \"And I think this conference we're seeing her having that confidence, having been in that role for a while now, she's got that confidence and she's going with her instinct, and I think that's really exciting.\" She added: \"We are seeing Kemi I think really blossoming and coming into her own on this.\" Ms Badenoch has faced questions over her leadership as the Tories continue to languish behind Labour and Reform in the polls, following their worst-ever general election defeat last year. An exclusive poll of Tory members for Sky News found half of them think she should not lead the party into the next election. \n                  Wargame Day: Is the UK ready for a real Russian attack?\n                 \n                  Sarah Mullally: The former nurse chosen to lead the Church of England\n                 \n                  Why is Keir Starmer obsessed with Nigel Farage? \n                 Elsewhere during the podcast, Ms Atkins said she had \"sorrow\" about her boss's plans for the UK to leave the European Convention on Human Rights (ECHR) but it was necessary to \"deal with real life\". The ECHR issue has long divided the party, with moderates from the \"one nation\" wing typically opposed to the idea, while others on the right of the party think it is necessary to get a grip on illegal immigration. Ms Atkins defines herself as a \"one nation\" Conservative. However, unlike fellow one-nation Tory Robert Buckland, a former justice secretary and Lord Chancellor, she backs the plans. \"I share his sorrow but I also have to deal with the politics of today,\" she said. \"We see this disenfranchisement between the law as it is now interpreted and what people want to see from the government of the day and also the protection of our borders. \"And I think that the sadness actually is the way that the court and indeed, judgments flowing from the courtroom, the European Court, have been used. \"That is a great sadness to me, but we have to deal with real life.\""
    },
    {
        "title": "Dame Jilly Cooper obituary: Sex, glamour and posh people behaving badly - she was the undisputed 'queen of the bonkbuster'",
        "description": "The secret to writing good sex?",
        "url": "https://news.sky.com/story/dame-jilly-cooper-obituary-sex-glamour-and-posh-people-behaving-badly-she-was-the-undisputed-queen-of-the-bonkbuster-13446033",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-jilly-cooper-riders_7044269.jpg?20251006170214",
        "type": "UK",
        "Author": "Gemma Peplow",
        "Date Published": "2025-10-06 12:13:39",
        "Headline": "Known as the \"Queen of the bonkbuster\", Dame Jilly's filthy and funny novels sold millions around the world. Reflecting upon her career after becoming a dame, the author said she had always wanted to write happy books.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n The secret to writing good sex? According to Dame Jilly Cooper, the answer was simple. \"Keeping it fun,\" she said in an interview in 2023. Known as the \"Queen of the bonkbuster\", Dame Jilly's filthy and funny novels sold millions around the world. Sex, glamour, horses, posh people behaving badly; her most famous works include Riders, Polo, The Man Who Made Husbands Jealous, and of course, Rivals, which found a new audience thanks to a hugely successful Disney+ television adaptation last year. Her books have been ubiquitous since the 1980s, instantly recognisable for their simple but suggestive covers - the red stiletto! the tight jodhpurs! - and beloved for their blend of risqué storylines and critique of Britain's class system. As her agent Felicity Blunt said in tribute following her death at the age of 88: \"You wouldn't expect books categorised as bonkbusters to have so emphatically stood the test of time but Jilly wrote with acuity and insight about all things - class, sex, marriage, rivalry, grief and fertility.\" Born Jill Sallitt in Hornchurch, Essex, in 1937, she came from a well-known Yorkshire family; her great-grandfather founded The Leeds Mercury newspaper and was a Liberal MP for the city. Her family moved back to Yorkshire when she was a toddler, but she later attended the private Godolphin School in Salisbury. Her own writing career began in 1956, when she started as a cub reporter on the Middlesex Independent, covering everything from \"fetes to football\". She moved into public relations - and was apparently sacked from 22 jobs, according to her website biography - before ending up in book publishing. Her big break came in 1969, when The Sunday Times magazine published an article she had written \"on being a hopelessly undomesticated young wife\" - resulting in a regular column for the newspaper in which she wrote openly about sex, marriage and housework, running for more than 13 years. She would later write for five years for The Mail on Sunday. Her first book, How To Stay Married, was written in 1969, eight years after her marriage to her husband, publisher and childhood sweetheart Leo Cooper. In 1972, she wrote for the first UK edition of Cosmopolitan - rating famous men such as British actor David Niven and former Labour chancellor Roy Jenkins by how she thought they would be in bed. In 1975, Dame Jilly started a series of \"permissive\" romance novels with Emily, based on previously published magazine stories - her first fiction in book form. But it was Riders, the first novel in her raunchy Rutshire series, published in 1985, that changed everything. Featuring showjumping lothario Rupert Campbell-Black, the book went straight to number one in the bestseller lists, as did the follow-up, Rivals, in 1988. Polo, in 1991, was the biggest-selling hardback novel of the year, and The Man Who Made Husbands Jealous, in 1993, remained at number one for eight weeks. It took a little longer for critics to catch up, though. While her writing genius is now widely acknowledged, for years she was a victim of cultural snobbery, her novels often dismissed as trashy. But fans couldn't get enough. Set in the fictional county of Rutshire, the innuendo-laden series continued throughout the 1990s, 2000s and 2010s, with novels including Appassionata, Score!, Pandora and Mount! The most recent, Tackle!, which took on the beautiful game, came out in 2023. Several of Dame Jilly's works have been adapted for television and film, including a Riders TV film in 1993, and an ITV series of The Man Who Made Husbands Jealous, starring Stephen Billington and Hugh Bonneville, in 1997. Most recently, there was Disney+'s Rivals, which set the tone straight away: mile high club sex (Concorde, naturally) and Robert Palmer's Addicted To Love. Featuring an all-star cast including David Tennant, Danny Dyer, Alex Hassell, Emily Atack, Nafessa Williams, Aidan Turner and Katherine Parkinson, the Cotswolds-set series brought a modern-day lens to the 1980s without sweeping the worst aspects of the era under the carpet, and was released to glowing reviews and viral online commentary (thanks in no small part to a spot of naked tennis).  After being nominated for several BAFTAs, the second series is due in 2026. Dame Jilly was appointed an OBE for services to literature in the 2004 Birthday Honours, and CBE for services to literature and charity in the 2018 New Year Honours. Her damehood came in the New Year Honours last year; she received the accolade from the King in an experience she described as \"orgasmic\". Reflecting upon her career after becoming a dame, the author said she had always wanted to write happy books. \"The only thing I wanted to do in life was to cheer people up and people can get quite depressed, so I do like to tell lots of jokes,\" she said. Her other awards included a lifetime achievement prize at the British Book Awards in 1998, and the inaugural Comedy Women in Print lifetime achievement award in 2019. She suffered difficulties in her life, and famously survived the Paddington rail crash in 1999. She said of the experience that she believed she was going to die when her train carriage overturned, but she escaped unhurt by climbing through a broken window on the First Great Western train. In 2013, she lost her husband Leo, at the age of 79, after more than 50 years of marriage. After his death, she said she had joined dating site Tinder \"for research purposes\" but was not really looking for love again. As well as her books, Dame Jilly was known for her love of animals. She was a patron of charities and spearheaded the Animals In War Memorial Fund in 1998, which led to a memorial being unveiled in Park Lane in November 2004. She leaves behind her children, Emily and Felix, and five grandchildren. Following her death, tributes have been paid by everyone from her family to TV stars to the Queen, who described her as \"a legend in [her] own lifetime\" who \"created a whole new genre of literature\" and made it her own. Camilla ended with a wish for her \"witty and compassionate\" friend: \"And may her hereafter be filled with impossibly handsome men and devoted dogs.\" Dame Jilly would certainly have approved of that."
    },
    {
        "title": "'African tribe handmaiden' released after immigration arrest in Scottish woods",
        "description": "The \"handmaiden\" of a self-proclaimed African tribe recently evicted from Scottish woods has been released after being arrested during an immigration raid.",
        "url": "https://news.sky.com/story/african-tribe-handmaiden-released-after-immigration-arrest-in-scottish-woods-13446232",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kaura-taylor-kubala_7038314.jpg?20251001163951",
        "type": "UK",
        "Author": "Connor Gillies",
        "Date Published": "2025-10-06 19:46:15",
        "Headline": "The mother of Kaura Taylor, who claimed she was reclaiming stolen land, alleged her daughter had been \"brainwashed\".",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n  The \"handmaiden\" of a self-proclaimed African tribe recently evicted from Scottish woods has been released after being arrested during an immigration raid. American national Kaura Taylor, 21, was one of three members of the \"Kingdom of Kubala\" who claimed they were reclaiming land stolen from their ancestors 400 years ago in Jedburgh, near the border with England. The group's self-proclaimed King was former businessman and opera singer Kofi Offeh, and his partner Jean Gasho who called herself \"The Queen of the North\". Taylor was reported missing from Texas in May this year before her family spotted videos of her online where she was \"swearing allegiance\" to the King who said he had \"bought\" her \"for a price\". Their controversial camp was forced out of council land in the Scottish Borders on Thursday after a protracted court battle to remove the trio. It came hours after Sky News reported on the concerns of Kaura's mother Melba Whitehead in Dallas, Texas. Ms Whitehead suggested her daughter was \"brainwashed\", \"coerced\" and lured from the US to the \"cult\" in Scotland. \n                  Mother jailed after drowning two-year-old daughter in village pond\n                 \n                  46 people arrested as Met Police disrupts crime network suspected of smuggling up to 40,000 stolen phones to China\n                 \n                  Robert Jenrick announces plans to abolish Sentencing Council amid 'two-tier justice' row\n                 The group denied the allegations when we confronted them. A Facebook post by Jean Gasho later described Ms Whitehead's emotional Sky interview as \"laughable\". UK Border Force officers swooped on the camp and detained a Ghanaian man and American woman on Thursday. They were held on suspicion of immigration offences. Sky sources now say the American woman has been \"de-arrested\" after it was determined \"no offence had been committed\". It is understood the male from Ghana remains detained pending further action."
    },
    {
        "title": "Man appears in court charged with murder after human remains found at Loch Lomond",
        "description": "A suspect has appeared in court charged with murder amid a probe into the death of a man whose remains were discovered at a Loch Lomond beauty spot.",
        "url": "https://news.sky.com/story/man-appears-in-court-charged-with-murder-after-human-remains-found-at-loch-lomond-13446112",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-graham-wright-police-scotland_7022817.png?20251006160257",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-10-06 15:00:42",
        "Headline": "David McColl, 50, appeared at Glasgow Sheriff Court on Monday over the death of Graham Wright, 38, and was remanded in custody.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A suspect has appeared in court charged with murder amid a probe into the death of a man whose remains were discovered at a Loch Lomond beauty spot. Graham Wright, 38, was last seen in Glasgow on 20 August and was reported missing five days later. A member of the public found his remains near to Rubha Dubh, at Firkin Point, on 13 September. David McColl, 50, was arrested and charged in connection with Mr Wright's death. McColl has been accused of murder, attempting to defeat the ends of justice, and two counts of breaching bail conditions. McColl, of Glasgow, made no plea to the four separate charges when he appeared at the city's sheriff court on Monday. He was remanded in custody and is due back in the dock within the next eight days. \n                  Man in court over human remains found at Loch Lomond beauty spot\n                 \n                  James Clacher: Rapist who faked death and fled Scotland for Spain jailed\n                 \n                  Student took his own life on graduation day after being mistakenly told he'd failed course\n                 Police Scotland last week arrested and charged John Roarty, 53, in connection with the case. Roarty made no plea to the single charge of attempting to defeat the ends of justice when he appeared before Glasgow Sheriff Court on Thursday. The suspect was remanded in custody ahead of his next court appearance. Read more from Sky News:Teenagers jailed over machete killing of 15-year-old'Kardashian of Cheshire' jailed over designer handbag scam The major investigation has seen officers carrying out enquiries across the region, including in Glasgow's Gorbals and Castlemilk areas and in Rutherglen, South Lanarkshire. A Police Scotland spokesperson said: \"Extensive enquiries remain ongoing.\""
    },
    {
        "title": "Renewable energy produces more electricity than coal for the first time, experts say",
        "description": "For the first time in history, renewable energy has produced more of the world's electricity than coal, according to a new analysis of global energy trends.",
        "url": "https://news.sky.com/story/renewable-energy-produces-more-electricity-than-coal-for-the-first-time-experts-say-13446220",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-solar-panel-roof-housebuilding_6929219.jpg?20250527223901",
        "type": "World",
        "Author": "Tom Clarke",
        "Date Published": "2025-10-06 19:07:54",
        "Headline": "Solar and wind are now growing fast enough to not only meet the world's growing appetite for electricity, but to outstrip it.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n For the first time in history, renewable energy has produced more of the world's electricity than coal, according to a new analysis of global energy trends. In the first half of 2025, solar and wind energy outstripped growth in global electricity demand and led to a small but significant reduction in the use of fossil fuels compared to the year before, clean energy analysts Ember said. The finding coincides with the International Energy Agency (IEA) forecasting a doubling of global clean energy capacity by 2030. \"We are seeing the first signs of a crucial turning point,\" said Ember's electricity analyst, Malgorzata Wiatros-Motyka. Deployment of renewable generation, particularly in developing economies, has outpaced new fossil fuel power in recent years. 'The beginning of a shift' But many experts warned the increase would not be enough to meet rising global demand for electricity, let alone start to reduce emissions and therefore combat global warming. Ms Watros-Motyka said: \"Solar and wind are now growing fast enough to not only meet the world's growing appetite for electricity - this marks the beginning of a shift where clean power is keeping pace with demand growth.\" The IEA analysis of renewable energy trends predicts global renewable generation will increase by 4,600 gigawatts by 2030 - a growth equivalent, it says, to the current total power generation of China, the EU, and Japan combined. IEA executive director Fatih Birol said solar photovoltaic, or solar PV (the technology that converts sunlight into electricity using solar panels made up of photovoltaic cells), \"is on course to account for some 80% of the increase in the world's renewable capacity over the next five years\". \"In addition to growth in established markets, solar is set to surge in economies such as Saudi Arabia, Pakistan and several Southeast Asian countries,\" he added.  The trend is not even, however. Ember's analysis found renewable generation outstripped coal in both China and India in the first half of 2025, but in the US and Europe, the reverse was true. Rocketing electricity demand in the US, driven in large part by electricity for AI and datacentres, saw more reliance on coal and gas generation, despite an increase in renewable electricity capacity. In the EU, lower output from wind farms and hydroelectric plants led to a higher reliance on fossil fuels. The reports highlight the challenges of switching economies from fossil fuel-powered electricity grids to those dominated by renewables. They also don't rule out future shifts in fossil fuel emissions if demand accelerates or supply chains for renewables are constrained in some countries. The growth of offshore wind for example, is now forecast to slow due to policy changes in places like the US and materials costs in Europe, according to the IEA. Read more on Sky News:Alarm over Tory climate plansChanges to eco rules for new homesCan Arctic be refreezed?  However, the growth in green power also reflects potential opportunities missed by countries like the US, and right-wing politicians in Europe, who reject renewable electricity on ideological or cost grounds. In nearly all markets, the agency concludes, solar panels are the cheapest and easiest-to-install form of generation. US President Donald Trump, who recently told the United Nations climate change was the \"greatest con job\", might want to study the numbers, too. His administration has committed to increasing US oil and gas exports and abandoning support for renewable energy. According to a separate analysis by Ember, the US sold around $80bn (£59bn) in oil and gas in July, while China exported $120bn (£89bn)-worth of green technology in the same month."
    },
    {
        "title": "October 7: Two lives torn apart by day that changed everything",
        "description": "For a long time, Rita Lifshitz would come back to Kibbutz Nir Oz every week, sit outside the house of her father-in-law, Oded, and have a drink.",
        "url": "https://news.sky.com/story/october-7-two-lives-torn-apart-by-the-day-that-changed-everything-13446218",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rita-lipshitz-sabah-al-qarra_7044546.jpg?20251006235313",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-10-06 19:01:35",
        "Headline": "Sky's Middle East correspondent meets two women whose lives were torn apart by October 7 - the day Hamas launched its terror attack on Israel in 2023, the day on which everything changed in this part of the Middle East.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  For a long time, Rita Lifshitz would come back to Kibbutz Nir Oz every week, sit outside the house of her father-in-law, Oded, and have a drink. To raise a glass to the people who had gone. To remember October 7. Follow updates on Israel-Hamas war \"We used to drink a beer every weekend,\" she tells me, her eyes trained on the small little table on the patio where they would sit and talk. \"So for 500 days I came to have a beer outside the table. Here I put the beer for grandpa and I put the beer for me. He was my psychologist for 500 days. \"He was only a few kilometres from me and I just imagine him coming in with a big smile.\" Around her, the charred remains of violence, death, and devastation. The burnt-out wreckage of happy lives that came to a horrific end. I spent two hours walking around this kibbutz with Rita. She showed me the places where friends had been murdered, where loved ones had been taken hostage, and where her best friend had been shot and then dragged away, his blood still smeared over the floor of his home. \"It is a trauma,\" she says. \"And all of us, the whole kibbutz, wakes up every morning to the 7th of October.\" On the morning of 7 October 2023, this small kibbutz, which sits within sight of the border with Gaza, was overrun by Hamas fighters. In total, 117 people, more than a quarter of those who were there that morning, were either killed or kidnapped. No other kibbutz suffered such a high proportion of casualties. Among them, Oded Lifshitz and his wife, Yocheved. Both were in their 80s, and both had volunteered for charities promoting peaceful relations with Gazans. Both were taken hostage on October 7. Oded used to drive sick children from Gaza and take them to Israeli hospitals for treatment. Now we stand in the charred remains of their home. Yocheved was eventually released after 16 days as a hostage, but Oded died in captivity. His body was not returned until earlier this year, but he had probably died a year earlier. And now we stand in the charred remains of their house. To Rita, this place is both a touchstone to a happier time and also a stark warning of inhumanity. A panel of metal is all that is left of the piano that Oded loved to play. The couple's crockery is still scattered in a corner, thrown there when their furniture was upended. \"They started firing rockets at us at 6.30 in the morning, but we didn't worry because they have been firing rockets at us for 20 years,\" says Rita. \"There was one day we had 800 rockets land round here, so we are not scared of rockets. We didn't get any information about what was happening, no warning. \"The first we knew was when two people working in the fields saw Hamas, and they were the first ones to be killed.\" It is believed that around 540 fighters attacked the kibbutz - far more than Nir Oz's entire population. It was a massacre. Only six houses escaped attack. The nursery school workshops, gardens - all of them shot, burnt, destroyed. We move to the far end of the home, picking our way through the debris that still litters the floor. There is a steel door, the entrance to the bomb shelter where Oded and Yocheved often slept and where they tried to hide. Their beds are still here, blackened and burnt. In the door are bullet holes - Oded had done his best to hold the door shut, but he was shot in the hand and the attackers stormed in. 'The death road' The last time Yocheved saw her husband was him lying on the floor, bleeding. As she was taken away, rolled into a carpet, she didn't know if he was dead or alive. To walk around this kibbutz is to witness the scars of trauma again and again. A black flag outside a house means someone died there. A yellow flag designates that an occupant was taken hostage. There is a road that Rita calls \"the death road,\" where almost every house has at least one flag outside. Read more about the war in Gaza:Trump's Gaza peace plan explainedSky News reports from inside Gaza City We go into the home of one friend, who was murdered in the living room. Her clothes are still there, her handbag hangs on the bedroom door. It feels so intrusive to be here, but Rita insists the world needs to see. We see Natan, a long-term resident who is now 88 years old. His home was one of only six to escape being ransacked, because the Hamas attackers couldn't work out how to get through the front door. He says he came back as soon as he could, despite the destruction around him, insistent he is not fearful. \"This is my home,\" he says emphatically. Rita takes me to the home of her best friend, Itzhak Elgarat. Unlike most of the homes, his was not set ablaze, so it still looks now as it did then. A bottle of olive oil is on the side, cooking ingredients laid out, a couple of bottles of wine set on the table. But also bullet holes strewn across the walls, in the furniture. Possessions thrown around and, horrendously, Itzhak's blood still smeared across the walls, the floor, and the door where he was shot. The other side I climb a set of stairs, which used to belong to a house that has now been demolished. You can see Gaza in the near distance, across a few fields. And over there, not so long ago, Sabah might have been looking back. Just as Rita's life has been torn apart by the war, so has Sabah's. For Rita, it is the mental torment of what happened on October 7, the struggle to process and to move on. For Sabah, it is something more fundamental. A Gazan displaced from Khan Younis, she once lived in a grand home near the border, only a couple of miles from Kibbutz Nir Oz, as the crow flies. It was a home for multiple generations, the pride of her life, \"a place meant to give us stability and peace\". Since then, she has been displaced 13 times, and she worries that her home has been reduced to rubble. \"Personally, I long to go back to even the ruins of my house, to sit among the rubble, simply to be there,\" she says. \"Even that would be better than this life. At least then I might find a little peace.\" The last time she saw her home, it had been hit by an explosion. Some of it was destroyed, but other parts were habitable. But since then, Sabah has been told that it has been damaged by both fire and military action - news that devastated her. She says: \"Someone told me 'your house was the very first thing they burned. The fire raged inside for three days. And after they burned it, they brought in an armoured vehicle and blew it up'. \"Just imagine losing your home. When they told me what happened to mine, I spent nearly ten days doing nothing but crying. \"It feels like your soul is torn away. Your spirit leaves you.\" She insists that this story is not just about October 7, not just about Hamas, but about decades of struggle that led to this point, about Palestinian anger and accusations that they are oppressed by Israel. \"This goes back generations. What happened on October 7 was not the beginning of the story. I remember my father, my grandfather, and their fathers before them telling what they had endured. We have lived our entire lives under this weight. \"This land is ours, our homeland. We did not buy it. It has been passed down from our ancestors, generation to generation. That is why it is not easy for me, or for any of us, to surrender it. \"The truth is that we are exhausted. We are an oppressed people. October 7 was just one day, but for us, it has felt like living through hundreds of October 7th's, over and over again.\""
    },
    {
        "title": "Netanyahu is learning limits of what can be achieved by military power alone",
        "description": "It is hard to remember the Middle East before October 7 2023, so much has changed in the wake of its horrendous events.",
        "url": "https://news.sky.com/story/netanyahu-is-learning-the-limits-of-what-can-be-achieved-by-military-power-alone-13446244",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-benjamin-netanyahu_7021331.jpg?20250915131512",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-10-06 20:27:20",
        "Headline": "Conceived in the wake of one genocide, Israel is accused of perpetrating another, which has potentially grave repercussions for its future. And having invested more in military action than creative diplomacy, Benjamin Netanyahu's Israel is now increasingly isolated.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  It is hard to remember the Middle East before October 7 2023, so much has changed in the wake of its horrendous events. Before the attack, the region's geopolitical tectonic plates were grinding, but an uneasy status quo held sway and observed certain rules. Follow latest updates on the Israel-Hamas war But that day unleashed an earthquake, changing everything. In two years of turmoil since, the region's rulebook has been torn to pieces. The first rule: Israel would manage the threat from Hamas but not try to eradicate it. Israel's policy of dividing and ruling the Palestinians' rival factions had come back to bite them. Instead, Israelis insisted in one voice after October 7th, no more 'mowing the grass', their euphemism for cutting Hamas down to size, from time to time. This time, the job must be finished. That would change the way Israelis waged their war in Gaza. Not least in the way they would tolerate many more civilians dying, in the name of defeating their enemy. If the target's rank was high enough, the deaths of scores of civilians, women, and children would be acceptable. Watch The World: War in Gaza Special  The outcome has been an unprecedentedly high civilian death toll. Israel's war on Hamas has now killed more than 67,000 people in Gaza, most of them civilians, according to the Hamas-run health ministry, which does not differentiate between civilians or combatants. Its impact will be felt for generations to come, not least no doubt on the potential radicalisation of those who have survived. And it has seen Israel, a nation conceived in the wake of one genocide, accused of perpetrating another. That stain, justified or not, has implications for Israel's psyche and own sense of identity. And it has potentially grave repercussions for its future. Abroad, popular support for Israel has fallen most of all among the young and most of all where it needs it most: America. The rule that supporting Israel will always be a vote-winner in the US is also now in question. But the rules have changed Israel's borders and in the way it has chosen to wield its increasingly hegemonic military power even more dramatically. Read more from Sky News:Peace plan - what you need to knowTrump urges peace talks 'move fast' Israel's leaders found a new boldness in the wake of October 7, at the same time as technological and tactical advances gave them the tools to pursue it. The pager operation against Hezbollah that crippled the Shiite Lebanese militia was planned long before October 7. But it reached operational utility just as Israel found the risk appetite to implement it. It was decisive in the events that led to the assassination of Hezbollah leader Hassan Nasrallah. Since 2006 and Israel's last war with Hezbollah, the rule held that neither would risk provoking another. It would be too devastating for both. The pager attack disabled Hezbollah's ability to launch tens of thousands of missiles, after months of attritive attacks on them by Israel. For as long as Hezbollah held that arsenal of missiles, it was assumed Israel would not risk attacking Iran. With that neutralised, Israel could now take on its ultimate enemies there. The rules were rewritten in the skies over Iran and Israel in their first direct attacks on each other in April and October last year. Then, in June this year, Israel unleashed a devastating 12-day war on Iran, joined in its closing stages by US warplanes too. But after reaching that zenith in military supremacy, Israel has since overreached. A failed airstrike on Hamas leaders in Doha, Qatar, provoked the anger of allies, most crucially Donald Trump. In the prelude to this anniversary, Benjamin Netanyahu is learning the limits of what can be achieved by military power alone. Having invested more in military action than constructive diplomacy, Netanyahu's Israel is now increasingly isolated. Israel's leader finds himself hemmed in by a US president being leant on by Arab allies. Trump will not tolerate Israel annexing the West Bank and wants a deal that offers a \"credible pathway\" to a future Palestinian state. Netanyahu needs to show he can still bring the remaining hostages home, that fighting the war this long was justified, and he has a plan for what happens the day after. And if the war is being drawn to a close, with American mediation and the support of Arab partners and allies, they all have responsibilities too. To find a better new status quo with far better rules, to make sure the carnage and regionwide turmoil of the last two years can be brought to a close and never repeated."
    },
    {
        "title": "Bitcoin's price is at record highs. Is it sustainable?",
        "description": "Bitcoin is trading at all-time highs, surging beyond &#163;93,000 for the first time.",
        "url": "https://news.sky.com/story/bitcoins-price-is-at-record-highs-is-it-sustainable-13446153",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-bitcoin-file_7044296.jpg?20251006172428",
        "type": "World",
        "Author": "Connor Sephton",
        "Date Published": "2025-10-06 16:29:52",
        "Headline": "While some argue Bitcoin remains cheap at £93,000, critics argue it's a house of cards that'll come crashing down. Sky News speaks to those on both sides of the debate.",
        "Content": "\n          News reporter\n              @ConnorSephton\n Bitcoin is trading at all-time highs, surging beyond £93,000 for the first time. The world's biggest cryptocurrency has doubled in value over the past 12 months - buoyed by Donald Trump's return to the White House. However, its 10% surge over the past week is down to one specific factor: the US government shutdown.  Experts have told Sky News that the drama unfolding in Washington is undermining trust in the dollar - and pushing investors to alternatives. Bitwise senior associate Max Shannon said stubbornly high inflation, which erodes spending power, is another factor. Some countries are also increasing their monetary supply - watering down the value of cash in circulation - with government borrowing on the rise. That's led to what's known as a \"debasement trade\", where investors pile their cash into so-called \"hard\" assets like Bitcoin and gold instead. Bitcoin has a fixed supply, meaning no more than 21 million will ever exist. Almost 95% of them are already in circulation, with a small number of coins entering the market every day. Enthusiasts argue this creates a form of scarcity that pushes prices up, as demand for BTC is considerably higher than supply. The latest figures from the Financial Conduct Authority suggest about seven million people in the UK have invested in cryptocurrencies. A single coin can be broken up into 100 million pieces, meaning many have a tiny chunk of Bitcoin in their portfolios. But much of the current enthusiasm for Bitcoin isn't coming from everyday investors - instead, it's institutions leading the charge. Deep-pocketed companies and individuals are buying into exchange-traded funds (ETFs) on Wall Street that track Bitcoin's value - allowing them to gain indirect exposure to BTC's price rises without owning it directly. A staggering $3.5bn (£2.6bn) flowed into these products last week. Samson Mow is the chief executive of JAN3, a company that promotes Bitcoin adoption. He played a role in El Salvador becoming the first country in the world to adopt this cryptocurrency as legal tender. While that experiment didn't achieve widespread success, the Central American nation continues to invest in BTC - with estimated profits of more than £350m as a result. When asked why Bitcoin has hit all-time highs, Mow told Sky News: \"Bitcoin has been a ball pushed underwater for months - this move up was inevitable. Raw demand has simply caught up with the incredibly limited supply.\" He pointed to how 6.7% of Bitcoin's supply is now tied up in ETFs - with Strategy, a company that has the goal of accruing as much BTC as possible, owning a further 3%. This means there's less to go around overall, in what Mow describes as \"the beginning of a massive supply shock\". The entrepreneur believes a single Bitcoin will one day be worth $500,000 (£371,000), meaning the cryptocurrency's total market capitalisation would surge to $10trn (£7.4trn). That's more than double what Nvidia's currently worth as the world's most valuable company, and would make BTC the second-largest asset after gold. Mow shrugged off any suggestion Bitcoin's dramatic price rises aren't sustainable - and insists the only thing that's \"definitely not sustainable\" is BTC's value remaining as low as it is. \"There are only 21 million BTC. Most corporations, billionaires, and even millionaires still have no exposure to Bitcoin. Nation-states have yet to seriously begin accumulation too, but many that we're engaged with are very interested and are looking to move quickly,\" he said. Of course, not everyone shares his enthusiasm. Critics argue Bitcoin lacks intrinsic value, with some claiming it's \"worse than a Ponzi scheme\". David Gerard, a journalist who's deeply sceptical of the crypto industry, told Sky News that Bitcoin suffers from thin trading volumes - resulting in \"unfeasibly volatile prices\" and an \"easily manipulated market\". \"Bitcoin trading is overwhelmingly in unregulated offshore exchanges, so Bitcoin is not a well-functioning market in the sense of, say, stocks,\" he said. \"If investors treat Bitcoin as a well-regulated market, they will get burned. ETFs are regulated instruments, the way Bitcoin's price is set is not.\" Read more from Sky News:Reform UK to accept crypto donationsThe pros and cons of digital IDs  Gerard has railed against BTC for years, and wrote a book condemning the sector in July 2017. But in the eight years since it was published, Bitcoin's price has risen by more than 5,200%. Has this changed his views? \"Everything that's structurally wrong with Bitcoin is still wrong with Bitcoin,\" he said. \"Anyone who sees the big number and thinks 'time to get in' is the sucker the big boys are making their money from. \"You can definitely make money in Bitcoin! But statistically, you're much more likely to be the sucker.\" Some banks, including Morgan Stanley, now encourage their clients to allocate 2% to 4% of their portfolios into crypto - but doing so when prices are so high is risky. While it's possible Bitcoin could keep on rising, this is an asset also known for punishing pullbacks that have seen investors, including people right here in the UK, lose a lot of money. This tends to happen every four years. BTC surged to a record price of $20,000 in December 2017, but plunged by more than 80% a year later - falling below $4,000. Another all-time high of $69,000 then followed in November 2021 - but 12 months on, a spectacular crash dragged it back down to $17,000, a 75% drop. Four years on in October 2025, here we are again: BTC has never been higher. History doesn't always repeat itself - but if past performance is a guide, 2026 could prove challenging."
    },
    {
        "title": "Ukraine says it has struck oil terminal in Crimea and key Russian explosives factory",
        "description": "Ukraine's military says it has struck one of Russia's main explosives factory as well as an oil terminal in Russian-occupied Crimea.",
        "url": "https://news.sky.com/story/ukraine-says-it-has-struck-oil-terminal-in-crimea-and-key-russian-explosives-factory-13446092",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ukraine-russia-crimea_7044117.jpg?20251006165613",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-06 14:11:05",
        "Headline": "Ukraine's general staff said \"numerous explosions\" were reported after the strike at the plant, which makes explosives for ammunition for the Russian armed forces.",
        "Content": " Ukraine's military says it has struck one of Russia's main explosives factory as well as an oil terminal in Russian-occupied Crimea. \"Numerous explosions\" were reported after the strike at the Y M Sverdlov plant in Dzerzhinsk, which makes explosives for ammunition for Russia's armed forces, the Ukrainian general staff said in a statement. The attacks were carried out as part of a strategy to reduce Russia's \"offensive potential, as well as its missile and bomb capabilities\", the general staff said. It added that the plant was one of Moscow's largest producers of explosives, which are used in a wide variety of ammunition for Russian President Vladimir Putin's forces, including aviation and artillery shells, fighter jet bombs, anti-tank guided missiles and warheads for air defence missile systems. Regional governor Gleb Nikitin said air defence forces had repelled an overnight attack by 20 drones near Dzerzhinsk. He said one person was injured by falling debris. Mr Nikitin said there was fire damage to residential homes but \"no damage was caused to industrial facilities\". Sky News's security and defence editor Deborah Haynes has described the targeting of the factory as \"huge\". \n                  At least five killed in Ukraine after Russian missile and drone attack - as Poland forced to scramble jets\n                 \n                  One dead and several injured after 'savage' Russian drone strike on Ukrainian railway station, Zelenskyy says\n                 \n                  Sky News joins NATO air patrol designed to deter Russia from pushing boundaries\n                 Ukraine also targeted an oil depot in Crimea, with footage shared by local media on X appearing to show the scale of the attack in the city of Feodosia as flames rose from the depot. The blaze was started after a fuel tank at the depot exploded. Ukrainian forces also hit an ammunition depot in Crimea, but military officials said the results of the strike were \"still being clarified\". Attack on Ukraine It comes after at least five people were killed in a massive Russian missile and drone attack on Ukraine over the weekend, Volodymyr Zelenskyy said. The Ukrainian president said Russia launched more than 50 missiles and around 500 attack drones - with the regions of Lviv, Ivano-Frankivsk, Zaporizhzhia, Chernihiv, Sumy, Kharkiv, Kherson, Odesa, and Kirovohrad all targeted. Four family members were killed in the western region of Lviv, which borders Poland, where an industrial park was set ablaze. One person in the southeastern region of Zaporizhzhia was killed, the region's governor said. Read more from Sky News:Trump's Gaza peace plan - what you need to knowFrench PM resigns less than 24 hours after forming cabinet Mr Zelenskyy said around 10 people were also injured in the strikes. Many civilians have also been left without power, including more than 73,000 in Zaporizhzhia. Ukraine's energy ministry said facilities had been damaged in Zaporizhzhia and the northern Chernihiv region. Russia's defence ministry said on Sunday its forces had struck Ukrainian military-industrial facilities as well as gas and energy infrastructure overnight. Moscow has stepped up strikes on Ukraine's energy grid in recent weeks as winter approaches.  Mr Zelenskyy said: \"The Russians once again targeted our infrastructure - everything that ensures normal life for our people. \"We need more protection and faster implementation of all defence agreements, especially on air defence, to deprive this aerial terror of any meaning. \"A unilateral ceasefire in the skies is possible - and it is precisely that which could open the way to real diplomacy. \"America and Europe must act to make Putin stop.\""
    },
    {
        "title": "Emmanuel Macron under pressure to call parliamentary elections after French prime minister resigns",
        "description": "Sebastien Lecornu's resignation has come kind of completely out of the blue - and there doesn't seem to be an obvious reason for it.",
        "url": "https://news.sky.com/story/emmanuel-macron-under-pressure-to-call-parliamentary-elections-after-french-prime-minister-resigns-13446055",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-emmanuel-macron-sebastien-lecornu_7043725.jpg?20251006094017",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-10-06 12:56:59",
        "Headline": "French Prime Minister Sebastien Lecornu has quit less than 24 hours after forming a cabinet - and less than a month in office.",
        "Content": "\n          Europe correspondent\n              @AliBunkallSKY\n Sebastien Lecornu's resignation has come kind of completely out of the blue - and there doesn't seem to be an obvious reason for it. Less than 24 hours earlier, the French prime minister tweeted he had successfully formed a new government and spoke about the challenges facing that government to pass a much-needed budget, something his predecessors failed to do. Now, early on Monday morning, his resignation was handed down and accepted by Emmanuel Macron, leaving the president in a real crisis because he is going through prime ministers, very quickly, too quickly, really, for his position to remain stable for much longer. You will now get some very strong calls, and they are becoming quite credible calls, from Marine Le Pen's party National Rally, to hold parliamentary elections. They think that if parliamentary elections were held, then they would do very well in them, and all of the polls suggest that would be the case. And I think you will also find they have sympathy for that position from the socialists and those on the far left as well. So Macron is now going to be under immense pressure to call parliamentary elections. \n                  Who are the seven prime ministers who have served under France's Emmanuel Macron?\n                 \n                  Police fire tear gas at protesters during day of strikes in France\n                 \n                  The Block Everything movement has mobilised protesters in France - how? And why?\n                 I think he will also come under pressure to stand down himself, because every time he appoints a new prime minister, it fails. It seems as though he is running out of room and time to keep that tactic, because it is a tactic that is not working for him. Although Lecornu claimed on Sunday evening to have successfully appointed a new government, there was little new about it. Lecornu himself is a Macron loyalist and the only minister to have served in all of his governments. Most of the ministers he appointed were the same old characters from the previous government, but it was the appointment of Bruno Le Maire to armed forces minister in particular that caused anger. Le Maire spent seven years as France's economy minister and is blamed by many for the predicament the country is now in. Read more:Who are the seven PMs who have served under Macron?France has become Europe's problem child - and it could get worse The left and right, who at the very least wanted a symbolic change from the past, withdrew support before the newly announced government was even a day old. The result - Lecornu, appointed only 27 days ago, has become the shortest-serving prime minister in the history of the Fifth Republic. It's an ignominious record that Michel Barnier, who served just three months in 2024, will no doubt be happy to relinquish."
    },
    {
        "title": "Greta Thunberg among Gaza aid flotilla activists deported as Israel-Hamas peace talks begin",
        "description": "Activists including Greta Thunberg were met with cheers as they arrived at a Greek airport on Monday, after being detained in Israel, and then deported, for taking part in a Gaza-bound aid flotilla.",
        "url": "https://news.sky.com/story/greta-thunberg-among-gaza-aid-flotilla-activists-deported-as-israel-hamas-peace-talks-begin-13446158",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-greta-thunberg-athens_7044255.jpg?20251006164947",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-06 16:41:11",
        "Headline": "The Swedish activist was among a group who arrived at an airport in Greece as indirect Israel-Hamas peace talks began in Egypt. ",
        "Content": " Activists including Greta Thunberg were met with cheers as they arrived at a Greek airport on Monday, after being detained in Israel, and then deported, for taking part in a Gaza-bound aid flotilla. Israel prevented the Global Sumud Flotilla from reaching the Gaza Strip last week, detaining 471 people who were on board the vessels. Israeli authorities said on Monday that they had deported some 171 detainees, sending them to Greece and Slovakia. This brought the number who have so far been deported to 341. Thunberg, holding a bouquet of roses and sunflowers, raised her arm in a fist as people clapped at the airport in Athens. Before the group emerged, there were chants of \"free free Palestine\" and \"from the river to the sea, Palestine will be free\" among the crowd. Lubna Tuma, a lawyer representing the flotilla participants who were detained, has said some 150 of them are still being held in Israel's Ktziot prison, 40 of whom are on hunger strike. Ms Tuma has also claimed the Israeli authorities have repeatedly violated the activists' rights, with some allegedly being subject to physical violence and humiliation while in detention. Israel has strongly rejected the claims. \n                  PM condemns 'un-British' plans for protests on anniversary of Hamas terror attack\n                 \n                  Donald Trump urges Gaza peace talks 'move fast' or 'massive bloodshed will follow'\n                 \n                  Trump says Gaza ceasefire will begin 'immediately' when Hamas confirms deal\n                 Indirect peace talks take place in Egypt The deportation came as Israeli and Hamas officials held indirect talks on the US-drafted peace plan to end the war in Gaza on Monday - the eve of the second anniversary of the 7 October 2023 attack. The talks - taking place in Sharm el-Sheikh, Egypt - are focusing on the first stage of the proposed ceasefire, including the partial withdrawal of Israeli forces from the enclave and the release of hostages being held in Gaza in exchange for Palestinian prisoners, according to a Hamas statement. Asked about the talks, Donald Trump's press secretary, Karoline Leavitt said: \"We want to move very quickly on this, the president wants to see the hostages released as soon as possible.\"  The International Committee of the Red Cross (ICRC) has offered to act as an intermediary in bringing both Israeli hostages and Palestinian detainees home. \"Our teams are ready to act as a neutral humanitarian intermediary to help bring hostages and detainees back to their families,\" ICRC president Mirjana Spoljaric said. \"We are also prepared to bring aid into Gaza and distribute it safely to civilians in desperate need,\" she added. 19 more people killed in Gaza, says health ministry Attacks in Gaza are still ongoing and the region's health ministry said on Monday that the bodies of 19 people had been brought to hospitals over the last 24 hours. It said two of those people were killed by Israeli strikes and gunfire while seeking aid. The deaths bring the number of Palestinians killed since 7 October 2023 to 67,160, the ministry said. It does not differentiate between civilians and combatants in its figures, but says more than half of those killed are women and children. Read more:Sky News reports from Gaza CityWhat you need to know about the Gaza peace plan Hamas-led militants killed around 1,200 people, mostly civilians, in the 7 October attack and abducted a further 251. Most of the hostages have been released in ceasefires or other deals. A total of 48 are still being held captive by Hamas, with about 20 believed by Israel to still be alive."
    },
    {
        "title": "Who are the seven prime ministers who have served under France's Emmanuel Macron?",
        "description": "France's prime minister Sebastien Lecornu has resigned after just 27 days.",
        "url": "https://news.sky.com/story/who-are-the-seven-prime-ministers-who-have-served-under-frances-emmanuel-macron-13445950",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-emmanuel-macron-sebastien-lecornu_7043725.jpg?20251006094017",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-06 10:46:39",
        "Headline": "Sebastien Lecornu has become the latest to leave the job, resigning less than a month after taking office. ",
        "Content": "France's prime minister Sebastien Lecornu has resigned after just 27 days. The Elysee Palace said in a statement on Monday that President Emmanuel Macron had accepted Mr Lecornu's resignation, which came less than 24 hours after he named his government. Mr Lecornu had replaced his predecessor Francois Bayrou to become France's fourth prime minister in barely a year - and the seventh of Macron's eight-year presidency. Here are all the prime ministers who have served under Mr Macron. Edouard Philippe President Macron's first pick for prime minister - in May 2017 - was Edouard Philippe, a then 46-year-old centre-right conservative. He began his political life as a socialist activist, before switching sides to France's Republicans party. \n                  Emmanuel Macron under pressure to call parliamentary elections after French prime minister resigns\n                 \n                  Police fire tear gas at protesters during day of strikes in France\n                 \n                  The Block Everything movement has mobilised protesters in France - how? And why?\n                 Centrist Mr Macron hoped appointing Mr Philippe would broaden his own political appeal and weaken his opponents before the country's elections, which were just months away at the time. He lasted just over three years before resigning in July 2020 - making him the longest-serving of Mr Macron's PMs. Mr Philippe last year announced that he will run in France's 2027 presidential elections - which Mr Macron cannot run in due to constitutional restrictions. Jean Castex Mr Philippe's exit sparked a government reshuffle and the relatively low-profile Jean Castex - who coordinated France's COVID-19 reopening strategy - was named PM. Mr Castex, aged 55 when he took office, was a career public servant who had worked with multiple governments - but never served as a minister. When Mr Macron's first term was coming to an end in April 2022, Mr Castex said he would resign if the president was re-elected \"as is the tradition\" so a new government could be appointed. He stuck to his word when Mr Macron beat Marine Le Pen that month. Elisabeth Borne  Mr Macron kicked off his second term as president by appointing France's second female prime minister, Elisabeth Borne, in May 2022. Despite Mr Macron's re-election, his centrists lost their majority in parliament and his government was forced into utilising special constitutional powers, along with some political manoeuvring, to pass laws. Ms Borne's resignation in January 2024 was billed by French media as an attempt by Mr Macron to breathe new life into his top table and head off political rivals. Gabriel Attal  Ms Borne was replaced by 34-year-old Gabriel Attal - France's youngest prime minister and the first to be gay. Opinion polls suggested Mr Attal was one of the country's most popular politicians, having made a name for himself as a savvy minister. But his premiership was cut short when he left office in September 2024 - three months after quitting. Read more:Race to rescue hundreds on EverestWhat you need to know about Trump's Gaza plan Mr Attal handed in his resignation after a snap election left the government in limbo in July 2024, but Mr Macron refused to accept it and asked him to remain as head of a caretaker government, which he did until a successor was appointed. Michel Barnier  Former Brexit negotiator Michel Barnier, aged 73, was next up. His appointment angered France's far-right factions with Ms Le Pen stating MPs from her The National Rally party would not participate in a government led by him. Just four months after he was appointed, Mr Barnier lost a vote of no confidence after far-right and left-wing politicians banded together to oust him. Francois Bayrou Francois Bayrou became Mr Macron's seventh PM in December 2024. He gambled that lawmakers would back his view that France should slash public spending to address its growing economic issues - which wound up being a staggering political miscalculation. Mr Bayrou lost a confidence vote by an overwhelming 364-194 last month. Sebastien Lecornu Mr Macron's eighth PM wound up lasting less than a month in the job. Sebastien Lecornu, 39, resigned just hours after he appointed his cabinet - and after political rivals threatened to topple his government. Mr Lecornu's resignation resulted in calls for Mr Macron to be impeached, while French stocks and the euro dropped sharply."
    },
    {
        "title": "Woman who claimed to be Madeleine McCann pretended to be two other missing girls, court hears",
        "description": "A woman who allegedly claimed to be missing toddler Madeleine McCann pretended to be two other girls who had also vanished, a court has heard.",
        "url": "https://news.sky.com/story/woman-who-claimed-to-be-madeleine-mccann-pretended-to-be-two-other-missing-girls-court-hears-13446208",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-julia-wandelt-madeleine-mccann_7044386.jpg?20251006193949",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-06 18:25:05",
        "Headline": "Julia Wandelt, 24, had allegedly called and messaged Kate McCann 60 times in a day.",
        "Content": "A woman who allegedly claimed to be missing toddler Madeleine McCann pretended to be two other girls who had also vanished, a court has heard. Julia Wandelt, 24, allegedly called and messaged Kate McCann, Madeleine's mother, 60 times in a day. The three-year-old disappeared on 3 May 2007 after her parents left her asleep in their holiday apartment in the Portuguese resort of Praia da Luz. In one message Wandelt allegedly said she remembered Mrs McCann on the night of the abduction \"rubbing my head and said I love you and you would find me\". Today, Leicester Crown Court heard that Wandelt did not limit her claims to being Madeleine, but two more girls. The alleged stalker, from Lubin, southwest Poland, is on trial with Karen Spragg, 61, of Caerau Court Road, Caerau, Cardiff. They both deny stalking Kate and Madeleine's father Gerry McCann, causing serious alarm or distress, between June 2022 and February this year. Wandelt contacted a charity called Missing Years Ago, which helps with historic missing persons cases, in January or February 2023, the court heard. \n                  Christian B: Freed Madeleine McCann suspect pleads 'give me back my life' as he tries to confront prosecutor\n                 \n                  Madeleine McCann suspect Christian B celebrates release from prison with burger and cigarette\n                 \n                  Madeleine McCann suspect Christian B released after serving rape sentence\n                 These dates \"coincided with Julia Wandelt's assertion she was Madeleine McCann\". 'I'm not a liar, I'm not crazy' A voicemail left on Mrs McCann's phone was played to the jury, in which Wandelt allegedly said: \"You have nothing to lose, if I'm her then everybody should be okay but if I'm not, as you probably think, then I will leave you alone. \"I know my accent is Polish because I live here, I know I look fat and I know I'm not pretty like Madeleine was in the past, but I know what I know, I know what I remember. \"Please just give me a chance, I'm not a liar, I'm not crazy - I just want to know the truth. Call me or message me or whatever please.\" Prosecutor Michael Duck KC told the jury on Monday: \"In the time between 2022 and her arrest in 2025, Julia Wandelt did not limit her claims to be a missing girl to the tragic case of Madeleine McCann. \"By the latter part of February 2023, she had now asserted she was potentially two different missing girls.\" He added: \"The initial contact with the charity was not to contend that she was Madeleine McCann but rather to suggest that she was another missing girl, Inga Gehricke. \"Inga was a young girl who had disappeared in Germany, but as with Madeleine McCann, Julia Wandelt was precluded from being a realistic candidate by virtue of her age and obvious differences.\" The jury heard that, on a separate occasion, Wandelt claimed to be another missing girl called Acacia Bishop. The trial will continue on 14 October."
    },
    {
        "title": "US Supreme Court rejects appeal request from Ghislaine Maxwell",
        "description": "The US Supreme Court has rejected an appeal request from Ghislaine Maxwell, the imprisoned ex-girlfriend of Jeffrey Epstein, over her criminal conviction.",
        "url": "https://news.sky.com/story/supreme-court-rejects-appeal-request-from-ghislaine-maxwell-13445879",
        "image_url": "https://e3.365dm.com/21/12/1920x1080/skynews-ghislaine-maxwell-trial_5622377.jpg?20211221153823",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-06 09:46:34",
        "Headline": "Maxwell, whose lawyers argued she should not have faced trial because of a deal Epstein struck with prosecutors, was jailed for 20 years in 2022 after being convicted on sex trafficking charges.",
        "Content": "The US Supreme Court has rejected an appeal request from Ghislaine Maxwell, the imprisoned ex-girlfriend of Jeffrey Epstein, over her criminal conviction. Maxwell was sentenced in June 2022 to 20 years in prison after being convicted in December 2021 on sex trafficking charges. Her lawyers argued she never should have been tried or convicted for her role in luring teenage girls to be sexually abused by Epstein. The nine justices declined to take up a case that would have drawn renewed attention to the sexual-abuse saga. US President Donald Trump and his administration, which urged the court not to accept the case, have been condemned for refusing to publicly release all the files from Epstein's case. Maxwell was moved from a low-security federal prison in Florida to a minimum-security prison camp in Texas after she was interviewed by deputy attorney general Todd Blanche in July.  As usual, the justices on the highest court in the US did not explain why they turned down the appeal. Maxwell's lawyer, David Oscar Markus, said in a statement his team was \"deeply disappointed\" by the court's decision. He said \"this fight isn't over\", without explaining what he meant, but insisted there were still \"serious legal and factual issues\" in the case. Maxwell's legal team argued she shouldn't have faced prosecution because of a deal that Epstein, who took his own life while in prison in 2019, made with federal prosecutors in Miami. The 2007 agreement protected his \"potential co-conspirators\" from federal charges anywhere in the country, they said. Maxwell was prosecuted in Manhattan, and the federal appeals court there ruled that the prosecution was proper. A jury found her guilty of sex trafficking a teenage girl, among other charges. Handed immunity for interview Maxwell was given limited immunity when Mr Blanche interviewed her over the summer, allowing her to speak freely without fear of prosecution for anything she said, except in the event of a false statement. She repeatedly denied seeing any sexually inappropriate interactions involving Mr Trump, according to records released in August, meant to distance the president from the disgraced financier.  Epstein was arrested in 2019 on sex trafficking charges and was accused of sexually abusing dozens of teenage girls. A month later, he was found dead in a New York jail cell in what investigators described as a suicide. Survivors speak out  Maxwell's move to a lower security facility was criticised by the family of Epstein abuse survivor Virginia Giuffre, who died in April, and accusers Annie and Maria Farmer. Describing Maxwell as a \"sexual predator who physically assaulted minor children on multiple occasions\", they said in a statement that the transfer \"smacks of a cover-up. The victims deserve better\". Read more on Sky News:Who is in latest Epstein files release?Epstein victims condemn Maxwell treatmentDuchess dropped by charities over Epstein links When it announced in July that no additional documents from the investigation would be released, the US justice department declared that Epstein had killed himself, despite conspiracy theories to the contrary. A \"client list\" that US attorney general Pam Bondi had intimated was on her desk did not actually exist, the department said."
    },
    {
        "title": "Bitcoin's price is at record highs. Is it sustainable?",
        "description": "Bitcoin is trading at all-time highs, surging beyond &#163;93,000 for the first time.",
        "url": "https://news.sky.com/story/bitcoins-price-is-at-record-highs-is-it-sustainable-13446153",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-bitcoin-file_7044296.jpg?20251006172428",
        "type": "US",
        "Author": "Connor Sephton",
        "Date Published": "2025-10-06 16:29:52",
        "Headline": "While some argue Bitcoin remains cheap at £93,000, critics argue it's a house of cards that'll come crashing down. Sky News speaks to those on both sides of the debate.",
        "Content": "\n          News reporter\n              @ConnorSephton\n Bitcoin is trading at all-time highs, surging beyond £93,000 for the first time. The world's biggest cryptocurrency has doubled in value over the past 12 months - buoyed by Donald Trump's return to the White House. However, its 10% surge over the past week is down to one specific factor: the US government shutdown.  Experts have told Sky News that the drama unfolding in Washington is undermining trust in the dollar - and pushing investors to alternatives. Bitwise senior associate Max Shannon said stubbornly high inflation, which erodes spending power, is another factor. Some countries are also increasing their monetary supply - watering down the value of cash in circulation - with government borrowing on the rise. That's led to what's known as a \"debasement trade\", where investors pile their cash into so-called \"hard\" assets like Bitcoin and gold instead. Bitcoin has a fixed supply, meaning no more than 21 million will ever exist. Almost 95% of them are already in circulation, with a small number of coins entering the market every day. Enthusiasts argue this creates a form of scarcity that pushes prices up, as demand for BTC is considerably higher than supply. The latest figures from the Financial Conduct Authority suggest about seven million people in the UK have invested in cryptocurrencies. A single coin can be broken up into 100 million pieces, meaning many have a tiny chunk of Bitcoin in their portfolios. But much of the current enthusiasm for Bitcoin isn't coming from everyday investors - instead, it's institutions leading the charge. Deep-pocketed companies and individuals are buying into exchange-traded funds (ETFs) on Wall Street that track Bitcoin's value - allowing them to gain indirect exposure to BTC's price rises without owning it directly. A staggering $3.5bn (£2.6bn) flowed into these products last week. Samson Mow is the chief executive of JAN3, a company that promotes Bitcoin adoption. He played a role in El Salvador becoming the first country in the world to adopt this cryptocurrency as legal tender. While that experiment didn't achieve widespread success, the Central American nation continues to invest in BTC - with estimated profits of more than £350m as a result. When asked why Bitcoin has hit all-time highs, Mow told Sky News: \"Bitcoin has been a ball pushed underwater for months - this move up was inevitable. Raw demand has simply caught up with the incredibly limited supply.\" He pointed to how 6.7% of Bitcoin's supply is now tied up in ETFs - with Strategy, a company that has the goal of accruing as much BTC as possible, owning a further 3%. This means there's less to go around overall, in what Mow describes as \"the beginning of a massive supply shock\". The entrepreneur believes a single Bitcoin will one day be worth $500,000 (£371,000), meaning the cryptocurrency's total market capitalisation would surge to $10trn (£7.4trn). That's more than double what Nvidia's currently worth as the world's most valuable company, and would make BTC the second-largest asset after gold. Mow shrugged off any suggestion Bitcoin's dramatic price rises aren't sustainable - and insists the only thing that's \"definitely not sustainable\" is BTC's value remaining as low as it is. \"There are only 21 million BTC. Most corporations, billionaires, and even millionaires still have no exposure to Bitcoin. Nation-states have yet to seriously begin accumulation too, but many that we're engaged with are very interested and are looking to move quickly,\" he said. Of course, not everyone shares his enthusiasm. Critics argue Bitcoin lacks intrinsic value, with some claiming it's \"worse than a Ponzi scheme\". David Gerard, a journalist who's deeply sceptical of the crypto industry, told Sky News that Bitcoin suffers from thin trading volumes - resulting in \"unfeasibly volatile prices\" and an \"easily manipulated market\". \"Bitcoin trading is overwhelmingly in unregulated offshore exchanges, so Bitcoin is not a well-functioning market in the sense of, say, stocks,\" he said. \"If investors treat Bitcoin as a well-regulated market, they will get burned. ETFs are regulated instruments, the way Bitcoin's price is set is not.\" Read more from Sky News:Reform UK to accept crypto donationsThe pros and cons of digital IDs  Gerard has railed against BTC for years, and wrote a book condemning the sector in July 2017. But in the eight years since it was published, Bitcoin's price has risen by more than 5,200%. Has this changed his views? \"Everything that's structurally wrong with Bitcoin is still wrong with Bitcoin,\" he said. \"Anyone who sees the big number and thinks 'time to get in' is the sucker the big boys are making their money from. \"You can definitely make money in Bitcoin! But statistically, you're much more likely to be the sucker.\" Some banks, including Morgan Stanley, now encourage their clients to allocate 2% to 4% of their portfolios into crypto - but doing so when prices are so high is risky. While it's possible Bitcoin could keep on rising, this is an asset also known for punishing pullbacks that have seen investors, including people right here in the UK, lose a lot of money. This tends to happen every four years. BTC surged to a record price of $20,000 in December 2017, but plunged by more than 80% a year later - falling below $4,000. Another all-time high of $69,000 then followed in November 2021 - but 12 months on, a spectacular crash dragged it back down to $17,000, a 75% drop. Four years on in October 2025, here we are again: BTC has never been higher. History doesn't always repeat itself - but if past performance is a guide, 2026 could prove challenging."
    },
    {
        "title": "Bitcoin's price is at record highs. Is it sustainable?",
        "description": "Bitcoin is trading at all-time highs, surging beyond &#163;93,000 for the first time.",
        "url": "https://news.sky.com/story/bitcoins-price-is-at-record-highs-is-it-sustainable-13446153",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-bitcoin-file_7044296.jpg?20251006172428",
        "type": "Business",
        "Author": "Connor Sephton",
        "Date Published": "2025-10-06 16:29:52",
        "Headline": "While some argue Bitcoin remains cheap at £93,000, critics argue it's a house of cards that'll come crashing down. Sky News speaks to those on both sides of the debate.",
        "Content": "\n          News reporter\n              @ConnorSephton\n Bitcoin is trading at all-time highs, surging beyond £93,000 for the first time. The world's biggest cryptocurrency has doubled in value over the past 12 months - buoyed by Donald Trump's return to the White House. However, its 10% surge over the past week is down to one specific factor: the US government shutdown.  Experts have told Sky News that the drama unfolding in Washington is undermining trust in the dollar - and pushing investors to alternatives. Bitwise senior associate Max Shannon said stubbornly high inflation, which erodes spending power, is another factor. Some countries are also increasing their monetary supply - watering down the value of cash in circulation - with government borrowing on the rise. That's led to what's known as a \"debasement trade\", where investors pile their cash into so-called \"hard\" assets like Bitcoin and gold instead. Bitcoin has a fixed supply, meaning no more than 21 million will ever exist. Almost 95% of them are already in circulation, with a small number of coins entering the market every day. Enthusiasts argue this creates a form of scarcity that pushes prices up, as demand for BTC is considerably higher than supply. The latest figures from the Financial Conduct Authority suggest about seven million people in the UK have invested in cryptocurrencies. A single coin can be broken up into 100 million pieces, meaning many have a tiny chunk of Bitcoin in their portfolios. But much of the current enthusiasm for Bitcoin isn't coming from everyday investors - instead, it's institutions leading the charge. Deep-pocketed companies and individuals are buying into exchange-traded funds (ETFs) on Wall Street that track Bitcoin's value - allowing them to gain indirect exposure to BTC's price rises without owning it directly. A staggering $3.5bn (£2.6bn) flowed into these products last week. Samson Mow is the chief executive of JAN3, a company that promotes Bitcoin adoption. He played a role in El Salvador becoming the first country in the world to adopt this cryptocurrency as legal tender. While that experiment didn't achieve widespread success, the Central American nation continues to invest in BTC - with estimated profits of more than £350m as a result. When asked why Bitcoin has hit all-time highs, Mow told Sky News: \"Bitcoin has been a ball pushed underwater for months - this move up was inevitable. Raw demand has simply caught up with the incredibly limited supply.\" He pointed to how 6.7% of Bitcoin's supply is now tied up in ETFs - with Strategy, a company that has the goal of accruing as much BTC as possible, owning a further 3%. This means there's less to go around overall, in what Mow describes as \"the beginning of a massive supply shock\". The entrepreneur believes a single Bitcoin will one day be worth $500,000 (£371,000), meaning the cryptocurrency's total market capitalisation would surge to $10trn (£7.4trn). That's more than double what Nvidia's currently worth as the world's most valuable company, and would make BTC the second-largest asset after gold. Mow shrugged off any suggestion Bitcoin's dramatic price rises aren't sustainable - and insists the only thing that's \"definitely not sustainable\" is BTC's value remaining as low as it is. \"There are only 21 million BTC. Most corporations, billionaires, and even millionaires still have no exposure to Bitcoin. Nation-states have yet to seriously begin accumulation too, but many that we're engaged with are very interested and are looking to move quickly,\" he said. Of course, not everyone shares his enthusiasm. Critics argue Bitcoin lacks intrinsic value, with some claiming it's \"worse than a Ponzi scheme\". David Gerard, a journalist who's deeply sceptical of the crypto industry, told Sky News that Bitcoin suffers from thin trading volumes - resulting in \"unfeasibly volatile prices\" and an \"easily manipulated market\". \"Bitcoin trading is overwhelmingly in unregulated offshore exchanges, so Bitcoin is not a well-functioning market in the sense of, say, stocks,\" he said. \"If investors treat Bitcoin as a well-regulated market, they will get burned. ETFs are regulated instruments, the way Bitcoin's price is set is not.\" Read more from Sky News:Reform UK to accept crypto donationsThe pros and cons of digital IDs  Gerard has railed against BTC for years, and wrote a book condemning the sector in July 2017. But in the eight years since it was published, Bitcoin's price has risen by more than 5,200%. Has this changed his views? \"Everything that's structurally wrong with Bitcoin is still wrong with Bitcoin,\" he said. \"Anyone who sees the big number and thinks 'time to get in' is the sucker the big boys are making their money from. \"You can definitely make money in Bitcoin! But statistically, you're much more likely to be the sucker.\" Some banks, including Morgan Stanley, now encourage their clients to allocate 2% to 4% of their portfolios into crypto - but doing so when prices are so high is risky. While it's possible Bitcoin could keep on rising, this is an asset also known for punishing pullbacks that have seen investors, including people right here in the UK, lose a lot of money. This tends to happen every four years. BTC surged to a record price of $20,000 in December 2017, but plunged by more than 80% a year later - falling below $4,000. Another all-time high of $69,000 then followed in November 2021 - but 12 months on, a spectacular crash dragged it back down to $17,000, a 75% drop. Four years on in October 2025, here we are again: BTC has never been higher. History doesn't always repeat itself - but if past performance is a guide, 2026 could prove challenging."
    },
    {
        "title": "Jaguar Land Rover cyber attack: Production shutdown enters sixth week",
        "description": "The production shutdown at cyber attack-hit Jaguar Land Rover (JLR) has entered its sixth week, a week after it had raised hopes of a phased restart \"in the coming days\".",
        "url": "https://news.sky.com/story/jaguar-land-rover-cyber-attack-production-shutdown-enters-sixth-week-13445751",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-range-rover-jlr_6581371.jpg?20240614120027",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-06 05:59:00",
        "Headline": "It was exactly one week ago that JLR said to expect a phased restart of some operations \"in the coming days\" following August's cyber attack.",
        "Content": "The production shutdown at cyber attack-hit Jaguar Land Rover (JLR) has entered its sixth week, a week after it had raised hopes of a phased restart \"in the coming days\". The company reiterated a statement released last Monday when approached by Sky News for an update on its recovery efforts. It also declined to comment on a report by The Times that it was considering a loan scheme, worth up to £500m, to help protect its supply chain from the financial turmoil caused by the hacking. Money latest: Pilot reveals salary ranges JLR's manufacturing operations have been at a standstill since the attack in late August but Sky News understands that testing to make progress on a controlled resumption is continuing. The Wolverhampton engine plant could be the first to stutter back to life. A £1.5bn loan guarantee offered by the government to the company is understood to have not been taken up, given that the carmaker has met its commitments to suppliers that it deals with. \n                  Bitcoin's price is at record highs. Is it sustainable?\n                 \n                  Money blog: Don't buy anything in Amazon's 'Prime Big Deal Days' until you've read this\n                 \n                  Major shake-up of home buying aims to make process cheaper, quicker and easier\n                 Those further down the chain however, complain they are suffering financially and from uncertainty over when deliveries can resume.  The supply chain employs up to 200,000 people directly and indirectly. Industry bodies say job losses are growing and the risk of smaller businesses folding has increased as cash inflows remain on hold and total outflows grow. The main concern for such companies is that those which supply JLR indirectly can access some relief - either from JLR or in the form of an improved government scheme that can be tapped by employers directly.  It could be that without financial aid, JLR's future production recovery risks damage from suppliers going out of business. The government had hoped that JLR would take out a loan with commercial banks under the proposals for state support, saying that the loan guarantee offer also amounted to support for the supply chain. Since that offer was made, the company is widely reported to have agreed a separate £2bn funding facility to maintain its funding buffers. The loss of production alone is costing JLR £5m a day. The company said in its statement, which mirrored last Monday's update: \"As the controlled, phased restart of our operations continues, we are taking further steps towards our recovery and the return to manufacture of our world-class vehicles. \"We have informed colleagues, retailers and suppliers that some sections of our manufacturing operations will resume in the coming days. \"We continue to work around the clock alongside cybersecurity specialists, the UK government's NCSC [National Cyber Security Centre] and law enforcement to ensure our restart is done in a safe and secure manner. \"We would like to thank everyone connected with JLR for their continued patience, understanding and support. We know there is much more to do but the foundational work of our recovery is firmly under way, and we will continue to provide updates as we progress.\" "
    },
    {
        "title": "Aldi and John Lewis partner Virtualstock in sale to US rival",
        "description": "A British e-commerce company which works with retailers including Aldi, Argos and John Lewis has struck a deal to sell itself to an American rival.",
        "url": "https://news.sky.com/story/aldi-and-john-lewis-partner-virtualstock-in-sale-to-us-rival-13446104",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ed-bradley-virtualstock_7044160.jpg?20251006152535",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-06 14:44:33",
        "Headline": "Chaired by Moonpig founder Nick Jenkins, Virtualstock is being sold to American peer Logicbroker in a deal which creates a network of more than 15,000 retail partners globally, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A British e-commerce company which works with retailers including Aldi, Argos and John Lewis has struck a deal to sell itself to an American rival. Sky News understands that Virtualstock, which is chaired by the Moonpig founder Nick Jenkins, is being acquired by private equity-backed Logicbroker in a deal that could be announced as soon as Tuesday. Virtualstock specialises in so-called 'dropshipping', which involves it connecting retailers to suppliers to fulfil orders placed online. Established in 2004, the UK company processes more than eight million orders each year with a gross merchandise value of over £2bn. It also counts B&Q and Currys among the retailers it works with. The venture capital firms Notion Capital and Eight Peaks, as well as Mr Jenkins, are among Virtualstock's shareholders. Logicbroker is backed by K1 Investment Management, a California-based private equity firm. \n                  Bitcoin's price is at record highs. Is it sustainable?\n                 \n                  Jaguar Land Rover cyber attack: Production shutdown enters sixth week\n                 \n                  Money blog: Don't buy anything in Amazon's 'Prime Big Deal Days' until you've read this\n                 The combined business will have a network consisting of more than 15,000 retail and brand partners globally, according to a person close to the deal. The terms of the transaction could not be ascertained on Monday. Virtualstock declined to comment."
    },
    {
        "title": "£200k salaries and why they really make you put your phone on airplane mode: Secrets of a pilot",
        "description": "If you've ever spent your morning commute daydreaming about starting afresh with your career, this feature is for you. Each Monday, the Money blog speaks to someone from a different profession to discover what it's really like. This week we chat to Martin Drake, a retired British Airways Boeing 747 captain and representative of the British Airline Pilots' Association.",
        "url": "https://news.sky.com/story/163200k-salaries-and-why-they-really-make-you-put-your-phone-on-airplane-mode-secrets-of-a-pilot-13445792",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-money-blog-pilot-martin-drake_7043588.jpg?20251006063050",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-06 06:57:00",
        "Headline": "Looking for something new? In our regular careers feature from the Money blog, retired BA pilot Martin Drake tells us what the job is really like.",
        "Content": "If you've ever spent your morning commute daydreaming about starting afresh with your career, this feature is for you. Each Monday, the Money blog speaks to someone from a different profession to discover what it's really like. This week we chat to Martin Drake, a retired British Airways Boeing 747 captain and representative of the British Airline Pilots' Association. Starting salaries are often not as generous as people imagine... with new pilots generally receiving £30,000 to £40,000 a year. If you go on to become a long-haul captain, you would be earning between £125,000 and £200,000, with senior captains on certain airlines making over £200,000. It can be difficult to quantify as pilot salaries often depend on the type of aircraft, and routes flown and the airline you work for. There are no specific loans to fund training, like student loans... There are a handful of airline-funded training schemes, but aspiring pilots largely need to fund their own training and will often have to repay any money they've borrowed once they start work. Don't wait, get on the pension ladder ASAP... Retirement comes round quicker than anyone expects. I got four weeks' holiday split equally between summer and winter periods... As we worked 365 days a year, my company gave us an extra two weeks as time off in lieu for weekends and public holidays. Pilots' working hours are governed by legislation and cover the hours on duty, hours flying and a rest period. This takes into account start time, number of flights, number of time zones crossed and previous rest period, to mention a few. In terms of time in the air, pilots cannot fly for more than 100 hours in a 28-day period. Tap here to read the latest consumer news The biggest change I have seen in my time in the industry has been... deregulation of airspace. At the start of my career, there were more defined routes and set airlines that flew them. Now there are far more routes and more airlines that cover them. While this has some advantages, it can make things more complicated for pilots. \n                  Bitcoin's price is at record highs. Is it sustainable?\n                 \n                  Jaguar Land Rover cyber attack: Production shutdown enters sixth week\n                 \n                  Money blog: Don't buy anything in Amazon's 'Prime Big Deal Days' until you've read this\n                 Passengers should always take the illumination of the seatbelt sign seriously... First of all, it is a legal instruction from the plane's commander that must be obeyed. The seatbelt sign is illuminated at times when there is a greater chance of sudden movements of the aircraft, such as during take-off, landing and turbulence. If you leave your seat while the seatbelt sign is on, you risk injuring yourself or another person, possibly quite seriously. When you don't put your phone on airplane mode... we occasionally get interference on the audio circuits when communicating with air traffic control, like a repetitive dinging noise. This is mainly a nuisance rather than anything more serious, though it's something that pilots would rather not have bothering them while flying a plane. The best time to fly as a passenger is... mid-morning, as you tend to be better rested and more relaxed. One of the best places I have visited for work is... New York, as there is always something going on, no matter the time of day. If you have 24 hours there, my advice would be to research and come up with a plan in advance. Work out where you want to go and have some alternatives just in case plan A doesn't work. Do not try to cram too much in. Travelling is about quality over quantity. Always carry a large square feather pillow in a cotton pillow case... They can squash down to almost nothing in your luggage and they make travelling much more comfortable - and it gives you an extra pillow at your accommodation. The scariest experience I've had was... when I was flying across Greenland. The turbulence was so bad - I couldn't keep the aircraft at its allocated altitude. It was extremely uncomfortable for everyone onboard, with people being jostled in their seats and no doubt a few drinks were spilled. While pilots usually need to keep the plane at a set level of altitude, I was given permission to fly the aircraft at up to 2,000ft above or below the original altitude. This allowed the aircraft to ride the conditions rather than battle through them. Eventually, we managed to pass through the turbulence, but it was certainly not pleasant for anyone on the flight. In the event of an emergency, pilots... tell it like it is. There is no time for secret squirrel codes - anything like that would risk confusion at a critical time. While pilots might use words like mayday or other codes, these are used to communicate with air traffic control. Read more:'I'm a child psychiatrist - here's the biggest source of stress for children''I'm a personal shopper - this is your wardrobe essential and why you should pay at least £100 for it''I won £500k for one race': Inside the life, and finances, of a jockey My favourite route to fly was... London Heathrow to San Diego. It's a great route flying over nearly all of the US. It has an interesting approach to the airport as it is very steep - you essentially fly down past the hill nearby - and the runway is very short. And to add to it, you have to use GPS guidance rather than using the Instrument Landing System - which is automatic - so it is more challenging as a pilot. I also love San Diego as it's a great destination city. It has a lot of variety while being a relatively small city. Whether you like your history, shopping or just want to sit and relax by the water, it's got something for everyone. I'd really recommend it. On the flip side... routes to Middle Eastern destinations could be quite tiring as they involve flying over a lot of different countries, which makes for a complicated airspace over the whole route. You have to change air traffic control units frequently and it's a very busy airspace. It's a bit like driving through something like Spaghetti Junction. The biggest threat to the aviation industry is... crew fatigue. Pilots are flying more and their routes are not always scheduled in ways that allow for the proper amount of rest. As a result, pilots are feeling more fatigued. Fatigued people make mistakes and do not operate to the best of their ability. I am sure we have all been in a situation where we are so tired we can't string a coherent sentence together. We need airlines and our regulator, the Civil Aviation Authority, to listen to pilots and take proper measures to address the level of fatigue among pilots. In terms of AI... some manufacturers are pushing to bring in reduced crew operations. Currently, all flights have at least two pilots operating the aircraft, with more for long-haul flights. This keeps passengers safe, as flight safety is built around the idea that there are two of everything essential, including pilots. This way, you always have a backup should something go wrong. However, some companies want to bring in reduced crew operations, and eventually it would involve replacing the second pilot with some degree of automation and ground support. This goes against basic flight safety principles. Pilots are essential for keeping the aircraft safe, so why would you compromise that by removing a pilot? When there is an unruly passenger on board... crews are trained in dealing with disruptive passengers and they are skilled in de-escalation techniques. This is not only unpleasant for other passengers, but it can also put the safety of the flight at risk. As a last resort the captain can authorise the physical restraint of a disruptive passenger. Airlines carry restraint kits for that precise circumstance, but it's very rare that this is needed. Being a pilot is a very rewarding career... as you help connect the world. Whether that's transporting people to their holiday destination, reconnecting families or carrying parcels across the planet, every pilot has a part to play. It's also allowed me to fly all over the world; there are very few places I have not been to. I cannot remember a time when I was not looking forward to going to work. I would have no hesitation in doing it all again!"
    },
    {
        "title": "Tories to scrap business rates on high street pubs and shops",
        "description": "The Conservatives have promised to abolish business rates for high street shops and pubs if they win the next election.",
        "url": "https://news.sky.com/story/tories-to-scrap-business-rates-on-pubs-and-shops-to-boost-high-street-13445860",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-beer-glass-pint-istock_7024828.jpg?20250919081329",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-06 09:24:00",
        "Headline": "Shadow chancellor Mel Stride says the policy will be paid for by reducing public spending on welfare, the Civil Service and foreign aid.",
        "Content": " The Conservatives have promised to abolish business rates for high street shops and pubs if they win the next election. Unveiling the policy at the party's conference in Manchester, shadow chancellor Sir Mel Stride said the \"burden of Labour's tax rises\" had been \"simply too much to bear\". Politics latest: Shadow farming secretary dons Union Jack blazer The party has said its policy is expected to cost £4bn a year and would benefit about 250,000 businesses in total. Addressing the conference, Sir Mel said businesses needed \"hope\", claiming that 89,000 jobs had been \"destroyed\" in the hospitality sector alone since last year's budget. He criticised a raft of new taxes introduced by Labour, including the tax on farms and the increase in employers' national insurance contributions, and said the result was \"pubs closing, shops sitting empty, high streets hollowed out\". \"Under Labour, many have seen their business rates double,\" he said. \"We need to get business rates down. \"So today I can announce that as a direct result of getting public spending under control, a future Conservative government will completely abolish business rates for shops and pubs on our high streets. \"End of. Finished. Gone.\" Sir Mel sought to portray the Tories as the party of \"fiscal responsibility\" by drawing comparisons with Labour and Reform UK, whom he said were being \"found out\". He accused Rachel Reeves of already having \"blown a vast hole in the public finances\" but that \"yet more tax rises await\" in her budget next month. \"In fact, under Labour, nothing is safe from the taxman - not your job, not your home, not your pension, not your farm, not your business. \"Not even that - what you simply wish to pass on to your own children. You name it, they'll tax it.\" Turning his his fire on Reform UK, he said Nigel Farage was \"marching to the left\" and likened his policies to that of Jeremy Corbyn.  \"When the glitter, the shiny of the sequin dress, the razzmatazz, the spinning plates, the fireworks have faded, you will be left with emptiness. The hollowed out promises that never were. \"Reform are being found out.\" Sir Mel said the policy to slash business rates would be funded by plans to cut £47bn from public spending by restricting welfare payments, shrinking the Civil Service and slashing aid spending. The proposals would see people with \"less severe\" mental health problems offered treatment rather than benefits, with Sir Mel saying this would help them to \"a better life\". \"Where Labour have failed, we will bring down our spiralling welfare bill, completely overhaul our benefits system, and put an end, once and for all, to the human tragedy of millions being consigned to our life on benefits,\" he said. \"That is not just a financial imperative - it is a moral duty.\" Read more:Badenoch praises Thatcher but faces fight with grandeesActive plot against Kemi Badenoch at party conference He also said a future Conservative government would make savings by restricting benefits to UK citizens - although during media interviews on Monday morning he admitted that EU nationals with settled status would also be eligible for welfare. Cracking down on immigration has been a key theme of this conference, with leader Kemi Badenoch announcing plans to leave the European Convention on Human Rights (ECHR) - a treaty Reform has promised to leave due to its belief it can be used to frustrate deportations. Ms Badenoch has also promised to emulate the policies of US Donald Trump by carrying out \"ICE-style\" deportations if her party wins the next election. Ms Badenoch said that shadow Northern Ireland Secretary Alex Burghart would lead a review into a union-wide implementation of leaving the ECHR, so voters have \"a clear, thorough and robust plan, not the vague mush that we see day in, day out from Labour, nor the vacuous posturing that we see day in, day out from Reform\". A Labour Party spokesperson said: \"Mel Stride's supposed-savings plan has already fallen apart hours after being announced. The Conservatives claimed they would state how they'd pay for their policies, yet made a multi-billion-pound pledge to abolish business rates without saying how they'd fund it. \"It's the same old Tories, with the same old policies. They didn't work then and you can't trust them now.\""
    },
    {
        "title": "Apple and Samsung phone users could get compensation",
        "description": "Anyone who bought a Samsung or Apple phone between 2015 and 2024 could be due compensation if a class action suit against technology giant Qualcomm is successful.",
        "url": "https://news.sky.com/story/apple-and-samsung-phone-users-could-get-compensation-13445789",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-iphone-apple_6903125.jpg?20250502024444",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-06 07:08:00",
        "Headline": "Which? is seeking damages for all affected Apple and Samsung smartphones purchased between 1 October 2015 and 9 January 2024 in its class action suit against technology giant Qualcomm. ",
        "Content": "Anyone who bought a Samsung or Apple phone between 2015 and 2024 could be due compensation if a class action suit against technology giant Qualcomm is successful. Consumer group Which? has brought the claim on behalf of around 29 million phone users. Which? alleges Qualcomm breached UK competition law by taking advantage of its dominance in the patent-licensing and chipset markets. It claims this resulted in Qualcomm being able to charge manufacturers such as Apple and Samsung inflated fees for technology licences, which have then been passed on to consumers in the form of higher prices or lower-quality smartphones. Sky News has approached Qualcomm for comment. The company has previously said the case has \"no basis\". The trial will run for five weeks from today at the Competition Appeal Tribunal in London. Read more from Sky News:Healthcare AI firm Heidi valued at £345mWSL Football bosses hire Goldman to kick off financing review \n                  Bitcoin's price is at record highs. Is it sustainable?\n                 \n                  Jaguar Land Rover cyber attack: Production shutdown enters sixth week\n                 \n                  Money blog: Don't buy anything in Amazon's 'Prime Big Deal Days' until you've read this\n                 If Which?'s first trial is successful, there will be a second trial focusing on Qualcomm's conduct and the damage suffered by the class, that Which? has calculated at around £480m. Which? is seeking damages for all affected Apple and Samsung smartphones purchased between 1 October 2015 and 9 January 2024."
    },
    {
        "title": "Waterstones and Gymshark meet Reeves for London IPO pitch",
        "description": "The multinational bookstore chain Waterstones and Gymshark, the athleisure brand, were among the companies which met Rachel Reeves on Monday as she targets a sustained revival of London's listings market.",
        "url": "https://news.sky.com/story/waterstones-and-gymshark-meet-reeves-for-london-ipo-pitch-13445850",
        "image_url": "https://e3.365dm.com/20/05/1920x1080/skynews-book-books-bookshop_5001944.jpg?20200530010121",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-06 09:18:00",
        "Headline": "David Lloyd Leisure, Oaknorth, Starling and True Potential also attended the roundtable convened by Rachel Reeves to promote London as a listing venue, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The multinational bookstore chain Waterstones and Gymshark, the athleisure brand, were among the companies which met Rachel Reeves on Monday as she targets a sustained revival of London's listings market. Sky News has learnt that James Daunt, Waterstones' chief executive, and Ben Francis, founder and CEO of Gymshark, were among more than half a dozen executives who attended a roundtable chaired by the chancellor. Digital banks Oaknorth and Starling; CFC Underwriting; David Lloyd Leisure; and wealth management firm True Potential were also represented at the meeting. Money latest: Pilot reveals salary ranges Sky News revealed at the weekend that Ms Reeves was joined at the meeting by Goldman Sachs' Anthony Gutman, one of the Wall Street firm's top investment bankers, and the City minister, Lucy Rigby. In the invitation, the Treasury said the issue of London's allure as a listing venue was \"a high priority for the government\". \"Ministers are keen to hear your views on the attractiveness of the UK as a listing destination for firms… and on the extensive package of reforms the government has undertaken to boost the competitiveness of UK capital markets.\" \n                  Bitcoin's price is at record highs. Is it sustainable?\n                 \n                  Jaguar Land Rover cyber attack: Production shutdown enters sixth week\n                 \n                  Money blog: Don't buy anything in Amazon's 'Prime Big Deal Days' until you've read this\n                 It was not immediately clear whether the meeting was used by the chancellor to address questions about a possible stamp duty exemption for newly listed shares, which the Financial Times reported last week was under consideration by Treasury officials. The matter was raised during the discussion, according to one person briefed on the talks. London has slipped behind numerous rival financial centres in terms of the proceeds raised from IPOs, while the decision of major companies including AstraZeneca to upgrade their US listings has cast further doubt on the City's relative appeal. A source said the creation of a Listings Taskforce, announced in the chancellor's Mansion House speech earlier this year, would develop the UK's \"already-compelling pitch for listing in London\". The Treasury has been contacted for comment following the meeting's conclusion, while none of the companies contacted by Sky News would comment."
    },
    {
        "title": "PM condemns 'un-British' plans for protests on anniversary of Hamas terror attack",
        "description": "Sir Keir Starmer has condemned plans for pro-Palestine protests two years to the day since the October 7 attacks on Israel, labelling them \"un-British\".",
        "url": "https://news.sky.com/story/pm-condemns-un-british-plans-for-protests-on-anniversary-of-hamas-terror-attack-13446240",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-palestine-protesters_7040785.jpg?20251004040817",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-06 20:02:55",
        "Headline": "UK political leaders have acknowledged rising antisemitism in the UK following the October 7 Hamas terrorist attack on Israel, which triggered the war in Gaza.",
        "Content": " Sir Keir Starmer has condemned plans for pro-Palestine protests two years to the day since the October 7 attacks on Israel, labelling them \"un-British\". Writing in The Times, the prime minister said demonstrations set to take place at several universities today showed a lack of respect for others, claiming previous rallies had been used by some as a \"despicable excuse to attack British Jews\". Follow latest updates on the Israel-Hamas war In a statement marking the second anniversary of the Hamas attack, when 1,200 people were killed and 251 others taken hostage, Sir Keir said the UK's Jewish communities had \"endured rising antisemitism\" since then - including last week's attack on a synagogue in Manchester, in which two worshippers were killed. Adrian Daulby, 53, and Melvin Cravitz, 66, died in the attack at Heaton Park synagogue in Crumpsall on Thursday. 'A stain on who we are' Mr Daulby, a member of the congregation, was shot accidentally when police fired on attacker Jihad al Shamie. The synagogue's rabbi told Sky News it happened as Mr Daulby \"was holding the doors to make sure everyone inside stayed safe\". The family of Mr Cravitz - a worshipper at the synagogue who police originally stated was a security guard - said he would \"do anything to help anyone\". Sir Keir described the attack as \"horrifying\", adding: \"This is a stain on who we are, and this country will always stand tall and united against those who wish harm and hatred upon Jewish communities.\"  Ministers had urged protesters to rethink attending a rally in support of the banned group Palestine Action over the weekend, given its proximity to the synagogue attack. It went ahead, and nearly 500 people were arrested. Police have since been given new powers to impose conditions upon repeat protests. 'A living nightmare' Of October 7, the prime minister said it was \"the worst attack on the Jewish people since the Holocaust\". \"The brutal, cold-blooded torture and murder of Jews in their own homes. \"And the taking of hostages, including British citizens, some of whom remain in Gaza today. \"Since that awful day, so many have endured a living nightmare. When I spoke with some of the families of the British hostages, I promised them in person that we will not cease in our efforts to bring their loved ones home.\"  PM welcomes Trump's peace efforts In his statement, Sir Keir also spoke about the government's priorities in the Middle East, which he said included releasing the hostages, getting more aid into Gaza, and a ceasefire \"that can lead to a lasting and just peace as a step towards a two-state solution\". The government last month recognised Palestine as a state to \"revive the hope of peace\". Read more: What recognising Palestine actually means He said he welcomed US efforts to mediate a deal between Israel and Hamas. Officials from both sides wrapped up initial talks at an Egyptian resort on Monday, regarding the terms proposed by Donald Trump last week. Mr Trump's 20-point peace plan includes the disarmament of Hamas, which would have no role in Gaza's future governance. The US president would lead an interim administration with the help of Sir Tony Blair, among others. He has demanded Israel stop bombing Gaza, though airstrikes have continued. Israel's war on Hamas has now killed more than 67,000 people in Gaza, most of them civilians, according to the Hamas-run health ministry, which does not differentiate between civilians or combatants.  Antisemitism 'a terrible scourge' Conservative leader Kemi Badenoch also criticised pro-Palestine protests in a statement marking the October 7 anniversary, claiming some \"turn into hate marches on our streets\". She said the government's decision to recognise a Palestinian state \"has rewarded the terrorists that perpetrated the October 7 atrocities\". \"Appeasement does not work,\" she said, adding: \"There are still 48 hostages held captive in Gaza. They must come home now.\" Liberal Democrat leader Sir Ed Davey described antisemitism as a \"terrible scourge\" and said: \"We stand in solidarity with British Jews, the people of Israel and Jewish communities around the world against terrorism, and against antisemitism in all its forms.\" Of the peace talks, he added: \"We desperately hope that they will finally see the hostages returned home to their families, a lasting bilateral ceasefire, Hamas out of power in Gaza for good - and set us on the path to a two-state solution that offers both Israelis and Palestinians the peace and security they deserve.\""
    },
    {
        "title": "Half of Tory members do not want Kemi Badenoch to lead party into next election, says poll",
        "description": "Half of all Conservative members think Kemi Badenoch should not lead the party into the next election, according to an exclusive Sky News Tory members poll.",
        "url": "https://news.sky.com/story/half-of-tory-members-do-not-want-kemi-badenoch-to-lead-party-into-next-election-says-poll-13446008",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-kemi-badenoch-conservatives_6980470.jpg?20250802075030",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-10-06 11:41:52",
        "Headline": "Having lost to Ms Badenoch a year ago, Robert Jenrick is now comfortably the members' favourite.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Half of all Conservative members think Kemi Badenoch should not lead the party into the next election, according to an exclusive Sky News Tory members poll. The YouGov poll found 46% think the current Tory leader should stay in place when the country next goes to the polls, while 50% say she should not. Tory members are split as to whether she will make it that far. A total of 49% think she will be out before the election, compared with 47% who think she'll still be in place. Politics latest: Tories pledge to abolish business rates for high street shops and pubs The Tory leader will hope that this week's conference in Manchester will steady her leadership. But asked who they would prefer as leader of the Conservative Party, 46% of Tory members picked Robert Jenrick, comfortably ahead of the 39% who said Ms Badenoch. In all, 11% said neither and 4% don't know. The poll of 652 Conservative members was taken between 26 September and 2 October. \n                  Brutal findings of new poll in line with views of gloomy Tory MPs\n                 \n                  Robert Jenrick announces plans to abolish Sentencing Council amid 'two-tier justice' row\n                 \n                  Tories to scrap business rates on high street pubs and shops\n                 Having lost to Ms Badenoch a year ago, Mr Jenrick is now comfortably the members' favourite, and would beat Boris Johnson, James Cleverly and Priti Patel. Badenoch would narrowly beat Johnson if they went head to head. The poll also asked whether members had a favourable or unfavourable opinion of leaders. It showed 70% had a favourable opinion of Badenoch and 29% holding an unfavourable view. While 73% had a favourable opinion of Jenrick and 20% had an unfavourable opinion. Read more:Brutal findings of new poll in line with views of gloomy Tory MPsBadenoch praises Thatcher but faces fight with grandeesActive plot against Kemi Badenoch at party conference Ms Badenoch rejects any kind of electoral pact with Reform UK at the next election, but this is out of step with Tory members. The poll finds 64% support an electoral pact, meaning Reform and the Tories would not stand candidates against each other in target seats, while 31% do not. Almost half of Tory members - 46% - would support a full blown merger with Reform UK, against 48% who would oppose a merger. Party members are very clear that in a hung parliament, they would not want to see Tory MPs putting a Labour prime minister back in Number 10. Tory members oppose a coalition with Labour by 93% to 6%. However 73% would welcome a coalition with Reform UK in a hung parliament, with 25% against."
    },
    {
        "title": "Robert Jenrick announces plans to abolish Sentencing Council amid 'two-tier justice' row",
        "description": "The Conservatives have announced they will abolish the independent body that advises courts on sentences in a bid to stop what it has called \"two-tier justice\".",
        "url": "https://news.sky.com/story/robert-jenrick-announces-plans-to-abolish-sentencing-council-amid-two-tier-justice-row-13446039",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-robert-jenrick-conservative_7044130.jpg?20251006143240",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-06 12:21:21",
        "Headline": "Shadow justice secretary Robert Jenrick says ministers will instead issue advice to courts on sentencing instead of an \"unaccountable quango\".",
        "Content": "The Conservatives have announced they will abolish the independent body that advises courts on sentences in a bid to stop what it has called \"two-tier justice\". Shadow justice secretary Robert Jenrick said that ministers, rather than the Sentencing Council, would be responsible for setting sentencing policy if the Tories return to power at the next election. Speaking while the Conservative Party conference was under way in Manchester, Mr Jenrick branded the council \"not fit for purpose\". \"Never again can the British people face the prospect of two-tier justice,\" he continued. \"We are slipping into a two-tier nightmare under Keir Starmer. All too frequently the law is not applied equally. No more - every single person in this country must be treated exactly the same, regardless of their background.\" Politics latest: Tories pledge to abolish business rates for high street shops and pubs The Sentencing Council, which sets out guidance for courts in England and Wales, found itself at the centre of controversy earlier this year after it advised judges to factor in the backgrounds of offenders as part of the sentencing process. \n                  Brutal findings of new poll in line with views of gloomy Tory MPs\n                 \n                  Half of Tory members do not want Kemi Badenoch to lead party into next election, says poll\n                 \n                  Tories to scrap business rates on high street pubs and shops\n                 The proposed guidelines - which never came into force as they were suspended - said courts should \"normally consider\" ordering a pre-sentence report (PSR) for criminals if they were from an ethnic, cultural minority or faith minority community, transgender, under the age of 25, pregnant or female. PSRs are taken into account when considering a criminal's sentence. The council said at the time that the recommendation was aimed at reflecting disparities in sentencing outcomes. According to the most recent government statistics, since 2018 white defendants are more likely to have a shorter jail sentence than any other ethnic group. However, the Tories called it an example of \"two-tier\" justice, arguing it was biased against Christians and straight white men.  Shabana Mahmood, the current home secretary who was justice secretary at the time, also expressed her \"displeasure\" at the body's recommendations, arguing that \"as someone who is from an ethnic minority background myself, I do not stand for any differential treatment before the law\". Following the row, it was confirmed that the justice secretary - now David Lammy - will be given the power to veto any changes to sentencing guidelines proposed by the council. It means the Sentencing Council will be unable to issue new guidelines without the explicit approval of the justice secretary or the lady chief justice, who is head of the judiciary. But Mr Jenrick wants to go further by abolishing the council altogether. \"The public are sick of voting for tougher sentences and getting the opposite,\" he said. \"So in future the justice secretary, accountable to parliament, will be responsible for setting sentencing policy. No longer will an unaccountable quango be able to subvert the will of the British people for criminals to be properly punished.\" Read more:Badenoch praises Thatcher but faces fight with grandeesActive plot against Badenoch at party conference A Labour spokesperson said: \"This is yet more rank hypocrisy from a Conservative Party that wrecked our justice system and left Labour to pick up the pieces. \"After 14 years of Tory neglect, our prisons were left bursting at the seams because they didn't build enough prisons, our courts overwhelmed, and public confidence in the justice system was left shattered. \"The Conservatives backed the proposed changes to pre-sentencing reports when they were announced and did nothing to stop them when they were in government. Labour took action the moment we uncovered their mistake. \"This is just another cynical gimmick from Jenrick, a man who constantly undermines the independence of the judiciary just to further his own career.\""
    },
    {
        "title": "Badenoch didn't 'have enough confidence' but now 'blossoming', says shadow cabinet minister",
        "description": "Kemi Badenoch did not have \"enough confidence\" as Tory leader to begin with, but is now \"blossoming\", a shadow cabinet minister has said.\n",
        "url": "https://news.sky.com/story/badenoch-didnt-have-enough-confidence-but-now-blossoming-says-shadow-cabinet-minister-13446217",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-victoria-atkins-beth-rigby_7044080.jpg?20251006135143",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-06 18:52:10",
        "Headline": "Victoria Atkins also spoke about her \"sadness\" at the Tories' plan to leave the EHCR but said it was the right thing to \"deal with the politics of today\". ",
        "Content": "Kemi Badenoch did not have \"enough confidence\" as Tory leader to begin with, but is now \"blossoming\", a shadow cabinet minister has said.\n Speaking from the Conservative Party Conference in Manchester, Victoria Atkins told the Sky News Electoral Dysfunction podcast with political editor Beth Rigby that Ms Badenoch was now \"going with her instinct\". Asked what Ms Badenoch's strengths and weaknesses are, the shadow environment secretary said: \"She doesn't have enough confidence in herself, in that I know that she has been really wanting to listen and absorb this year. \"And I think this conference we're seeing her having that confidence, having been in that role for a while now, she's got that confidence and she's going with her instinct, and I think that's really exciting.\" She added: \"We are seeing Kemi I think really blossoming and coming into her own on this.\" Ms Badenoch has faced questions over her leadership as the Tories continue to languish behind Labour and Reform in the polls, following their worst-ever general election defeat last year. An exclusive poll of Tory members for Sky News found half of them think she should not lead the party into the next election. \n                  Wargame Day: Is the UK ready for a real Russian attack?\n                 \n                  Sarah Mullally: The former nurse chosen to lead the Church of England\n                 \n                  Why is Keir Starmer obsessed with Nigel Farage? \n                 Elsewhere during the podcast, Ms Atkins said she had \"sorrow\" about her boss's plans for the UK to leave the European Convention on Human Rights (ECHR) but it was necessary to \"deal with real life\". The ECHR issue has long divided the party, with moderates from the \"one nation\" wing typically opposed to the idea, while others on the right of the party think it is necessary to get a grip on illegal immigration. Ms Atkins defines herself as a \"one nation\" Conservative. However, unlike fellow one-nation Tory Robert Buckland, a former justice secretary and Lord Chancellor, she backs the plans. \"I share his sorrow but I also have to deal with the politics of today,\" she said. \"We see this disenfranchisement between the law as it is now interpreted and what people want to see from the government of the day and also the protection of our borders. \"And I think that the sadness actually is the way that the court and indeed, judgments flowing from the courtroom, the European Court, have been used. \"That is a great sadness to me, but we have to deal with real life.\""
    },
    {
        "title": "Kemi Badenoch's biggest weakness",
        "description": "<a href='https://podcasts.apple.com/us/podcast/electoral-dysfunction/id1613562765' target='_blank'> 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/kemi-badenochs-biggest-weakness-13446201",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-electoral-dysfunction_7039456.png?20251002190858",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-06 18:10:47",
        "Headline": "No subtitle found",
        "Content": " 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Beth's at the Conservative party conference - talking to the shadow environment secretary Victoria Atkins.  She says that Kemi Badenoch has shown resilience and character in her first year as party leader- but it's taken time to find confidence and her 11 months of \"listening\" and \"absorbing\" has come with \"political knocks\". She acknowledges that she is sorry about the Tory proposal to leave the ECHR - but says politicians have to deal with the politics of today. She also reveals how her parents met at a Tory conference and which politician makes her shout at the TV. Remember, you can also watch Beth Rigby, Harriet Harman and Ruth Davidson on YouTube. Fill in our survey here. "
    },
    {
        "title": "Brutal findings of new poll in line with views of gloomy Tory MPs",
        "description": "The brutal findings of the YouGov poll suggesting Conservative members want leader Kemi Badenoch out and a pact with Nigel Farage confirm what the party's gloomy MPs are telling Sky News here in Manchester.",
        "url": "https://news.sky.com/story/brutal-findings-of-new-poll-in-line-with-views-of-gloomy-tory-mps-13446159",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kemi-badenoch-conservative_7044291.jpg?20251006172142",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-10-06 16:42:01",
        "Headline": "Senior Tory MPs are highlighting the threat from Reform in Essex, where they could face a potential wipeout because of the advance of Nigel Farage's party.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  The brutal findings of the YouGov poll suggesting Conservative members want leader Kemi Badenoch out and a pact with Nigel Farage confirm what the party's gloomy MPs are telling Sky News here in Manchester. One MP, whose majority slumped from nearly 18,000 to less than 1,500 last year, said a deal with Reform UK was essential to prevent Labour clinging to power at the next general election with support of the Liberal Democrats, nationalists and Greens. Another veteran MP predicted that in the former Conservative stronghold of Essex, where Reform UK won two seats last year, the Tories could lose every seat in the county - including Ms Badenoch's North West Essex - because of a surge in support for Mr Farage's party. Politics Live: Tories pledge to abolish business rates for high street shops and pubs A major reason why there is strong support among MPs and activists in Manchester for Robert Jenrick to replace Ms Badenoch as leader is because he favours a deal with Reform UK. Mr Jenrick has opened a potential rift with the embattled Tory leader by refusing to rule out a pact with Mr Farage and Reform UK, while Ms Badenoch has repeatedly rejected calls to \"unite the right\" by working with Mr Farage to defeat Labour. Questioned in Manchester by Sky News deputy political editor Sam Coates, who asked: \"You'd never support a pact?\" Mr Jenrick replied: \"That is not our priority. That's not a priority. \n                  Robert Jenrick announces plans to abolish Sentencing Council amid 'two-tier justice' row\n                 \n                  Half of Tory members do not want Kemi Badenoch to lead party into next election, says poll\n                 \n                  Tories to scrap business rates on high street pubs and shops\n                 \"What I want to focus on now is just focus on changing the Tory party. Changing so we can win back the support we lost at the general election.\" Read more: Half of Tory members don't want Badenoch to lead party into next election - poll Former Tory cabinet minister Jacob Rees-Mogg, defeated in last year's election, is another senior Conservative who argues that cooperation between the Tories and Reform UK is essential. \"On the right, we have a group of people on two different parties who agree on the overwhelming majority of policies,\" he has said previously. \"I think we need to work together.\" Senior Tory MPs are highlighting the threat from Reform UK in Essex, where all the county's seats were won by the Conservatives with more than 50% of the vote in 2019, but they could now face a potential wipeout because of the advance of Mr Farage's party. Last year, the Tories were reduced to 10 seats in the county, with much smaller majorities. Reform UK won two seats, Mr Farage in Clacton and James McMurdock in Basildon South and Thurrock South. Labour won five and the Liberal Democrats one. An Essex wipeout would not only rob the Conservatives of Ms Badenoch in North West Essex, but also shadow cabinet members Sir James Cleverly (Braintree), Alex Burghart (Brentwood and Ongar) and Dame Priti Patel (Witham), chief whip Rebecca Harris (Castle Point) and stalwarts Sir Bernard Jenkin (Harwich and North Essex), Sir John Whittingdale (Maldon) and Mark Francois (Rayleigh and Wickford). Despite the gloom of the Sky News poll, an optimistic message to party members was delivered by the Tory MPs' shop steward Bob Blackman, at a 1922 Committee and ConservativeHome reception in Manchester, attended by Ms Badenoch. Mr Blackman, chairman of the '22, recalled that when Margaret Thatcher was first elected party leader in 1975 she struggled at first and was patronised by not just Labour prime ministers but also snobs inside the Tory party, but then went on to win the 1979 general election."
    },
    {
        "title": "Senior politicians pay tribute to Tory supporter and countryside campaigner Dame Jilly Cooper",
        "description": "Prime ministers past and present have led tributes to Dame Jilly Cooper, a lifelong Conservative and champion of the countryside.",
        "url": "https://news.sky.com/story/senior-politicians-pay-tribute-to-tory-supporter-and-countryside-campaigner-dame-jilly-cooper-13446045",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-jilly-cooper-obit_7043843.jpg?20251006105131",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-10-06 12:33:45",
        "Headline": "The author's biggest fan among senior politicians was Rishi Sunak, who admitted two years ago when he was prime minister that he was a fan of her novels.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Prime ministers past and present have led tributes to Dame Jilly Cooper, a lifelong Conservative and champion of the countryside. The 88-year-old author died on Sunday morning following a fall. Asked for Sir Keir Starmer's response to her death, a Downing Street spokesperson said: \"The prime minister sends his condolences to her family.\" But her biggest fan among senior politicians was Rishi Sunak, who admitted two years ago when he was PM that he was a fan of her racy novels. \"Sad to hear of the passing of Dame Jilly Cooper, a storyteller whose wit and love or character brought joy to millions,\" he wrote on X. \"My thoughts are with her family and fellow readers.\" In an interview in May 2023, Mr Sunak ranked her classic Rivals as one of his all-time favourite novels. \n                  PM condemns 'un-British' plans for protests on anniversary of Hamas terror attack\n                 \n                  Politics latest: Polls 'are hard' for Kemi Badenoch, says shadow cabinet minister  \n                 \n                  Half of Tory members do not want Kemi Badenoch to lead party into next election, says poll\n                 That prompted a question in a TV interview about whether he was \"really into\" her books. \"Yes, that is true,\" he said, blushing. \"Riders, Rivals, Polo, The Man Who Made Husbands Jealous, Appassionata,\" he said. \"She's done a lot of different books, but that's the set of books that I like.\" Read more from Sky News:French PM quits less than 24 hours after forming cabinetEx-England rugby captain has motor neurone disease Besides being a Conservative Party supporter, Cooper campaigned with the Trust for Nature Conservation for the preservation of limestone grasslands in Gloucestershire. And at the Tory conference in Manchester, shadow environment secretary Victoria Atkins paid tribute to her campaigning for the countryside. \"I never had the chance to meet her, but - my goodness me - did she bring joy and fun and a little bit of raciness to our lives,\" she said. \"Anyone who saw her, anyone who's read her books, she was absolutely about giving fun and joy to her readers. \"But also she was absolutely grounded in the countryside. She's one of the people, if I had a sort of celebrity dinner, she'd be on my invitation list.\""
    },
    {
        "title": "Renewable energy produces more electricity than coal for the first time, experts say",
        "description": "For the first time in history, renewable energy has produced more of the world's electricity than coal, according to a new analysis of global energy trends.",
        "url": "https://news.sky.com/story/renewable-energy-produces-more-electricity-than-coal-for-the-first-time-experts-say-13446220",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-solar-panel-roof-housebuilding_6929219.jpg?20250527223901",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-10-06 19:07:54",
        "Headline": "Solar and wind are now growing fast enough to not only meet the world's growing appetite for electricity, but to outstrip it.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n For the first time in history, renewable energy has produced more of the world's electricity than coal, according to a new analysis of global energy trends. In the first half of 2025, solar and wind energy outstripped growth in global electricity demand and led to a small but significant reduction in the use of fossil fuels compared to the year before, clean energy analysts Ember said. The finding coincides with the International Energy Agency (IEA) forecasting a doubling of global clean energy capacity by 2030. \"We are seeing the first signs of a crucial turning point,\" said Ember's electricity analyst, Malgorzata Wiatros-Motyka. Deployment of renewable generation, particularly in developing economies, has outpaced new fossil fuel power in recent years. 'The beginning of a shift' But many experts warned the increase would not be enough to meet rising global demand for electricity, let alone start to reduce emissions and therefore combat global warming. Ms Watros-Motyka said: \"Solar and wind are now growing fast enough to not only meet the world's growing appetite for electricity - this marks the beginning of a shift where clean power is keeping pace with demand growth.\" The IEA analysis of renewable energy trends predicts global renewable generation will increase by 4,600 gigawatts by 2030 - a growth equivalent, it says, to the current total power generation of China, the EU, and Japan combined. IEA executive director Fatih Birol said solar photovoltaic, or solar PV (the technology that converts sunlight into electricity using solar panels made up of photovoltaic cells), \"is on course to account for some 80% of the increase in the world's renewable capacity over the next five years\". \"In addition to growth in established markets, solar is set to surge in economies such as Saudi Arabia, Pakistan and several Southeast Asian countries,\" he added.  The trend is not even, however. Ember's analysis found renewable generation outstripped coal in both China and India in the first half of 2025, but in the US and Europe, the reverse was true. Rocketing electricity demand in the US, driven in large part by electricity for AI and datacentres, saw more reliance on coal and gas generation, despite an increase in renewable electricity capacity. In the EU, lower output from wind farms and hydroelectric plants led to a higher reliance on fossil fuels. The reports highlight the challenges of switching economies from fossil fuel-powered electricity grids to those dominated by renewables. They also don't rule out future shifts in fossil fuel emissions if demand accelerates or supply chains for renewables are constrained in some countries. The growth of offshore wind for example, is now forecast to slow due to policy changes in places like the US and materials costs in Europe, according to the IEA. Read more on Sky News:Alarm over Tory climate plansChanges to eco rules for new homesCan Arctic be refreezed?  However, the growth in green power also reflects potential opportunities missed by countries like the US, and right-wing politicians in Europe, who reject renewable electricity on ideological or cost grounds. In nearly all markets, the agency concludes, solar panels are the cheapest and easiest-to-install form of generation. US President Donald Trump, who recently told the United Nations climate change was the \"greatest con job\", might want to study the numbers, too. His administration has committed to increasing US oil and gas exports and abandoning support for renewable energy. According to a separate analysis by Ember, the US sold around $80bn (£59bn) in oil and gas in July, while China exported $120bn (£89bn)-worth of green technology in the same month."
    },
    {
        "title": "Bitcoin's price is at record highs. Is it sustainable?",
        "description": "Bitcoin is trading at all-time highs, surging beyond &#163;93,000 for the first time.",
        "url": "https://news.sky.com/story/bitcoins-price-is-at-record-highs-is-it-sustainable-13446153",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-bitcoin-file_7044296.jpg?20251006172428",
        "type": "Technology",
        "Author": "Connor Sephton",
        "Date Published": "2025-10-06 16:29:52",
        "Headline": "While some argue Bitcoin remains cheap at £93,000, critics argue it's a house of cards that'll come crashing down. Sky News speaks to those on both sides of the debate.",
        "Content": "\n          News reporter\n              @ConnorSephton\n Bitcoin is trading at all-time highs, surging beyond £93,000 for the first time. The world's biggest cryptocurrency has doubled in value over the past 12 months - buoyed by Donald Trump's return to the White House. However, its 10% surge over the past week is down to one specific factor: the US government shutdown.  Experts have told Sky News that the drama unfolding in Washington is undermining trust in the dollar - and pushing investors to alternatives. Bitwise senior associate Max Shannon said stubbornly high inflation, which erodes spending power, is another factor. Some countries are also increasing their monetary supply - watering down the value of cash in circulation - with government borrowing on the rise. That's led to what's known as a \"debasement trade\", where investors pile their cash into so-called \"hard\" assets like Bitcoin and gold instead. Bitcoin has a fixed supply, meaning no more than 21 million will ever exist. Almost 95% of them are already in circulation, with a small number of coins entering the market every day. Enthusiasts argue this creates a form of scarcity that pushes prices up, as demand for BTC is considerably higher than supply. The latest figures from the Financial Conduct Authority suggest about seven million people in the UK have invested in cryptocurrencies. A single coin can be broken up into 100 million pieces, meaning many have a tiny chunk of Bitcoin in their portfolios. But much of the current enthusiasm for Bitcoin isn't coming from everyday investors - instead, it's institutions leading the charge. Deep-pocketed companies and individuals are buying into exchange-traded funds (ETFs) on Wall Street that track Bitcoin's value - allowing them to gain indirect exposure to BTC's price rises without owning it directly. A staggering $3.5bn (£2.6bn) flowed into these products last week. Samson Mow is the chief executive of JAN3, a company that promotes Bitcoin adoption. He played a role in El Salvador becoming the first country in the world to adopt this cryptocurrency as legal tender. While that experiment didn't achieve widespread success, the Central American nation continues to invest in BTC - with estimated profits of more than £350m as a result. When asked why Bitcoin has hit all-time highs, Mow told Sky News: \"Bitcoin has been a ball pushed underwater for months - this move up was inevitable. Raw demand has simply caught up with the incredibly limited supply.\" He pointed to how 6.7% of Bitcoin's supply is now tied up in ETFs - with Strategy, a company that has the goal of accruing as much BTC as possible, owning a further 3%. This means there's less to go around overall, in what Mow describes as \"the beginning of a massive supply shock\". The entrepreneur believes a single Bitcoin will one day be worth $500,000 (£371,000), meaning the cryptocurrency's total market capitalisation would surge to $10trn (£7.4trn). That's more than double what Nvidia's currently worth as the world's most valuable company, and would make BTC the second-largest asset after gold. Mow shrugged off any suggestion Bitcoin's dramatic price rises aren't sustainable - and insists the only thing that's \"definitely not sustainable\" is BTC's value remaining as low as it is. \"There are only 21 million BTC. Most corporations, billionaires, and even millionaires still have no exposure to Bitcoin. Nation-states have yet to seriously begin accumulation too, but many that we're engaged with are very interested and are looking to move quickly,\" he said. Of course, not everyone shares his enthusiasm. Critics argue Bitcoin lacks intrinsic value, with some claiming it's \"worse than a Ponzi scheme\". David Gerard, a journalist who's deeply sceptical of the crypto industry, told Sky News that Bitcoin suffers from thin trading volumes - resulting in \"unfeasibly volatile prices\" and an \"easily manipulated market\". \"Bitcoin trading is overwhelmingly in unregulated offshore exchanges, so Bitcoin is not a well-functioning market in the sense of, say, stocks,\" he said. \"If investors treat Bitcoin as a well-regulated market, they will get burned. ETFs are regulated instruments, the way Bitcoin's price is set is not.\" Read more from Sky News:Reform UK to accept crypto donationsThe pros and cons of digital IDs  Gerard has railed against BTC for years, and wrote a book condemning the sector in July 2017. But in the eight years since it was published, Bitcoin's price has risen by more than 5,200%. Has this changed his views? \"Everything that's structurally wrong with Bitcoin is still wrong with Bitcoin,\" he said. \"Anyone who sees the big number and thinks 'time to get in' is the sucker the big boys are making their money from. \"You can definitely make money in Bitcoin! But statistically, you're much more likely to be the sucker.\" Some banks, including Morgan Stanley, now encourage their clients to allocate 2% to 4% of their portfolios into crypto - but doing so when prices are so high is risky. While it's possible Bitcoin could keep on rising, this is an asset also known for punishing pullbacks that have seen investors, including people right here in the UK, lose a lot of money. This tends to happen every four years. BTC surged to a record price of $20,000 in December 2017, but plunged by more than 80% a year later - falling below $4,000. Another all-time high of $69,000 then followed in November 2021 - but 12 months on, a spectacular crash dragged it back down to $17,000, a 75% drop. Four years on in October 2025, here we are again: BTC has never been higher. History doesn't always repeat itself - but if past performance is a guide, 2026 could prove challenging."
    },
    {
        "title": "Government offers trainee teachers up to £31,000 tax-free incentives to boost recruitment",
        "description": "The government has announced new financial incentives worth up to &#163;31,000 tax-free for trainee teachers in maths, physics, chemistry and computing, in an effort to tackle long-standing recruitment challenges in England's schools.",
        "url": "https://news.sky.com/story/government-offers-trainee-teachers-up-to-16331000-tax-free-incentives-to-boost-recruitment-13446276",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/school-students-teachers_6967281.jpg?20250717190116",
        "type": "Technology",
        "Author": "Anjum Peerbacos",
        "Date Published": "2025-10-06 22:07:13",
        "Headline": "The Department for Education wants to attract more people with science and engineering backgrounds into teaching, all while grappling with a major recruitment and retention challenge.",
        "Content": "\n          Education reporter\n       The government has announced new financial incentives worth up to £31,000 tax-free for trainee teachers in maths, physics, chemistry and computing, in an effort to tackle long-standing recruitment challenges in England's schools. From next year, bursaries and scholarships will be available to those training through both school-based and university routes, with the Department for Education hoping to attract more people with science and engineering backgrounds into the classroom. Trainees in further education will also be eligible for up to £31,000 in shortage subjects, £10,000 for English, and £15,000 for those training to work with children who have special educational needs and disabilities (SEND). For the first time, Postgraduate Teaching Apprenticeships will receive the same level of funding as other training routes, with schools able to claim up to £29,000 to train apprentices in maths, chemistry, physics, and computing. These subjects have faced persistent teacher shortages in recent years. Recruitment data shows the Department for Education filled just 62% of its target for secondary trainees last year, though projections from the National Foundation for Educational Research (NFER) suggest this could rise to 85% for 2025/26. Jack Worth, education workforce Lead at NFER, said bursaries play a crucial role in boosting recruitment. \"Our research has shown bursaries are very effective for recruiting more teachers and retaining additional teachers long-term, particularly in shortage subjects such as physics and maths,\" he said. \"This announcement could go a long way towards helping the government meet its pledge to recruit and retain 6,500 additional teachers.\"  Teaching is 'highly stressful' But while the new incentives may bring more trainees into the profession, teachers say retention remains the real challenge. Amanda, a science coordinator at a secondary school in north London, told Sky News: \"The tax-free incentive is certainly a massive pull factor to attract teacher trainees with science or engineering backgrounds, but to keep them, that's a very different story. \"Although we have many teacher training routes to cater for different preferences, that doesn't change the fact that teaching is a highly stressful vocation. \"And expectations have increased massively over the last ten years; many social and economic issues have fallen on teachers' shoulders. \"Of course we should care about children's wellbeing, but the government needs to acknowledge that our roles have become much more demanding without the equivalent investment.\" Amanda added: \"Workload and working hours have consistently been a major issue, and with less funding and rising costs, it's becoming harder for schools to retain teachers, especially those from science or engineering backgrounds.\" Read more from Sky News:PM condemns 'un-British' protest plansWorld hits 'crucial turning point' in renewables use The Institute of Physics has warned that one in four secondary schools still has no specialist physics teacher, underlining the scale of the problem. The Department for Education says there's progress and has reported a 33% rise in people training to teach physics and a 42% increase in computing trainees this year. Yet, as teachers like Amanda point out, financial incentives may help bring people in, but culture, workload, and pay are what will keep them there. Education Secretary Bridget Phillipson said the government is \"determined to bring more brilliant teachers into classrooms\". She said: \"We need talented people with the passion and drive to inspire the next generation, making school a place pupils want to be, boosting outcomes and transforming lives. \"Inspirational teachers changed my life and change the lives of millions of children every day. \"This government is determined to have more brilliant teachers, in more schools, improving the life chances of more young people.\""
    },
    {
        "title": "Almost 15 million teens around the world using vapes, WHO report says",
        "description": "More than 100 million people around the world are using e-cigarettes, according to \"alarming\" estimates from the World Health Organisation, with almost 15 million teenagers believed to vape.",
        "url": "https://news.sky.com/story/almost-15-million-teens-around-the-world-using-vapes-who-report-says-13446171",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-istock-vapes-vaping_6931743.jpg?20250531065528",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-06 17:06:46",
        "Headline": "The report marks the first time the WHO has tracked e-cigarette usage, and found that \"adolescents are generally using the products at a higher rate than adults\".",
        "Content": "More than 100 million people around the world are using e-cigarettes, according to \"alarming\" estimates from the World Health Organisation, with almost 15 million teenagers believed to vape. In its report - the health body's first ever tracking of the use of vapes and other electronic smoking devices - the WHO said that figure includes at least 86 million adults, mostly from high-income countries. But the report said 14.7 million of the total believed to use e-cigarettes were reportedly children aged between 13 and 15 years old. It added that vaping's prevalence among teens globally was 7.2%. In contrast, while around 20.4 million adolescents reported smoking cigarettes, it had a prevalence of 5.1%. The report's authors added that, based on available data for 63 countries - including in the UK - rates of vaping for 13- to 15-year-olds are \"on average nine times higher than the prevalence among adults\", adding that \"adolescents are generally using the products at a higher rate than adults\". They also said: \"Given that no country with a recent school-based survey of this age group found current use of e-cigarettes at zero, it is reasonable to assume the WHO estimate is an undercount. \"This finding is not surprising considering that the industry is aggressively targeting children and young people, including through new digital channels that are underregulated.\" \n                  What is motor neurone disease and how is it linked to sport?\n                 \n                  Expert 'kept awake at night' over fear of deadly brain disease passed on in transfusions\n                 \n                  Two species of disease-carrying mosquitoes found in UK\n                 Read more on vaping:Study links children vaping to host of health issuesDoctor: Children so addicted they can't sleep without vapes Etienne Krug, director of the WHO's Health Determinants, Promotion and Prevention department, said in a statement that \"e-cigarettes are fuelling a new wave of nicotine addiction\". \"They are marketed as harm reduction,\" she added, \"but, in reality, are hooking kids on nicotine earlier and risk undermining decades of progress.\" WHO director-general Dr Tedros Adhanom Ghebreyesus also said that while millions are \"stopping, or not taking up tobacco use... the tobacco industry is fighting back with new nicotine products, aggressively targeting young people\". He called on governments to \"act faster and stronger in implementing proven tobacco control policies\". Read more from Sky News:Security guard reveals new details of synagogue attackFrench PM resigns less than 24 hours after cabinet formed The UK introduced a ban on selling and supplying single-use vapes in June this year, designed to tackle waste and the impact of vapes on the environment. While there is no further ban on vapes in the works, the government's Tobacco and Vapes Bill, which is currently in the committee stage at the House of Lords, includes powers to potentially restrict the packaging, marketing and flavours of e-cigarettes."
    },
    {
        "title": " Author Dame Jilly Cooper dies after fall",
        "description": "Author Dame Jilly Cooper has died, her publisher has said.",
        "url": "https://news.sky.com/story/author-jilly-cooper-has-died-13445808",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-jilly-cooper-obit_7043832.jpg?20251006105340",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-06 07:59:00",
        "Headline": "The best-selling author was known for raunchy novels including Riders and Polo, which dissected the lives and escapades of upper-class social circles. Another hit novel, Rivals, was recently adapted into a TV series.",
        "Content": " Author Dame Jilly Cooper has died, her publisher has said. \"It is with great sadness that we announce the death of Dame Jilly Cooper, DBE who died on Sunday morning, after a fall, at the age of 88,\" a statement said. The Queen paid tribute to Dame Jilly, calling her a \"legend\" who was a \"wonderfully witty and compassionate friend\". The best-selling author was renowned for her raunchy, so-called \"bonkbuster\" novels, which portrayed the scandals and sex lives of wealthy country social circles, including Rivals, Riders and Polo. She was praised for her blend of risqué storylines and critique of Britain's class system, personified by showjumping lothario Rupert Campbell-Black. Her children Felix and Emily said: \"Mum was the shining light in all of our lives. Her love for all of her family and friends knew no bounds. \"Her unexpected death has come as a complete shock. \"We are so proud of everything she achieved in her life and can't begin to imagine life without her infectious smile and laughter all around us.\" Dame Jilly was propelled to commercial success in the 1980s, and sold 11 million copies of her books during her more than fifty-year career. Tributes to author who created 'a whole new genre' Dame Jilly was a long-standing friend of the Queen. In a statement released by Buckingham Palace, she said: \"I was so saddened to learn of Dame Jilly's death last night. \"Very few writers get to be a legend in their own lifetime but Jilly was one, creating a whole new genre of literature and making it her own through a career that spanned over five decades. \"In person she was a wonderfully witty and compassionate friend to me and so many - and it was a particular pleasure to see her just a few weeks ago at my Queen's Reading Room Festival where she was, as ever, a star of the show. \"I join my husband the King in sending our thoughts and sympathies to all her family. \"And may her hereafter be filled with impossibly handsome men and devoted dogs.\" Downing Street said Dame Jilly's \"wit, warmth and wisdom\" had delighted readers. The prime minister's official spokesman said: \"Dame Jilly Cooper was a literary force whose wit, warmth and wisdom shaped British culture for over half a century and brought joy to millions.\" The author's many fans included former prime minister Rishi Sunak, who said the books offered \"escapism\". Read more: Senior politicians pay tribute to Dame Jilly 'Dame Jilly defined culture' Her agent Felicity Blunt said: \"The privilege of my career has been working with a woman who has defined culture, writing and conversation since she was first published over fifty years ago.\" She added: \"You wouldn't expect books categorised as bonkbusters to have so emphatically stood the test of time, but Jilly wrote with acuity and insight about all things - class, sex, marriage, rivalry, grief and fertility.\" The executive producers of the Disney+ adaptation, Rivals, said they are \"broken-hearted\" and \"her legacy will endure\". Dominic Treadwell-Collins and Alex Lamb added: \"Jilly was and always will be one of the world's greatest storytellers, and it has been the most incredible honour to have been able to work with her to adapt her incredible novels for television.\" As tributes rolled in, TV presenter Kirsty Allsopp wrote on X: \"I know 88 is a good age, but this is very sad news. \"A British institution, funny, enthusiastic and self-deprecating, we don't see enough of it these days.\" Dame Jilly's publisher Bill Scott-Kerr said: \"Jilly may have worn her influence lightly, but she was a true trailblazer. \"As a journalist she went where others feared to tread, and as a novelist she did likewise. \"With a winning combination of glorious storytelling, wicked social commentary and deft, lacerating characterisation, she dissected the behaviour, bad mostly, of the English upper middle classes with the sharpest of scalpels.\" TV writer and author Adam Kay said we have \"lost one of the greats\", calling Dame Jilly a \"true legend\". The 'unholy terror' Born in Essex in 1937, Jilly Cooper came from a Yorkshire family known for newspaper publishing and politics. Her writing career began in 1956 as a junior reporter on the Middlesex Independent, covering everything from parties to football. Arts and entertainment correspondent Her books were steamy, sexy and let the masses imagine what it was like to hang out in high society. However, for decades Dame Jilly Cooper's great success commercially seemed to count against her. While the craftsmanship of her work is now appreciated, she was undeniably a victim of cultural snobbery. She was dismissed by some critics as a writer of romantic fluff and by those who struggled to see beyond her \"queen of the bonkbuster\" crown. Thankfully, her work found a new life and was subject to critical reappraisal last year when it was adapted for the small screen. Rivals on Disney+ served as a reminder of why Dame Jilly's stories have always been so popular. As a writer, she was a master at observing the nuances of how high society operates. In their own way, her characters were often subtly imposing or denying their class. That her Rutshire Chronicles were international best-sellers, in spite of such snobbery, in itself spoke volumes. Her most iconic character, the brutish cad Rupert Campbell-Black, was one of the great antiheroes of modern literature. While the decision to make her a dame last year was long overdue, it was the belated happy ending that Dame Jilly thoroughly deserved. She had said she was known as the \"unholy terror\" at school, and was sacked from 22 jobs before finding her way into book publishing. Dame Jilly started writing stories for women's magazines in 1968, and found her break in 1969 when The Sunday Times published a story on being an ''undomesticated'' homemaker. It gave rise to a column that lasted over 13 years. In 2019 she won the inaugural Comedy Women in Print lifetime achievement award, and in 2024 was made a dame for her services to literature and charity."
    },
    {
        "title": "Dame Jilly Cooper obituary: Sex, glamour and posh people behaving badly - she was the undisputed 'queen of the bonkbuster'",
        "description": "The secret to writing good sex?",
        "url": "https://news.sky.com/story/dame-jilly-cooper-obituary-sex-glamour-and-posh-people-behaving-badly-she-was-the-undisputed-queen-of-the-bonkbuster-13446033",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-jilly-cooper-riders_7044269.jpg?20251006170214",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-10-06 12:13:39",
        "Headline": "Known as the \"Queen of the bonkbuster\", Dame Jilly's filthy and funny novels sold millions around the world. Reflecting upon her career after becoming a dame, the author said she had always wanted to write happy books.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n The secret to writing good sex? According to Dame Jilly Cooper, the answer was simple. \"Keeping it fun,\" she said in an interview in 2023. Known as the \"Queen of the bonkbuster\", Dame Jilly's filthy and funny novels sold millions around the world. Sex, glamour, horses, posh people behaving badly; her most famous works include Riders, Polo, The Man Who Made Husbands Jealous, and of course, Rivals, which found a new audience thanks to a hugely successful Disney+ television adaptation last year. Her books have been ubiquitous since the 1980s, instantly recognisable for their simple but suggestive covers - the red stiletto! the tight jodhpurs! - and beloved for their blend of risqué storylines and critique of Britain's class system. As her agent Felicity Blunt said in tribute following her death at the age of 88: \"You wouldn't expect books categorised as bonkbusters to have so emphatically stood the test of time but Jilly wrote with acuity and insight about all things - class, sex, marriage, rivalry, grief and fertility.\" Born Jill Sallitt in Hornchurch, Essex, in 1937, she came from a well-known Yorkshire family; her great-grandfather founded The Leeds Mercury newspaper and was a Liberal MP for the city. Her family moved back to Yorkshire when she was a toddler, but she later attended the private Godolphin School in Salisbury. Her own writing career began in 1956, when she started as a cub reporter on the Middlesex Independent, covering everything from \"fetes to football\". She moved into public relations - and was apparently sacked from 22 jobs, according to her website biography - before ending up in book publishing. Her big break came in 1969, when The Sunday Times magazine published an article she had written \"on being a hopelessly undomesticated young wife\" - resulting in a regular column for the newspaper in which she wrote openly about sex, marriage and housework, running for more than 13 years. She would later write for five years for The Mail on Sunday. Her first book, How To Stay Married, was written in 1969, eight years after her marriage to her husband, publisher and childhood sweetheart Leo Cooper. In 1972, she wrote for the first UK edition of Cosmopolitan - rating famous men such as British actor David Niven and former Labour chancellor Roy Jenkins by how she thought they would be in bed. In 1975, Dame Jilly started a series of \"permissive\" romance novels with Emily, based on previously published magazine stories - her first fiction in book form. But it was Riders, the first novel in her raunchy Rutshire series, published in 1985, that changed everything. Featuring showjumping lothario Rupert Campbell-Black, the book went straight to number one in the bestseller lists, as did the follow-up, Rivals, in 1988. Polo, in 1991, was the biggest-selling hardback novel of the year, and The Man Who Made Husbands Jealous, in 1993, remained at number one for eight weeks. It took a little longer for critics to catch up, though. While her writing genius is now widely acknowledged, for years she was a victim of cultural snobbery, her novels often dismissed as trashy. But fans couldn't get enough. Set in the fictional county of Rutshire, the innuendo-laden series continued throughout the 1990s, 2000s and 2010s, with novels including Appassionata, Score!, Pandora and Mount! The most recent, Tackle!, which took on the beautiful game, came out in 2023. Several of Dame Jilly's works have been adapted for television and film, including a Riders TV film in 1993, and an ITV series of The Man Who Made Husbands Jealous, starring Stephen Billington and Hugh Bonneville, in 1997. Most recently, there was Disney+'s Rivals, which set the tone straight away: mile high club sex (Concorde, naturally) and Robert Palmer's Addicted To Love. Featuring an all-star cast including David Tennant, Danny Dyer, Alex Hassell, Emily Atack, Nafessa Williams, Aidan Turner and Katherine Parkinson, the Cotswolds-set series brought a modern-day lens to the 1980s without sweeping the worst aspects of the era under the carpet, and was released to glowing reviews and viral online commentary (thanks in no small part to a spot of naked tennis).  After being nominated for several BAFTAs, the second series is due in 2026. Dame Jilly was appointed an OBE for services to literature in the 2004 Birthday Honours, and CBE for services to literature and charity in the 2018 New Year Honours. Her damehood came in the New Year Honours last year; she received the accolade from the King in an experience she described as \"orgasmic\". Reflecting upon her career after becoming a dame, the author said she had always wanted to write happy books. \"The only thing I wanted to do in life was to cheer people up and people can get quite depressed, so I do like to tell lots of jokes,\" she said. Her other awards included a lifetime achievement prize at the British Book Awards in 1998, and the inaugural Comedy Women in Print lifetime achievement award in 2019. She suffered difficulties in her life, and famously survived the Paddington rail crash in 1999. She said of the experience that she believed she was going to die when her train carriage overturned, but she escaped unhurt by climbing through a broken window on the First Great Western train. In 2013, she lost her husband Leo, at the age of 79, after more than 50 years of marriage. After his death, she said she had joined dating site Tinder \"for research purposes\" but was not really looking for love again. As well as her books, Dame Jilly was known for her love of animals. She was a patron of charities and spearheaded the Animals In War Memorial Fund in 1998, which led to a memorial being unveiled in Park Lane in November 2004. She leaves behind her children, Emily and Felix, and five grandchildren. Following her death, tributes have been paid by everyone from her family to TV stars to the Queen, who described her as \"a legend in [her] own lifetime\" who \"created a whole new genre of literature\" and made it her own. Camilla ended with a wish for her \"witty and compassionate\" friend: \"And may her hereafter be filled with impossibly handsome men and devoted dogs.\" Dame Jilly would certainly have approved of that."
    }
]