[
    {
        "title": "Britain has been playing a role behind the scenes of Trump's deal between Israel and Hamas | Beth Rigby",
        "description": "Sir Keir Starmer join world leaders at a historic summit in Egypt today - to witness the signing of the Gaza peace plan to end two years of conflict, bloodshed and suffering that has cost tens of thousands of lives and turned Gaza into a wasteland.",
        "url": "https://news.sky.com/story/fears-trump-may-lose-focus-after-praise-for-gaza-peace-deal-at-egypt-summit-13449213",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-sharm-el-sheik_7049329.jpg?20251012210257",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-10-12 19:30:00",
        "Headline": "Ahead of the prime minister setting out his ambition for the UK to play a leading role in the next phase of the peace plan, political editor Beth Rigby reveals the immediate focus for the UK and other nations will be to get aid into Gaza with the UK committing £20m on Monday.",
        "Content": "\n          Political editor\n              @BethRigby\n  Sir Keir Starmer join world leaders at a historic summit in Egypt today - to witness the signing of the Gaza peace plan to end two years of conflict, bloodshed and suffering that has cost tens of thousands of lives and turned Gaza into a wasteland. Travelling over to Egypt, flanked by his national security adviser Jonathan Powell, the prime minister told me it was a \"massive moment\" and one that is genuinely historic. US President Donald Trump moved decisively last week to end this bloody war, pushing Israeli Prime Minister Benjamin Netanyahu and Hamas into a ceasefire as part of his 20-point peace plan. In the flurry of the following 48 hours, Sir Keir and another 20 or so leaders were invited to Egypt to bear witness to the signing of this deal, with many of them deserving some credit for the effort they made to bring this deal around - not least the leaders of Qatar, Egypt and Turkey, who pressed Hamas to sign up to this deal. Today, the remaining 20 living hostages are finally set to be released, along with the bodies of another 28 who were either killed or died in captivity, and aid is due to flow back into a starving Gaza. Some 1,200 Israelis were killed on 7 October 2023, with another 250 taken hostage. In the subsequent war, most of Gaza's two million population has been displaced. More than 67,000 Gazans have been killed, according to Palestinian health officials. Then, the signing ceremony is due to take place this afternoon in Sharm el Sheikh. It will be a momentous moment after a long and bloody war. \n                  When will the Israeli hostages be released?\n                 \n                  My interview with a Hamas leader was a glimpse into the unpredictable and frankly unbelievable world of global politics right now\n                 \n                  Drones capture staggering images of Gaza devastation - as people find nothing left\n                 But it is only just the beginning of a long process to rebuild Gaza and try to secure a lasting peace in the region.  The immediate focus for the UK and other nations will be to get aid into Gaza, with the UK committing £20m for water, sanitation and hygiene services for Gazans. But the focus for the UK and other European allies is what happens after the hostages are released and Israel withdraws its troops. What happens next is a much bigger and more complicated task: rebuilding Gaza; turning it into a terrorist-free zone; governing Gaza - the current plan is for a temporary apolitical committee; creating an international stabilisation force and all the tensions that could bring about - which troops each side would allow in; a commitment for Israel not to occupy or annex Gaza, even as Netanyahu makes plain his opposition to that plan. The scale of the challenge is matched by the scale of devastation caused by this brutal war. The prime minister will set out his ambition for the UK to play a leading role in the next phase of the peace plan. Back home, the UK is hosting a three-day conference on Gaza's recovery and reconstruction. Last week, France hosted European diplomats and key figures from Middle Eastern countries, Egypt, Jordan, Saudi Arabia and Qatar - and later this week, the German chancellor is hoping to organise a conference on the reconstruction of Gaza with the Egyptians. But in reality, European leaders know the key to phase two remains the key to phase one, and that's Donald Trump. As one UK figure put it to me over the weekend: \"There is lots of praise, rightly, for the US president, who got this over the line, but the big challenge for us post-war is implementing the plan. Clearly, Arab partners are concerned the US will lose focus.\" The prime minister knows this and has made a point, at every point, to praise Mr Trump. His cabinet minister Bridget Phillipson learned that diplomatic lesson the hard way yesterday when she was publicly lambasted by the US ambassador to Israel Mike Huckabee for suggesting to my colleague Trevor Phillips that the UK \"had played a key role behind the scenes\" and failed to mention Mr Trump by name. \"I assure you she is delusional,\" tweeted Governor Huckabee. \"She can thank @realDonaldTrump anytime just to set the record straight\". Today, leaders will rightly be praising Mr Trump for securing the breakthrough to stop the fighting and get the remaining hostages home. But this is only the beginning of a very long journey ahead to push through the rest of the 19-point plan and stop the region from falling back into conflict. Britain has, I am told, been playing a role behind the scenes. The PM's national security adviser Mr Powell was in Egypt last week and has been in daily touch with his US counterpart Steve Witkoff, according to government sources. Next week the King of Jordan will come to the UK. Part of the UK's task will be to get more involved, with the government and European partners keen to get further European representation on Trump's temporary governance committee for Gaza, which Tony Blair (who was not recommended or endorsed by the UK) is on and Mr Trump will chair. The committee will include other heads of states and members, including qualified Palestinians and international experts. As for the former prime minister's involvement, there hasn't been an overt ringing endorsement from the UK government. It's helpful to have Mr Blair at the table because he can communicate back to the current government, but equally, as one diplomatic source put it to me: \"While a lot of people in the Middle East acknowledge his experience, expertise and contact book, they don't like him and we need - sooner rather than later - other names included that Gulf partners can get behind.\" Today it will be the US, Egypt, Qatar and Turkey that sign off on the peace plan they directly negotiated, as other Middle Eastern and European leaders, who have flown into Sharm el Sheikh to bear witness, look on. But in the coming days and weeks, there will need to be a big international effort, led by Mr Trump, not just to secure the peace, but to keep it."
    },
    {
        "title": "When will the Israeli hostages be released?",
        "description": "Hamas is expected to release all hostages still in captivity as part of a ceasefire deal. ",
        "url": "https://news.sky.com/story/when-will-the-israeli-hostages-be-released-13449104",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hostages-square-tel-aviv_7048783.jpg?20251012182615",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-12 16:21:00",
        "Headline": "The 20 people who are still alive have been held captive for more than two years.",
        "Content": " Hamas is expected to release all hostages still in captivity as part of a ceasefire deal.  The 20 living captives, who are all men, have been held for more than two years after they were among 251 people kidnapped when Hamas-led militants launched a surprise attack on Israel on 7 October 2023. Gaza latest: Don't make a 'sick display' of hostages, Hamas warned  The bodies of another 28 hostages who were killed in captivity are also expected to be returned to Israel. Exact details of the handover are still unclear but this is what we know. When is the deadline?  Hamas have until 10am UK time to release the hostages as part of Donald Trump's 20-point peace plan. What time will they actually be freed?  There have been mixed messages about the exact timings and Israel's prime minister Benjamin Netanyahu said Israel was ready to \"immediately\" receive the captives. US vice-president JD Vance said earlier on Sunday the hostages would be released \"any moment now\". But the most concrete statement we've heard comes from Israeli government spokeswoman Shosh Bedrosian, who said they will be released \"early Monday morning\". Hamas has previously indicated it would take more time to hand over the bodies of the hostages who have died to Israel.  How will the handover work?  Israeli government spokeswoman Shosh Bedrosian said the 20 hostages are expected to be released together at one time to the Red Cross. She said they will be taken in \"six to eight\" vehicles without \"any sick displays by Hamas\", referring to the previous release ceremonies staged by the militant group. The hostages will then be driven to forces inside Israel-controlled parts of Gaza before they are transferred to southern Israel, where they will reunite with their families. Read more:Yalda Hakim speaks to Hamas leaderHow withdrawal of Israeli troops could work \"Israel is ready if a living hostage requires any urgent medical attention, they will be brought to a medical facility immediately,\" she said. She said the \"entire nation of Israel\" will embrace those killed in captivity and \"ensure proper Jewish burials\". The US president is expected to arrive in Israel on Monday morning and will meet with families of the hostages, according to a schedule released by the White House.  Where will they spend their first nights of freedom?  Pictures released by the Israeli government show the light airy rooms where the hostages will be welcomed. The comfortable chairs, big television, and bedrooms with clean sheets and baskets full of toiletries will be a world away from the dark Hamas tunnels where they have been kept in Gaza for the past 734 days. Sky News was given special access to one of the teams in the Rabin Medical Centre in Petah Tikva, a city northeast of Tel Aviv, which is preparing to receive them. Director of Nursing Dr Michal Steinman said the hostages will be given their own private room, where a gift basket filled with items such as a teddy, a blanket, slippers and a phone charger awaits them."
    },
    {
        "title": "Trump warns US may send long-range Tomahawk missiles to Ukraine unless Russia ends war",
        "description": "Donald Trump has warned the US may send long-range Tomahawk missiles to Ukraine if Russia doesn't end the war soon.",
        "url": "https://news.sky.com/story/ukrainian-counteroffensive-in-zaporizhzhia-as-russia-tries-to-cripple-power-grid-13449178",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-tomahawk-missile_7049416.jpg?20251013014143",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-12 18:30:00",
        "Headline": "These missiles have a range of 1,550 miles - long enough to strike deep inside Russia. Moscow's warned this would seriously damage relations with the US.",
        "Content": " Donald Trump has warned the US may send long-range Tomahawk missiles to Ukraine if Russia doesn't end the war soon. The president was speaking aboard Air Force One, where he is flying to the Middle East to mark a peace plan in Gaza. Vladimir Putin has previously suggested this would seriously damage relations between Moscow and Washington. Mr Trump told reporters: \"I might say 'Look: if this war is not going to get settled, I'm going to send them Tomahawks'. \"The Tomahawk is an incredible weapon, very offensive weapon. And honestly, Russia does not need that.\" He went on to reveal that the prospect of Ukraine receiving these missiles has already been raised in conversations with Volodymyr Zelenskyy. The Ukrainian president told Fox News that Tomahawks would only be used to pursue military goals - and not to attack civilians. \n                  Putin admits Russia shot down Azerbaijani passenger jet, killing 38\n                 \n                  Ukraine says it has struck oil terminal in Crimea and key Russian explosives factory\n                 \n                  At least five killed in Ukraine after Russian missile and drone attack - as Poland forced to scramble jets\n                 These missiles have a range of 1,550 miles (2,500km) - long enough to strike deep inside Russia, including Moscow. \"Do they want to have Tomahawks going in that direction? I don't think so,\" Mr Trump said of Russia. \"I think I might speak to Russia about that. Tomahawks are a new step of aggression.\"  It comes after Mr Zelenskyy claimed a Ukrainian counteroffensive has made gains along the frontline in the Zaporizhzhia region. Kyiv has said its forces have been advancing around the town of Dobropillia, near a key logistical target for Russian troops in the Donetsk region, for several weeks. In his nightly address yesterday, the Ukrainian president said his forces had also made gains of more than 3km (1.8 miles) further south in Zaporizhzhia. A Russian defence ministry report made no reference to Ukrainian advances, but said Moscow's troops had hit Ukrainian troops and equipment in Zaporizhzhia. The countries have been giving conflicting accounts of the situation along the frontline - which is estimated to stretch 775 miles (1,250km) - in the war that has raged for more than three-and-a-half years. Mr Putin told senior officers last week that Moscow's forces had captured 1,930 square miles of territory this year and have held the strategic advantage through all sectors of the frontline. The next day, Mr Zelenskyy said Ukrainian forces were inflicting heavy losses on Russian troops near Dobropillia and were \"defending ourselves along all other directions\". Meanwhile, Russia attacked Ukraine's power grid over the weekend as part of an ongoing campaign to cripple the country's energy infrastructure before winter. \"Russia continues its aerial terror against our cities and communities, intensifying strikes on our energy infrastructure,\" Mr Zelenskyy wrote on X yesterday. Read more from Sky News:Palestinian girl, 12, 'dies' after suffering malnutrition for monthsNiece of Kenyan woman 'murdered by British soldier' comes to UK to seek justice The Ukrainian president said Russia had launched \"more than 3,100 drones, 92 missiles, and around 1,360 glide bombs\" over the past week. He also called for tighter sanctions on buyers of Russian oil and said he had a \"very productive\" phone call with Donald Trump in which they discussed \"air defence, resilience, and long-range capabilities\", along with \"details related to the energy sector\". A senior Ukrainian delegation is set to visit the US this week. Kremlin spokesman Dmitry Peskov said in remarks published on Sunday that \"the topic of Tomahawks is of extreme concern\"."
    },
    {
        "title": "US ambassador to Israel calls cabinet minister 'delusional' for claim UK played key role in Gaza peace deal",
        "description": "The US ambassador to Israel has called cabinet minister Bridget Phillipson \"delusional\" after she told Sky News the UK played a key role in the Gaza peace deal.",
        "url": "https://news.sky.com/story/uk-played-key-role-in-gaza-peace-deal-but-no-uk-troops-on-ground-minister-says-13448889",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-bridget-phillipson_7049265.jpg?20251012185827",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-12 07:56:00",
        "Headline": "Bridget Phillipson told Sky News the UK helped shape the ceasefire deal, which is reflected in Sir Keir Starmer being at Monday's signing ceremony in Egypt.",
        "Content": " The US ambassador to Israel has called cabinet minister Bridget Phillipson \"delusional\" after she told Sky News the UK played a key role in the Gaza peace deal. The education secretary told Sunday Morning With Trevor Phillips, while recognising the \"critical role\" of the US, that Sir Keir Starmer's presence at a signing ceremony for the ceasefire deal in Egypt on Monday \"demonstrates the key role that we have played\". Politics latest: Phillipson announces crackdown on antisemitism at UK universities She did not say exactly what the UK's role in the ceasefire, largely attributed to Donald Trump, is or was. But she added: \"We have played a key role behind the scenes in shaping this. \"It's right that we do so because it's in all of our interest, including our own national interest, that we move to a lasting peace in the region. \"These are complex matters of diplomacy that we are involved in. But we do welcome and recognise the critical role that the American government played in moving us to this point.\" \n                  Starmer's national security adviser played no role in collapse of China spy trial, cabinet minister says\n                 \n                  Unite the union refuses to nominate either Labour deputy leadership contender\n                 \n                  Labour deputy leadership: Contest to replace Rayner set to become two-horse race\n                 However, the US ambassador to Israel, Mike Huckabee, reposted the Sky News clip of Ms Phillipson's comments and said: \"I assure you she's delusional. \"She can thank Donald Trump anytime just to set the record straight.\" Mr Huckabee was part of the negotiating team for the peace deal, with Mr Trump calling the former Arkansas governor \"AMAZING\" as he said he \"worked so hard, and did so much, to bring about peace in the Middle East\". In August, Mr Huckabee said the UK and other European nations who said they would declare a Palestinian state were \"having the counterproductive effect that they probably think that they want\". Israel: UK did not play key role in peace deal Israel's deputy foreign affairs minister, Sharren Haskell, told Sky News the UK played \"the opposite\" of a key role in the peace deal after the Palestinian state declaration, which eventually happened in September. She accused the PM's initial threat \"at a very sensitive time\" in July of having \"pushed Hamas to embolden their position and to refuse a ceasefire two months ago\". \"I think that right now, the quiet that was given during the negotiation, and to President Trump, had probably played a bigger role than what the government had done two months ago,\" she said. \"The message that the UK government has sent Hamas was the message that: the longer they continue this war, they will be rewarded. \"I mean, you must understand that when a terrorist organisation is thanking you. You are on the wrong side of history.\" It's understood the prime minister has underlined Mr Trump's key role in securing this deal throughout the process. Publicly, he praised Mr Trump twice in his press conference in India on Thursday. Read more:Gaza latest: Hostages Square boos NetanyahuHamas official thanks Donald Trump for ceasefire deal  Ms Phillipson stood by the decision to declare a Palestinian state, saying it was \"the right thing to do\". Husam Zomlot, the Palestinian ambassador to the UK, told Sky News it was a \"moment of leadership\" for the UK to declare a Palestinian state, and a \"responsibility to begin to correct a century of the gravest historic injustices committed against our people\". He added: \"That moment three weeks ago, when the UK did recognise, is a moment when we can say that the wheels of history are turning in a different direction.\" No plans for British troops on the ground The education secretary also told Sky News the government has \"no plans\" to put British troops into Israel or Gaza as part of a stabilisation force after the ceasefire. The US military will help establish a multinational force in Israel, known as a civil-military coordination centre, which is likely to include troops from Egypt, Qatar, Turkey and the UAE. On Friday, US officials said up to 200 US troops already based in the Middle East will be moved to Israel to help monitor the ceasefire in Gaza. The day before, President Trump announced Israel and Hamas had \"signed off on the first phase\" of a peace plan he unveiled last week. Aid trucks have been gathering in Egypt to cross into Gaza after months of warnings by aid groups of famine in parts of the territory. In Israel, the remaining hostages are due to be returned from Gaza by Hamas on Monday under the first phase of the peace plan. Twenty are believed to still be alive, 26 have been declared dead, while the fate of two is unknown. The ceasefire agreement has been made two years after Hamas stormed Israel on 7 October 2023, killing 1,200 people and taking 251 hostages. Israel's military offensive has killed more than 67,000 Palestinians in Gaza, according to the Hamas-run health ministry, which the UN deems reliable."
    },
    {
        "title": "Agnes Wanjiru: Niece of Kenyan woman 'murdered by British soldier' comes to UK to seek justice",
        "description": "Esther Njoki was only eight years old when her aunt Agnes Wanjiru was killed in 2012. ",
        "url": "https://news.sky.com/story/agnes-wanjiru-niece-of-kenyan-woman-murdered-by-british-soldier-comes-to-uk-to-seek-justice-13449012",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-agnes-wanjiru_6637544.jpg?20251012165306",
        "type": "Home",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-10-12 13:04:00",
        "Headline": "Kenyan prosecutors have issued an arrest warrant for the suspect accused of killing Agnes near the British Army Training Unit in Kenya (BATUK).",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  Esther Njoki was only eight years old when her aunt Agnes Wanjiru was killed in 2012.  She watched as her mother Rose frantically searched for her sister Agnes for 61 days before the body was found in a hotel septic tank. Agnes's baby Stacey was only five months old at the time her mother was murdered and in the thirteen years since, Rose has raised Stacey as her own child. Her daughter Esther has grown to become the family spokesperson, urging the Kenyan and British governments to deliver justice. In all this time, the British soldier accused of murdering Agnes has been living freely in the UK. \"I knew I had to take this responsibility, especially because of her daughter. She was left at five months old and is turning 14, and I always feel bad for her because it is a lot knowing what happened to her mum and knowing that the government knew and never took any action,\" Esther tells us, by the tree that marks her aunt's grave site in a Nanyuki cemetery. Esther is now 21 years old, the same age Agnes was when she was killed. Instead of spending her time at university in Nairobi, she is preparing for an important meeting in London. \n                  Doomsday cult leader talked followers into deadly ritual while still in jail, police say\n                 \n                  Police in Kenya begin exhuming shallow graves of suspected cult victims\n                 \n                  More than a dozen people killed in Kenya during anti-government protests, human rights group says\n                 On Tuesday, Esther will sit with Defence Secretary John Healey and discuss on British soil the case of her aunt's murder. \"I feel excited but I am also feeling sad because at 21 years, I should not be doing this. I should be doing other things and enjoying my life but since the British government and Kenyan government failed that is why I am planning all this - to go and lobby for Agnes.\" The Kenyan national prosecuting authority has finally issued an arrest warrant for the British soldier charged with murdering Agnes. The Kenyan government has expressed intent to request his extradition, but the formal process is yet to begin. \"Although they have taken long and [are doing this] because of the pressure put on them, I think something will be done because the warrant of arrest has been issued. But again, it is a long journey ahead of us. Extradition might take as long as five years,\" says Esther. \"We want the guy to be extradited here so that he can be a lesson for other soldiers who think they can come to Kenya and do anything that they feel like doing because they have power.\" Agnes worked as a hairdresser and sex worker at the time she was killed. In November 2022, the Ministry of Defence banned British soldiers from soliciting sex overseas but an internal service inquiry found there have been low to moderate violations of the ban in Kenya. Maryanne Wangui, an old friend of Agnes and leader of the sex workers alliance in Nanyuki, says that British soldiers are still paying for sex in the town, but much more discreetly. \"They are using Airbnbs and they have their pimps who they are using to bring those sex workers to their houses and they do their stuff there and pay them there. We are not protected because if a girl is killed in an Airbnb - who will cater for that death?\" she asks. The Ministry of Defence has told Sky News: \"There is absolutely no place for sexual exploitation and abuse by people in the British Army. \"It is at complete odds with what it means to be a British soldier. It preys on the vulnerable and benefits those who seek to profit from abuse and exploitation.\" The MoD also sent this comment on Agnes Wanjiru's murder: \"Our thoughts remain with the family of Agnes Wanjiru and we remain absolutely committed to helping them secure justice. \"We understand that the Kenyan Director of Public Prosecutions has determined that a British National should face trial in relation to the murder of Ms Wanjiru in 2012. This is subject to ongoing legal proceedings and we will not comment further at this stage.\" Agnes's hometown Nanyuki is the main base for the British Army Training Unit in Kenya (BATUK). The market town was first set up as a white frontier settlement in the 1920s after the mass expulsion of Maasai from the Laikipia plateau by British colonial forces. It became favoured by retired British soldiers who wanted to turn to agriculture and sixty years since Kenya's independence, the town still feels trapped in the past. Public hearings last year saw dozens of Kenyans allege violations by the BATUK in Laikipia and Samburu. Local politicians, religious leaders and village elders were among those from across the region to share their grievances with the BATUK and requested compensation from the UK government. Esther made her aunt's case to a committee at a community hall in Nanyuki, and now she will make her case on British soil. \"Neocolonialism is still in Kenya. Even our government knew what these soldiers had done but they never took action, they do not protect their victims - their own citizens,\" Esther tells us, hours before her flight to the UK. \"For sure, these guys are still colonising us because why are they training here? They have their own land.\""
    },
    {
        "title": "Woman arrested on suspicion of murder after death of two children in Stafford",
        "description": "A 43-year-old woman has been arrested on suspicion of murder after the death of two children in Stafford.",
        "url": "https://news.sky.com/story/woman-arrested-on-suspicion-of-murder-after-death-of-two-children-in-stafford-13448873",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-stafford-police_7049129.png?20251012154153",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-12 07:14:00",
        "Headline": "The next of kin of the two children, named as two-year-old Meraj Ul Zahra, and three-year-old Abdul Momin Alfaateh, have been informed and are being supported by specially-trained officers, police said.",
        "Content": "A 43-year-old woman has been arrested on suspicion of murder after the death of two children in Stafford. Police were called to a home on Corporation Street at around 7.30am on Sunday by West Midlands Ambulance Service. A two-year-old girl Meraj Ul Zahra, and a three-year-old boy, Abdul Momin Alfaateh, were pronounced dead at the scene, Staffordshire Police said. Detective Inspector Kirsty Oldfield said: \"We are working hard to understand more about what happened leading up to these two children tragically losing their lives. \"We ask that people do not speculate at this stage as it is distressing for family and friends and could hinder our inquiries. \"We understand that this incident may cause concern in the local community. We don't believe there is wider threat to the public at this time.\" Read more:Two arrested over Lostprophets singer's deathHow drones are delivering food in Ireland The 43-year-old woman, who is from the Stafford area, remains in custody. The force has not confirmed the ages of the two children. Their next of kin have been informed and are being supported by specially-trained officers, police said."
    },
    {
        "title": "Inside the rooms where Israeli hostages will spend their first nights of freedom",
        "description": "A teddy sits on a bed in a bright hospital room. Beside it is a small fridge stocked with bottled water and Coca-Cola.",
        "url": "https://news.sky.com/story/inside-the-homecoming-unit-ready-to-welcome-israeli-hostages-13448955",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-israel-hostages_7048955.jpg?20251012122338",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-10-12 11:04:00",
        "Headline": "With phase one of Donald Trump's peace plan now under way, an entire nation is holding its breath for the return of the hostages, not least the medical teams preparing to receive them.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  A teddy sits on a bed in a bright hospital room. Beside it is a small fridge stocked with bottled water and Coca-Cola. While the bear might make you think a child is about to arrive, this room will soon be welcoming one of the 20 Israeli hostages believed to be alive in Gaza. With phase one of Donald Trump's peace plan now under way, an entire nation is holding its breath for the return of the hostages, not least the medical teams preparing to receive them. Gaza latest: Israel prepares for hostages' release Sky News was given special access to one of the teams in the Rabin Medical Center in Petah Tikva, a city north-east of Tel Aviv. It was sobering and emotional, but also inspiring, talking to its doctors and nurses as they showed us around what one calls the \"homecoming unit\". Director of Nursing Dr Michal Steinman took us into the light airy rooms where hostages will be allowed to recover at their own speed in private, choosing when and for how long they emerge, slowly reengaging with a world they've not known for two years. She explained that each of the hostages - who are all men - will be given their own private room, where a gift basket filled with thoughtful items such as a teddy, a blanket, slippers and a phone charger awaits them. The teddy is there to help bring comfort to the freed captives. \"Our research says each one of us has a child inside,\" Dr Steinman told me. \"We need something to pet and feel soft, and reassure them after the lack of senses for such a long time.\" Phones, she said, will be provided by the army. Read more:The hostages believed to be aliveDrones reveal devastation in Gaza The families will also bring items from home to make the area feel more familiar to their loved ones as they slowly adjust to freedom. The men will also have access to other areas, including a private living space where they can spend time with loved ones or greet any visiting dignitaries. Their families will also be provided with rooms to stay in, as well as an area for the children of the hostages when they visit. Medical equipment is kept in dedicated treatment rooms as part of an effort to make the rooms feel more like accommodation than a hospital. While the unit is pristine and ready for the new arrivals, it has previously been used to house other hostages released by Hamas. Staff shared anecdotes revealing what may lie ahead. Dr Steinman told us of one released hostage who had had trouble not with sleeping, but with waking up. \"When I opened my eyes,\" they had told her, \"I was thinking that I'm still in a dream because there's no way that I opened my eyes and I'm not in the tunnel. I thought, 'it's a dream inside a dream'.\" The hostages, she said, \"can't believe for the first moments they're not in other place.\" Dr Steinman found another freed captive \"stuck\" and standing still after opening the refrigerator. \"I told him, 'It's hard for you to choose?',\" she explained. \"And he said, 'I'm just amazed at the colours. All I've seen for 100 days is black, white and brown'.\" The professor reinventing 'hostage medicine' For the head of the centre, Professor Noa Eliakim-Raz, and her team, the return of the hostages will be the culmination of two years of painstaking work. They have effectively reinvented what they call 'hostage medicine', learning from the treatment of groups of hostages received during this war. She is a serious and dedicated clinician. With professional precision, she told me of the challenges ahead, including the life-threatening risks of mistreating malnourished hostages held for so long underground. Then she gave us a glimpse into the human side of their work. \"All the team, we've prepared for so long, I mean really, we've been in this for two years and all the time, we're preparing and ready,\" she said. \"This ward that you saw is ready every day.\" How does she feel as the hostages' arrival draws near? \"I feel very grateful, and I think that's the strongest emotion, to be part of this,\" she said. Clearly moved, Professor Noa had to pause and collect her emotions, her eyes welling up when asked what she'd be thankful for most. \"I think being part of a small step,\" she began, before pausing again. \"A small step of making them feel hugged again and trusting the system.\" It will, she said, be a big relief when it's over. Professor Noa is writing a first-of-its-kind multi-disciplinary protocol for treating long-term hostages, literally rewriting the book on how to return them to normality. Her department did not exist before October 7. In the two years since its inception, it has pioneered a form of treatment involving many different disciplines to maximise the chances of recovery. The Rabin Medical Center's staff believe the lessons they've learned will benefit doctors around the world in future. But they hope never to have to use them on Israelis again."
    },
    {
        "title": "Thatcher at 100: Lavish celebrations to remember the Iron Lady's life, leadership and legacy",
        "description": "Kemi Badenoch is expected to mark the 100th anniversary of Margaret Thatcher's birth after paying a series of glowing tributes to her at the Conservative Party conference.",
        "url": "https://news.sky.com/story/thatcher-at-100-lavish-celebrations-to-remember-the-iron-ladys-life-leadership-and-legacy-13449056",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-thatcher-blacpool-tories_6539730.jpg?20240501154037",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-10-12 23:01:00",
        "Headline": "National treasures to sporting greats and politicians will commemorate what would have been Margaret Thatcher's 100th birthday with a celebratory dinner and other events.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Kemi Badenoch is expected to mark the 100th anniversary of Margaret Thatcher's birth after paying a series of glowing tributes to her at the Conservative Party conference. The Tory celebrations, 100 years after she was born on 13 October 1925, include a glittering dinner at the historic Guildhall in the City of London attended by a galaxy of A-list celebrities and veteran Tory grandees. The Conservative leader led the tributes to Lady Thatcher at the party's conference in Manchester, declaring in her opening speech: \"As one of my great predecessors, Margaret Thatcher, put it: 'The facts of life are Conservative'.\" Later in the speech, she added: \"In the 1980s, Margaret Thatcher broke the cycle of high inflation, low growth and trade union strife, giving Britain back her national pride and economic strength.\" And responding to a Sky News YouGov poll suggesting half of Tory members don't want her to lead the party into the next election, Ms Badenoch claimed she was being criticised just like Baroness Thatcher was when she became opposition leader in the 1970s. \"Pretty much everything that I'm experiencing now, she did,\" she claimed in an interview when she was asked about attacks on her leadership and bad poll results. \"She was written off.\" At the Guildhall dinner, the invited celebs range from national treasure Joan Collins to cricket legend Ian Botham and from Downton Abbey creator Julian Fellowes to bestselling author Jeffrey Archer. \n                  Is it too late for Kemi Badenoch?\n                 \n                  Badenoch pulls off first conference speech as leader, but it is less clear if this will be her last\n                 \n                  Badenoch has done enough to hold off her critics - for now\n                 The principal speaker is Sir Mark Thatcher, who - according to the organisers - will be speaking for the first time ever in public about his mother's life, leadership and legacy. Thatcher-era ministers present will include former Tory leader Michael Howard, former chancellor Norman Lamont and Kenneth Baker, whose cabinet posts included party chairman and home secretary. The black-tie dinner for 500 guests, organised by the Margaret Thatcher Centre charitable project, is taking place 100 years to the day after the Iron Lady's birth and at a venue she knew well. It was at the Guildhall that Lady Thatcher spoke at the annual Lord Mayor's Banquet a dozen times during more than a decade as prime minister, including her famously defiant speech with cricketing metaphors just 10 days before she quit in 1990. \"I am still at the crease, though the bowling has been pretty hostile of late,\" she declared. \"And in case anyone doubted it, can I assure you there will be no ducking the bouncers, no stonewalling, no playing for time. The bowling's going to get hit all round the ground. That is my style.\" She was responding to the resignation of Sir Geoffrey Howe, her ally turned assassin, who hit back the following day in an onslaught in the Commons that has been claimed to be the greatest parliamentary speech of all time. Insisting there was no monopoly of cricketing metaphors, Sir Geoffrey told MPs: \"It's rather like sending your opening batsmen to the crease only for them to find, the moment the first balls are bowled, that their bats have been broken before the game by the team captain.\" With one lethal speech, the \"dead sheep\" so brutally ridiculed by his Labour rival Denis Healey had turned into a roaring lion and Lady Thatcher was finished. Yet by 1990 she had won three general elections, survived the 1984 Brighton bomb, defeated Argentina in the 1982 Falklands war and Arthur Scargill in the 1984-85 miners' strike and privatised dozens of major nationalised industries. She was born 100 years ago above the corner shop of her father, Alfred Roberts, a Methodist lay preacher and town councillor, on the corner of North Parade and Broad Street, Grantham, in Lincolnshire. In the Commons in 2020, culture minister John Whittingdale, previously her political secretary, said of a visit to the Coronation Street set when she was PM: \"She was particularly keen to visit Alf Roberts' corner shop because of course her own father was Alfred Roberts, who ran the grocer's shop in Grantham.\" Describing her early years in her autobiography, The Downing Street Years, she wrote: \"I had grown up in a household that was neither poor nor rich. We had to economise each day in order to enjoy the occasional luxury. \"My father's background as a grocer is sometimes cited as the basis for my economic philosophy. So it was - and is.\" At the Tory conference, the ghost of the Iron Lady hung heavily. Her legacy and references to the 100th anniversary of her birth were everywhere: life-size cardboard cut-outs, biographies, gift mugs, tea towels, a display of outfits worn by her and her famous quotes all over the walls. Whittingdale, now Sir John and a veteran backbench grandee, was much in demand for anecdotes about his former boss and he didn't disappoint. At one event, he told of her team's attempts to persuade her to make a joke in her 1990 conference speech about the Monty Python \"dead parrot\" sketch. The idea was to mock the Liberal Democrats' \"bird of liberty\" symbol, but she didn't get the joke and at one point said to her advisers: \"Just who is this Monty Python?\" Nevertheless, she delivered the gag with aplomb. \"This is an ex-parrot,\" she said of the Lib Dems in her speech. \"It is not merely stunned, it has ceased to be, expired and gone to meet its maker.\"  On the eve of Ms Badenoch's big speech, Sir John told Sky News how on the night before Lady Thatcher's conference speeches she would make endless changes to the script until as late as 2am. \"The poor typist didn't use a word processor, so every time it changed she had to type the whole thing again,\" he said. And asked by Sky News if all party leaders stay up until the small hours making changes to their conference speech, he replied: \"No!\" Although it's the most lavish and spectacular, the Guildhall dinner is just one of many events to celebrate the anniversary. The following evening, her acclaimed biographer Charles Moore and Michael Portillo are promising an insider's portrait of her life at the Royal Geographical Society in London. Now more famous for his TV railway journeys, Portillo began working for the Conservatives in 1976, a year after she became Tory leader. He briefed her in the 1979 election and went on to be a special adviser, whip, and minister in her governments. Read more from Sky News:Tories promise to scrap stamp duty if they win next electionUS ambassador to Israel calls UK cabinet minister 'delusional'Man charged with stalking after allegedly targeting Lib Dem leader Last week, Sir Mark and Carol Thatcher travelled to Budapest for the unveiling of a striking iron statue marking her 100th anniversary and commemorating her role in fighting communism and ending the Cold War. And at Sloane Street Auctions in London later this month, Baroness Thatcher's final portrait is being auctioned, along with further contents of her London home, at the third sale of her furniture and effects. The portrait photograph, taken by Alistair Morrison in the main drawing room at her home in Chester Square, was the final portrait for which she sat. The sale also includes a portrait of Baroness Thatcher in her full Order of the Garter robes. In Grantham, where a statue of Lady Thatcher was erected in 2022, 100th anniversary events this month include a special postcard exhibition, walking talks by a local historian, a display in the town's library and talks by former Tory minister Edwina Currie and Gyles Brandreth. But it's not just friends and supporters who are praising Lady Thatcher as they mark the anniversary. At the Tory conference, her old foe Michael Heseltine, who walked out of her cabinet in 1986 and challenged her in 1990, was full of praise. \"Margaret Thatcher's greatest achievement was to help create the European Single Market,\" Lord Heseltine, now 92, said at a European Movement fringe meeting. \"It was a privilege beyond measure to serve in the Conservative government that was elected in 1979 and led our country for 18 continuous years. \"That government, first under Margaret Thatcher, has been portrayed as a right-wing administration. But however much that may suit the most zealous of my colleagues, the truth was often very different. \"My experience in introducing development corporations, building a new east end of London and at the same time acting as a sort of clerk of works in restoring confidence in Liverpool must rank as one of the most interventionist ministerial experiences in peacetime ever. \"The point is that was all under Margaret Thatcher. I remember no criticism from her. She was, in truth, much more practical than doctrinal.\" At an earlier event, the chairman of the Tory backbench 1922 Committee, Bob Blackman MP, also recalled that when Lady Thatcher became opposition leader in 1975 she struggled initially, patronised not just by Labour prime ministers Harold Wilson and James Callaghan but also by the Tory establishment, he said. Yet in 1979, the '22 chairman declared, she led them to victory in the first of her three general election triumphs. Yes. But unlike Kemi Badenoch, in the 1970s Mrs Thatcher did not have the threat that the Conservatives now face from Nigel Farage."
    },
    {
        "title": "Madagascar president says coup under way as soldiers join protesters",
        "description": "The president of Madagascar Andry Rajoelina has claimed a coup is under way after weeks of intense youth-led protests.",
        "url": "https://news.sky.com/story/madagascar-president-says-coup-under-way-as-soldiers-join-protesters-13449211",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-madagascar-antananarivo_7049319.jpg?20251012203506",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-12 19:28:00",
        "Headline": "Water and power outages triggered protests in the Indian Ocean country, which have escalated due to larger dissatisfaction with the leadership of president Rajoelina.",
        "Content": "The president of Madagascar Andry Rajoelina has claimed a coup is under way after weeks of intense youth-led protests. Water and power outages triggered protests in the Indian Ocean country on 25 September, with the young population - of whom around three-quarters are believed to live in poverty - continuing to riot over general dissatisfaction with Mr Rajoelina. In a major blow to the president, troops from the elite army unit CAPSAT, which helped him seize power during a coup in 2009, joined protesters on Saturday for one of the biggest demonstrations since the unrest began. Colonel Michael Randrianirina, a commander of the CAPSAT unit, said his troops had exchanged fire with security forces who were attempting to quell the protests in the capital Antananarivo and that one of his soldiers had been killed. A unit of the paramilitary gendarmerie, which had been tackling the protests together with the police, also turned on the government on Sunday, saying it was coordinating with the CAPSAT headquarters. The Intervention Forces of the National Gendarmerie said in a statement broadcast on Real TV: \"All use of force and any improper behaviour towards our fellow citizens are prohibited, as the gendarmerie is a force meant to protect people and not to defend the interests of a few individuals.\" Mr Rajoelina's office released a statement saying he \"wishes to inform the nation and the international community that an attempt to seize power illegally and by force\" had been \"initiated\". \n                  Thousands of endangered tortoises rescued from floods in Madagascar after Cyclone Dikeledi\n                 \n                  Madagascar set to castrate child rapists after parliament passes law\n                 \n                  Madagascar: At least 12 killed in stampede at Indian Ocean Island Games opening ceremony\n                 \"In view of the extreme gravity of this situation,\" the president's office \"strongly condemns this attempt at destabilisation and calls upon all forces of the nation to unite in defence of constitutional order and national sovereignty,\" it said. Later on Sunday, however, Reuters reported that the president's whereabouts were unknown, with several people in the region believing he had left the country. Col Randrianirina denied any coup had taken place, but the unit claimed to have taken control of all of Madagascar's armed forces and said it had installed a new leader of the military, General Demosthene Pikulas. \"We responded to the people's call,\" Col Randrianirina told reporters on Sunday, declining to say if they had asked Mr Rajoelina to resign. Mr Rajoelina dismissed his entire government, including the prime minister, on 29 September in a failed attempt to appease the protesters. Speaking to crowds from an armoured vehicle on Saturday, Col Randrianirina said the president, his new prime minister, the minister of the gendarmerie and the commander of the gendarmerie \"must leave power. That's all.\" \"Do we call this a coup? I don't know yet,\" Col Randrianirina said. The protests have been led by a group calling itself \"Gen Z Madagascar\", and have been joined by civic groups and trade unions. The United Nations says the demonstrations have left at least 22 people dead and dozens injured - numbers disputed by the government. The US Embassy in Madagascar has advised American citizens to shelter-in-place due to a \"highly volatile and unpredictable\" situation, while the African Union urged all parties, \"both civilian and military, to exercise calm and restraint.\" Read more:Palestinian girl, 12, 'dies' after suffering from malnutrition for monthsNiece of Kenyan woman 'murdered by British soldier' comes to UK to seek justice Protesters have brought up a range of issues, including poverty and the cost of living, access to tertiary education, and alleged corruption and embezzlement of public funds by government officials and their families and associates. Mr Rajoelina, 51, first became the leader of a transitional government following a 2009 coup that forced then President Marc Ravalomanana to flee the country and lose power, before he was elected president in 2018 and re-elected in 2023 in a vote boycotted by opposition parties. Madagascar, a large island of 31 million people off the east coast of Africa, has had several leaders removed in coups and has a history of political crises since it gained independence from France in 1960."
    },
    {
        "title": "Palestinian girl, 12, dies after suffering from malnutrition for months - reports",
        "description": "Huda Abu al Naja, a 12-year-old Palestinian girl who suffered from malnutrition for months, has died in Nasser Hospital in Gaza, according to The Times of Israel.",
        "url": "https://news.sky.com/story/palestinian-girl-12-dies-after-suffering-from-malnutrition-for-months-13449071",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-malnutrition_6972713.jpg?20250724154712",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-12 15:09:00",
        "Headline": "Huda lost half her bodyweight in a matter of months, forcing her to be admitted to hospital. In July,  she said she knew she looked unwell and that the war in Gaza had \"changed\" her.",
        "Content": " Huda Abu al Naja, a 12-year-old Palestinian girl who suffered from malnutrition for months, has died in Nasser Hospital in Gaza, according to The Times of Israel. Warning: This article contains images that some readers may find distressing. Huda died of a \"simple infection\" on Friday that her immune system, weakened by months of malnutrition, could not fight off, the paper reported, citing a journalist from another Israeli newspaper, Haaretz. When a Sky News team visited the hospital in July, they were told Huda had lost half her body weight since March. Her mother said her needs were simple: fresh fruit and vegetables, fish and a bit of meat - but there was \"virtually nothing to eat\" after Israel shut the crossings into Gaza, and imposed a blockade. Many of the children in the malnutrition ward she was on were being given dextrose in the absence of food - a mixture of sugar and water which has no nutritional value. Ongoing restrictions on the entry of food aid have created a famine in Gaza City, according to the UN-backed Integrated Food Security Phase Classification (IPC) and aid agencies, with mass hunger throughout the rest of the territory. Data from Israeli border officials shows that the amount of food entering Gaza has frequently been below the \"bare minimum\" that the UN's famine-review agency says is necessary to meet basic needs. In July, Huda said she knew she didn't look well. \"Before, I used to look like this,\" Huda said, pointing to a picture on her tablet. \"The war changed me. Malnutrition has turned my hair yellow because I lack protein. You see here, this is how I was before the war.\" She was pleading for help. \"Can you help me travel abroad for treatment? I want to be like you. I'm a child. I want to play and be like you,\" she said. International organisations had been campaigning for months before her death to secure her evacuation from the Gaza Strip, Haaretz reported. To date, Hamas-run Gaza's health ministry says 461 people have died from malnutrition, including 157 children. Read more:Inside the rooms where Israeli hostages will spend their first nights of freedomDrones reveal staggering devastation - as Gazans find nothing left As part of Donald Trump's 20-point peace plan, Israel has agreed to reopen five border crossings to help with the flow of food and other aid supplies into Gaza. Israel's defence body overseeing aid, COGAT, said the amount entering Gaza was expected to rise to around 600 trucks each day, starting on Sunday.  Egypt said it was also sending 400 trucks on Sunday, with many pictured near the Rafah crossing in southern Gaza. They were seen queuing at the border and getting mobbed by dozens of people in Khan Younis in the southern Gaza Strip, where Nasser Hospital is based."
    },
    {
        "title": "Woman arrested on suspicion of murder after death of two children in Stafford",
        "description": "A 43-year-old woman has been arrested on suspicion of murder after the death of two children in Stafford.",
        "url": "https://news.sky.com/story/woman-arrested-on-suspicion-of-murder-after-death-of-two-children-in-stafford-13448873",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-stafford-police_7049129.png?20251012154153",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-12 07:14:00",
        "Headline": "The next of kin of the two children, named as two-year-old Meraj Ul Zahra, and three-year-old Abdul Momin Alfaateh, have been informed and are being supported by specially-trained officers, police said.",
        "Content": "A 43-year-old woman has been arrested on suspicion of murder after the death of two children in Stafford. Police were called to a home on Corporation Street at around 7.30am on Sunday by West Midlands Ambulance Service. A two-year-old girl Meraj Ul Zahra, and a three-year-old boy, Abdul Momin Alfaateh, were pronounced dead at the scene, Staffordshire Police said. Detective Inspector Kirsty Oldfield said: \"We are working hard to understand more about what happened leading up to these two children tragically losing their lives. \"We ask that people do not speculate at this stage as it is distressing for family and friends and could hinder our inquiries. \"We understand that this incident may cause concern in the local community. We don't believe there is wider threat to the public at this time.\" Read more:Two arrested over Lostprophets singer's deathHow drones are delivering food in Ireland The 43-year-old woman, who is from the Stafford area, remains in custody. The force has not confirmed the ages of the two children. Their next of kin have been informed and are being supported by specially-trained officers, police said."
    },
    {
        "title": "US ambassador to Israel calls cabinet minister 'delusional' for claim UK played key role in Gaza peace deal",
        "description": "The US ambassador to Israel has called cabinet minister Bridget Phillipson \"delusional\" after she told Sky News the UK played a key role in the Gaza peace deal.",
        "url": "https://news.sky.com/story/uk-played-key-role-in-gaza-peace-deal-but-no-uk-troops-on-ground-minister-says-13448889",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-bridget-phillipson_7049265.jpg?20251012185827",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-12 07:56:00",
        "Headline": "Bridget Phillipson told Sky News the UK helped shape the ceasefire deal, which is reflected in Sir Keir Starmer being at Monday's signing ceremony in Egypt.",
        "Content": " The US ambassador to Israel has called cabinet minister Bridget Phillipson \"delusional\" after she told Sky News the UK played a key role in the Gaza peace deal. The education secretary told Sunday Morning With Trevor Phillips, while recognising the \"critical role\" of the US, that Sir Keir Starmer's presence at a signing ceremony for the ceasefire deal in Egypt on Monday \"demonstrates the key role that we have played\". Politics latest: Phillipson announces crackdown on antisemitism at UK universities She did not say exactly what the UK's role in the ceasefire, largely attributed to Donald Trump, is or was. But she added: \"We have played a key role behind the scenes in shaping this. \"It's right that we do so because it's in all of our interest, including our own national interest, that we move to a lasting peace in the region. \"These are complex matters of diplomacy that we are involved in. But we do welcome and recognise the critical role that the American government played in moving us to this point.\" \n                  Starmer's national security adviser played no role in collapse of China spy trial, cabinet minister says\n                 \n                  Unite the union refuses to nominate either Labour deputy leadership contender\n                 \n                  Labour deputy leadership: Contest to replace Rayner set to become two-horse race\n                 However, the US ambassador to Israel, Mike Huckabee, reposted the Sky News clip of Ms Phillipson's comments and said: \"I assure you she's delusional. \"She can thank Donald Trump anytime just to set the record straight.\" Mr Huckabee was part of the negotiating team for the peace deal, with Mr Trump calling the former Arkansas governor \"AMAZING\" as he said he \"worked so hard, and did so much, to bring about peace in the Middle East\". In August, Mr Huckabee said the UK and other European nations who said they would declare a Palestinian state were \"having the counterproductive effect that they probably think that they want\". Israel: UK did not play key role in peace deal Israel's deputy foreign affairs minister, Sharren Haskell, told Sky News the UK played \"the opposite\" of a key role in the peace deal after the Palestinian state declaration, which eventually happened in September. She accused the PM's initial threat \"at a very sensitive time\" in July of having \"pushed Hamas to embolden their position and to refuse a ceasefire two months ago\". \"I think that right now, the quiet that was given during the negotiation, and to President Trump, had probably played a bigger role than what the government had done two months ago,\" she said. \"The message that the UK government has sent Hamas was the message that: the longer they continue this war, they will be rewarded. \"I mean, you must understand that when a terrorist organisation is thanking you. You are on the wrong side of history.\" It's understood the prime minister has underlined Mr Trump's key role in securing this deal throughout the process. Publicly, he praised Mr Trump twice in his press conference in India on Thursday. Read more:Gaza latest: Hostages Square boos NetanyahuHamas official thanks Donald Trump for ceasefire deal  Ms Phillipson stood by the decision to declare a Palestinian state, saying it was \"the right thing to do\". Husam Zomlot, the Palestinian ambassador to the UK, told Sky News it was a \"moment of leadership\" for the UK to declare a Palestinian state, and a \"responsibility to begin to correct a century of the gravest historic injustices committed against our people\". He added: \"That moment three weeks ago, when the UK did recognise, is a moment when we can say that the wheels of history are turning in a different direction.\" No plans for British troops on the ground The education secretary also told Sky News the government has \"no plans\" to put British troops into Israel or Gaza as part of a stabilisation force after the ceasefire. The US military will help establish a multinational force in Israel, known as a civil-military coordination centre, which is likely to include troops from Egypt, Qatar, Turkey and the UAE. On Friday, US officials said up to 200 US troops already based in the Middle East will be moved to Israel to help monitor the ceasefire in Gaza. The day before, President Trump announced Israel and Hamas had \"signed off on the first phase\" of a peace plan he unveiled last week. Aid trucks have been gathering in Egypt to cross into Gaza after months of warnings by aid groups of famine in parts of the territory. In Israel, the remaining hostages are due to be returned from Gaza by Hamas on Monday under the first phase of the peace plan. Twenty are believed to still be alive, 26 have been declared dead, while the fate of two is unknown. The ceasefire agreement has been made two years after Hamas stormed Israel on 7 October 2023, killing 1,200 people and taking 251 hostages. Israel's military offensive has killed more than 67,000 Palestinians in Gaza, according to the Hamas-run health ministry, which the UN deems reliable."
    },
    {
        "title": "Britain has been playing a role behind the scenes of Trump's deal between Israel and Hamas | Beth Rigby",
        "description": "Sir Keir Starmer join world leaders at a historic summit in Egypt today - to witness the signing of the Gaza peace plan to end two years of conflict, bloodshed and suffering that has cost tens of thousands of lives and turned Gaza into a wasteland.",
        "url": "https://news.sky.com/story/fears-trump-may-lose-focus-after-praise-for-gaza-peace-deal-at-egypt-summit-13449213",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-sharm-el-sheik_7049329.jpg?20251012210257",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-10-12 19:30:00",
        "Headline": "Ahead of the prime minister setting out his ambition for the UK to play a leading role in the next phase of the peace plan, political editor Beth Rigby reveals the immediate focus for the UK and other nations will be to get aid into Gaza with the UK committing £20m on Monday.",
        "Content": "\n          Political editor\n              @BethRigby\n  Sir Keir Starmer join world leaders at a historic summit in Egypt today - to witness the signing of the Gaza peace plan to end two years of conflict, bloodshed and suffering that has cost tens of thousands of lives and turned Gaza into a wasteland. Travelling over to Egypt, flanked by his national security adviser Jonathan Powell, the prime minister told me it was a \"massive moment\" and one that is genuinely historic. US President Donald Trump moved decisively last week to end this bloody war, pushing Israeli Prime Minister Benjamin Netanyahu and Hamas into a ceasefire as part of his 20-point peace plan. In the flurry of the following 48 hours, Sir Keir and another 20 or so leaders were invited to Egypt to bear witness to the signing of this deal, with many of them deserving some credit for the effort they made to bring this deal around - not least the leaders of Qatar, Egypt and Turkey, who pressed Hamas to sign up to this deal. Today, the remaining 20 living hostages are finally set to be released, along with the bodies of another 28 who were either killed or died in captivity, and aid is due to flow back into a starving Gaza. Some 1,200 Israelis were killed on 7 October 2023, with another 250 taken hostage. In the subsequent war, most of Gaza's two million population has been displaced. More than 67,000 Gazans have been killed, according to Palestinian health officials. Then, the signing ceremony is due to take place this afternoon in Sharm el Sheikh. It will be a momentous moment after a long and bloody war. \n                  When will the Israeli hostages be released?\n                 \n                  My interview with a Hamas leader was a glimpse into the unpredictable and frankly unbelievable world of global politics right now\n                 \n                  Drones capture staggering images of Gaza devastation - as people find nothing left\n                 But it is only just the beginning of a long process to rebuild Gaza and try to secure a lasting peace in the region.  The immediate focus for the UK and other nations will be to get aid into Gaza, with the UK committing £20m for water, sanitation and hygiene services for Gazans. But the focus for the UK and other European allies is what happens after the hostages are released and Israel withdraws its troops. What happens next is a much bigger and more complicated task: rebuilding Gaza; turning it into a terrorist-free zone; governing Gaza - the current plan is for a temporary apolitical committee; creating an international stabilisation force and all the tensions that could bring about - which troops each side would allow in; a commitment for Israel not to occupy or annex Gaza, even as Netanyahu makes plain his opposition to that plan. The scale of the challenge is matched by the scale of devastation caused by this brutal war. The prime minister will set out his ambition for the UK to play a leading role in the next phase of the peace plan. Back home, the UK is hosting a three-day conference on Gaza's recovery and reconstruction. Last week, France hosted European diplomats and key figures from Middle Eastern countries, Egypt, Jordan, Saudi Arabia and Qatar - and later this week, the German chancellor is hoping to organise a conference on the reconstruction of Gaza with the Egyptians. But in reality, European leaders know the key to phase two remains the key to phase one, and that's Donald Trump. As one UK figure put it to me over the weekend: \"There is lots of praise, rightly, for the US president, who got this over the line, but the big challenge for us post-war is implementing the plan. Clearly, Arab partners are concerned the US will lose focus.\" The prime minister knows this and has made a point, at every point, to praise Mr Trump. His cabinet minister Bridget Phillipson learned that diplomatic lesson the hard way yesterday when she was publicly lambasted by the US ambassador to Israel Mike Huckabee for suggesting to my colleague Trevor Phillips that the UK \"had played a key role behind the scenes\" and failed to mention Mr Trump by name. \"I assure you she is delusional,\" tweeted Governor Huckabee. \"She can thank @realDonaldTrump anytime just to set the record straight\". Today, leaders will rightly be praising Mr Trump for securing the breakthrough to stop the fighting and get the remaining hostages home. But this is only the beginning of a very long journey ahead to push through the rest of the 19-point plan and stop the region from falling back into conflict. Britain has, I am told, been playing a role behind the scenes. The PM's national security adviser Mr Powell was in Egypt last week and has been in daily touch with his US counterpart Steve Witkoff, according to government sources. Next week the King of Jordan will come to the UK. Part of the UK's task will be to get more involved, with the government and European partners keen to get further European representation on Trump's temporary governance committee for Gaza, which Tony Blair (who was not recommended or endorsed by the UK) is on and Mr Trump will chair. The committee will include other heads of states and members, including qualified Palestinians and international experts. As for the former prime minister's involvement, there hasn't been an overt ringing endorsement from the UK government. It's helpful to have Mr Blair at the table because he can communicate back to the current government, but equally, as one diplomatic source put it to me: \"While a lot of people in the Middle East acknowledge his experience, expertise and contact book, they don't like him and we need - sooner rather than later - other names included that Gulf partners can get behind.\" Today it will be the US, Egypt, Qatar and Turkey that sign off on the peace plan they directly negotiated, as other Middle Eastern and European leaders, who have flown into Sharm el Sheikh to bear witness, look on. But in the coming days and weeks, there will need to be a big international effort, led by Mr Trump, not just to secure the peace, but to keep it."
    },
    {
        "title": "Agnes Wanjiru: Niece of Kenyan woman 'murdered by British soldier' comes to UK to seek justice",
        "description": "Esther Njoki was only eight years old when her aunt Agnes Wanjiru was killed in 2012. ",
        "url": "https://news.sky.com/story/agnes-wanjiru-niece-of-kenyan-woman-murdered-by-british-soldier-comes-to-uk-to-seek-justice-13449012",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-agnes-wanjiru_6637544.jpg?20251012165306",
        "type": "UK",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-10-12 13:04:00",
        "Headline": "Kenyan prosecutors have issued an arrest warrant for the suspect accused of killing Agnes near the British Army Training Unit in Kenya (BATUK).",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  Esther Njoki was only eight years old when her aunt Agnes Wanjiru was killed in 2012.  She watched as her mother Rose frantically searched for her sister Agnes for 61 days before the body was found in a hotel septic tank. Agnes's baby Stacey was only five months old at the time her mother was murdered and in the thirteen years since, Rose has raised Stacey as her own child. Her daughter Esther has grown to become the family spokesperson, urging the Kenyan and British governments to deliver justice. In all this time, the British soldier accused of murdering Agnes has been living freely in the UK. \"I knew I had to take this responsibility, especially because of her daughter. She was left at five months old and is turning 14, and I always feel bad for her because it is a lot knowing what happened to her mum and knowing that the government knew and never took any action,\" Esther tells us, by the tree that marks her aunt's grave site in a Nanyuki cemetery. Esther is now 21 years old, the same age Agnes was when she was killed. Instead of spending her time at university in Nairobi, she is preparing for an important meeting in London. \n                  Doomsday cult leader talked followers into deadly ritual while still in jail, police say\n                 \n                  Police in Kenya begin exhuming shallow graves of suspected cult victims\n                 \n                  More than a dozen people killed in Kenya during anti-government protests, human rights group says\n                 On Tuesday, Esther will sit with Defence Secretary John Healey and discuss on British soil the case of her aunt's murder. \"I feel excited but I am also feeling sad because at 21 years, I should not be doing this. I should be doing other things and enjoying my life but since the British government and Kenyan government failed that is why I am planning all this - to go and lobby for Agnes.\" The Kenyan national prosecuting authority has finally issued an arrest warrant for the British soldier charged with murdering Agnes. The Kenyan government has expressed intent to request his extradition, but the formal process is yet to begin. \"Although they have taken long and [are doing this] because of the pressure put on them, I think something will be done because the warrant of arrest has been issued. But again, it is a long journey ahead of us. Extradition might take as long as five years,\" says Esther. \"We want the guy to be extradited here so that he can be a lesson for other soldiers who think they can come to Kenya and do anything that they feel like doing because they have power.\" Agnes worked as a hairdresser and sex worker at the time she was killed. In November 2022, the Ministry of Defence banned British soldiers from soliciting sex overseas but an internal service inquiry found there have been low to moderate violations of the ban in Kenya. Maryanne Wangui, an old friend of Agnes and leader of the sex workers alliance in Nanyuki, says that British soldiers are still paying for sex in the town, but much more discreetly. \"They are using Airbnbs and they have their pimps who they are using to bring those sex workers to their houses and they do their stuff there and pay them there. We are not protected because if a girl is killed in an Airbnb - who will cater for that death?\" she asks. The Ministry of Defence has told Sky News: \"There is absolutely no place for sexual exploitation and abuse by people in the British Army. \"It is at complete odds with what it means to be a British soldier. It preys on the vulnerable and benefits those who seek to profit from abuse and exploitation.\" The MoD also sent this comment on Agnes Wanjiru's murder: \"Our thoughts remain with the family of Agnes Wanjiru and we remain absolutely committed to helping them secure justice. \"We understand that the Kenyan Director of Public Prosecutions has determined that a British National should face trial in relation to the murder of Ms Wanjiru in 2012. This is subject to ongoing legal proceedings and we will not comment further at this stage.\" Agnes's hometown Nanyuki is the main base for the British Army Training Unit in Kenya (BATUK). The market town was first set up as a white frontier settlement in the 1920s after the mass expulsion of Maasai from the Laikipia plateau by British colonial forces. It became favoured by retired British soldiers who wanted to turn to agriculture and sixty years since Kenya's independence, the town still feels trapped in the past. Public hearings last year saw dozens of Kenyans allege violations by the BATUK in Laikipia and Samburu. Local politicians, religious leaders and village elders were among those from across the region to share their grievances with the BATUK and requested compensation from the UK government. Esther made her aunt's case to a committee at a community hall in Nanyuki, and now she will make her case on British soil. \"Neocolonialism is still in Kenya. Even our government knew what these soldiers had done but they never took action, they do not protect their victims - their own citizens,\" Esther tells us, hours before her flight to the UK. \"For sure, these guys are still colonising us because why are they training here? They have their own land.\""
    },
    {
        "title": "Man charged with stalking after allegedly targeting Lib Dem leader Sir Ed Davey and his family",
        "description": "A man has been charged with stalking and possession of a flick knife after allegedly targeting Lib Dem leader Sir Ed Davey and his family.",
        "url": "https://news.sky.com/story/man-charged-with-stalking-after-allegedly-targeting-lib-dem-leader-sir-ed-davey-and-his-family-13448947",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ed-davey-pmqs_7003257.jpg?20250827233416",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-12 10:33:00",
        "Headline": "Inigo Rowland, 58, has been remanded in custody after appearing in court.",
        "Content": "A man has been charged with stalking and possession of a flick knife after allegedly targeting Lib Dem leader Sir Ed Davey and his family. Inigo Rowland, 58, of Surbiton, south London, was arrested last Monday, but it was only made public on Sunday. He appeared at Wimbledon Magistrates' Court on Tuesday and was remanded in custody, the Met Police said. The offences are alleged to have taken place between June and October. Sir Ed, the MP for Kingston and Surbiton, lives in southwest London with his wife, Emily, their 17-year-old son John, and his younger sister Ellie. A spokesperson for the Met Police said: \"Inigo Rowland, 58, of Surbiton has been charged with stalking and possession of a flick knife. \"He appeared at Wimbledon Magistrates' Court on Tuesday, 7 October and was remanded into custody. He will next appear at the same court on Tuesday, 14 October. \n                  Green Party membership overtakes Liberal Democrats under Polanski\n                 \n                  Former Lib Dem leader Sir Menzies Campbell dies\n                 \n                  Ed Davey warns that Nigel Farage wants to turn Britain into 'Trump's America'\n                 \"He was arrested on Monday, 6 October in relation to the offences, which are alleged to have taken place between June and October.\" A Lib Dem spokesperson said: \"We cannot provide any details at this time, Ed's number one priority is the safety of his family.\""
    },
    {
        "title": "Thatcher at 100: Lavish celebrations to remember the Iron Lady's life, leadership and legacy",
        "description": "Kemi Badenoch is expected to mark the 100th anniversary of Margaret Thatcher's birth after paying a series of glowing tributes to her at the Conservative Party conference.",
        "url": "https://news.sky.com/story/thatcher-at-100-lavish-celebrations-to-remember-the-iron-ladys-life-leadership-and-legacy-13449056",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-thatcher-blacpool-tories_6539730.jpg?20240501154037",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-10-12 23:01:00",
        "Headline": "National treasures to sporting greats and politicians will commemorate what would have been Margaret Thatcher's 100th birthday with a celebratory dinner and other events.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Kemi Badenoch is expected to mark the 100th anniversary of Margaret Thatcher's birth after paying a series of glowing tributes to her at the Conservative Party conference. The Tory celebrations, 100 years after she was born on 13 October 1925, include a glittering dinner at the historic Guildhall in the City of London attended by a galaxy of A-list celebrities and veteran Tory grandees. The Conservative leader led the tributes to Lady Thatcher at the party's conference in Manchester, declaring in her opening speech: \"As one of my great predecessors, Margaret Thatcher, put it: 'The facts of life are Conservative'.\" Later in the speech, she added: \"In the 1980s, Margaret Thatcher broke the cycle of high inflation, low growth and trade union strife, giving Britain back her national pride and economic strength.\" And responding to a Sky News YouGov poll suggesting half of Tory members don't want her to lead the party into the next election, Ms Badenoch claimed she was being criticised just like Baroness Thatcher was when she became opposition leader in the 1970s. \"Pretty much everything that I'm experiencing now, she did,\" she claimed in an interview when she was asked about attacks on her leadership and bad poll results. \"She was written off.\" At the Guildhall dinner, the invited celebs range from national treasure Joan Collins to cricket legend Ian Botham and from Downton Abbey creator Julian Fellowes to bestselling author Jeffrey Archer. \n                  Is it too late for Kemi Badenoch?\n                 \n                  Badenoch pulls off first conference speech as leader, but it is less clear if this will be her last\n                 \n                  Badenoch has done enough to hold off her critics - for now\n                 The principal speaker is Sir Mark Thatcher, who - according to the organisers - will be speaking for the first time ever in public about his mother's life, leadership and legacy. Thatcher-era ministers present will include former Tory leader Michael Howard, former chancellor Norman Lamont and Kenneth Baker, whose cabinet posts included party chairman and home secretary. The black-tie dinner for 500 guests, organised by the Margaret Thatcher Centre charitable project, is taking place 100 years to the day after the Iron Lady's birth and at a venue she knew well. It was at the Guildhall that Lady Thatcher spoke at the annual Lord Mayor's Banquet a dozen times during more than a decade as prime minister, including her famously defiant speech with cricketing metaphors just 10 days before she quit in 1990. \"I am still at the crease, though the bowling has been pretty hostile of late,\" she declared. \"And in case anyone doubted it, can I assure you there will be no ducking the bouncers, no stonewalling, no playing for time. The bowling's going to get hit all round the ground. That is my style.\" She was responding to the resignation of Sir Geoffrey Howe, her ally turned assassin, who hit back the following day in an onslaught in the Commons that has been claimed to be the greatest parliamentary speech of all time. Insisting there was no monopoly of cricketing metaphors, Sir Geoffrey told MPs: \"It's rather like sending your opening batsmen to the crease only for them to find, the moment the first balls are bowled, that their bats have been broken before the game by the team captain.\" With one lethal speech, the \"dead sheep\" so brutally ridiculed by his Labour rival Denis Healey had turned into a roaring lion and Lady Thatcher was finished. Yet by 1990 she had won three general elections, survived the 1984 Brighton bomb, defeated Argentina in the 1982 Falklands war and Arthur Scargill in the 1984-85 miners' strike and privatised dozens of major nationalised industries. She was born 100 years ago above the corner shop of her father, Alfred Roberts, a Methodist lay preacher and town councillor, on the corner of North Parade and Broad Street, Grantham, in Lincolnshire. In the Commons in 2020, culture minister John Whittingdale, previously her political secretary, said of a visit to the Coronation Street set when she was PM: \"She was particularly keen to visit Alf Roberts' corner shop because of course her own father was Alfred Roberts, who ran the grocer's shop in Grantham.\" Describing her early years in her autobiography, The Downing Street Years, she wrote: \"I had grown up in a household that was neither poor nor rich. We had to economise each day in order to enjoy the occasional luxury. \"My father's background as a grocer is sometimes cited as the basis for my economic philosophy. So it was - and is.\" At the Tory conference, the ghost of the Iron Lady hung heavily. Her legacy and references to the 100th anniversary of her birth were everywhere: life-size cardboard cut-outs, biographies, gift mugs, tea towels, a display of outfits worn by her and her famous quotes all over the walls. Whittingdale, now Sir John and a veteran backbench grandee, was much in demand for anecdotes about his former boss and he didn't disappoint. At one event, he told of her team's attempts to persuade her to make a joke in her 1990 conference speech about the Monty Python \"dead parrot\" sketch. The idea was to mock the Liberal Democrats' \"bird of liberty\" symbol, but she didn't get the joke and at one point said to her advisers: \"Just who is this Monty Python?\" Nevertheless, she delivered the gag with aplomb. \"This is an ex-parrot,\" she said of the Lib Dems in her speech. \"It is not merely stunned, it has ceased to be, expired and gone to meet its maker.\"  On the eve of Ms Badenoch's big speech, Sir John told Sky News how on the night before Lady Thatcher's conference speeches she would make endless changes to the script until as late as 2am. \"The poor typist didn't use a word processor, so every time it changed she had to type the whole thing again,\" he said. And asked by Sky News if all party leaders stay up until the small hours making changes to their conference speech, he replied: \"No!\" Although it's the most lavish and spectacular, the Guildhall dinner is just one of many events to celebrate the anniversary. The following evening, her acclaimed biographer Charles Moore and Michael Portillo are promising an insider's portrait of her life at the Royal Geographical Society in London. Now more famous for his TV railway journeys, Portillo began working for the Conservatives in 1976, a year after she became Tory leader. He briefed her in the 1979 election and went on to be a special adviser, whip, and minister in her governments. Read more from Sky News:Tories promise to scrap stamp duty if they win next electionUS ambassador to Israel calls UK cabinet minister 'delusional'Man charged with stalking after allegedly targeting Lib Dem leader Last week, Sir Mark and Carol Thatcher travelled to Budapest for the unveiling of a striking iron statue marking her 100th anniversary and commemorating her role in fighting communism and ending the Cold War. And at Sloane Street Auctions in London later this month, Baroness Thatcher's final portrait is being auctioned, along with further contents of her London home, at the third sale of her furniture and effects. The portrait photograph, taken by Alistair Morrison in the main drawing room at her home in Chester Square, was the final portrait for which she sat. The sale also includes a portrait of Baroness Thatcher in her full Order of the Garter robes. In Grantham, where a statue of Lady Thatcher was erected in 2022, 100th anniversary events this month include a special postcard exhibition, walking talks by a local historian, a display in the town's library and talks by former Tory minister Edwina Currie and Gyles Brandreth. But it's not just friends and supporters who are praising Lady Thatcher as they mark the anniversary. At the Tory conference, her old foe Michael Heseltine, who walked out of her cabinet in 1986 and challenged her in 1990, was full of praise. \"Margaret Thatcher's greatest achievement was to help create the European Single Market,\" Lord Heseltine, now 92, said at a European Movement fringe meeting. \"It was a privilege beyond measure to serve in the Conservative government that was elected in 1979 and led our country for 18 continuous years. \"That government, first under Margaret Thatcher, has been portrayed as a right-wing administration. But however much that may suit the most zealous of my colleagues, the truth was often very different. \"My experience in introducing development corporations, building a new east end of London and at the same time acting as a sort of clerk of works in restoring confidence in Liverpool must rank as one of the most interventionist ministerial experiences in peacetime ever. \"The point is that was all under Margaret Thatcher. I remember no criticism from her. She was, in truth, much more practical than doctrinal.\" At an earlier event, the chairman of the Tory backbench 1922 Committee, Bob Blackman MP, also recalled that when Lady Thatcher became opposition leader in 1975 she struggled initially, patronised not just by Labour prime ministers Harold Wilson and James Callaghan but also by the Tory establishment, he said. Yet in 1979, the '22 chairman declared, she led them to victory in the first of her three general election triumphs. Yes. But unlike Kemi Badenoch, in the 1970s Mrs Thatcher did not have the threat that the Conservatives now face from Nigel Farage."
    },
    {
        "title": "Farming community responds to rumours of an inheritance tax U-turn",
        "description": "The budget may still be more than six weeks away, but rumours of U-turns and changes are already in full swing.",
        "url": "https://news.sky.com/story/damage-has-been-done-farming-community-responds-to-rumours-of-an-inheritance-tax-u-turn-13449030",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-cornock-farm_7049106.jpg?20251012151607",
        "type": "UK",
        "Author": "Dan Whitehead",
        "Date Published": "2025-10-12 14:00:00",
        "Headline": "Plans to introduce a 20% tax on estates worth more than £1m drew tens of thousands to protest in London earlier this year.",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n  The budget may still be more than six weeks away, but rumours of U-turns and changes are already in full swing. Over the last few days, there have been multiple reports that those inside Whitehall are considering tweaks to the controversial inheritance tax (IHT) reforms on farms announced this time last year. Plans to introduce a 20% tax on estates worth more than £1m drew tens of thousands to protest in London, many fearing huge tax bills that would force small farms to sell up for good. Now there are reports the tax threshold could be increased from £1m to £5m (£10m for a married couple) - a shift that would remove smaller farms from being liable to pay.  Senior figures in farming have long believed a rise could be the solution to save the smaller farms and it would satisfy most. However under the proposals, the 50% relief on IHT would be removed for farms above the new threshold. That means bigger farms, responsible for producing a large amount of produce in our supermarkets, could bear the brunt of the tax burden with the Treasury potentially increasing revenues. \n                  UK farmers have 'nothing more to give' as they fear govt will compromise welfare in US-UK trade deal\n                 \n                  Cost of rural crime in Wales at its highest in more than a decade\n                 \n                  Essex set to be the home of Europe's largest low-carbon horticulture site\n                 Two senior farming figures told me today that while a threshold increase is welcome, it does nothing to solve an \"insolvable\" problem. Read more: What's the beef with farmers' inheritance tax? Big farms have more land to sell, but then they become smaller farms and either produce less, or even divide up, to avoid the tax entirely. Richard Cornock runs a small dairy farm in south Gloucestershire, which has been in his family since 1822. He hopes to pass it on to his son Harry, who is now 14 and training to become a farm manager. \"I've been under so much stress like most farmers worrying about this tax,\" he said. \"And I really hope they do push the boundaries on the thresholds, because the million pounds they propose at the moment is ridiculous. \"It's been on my mind the whole time to be honest. I even looked into getting life insurance to insure my life and I can't get it because I had a heart condition. And that was one way I thought I might be able to cover my kids…\" We paused our chat as he was too upset to continue - an illustration of the stress farmers like him have been under over the last 12 months. The government says it won't comment on \"speculation\" about any possible changes, but it has previously defended the IHT reform, saying most estates would not pay and that those who will be liable can spread payments over a decade. Labour is under pressure to do something to appease the angry farmers, a rural vote that turned from the Conservatives at the last election. I ask Richard whether any tweak or row back on IHT will restore faith in Labour? \"The damage has been done,\" he says."
    },
    {
        "title": "Kate's comments on screentime hit a nerve across the UK - so what does science say?",
        "description": "The Princess of Wales touched a few nerves this week when she warned that smartphones and computer screens were creating \"an epidemic of disconnection\" within families.",
        "url": "https://news.sky.com/story/kates-comments-on-screentime-hit-a-royal-nerve-across-the-uk-so-what-does-science-say-13448890",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-phone-tech-money_7047736.jpg?20251010131517",
        "type": "UK",
        "Author": "Miriam Kuepper, news reporter",
        "Date Published": "2025-10-12 07:58:00",
        "Headline": "The Princess of Wales caused ripples on social media, with parents arguing about whether screentime - the amount of time spent using screen-based technology daily - is actually harmful for children.",
        "Content": "By Miriam Kuepper, news reporter  The Princess of Wales touched a few nerves this week when she warned that smartphones and computer screens were creating \"an epidemic of disconnection\" within families. In an essay co-authored by a Harvard professor, Kate wrote: \"We're raising a generation that may be more 'connected' than any in history while simultaneously being more isolated, more lonely, and less equipped to form the warm, meaningful relationships that research tells us are the foundation of a healthy life.\" Her words caused ripples on social media, with parents arguing about whether screentime - the amount of time spent using screen-based technology daily - is actually harmful for children. But what does the science say? Is screentime actually harmful for children? Evidence on whether screentime is actually harmful for children is inconsistent, with researchers showing that while screentime and its alleged negative impacts on children could be related, there is no undisputable evidence that it causes them. Concerns have centred around findings that the wellbeing and mental health of children and young people has declined in recent years with NHS Digital data showing that 18% of those aged 7 to 16 years had a probable mental health disorder in 2022 compared with 9.7% in 1999, the Education Committee reported in May 2024. \n                  As food delivery drones take off in Ireland, here are the most popular items\n                 \n                  Tom Hollander on AI actor Tilly Norwood : 'Perhaps I'm not scared enough'\n                 \n                  Prince Harry and Meghan named Humanitarians of the Year\n                 Debate has been widespread as to the causes of this, with social media and smartphone use being one of the drivers, according to a 2025 University of Manchester study. As the debate as raged, several MPs have said a ban on smartphones for under-16s should be considered. The Education Committee's report on the impact of screentime on the education and well-being of children pointed to evidence that smartphones and computers disrupt pupils' learning both at home and in the classroom. It also highlighted research suggesting that children who were exposed to longer than two hours a day of recreational screen time on smartphones and playing video games had worse working memory, processing speed, attention levels, language skills and executive function compared with those who did not. The committee urged the government to advise parents of babies that they should give sufficient attention to face-to-face interaction - a key element of linguistic and social development - and warn of the risks of screen time in reducing opportunities for this. In its conclusion, it said: \"For children and adolescents alike, the rapid rise of the use of screens and devices has come at a substantial cost and Government needs to do more across departments to protect them from addiction, online harms and the mental health impacts of extensive use of devices.\" The committee's warning on babies was supported by Carlota Nelson, writer and director of Brain Matters, who wrote for Unicef's parenting site: \"Research has shown that screentime inhibits young children's ability to read faces and learn social skills, two key factors needed to develop empathy.\" \"Face-to-face interactions are the only way young children learn to understand non-verbal cues and interpret them. Exposure to screens reduces babies' ability to read human emotion and control their frustration,\" she wrote. \"It also detracts from activities that help boost their brain power, like play and interacting with other children.\" The Royal College of Psychiatrists (RCP) said in a report in 2020 - before the COVID pandemic and platforms like TikTok became as popular as they are now - that screentime exposes children and young people to potentially distressing content, bullying, gambling, and other issues. It said that while evidence for causal links was still developing, there was evidence to suggest that digital technology can affect weight, mood, thoughts of suicide and self-harm and body image. 'No evidence for harm' - but potential benefits? The National Institute for Health and Care Research (NIHR) found little evidence to suggest that spending more time on social media was associated with more mental health problems in young people, the Education Committee said in its report. Equally, another study involving various researchers, including some from the University of Oxford, found no evidence to show that screentime impacted children's brain function or well-being. Nearly 12,000 children in the US were analysed in the 2023 study, and even with participants who had high rates of digital engagement, there was no evidence of impaired functioning in the brain development of the children. Jack Miller, the first author who analysed the data as part of his thesis at the Oxford Internet Institute, said: \"If screen time had an impact on brain development and well-being, we expected to see a variety of cognitive and well-being outcomes that this comprehensive, representative research did not show.\" According to the National Society for the Prevention of Cruelty to Children (NSPCC), screentime can be beneficial for children by helping them create communities online and sustain friendships through social media or online gaming. Read more:Two-hour screen time limit considered by governmentSociety-wide approach needed to stop pupils doom scrolling Screentime was also credited with a reduction in feelings of loneliness in some children. Despite several studies being carried out, there is as yet no definitive answer on whether screentime harms children. The government says it encourages and supports further research in this area. The Department for Science, Innovation and Technology announced a feasibility study on methods and data to understand the impact of smartphones and social media on children's wellbeing in November last year. The central question of the research, carried out by the University of Cambridge, is which methods would be most effective in determining the causal effects of social media and smartphones on children's (3-21 years) developmental outcomes in the next 2-3 years. How much screentime is okay? The Education Committee suggests that screentime should be minimal for younger children and better balanced with face-to-face socialisation and physical activity for older ones. The government said in response to the committee's report that screentime needed to be proportionate and shouldn't displace opportunities for children to socialise face-to-face and take part in physical activities. Babies less than a year old shouldn't spend any time on screens at all, while one-year-olds should not have any sedentary screentime, which includes watching TV or videos and playing computer games, according to WHO guidelines. The organisation recommends that children aged two should not spend more than one hour with sedentary screentime per day. The NHS advises no more than two hours a day in front of a screen, even for older children."
    },
    {
        "title": "Inside the rooms where Israeli hostages will spend their first nights of freedom",
        "description": "A teddy sits on a bed in a bright hospital room. Beside it is a small fridge stocked with bottled water and Coca-Cola.",
        "url": "https://news.sky.com/story/inside-the-homecoming-unit-ready-to-welcome-israeli-hostages-13448955",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-israel-hostages_7048955.jpg?20251012122338",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-10-12 11:04:00",
        "Headline": "With phase one of Donald Trump's peace plan now under way, an entire nation is holding its breath for the return of the hostages, not least the medical teams preparing to receive them.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  A teddy sits on a bed in a bright hospital room. Beside it is a small fridge stocked with bottled water and Coca-Cola. While the bear might make you think a child is about to arrive, this room will soon be welcoming one of the 20 Israeli hostages believed to be alive in Gaza. With phase one of Donald Trump's peace plan now under way, an entire nation is holding its breath for the return of the hostages, not least the medical teams preparing to receive them. Gaza latest: Israel prepares for hostages' release Sky News was given special access to one of the teams in the Rabin Medical Center in Petah Tikva, a city north-east of Tel Aviv. It was sobering and emotional, but also inspiring, talking to its doctors and nurses as they showed us around what one calls the \"homecoming unit\". Director of Nursing Dr Michal Steinman took us into the light airy rooms where hostages will be allowed to recover at their own speed in private, choosing when and for how long they emerge, slowly reengaging with a world they've not known for two years. She explained that each of the hostages - who are all men - will be given their own private room, where a gift basket filled with thoughtful items such as a teddy, a blanket, slippers and a phone charger awaits them. The teddy is there to help bring comfort to the freed captives. \"Our research says each one of us has a child inside,\" Dr Steinman told me. \"We need something to pet and feel soft, and reassure them after the lack of senses for such a long time.\" Phones, she said, will be provided by the army. Read more:The hostages believed to be aliveDrones reveal devastation in Gaza The families will also bring items from home to make the area feel more familiar to their loved ones as they slowly adjust to freedom. The men will also have access to other areas, including a private living space where they can spend time with loved ones or greet any visiting dignitaries. Their families will also be provided with rooms to stay in, as well as an area for the children of the hostages when they visit. Medical equipment is kept in dedicated treatment rooms as part of an effort to make the rooms feel more like accommodation than a hospital. While the unit is pristine and ready for the new arrivals, it has previously been used to house other hostages released by Hamas. Staff shared anecdotes revealing what may lie ahead. Dr Steinman told us of one released hostage who had had trouble not with sleeping, but with waking up. \"When I opened my eyes,\" they had told her, \"I was thinking that I'm still in a dream because there's no way that I opened my eyes and I'm not in the tunnel. I thought, 'it's a dream inside a dream'.\" The hostages, she said, \"can't believe for the first moments they're not in other place.\" Dr Steinman found another freed captive \"stuck\" and standing still after opening the refrigerator. \"I told him, 'It's hard for you to choose?',\" she explained. \"And he said, 'I'm just amazed at the colours. All I've seen for 100 days is black, white and brown'.\" The professor reinventing 'hostage medicine' For the head of the centre, Professor Noa Eliakim-Raz, and her team, the return of the hostages will be the culmination of two years of painstaking work. They have effectively reinvented what they call 'hostage medicine', learning from the treatment of groups of hostages received during this war. She is a serious and dedicated clinician. With professional precision, she told me of the challenges ahead, including the life-threatening risks of mistreating malnourished hostages held for so long underground. Then she gave us a glimpse into the human side of their work. \"All the team, we've prepared for so long, I mean really, we've been in this for two years and all the time, we're preparing and ready,\" she said. \"This ward that you saw is ready every day.\" How does she feel as the hostages' arrival draws near? \"I feel very grateful, and I think that's the strongest emotion, to be part of this,\" she said. Clearly moved, Professor Noa had to pause and collect her emotions, her eyes welling up when asked what she'd be thankful for most. \"I think being part of a small step,\" she began, before pausing again. \"A small step of making them feel hugged again and trusting the system.\" It will, she said, be a big relief when it's over. Professor Noa is writing a first-of-its-kind multi-disciplinary protocol for treating long-term hostages, literally rewriting the book on how to return them to normality. Her department did not exist before October 7. In the two years since its inception, it has pioneered a form of treatment involving many different disciplines to maximise the chances of recovery. The Rabin Medical Center's staff believe the lessons they've learned will benefit doctors around the world in future. But they hope never to have to use them on Israelis again."
    },
    {
        "title": "Britain has been playing a role behind the scenes of Trump's deal between Israel and Hamas | Beth Rigby",
        "description": "Sir Keir Starmer join world leaders at a historic summit in Egypt today - to witness the signing of the Gaza peace plan to end two years of conflict, bloodshed and suffering that has cost tens of thousands of lives and turned Gaza into a wasteland.",
        "url": "https://news.sky.com/story/fears-trump-may-lose-focus-after-praise-for-gaza-peace-deal-at-egypt-summit-13449213",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-sharm-el-sheik_7049329.jpg?20251012210257",
        "type": "World",
        "Author": "Beth Rigby",
        "Date Published": "2025-10-12 19:30:00",
        "Headline": "Ahead of the prime minister setting out his ambition for the UK to play a leading role in the next phase of the peace plan, political editor Beth Rigby reveals the immediate focus for the UK and other nations will be to get aid into Gaza with the UK committing £20m on Monday.",
        "Content": "\n          Political editor\n              @BethRigby\n  Sir Keir Starmer join world leaders at a historic summit in Egypt today - to witness the signing of the Gaza peace plan to end two years of conflict, bloodshed and suffering that has cost tens of thousands of lives and turned Gaza into a wasteland. Travelling over to Egypt, flanked by his national security adviser Jonathan Powell, the prime minister told me it was a \"massive moment\" and one that is genuinely historic. US President Donald Trump moved decisively last week to end this bloody war, pushing Israeli Prime Minister Benjamin Netanyahu and Hamas into a ceasefire as part of his 20-point peace plan. In the flurry of the following 48 hours, Sir Keir and another 20 or so leaders were invited to Egypt to bear witness to the signing of this deal, with many of them deserving some credit for the effort they made to bring this deal around - not least the leaders of Qatar, Egypt and Turkey, who pressed Hamas to sign up to this deal. Today, the remaining 20 living hostages are finally set to be released, along with the bodies of another 28 who were either killed or died in captivity, and aid is due to flow back into a starving Gaza. Some 1,200 Israelis were killed on 7 October 2023, with another 250 taken hostage. In the subsequent war, most of Gaza's two million population has been displaced. More than 67,000 Gazans have been killed, according to Palestinian health officials. Then, the signing ceremony is due to take place this afternoon in Sharm el Sheikh. It will be a momentous moment after a long and bloody war. \n                  When will the Israeli hostages be released?\n                 \n                  My interview with a Hamas leader was a glimpse into the unpredictable and frankly unbelievable world of global politics right now\n                 \n                  Drones capture staggering images of Gaza devastation - as people find nothing left\n                 But it is only just the beginning of a long process to rebuild Gaza and try to secure a lasting peace in the region.  The immediate focus for the UK and other nations will be to get aid into Gaza, with the UK committing £20m for water, sanitation and hygiene services for Gazans. But the focus for the UK and other European allies is what happens after the hostages are released and Israel withdraws its troops. What happens next is a much bigger and more complicated task: rebuilding Gaza; turning it into a terrorist-free zone; governing Gaza - the current plan is for a temporary apolitical committee; creating an international stabilisation force and all the tensions that could bring about - which troops each side would allow in; a commitment for Israel not to occupy or annex Gaza, even as Netanyahu makes plain his opposition to that plan. The scale of the challenge is matched by the scale of devastation caused by this brutal war. The prime minister will set out his ambition for the UK to play a leading role in the next phase of the peace plan. Back home, the UK is hosting a three-day conference on Gaza's recovery and reconstruction. Last week, France hosted European diplomats and key figures from Middle Eastern countries, Egypt, Jordan, Saudi Arabia and Qatar - and later this week, the German chancellor is hoping to organise a conference on the reconstruction of Gaza with the Egyptians. But in reality, European leaders know the key to phase two remains the key to phase one, and that's Donald Trump. As one UK figure put it to me over the weekend: \"There is lots of praise, rightly, for the US president, who got this over the line, but the big challenge for us post-war is implementing the plan. Clearly, Arab partners are concerned the US will lose focus.\" The prime minister knows this and has made a point, at every point, to praise Mr Trump. His cabinet minister Bridget Phillipson learned that diplomatic lesson the hard way yesterday when she was publicly lambasted by the US ambassador to Israel Mike Huckabee for suggesting to my colleague Trevor Phillips that the UK \"had played a key role behind the scenes\" and failed to mention Mr Trump by name. \"I assure you she is delusional,\" tweeted Governor Huckabee. \"She can thank @realDonaldTrump anytime just to set the record straight\". Today, leaders will rightly be praising Mr Trump for securing the breakthrough to stop the fighting and get the remaining hostages home. But this is only the beginning of a very long journey ahead to push through the rest of the 19-point plan and stop the region from falling back into conflict. Britain has, I am told, been playing a role behind the scenes. The PM's national security adviser Mr Powell was in Egypt last week and has been in daily touch with his US counterpart Steve Witkoff, according to government sources. Next week the King of Jordan will come to the UK. Part of the UK's task will be to get more involved, with the government and European partners keen to get further European representation on Trump's temporary governance committee for Gaza, which Tony Blair (who was not recommended or endorsed by the UK) is on and Mr Trump will chair. The committee will include other heads of states and members, including qualified Palestinians and international experts. As for the former prime minister's involvement, there hasn't been an overt ringing endorsement from the UK government. It's helpful to have Mr Blair at the table because he can communicate back to the current government, but equally, as one diplomatic source put it to me: \"While a lot of people in the Middle East acknowledge his experience, expertise and contact book, they don't like him and we need - sooner rather than later - other names included that Gulf partners can get behind.\" Today it will be the US, Egypt, Qatar and Turkey that sign off on the peace plan they directly negotiated, as other Middle Eastern and European leaders, who have flown into Sharm el Sheikh to bear witness, look on. But in the coming days and weeks, there will need to be a big international effort, led by Mr Trump, not just to secure the peace, but to keep it."
    },
    {
        "title": "When will the Israeli hostages be released?",
        "description": "Hamas is expected to release all hostages still in captivity as part of a ceasefire deal. ",
        "url": "https://news.sky.com/story/when-will-the-israeli-hostages-be-released-13449104",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hostages-square-tel-aviv_7048783.jpg?20251012182615",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-12 16:21:00",
        "Headline": "The 20 people who are still alive have been held captive for more than two years.",
        "Content": " Hamas is expected to release all hostages still in captivity as part of a ceasefire deal.  The 20 living captives, who are all men, have been held for more than two years after they were among 251 people kidnapped when Hamas-led militants launched a surprise attack on Israel on 7 October 2023. Gaza latest: Don't make a 'sick display' of hostages, Hamas warned  The bodies of another 28 hostages who were killed in captivity are also expected to be returned to Israel. Exact details of the handover are still unclear but this is what we know. When is the deadline?  Hamas have until 10am UK time to release the hostages as part of Donald Trump's 20-point peace plan. What time will they actually be freed?  There have been mixed messages about the exact timings and Israel's prime minister Benjamin Netanyahu said Israel was ready to \"immediately\" receive the captives. US vice-president JD Vance said earlier on Sunday the hostages would be released \"any moment now\". But the most concrete statement we've heard comes from Israeli government spokeswoman Shosh Bedrosian, who said they will be released \"early Monday morning\". Hamas has previously indicated it would take more time to hand over the bodies of the hostages who have died to Israel.  How will the handover work?  Israeli government spokeswoman Shosh Bedrosian said the 20 hostages are expected to be released together at one time to the Red Cross. She said they will be taken in \"six to eight\" vehicles without \"any sick displays by Hamas\", referring to the previous release ceremonies staged by the militant group. The hostages will then be driven to forces inside Israel-controlled parts of Gaza before they are transferred to southern Israel, where they will reunite with their families. Read more:Yalda Hakim speaks to Hamas leaderHow withdrawal of Israeli troops could work \"Israel is ready if a living hostage requires any urgent medical attention, they will be brought to a medical facility immediately,\" she said. She said the \"entire nation of Israel\" will embrace those killed in captivity and \"ensure proper Jewish burials\". The US president is expected to arrive in Israel on Monday morning and will meet with families of the hostages, according to a schedule released by the White House.  Where will they spend their first nights of freedom?  Pictures released by the Israeli government show the light airy rooms where the hostages will be welcomed. The comfortable chairs, big television, and bedrooms with clean sheets and baskets full of toiletries will be a world away from the dark Hamas tunnels where they have been kept in Gaza for the past 734 days. Sky News was given special access to one of the teams in the Rabin Medical Centre in Petah Tikva, a city northeast of Tel Aviv, which is preparing to receive them. Director of Nursing Dr Michal Steinman said the hostages will be given their own private room, where a gift basket filled with items such as a teddy, a blanket, slippers and a phone charger awaits them."
    },
    {
        "title": "Palestinian girl, 12, dies after suffering from malnutrition for months - reports",
        "description": "Huda Abu al Naja, a 12-year-old Palestinian girl who suffered from malnutrition for months, has died in Nasser Hospital in Gaza, according to The Times of Israel.",
        "url": "https://news.sky.com/story/palestinian-girl-12-dies-after-suffering-from-malnutrition-for-months-13449071",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-malnutrition_6972713.jpg?20250724154712",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-12 15:09:00",
        "Headline": "Huda lost half her bodyweight in a matter of months, forcing her to be admitted to hospital. In July,  she said she knew she looked unwell and that the war in Gaza had \"changed\" her.",
        "Content": " Huda Abu al Naja, a 12-year-old Palestinian girl who suffered from malnutrition for months, has died in Nasser Hospital in Gaza, according to The Times of Israel. Warning: This article contains images that some readers may find distressing. Huda died of a \"simple infection\" on Friday that her immune system, weakened by months of malnutrition, could not fight off, the paper reported, citing a journalist from another Israeli newspaper, Haaretz. When a Sky News team visited the hospital in July, they were told Huda had lost half her body weight since March. Her mother said her needs were simple: fresh fruit and vegetables, fish and a bit of meat - but there was \"virtually nothing to eat\" after Israel shut the crossings into Gaza, and imposed a blockade. Many of the children in the malnutrition ward she was on were being given dextrose in the absence of food - a mixture of sugar and water which has no nutritional value. Ongoing restrictions on the entry of food aid have created a famine in Gaza City, according to the UN-backed Integrated Food Security Phase Classification (IPC) and aid agencies, with mass hunger throughout the rest of the territory. Data from Israeli border officials shows that the amount of food entering Gaza has frequently been below the \"bare minimum\" that the UN's famine-review agency says is necessary to meet basic needs. In July, Huda said she knew she didn't look well. \"Before, I used to look like this,\" Huda said, pointing to a picture on her tablet. \"The war changed me. Malnutrition has turned my hair yellow because I lack protein. You see here, this is how I was before the war.\" She was pleading for help. \"Can you help me travel abroad for treatment? I want to be like you. I'm a child. I want to play and be like you,\" she said. International organisations had been campaigning for months before her death to secure her evacuation from the Gaza Strip, Haaretz reported. To date, Hamas-run Gaza's health ministry says 461 people have died from malnutrition, including 157 children. Read more:Inside the rooms where Israeli hostages will spend their first nights of freedomDrones reveal staggering devastation - as Gazans find nothing left As part of Donald Trump's 20-point peace plan, Israel has agreed to reopen five border crossings to help with the flow of food and other aid supplies into Gaza. Israel's defence body overseeing aid, COGAT, said the amount entering Gaza was expected to rise to around 600 trucks each day, starting on Sunday.  Egypt said it was also sending 400 trucks on Sunday, with many pictured near the Rafah crossing in southern Gaza. They were seen queuing at the border and getting mobbed by dozens of people in Khan Younis in the southern Gaza Strip, where Nasser Hospital is based."
    },
    {
        "title": "Trump warns US may send long-range Tomahawk missiles to Ukraine unless Russia ends war",
        "description": "Donald Trump has warned the US may send long-range Tomahawk missiles to Ukraine if Russia doesn't end the war soon.",
        "url": "https://news.sky.com/story/ukrainian-counteroffensive-in-zaporizhzhia-as-russia-tries-to-cripple-power-grid-13449178",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-tomahawk-missile_7049416.jpg?20251013014143",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-12 18:30:00",
        "Headline": "These missiles have a range of 1,550 miles - long enough to strike deep inside Russia. Moscow's warned this would seriously damage relations with the US.",
        "Content": " Donald Trump has warned the US may send long-range Tomahawk missiles to Ukraine if Russia doesn't end the war soon. The president was speaking aboard Air Force One, where he is flying to the Middle East to mark a peace plan in Gaza. Vladimir Putin has previously suggested this would seriously damage relations between Moscow and Washington. Mr Trump told reporters: \"I might say 'Look: if this war is not going to get settled, I'm going to send them Tomahawks'. \"The Tomahawk is an incredible weapon, very offensive weapon. And honestly, Russia does not need that.\" He went on to reveal that the prospect of Ukraine receiving these missiles has already been raised in conversations with Volodymyr Zelenskyy. The Ukrainian president told Fox News that Tomahawks would only be used to pursue military goals - and not to attack civilians. \n                  Putin admits Russia shot down Azerbaijani passenger jet, killing 38\n                 \n                  Ukraine says it has struck oil terminal in Crimea and key Russian explosives factory\n                 \n                  At least five killed in Ukraine after Russian missile and drone attack - as Poland forced to scramble jets\n                 These missiles have a range of 1,550 miles (2,500km) - long enough to strike deep inside Russia, including Moscow. \"Do they want to have Tomahawks going in that direction? I don't think so,\" Mr Trump said of Russia. \"I think I might speak to Russia about that. Tomahawks are a new step of aggression.\"  It comes after Mr Zelenskyy claimed a Ukrainian counteroffensive has made gains along the frontline in the Zaporizhzhia region. Kyiv has said its forces have been advancing around the town of Dobropillia, near a key logistical target for Russian troops in the Donetsk region, for several weeks. In his nightly address yesterday, the Ukrainian president said his forces had also made gains of more than 3km (1.8 miles) further south in Zaporizhzhia. A Russian defence ministry report made no reference to Ukrainian advances, but said Moscow's troops had hit Ukrainian troops and equipment in Zaporizhzhia. The countries have been giving conflicting accounts of the situation along the frontline - which is estimated to stretch 775 miles (1,250km) - in the war that has raged for more than three-and-a-half years. Mr Putin told senior officers last week that Moscow's forces had captured 1,930 square miles of territory this year and have held the strategic advantage through all sectors of the frontline. The next day, Mr Zelenskyy said Ukrainian forces were inflicting heavy losses on Russian troops near Dobropillia and were \"defending ourselves along all other directions\". Meanwhile, Russia attacked Ukraine's power grid over the weekend as part of an ongoing campaign to cripple the country's energy infrastructure before winter. \"Russia continues its aerial terror against our cities and communities, intensifying strikes on our energy infrastructure,\" Mr Zelenskyy wrote on X yesterday. Read more from Sky News:Palestinian girl, 12, 'dies' after suffering malnutrition for monthsNiece of Kenyan woman 'murdered by British soldier' comes to UK to seek justice The Ukrainian president said Russia had launched \"more than 3,100 drones, 92 missiles, and around 1,360 glide bombs\" over the past week. He also called for tighter sanctions on buyers of Russian oil and said he had a \"very productive\" phone call with Donald Trump in which they discussed \"air defence, resilience, and long-range capabilities\", along with \"details related to the energy sector\". A senior Ukrainian delegation is set to visit the US this week. Kremlin spokesman Dmitry Peskov said in remarks published on Sunday that \"the topic of Tomahawks is of extreme concern\"."
    },
    {
        "title": "Madagascar president says coup under way as soldiers join protesters",
        "description": "The president of Madagascar Andry Rajoelina has claimed a coup is under way after weeks of intense youth-led protests.",
        "url": "https://news.sky.com/story/madagascar-president-says-coup-under-way-as-soldiers-join-protesters-13449211",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-madagascar-antananarivo_7049319.jpg?20251012203506",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-12 19:28:00",
        "Headline": "Water and power outages triggered protests in the Indian Ocean country, which have escalated due to larger dissatisfaction with the leadership of president Rajoelina.",
        "Content": "The president of Madagascar Andry Rajoelina has claimed a coup is under way after weeks of intense youth-led protests. Water and power outages triggered protests in the Indian Ocean country on 25 September, with the young population - of whom around three-quarters are believed to live in poverty - continuing to riot over general dissatisfaction with Mr Rajoelina. In a major blow to the president, troops from the elite army unit CAPSAT, which helped him seize power during a coup in 2009, joined protesters on Saturday for one of the biggest demonstrations since the unrest began. Colonel Michael Randrianirina, a commander of the CAPSAT unit, said his troops had exchanged fire with security forces who were attempting to quell the protests in the capital Antananarivo and that one of his soldiers had been killed. A unit of the paramilitary gendarmerie, which had been tackling the protests together with the police, also turned on the government on Sunday, saying it was coordinating with the CAPSAT headquarters. The Intervention Forces of the National Gendarmerie said in a statement broadcast on Real TV: \"All use of force and any improper behaviour towards our fellow citizens are prohibited, as the gendarmerie is a force meant to protect people and not to defend the interests of a few individuals.\" Mr Rajoelina's office released a statement saying he \"wishes to inform the nation and the international community that an attempt to seize power illegally and by force\" had been \"initiated\". \n                  Thousands of endangered tortoises rescued from floods in Madagascar after Cyclone Dikeledi\n                 \n                  Madagascar set to castrate child rapists after parliament passes law\n                 \n                  Madagascar: At least 12 killed in stampede at Indian Ocean Island Games opening ceremony\n                 \"In view of the extreme gravity of this situation,\" the president's office \"strongly condemns this attempt at destabilisation and calls upon all forces of the nation to unite in defence of constitutional order and national sovereignty,\" it said. Later on Sunday, however, Reuters reported that the president's whereabouts were unknown, with several people in the region believing he had left the country. Col Randrianirina denied any coup had taken place, but the unit claimed to have taken control of all of Madagascar's armed forces and said it had installed a new leader of the military, General Demosthene Pikulas. \"We responded to the people's call,\" Col Randrianirina told reporters on Sunday, declining to say if they had asked Mr Rajoelina to resign. Mr Rajoelina dismissed his entire government, including the prime minister, on 29 September in a failed attempt to appease the protesters. Speaking to crowds from an armoured vehicle on Saturday, Col Randrianirina said the president, his new prime minister, the minister of the gendarmerie and the commander of the gendarmerie \"must leave power. That's all.\" \"Do we call this a coup? I don't know yet,\" Col Randrianirina said. The protests have been led by a group calling itself \"Gen Z Madagascar\", and have been joined by civic groups and trade unions. The United Nations says the demonstrations have left at least 22 people dead and dozens injured - numbers disputed by the government. The US Embassy in Madagascar has advised American citizens to shelter-in-place due to a \"highly volatile and unpredictable\" situation, while the African Union urged all parties, \"both civilian and military, to exercise calm and restraint.\" Read more:Palestinian girl, 12, 'dies' after suffering from malnutrition for monthsNiece of Kenyan woman 'murdered by British soldier' comes to UK to seek justice Protesters have brought up a range of issues, including poverty and the cost of living, access to tertiary education, and alleged corruption and embezzlement of public funds by government officials and their families and associates. Mr Rajoelina, 51, first became the leader of a transitional government following a 2009 coup that forced then President Marc Ravalomanana to flee the country and lose power, before he was elected president in 2018 and re-elected in 2023 in a vote boycotted by opposition parties. Madagascar, a large island of 31 million people off the east coast of Africa, has had several leaders removed in coups and has a history of political crises since it gained independence from France in 1960."
    },
    {
        "title": "Agnes Wanjiru: Niece of Kenyan woman 'murdered by British soldier' comes to UK to seek justice",
        "description": "Esther Njoki was only eight years old when her aunt Agnes Wanjiru was killed in 2012. ",
        "url": "https://news.sky.com/story/agnes-wanjiru-niece-of-kenyan-woman-murdered-by-british-soldier-comes-to-uk-to-seek-justice-13449012",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-agnes-wanjiru_6637544.jpg?20251012165306",
        "type": "World",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-10-12 13:04:00",
        "Headline": "Kenyan prosecutors have issued an arrest warrant for the suspect accused of killing Agnes near the British Army Training Unit in Kenya (BATUK).",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  Esther Njoki was only eight years old when her aunt Agnes Wanjiru was killed in 2012.  She watched as her mother Rose frantically searched for her sister Agnes for 61 days before the body was found in a hotel septic tank. Agnes's baby Stacey was only five months old at the time her mother was murdered and in the thirteen years since, Rose has raised Stacey as her own child. Her daughter Esther has grown to become the family spokesperson, urging the Kenyan and British governments to deliver justice. In all this time, the British soldier accused of murdering Agnes has been living freely in the UK. \"I knew I had to take this responsibility, especially because of her daughter. She was left at five months old and is turning 14, and I always feel bad for her because it is a lot knowing what happened to her mum and knowing that the government knew and never took any action,\" Esther tells us, by the tree that marks her aunt's grave site in a Nanyuki cemetery. Esther is now 21 years old, the same age Agnes was when she was killed. Instead of spending her time at university in Nairobi, she is preparing for an important meeting in London. \n                  Doomsday cult leader talked followers into deadly ritual while still in jail, police say\n                 \n                  Police in Kenya begin exhuming shallow graves of suspected cult victims\n                 \n                  More than a dozen people killed in Kenya during anti-government protests, human rights group says\n                 On Tuesday, Esther will sit with Defence Secretary John Healey and discuss on British soil the case of her aunt's murder. \"I feel excited but I am also feeling sad because at 21 years, I should not be doing this. I should be doing other things and enjoying my life but since the British government and Kenyan government failed that is why I am planning all this - to go and lobby for Agnes.\" The Kenyan national prosecuting authority has finally issued an arrest warrant for the British soldier charged with murdering Agnes. The Kenyan government has expressed intent to request his extradition, but the formal process is yet to begin. \"Although they have taken long and [are doing this] because of the pressure put on them, I think something will be done because the warrant of arrest has been issued. But again, it is a long journey ahead of us. Extradition might take as long as five years,\" says Esther. \"We want the guy to be extradited here so that he can be a lesson for other soldiers who think they can come to Kenya and do anything that they feel like doing because they have power.\" Agnes worked as a hairdresser and sex worker at the time she was killed. In November 2022, the Ministry of Defence banned British soldiers from soliciting sex overseas but an internal service inquiry found there have been low to moderate violations of the ban in Kenya. Maryanne Wangui, an old friend of Agnes and leader of the sex workers alliance in Nanyuki, says that British soldiers are still paying for sex in the town, but much more discreetly. \"They are using Airbnbs and they have their pimps who they are using to bring those sex workers to their houses and they do their stuff there and pay them there. We are not protected because if a girl is killed in an Airbnb - who will cater for that death?\" she asks. The Ministry of Defence has told Sky News: \"There is absolutely no place for sexual exploitation and abuse by people in the British Army. \"It is at complete odds with what it means to be a British soldier. It preys on the vulnerable and benefits those who seek to profit from abuse and exploitation.\" The MoD also sent this comment on Agnes Wanjiru's murder: \"Our thoughts remain with the family of Agnes Wanjiru and we remain absolutely committed to helping them secure justice. \"We understand that the Kenyan Director of Public Prosecutions has determined that a British National should face trial in relation to the murder of Ms Wanjiru in 2012. This is subject to ongoing legal proceedings and we will not comment further at this stage.\" Agnes's hometown Nanyuki is the main base for the British Army Training Unit in Kenya (BATUK). The market town was first set up as a white frontier settlement in the 1920s after the mass expulsion of Maasai from the Laikipia plateau by British colonial forces. It became favoured by retired British soldiers who wanted to turn to agriculture and sixty years since Kenya's independence, the town still feels trapped in the past. Public hearings last year saw dozens of Kenyans allege violations by the BATUK in Laikipia and Samburu. Local politicians, religious leaders and village elders were among those from across the region to share their grievances with the BATUK and requested compensation from the UK government. Esther made her aunt's case to a committee at a community hall in Nanyuki, and now she will make her case on British soil. \"Neocolonialism is still in Kenya. Even our government knew what these soldiers had done but they never took action, they do not protect their victims - their own citizens,\" Esther tells us, hours before her flight to the UK. \"For sure, these guys are still colonising us because why are they training here? They have their own land.\""
    },
    {
        "title": "'You are coming home': Trump envoy reassures hostages",
        "description": "Donald Trump's special envoy, Steve Witkoff, has reassured the remaining Israeli hostages held in Gaza that they will soon be reunited with their families, saying that \"miracles can happen\", as the country prepares for a momentous reunion.",
        "url": "https://news.sky.com/story/you-are-coming-home-trump-envoy-reassures-hostages-as-israel-prepares-for-emotional-reunion-13448847",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-witkoff-hostage-square_7048781.jpg?20251012051014",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-12 03:54:00",
        "Headline": "A large crowd in Tel Aviv erupted in cheers as Donald Trump's special envoy, Steve Witkoff, vowed the remaining hostages would soon return home, while world leaders prepare to head to Egypt for a peace summit.",
        "Content": " Donald Trump's special envoy, Steve Witkoff, has reassured the remaining Israeli hostages held in Gaza that they will soon be reunited with their families, saying that \"miracles can happen\", as the country prepares for a momentous reunion. In an emotional speech at a rally in Tel Aviv's Hostages Square on Saturday, Mr Witkoff directly addressed the hostages, declaring, \"You are coming home\", prompting loud cheers from the tens of thousands gathered in the square. \"Your stories have lived in every heart, here tonight and in mine since I began this job,\" he said. \"And now, as you return to the embrace of your families and your nation, know that all of Israel and the entire world stands ready to welcome you home with open arms and endless love.\" Speaking alongside Mr Trump's daughter and son-in-law, Ivanka Trump and Jared Kushner, Mr Witkoff said he had \"dreamed of this night\" and that \"it's been a long journey\". Some in the crowd yelled, \"Thank you, Trump, thank you Witkoff,\" and booed when the envoy mentioned Israeli Prime Minister Benjamin Netanyahu. Addressing the families of the hostages, Mr Witkoff said, \"each and every one of you have carried the moral weight of this nation\". \n                  Gaza latest: Trump declares 'war is over' - as he heads to Israel before hostage release\n                 \n                  Inside the rooms where Israeli hostages will spend their first nights of freedom\n                 \n                  Britain has been playing a role behind the scenes of Trump's deal between Israel and Hamas | Beth Rigby\n                 \"Your courage has moved the world and has touched me in ways that I have never been touched before in my entire life,\" he added.  Mr Kushner said they would celebrate on Monday, when the remaining hostages will be released under the terms of the ceasefire and hostage-prisoner exchange deal. Twenty hostages are believed to still be alive, 26 have been declared dead, while the fate of two more is unknown. The president's son-in-law, who played a key role in the negotiations, also acknowledged the \"suffering\" in Gaza. Meanwhile, the president's daughter, Ivanka, addressed the crowds, saying, \"the president wanted me to share, as he has with so many of you personally, that he sees you, he hears you, he stands with you always\". Once all the hostages are released, Israel will free 250 Palestinian prisoners serving life sentences and 1,700 Gazans detained after the October 7 attacks.  Israelis at the rally hugged, took selfies, and many waved US flags. \"It's a really happy time, but we know that there are going to be some incredibly difficult moments coming,\" said Yaniv Peretz, who was in the crowd. Gaza 'completely destroyed' The speeches in Tel Aviv came as the Gaza ceasefire continued to hold for a second day, with tens of thousands of Palestinians returning to neighbourhoods devastated by the conflict. \"Gaza is completely destroyed. I have no idea where we should live or where to go,\" said Mahmoud al Shandoghli in Gaza City as bulldozers clawed through the wreckage. According to the agreement, hundreds of trucks per day are expected to surge into Gaza. The World Food Programme has announced it is prepared to reopen 145 food distribution centres across Gaza, once Israel allows increased aid deliveries.  While details about the timing and method of food entry into Gaza remain uncertain, reopening these sites would significantly expand access to food. Roughly 170,000 tonnes of food aid are currently stockpiled in neighbouring countries, awaiting Israeli approval to enter. About 200 US troops have arrived in Israel to monitor the ceasefire with Hamas. They will establish a centre to coordinate the delivery of humanitarian aid and provide logistical and security support. \"This great effort will be achieved with no US boots on the ground in Gaza,\" Admiral Brad Cooper, the head of the US military's Central Command, has said.  Summit in Egypt World leaders and diplomats are heading to the Egyptian city of Sharm el-Sheikh for an international summit on Monday aimed at securing permanent peace terms. Before chairing the summit, Mr Trump is expected to visit Israel on Monday where he will address the Knesset, the Israeli parliament. Representatives from regional countries, along with European leaders including Sir Keir Starmer, are expected to attend the summit and sign the agreement as guarantors. Read more from Sky News:Nova festival survivor dies two years after girlfriend killedCould the Gaza deal lead to something even bigger? Meanwhile, the deputy head of the Palestinian Authority has told the Saudi Al Arabiya news channel that he will meet former UK prime minister Tony Blair in Jordan on Sunday. Hussein al Sheikh said the pair will discuss the \"day after\" the war in Gaza. As part of Mr Trump's 20-point peace plan, the former prime minister is set to head the international interim administration that will govern Gaza in its transitional period. However, the prospect of Sir Tony being part of an international supervisory body in Gaza is unpopular with many Palestinians. The secretary general of the Palestinian National Initiative told Sky News, \"we don't need him for many reasons\". \"His reputation in Iraq is horrible, he has a not very clear reputation, I would say, and finally when he was here in Palestine for seven years he didn't do anything,\" Mustafa Barghouti said. \"The whole history is not good.\""
    },
    {
        "title": "Blackstone in talks about £1bn Tritax Big Box deal",
        "description": "One of the world's largest real estate investors is in advanced talks with a London-listed group about a &#163;1bn logistics deal - weeks after the duo were embroiled in a public bidding war for another industrial property group.",
        "url": "https://news.sky.com/story/blackstone-in-talks-about-1631bn-tritax-big-box-deal-13448968",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-blackstone-blackstones_7048968.jpg?20251012123609",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-12 11:33:00",
        "Headline": "The American investment giant is nearing a deal to sell logistics assets to Tritax Big Box Reit which could involve it receiving equity in the London-listed company, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n One of the world's largest real estate investors is in advanced talks with a London-listed group about a £1bn logistics deal - weeks after the duo were embroiled in a public bidding war for another industrial property group. Sky News has learnt that Blackstone, the American private equity behemoth, is nearing an agreement to sell roughly £1bn of logistics assets to Tritax Big Box Reit, which has a market capitalisation of about £3.65bn. Property industry sources said this weekend that while key details were yet to be finalised, a deal could see Blackstone receiving part of the consideration for the assets in the form of equity in Tritax Big Box. Depending on the portion of the deal paid for in stock, Blackstone could emerge as one of Tritax Big Box's largest shareholders. An announcement about an agreement between the two companies could come within days, the people said. A transaction would come less than two months after Tritax Big Box bowed out of the bidding for Warehouse Reit after Blackstone tabled an offer worth close to £500m for the company. Talks between Blackstone and Tritax Big Box about an asset portfolio deal are said to have been initiated soon after the resolution of the Warehouse Reit battle. Read more:Trump threatens additional China tariff The 40 jobs 'most at risk of AI' Tritax Big Box is among the companies which have emerged to take advantage of soaring demand for industrial warehouse and logistics assets. Its sites include a 2.3 million square foot facility on land previously occupied by the Littlebrook power station in Kent, with much of that space now pre-let to Amazon and Ikea. Blackstone, which recently committed to investing £100bn in the UK in the coming years, and Tritax Big Box both declined to comment on Sunday."
    },
    {
        "title": "Britain has been playing a role behind the scenes of Trump's deal between Israel and Hamas | Beth Rigby",
        "description": "Sir Keir Starmer join world leaders at a historic summit in Egypt today - to witness the signing of the Gaza peace plan to end two years of conflict, bloodshed and suffering that has cost tens of thousands of lives and turned Gaza into a wasteland.",
        "url": "https://news.sky.com/story/fears-trump-may-lose-focus-after-praise-for-gaza-peace-deal-at-egypt-summit-13449213",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-sharm-el-sheik_7049329.jpg?20251012210257",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-10-12 19:30:00",
        "Headline": "Ahead of the prime minister setting out his ambition for the UK to play a leading role in the next phase of the peace plan, political editor Beth Rigby reveals the immediate focus for the UK and other nations will be to get aid into Gaza with the UK committing £20m on Monday.",
        "Content": "\n          Political editor\n              @BethRigby\n  Sir Keir Starmer join world leaders at a historic summit in Egypt today - to witness the signing of the Gaza peace plan to end two years of conflict, bloodshed and suffering that has cost tens of thousands of lives and turned Gaza into a wasteland. Travelling over to Egypt, flanked by his national security adviser Jonathan Powell, the prime minister told me it was a \"massive moment\" and one that is genuinely historic. US President Donald Trump moved decisively last week to end this bloody war, pushing Israeli Prime Minister Benjamin Netanyahu and Hamas into a ceasefire as part of his 20-point peace plan. In the flurry of the following 48 hours, Sir Keir and another 20 or so leaders were invited to Egypt to bear witness to the signing of this deal, with many of them deserving some credit for the effort they made to bring this deal around - not least the leaders of Qatar, Egypt and Turkey, who pressed Hamas to sign up to this deal. Today, the remaining 20 living hostages are finally set to be released, along with the bodies of another 28 who were either killed or died in captivity, and aid is due to flow back into a starving Gaza. Some 1,200 Israelis were killed on 7 October 2023, with another 250 taken hostage. In the subsequent war, most of Gaza's two million population has been displaced. More than 67,000 Gazans have been killed, according to Palestinian health officials. Then, the signing ceremony is due to take place this afternoon in Sharm el Sheikh. It will be a momentous moment after a long and bloody war. \n                  When will the Israeli hostages be released?\n                 \n                  My interview with a Hamas leader was a glimpse into the unpredictable and frankly unbelievable world of global politics right now\n                 \n                  Drones capture staggering images of Gaza devastation - as people find nothing left\n                 But it is only just the beginning of a long process to rebuild Gaza and try to secure a lasting peace in the region.  The immediate focus for the UK and other nations will be to get aid into Gaza, with the UK committing £20m for water, sanitation and hygiene services for Gazans. But the focus for the UK and other European allies is what happens after the hostages are released and Israel withdraws its troops. What happens next is a much bigger and more complicated task: rebuilding Gaza; turning it into a terrorist-free zone; governing Gaza - the current plan is for a temporary apolitical committee; creating an international stabilisation force and all the tensions that could bring about - which troops each side would allow in; a commitment for Israel not to occupy or annex Gaza, even as Netanyahu makes plain his opposition to that plan. The scale of the challenge is matched by the scale of devastation caused by this brutal war. The prime minister will set out his ambition for the UK to play a leading role in the next phase of the peace plan. Back home, the UK is hosting a three-day conference on Gaza's recovery and reconstruction. Last week, France hosted European diplomats and key figures from Middle Eastern countries, Egypt, Jordan, Saudi Arabia and Qatar - and later this week, the German chancellor is hoping to organise a conference on the reconstruction of Gaza with the Egyptians. But in reality, European leaders know the key to phase two remains the key to phase one, and that's Donald Trump. As one UK figure put it to me over the weekend: \"There is lots of praise, rightly, for the US president, who got this over the line, but the big challenge for us post-war is implementing the plan. Clearly, Arab partners are concerned the US will lose focus.\" The prime minister knows this and has made a point, at every point, to praise Mr Trump. His cabinet minister Bridget Phillipson learned that diplomatic lesson the hard way yesterday when she was publicly lambasted by the US ambassador to Israel Mike Huckabee for suggesting to my colleague Trevor Phillips that the UK \"had played a key role behind the scenes\" and failed to mention Mr Trump by name. \"I assure you she is delusional,\" tweeted Governor Huckabee. \"She can thank @realDonaldTrump anytime just to set the record straight\". Today, leaders will rightly be praising Mr Trump for securing the breakthrough to stop the fighting and get the remaining hostages home. But this is only the beginning of a very long journey ahead to push through the rest of the 19-point plan and stop the region from falling back into conflict. Britain has, I am told, been playing a role behind the scenes. The PM's national security adviser Mr Powell was in Egypt last week and has been in daily touch with his US counterpart Steve Witkoff, according to government sources. Next week the King of Jordan will come to the UK. Part of the UK's task will be to get more involved, with the government and European partners keen to get further European representation on Trump's temporary governance committee for Gaza, which Tony Blair (who was not recommended or endorsed by the UK) is on and Mr Trump will chair. The committee will include other heads of states and members, including qualified Palestinians and international experts. As for the former prime minister's involvement, there hasn't been an overt ringing endorsement from the UK government. It's helpful to have Mr Blair at the table because he can communicate back to the current government, but equally, as one diplomatic source put it to me: \"While a lot of people in the Middle East acknowledge his experience, expertise and contact book, they don't like him and we need - sooner rather than later - other names included that Gulf partners can get behind.\" Today it will be the US, Egypt, Qatar and Turkey that sign off on the peace plan they directly negotiated, as other Middle Eastern and European leaders, who have flown into Sharm el Sheikh to bear witness, look on. But in the coming days and weeks, there will need to be a big international effort, led by Mr Trump, not just to secure the peace, but to keep it."
    },
    {
        "title": "US ambassador to Israel calls cabinet minister 'delusional' for claim UK played key role in Gaza peace deal",
        "description": "The US ambassador to Israel has called cabinet minister Bridget Phillipson \"delusional\" after she told Sky News the UK played a key role in the Gaza peace deal.",
        "url": "https://news.sky.com/story/uk-played-key-role-in-gaza-peace-deal-but-no-uk-troops-on-ground-minister-says-13448889",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-bridget-phillipson_7049265.jpg?20251012185827",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-12 07:56:00",
        "Headline": "Bridget Phillipson told Sky News the UK helped shape the ceasefire deal, which is reflected in Sir Keir Starmer being at Monday's signing ceremony in Egypt.",
        "Content": " The US ambassador to Israel has called cabinet minister Bridget Phillipson \"delusional\" after she told Sky News the UK played a key role in the Gaza peace deal. The education secretary told Sunday Morning With Trevor Phillips, while recognising the \"critical role\" of the US, that Sir Keir Starmer's presence at a signing ceremony for the ceasefire deal in Egypt on Monday \"demonstrates the key role that we have played\". Politics latest: Phillipson announces crackdown on antisemitism at UK universities She did not say exactly what the UK's role in the ceasefire, largely attributed to Donald Trump, is or was. But she added: \"We have played a key role behind the scenes in shaping this. \"It's right that we do so because it's in all of our interest, including our own national interest, that we move to a lasting peace in the region. \"These are complex matters of diplomacy that we are involved in. But we do welcome and recognise the critical role that the American government played in moving us to this point.\" \n                  Starmer's national security adviser played no role in collapse of China spy trial, cabinet minister says\n                 \n                  Unite the union refuses to nominate either Labour deputy leadership contender\n                 \n                  Labour deputy leadership: Contest to replace Rayner set to become two-horse race\n                 However, the US ambassador to Israel, Mike Huckabee, reposted the Sky News clip of Ms Phillipson's comments and said: \"I assure you she's delusional. \"She can thank Donald Trump anytime just to set the record straight.\" Mr Huckabee was part of the negotiating team for the peace deal, with Mr Trump calling the former Arkansas governor \"AMAZING\" as he said he \"worked so hard, and did so much, to bring about peace in the Middle East\". In August, Mr Huckabee said the UK and other European nations who said they would declare a Palestinian state were \"having the counterproductive effect that they probably think that they want\". Israel: UK did not play key role in peace deal Israel's deputy foreign affairs minister, Sharren Haskell, told Sky News the UK played \"the opposite\" of a key role in the peace deal after the Palestinian state declaration, which eventually happened in September. She accused the PM's initial threat \"at a very sensitive time\" in July of having \"pushed Hamas to embolden their position and to refuse a ceasefire two months ago\". \"I think that right now, the quiet that was given during the negotiation, and to President Trump, had probably played a bigger role than what the government had done two months ago,\" she said. \"The message that the UK government has sent Hamas was the message that: the longer they continue this war, they will be rewarded. \"I mean, you must understand that when a terrorist organisation is thanking you. You are on the wrong side of history.\" It's understood the prime minister has underlined Mr Trump's key role in securing this deal throughout the process. Publicly, he praised Mr Trump twice in his press conference in India on Thursday. Read more:Gaza latest: Hostages Square boos NetanyahuHamas official thanks Donald Trump for ceasefire deal  Ms Phillipson stood by the decision to declare a Palestinian state, saying it was \"the right thing to do\". Husam Zomlot, the Palestinian ambassador to the UK, told Sky News it was a \"moment of leadership\" for the UK to declare a Palestinian state, and a \"responsibility to begin to correct a century of the gravest historic injustices committed against our people\". He added: \"That moment three weeks ago, when the UK did recognise, is a moment when we can say that the wheels of history are turning in a different direction.\" No plans for British troops on the ground The education secretary also told Sky News the government has \"no plans\" to put British troops into Israel or Gaza as part of a stabilisation force after the ceasefire. The US military will help establish a multinational force in Israel, known as a civil-military coordination centre, which is likely to include troops from Egypt, Qatar, Turkey and the UAE. On Friday, US officials said up to 200 US troops already based in the Middle East will be moved to Israel to help monitor the ceasefire in Gaza. The day before, President Trump announced Israel and Hamas had \"signed off on the first phase\" of a peace plan he unveiled last week. Aid trucks have been gathering in Egypt to cross into Gaza after months of warnings by aid groups of famine in parts of the territory. In Israel, the remaining hostages are due to be returned from Gaza by Hamas on Monday under the first phase of the peace plan. Twenty are believed to still be alive, 26 have been declared dead, while the fate of two is unknown. The ceasefire agreement has been made two years after Hamas stormed Israel on 7 October 2023, killing 1,200 people and taking 251 hostages. Israel's military offensive has killed more than 67,000 Palestinians in Gaza, according to the Hamas-run health ministry, which the UN deems reliable."
    },
    {
        "title": "Thatcher at 100: Lavish celebrations to remember the Iron Lady's life, leadership and legacy",
        "description": "Kemi Badenoch is expected to mark the 100th anniversary of Margaret Thatcher's birth after paying a series of glowing tributes to her at the Conservative Party conference.",
        "url": "https://news.sky.com/story/thatcher-at-100-lavish-celebrations-to-remember-the-iron-ladys-life-leadership-and-legacy-13449056",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-thatcher-blacpool-tories_6539730.jpg?20240501154037",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-10-12 23:01:00",
        "Headline": "National treasures to sporting greats and politicians will commemorate what would have been Margaret Thatcher's 100th birthday with a celebratory dinner and other events.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Kemi Badenoch is expected to mark the 100th anniversary of Margaret Thatcher's birth after paying a series of glowing tributes to her at the Conservative Party conference. The Tory celebrations, 100 years after she was born on 13 October 1925, include a glittering dinner at the historic Guildhall in the City of London attended by a galaxy of A-list celebrities and veteran Tory grandees. The Conservative leader led the tributes to Lady Thatcher at the party's conference in Manchester, declaring in her opening speech: \"As one of my great predecessors, Margaret Thatcher, put it: 'The facts of life are Conservative'.\" Later in the speech, she added: \"In the 1980s, Margaret Thatcher broke the cycle of high inflation, low growth and trade union strife, giving Britain back her national pride and economic strength.\" And responding to a Sky News YouGov poll suggesting half of Tory members don't want her to lead the party into the next election, Ms Badenoch claimed she was being criticised just like Baroness Thatcher was when she became opposition leader in the 1970s. \"Pretty much everything that I'm experiencing now, she did,\" she claimed in an interview when she was asked about attacks on her leadership and bad poll results. \"She was written off.\" At the Guildhall dinner, the invited celebs range from national treasure Joan Collins to cricket legend Ian Botham and from Downton Abbey creator Julian Fellowes to bestselling author Jeffrey Archer. \n                  Is it too late for Kemi Badenoch?\n                 \n                  Badenoch pulls off first conference speech as leader, but it is less clear if this will be her last\n                 \n                  Badenoch has done enough to hold off her critics - for now\n                 The principal speaker is Sir Mark Thatcher, who - according to the organisers - will be speaking for the first time ever in public about his mother's life, leadership and legacy. Thatcher-era ministers present will include former Tory leader Michael Howard, former chancellor Norman Lamont and Kenneth Baker, whose cabinet posts included party chairman and home secretary. The black-tie dinner for 500 guests, organised by the Margaret Thatcher Centre charitable project, is taking place 100 years to the day after the Iron Lady's birth and at a venue she knew well. It was at the Guildhall that Lady Thatcher spoke at the annual Lord Mayor's Banquet a dozen times during more than a decade as prime minister, including her famously defiant speech with cricketing metaphors just 10 days before she quit in 1990. \"I am still at the crease, though the bowling has been pretty hostile of late,\" she declared. \"And in case anyone doubted it, can I assure you there will be no ducking the bouncers, no stonewalling, no playing for time. The bowling's going to get hit all round the ground. That is my style.\" She was responding to the resignation of Sir Geoffrey Howe, her ally turned assassin, who hit back the following day in an onslaught in the Commons that has been claimed to be the greatest parliamentary speech of all time. Insisting there was no monopoly of cricketing metaphors, Sir Geoffrey told MPs: \"It's rather like sending your opening batsmen to the crease only for them to find, the moment the first balls are bowled, that their bats have been broken before the game by the team captain.\" With one lethal speech, the \"dead sheep\" so brutally ridiculed by his Labour rival Denis Healey had turned into a roaring lion and Lady Thatcher was finished. Yet by 1990 she had won three general elections, survived the 1984 Brighton bomb, defeated Argentina in the 1982 Falklands war and Arthur Scargill in the 1984-85 miners' strike and privatised dozens of major nationalised industries. She was born 100 years ago above the corner shop of her father, Alfred Roberts, a Methodist lay preacher and town councillor, on the corner of North Parade and Broad Street, Grantham, in Lincolnshire. In the Commons in 2020, culture minister John Whittingdale, previously her political secretary, said of a visit to the Coronation Street set when she was PM: \"She was particularly keen to visit Alf Roberts' corner shop because of course her own father was Alfred Roberts, who ran the grocer's shop in Grantham.\" Describing her early years in her autobiography, The Downing Street Years, she wrote: \"I had grown up in a household that was neither poor nor rich. We had to economise each day in order to enjoy the occasional luxury. \"My father's background as a grocer is sometimes cited as the basis for my economic philosophy. So it was - and is.\" At the Tory conference, the ghost of the Iron Lady hung heavily. Her legacy and references to the 100th anniversary of her birth were everywhere: life-size cardboard cut-outs, biographies, gift mugs, tea towels, a display of outfits worn by her and her famous quotes all over the walls. Whittingdale, now Sir John and a veteran backbench grandee, was much in demand for anecdotes about his former boss and he didn't disappoint. At one event, he told of her team's attempts to persuade her to make a joke in her 1990 conference speech about the Monty Python \"dead parrot\" sketch. The idea was to mock the Liberal Democrats' \"bird of liberty\" symbol, but she didn't get the joke and at one point said to her advisers: \"Just who is this Monty Python?\" Nevertheless, she delivered the gag with aplomb. \"This is an ex-parrot,\" she said of the Lib Dems in her speech. \"It is not merely stunned, it has ceased to be, expired and gone to meet its maker.\"  On the eve of Ms Badenoch's big speech, Sir John told Sky News how on the night before Lady Thatcher's conference speeches she would make endless changes to the script until as late as 2am. \"The poor typist didn't use a word processor, so every time it changed she had to type the whole thing again,\" he said. And asked by Sky News if all party leaders stay up until the small hours making changes to their conference speech, he replied: \"No!\" Although it's the most lavish and spectacular, the Guildhall dinner is just one of many events to celebrate the anniversary. The following evening, her acclaimed biographer Charles Moore and Michael Portillo are promising an insider's portrait of her life at the Royal Geographical Society in London. Now more famous for his TV railway journeys, Portillo began working for the Conservatives in 1976, a year after she became Tory leader. He briefed her in the 1979 election and went on to be a special adviser, whip, and minister in her governments. Read more from Sky News:Tories promise to scrap stamp duty if they win next electionUS ambassador to Israel calls UK cabinet minister 'delusional'Man charged with stalking after allegedly targeting Lib Dem leader Last week, Sir Mark and Carol Thatcher travelled to Budapest for the unveiling of a striking iron statue marking her 100th anniversary and commemorating her role in fighting communism and ending the Cold War. And at Sloane Street Auctions in London later this month, Baroness Thatcher's final portrait is being auctioned, along with further contents of her London home, at the third sale of her furniture and effects. The portrait photograph, taken by Alistair Morrison in the main drawing room at her home in Chester Square, was the final portrait for which she sat. The sale also includes a portrait of Baroness Thatcher in her full Order of the Garter robes. In Grantham, where a statue of Lady Thatcher was erected in 2022, 100th anniversary events this month include a special postcard exhibition, walking talks by a local historian, a display in the town's library and talks by former Tory minister Edwina Currie and Gyles Brandreth. But it's not just friends and supporters who are praising Lady Thatcher as they mark the anniversary. At the Tory conference, her old foe Michael Heseltine, who walked out of her cabinet in 1986 and challenged her in 1990, was full of praise. \"Margaret Thatcher's greatest achievement was to help create the European Single Market,\" Lord Heseltine, now 92, said at a European Movement fringe meeting. \"It was a privilege beyond measure to serve in the Conservative government that was elected in 1979 and led our country for 18 continuous years. \"That government, first under Margaret Thatcher, has been portrayed as a right-wing administration. But however much that may suit the most zealous of my colleagues, the truth was often very different. \"My experience in introducing development corporations, building a new east end of London and at the same time acting as a sort of clerk of works in restoring confidence in Liverpool must rank as one of the most interventionist ministerial experiences in peacetime ever. \"The point is that was all under Margaret Thatcher. I remember no criticism from her. She was, in truth, much more practical than doctrinal.\" At an earlier event, the chairman of the Tory backbench 1922 Committee, Bob Blackman MP, also recalled that when Lady Thatcher became opposition leader in 1975 she struggled initially, patronised not just by Labour prime ministers Harold Wilson and James Callaghan but also by the Tory establishment, he said. Yet in 1979, the '22 chairman declared, she led them to victory in the first of her three general election triumphs. Yes. But unlike Kemi Badenoch, in the 1970s Mrs Thatcher did not have the threat that the Conservatives now face from Nigel Farage."
    },
    {
        "title": "Man charged with stalking after allegedly targeting Lib Dem leader Sir Ed Davey and his family",
        "description": "A man has been charged with stalking and possession of a flick knife after allegedly targeting Lib Dem leader Sir Ed Davey and his family.",
        "url": "https://news.sky.com/story/man-charged-with-stalking-after-allegedly-targeting-lib-dem-leader-sir-ed-davey-and-his-family-13448947",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ed-davey-pmqs_7003257.jpg?20250827233416",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-12 10:33:00",
        "Headline": "Inigo Rowland, 58, has been remanded in custody after appearing in court.",
        "Content": "A man has been charged with stalking and possession of a flick knife after allegedly targeting Lib Dem leader Sir Ed Davey and his family. Inigo Rowland, 58, of Surbiton, south London, was arrested last Monday, but it was only made public on Sunday. He appeared at Wimbledon Magistrates' Court on Tuesday and was remanded in custody, the Met Police said. The offences are alleged to have taken place between June and October. Sir Ed, the MP for Kingston and Surbiton, lives in southwest London with his wife, Emily, their 17-year-old son John, and his younger sister Ellie. A spokesperson for the Met Police said: \"Inigo Rowland, 58, of Surbiton has been charged with stalking and possession of a flick knife. \"He appeared at Wimbledon Magistrates' Court on Tuesday, 7 October and was remanded into custody. He will next appear at the same court on Tuesday, 14 October. \n                  Green Party membership overtakes Liberal Democrats under Polanski\n                 \n                  Former Lib Dem leader Sir Menzies Campbell dies\n                 \n                  Ed Davey warns that Nigel Farage wants to turn Britain into 'Trump's America'\n                 \"He was arrested on Monday, 6 October in relation to the offences, which are alleged to have taken place between June and October.\" A Lib Dem spokesperson said: \"We cannot provide any details at this time, Ed's number one priority is the safety of his family.\""
    },
    {
        "title": "Farming community responds to rumours of an inheritance tax U-turn",
        "description": "The budget may still be more than six weeks away, but rumours of U-turns and changes are already in full swing.",
        "url": "https://news.sky.com/story/damage-has-been-done-farming-community-responds-to-rumours-of-an-inheritance-tax-u-turn-13449030",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-cornock-farm_7049106.jpg?20251012151607",
        "type": "Politics",
        "Author": "Dan Whitehead",
        "Date Published": "2025-10-12 14:00:00",
        "Headline": "Plans to introduce a 20% tax on estates worth more than £1m drew tens of thousands to protest in London earlier this year.",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n  The budget may still be more than six weeks away, but rumours of U-turns and changes are already in full swing. Over the last few days, there have been multiple reports that those inside Whitehall are considering tweaks to the controversial inheritance tax (IHT) reforms on farms announced this time last year. Plans to introduce a 20% tax on estates worth more than £1m drew tens of thousands to protest in London, many fearing huge tax bills that would force small farms to sell up for good. Now there are reports the tax threshold could be increased from £1m to £5m (£10m for a married couple) - a shift that would remove smaller farms from being liable to pay.  Senior figures in farming have long believed a rise could be the solution to save the smaller farms and it would satisfy most. However under the proposals, the 50% relief on IHT would be removed for farms above the new threshold. That means bigger farms, responsible for producing a large amount of produce in our supermarkets, could bear the brunt of the tax burden with the Treasury potentially increasing revenues. \n                  UK farmers have 'nothing more to give' as they fear govt will compromise welfare in US-UK trade deal\n                 \n                  Cost of rural crime in Wales at its highest in more than a decade\n                 \n                  Essex set to be the home of Europe's largest low-carbon horticulture site\n                 Two senior farming figures told me today that while a threshold increase is welcome, it does nothing to solve an \"insolvable\" problem. Read more: What's the beef with farmers' inheritance tax? Big farms have more land to sell, but then they become smaller farms and either produce less, or even divide up, to avoid the tax entirely. Richard Cornock runs a small dairy farm in south Gloucestershire, which has been in his family since 1822. He hopes to pass it on to his son Harry, who is now 14 and training to become a farm manager. \"I've been under so much stress like most farmers worrying about this tax,\" he said. \"And I really hope they do push the boundaries on the thresholds, because the million pounds they propose at the moment is ridiculous. \"It's been on my mind the whole time to be honest. I even looked into getting life insurance to insure my life and I can't get it because I had a heart condition. And that was one way I thought I might be able to cover my kids…\" We paused our chat as he was too upset to continue - an illustration of the stress farmers like him have been under over the last 12 months. The government says it won't comment on \"speculation\" about any possible changes, but it has previously defended the IHT reform, saying most estates would not pay and that those who will be liable can spread payments over a decade. Labour is under pressure to do something to appease the angry farmers, a rural vote that turned from the Conservatives at the last election. I ask Richard whether any tweak or row back on IHT will restore faith in Labour? \"The damage has been done,\" he says."
    },
    {
        "title": "Starmer's national security adviser played no role in collapse of China spy trial, cabinet minister says",
        "description": "National security adviser Jonathan Powell played no role in the collapse of a China spy trial, a cabinet minister has told Sky News.",
        "url": "https://news.sky.com/story/starmers-national-security-adviser-played-no-role-in-collapse-of-china-spy-trial-cabinet-minister-says-13448967",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-christopher-cash-christopher-berry_7045458.png?20251007215609",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-12 11:30:00",
        "Headline": "Sir Keir Starmer had so far avoided saying whether Jonathan Powell played a part in the trial of two Britons accused of spying for China being dropped.",
        "Content": "National security adviser Jonathan Powell played no role in the collapse of a China spy trial, a cabinet minister has told Sky News. Bridget Phillipson, the education secretary, gave the government's most definitive answer yet about whether Mr Powell was part of the reason the case into two men accused of spying for China was dropped weeks before they were set to go on trial. Asked on Sunday Morning with Trevor Phillips if she could assure him that the national security adviser played no role in the decision, Ms Phillipson said: \"Yes, I can give that assurance. \"We're very disappointed that the CPS were not able to take forward the prosecution.\" Former Conservative home secretary Priti Patel called the assurance \"a very bold statement\". Parliamentary researcher Christopher Cash, 30, and teacher Christopher Berry, 33, were charged with passing politically sensitive information to a Chinese intelligence agent between December 2021 and February 2023. They denied the allegations. Over the past week, Sir Keir Starmer, his ministers and Mr Powell have faced accusations they were involved in the trial being dropped. \n                  US ambassador to Israel calls cabinet minister 'delusional' for claim UK played key role in Gaza peace deal\n                 \n                  Unite the union refuses to nominate either Labour deputy leadership contender\n                 \n                  Labour deputy leadership: Contest to replace Rayner set to become two-horse race\n                  Sir Keir sidestepped Powell 'involvement' The director of public prosecutions (DPP), head of the Crown Prosecution Service (CPS), took the unusual step of sending MPs a letter this week to state the government repeatedly refused to provide evidence that China represented a national security threat at the time of the allegations. Stephen Parkinson said the CPS had tried \"over many months\" to get the evidence it needed to carry out the prosecution, but it had not been forthcoming from the government. The government has said China needed to have been branded an \"enemy\" during the period they were accused of spying, which was when the Tories were in government, for the prosecution to go ahead. The case was dropped after a meeting last month of government officials, including Mr Powell, the Sunday Times reported. Sir Keir said he wanted to be \"absolutely clear no ministers were involved\" in any decisions relating to the case, but sidestepped answering whether Mr Powell was involved. Ms Phillipson continued to take the government line about China needing to have been deemed an \"enemy\" by the Conservative government - something the Tories say is an excuse because they said many times Beijing was a national security threat. Read more:The blame game over China spy trial collapse - who is right and who is wrong?  Priti Patel: Political interference in judicial process Priti Patel, who was Tory home secretary during most of the period the pair are accused of spying, said Ms Phillipson's claim Mr Powell had no involvement was \"a very bold statement\". \"It really is,\" she told Trevor Phillips. \"The national security adviser, as we know, is a political adviser. \"However, we have read from newspapers, there are plenty of disclosures about various meetings that he was involved in, including with other senior civil servants, the permanent secretary to the Foreign Office, basically trying to rewrite the narrative around China, saying that they're not a threat, they're a challenge, and that there were meetings basically within government.\" Ms Patel said it was \"fundamentally political interference in the judicial process\" by the Labour government. And she said Sir Keir's government should \"of course\" have designated China a threat and said the Tory government did so. \"They were an adversary,\" she added. \"We put forward lots of legislation involved in our national security, acts of parliament stopping China and Chinese firms from buying and acquiring British companies because we knew that China was an adversary, a real threat to us. \"I saw that, I saw that obviously in ways in which I can't disclose now. \"I saw that through classified information; our agencies, our intelligence and security agencies were saying that throughout and have been saying that consistently.\" A Cabinet Office spokesperson said: \"The National Security Adviser made no decisions on the content of any evidence relating to the case, nor has he had any part in any decisions about the substance of the case itself. \"The suggestions that the Government concealed evidence or withdrew or leant on witnesses are all untrue.\""
    },
    {
        "title": "Kate's comments on screentime hit a nerve across the UK - so what does science say?",
        "description": "The Princess of Wales touched a few nerves this week when she warned that smartphones and computer screens were creating \"an epidemic of disconnection\" within families.",
        "url": "https://news.sky.com/story/kates-comments-on-screentime-hit-a-royal-nerve-across-the-uk-so-what-does-science-say-13448890",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-phone-tech-money_7047736.jpg?20251010131517",
        "type": "Technology",
        "Author": "Miriam Kuepper, news reporter",
        "Date Published": "2025-10-12 07:58:00",
        "Headline": "The Princess of Wales caused ripples on social media, with parents arguing about whether screentime - the amount of time spent using screen-based technology daily - is actually harmful for children.",
        "Content": "By Miriam Kuepper, news reporter  The Princess of Wales touched a few nerves this week when she warned that smartphones and computer screens were creating \"an epidemic of disconnection\" within families. In an essay co-authored by a Harvard professor, Kate wrote: \"We're raising a generation that may be more 'connected' than any in history while simultaneously being more isolated, more lonely, and less equipped to form the warm, meaningful relationships that research tells us are the foundation of a healthy life.\" Her words caused ripples on social media, with parents arguing about whether screentime - the amount of time spent using screen-based technology daily - is actually harmful for children. But what does the science say? Is screentime actually harmful for children? Evidence on whether screentime is actually harmful for children is inconsistent, with researchers showing that while screentime and its alleged negative impacts on children could be related, there is no undisputable evidence that it causes them. Concerns have centred around findings that the wellbeing and mental health of children and young people has declined in recent years with NHS Digital data showing that 18% of those aged 7 to 16 years had a probable mental health disorder in 2022 compared with 9.7% in 1999, the Education Committee reported in May 2024. \n                  As food delivery drones take off in Ireland, here are the most popular items\n                 \n                  Tom Hollander on AI actor Tilly Norwood : 'Perhaps I'm not scared enough'\n                 \n                  Prince Harry and Meghan named Humanitarians of the Year\n                 Debate has been widespread as to the causes of this, with social media and smartphone use being one of the drivers, according to a 2025 University of Manchester study. As the debate as raged, several MPs have said a ban on smartphones for under-16s should be considered. The Education Committee's report on the impact of screentime on the education and well-being of children pointed to evidence that smartphones and computers disrupt pupils' learning both at home and in the classroom. It also highlighted research suggesting that children who were exposed to longer than two hours a day of recreational screen time on smartphones and playing video games had worse working memory, processing speed, attention levels, language skills and executive function compared with those who did not. The committee urged the government to advise parents of babies that they should give sufficient attention to face-to-face interaction - a key element of linguistic and social development - and warn of the risks of screen time in reducing opportunities for this. In its conclusion, it said: \"For children and adolescents alike, the rapid rise of the use of screens and devices has come at a substantial cost and Government needs to do more across departments to protect them from addiction, online harms and the mental health impacts of extensive use of devices.\" The committee's warning on babies was supported by Carlota Nelson, writer and director of Brain Matters, who wrote for Unicef's parenting site: \"Research has shown that screentime inhibits young children's ability to read faces and learn social skills, two key factors needed to develop empathy.\" \"Face-to-face interactions are the only way young children learn to understand non-verbal cues and interpret them. Exposure to screens reduces babies' ability to read human emotion and control their frustration,\" she wrote. \"It also detracts from activities that help boost their brain power, like play and interacting with other children.\" The Royal College of Psychiatrists (RCP) said in a report in 2020 - before the COVID pandemic and platforms like TikTok became as popular as they are now - that screentime exposes children and young people to potentially distressing content, bullying, gambling, and other issues. It said that while evidence for causal links was still developing, there was evidence to suggest that digital technology can affect weight, mood, thoughts of suicide and self-harm and body image. 'No evidence for harm' - but potential benefits? The National Institute for Health and Care Research (NIHR) found little evidence to suggest that spending more time on social media was associated with more mental health problems in young people, the Education Committee said in its report. Equally, another study involving various researchers, including some from the University of Oxford, found no evidence to show that screentime impacted children's brain function or well-being. Nearly 12,000 children in the US were analysed in the 2023 study, and even with participants who had high rates of digital engagement, there was no evidence of impaired functioning in the brain development of the children. Jack Miller, the first author who analysed the data as part of his thesis at the Oxford Internet Institute, said: \"If screen time had an impact on brain development and well-being, we expected to see a variety of cognitive and well-being outcomes that this comprehensive, representative research did not show.\" According to the National Society for the Prevention of Cruelty to Children (NSPCC), screentime can be beneficial for children by helping them create communities online and sustain friendships through social media or online gaming. Read more:Two-hour screen time limit considered by governmentSociety-wide approach needed to stop pupils doom scrolling Screentime was also credited with a reduction in feelings of loneliness in some children. Despite several studies being carried out, there is as yet no definitive answer on whether screentime harms children. The government says it encourages and supports further research in this area. The Department for Science, Innovation and Technology announced a feasibility study on methods and data to understand the impact of smartphones and social media on children's wellbeing in November last year. The central question of the research, carried out by the University of Cambridge, is which methods would be most effective in determining the causal effects of social media and smartphones on children's (3-21 years) developmental outcomes in the next 2-3 years. How much screentime is okay? The Education Committee suggests that screentime should be minimal for younger children and better balanced with face-to-face socialisation and physical activity for older ones. The government said in response to the committee's report that screentime needed to be proportionate and shouldn't displace opportunities for children to socialise face-to-face and take part in physical activities. Babies less than a year old shouldn't spend any time on screens at all, while one-year-olds should not have any sedentary screentime, which includes watching TV or videos and playing computer games, according to WHO guidelines. The organisation recommends that children aged two should not spend more than one hour with sedentary screentime per day. The NHS advises no more than two hours a day in front of a screen, even for older children."
    }
]