[
    {
        "title": "Ukraine war: No breakthrough in Russia-US talks - after Putin tells Ukraine's allies he's ready for war",
        "description": "Talks between US negotiators and Vladimir Putin about Ukraine were \"productive\" but there was no breakthrough, according to Russian officials.",
        "url": "https://news.sky.com/story/if-europe-wants-to-fight-a-war-we-are-ready-now-says-putin-13478316",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-vladimir-putin-steve-witkoff_7098730.jpg?20251202172647",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-02 14:01:00",
        "Headline": "Vladimir Putin struck a defiant tone earlier on Tuesday when he warned Russia was \"ready right now\" if Europe wanted a war. ",
        "Content": " Talks between US negotiators and Vladimir Putin about Ukraine were \"productive\" but there was no breakthrough, according to Russian officials. Donald Trump sent special envoy Steve Witkoff and his own son-in-law, Jared Kushner, to Tuesday's summit in Moscow. They were pictured in Red Square prior to the summit and Mr Witkoff later told a smiling Mr Putin that Moscow was a \"magnificent city\". Shortly before the summit, the Russian president warned his country was ready to fight if Europe wanted a war. Analysis: Why Putin won't agree to latest peace plan Russian foreign policy aide Yuri Ushakov and investment envoy Kirill Dmitriev were involved in the talks, which lasted over five fours and ended after midnight. Both sides agreed not to disclose precise details, but in a one-word social media post, Mr Dmitriev described the meeting as \"productive\". Mr Ushakov called it \"rather useful, constructive\" and asked whether peace was closer or further, he commented: \"Not further, that's for sure\". However, he said a compromise hadn't been reached on the issue of territories and that the Kremlin sees \"no resolution to the crisis\" without one. Russia wants the whole of the Donbas region - even the parts it does not hold - but Ukraine has balked at the prospect. Mr Ushakov said there was \"still a lot of work to be done, both in Washington and in Moscow\" and that \"contacts will continue\". The meeting took place after an initial 28-point US peace plan was leaked and alarmed European officials, who said it heavily favoured Russia. An \"updated and refined peace framework\" was formulated after talks between Europe, the US, and Ukraine in Geneva last month, but Mr Putin has indicated he will not accept it. Putin: Europe on the side of war Earlier on Tuesday, Mr Putin said Russia was ready to fight if Europe wanted a war. The Russian president accused European powers of changing peace proposals for Ukraine with \"demands\" that Russia considered \"absolutely unacceptable\". Mr Putin said the Europeans were \"on the side of war\".  \"We're not planning to go to war with Europe, I've said that a hundred times,\" he said following an investment forum. \"But if Europe suddenly wants to fight us and starts, we're ready right now. There can be no doubt about that.\" \"If Europe suddenly wants to start a war with us and does, then a situation could very quickly arise in which we have no one to negotiate with,\" he added.  Zelenskyy in Dublin Ukraine's President Volodymyr Zelenskyy was in Dublin on Tuesday to meet Ireland's prime minister and president. During the trip, Mr Zelenskyy said he was ready to meet Mr Trump again, but it would depend on how successful the Moscow talks were. He said the chances of ending the war were \"better now than ever\" but warned there would be \"no easy decisions\" and there must be \"no games behind Ukraine's back\". Calling it \"one of the most challenging but optimistic moments\" since Russia invaded in 2022, he said the US was \"taking serious steps to end this war one way or another\". He admitted \"some things still need to be worked out\" and said a \"decent, dignified peace\" was needed. Read more:How history could view Trump as 'biggest useful idiot'Hotspots: Reality of life on frontline of journalism The Irish government announced €100m (£88m) in non-lethal aid for Ukraine, \"generosity\" for which Mr Zelenskyy said Ukraine was grateful. It brings the total in non-lethal military aid provided to Ukraine this year to €200m (£176m). The funding is part of a new Ireland-Ukraine partnership, which builds on an agreement signed last year. It includes €25m (£22m) for the restoration and protection of energy infrastructure and a scheme to support training and other efforts as part of Ukraine's path to EU accession, which Mr Zelenskyy said he hoped to achieve within five years."
    },
    {
        "title": "Why Putin won't agree to latest Ukraine peace plan",
        "description": "The Americans were given the full VIP treatment on their visit to Moscow.&#160;",
        "url": "https://news.sky.com/story/once-again-the-us-defaults-to-a-position-that-favours-moscow-and-latest-putin-talks-show-how-13478589",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-putin-witkoff_7099197.jpg?20251203000124",
        "type": "Home",
        "Author": "Ivor Bennett",
        "Date Published": "2025-12-02 23:44:00",
        "Headline": "There's no sign of a breakthrough in Ukraine peace talks after a lengthy meeting between Vladimir Putin and a delegation sent by Donald Trump. And there are two major reasons why the Russian president won't budge.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  The Americans were given the full VIP treatment on their visit to Moscow.  There was a motorcade from the airport, lunch at a Michelin-starred restaurant, and even a stroll around Red Square. It felt like Steve Witkoff and Jared Kushner were on more of a tourist trail than the path to peace.  They finally got down to business in the Kremlin more than six hours after arriving in Russia. And by that point, it was already clear that the one thing they had come to Moscow for wasn't on offer: Russia's agreement to their latest peace plan. According to Vladimir Putin, it's all Europe's fault. While his guests were having lunch, he was busy accusing Ukraine's allies of blocking the peace process by imposing demands that are unacceptable to Russia. The Europeans, of course, would say it's the other way round. But where there was hostility to Europe, only hospitality to the Americans - part of Russia's strategy to distance the US from its NATO allies, and bring them back to Moscow's side. Putin thinks he's winning… Russia wants to return to the 28-point plan that caved in to its demands. And it believes it has the right to because of what's happening on the battlefield. It's no coincidence that on the eve of the US delegation's visit to Moscow, Russia announced the apparent capture of Pokrovsk, a key strategic target in the Donetsk region. It was a message designed to assert Russian dominance, and by extension, reinforce its demands rather than dilute them. Read more:Michael Clarke answers your Ukraine war questions'Thousands' of Westerners applying to live in Russia  …and believes US-Russian interests are aligned The other reason I think Vladimir Putin doesn't feel the need to compromise is because he believes Moscow and Washington want the same thing: closer US-Russia relations, which can only come after the war is over. It's easy to see why. Time and again in this process, the US has defaulted to a position that favours Moscow. The way these negotiations are being conducted is merely the latest example. With Kyiv, the Americans force the Ukrainians to come to them - first in Geneva, then Florida. As for Moscow, it's the other way around. Witkoff is happy to make the long overnight journey, and then endure the long wait ahead of any audience with Putin. It all gives the impression that when it comes to Russia, the US prefers to placate rather than pressure. According to the Kremlin, both Russia and the US have agreed not to disclose the details of yesterday's talks in Moscow. I doubt Volodymyr Zelenskyy is filled with hope."
    },
    {
        "title": "Rachel Reeves hit by Labour rural rebellion over inheritance tax on farmers",
        "description": "Chancellor Rachel Reeves has suffered another budget blow with a rebellion by rural Labour MPs over inheritance tax on farmers.",
        "url": "https://news.sky.com/story/rachel-reeves-hit-by-labour-rural-rebellion-over-inheritance-tax-on-farmers-13478529",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-farmer-protest_7099103.jpg?20251202223002",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-12-02 21:52:00",
        "Headline": "A number of Labour MPs in rural seats declined to back the government's move to impose inheritance tax on farmers, but just one voted against.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Chancellor Rachel Reeves has suffered another budget blow with a rebellion by rural Labour MPs over inheritance tax on farmers. Speaking during the final day of the Commons debate on the budget, Labour backbenchers demanded a U-turn on the controversial proposals. Plans to introduce a 20% tax on farm estates worth more than £1m from April have drawn protesters to London in their tens of thousands, with many fearing huge tax bills that would force small farms to sell up for good. MPs voted on the so-called \"family farms tax\" just after 8pm on Tuesday, with dozens of Labour MPs appearing to have abstained, and one backbencher - borders MP Markus Campbell-Savours - voting against, alongside Conservative members. In the vote, the fifth out of seven at the end of the budget debate, Labour's vote slumped from 371 in the first vote on tax changes, down by 44 votes to 327. The mini-mutiny followed a plea to Labour MPs from the National Farmers Union to abstain. \"To Labour MPs: We ask you to abstain on Budget Resolution 50,\" the NFU urged. \n                  Starmer cuts short Buckinghamshire visit after farmers stage noisy tractor protest\n                 \n                  UK's 'most expensive coffee' goes on sale to fund farm's future\n                 \n                  Ex-Labour adviser John McTernan suggests doing to farms 'what Thatcher did to coal mines'\n                 \"With your help, we can show the government there is still time to get it right on the family farm tax. A policy with such cruel human costs demands change. Now is the time to stand up for the farmers you represent.\" After the vote, NFU president Tom Bradshaw said: \"The MPs who have shown their support are the rural representatives of the Labour Party. They represent the working people of the countryside and have spoken up on behalf of their constituents. \"It is vital that the chancellor and prime minister listen to the clear message they have delivered this evening. The next step in the fight against the family farm tax is removing the impact of this unjust and unfair policy on the most vulnerable members of our community.\"  The government comfortably won the vote by 327-182, a majority of 145. But the mini-mutiny served notice to the chancellor and Sir Keir Starmer that newly elected Labour MPs from the shires are prepared to rebel. Speaking in the debate earlier, Mr Campbell-Savours said: \"There remain deep concerns about the proposed changes to agricultural property relief (APR). \"Changes which leave many, not least elderly farmers, yet to make arrangements to transfer assets, devastated at the impact on their family farms.\" Samantha Niblett, Labour MP for South Derbyshire abstained after telling MPs: \"I do plead with the government to look again at APR inheritance tax. \"Most farmers are not wealthy land barons, they live hand to mouth on tiny, sometimes non-existent profit margins. Many were explicitly advised not to hand over their farm to children, (but) now face enormous, unexpected tax bills. \"We must acknowledge a difficult truth: we have lost the trust of our farmers, and they deserve our utmost respect, our honesty and our unwavering support.\"  Labour MPs from rural constituencies who did not vote included Tonia Antoniazzi (Gower), Julia Buckley (Shrewsbury), Torquil Crichton (Western Isles), Jonathan Davies (Mid Derbyshire), Maya Ellis (Ribble Valley), and Anna Gelderd (South East Cornwall), Ben Goldsborough (South Norfolk), Alison Hume (Scarborough and Whitby), Terry Jermy (South West Norfolk), Jayne Kirkham (Truro and Falmouth), Noah Law (St Austell and Newquay), Perran Moon, (Camborne and Redruth), Samantha Niblett (South Derbyshire), Jenny Riddell-Carpenter (Suffolk Coastal), Henry Tufnell (Mid and South Pembrokeshire), John Whitby (Derbyshire Dales) and Steve Witherden (Montgomeryshire and Glyndwr)."
    },
    {
        "title": "FIFA backs away from dynamic pricing for all World Cup 2026 tickets",
        "description": "FIFA has backed away from using dynamic pricing for all 2026 World Cup tickets amid concerns about the cost of attending the tournament in North America.",
        "url": "https://news.sky.com/story/fifa-backs-away-from-dynamic-pricing-for-all-world-cup-2026-tickets-13478483",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-world-cup-2026-ball_7085120.jpg?20251118150632",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-12-02 20:41:00",
        "Headline": "Fluctuating pricing at a World Cup is a first but FIFA says there'll still be some fixed-price options in \"specific fan categories\".",
        "Content": "\n          Sports correspondent\n              @RobHarris\n FIFA has backed away from using dynamic pricing for all 2026 World Cup tickets amid concerns about the cost of attending the tournament in North America. The organisers insisted they always planned to ring-fence tickets at set prices to follow your own team. But the announcement comes ahead of Friday's tournament draw in Washington DC that President Trump plans to attend. Fans will have to wait until Saturday to know exactly where and when their teams will be playing in next summer's tournament. Variable pricing - fluctuating based on demand - has never been used at a World Cup before, raising concerns about affordability being mostly played in the United States. England and Scotland fans have been sharing images in recent days of ticket website images highlighting cost worries. But world football's governing body said in a statement to Sky News: \"FIFA can confirm ringfenced allocations are being set aside for specific fan categories, as has been the case at previous FIFA World Cups. These allocations will be set at a fixed price for the duration of the next ticket sales phase. \n                  Trump unveils FIFA PASS scheme to give priority visa appointment access to World Cup fans\n                 \n                  UEFA should decide if Israeli teams should be banned, FIFA VP tells Sky News\n                 \n                  Trump threatens to move World Cup games from 'unsafe' host cities\n                 \"The ringfenced allocations include tickets reserved for supporters of the Participating Member Associations (PMAs), who will be allocated 8% of the tickets for each match in which they take part, including all conditional knockout stage matches.\" FIFA says the cheapest tickets are from $60 (£45) in the group stage. But the most expensive tickets for the final are $6,730 (£5,094). There will also be a sales window after the draw from 11 December to 13 January when ticket applications will be based on a fixed price for those buying in the random selection draw. It is the biggest World Cup with 104 matches after the event was expanded from 32 to 48 teams. There are also three host nations for the first time - with Canada and Mexico the junior partners. Read more from Sky News:Pope urges Trump not to oust Venezuelan president by forceGovernment delays Chinese 'super embassy' decision FIFA defended using fluctuating pricing. \"The pricing model adopted for FIFA World Cup 26 reflects the existing market practice for major entertainment and sporting events within our hosts on a daily basis, soccer included,\" FIFA's statement continued. \"This is also a reflection of the treatment of the secondary market for tickets, which has a distinct legal treatment than in many other parts of the world. We are focused on ensuring fair access to our game for existing but also prospective fans.\" The statement addressed the concerns being raised about fans being priced out of attending. FIFA said: \"Stadium category maps do not reflect the number of tickets available in a given category but rather present default seating locations. \"FIFA resale fees are aligned with North American industry trends across various sports and entertainment sectors.\" Ireland, Northern Ireland and Wales could also still qualify."
    },
    {
        "title": "Courts system in a 'calamitous' state, warns ex-judge who recommended jury cuts",
        "description": "Sir Brian Leveson, who conducted the independent review of the courts system that guided the government's decision to reduce on jury trials, has suggested there is no alternative.",
        "url": "https://news.sky.com/story/courts-system-in-a-calamitous-state-warns-ex-judge-who-recommended-jury-cuts-13478489",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/2336f464f1df495ed6ddd4016130bbe9c18a0cb101cb4996740a07ddaf8ff622_7098834.jpg?20251202192722",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-02 20:46:00",
        "Headline": "Sir Brian Leveson told Sky's Politics Hub that the government plan to restrict jury trials will mean at least a \"20% time saving\" and help tackle the courts backlog.",
        "Content": " Sir Brian Leveson, who conducted the independent review of the courts system that guided the government's decision to reduce on jury trials, has suggested there is no alternative. Speaking to Sky's Politics Hub programme, the retired judge argued that by restricting jury trials, Justice Secretary David Lammy is \"aiming to try to solve the systemic problems\" in courts. He told Sky presenter Ali Fortescue: \"I am a great believer in trial by jury, but trials with a jury take very much longer than trials conducted otherwise than with 12 people who are utterly unused to criminal procedure and criminal evidence. \"So my concern is that we need to get through cases quicker.\" He said that it was likely a \"20% time saving would result\" from the move, although he thinks that \"a great deal more\" would be saved. Asked about the criticism today of the decision, Sir Brian said: \"I'm gaining no pleasure from it, but what I say to all of them is 'If not this, then what?' How do we reduce the backlog so the victims and witnesses get their day in court within a reasonable time?\" He argued that \"we should use our resources proportionately to the gravity of the offending\", and \"there are some cases which, to my mind, do not merit or require a trial by jury\". \n                  Jury trials will be scrapped for defendants facing sentences of three years or less, David Lammy announces\n                 \n                  Two mistakenly released prisoners still at large, says justice secretary\n                 \n                  David Lammy to unveil plans to tackle 'courts emergency' - but possible limits to jury trials spark concern\n                 Sir Brian said that some jurors he had spoken to said it was \"worthwhile\". But he added: \"They've given up two weeks of their life, sometimes without any pay except the small remuneration that they receive from the state doing jury service, and they've been trying cases which shouldn't merit their attention\". Asked if he would want a trial by jury if he had been wrongly accused of theft, Sir Brian said: \"If I'd been wrongly accused of theft, I'd be perfectly happy for a judge to decide I'd been wrongly accused of theft.\"  More broadly, he said: \"I don't see how you're going to bring down the backlog without more money, more sitting days, greater efficiency, and speedier trials... \"There aren't the judges, there aren't the court staff, more significantly there aren't the advocates.\" He said that the justice system had never been in such a \"calamitous\" state. 👉 Listen to Sky News Daily on your podcast app 👈 'The reforms are about fairness' Courts minister Sarah Sackman also defended the decision on Tuesday's Politics Hub. She acknowledged that jury trials were \"a success story\", and \"a cornerstone of British justice and will remain so after today's plans\". But she added: \"What's not such a success story is the fact that we inherited record and rising backlogs in our courts. \"Today the number starts at 80,000 cases, and it's on the rise - due to hit 100,000 by 2028.\" That leaves victims \"waiting for their case to be heard\". She argued that the measures announced on Tuesday were \"a set of reforms that will restore confidence in our justice system, get those delays down, and indeed preserve jury trials for the most serious cases\". Ms Sackman added that \"right now in our system, 90% of cases [are] being heard without a jury in our magistrates\", which is \"fair, robust justice\". \"Part of fairness is about the swiftness we need to deliver swifter justice for victims,\" she said. \"What's not fair is a victim of crime being told today that she needs to wait until 2029, 2030 for her day in court.\"  The minister gave an example of what will change, saying: \"Supposing a defendant is accused of stealing a bottle of whisky. \"Is it right that we allow the defendant to insist on a slower, more expensive jury trial in the same queue as the victim of rape, making her wait and in some cases, justice not being served? \"That's the choice that we've made today.\" But the minister refused to say how much this would reduce the backlog by."
    },
    {
        "title": "Families count the cost of devastating Sri Lanka floods",
        "description": "On the outskirts of Colombo, Sri Lanka's capital, Asiri is trying to dry out his home.",
        "url": "https://news.sky.com/story/families-count-the-cost-of-devastating-sri-lanka-floods-13478440",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-flood-sri-lanka-lynch_7098855.png?20251202194221",
        "type": "Home",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-12-02 19:09:00",
        "Headline": "India and Pakistan have sent helicopters and cargo planes to help - but the hard work will start with repair and there's a lot to be done here, physically and emotionally.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  On the outskirts of Colombo, Sri Lanka's capital, Asiri is trying to dry out his home. He's just spent five days upstairs trying to escape the rising flood waters. By finding some elevation, he's been able to protect his family. But, downstairs, he's confronted with the scale of the damage in the place he calls home. \"The water was right up to here,\" he tells us, as he points to a water mark about two and a half feet up the wall. There was \"no power, no water - it all broke\", he says.   Cyclone Ditwah has already claimed the lives of more than 400 people in Sri Lanka and hundreds are still missing. This island nation has dealt with a multitude of tragedies - a tsunami in 2004 that killed around 35,000 people and more recently an economic collapse. \n                  More than 1,300 confirmed dead and 800 missing in catastrophic Asia floods\n                 \n                  More than 600 dead in Indonesia and Thailand after floods and landslides - and Sri Lanka reporting more than 200 deaths from cyclone\n                 \n                  Fifteen people killed after bus crashes off 1,000ft cliff in Sri Lanka\n                 This latest challenge is one of the worst natural disasters in its history. Sunil, Asiri's uncle, tells me he had to improvise to help his brother survive. He shows us a video of his sibling on a makeshift wooden raft he made attached to an inflatable ring. It allowed them to take him to hospital and it's the kind of desperate dynamic playing out across the country. Unlike the tsunami, this didn't just hit coastal areas. It hugely hammered the city and mountainous regions too. Some have been critical of the government response, claiming it was slow to call an emergency and slow to deliver aid and rescue stranded people. Read more from Sky News:Pope urges Trump not to oust Venezuela leader by forceUK delays Chinese 'super embassy' decision  India and Pakistan have now sent helicopters and cargo planes to help - but the hard work will start with repair and there's a lot to be done here, physically and emotionally. Bodies are still being pulled from landslides in the popular tourist destination of Kandi. Sri Lanka joins the list of Asian nations wrestling with the sharp end of an intense cordon of typhoons, cyclones and storms this monsoon season. Each year I've been living in this region, it appears to intensify, presenting a challenge few governments seem to be able to meet."
    },
    {
        "title": "Princess of Wales describes 'power of reaching out' in festive message",
        "description": "The Princess of Wales has written about the importance of \"small acts of care\" at a time \"when life can sometimes feel fragmented or uncertain\", ahead of her fifth annual Christmas carol service.",
        "url": "https://news.sky.com/story/princess-of-wales-describes-power-of-reaching-out-in-festive-message-13478374",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-princess-of-wales-together-at-christmas_7098726.jpg?20251202172503",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-12-02 16:15:00",
        "Headline": "\"Christmas speaks of love taking form in the simplest, most human ways,\" writes Kate.  \"Not in sentimental or grand gestures, but gentle ones.\" The letter comes ahead of her  Together at Christmas carol service, recognising those helping their communities.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n The Princess of Wales has written about the importance of \"small acts of care\" at a time \"when life can sometimes feel fragmented or uncertain\", ahead of her fifth annual Christmas carol service. In the letter, which will be given to members of the congregation at Westminster Abbey on Friday evening and at services held in other parts of the country, she sets out the meaning of this year's theme, the importance of love. Kate writes: \"At a time when life can sometimes feel fragmented or uncertain, the Christmas season invites us to remember the power of reaching out to one another with generosity of heart, understanding and hope.\" Emphasising how seemingly small, but important, those acts of kindness can be, she adds: \"At its heart, Christmas speaks of love taking form in the simplest, most human ways. Not in sentimental or grand gestures, but gentle ones. \"A moment of listening, a word of comfort, a friendly conversation, a helping hand, presence. These simple acts of care might seem small, but they contribute to the beautiful tapestry of life to which we all belong.\" Kate will be joined by Prince William for the Together at Christmas service, along with other members of the royal family among the 1,600 guests at Westminster Abbey. There will be music from performers including Hannah Waddingham, Bastille's Dan Smith, Griff, Katie Melua and Cornish folk group, Fisherman's Friends. \n                  Princess of Wales: Show people with addictions 'compassion and love' instead of 'judgement'\n                 \n                  Princess of Wales calls on businesses to value 'time and tenderness' in rare speech\n                 \n                  Princess of Wales lays Armistice Day wreath - as Queen Camilla marks event at Paddington\n                 Speakers include actors Kate Winslet, Chiwetel Ejiofor, Joe Locke and comedian Babatunde Aleshe. In London and the 15 other towns and cities across the UK where events will take place, the congregations will be made up of invited guests who have gone above and beyond to help their communities. Praising their selfless efforts to support others, the princess stresses in her letter how Christmas is a time to remember how powerful their work really is. \"Even with all the rushing around and familiar traditions, there is a quieter sense of what it calls out in us,\" she writes. \"There is a softness to the season that reminds us of something easy to forget; that what we do matters. \"Our words, our choices, and even the ways we look out for one another - they ripple outward, touching lives we may never see\". Read more from Sky News:Kate's plea for 'compassion and love'Princess of Wales's message to businessWilliam and Kate win legal battle The other services will be held in Armagh, Berkshire, Derbyshire, Dumfries, Dyfed, East Riding, Gwent, Greater Manchester, Isle of Wight, Lanarkshire, Nottinghamshire, Renfrewshire, Ayrshire, Suffolk, Wiltshire and Worcestershire and will be hosted by lord-lieutenants and supported by The Royal Foundation. The Westminster Abbey service is to air on ITV1 and ITVX on Christmas Eve and will be repeated on Christmas Day."
    },
    {
        "title": "Sabrina Carpenter hits out at 'evil and disgusting' White House video featuring her song",
        "description": "Sabrina Carpenter has hit out at an \"evil and disgusting\" White House video of migrants being detained that uses one of her songs.",
        "url": "https://news.sky.com/story/sabrina-carpenter-hits-out-at-evil-and-disgusting-white-house-video-featuring-her-song-13478430",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sabrina-carpenter-mtv-vmas_7014111.jpg?20250908073947",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-02 18:26:00",
        "Headline": "Singers Olivia Rodrigo and Jess Glynne have also attacked Mr Trump's government for using their music on anti-illegal immigration videos.",
        "Content": " Sabrina Carpenter has hit out at an \"evil and disgusting\" White House video of migrants being detained that uses one of her songs. \"Do not ever involve me or my music to benefit your inhumane agenda,\" the pop star posted on X. The White House used part of Carpenter's upbeat song Juno over pictures of immigration agents handcuffing, chasing and detaining people. It was posted on social media on Monday and has been viewed 1.2 million times so far. President Trump's policy of sending officers into communities to forcibly round up illegal immigrants has proved controversial, with protests and legal challenges ongoing. Mr Trump promised the biggest deportation in US history, but some of those detained have been living and working in the US for decades and have no criminal record. Carpenter is not the only star to express disgust over the administration's use of their music. \n                  Kendrick Lamar leads Grammy nominations as K-pop makes it mark\n                 \n                  MTV VMAs in pictures: Lady Gaga, Ariana Grande and Sabrina Carpenter triumph as tribute paid to Ozzy Osbourne\n                 \n                  Sabrina Carpenter and Charli XCX BRIT Awards appearances spark hundreds of Ofcom complaints\n                 Olivia Rodrigo last month warned the White House not to \"ever use my songs to promote your racist, hateful propaganda\" after All-American Bitch was used in a video urging undocumented migrants to leave voluntarily. Read more from Sky News:Pope urges Trump not to oust Venezuelan president by forceGovernment delays Chinese 'super embassy' decision In July, English singer Jess Glynne also said she felt \"sick\" when her song from the viral Jet2 advert was used over footage of people in handcuffs being loaded on a plane.Other artists have also previously hit out at Trump officials for using their music at political campaign events, including Guns N' Roses, Foo Fighters, Celine Dion, Ozzy Osbourne and The Rolling Stones."
    },
    {
        "title": "Spirit animal: Raccoon gets drunk as a skunk in a booze store - and sleeps off hangover in the toilet ",
        "description": "A raccoon has gotten as drunk as a skunk.",
        "url": "https://news.sky.com/story/spirit-animal-raccoon-gets-drunk-as-a-skunk-in-a-booze-store-and-sleeps-off-hangover-in-the-toilet-13478586",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-raccoon-california_7099187.jpg?20251202232615",
        "type": "Home",
        "Author": "Connor Sephton",
        "Date Published": "2025-12-02 23:12:00",
        "Headline": "Officials say the raccoon was taken into custody and allowed to sleep for a few hours before being released into the wild - presumably with a headache.",
        "Content": "\n          News reporter\n              @ConnorSephton\n A raccoon has gotten as drunk as a skunk. On a wild Friday night, the trash panda broke into a liquor store in Virginia - and began helping themselves to the stock. The following morning, an officer was asked to investigate reports of a break-in… and wasn't prepared for what happened next. She was greeted by a soaked aisle that reeked of booze and was littered with smashed bottles. Spirits were the tipple of choice - this wasn't a wine racc. Officer Martin's inquiries soon took her to the bathroom, where she discovered the raucous raccoon sleeping it off in between a toilet and a bin. The sozzled suspect was rumbled and described as \"very intoxicated\" by Hanover County Animal Protection and Shelter. \n                  The night Democrats fought back against Trump\n                 \n                  Letitia James indicted for fraud after Donald Trump demanded case against New York attorney general\n                 \n                  Virginia man dies after bear shot by fellow hunter falls on top of him from tree\n                 Read more like this:Judge wears Elvis wig in courtDie Hard's Christmas credentials questioned A Facebook statement said: \"Officer Martin safely secured our masked bandit and transported him back to the shelter to sober up before questioning. \"After a few hours of sleep and zero signs of injury (other than maybe a hangover and poor life choices), he was safely released back to the wild, hopefully having learned that breaking and entering is not the answer.\" The spirit animal has now been barred - and unfortunately, there's no CCTV footage of him getting completely pawless. Why? Because he entered the building through the ceiling… and took the camera down with him. The store has thanked Officer Martin for \"providing our visitor with a sober ride home\" after he racked up a substantial bill."
    },
    {
        "title": "'Systematic failures' in China spy trial could be repeated, MPs warn",
        "description": "\"Systematic failures\" led to the Chinese spy case collapsing - and there's a risk they could be repeated, a parliamentary inquiry has said.",
        "url": "https://news.sky.com/story/systematic-failures-in-china-spy-trial-could-be-repeated-mps-warn-13478435",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-christopher-cash-christopher-berry_7045458.png?20251007215609",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-02 18:42:00",
        "Headline": "The China spy case collapse caused a blame game between the government, the CPS, and the Conservatives, who were in power when the case began.",
        "Content": " \"Systematic failures\" led to the Chinese spy case collapsing - and there's a risk they could be repeated, a parliamentary inquiry has said. A report by the Joint Committee on the National Security Strategy (JCNSS) criticised the government and Crown Prosecution Service (CPS) after the case against two British men accused of spying for China collapsed. Former parliamentary researcher Christopher Cash and teacher Christopher Berry were accused of passing secrets to Beijing between 2021 and 2023. They deny the allegations. The charges were dropped in September as the CPS said it could not get evidence from the government referring to China as a national security threat, prompting accusations of a \"cover-up\" by the Conservatives. The report by the cross-party group of MPS and peers said the case was beset by \"confusion and misaligned expectations\" and cautioned against dismissing the case as a \"one-off\" caused by outdated espionage laws - something the government blamed for the case's collapse.  'Serious systemic failures' The committee - which launched a highly unusual investigation following the controversy - warned there are parallels in new legislation which must be handled carefully to prevent a similar issue from recurring. But while \"the sequence of some events has raised eyebrows\", it found no evidence of deliberate or co-ordinated attempts to block or collapse the prosecution - including by the prime minister's national security adviser Jonathan Powell, who met with officials about the case two days before it was dropped. However, the committee added: \"Overall it is clear that there were serious systemic failures and deficiencies in communications, co-ordination and decision-making.\" It described communications between the government and CPS as \"inadequate\" and lacking clarity, with an \"insufficiently robust\" level of senior oversight right from the start of proceedings in 2023 under the Tories. Read more:Key witness 'surprised' case collapsedMPs warned of new spying attempts Not enough 'common sense'? A statement by deputy national security adviser (DNSA) Matt Collins became the focus after the case's collapse. Prosecutors said his refusal to describe Beijing as a \"threat\" to national security meant the case could not continue. Mr Collins, the central expert prosecution witness, told the investigation he had provided evidence of a \"range of threats\" posed by China, but did not describe it as a \"generic\" threat as that was not the then Tory government's position. The committee acknowledged the CPS's assertion it would have undermined the case at trial if Mr Collins refused to describe China as an active threat, but suggested his statements taken together would have been sufficient. \"We regret that common sense interpretations of the wording provided in the DNSA's witness statements were apparently not a sufficiently strong basis for meeting the evidential requirements the Crown Prosecution Service considered necessary under the Official Secrets Act 1911,\" it said. It accepted the \"root cause\" of the problems lay with the Official Secrets Act, which required the term \"enemy\" to be used of a foreign power, but warned the new National Security Act 2023 doesn't eliminate \"diplomatic sensitivities\" around labelling people members of a foreign intelligence service.  The committee recommends: • The Cabinet Office and security services to work with the CPS to formalise principles for handling sensitive cases within the next six months • Establishing a new rule for a formal case \"conference\" within 30 days of such charges to avoid a \"lack of clarity\" over evidence in future. \"We urge the government to avoid characterising the failure of the Cash/Berry case as a one-off peculiarity created solely by outdated legislation: there are structural parallels in the National Security Act 2023 which will require careful handling to avoid comparable issues recurring,\" the committee said. A CPS spokesperson said: \"We recognise the strong interest in this case. We will review the recommendations carefully and work with partners to identify where improvements can be made. \"Our decisions are made independently and based on law and evidence, and that principle remains at the heart of our work.\" A government spokesperson said: \"We welcome the committee's report that makes clear that allegations about interference in this case were baseless and untrue. \"The decision to drop the case was taken independently by the Crown Prosecution Service. We remain disappointed that this case did not reach trial. \"Protecting national security is our first duty, and we will never waver from our efforts to keep the British people safe.\""
    },
    {
        "title": "The Wargame: Inside the decades-long saga that's left UK shockingly unprepared for war",
        "description": "The UK is \"really unprepared\" to fight a war and has been living on a \"mirage\" of military strength that was shocking to discover, interviews with almost every defence secretary since the end of the Cold War have revealed.",
        "url": "https://news.sky.com/story/the-wargame-inside-the-decades-long-saga-thats-left-uk-shockingly-unprepared-for-war-13478178",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-war-game-the-wargame_7097730.jpg?20251201161007",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2025-12-02 08:15:00",
        "Headline": "Sky News podcast The Wargame returns to uncover what happened behind the scenes as the UK switched funding from warfare to peacetime priorities, as told by defence secretaries who oversaw it.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  The UK is \"really unprepared\" to fight a war and has been living on a \"mirage\" of military strength that was shocking to discover, interviews with almost every defence secretary since the end of the Cold War have revealed. With Sir Keir Starmer under pressure to accelerate plans to reverse the decline, two new episodes of Sky News and Tortoise's podcast series The Wargame uncover what happened behind the scenes as Britain switched funding away from warfare and into peacetime priorities such as health and welfare after the Soviet Union collapsed. 👉Search for The Wargame on your podcast app👈 This decades-long saga, spanning multiple Labour, Conservative and coalition governments, includes heated rows between the Ministry of Defence (MoD) and the Treasury, threats to resign, and dire warnings of weakness. It also exposes a failure by the military and civil service to spend Britain's still-significant defence budget effectively, further compounding the erosion of fighting power.  'Russia knew' about UK's weaknesses Now, with the threat from Russia returning, there is a concern the UK has been left to bluff about its ability to respond, rather than pivot decisively back to a war footing. \"We've been living on a sort of mirage for so long,\" says Sir Ben Wallace, a Conservative defence secretary from 2019 until 2023. \"As long as Trooping the Colour was happening, and the Red Arrows flew, and prime ministers could pose at NATO, everything was fine. \"But it wasn't fine. And the people who knew it wasn't fine were actually the Americans, but also the Russians.\" Not enough troops, medics, or ammo Lord George Robertson, a Labour defence secretary from 1997 to 1999 and the lead author of a major defence review this year, says when he most recently \"lifted the bonnet\" to look at the state of the Army, Royal Navy and Royal Air Force, he found \"we were really unprepared\". \"We don't have enough ammunition, we don't have enough logistics, we don't have enough trained soldiers, the training is not right, and we don't have enough medics to take the casualties that would be involved in a full-scale war.\" Asked if the situation was worse than he had imagined, Lord Robertson says: \"Much worse.\" 'I was shocked,' says ex-defence secretary Sir Gavin Williamson, a former Conservative defence secretary, says he too had been \"quite shocked as to how thin things were\" when he was in charge at the MoD between 2017 and 2019. \"There was this sort of sense of: 'Oh, the MoD is always good for a billion [pounds] from Treasury - you can always take a billion out of the MoD and nothing will really change.' \"And maybe that had been the case in the past, but the cupboards were really bare. \"You were just taking the cupboards.\"  But Lord Philip Hammond, a Conservative defence secretary from 2011 to 2014 and chancellor from 2016 until 2019, appears less sympathetic to the cries for increased cash. \"Gavin Williamson came in [to the Ministry of Defence], the military polished up their bleeding stumps as best they could and convinced him that the UK's defence capability was about to collapse,\" he says. \"He came scuttling across the road to Downing Street to say, I need billions of pounds more money… To be honest, I didn't think that he had sufficiently interrogated the military begging bowls that had been presented to him.\" What to expect from The Wargame's return Episodes one to five of The Wargame simulate a Russian attack on the UK and imagine what might happen, with former politicians and military chiefs back in the hot seat. The drama reveals how vulnerable the country has really become to an attack on the home front. The two new episodes seek to find out why. The story of the UK's hollowed-out defences starts in a different era when an Iron Curtain divided Europe, Ronald Reagan was president of the US, and an Iron Lady was in power in Britain. Sir Malcolm Rifkind, who went on to serve as defence secretary between 1992 and 1995 under John Major, recalls his time as minister for state at the Foreign Office in 1984. In December of that year, then prime minister Margaret Thatcher agreed to host a relatively unknown member of the Soviet Communist Party Politburo called Mikhail Gorbachev, who subsequently became the last leader of the Soviet Union. Sir Malcolm remembers how Mrs Thatcher emerged from the meeting to say: \"I think Mr Gorbachev is a man with whom we can do business.\" It was an opinion she shared with her close ally, the US president. Sir Malcolm says: \"Reagan would have said, 'I'm not going to speak to some unknown communist in the Politburo'. But if the Iron Lady, who Reagan thought very highly of, says he's worth talking to, he must be worth it. We'd better get in touch with this guy. Which they did. \"And I'm oversimplifying it, but that led to the Cold War ending without a shot being fired.\" Read more from Sky News:Courts in 'calamitous' stateReeves faces rural Labour rebellion In the years that followed, the UK and  much of the rest of Europe reaped a so-called peace dividend, cutting defence budgets, shrinking militaries and reducing wider readiness for war. Into this different era stepped Tony Blair as Labour's first post-Cold War prime minister, with Lord Robertson as his defence secretary. Lord Robertson reveals the threat he and his ministerial team secretly made to protect their budget from then chancellor Gordon Brown amid a sweeping review of defence, which was meant to be shaped by foreign policy, not financial envelopes. \"I don't think I've ever said this in public before, but John Reid, who was the minister for the Armed Forces, and John Speller, who was one of the junior ministers in the department, the three of us went to see Tony Blair late at night - he was wearing a tracksuit, we always remember - and we said that if the money was taken out of our budget, the budget that was based on the foreign policy baseline, then we would have to resign,\" Lord Robertson says. \"We obviously didn't resign - but we kept the money.\" The podcast hears from three other Labour defence secretaries: Geoff Hoon, Lord John Hutton and the current incumbent, John Healey. For the Conservatives, as well as Rifkind, Hammond, Williamson and Wallace, there are interviews with Liam Fox, Sir Michael Fallon, Dame Penny Mordaunt and Sir Grant Shapps. In addition, military commanders have their say, with recollections from Field Marshal Lord David Richards, who was chief of the defence staff from 2010 until 2013, General Sir Nick Carter, who led the armed forces from 2018 until 2021, and Vice Admiral Sir Nick Hine, who was second in charge of the navy from 2019 until 2022. 'We cut too far' At one point, Sir Grant, who held a variety of cabinet roles, including defence secretary, is asked whether he regrets the decisions the Conservative government took when in power. He says: \"Yes, I think it did cut defence too far. I mean, I'll just be completely black and white about it.\" Lord Robertson says Labour too shares some responsibility: \"Everyone took the peace dividend right through.\""
    },
    {
        "title": "'Death, prison or the loss of your sanity': A decade of county lines leaves its scars on children",
        "description": "A decade on from when authorities identified the emergence of \"county lines\" drug dealing, children exploited by the trade are now often either dead, in prison or have been sectioned with mental health problems caused by the trauma.",
        "url": "https://news.sky.com/story/death-prison-or-the-loss-of-your-sanity-a-decade-of-county-lines-leaves-its-scars-on-children-13478398",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-addict-drug-county-lines_7098760.jpg?20251202175158",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-12-02 17:09:00",
        "Headline": "Sky News has spoken to parents and former child runners who say the long-term impact is devastating, as new figures show the problem shows no sign of abating.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  A decade on from when authorities identified the emergence of \"county lines\" drug dealing, children exploited by the trade are now often either dead, in prison or have been sectioned with mental health problems caused by the trauma. Sky News has spoken to parents and former child runners who say the long-term impact is devastating, as new figures show the problem shows no sign of abating. In the last 12 months, police referred 3,200 vulnerable people, mostly children, to support services - in the latest crackdown on child exploitation within country lines gangs. Some 1,200 gang members were arrested in the same period.  \"Lucy\" was a drug runner featured in a Sky News film in 2018 on the exploitation of children used as drug runners. Aged 13, she was set up to be robbed by her own gang during a trip from London to Southampton, then stabbed as punishment, and debt-bonded so she would run drugs for free. At the same age she was also made pregnant by one of the gang members. Now in her early 20s she says the experience traumatised her, and she was sectioned with severe mental health problems. She says: \"My paranoia just overtook me. I was so paranoid all the time, like having to lock the doors, checking the windows, checking behind me walking in the street, not being able to breathe really, just constantly on edge. \"I was afraid of them finding me, or getting attacked again, or them making me work and feeling like a slave.\" Lucy currently lives in a refuge, in hiding from a violent man. 'That's the cruelty of it all' Amanda Stephens' son, Olly, had a similar experience to Lucy when he was 13. Olly was set up and robbed by his own gang on a trip to London from Reading. Amanda says: \"It wasn't until he spoke quite honestly with the social worker, he said, Olly, you were set up. Olly thought they were his friends and that's the cruelty of it all.\" Read more from Sky News:Courts in 'calamitous' stateReeves faces rural Labour rebellion Olly was autistic and vulnerable to influence. Amanda noticed his group of friends changed when he moved to secondary school and his locator on his phone sometimes placed him further away from home than he should be, but he refused to say what was going on. \"We lost control completely of him as our child.\" Olly did warn his father that some children wanted to stab him - and tragically, despite his parents' efforts to keep him safe, in January 2021, Olly was lured to a field by a 14-year-old girl, where he was stabbed to death by two boys aged 13 and 14. Vulnerable people 'exploited' It was August 2015 when a report by the National Crime Agency said the Home Office had \"identified a growing body of intelligence… that vulnerable young people are being exploited in order to facilitate the running of street level dealing\". It added: \"'County Lines' is a national issue involving the use of mobile phone 'lines' by groups to extend their drug dealing business into new locations outside of their home areas.\" This led to a wave of knife crime among young people, and a new law recognising the exploitation of children under the Modern Slavery Act in 2015. Mother says her son was 'radicalised' One parent, \"Laura\", told Sky News she felt like her son had been \"radicalised\" into drug dealing and acted like he was \"on remote control\", once jumping out of her car on the school run after one gang member sent him a text. Like Lucy, Laura's son ended up being sectioned in his late teens and needing ongoing mental health support. Every gift came at a price Sarah, who doesn't want us to use her surname, says her son's involvement in county lines began when he was offered a McDonald's aged 12, in return for running an errand. She says every gift came at a price: \"So, they would give him the trainers, give him a bike, the coat, and everything they gave him were actually in their benefit, because if he was warm, he wasn't coming home. If he could get around faster, he could drop more. They would act like it was a gift, but, actually, you had to pay it off in bits.\" Sarah says, 10 years on, the long-term impact has been devastating. \"Currently, he's serving a custodial sentence for possession with intent to sell. Mentally I think he's traumatised. Physically, he has scars from knife injuries, fractures. A face that I will never recognise, because people have broken that a couple of times.\" 'The consequences are death, prison, or the loss of your sanity' A Sky News report in 2018 called Behind County Lines, which included Lucy's story, was part of the inspiration for a play called CODE by Justice In Motion, which tours schools and town centres. Both Amanda and Sarah believe every child and parent should watch the production, which tells a story similar to Lucy's of a child groomed into joining a county lines gang. Lead actor and rapper Still Shadey, who grew up in south London, had friends exploited by county lines gangs. He says: \"The outcomes are clear. The consequences are death, prison, or the loss of your sanity.\" The problem has had less publicity recently but continues to be a major focus for police with 2,300 \"deal lines\" closed by operations in the 12 months since July 2024, the highest annual figures since the government's County Lines Programme began in 2019. 'Disgusting and cowardly' Crime and policing minister Sarah Jones said: \"The exploitation of children and vulnerable people in this way is disgusting and cowardly. County lines gangs are also driving knife crime in our communities, and I want criminals to know that we will not let them get away with it. We will be relentless in going after these gangs.\" The government has already announced new offences as part of the Crime and Policing Bill, including \"criminal exploitation of children\", which seek to increase convictions against exploiters and deter gangs from enlisting children. It will carry a maximum penalty of 10 years in prison."
    },
    {
        "title": "Rachel Reeves hit by Labour rural rebellion over inheritance tax on farmers",
        "description": "Chancellor Rachel Reeves has suffered another budget blow with a rebellion by rural Labour MPs over inheritance tax on farmers.",
        "url": "https://news.sky.com/story/rachel-reeves-hit-by-labour-rural-rebellion-over-inheritance-tax-on-farmers-13478529",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-farmer-protest_7099103.jpg?20251202223002",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-12-02 21:52:00",
        "Headline": "A number of Labour MPs in rural seats declined to back the government's move to impose inheritance tax on farmers, but just one voted against.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Chancellor Rachel Reeves has suffered another budget blow with a rebellion by rural Labour MPs over inheritance tax on farmers. Speaking during the final day of the Commons debate on the budget, Labour backbenchers demanded a U-turn on the controversial proposals. Plans to introduce a 20% tax on farm estates worth more than £1m from April have drawn protesters to London in their tens of thousands, with many fearing huge tax bills that would force small farms to sell up for good. MPs voted on the so-called \"family farms tax\" just after 8pm on Tuesday, with dozens of Labour MPs appearing to have abstained, and one backbencher - borders MP Markus Campbell-Savours - voting against, alongside Conservative members. In the vote, the fifth out of seven at the end of the budget debate, Labour's vote slumped from 371 in the first vote on tax changes, down by 44 votes to 327. The mini-mutiny followed a plea to Labour MPs from the National Farmers Union to abstain. \"To Labour MPs: We ask you to abstain on Budget Resolution 50,\" the NFU urged. \n                  Starmer cuts short Buckinghamshire visit after farmers stage noisy tractor protest\n                 \n                  UK's 'most expensive coffee' goes on sale to fund farm's future\n                 \n                  Ex-Labour adviser John McTernan suggests doing to farms 'what Thatcher did to coal mines'\n                 \"With your help, we can show the government there is still time to get it right on the family farm tax. A policy with such cruel human costs demands change. Now is the time to stand up for the farmers you represent.\" After the vote, NFU president Tom Bradshaw said: \"The MPs who have shown their support are the rural representatives of the Labour Party. They represent the working people of the countryside and have spoken up on behalf of their constituents. \"It is vital that the chancellor and prime minister listen to the clear message they have delivered this evening. The next step in the fight against the family farm tax is removing the impact of this unjust and unfair policy on the most vulnerable members of our community.\"  The government comfortably won the vote by 327-182, a majority of 145. But the mini-mutiny served notice to the chancellor and Sir Keir Starmer that newly elected Labour MPs from the shires are prepared to rebel. Speaking in the debate earlier, Mr Campbell-Savours said: \"There remain deep concerns about the proposed changes to agricultural property relief (APR). \"Changes which leave many, not least elderly farmers, yet to make arrangements to transfer assets, devastated at the impact on their family farms.\" Samantha Niblett, Labour MP for South Derbyshire abstained after telling MPs: \"I do plead with the government to look again at APR inheritance tax. \"Most farmers are not wealthy land barons, they live hand to mouth on tiny, sometimes non-existent profit margins. Many were explicitly advised not to hand over their farm to children, (but) now face enormous, unexpected tax bills. \"We must acknowledge a difficult truth: we have lost the trust of our farmers, and they deserve our utmost respect, our honesty and our unwavering support.\"  Labour MPs from rural constituencies who did not vote included Tonia Antoniazzi (Gower), Julia Buckley (Shrewsbury), Torquil Crichton (Western Isles), Jonathan Davies (Mid Derbyshire), Maya Ellis (Ribble Valley), and Anna Gelderd (South East Cornwall), Ben Goldsborough (South Norfolk), Alison Hume (Scarborough and Whitby), Terry Jermy (South West Norfolk), Jayne Kirkham (Truro and Falmouth), Noah Law (St Austell and Newquay), Perran Moon, (Camborne and Redruth), Samantha Niblett (South Derbyshire), Jenny Riddell-Carpenter (Suffolk Coastal), Henry Tufnell (Mid and South Pembrokeshire), John Whitby (Derbyshire Dales) and Steve Witherden (Montgomeryshire and Glyndwr)."
    },
    {
        "title": "Princess of Wales describes 'power of reaching out' in festive message",
        "description": "The Princess of Wales has written about the importance of \"small acts of care\" at a time \"when life can sometimes feel fragmented or uncertain\", ahead of her fifth annual Christmas carol service.",
        "url": "https://news.sky.com/story/princess-of-wales-describes-power-of-reaching-out-in-festive-message-13478374",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-princess-of-wales-together-at-christmas_7098726.jpg?20251202172503",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-12-02 16:15:00",
        "Headline": "\"Christmas speaks of love taking form in the simplest, most human ways,\" writes Kate.  \"Not in sentimental or grand gestures, but gentle ones.\" The letter comes ahead of her  Together at Christmas carol service, recognising those helping their communities.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n The Princess of Wales has written about the importance of \"small acts of care\" at a time \"when life can sometimes feel fragmented or uncertain\", ahead of her fifth annual Christmas carol service. In the letter, which will be given to members of the congregation at Westminster Abbey on Friday evening and at services held in other parts of the country, she sets out the meaning of this year's theme, the importance of love. Kate writes: \"At a time when life can sometimes feel fragmented or uncertain, the Christmas season invites us to remember the power of reaching out to one another with generosity of heart, understanding and hope.\" Emphasising how seemingly small, but important, those acts of kindness can be, she adds: \"At its heart, Christmas speaks of love taking form in the simplest, most human ways. Not in sentimental or grand gestures, but gentle ones. \"A moment of listening, a word of comfort, a friendly conversation, a helping hand, presence. These simple acts of care might seem small, but they contribute to the beautiful tapestry of life to which we all belong.\" Kate will be joined by Prince William for the Together at Christmas service, along with other members of the royal family among the 1,600 guests at Westminster Abbey. There will be music from performers including Hannah Waddingham, Bastille's Dan Smith, Griff, Katie Melua and Cornish folk group, Fisherman's Friends. \n                  Princess of Wales: Show people with addictions 'compassion and love' instead of 'judgement'\n                 \n                  Princess of Wales calls on businesses to value 'time and tenderness' in rare speech\n                 \n                  Princess of Wales lays Armistice Day wreath - as Queen Camilla marks event at Paddington\n                 Speakers include actors Kate Winslet, Chiwetel Ejiofor, Joe Locke and comedian Babatunde Aleshe. In London and the 15 other towns and cities across the UK where events will take place, the congregations will be made up of invited guests who have gone above and beyond to help their communities. Praising their selfless efforts to support others, the princess stresses in her letter how Christmas is a time to remember how powerful their work really is. \"Even with all the rushing around and familiar traditions, there is a quieter sense of what it calls out in us,\" she writes. \"There is a softness to the season that reminds us of something easy to forget; that what we do matters. \"Our words, our choices, and even the ways we look out for one another - they ripple outward, touching lives we may never see\". Read more from Sky News:Kate's plea for 'compassion and love'Princess of Wales's message to businessWilliam and Kate win legal battle The other services will be held in Armagh, Berkshire, Derbyshire, Dumfries, Dyfed, East Riding, Gwent, Greater Manchester, Isle of Wight, Lanarkshire, Nottinghamshire, Renfrewshire, Ayrshire, Suffolk, Wiltshire and Worcestershire and will be hosted by lord-lieutenants and supported by The Royal Foundation. The Westminster Abbey service is to air on ITV1 and ITVX on Christmas Eve and will be repeated on Christmas Day."
    },
    {
        "title": "'Systematic failures' in China spy trial could be repeated, MPs warn",
        "description": "\"Systematic failures\" led to the Chinese spy case collapsing - and there's a risk they could be repeated, a parliamentary inquiry has said.",
        "url": "https://news.sky.com/story/systematic-failures-in-china-spy-trial-could-be-repeated-mps-warn-13478435",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-christopher-cash-christopher-berry_7045458.png?20251007215609",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-02 18:42:00",
        "Headline": "The China spy case collapse caused a blame game between the government, the CPS, and the Conservatives, who were in power when the case began.",
        "Content": " \"Systematic failures\" led to the Chinese spy case collapsing - and there's a risk they could be repeated, a parliamentary inquiry has said. A report by the Joint Committee on the National Security Strategy (JCNSS) criticised the government and Crown Prosecution Service (CPS) after the case against two British men accused of spying for China collapsed. Former parliamentary researcher Christopher Cash and teacher Christopher Berry were accused of passing secrets to Beijing between 2021 and 2023. They deny the allegations. The charges were dropped in September as the CPS said it could not get evidence from the government referring to China as a national security threat, prompting accusations of a \"cover-up\" by the Conservatives. The report by the cross-party group of MPS and peers said the case was beset by \"confusion and misaligned expectations\" and cautioned against dismissing the case as a \"one-off\" caused by outdated espionage laws - something the government blamed for the case's collapse.  'Serious systemic failures' The committee - which launched a highly unusual investigation following the controversy - warned there are parallels in new legislation which must be handled carefully to prevent a similar issue from recurring. But while \"the sequence of some events has raised eyebrows\", it found no evidence of deliberate or co-ordinated attempts to block or collapse the prosecution - including by the prime minister's national security adviser Jonathan Powell, who met with officials about the case two days before it was dropped. However, the committee added: \"Overall it is clear that there were serious systemic failures and deficiencies in communications, co-ordination and decision-making.\" It described communications between the government and CPS as \"inadequate\" and lacking clarity, with an \"insufficiently robust\" level of senior oversight right from the start of proceedings in 2023 under the Tories. Read more:Key witness 'surprised' case collapsedMPs warned of new spying attempts Not enough 'common sense'? A statement by deputy national security adviser (DNSA) Matt Collins became the focus after the case's collapse. Prosecutors said his refusal to describe Beijing as a \"threat\" to national security meant the case could not continue. Mr Collins, the central expert prosecution witness, told the investigation he had provided evidence of a \"range of threats\" posed by China, but did not describe it as a \"generic\" threat as that was not the then Tory government's position. The committee acknowledged the CPS's assertion it would have undermined the case at trial if Mr Collins refused to describe China as an active threat, but suggested his statements taken together would have been sufficient. \"We regret that common sense interpretations of the wording provided in the DNSA's witness statements were apparently not a sufficiently strong basis for meeting the evidential requirements the Crown Prosecution Service considered necessary under the Official Secrets Act 1911,\" it said. It accepted the \"root cause\" of the problems lay with the Official Secrets Act, which required the term \"enemy\" to be used of a foreign power, but warned the new National Security Act 2023 doesn't eliminate \"diplomatic sensitivities\" around labelling people members of a foreign intelligence service.  The committee recommends: • The Cabinet Office and security services to work with the CPS to formalise principles for handling sensitive cases within the next six months • Establishing a new rule for a formal case \"conference\" within 30 days of such charges to avoid a \"lack of clarity\" over evidence in future. \"We urge the government to avoid characterising the failure of the Cash/Berry case as a one-off peculiarity created solely by outdated legislation: there are structural parallels in the National Security Act 2023 which will require careful handling to avoid comparable issues recurring,\" the committee said. A CPS spokesperson said: \"We recognise the strong interest in this case. We will review the recommendations carefully and work with partners to identify where improvements can be made. \"Our decisions are made independently and based on law and evidence, and that principle remains at the heart of our work.\" A government spokesperson said: \"We welcome the committee's report that makes clear that allegations about interference in this case were baseless and untrue. \"The decision to drop the case was taken independently by the Crown Prosecution Service. We remain disappointed that this case did not reach trial. \"Protecting national security is our first duty, and we will never waver from our efforts to keep the British people safe.\""
    },
    {
        "title": "Courts system in a 'calamitous' state, warns ex-judge who recommended jury cuts",
        "description": "Sir Brian Leveson, who conducted the independent review of the courts system that guided the government's decision to reduce on jury trials, has suggested there is no alternative.",
        "url": "https://news.sky.com/story/courts-system-in-a-calamitous-state-warns-ex-judge-who-recommended-jury-cuts-13478489",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/2336f464f1df495ed6ddd4016130bbe9c18a0cb101cb4996740a07ddaf8ff622_7098834.jpg?20251202192722",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-02 20:46:00",
        "Headline": "Sir Brian Leveson told Sky's Politics Hub that the government plan to restrict jury trials will mean at least a \"20% time saving\" and help tackle the courts backlog.",
        "Content": " Sir Brian Leveson, who conducted the independent review of the courts system that guided the government's decision to reduce on jury trials, has suggested there is no alternative. Speaking to Sky's Politics Hub programme, the retired judge argued that by restricting jury trials, Justice Secretary David Lammy is \"aiming to try to solve the systemic problems\" in courts. He told Sky presenter Ali Fortescue: \"I am a great believer in trial by jury, but trials with a jury take very much longer than trials conducted otherwise than with 12 people who are utterly unused to criminal procedure and criminal evidence. \"So my concern is that we need to get through cases quicker.\" He said that it was likely a \"20% time saving would result\" from the move, although he thinks that \"a great deal more\" would be saved. Asked about the criticism today of the decision, Sir Brian said: \"I'm gaining no pleasure from it, but what I say to all of them is 'If not this, then what?' How do we reduce the backlog so the victims and witnesses get their day in court within a reasonable time?\" He argued that \"we should use our resources proportionately to the gravity of the offending\", and \"there are some cases which, to my mind, do not merit or require a trial by jury\". \n                  Jury trials will be scrapped for defendants facing sentences of three years or less, David Lammy announces\n                 \n                  Two mistakenly released prisoners still at large, says justice secretary\n                 \n                  David Lammy to unveil plans to tackle 'courts emergency' - but possible limits to jury trials spark concern\n                 Sir Brian said that some jurors he had spoken to said it was \"worthwhile\". But he added: \"They've given up two weeks of their life, sometimes without any pay except the small remuneration that they receive from the state doing jury service, and they've been trying cases which shouldn't merit their attention\". Asked if he would want a trial by jury if he had been wrongly accused of theft, Sir Brian said: \"If I'd been wrongly accused of theft, I'd be perfectly happy for a judge to decide I'd been wrongly accused of theft.\"  More broadly, he said: \"I don't see how you're going to bring down the backlog without more money, more sitting days, greater efficiency, and speedier trials... \"There aren't the judges, there aren't the court staff, more significantly there aren't the advocates.\" He said that the justice system had never been in such a \"calamitous\" state. 👉 Listen to Sky News Daily on your podcast app 👈 'The reforms are about fairness' Courts minister Sarah Sackman also defended the decision on Tuesday's Politics Hub. She acknowledged that jury trials were \"a success story\", and \"a cornerstone of British justice and will remain so after today's plans\". But she added: \"What's not such a success story is the fact that we inherited record and rising backlogs in our courts. \"Today the number starts at 80,000 cases, and it's on the rise - due to hit 100,000 by 2028.\" That leaves victims \"waiting for their case to be heard\". She argued that the measures announced on Tuesday were \"a set of reforms that will restore confidence in our justice system, get those delays down, and indeed preserve jury trials for the most serious cases\". Ms Sackman added that \"right now in our system, 90% of cases [are] being heard without a jury in our magistrates\", which is \"fair, robust justice\". \"Part of fairness is about the swiftness we need to deliver swifter justice for victims,\" she said. \"What's not fair is a victim of crime being told today that she needs to wait until 2029, 2030 for her day in court.\"  The minister gave an example of what will change, saying: \"Supposing a defendant is accused of stealing a bottle of whisky. \"Is it right that we allow the defendant to insist on a slower, more expensive jury trial in the same queue as the victim of rape, making her wait and in some cases, justice not being served? \"That's the choice that we've made today.\" But the minister refused to say how much this would reduce the backlog by."
    },
    {
        "title": "Holly Willoughby fined after colliding with moped and injuring rider",
        "description": "TV presenter Holly Willoughby has been fined in court after she admitted driving without due care and attention when her car collided with a moped, injuring the rider.",
        "url": "https://news.sky.com/story/holly-willoughby-fined-after-colliding-with-moped-and-injuring-rider-13478444",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-holly-willoughby-bear-hunt_7098840.jpg?20251202193232",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-02 19:19:00",
        "Headline": "Police were called to a collision in Barnes, southwest London, on 28 August. It happened as the TV presenter was driving her Mini Cooper near her Richmond home. She was fined £1,653 for driving without due care.",
        "Content": "TV presenter Holly Willoughby has been fined in court after she admitted driving without due care and attention when her car collided with a moped, injuring the rider. The star, 44, pleaded guilty by post to the charge at Lavender Hill Magistrates' Court on Tuesday but did not attend the hearing. Willoughby was fined £1,653 alongside £130 in costs and a £661 victim surcharge and given six points on her licence, the Metropolitan Police said. According to court documents, the incident happened on 28 August as she was driving her Mini Cooper near her home in Richmond, southwest London. Police were called to Church Road, Barnes, following reports of a collision. The rider of the moped, a 43-year-old man, was taken to hospital. His injuries were assessed as neither life-threatening nor life-changing. Read more from Sky News:Gavin Plumb loses appealWilloughby tells of 'tough' year The presenter is best known for fronting Dancing On Ice as well as ITV daytime show This Morning, which she left in October 2023."
    },
    {
        "title": "Sarah Everard's mother 'tormented' by her last hours as Angiolini women's safety report is released",
        "description": "Sexually motivated crimes against women in public do not get the same response as other high-priority crimes, an inquiry into the rape and murder of Sarah Everard by off-duty police officer Wayne Couzens has found.",
        "url": "https://news.sky.com/story/sex-offences-against-women-not-given-same-response-as-other-high-priority-crimes-inquiry-finds-13478132",
        "image_url": "https://e3.365dm.com/23/03/1920x1080/skynews-sarah-everard-met-police_6096154.jpg?20230321153027",
        "type": "UK",
        "Author": "Miriam Kuepper, news reporter",
        "Date Published": "2025-12-02 11:50:00",
        "Headline": "Angiolini report follows Everard's murder by off-duty police officer Wayne Couzens and finds that 26% of police forces lack basic sex offence policies. \"Get a move on,\" they are told. \"There are lives at stake.\"",
        "Content": "By Miriam Kuepper, news reporter   Sexually motivated crimes against women in public do not get the same response as other high-priority crimes, an inquiry into the rape and murder of Sarah Everard by off-duty police officer Wayne Couzens has found. The inquiry was launched after Ms Everard's death to investigate how Couzens was able to carry out his crimes, and look at wider issues within policing and women's safety. Ms Everard's mother told the inquiry of her unrelenting grief, saying she was going \"through a turmoil of emotions - sadness, rage, panic, guilt and numbness\". \"After four years the shock of Sarah's death has diminished but we are left with an overwhelming sense of loss and of what might have been,\" Susan Everard said. \"All the happy ordinary things of life have been stolen from Sarah and from us - there will be no wedding, no grandchildren, no family celebrations with everyone there. \"Sarah will always be missing and I will always long for her.\" She added: \"I am not yet at the point where happy memories of Sarah come to the fore. When I think of her, I can't get past the horror of her last hours. I am still tormented by the thought of what she endured.\" Ms Everard, a 33-year-old marketing executive, was abducted by Couzens as she walked home from a friend's house in south London in March 2021. He had used his status as a police officer to trick Ms Everard into thinking he could arrest her for breaking lockdown rules. 'No better time to act' Publishing her findings on Tuesday, Lady Elish Angiolini, a former solicitor general for Scotland, said: \"There is no better time to act than now. I want leaders to, quite simply, get a move on. There are lives at stake.\" This second part of the independent inquiry is split into two reports, with the first focusing on the prevention of sexually motivated crimes against women in public spaces. Despite violence against women and girls being described as a \"national threat\" by the Home Office in a 2023 policing strategy and it being mentioned as a high priority for the current government, Lady Elish found the \"response overall lacks what is afforded to other high-priority crimes\". She said her recommendation in the first part of her inquiry - published last year - that those with convictions and/or cautions for sexual offences should be barred from policing, had not yet been implemented. Additionally, more than a quarter (26%) of police forces had yet to implement basic policies for investigating sexual offences, including indecent exposure. Lady Elish said: \"Prevention in this space remains just words. Until this disparity is addressed, violence against women and girls cannot credibly be called a 'national priority'.\" 'Women deserve to feel safer' The inquiry chair said with a greater spotlight on the safety of women in public, women should feel safer - \"but many do not\". \"Women change their travel plans, their routines, and their lives out of fears for their safety in public, while far too many perpetrators continue to roam freely,\" Lady Elish said after her report was published. \"Women deserve to feel safer. They deserve to be safer.\" The report found that there was a lack of data on sexually motivated crimes against women in public spaces, with Lady Elish calling it a \"critical failure\" that data on these offences is \"difficult to obtain, patchy and incomplete\". In the inquiry's public survey of 2,000 people, 76% of women aged 18 to 24 reported feeling unsafe in public because of the actions or behaviour of a man or men. A similar study for UN Women UK in 2021 found that 71% of women in the UK had experienced some form of sexual harassment in public, with higher rates of 86% for younger women aged 18 to 24. 'No silver bullet' She said sexually motivated crimes against women in public spaces were a whole society issue that required a whole society response, involving government, police and other agencies working together to fix an \"unacceptable\" and \"deeply disappointing\" level of inconsistency in responses. Recognising sexually motivated crime against women as a public health matter as well as a criminal matter was crucial, as these crimes were \"not inevitable\". The inquiry considers that \"there is not one silver bullet\" in tackling these crimes. Instead it calls for a \"long-term commitment, cross-party agreement and a steady course in preventing these crimes - through education, thorough investigations and swift arrests - always with an unswerving focus on the perpetrators\". Lady Elish's 13 recommendations include: • Focus on better collection and sharing of data at a national level • Better and more consistent targeted messaging around the issues, which is to be managed centrally • An information and intervention programme for men and boys - to be coordinated between the departments of education and social care as well as the Home Office - to create a culture of positive masculinity • Improving the investigation of sexually motivated crimes against women and girls - recommending that the home secretary mandates police forces to follow particular procedures 'Justice cannot only respond after harm' Zara Aleena, a 35-year-old law graduate, was killed as she walked home from a night out in east London. Her killer, Jordan McSweeney, was freed from prison nine days before he attacked Ms Aleena as she walked home in Ilford on 26 June 2022. Speaking after Lady Elish's second report was published, her aunt Farah Naz said: \"My niece, Zara Aleena, was walking home. That is all she was doing. Her death, like Sarah's, was preventable. \"It occurred because warnings were missed, risks were overlooked, and systems intended to safeguard the public did not function as they should. Zara's case reflects the wider patterns identified so clearly in this report: systemic failure rather than isolated tragedy.\" She added: \"Sarah's death exposed a system compromised from within. Zara's death shows that the gaps persisted - with fatal consequences. \"Sarah deserved safety. Zara deserved safety. Every woman deserves safety. Justice cannot only respond after harm - it must prevent harm.\" Speaking to Sky News on Tuesday, Ms Naz said Lady Elish and her team present a \"hopeful roadmap for change\" in the report. She said that \"whilst we know that systems have consistently been failing women, we need other interventions as well\". Ms Naz mentioned the Good Samaritan law, which creates a legal duty for people to call for help when they see someone in danger. She added: \"I always have hope. I have to. I look to Sarah and Zara for inspiration, and I keep on hoping that their lives haven't been taken in vain. And that they can be the instigators for change.\" 'We need a whole national approach' Mina Smallman, the mother of Bibaa Henry and Nicole Smallman, two sisters murdered in Wembley in 2020, also commented following the findings of the report. PC Jamie Lewis and PC Deniz Jaffer, who shared photos on WhatsApp of their bodies, were found guilty of gross misconduct. Speaking to Sky News on Tuesday, Ms Smallman said: \"I went into the Met a few weeks ago and discovered some glaring holes in vetting, in data collection, and some of that isn't the fault of the police. \"They're working with antiquated equipment and they have to pay for the use of programmes, which is a nonsense. They have to pay for it out of the funding. Why isn't it just given to them so that they can do the job that they need to do?\" She added: \"This cannot be solved by the police alone. We need a whole national approach to dealing with this issue. And it includes education, mental health, the police. Every level of service that we have needs to be involved in this.\" 'Women can't trust a system failing to change' End Violence Against Women director Andrea Simon: “It is deeply concerning that, nearly two years on, policing has still not implemented basic reforms such as a ban on officers with sexual offence histories.\" \"Women cannot be expected to trust a system that resists naming misogyny and racism and continually fails to change,\" she added. Deputy Assistant Commissioner Helen Millichap, director of the National Centre for Violence Against Women and Girls and Public Protection (NCVPP), said that the centre was already working \"proactively to recognise, intervene and interrupt predatory behaviour in public spaces\". \"We should not wait for a crime to be reported to act and we have seen some very effective joint operations with partners that target the right places and work together to make them safer,\" she said. Responding to the latest Angiolini Inquiry report, Home Secretary Shabana Mahmood said the report made it clear that women do not feel safe going about their lives today. \"This is utterly unacceptable and must change,\" she said. \"A new £13.1 million centre will strengthen the police response to these crimes and drive real change, but more needs to be done.\" She said the government would \"carefully\" the inquiry's recommendations. Stop 'another Couzens' The first part of the inquiry, published in February 2024, investigated how Couzens was able to abduct, rape and murder Ms Everard. The report found Couzens should never have been a police officer, stressing there needs to be a \"radical overhaul\" of police recruitment to stop \"another Couzens operating in plain sight\". It examined Couzens' career and highlighted how major red flags about him were \"repeatedly ignored\" by police vetting and investigations. After the publication of the second report, Ms Everard's family said in a statement that the report \"shows how much work there is to do in preventing sexually motivated crimes against women in public spaces\". They added: \"Sarah is always in our thoughts, of course, and we feel the inquiry continues to honour her memory. \"So too does it speak for all women who have been the victim of sexually motivated crimes in a public space and all those at risk.\" Read more:Women still feel unsafe on Britain's streetsHow Sarah Everard's killer was caughtTimeline: Wayne Couzen's behaviour and crimes The second report of part 2 of the inquiry will investigate police culture in regards to misogynistic and predatory attitudes and behaviours. Following the sentencing of former Met Police officer David Carrick in February 2023, part 3 of the inquiry was established, to examine Carrick's career and conduct. Last month, Carrick was handed his 37th life sentence with a minimum term of 30 years to run concurrently after he was found guilty of molesting a 12-year-old girl and raping a former partner."
    },
    {
        "title": "Hillsborough families hit out at report into disaster - as it finds 12 police officers would have faced gross misconduct cases",
        "description": "Police were guilty of \"deep complacency\", \"fundamental failure\" and a \"concerted effort\" to blame fans during and after the Hillsborough disaster, according to a report from the police watchdog.&#160;",
        "url": "https://news.sky.com/story/hillsborough-families-hit-out-at-report-into-disaster-as-it-finds-12-police-officers-would-have-faced-gross-misconduct-cases-13478187",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-hillsborough-composite_7097897.jpg?20251201194454",
        "type": "UK",
        "Author": "Greg Milam",
        "Date Published": "2025-12-02 12:58:00",
        "Headline": "Twelve officers would have faced gross misconduct investigations after a series of failings by police before, during and after the disaster, the IOPC says, but, as no one will be held to account, the report is a \"bitter injustice\" for bereaved relatives.",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n  Police were guilty of \"deep complacency\", \"fundamental failure\" and a \"concerted effort\" to blame fans during and after the Hillsborough disaster, according to a report from the police watchdog.  The Independent Office for Police Conduct has spent 13 years carrying out the largest ever independent investigation into alleged police misconduct and criminality. Its report identified a dozen officers - including the then-chief constable of South Yorkshire Police - who would have had a case to answer for gross misconduct had they still been serving. A 13th officer would have potentially faced a misconduct case. Hillsborough remains to this day the worst disaster in British sporting history. A crush on the terraces during the FA Cup semi-final at the stadium in Sheffield resulted in the death of 97 Liverpool fans on April 15 1989. The men, women and children were aged from 10 to 67. 'A source of national shame' What the victims' families have endured ever since, said IOPC deputy director general Kathie Cashell, was \"a source of national shame\". Ms Cashell said: \"The 97 people who were unlawfully killed, their families, survivors of the disaster and all those so deeply affected, have been repeatedly let down - before, during and after the horrific events of that day. \"First by the deep complacency of South Yorkshire Police in its preparation for the match, followed by its fundamental failure to grip the disaster as it unfolded, and then through the force’s concerted efforts to deflect the blame on to the Liverpool supporters, which caused enormous distress to bereaved families and survivors for nearly four decades.\"  The IOPC report also found that South Yorkshire Police \"fundamentally failed in its planning for the match, in its response as the disaster unfolded and in how it dealt with traumatised supporters and families searching for their loved ones\". Blaming the victims The force \"attempted to deflect the blame\" and \"this included allegations about the behaviour of supporters, which have been repeatedly disproven\". Police initially blamed Liverpool supporters, arriving late, drunk and without tickets, for causing the disaster but, after decades of campaigning by families, that narrative was debunked. In April 2016, new inquests - held after the original verdicts of accidental death were quashed in 2012 - determined that those who died had been unlawfully killed. The IOPC also examined the actions of West Midlands Police, which investigated the disaster and supported Lord Justice Taylor's inquiry that followed. It found the force's investigation was \"wholly unsatisfactory and too narrow\". Gross misconduct The report names 12 officers who would have had a case to answer for gross misconduct. They include the then-South Yorkshire chief constable Peter Wright \"for his part in attempting to minimise culpability and deflect blame for the disaster away from SYP and towards Liverpool supporters\". Peter Wright died in 2011. Also named is the match commander on the day, Chief Supt David Duckenfield. He was cleared by a jury of gross negligence manslaughter at a retrial in November 2019, after the jury in his first trial was unable to reach a verdict. Dozens of allegations of misconduct against officers have been upheld but none will face disciplinary proceedings because they have all left the police service.  Legislation in place at the time did not require the police to have a duty of candour. But the report has received a lukewarm reception from some of the victims' families. Read more on Sky News:Key findings from police watchdog's Hillsborough reportHillsborough families call for ex-police officer to lose knighthood 'There will be another disaster' Jenni Hicks, whose teenage daughters Sarah and Vicki died at Hillsborough, questioned why action had not been taken against those officers when police failings were first revealed by the Taylor inquiry just months after the disaster. She said: \"I can't believe, having seen the 370-odd page report, how on earth it can have taken them 13 years to write. There's very little in this report that I didn't know already. It's not, in my opinion, about telling the families anything.\" In September, the government introduced the so-called Hillsborough Law to the House of Commons. It will include a duty of candour, forcing public officials to act with honesty and integrity at all times or face criminal sanctions. But Louise Brookes, whose brother Andrew Mark Brookes died at Hillsborough, dismissed both the IOPC report and the new law. \"Nothing will ever change. There will be another cover-up, there will be another disaster, and until things change at the very top, and I include MPs, chief constables, CEOs of organisations, until they're the ones who stop protecting and covering up for themselves, nothing will ever change.\" 'Bitter injustice' Nicola Brook, a solicitor at Broudie Jackson Canter acting for several bereaved families, said it was a \"bitter injustice\" that no one would be held to account. She said: \"This outcome may vindicate the bereaved families and survivors who have fought for decades to expose the truth - but it delivers no justice. Instead, it exposes a system that has allowed officers to simply walk away, retiring without scrutiny, sanction or consequence for failing to meet the standards the public has every right to expect. \"Yes, the law has now changed so this loophole cannot be used in future. But for those affected by this case, that is no consolation. \"They are left with yet another bitter injustice: the truth finally acknowledged, but accountability denied.\" In her statement, published with the IOPC report, Ms Cashell said: \"As I have expressed to those closely affected, this process has taken too long - those who campaigned for so many years deserve better. \"If a legal duty of candour had existed in 1989, it could have helped ensure that all relevant evidence was shared fully and promptly. The families of those who were unlawfully killed would have experienced a far less traumatic fight for answers about what happened to their loved ones. Had that duty existed, our investigations may not have been necessary at all.\" What has been the reaction to the report? Charlotte Hennessy, whose father James was among the 97 killed in the tragedy, said Liverpool fans were \"wrongfully blamed by the people who should have protected them\" on the day of the disaster. Steve Kelly, whose brother was killed at Hillsborough, said the Public Office (Accountability) Bill will ensure people will not go unpunished if a similar tragedy occurs. Also known as the Hillsborough Law, the bill is intended to make sure authorities will face criminal sanctions if they attempt to cover up the facts behind disasters. \"No one should be beaten by the passage of time,\" Mr Kelly said. \"We should have truth, justice and accountability within at least in that person's lifetime. It can't happen again.\" Sue Roberts, secretary of the Hillsborough Family Support Group, lost her brother in the tragedy. During a press conference on Tuesday afternoon, she was asked if she was upset that the police officers named in the report would not face any punishment for their roles in the disaster. \"It's very frustrating,\" she said. \"But at least they've been named now, so their families can feel the shame of what went on.\" 'Deep regret and shame' Home Secretary Shabana Mahmood has called the Hillsborough disaster a \"stain on our nation's history\". She said today \"serves as a stark reminder of one of the most significant failings in policing the country has ever seen\". Following the publication of Tuesday's report, South Yorkshire Police Chief Constable Lauren Poultney said its findings will \"always be a point of deep regret and shame\" for the force. She said: \"There is nothing I can say today which can take away the years of pain and hurt caused by the force I now lead. \"On behalf of South Yorkshire Police, I fully accept the IOPC report which highlights a litany of failures and am so deeply sorry for the pain and heartache caused. \"The report is clear in that people attended a football match in Sheffield and therefore, they were in our care. The force failed them and also failed their loved ones in the days, months and years after. \"This will always be a point of deep regret and shame for South Yorkshire Police. Those who lost their lives will always be in my thoughts.\""
    },
    {
        "title": "Girl, 16, who died in minibus crash in Tadcaster named",
        "description": "A 16-year-old girl who died in a crash involving a minibus carrying a group of teenagers has been named.",
        "url": "https://news.sky.com/story/girl-16-who-died-in-minibus-crash-in-tadcaster-named-13478263",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-eleanor-hague-tadcaster_7098890.png?20251202200540",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-02 12:07:00",
        "Headline": "The driver of a Hyundai car involved in the collision has been arrested on suspicion of causing death by dangerous driving. ",
        "Content": "A 16-year-old girl who died in a crash involving a minibus carrying a group of teenagers has been named. Eleanor Hague - known as Ellie - died at the scene of the crash in Tadcaster, North Yorkshire, on Monday. The teenager, from Sherburn in Elmet, was a sixth-form student at Tadcaster Grammar School. She was a passenger in the white Mercedes Sprinter minibus that was in a collision with a light-coloured Hyundai i10 car at 12.28pm. The minibus was carrying nine passengers aged 16 to 18, who were from Tadcaster Grammar School and Sherburn High School, which have a shared sixth form. Another teenage girl was taken to hospital by ambulance with serious injuries that are not believed to be life-threatening. The other passengers and the man driving the minibus have received treatment at hospital for minor injuries. \n                  The Wargame: Inside the decades-long saga that's left UK shockingly unprepared for war\n                 \n                  'Death, prison or the loss of your sanity': A decade of county lines leaves its scars on children\n                 \n                  Rachel Reeves hit by Labour rural rebellion over inheritance tax on farmers\n                 The driver of the Hyundai, a 40-year-old woman from Leeds, was arrested on suspicion of causing death by dangerous driving and causing serious injury by dangerous driving. She has been released on conditional bail. 'Unimaginable tragedy' Tadcaster Grammar School described the incident as an \"unimaginable tragedy\". \"We are deeply saddened by the incident that occurred yesterday which involved the tragic loss of one of our students,\" the school said in a statement on social media on Tuesday, \"Our heartfelt thoughts are with everyone affected by this unimaginable tragedy. We are totally committed to providing every member of our school community with unwavering support and empathy as we come together as one. \"Appropriate support will be available on site tomorrow, with school open to all students and staff.\" Read more from Sky News:Holly Willoughby fined by courtHillsborough families hit out at reportSarah Everard's mother 'tormented' North Yorkshire Police is continuing to appeal for any witnesses or motorists with relevant dashcam footage. The force said the collision took place \"on Toulston Lane at the junction with Rudgate\". \"The minibus was heading towards Sherburn and the car entered Toulston Lane from Rudgate,\" a police statement added."
    },
    {
        "title": "Ukraine war: No breakthrough in Russia-US talks - after Putin tells Ukraine's allies he's ready for war",
        "description": "Talks between US negotiators and Vladimir Putin about Ukraine were \"productive\" but there was no breakthrough, according to Russian officials.",
        "url": "https://news.sky.com/story/if-europe-wants-to-fight-a-war-we-are-ready-now-says-putin-13478316",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-vladimir-putin-steve-witkoff_7098730.jpg?20251202172647",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-02 14:01:00",
        "Headline": "Vladimir Putin struck a defiant tone earlier on Tuesday when he warned Russia was \"ready right now\" if Europe wanted a war. ",
        "Content": " Talks between US negotiators and Vladimir Putin about Ukraine were \"productive\" but there was no breakthrough, according to Russian officials. Donald Trump sent special envoy Steve Witkoff and his own son-in-law, Jared Kushner, to Tuesday's summit in Moscow. They were pictured in Red Square prior to the summit and Mr Witkoff later told a smiling Mr Putin that Moscow was a \"magnificent city\". Shortly before the summit, the Russian president warned his country was ready to fight if Europe wanted a war. Analysis: Why Putin won't agree to latest peace plan Russian foreign policy aide Yuri Ushakov and investment envoy Kirill Dmitriev were involved in the talks, which lasted over five fours and ended after midnight. Both sides agreed not to disclose precise details, but in a one-word social media post, Mr Dmitriev described the meeting as \"productive\". Mr Ushakov called it \"rather useful, constructive\" and asked whether peace was closer or further, he commented: \"Not further, that's for sure\". However, he said a compromise hadn't been reached on the issue of territories and that the Kremlin sees \"no resolution to the crisis\" without one. Russia wants the whole of the Donbas region - even the parts it does not hold - but Ukraine has balked at the prospect. Mr Ushakov said there was \"still a lot of work to be done, both in Washington and in Moscow\" and that \"contacts will continue\". The meeting took place after an initial 28-point US peace plan was leaked and alarmed European officials, who said it heavily favoured Russia. An \"updated and refined peace framework\" was formulated after talks between Europe, the US, and Ukraine in Geneva last month, but Mr Putin has indicated he will not accept it. Putin: Europe on the side of war Earlier on Tuesday, Mr Putin said Russia was ready to fight if Europe wanted a war. The Russian president accused European powers of changing peace proposals for Ukraine with \"demands\" that Russia considered \"absolutely unacceptable\". Mr Putin said the Europeans were \"on the side of war\".  \"We're not planning to go to war with Europe, I've said that a hundred times,\" he said following an investment forum. \"But if Europe suddenly wants to fight us and starts, we're ready right now. There can be no doubt about that.\" \"If Europe suddenly wants to start a war with us and does, then a situation could very quickly arise in which we have no one to negotiate with,\" he added.  Zelenskyy in Dublin Ukraine's President Volodymyr Zelenskyy was in Dublin on Tuesday to meet Ireland's prime minister and president. During the trip, Mr Zelenskyy said he was ready to meet Mr Trump again, but it would depend on how successful the Moscow talks were. He said the chances of ending the war were \"better now than ever\" but warned there would be \"no easy decisions\" and there must be \"no games behind Ukraine's back\". Calling it \"one of the most challenging but optimistic moments\" since Russia invaded in 2022, he said the US was \"taking serious steps to end this war one way or another\". He admitted \"some things still need to be worked out\" and said a \"decent, dignified peace\" was needed. Read more:How history could view Trump as 'biggest useful idiot'Hotspots: Reality of life on frontline of journalism The Irish government announced €100m (£88m) in non-lethal aid for Ukraine, \"generosity\" for which Mr Zelenskyy said Ukraine was grateful. It brings the total in non-lethal military aid provided to Ukraine this year to €200m (£176m). The funding is part of a new Ireland-Ukraine partnership, which builds on an agreement signed last year. It includes €25m (£22m) for the restoration and protection of energy infrastructure and a scheme to support training and other efforts as part of Ukraine's path to EU accession, which Mr Zelenskyy said he hoped to achieve within five years."
    },
    {
        "title": "Why Putin won't agree to latest Ukraine peace plan",
        "description": "The Americans were given the full VIP treatment on their visit to Moscow.&#160;",
        "url": "https://news.sky.com/story/once-again-the-us-defaults-to-a-position-that-favours-moscow-and-latest-putin-talks-show-how-13478589",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-putin-witkoff_7099197.jpg?20251203000124",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-12-02 23:44:00",
        "Headline": "There's no sign of a breakthrough in Ukraine peace talks after a lengthy meeting between Vladimir Putin and a delegation sent by Donald Trump. And there are two major reasons why the Russian president won't budge.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  The Americans were given the full VIP treatment on their visit to Moscow.  There was a motorcade from the airport, lunch at a Michelin-starred restaurant, and even a stroll around Red Square. It felt like Steve Witkoff and Jared Kushner were on more of a tourist trail than the path to peace.  They finally got down to business in the Kremlin more than six hours after arriving in Russia. And by that point, it was already clear that the one thing they had come to Moscow for wasn't on offer: Russia's agreement to their latest peace plan. According to Vladimir Putin, it's all Europe's fault. While his guests were having lunch, he was busy accusing Ukraine's allies of blocking the peace process by imposing demands that are unacceptable to Russia. The Europeans, of course, would say it's the other way round. But where there was hostility to Europe, only hospitality to the Americans - part of Russia's strategy to distance the US from its NATO allies, and bring them back to Moscow's side. Putin thinks he's winning… Russia wants to return to the 28-point plan that caved in to its demands. And it believes it has the right to because of what's happening on the battlefield. It's no coincidence that on the eve of the US delegation's visit to Moscow, Russia announced the apparent capture of Pokrovsk, a key strategic target in the Donetsk region. It was a message designed to assert Russian dominance, and by extension, reinforce its demands rather than dilute them. Read more:Michael Clarke answers your Ukraine war questions'Thousands' of Westerners applying to live in Russia  …and believes US-Russian interests are aligned The other reason I think Vladimir Putin doesn't feel the need to compromise is because he believes Moscow and Washington want the same thing: closer US-Russia relations, which can only come after the war is over. It's easy to see why. Time and again in this process, the US has defaulted to a position that favours Moscow. The way these negotiations are being conducted is merely the latest example. With Kyiv, the Americans force the Ukrainians to come to them - first in Geneva, then Florida. As for Moscow, it's the other way around. Witkoff is happy to make the long overnight journey, and then endure the long wait ahead of any audience with Putin. It all gives the impression that when it comes to Russia, the US prefers to placate rather than pressure. According to the Kremlin, both Russia and the US have agreed not to disclose the details of yesterday's talks in Moscow. I doubt Volodymyr Zelenskyy is filled with hope."
    },
    {
        "title": "Hegseth cites 'fog of war' in defence of second US strike on alleged drug boat",
        "description": "US defence secretary Pete Hegseth has cited the \"fog of war\" in defence of a follow-up strike earlier this year on a boat alleged to be carrying drugs in the Caribbean Sea.",
        "url": "https://news.sky.com/story/pope-leo-urges-donald-trump-not-to-try-to-oust-venezuelan-president-by-force-13478264",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-defence-secretary-pete-hegseth_7098888.jpg?20251202200519",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-02 12:09:00",
        "Headline": "American defence secretary's comments come as Pope urges Donald Trump not to try to oust Venezuelan President Nicolas Maduro using military force.",
        "Content": "US defence secretary Pete Hegseth has cited the \"fog of war\" in defence of a follow-up strike earlier this year on a boat alleged to be carrying drugs in the Caribbean Sea. His comments came on the day the Pope urged Donald Trump not to try to oust Venezuelan President Nicolas Maduro using military force. Speaking at a cabinet meeting on Tuesday alongside Mr Trump, Mr Hegseth said the US had paused strikes because it was hard to find drug boats. But strikes against drug traffickers would continue, he said. During the cabinet meeting at the White House, Mr Hegseth said that he did not see that there were survivors in the water when the second strike was ordered and launched in early September, saying that \"the thing was on fire\". Mr Hegseth also said he \"didn't stick around\" for the rest of the mission following the first strike, adding that the admiral in charge had \"made the right call\" in ordering it, which he \"had complete authority to do\". The Washington Post first reported that Mr Hegseth issued a verbal order for the second strike that killed survivors on the boat. On Monday, the White House said that Navy vice admiral Frank \"Mitch\" Bradley acted \"within his authority and the law\" when he ordered the second strike.  Asked if he supported the second strike on a boat in the Caribbean Sea in September, President Trump said he \"didn't know anything\" and \"still haven't gotten a lot of information because I rely on Pete\", referencing Mr Hegseth. On Tuesday, Pope Leo, the first American pontiff, said it would be better to attempt dialogue or impose economic pressure on Venezuela if Washington wanted to pursue change there. Read more from Sky News: Government delays Chinese 'super embassy' decisionImran Khan healthy but isolated in jail, his sister says The Trump administration has been weighing options to combat what it has portrayed as Mr Maduro's role in supplying illegal drugs that have killed Americans. The socialist Venezuelan president has denied having any links to the illegal drug trade. Asked during a news conference about President Trump's threats to remove Mr Maduro by force, the Pope said: \"It is better to search for ways of dialogue, or perhaps pressure, including economic pressure.\" He added that Washington should search for other ways to achieve change \"if that is what they want to do in the United States\". The Pope was speaking as he flew home from visiting Turkey and Lebanon - his first overseas trip in the role. Mr Maduro has said Venezuelans are ready to defend their country as the US considers a land attack. The president held a rally in Caracas amid heightened tensions with Mr Trump's administration, which has been targeting what it says are boats carrying drug smugglers. Mr Trump met his national security team on Monday evening, having warned last week that land strikes would start \"very soon\". It has not been confirmed what was discussed at the meeting. But White House press secretary Karoline Leavitt told reporters: \"There's many options at the president's disposal that are on the table - and I'll let him speak on those.\" US forces have carried out at least 21 strikes on boats it claims were carrying narcotics to its shores over the last few months.  Mr Maduro - considered a dictator by many in the West - said on Monday that Venezuelans were ready \"to defend [the country] and lead it to the path of peace\". \"We have lived through 22 weeks of aggression that can only be described as psychological terrorism,\" he said. Venezuela has said the boat attacks, which have killed more than 80 people, amount to murder - and that Mr Trump's true motivation is to oust Mr Maduro and access its oil."
    },
    {
        "title": "Former Pakistan PM Imran Khan healthy but isolated in jail, his sister says",
        "description": "Imran Khan is suffering from isolation after weeks of being denied access to relatives, his family have said. ",
        "url": "https://news.sky.com/story/former-pakistan-pm-imran-khan-healthy-but-isolated-in-jail-his-sister-says-13478344",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-khan-pakistan_7098580.jpg?20251202151320",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-02 14:52:00",
        "Headline": "Imran Khan has been in jail since 2023 on corruption charges. The 73-year-old says the charges against him are politically motivated.",
        "Content": " Imran Khan is suffering from isolation after weeks of being denied access to relatives, his family have said.  Khan has been in jail since his August 2023 arrest after he was handed a three-year prison term for illegally selling state gifts. Now two of his three sisters have spoken out about the former Pakistani prime minister's plight. Uzma Khanum was the only family member permitted to meet him in Adiala jail, Rawalpindi, where supporters of his Pakistan Tehreek-e-Insaf (PTI) party had gathered to protest against the conditions of the 73-year-old's detention. Ms Khanum said that Khan, a former cricketer, is facing isolation and psychological strain in prison following weeks in which his family said access had been blocked. \"He's physically well,\" said Ms Khanum. \"But he's kept inside all the time, and only goes out for a short while. There's no contact with anybody.\" The meeting took place under strict supervision, said Ms Khanum, though she declined to provide further details. \n                  Ukraine war: No breakthrough in Russia-US talks - after Putin tells Ukraine's allies he's ready for war\n                 \n                  Why Putin won't agree to latest Ukraine peace plan\n                 \n                  Hegseth cites 'fog of war' in defence of second US strike on alleged drug boat\n                 PTI says routine prison visits have been blocked for weeks despite court orders, fuelling rumours about his condition and possible prison transfers. 'Suppressing the people' One of Khan's other sisters Aleema Khan told The World with Yalda Hakim that she believes Pakistani authorities were isolating him as an attempt to \"suppress the people of Pakistan\". \"I think they are operating out of fear. He represents 90% of this country. How can you put a person who represents 90% of the country in jail? \"They basically want to suppress the people of Pakistan. They don't want their voice to be heard and they are standing behind Imran Khan. They thought if they isolated [him] people will forget him.\" Authorities deny any mistreatment, and say that Khan is receiving all entitlements available to prisoners. Ahmed Hassan Al-Arabi, an advisor to Pakistan's Ministry of Information, told Sky News: \"The jails are there as a punishment. They are there for the criminals to stop the evil from the criminals emanating into the society. \"If it has to become a political hub, there is no point of jail. Imran Khan's sisters have been given access [to him]. \"There is no distinction between politicians and Imran Khan's family members, unfortunately\". Read more from Sky News:More than 1,200 confirmed dead in Asia floodsEl Chapo's son pleads guilty to drug charges Khan served as prime minister from 2018 to 2022. He has claimed that the charges against him are politically motivated - and aimed at blocking his political career. Khan's wife, Bushra Bibi, is serving time in the same prison over corruption, but they are not allowed to see each other except when they appear in court, his supporters have said."
    },
    {
        "title": "Families count the cost of devastating Sri Lanka floods",
        "description": "On the outskirts of Colombo, Sri Lanka's capital, Asiri is trying to dry out his home.",
        "url": "https://news.sky.com/story/families-count-the-cost-of-devastating-sri-lanka-floods-13478440",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-flood-sri-lanka-lynch_7098855.png?20251202194221",
        "type": "World",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-12-02 19:09:00",
        "Headline": "India and Pakistan have sent helicopters and cargo planes to help - but the hard work will start with repair and there's a lot to be done here, physically and emotionally.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  On the outskirts of Colombo, Sri Lanka's capital, Asiri is trying to dry out his home. He's just spent five days upstairs trying to escape the rising flood waters. By finding some elevation, he's been able to protect his family. But, downstairs, he's confronted with the scale of the damage in the place he calls home. \"The water was right up to here,\" he tells us, as he points to a water mark about two and a half feet up the wall. There was \"no power, no water - it all broke\", he says.   Cyclone Ditwah has already claimed the lives of more than 400 people in Sri Lanka and hundreds are still missing. This island nation has dealt with a multitude of tragedies - a tsunami in 2004 that killed around 35,000 people and more recently an economic collapse. \n                  More than 1,300 confirmed dead and 800 missing in catastrophic Asia floods\n                 \n                  More than 600 dead in Indonesia and Thailand after floods and landslides - and Sri Lanka reporting more than 200 deaths from cyclone\n                 \n                  Fifteen people killed after bus crashes off 1,000ft cliff in Sri Lanka\n                 This latest challenge is one of the worst natural disasters in its history. Sunil, Asiri's uncle, tells me he had to improvise to help his brother survive. He shows us a video of his sibling on a makeshift wooden raft he made attached to an inflatable ring. It allowed them to take him to hospital and it's the kind of desperate dynamic playing out across the country. Unlike the tsunami, this didn't just hit coastal areas. It hugely hammered the city and mountainous regions too. Some have been critical of the government response, claiming it was slow to call an emergency and slow to deliver aid and rescue stranded people. Read more from Sky News:Pope urges Trump not to oust Venezuela leader by forceUK delays Chinese 'super embassy' decision  India and Pakistan have now sent helicopters and cargo planes to help - but the hard work will start with repair and there's a lot to be done here, physically and emotionally. Bodies are still being pulled from landslides in the popular tourist destination of Kandi. Sri Lanka joins the list of Asian nations wrestling with the sharp end of an intense cordon of typhoons, cyclones and storms this monsoon season. Each year I've been living in this region, it appears to intensify, presenting a challenge few governments seem to be able to meet."
    },
    {
        "title": "Spirit animal: Raccoon gets drunk as a skunk in a booze store - and sleeps off hangover in the toilet ",
        "description": "A raccoon has gotten as drunk as a skunk.",
        "url": "https://news.sky.com/story/spirit-animal-raccoon-gets-drunk-as-a-skunk-in-a-booze-store-and-sleeps-off-hangover-in-the-toilet-13478586",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-raccoon-california_7099187.jpg?20251202232615",
        "type": "World",
        "Author": "Connor Sephton",
        "Date Published": "2025-12-02 23:12:00",
        "Headline": "Officials say the raccoon was taken into custody and allowed to sleep for a few hours before being released into the wild - presumably with a headache.",
        "Content": "\n          News reporter\n              @ConnorSephton\n A raccoon has gotten as drunk as a skunk. On a wild Friday night, the trash panda broke into a liquor store in Virginia - and began helping themselves to the stock. The following morning, an officer was asked to investigate reports of a break-in… and wasn't prepared for what happened next. She was greeted by a soaked aisle that reeked of booze and was littered with smashed bottles. Spirits were the tipple of choice - this wasn't a wine racc. Officer Martin's inquiries soon took her to the bathroom, where she discovered the raucous raccoon sleeping it off in between a toilet and a bin. The sozzled suspect was rumbled and described as \"very intoxicated\" by Hanover County Animal Protection and Shelter. \n                  The night Democrats fought back against Trump\n                 \n                  Letitia James indicted for fraud after Donald Trump demanded case against New York attorney general\n                 \n                  Virginia man dies after bear shot by fellow hunter falls on top of him from tree\n                 Read more like this:Judge wears Elvis wig in courtDie Hard's Christmas credentials questioned A Facebook statement said: \"Officer Martin safely secured our masked bandit and transported him back to the shelter to sober up before questioning. \"After a few hours of sleep and zero signs of injury (other than maybe a hangover and poor life choices), he was safely released back to the wild, hopefully having learned that breaking and entering is not the answer.\" The spirit animal has now been barred - and unfortunately, there's no CCTV footage of him getting completely pawless. Why? Because he entered the building through the ceiling… and took the camera down with him. The store has thanked Officer Martin for \"providing our visitor with a sober ride home\" after he racked up a substantial bill."
    },
    {
        "title": "Mortuary workers exposed to 'dangerously high' levels of toxin from Air India crash bodies, says report",
        "description": "Mortuary workers were exposed to \"dangerously high\" levels of toxic substances from preserved bodies repatriated to the UK following the Air India plane crash, a coroner's report has revealed.",
        "url": "https://news.sky.com/story/mortuary-workers-exposed-to-dangerously-high-levels-of-toxin-from-air-india-crash-bodies-says-report-13478416",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-air-india-wreckage_6940236.jpg?20250612144923",
        "type": "World",
        "Author": "Gemma Peplow, news reporter",
        "Date Published": "2025-12-02 17:35:00",
        "Headline": "It became apparent there was \"a significant chemical hazard\" when mortuary workers were opening coffins repatriated from India, a coroner has said.",
        "Content": "By Gemma Peplow, news reporter  Mortuary workers were exposed to \"dangerously high\" levels of toxic substances from preserved bodies repatriated to the UK following the Air India plane crash, a coroner's report has revealed. Air India Flight 171 to London Gatwick struck a building shortly after take-off in Ahmedabad in June, killing 241 people on board and a further 19 on the ground. Fifty-three British nationals were among those who died in the crash - which was survived by just one passenger.  A coroner's report, released ahead of inquests taking place, said bodies repatriated to Westminster Public Mortuary, in London, had been wrapped and saturated in high concentrations of formalin, and laid in lined coffins. Formalin contains formaldehyde and is commonly used to preserve human remains, especially for repatriations from abroad. However, it \"became apparent that many of the mortuary users appeared unaware and were surprised by the nature of the danger\", the coroner said. The substance has toxic effects at high levels and can cause severe respiratory irritation. There is also evidence long-term exposure can cause cancer, according to the UK Health Security Agency. Dangerous levels of carbon monoxide and cyanide were also recorded in the mortuary, the coroner's report said. There is nothing in the report, known as a prevention of future deaths report, that says workers have been ill. It is also not clear who was responsible for the levels of formalin used. However, senior coroner Fiona J Wilcox, for inner west London, said mortuaries needed to be better prepared and equipped. \"There is an under appreciation across mortuaries of the dangers posed by formalin to the health of all mortuary users,\" she said. Mortuaries frequently receive bodies preserved in formalin, she continued, but it is \"not routinely monitored\". This means appropriate equipment \"may not be available nor used when mortuaries handle bodies significantly contaminated with formalin, thus exposing users of mortuaries to health risks including risk of death\", the coroner added. After the Air India repatriation, it became apparent there was \"a significant chemical hazard\" when mortuary workers were opening coffins, the coroner said. \"It is apparently not usual for environmental monitoring to be routinely available in either public or hospital mortuaries.\" The coroner found levels of formalin \"were found to be dangerously high\", at \"apparently 40%\". \"With heat and light exposure it breaks down releasing carbon monoxide which is highly toxic,\" she wrote in the report. \"If it mixes with a source of ammonia (commonly seen with decomposition), cyanide which is also highly toxic can be released.\" Sky News science correspondent Thomas Moore says it is fairly standard for repatriated bodies to be embalmed with formalin, and for some countries it is a legal requirement for infection control. \"But a concentration of '40%' would be unusually high, as far as I can tell,\" he said. \"Formalin is a 37% solution of formaldehyde and is carcinogenic with prolonged exposure. But it's normally diluted before embalming, so the tissue concentration would be a lot lower.\" Read more from Sky News:Pope urges Trump not to try to oust Venezuelan leader by forceGovernment delays Chinese 'super embassy' decision Both carbon monoxide and cyanide were also detected in the mortuary \"at dangerous levels following opening of the coffins and unwrapping of the bodies of the deceased persons\", the report said. The report has been sent to the Department of Health and Social Care, and Ministry of Housing, Communities and Local Government, with the coroner saying action should be taken to prevent potential deaths in the future. They have 56 days to respond. A government spokesperson said: \"Our deepest sympathies are with the families of all those who died in this tragic crash. \"This is a deeply shocking case. We respond to, and learn from, all prevention of future death reports and will consider this fully before formally responding.\""
    },
    {
        "title": "FIFA backs away from dynamic pricing for all World Cup 2026 tickets",
        "description": "FIFA has backed away from using dynamic pricing for all 2026 World Cup tickets amid concerns about the cost of attending the tournament in North America.",
        "url": "https://news.sky.com/story/fifa-backs-away-from-dynamic-pricing-for-all-world-cup-2026-tickets-13478483",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-world-cup-2026-ball_7085120.jpg?20251118150632",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-12-02 20:41:00",
        "Headline": "Fluctuating pricing at a World Cup is a first but FIFA says there'll still be some fixed-price options in \"specific fan categories\".",
        "Content": "\n          Sports correspondent\n              @RobHarris\n FIFA has backed away from using dynamic pricing for all 2026 World Cup tickets amid concerns about the cost of attending the tournament in North America. The organisers insisted they always planned to ring-fence tickets at set prices to follow your own team. But the announcement comes ahead of Friday's tournament draw in Washington DC that President Trump plans to attend. Fans will have to wait until Saturday to know exactly where and when their teams will be playing in next summer's tournament. Variable pricing - fluctuating based on demand - has never been used at a World Cup before, raising concerns about affordability being mostly played in the United States. England and Scotland fans have been sharing images in recent days of ticket website images highlighting cost worries. But world football's governing body said in a statement to Sky News: \"FIFA can confirm ringfenced allocations are being set aside for specific fan categories, as has been the case at previous FIFA World Cups. These allocations will be set at a fixed price for the duration of the next ticket sales phase. \n                  Trump unveils FIFA PASS scheme to give priority visa appointment access to World Cup fans\n                 \n                  UEFA should decide if Israeli teams should be banned, FIFA VP tells Sky News\n                 \n                  Trump threatens to move World Cup games from 'unsafe' host cities\n                 \"The ringfenced allocations include tickets reserved for supporters of the Participating Member Associations (PMAs), who will be allocated 8% of the tickets for each match in which they take part, including all conditional knockout stage matches.\" FIFA says the cheapest tickets are from $60 (£45) in the group stage. But the most expensive tickets for the final are $6,730 (£5,094). There will also be a sales window after the draw from 11 December to 13 January when ticket applications will be based on a fixed price for those buying in the random selection draw. It is the biggest World Cup with 104 matches after the event was expanded from 32 to 48 teams. There are also three host nations for the first time - with Canada and Mexico the junior partners. Read more from Sky News:Pope urges Trump not to oust Venezuelan president by forceGovernment delays Chinese 'super embassy' decision FIFA defended using fluctuating pricing. \"The pricing model adopted for FIFA World Cup 26 reflects the existing market practice for major entertainment and sporting events within our hosts on a daily basis, soccer included,\" FIFA's statement continued. \"This is also a reflection of the treatment of the secondary market for tickets, which has a distinct legal treatment than in many other parts of the world. We are focused on ensuring fair access to our game for existing but also prospective fans.\" The statement addressed the concerns being raised about fans being priced out of attending. FIFA said: \"Stadium category maps do not reflect the number of tickets available in a given category but rather present default seating locations. \"FIFA resale fees are aligned with North American industry trends across various sports and entertainment sectors.\" Ireland, Northern Ireland and Wales could also still qualify."
    },
    {
        "title": "Government delays Chinese 'super embassy' decision",
        "description": "The UK government has again delayed its decision over whether to approve a Chinese \"super embassy\" in London until January.",
        "url": "https://news.sky.com/story/government-delays-chinese-super-embassy-decision-again-13478365",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-china-embassy_7050654.jpg?20251014113348",
        "type": "World",
        "Author": "Alix Culbertson",
        "Date Published": "2025-12-02 15:55:00",
        "Headline": "There have been large-scale protests against the embassy over fears it will become a European spy hub for China.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The UK government has again delayed its decision over whether to approve a Chinese \"super embassy\" in London until January. A decision over the controversial plan close to the Tower of London will now take place on 20 January, instead of 10 December, a letter from the planning inspectorate seen by Sky News says. A spokesperson for the embassy condemned the postponement, adding: \"We strongly urge the UK side to approve our planning application quickly to avoid further undermining the mutual trust and cooperation between the two sides.\" Despite multiple delays, Sky News understands the government is expected to approve the plans for what would be Europe's largest embassy, with both MI5 and MI6 said to have given their blessing to the decision. Housing Secretary Steve Reed has said he needs more time to consider new representations from the Foreign Office and Home Office. A letter from the home and foreign secretaries to the planning inspectorate, published with the latest delay letter, said their national security concerns have been addressed by the Chinese government committing to ensure all its diplomatic premises in London, excluding the ambassador's house, are consolidated on to the new embassy site. The new letter sent to ministers and \"interested parties\", including the Inter Parliamentary Alliance on China (IPAC) - which has warned against approving the embassy - said the government aims \"to issue the decision as quickly as possible\" on or before 20 January. \n                  PM issues China warning - and hits out at Brexit\n                 \n                  Death toll rises to 146 in Hong Kong apartment complex fire as more bodies found in burned buildings\n                 \n                  Almost 280 people missing as huge fire engulfs Hong Kong flats - dozens confirmed dead\n                 Luke de Pulford, executive director of IPAC, told Sky News: \"This is the third delay, and entirely of the government's own making. \"Residents and dissidents have endured months of dithering as the government tries to choose between UK national security and upsetting Beijing.\" Three delays by Labour government Mr Reed became housing secretary in September and had already delayed the decision once from October, as he said he had not had enough time to look at the details. A decision had also been delayed earlier this year by the former housing secretary Angela Rayner, months after the Chinese re-submitted their planning application two weeks after Labour won the general election. That was after Tower Hamlets Council rejected the application in 2022 and the Conservative government said it would not call it in for ministers to decide. Read more:Everything we know about China's new 'super embassy' National security concerns There have been large-scale protests against the embassy - on the site of the former Royal Mint - over concerns it will be used as a Chinese spy hub for Europe. Hong Kong dissidents who have fled to the UK have expressed fears that rooms redacted \"for security reasons\" in submitted plans might be used to detain them. The latest delay comes less than 24 hours after Sir Keir Starmer warned China poses \"real national security threats to the United Kingdom\" and said being tough on national security will enable the UK to pursue economic opportunities with Beijing. He said UK government policy towards China cannot continue to blow \"hot and cold\" and said his government will focus on the relationship with Beijing.  Chinese embassy says UK interfering in its affairs A Chinese embassy spokesman in London said China \"firmly opposes the erroneous remarks\" and accused Sir Keir of making \"groundless accusations against China\" and interfering in China's internal affairs. \"Facts have fully demonstrated that China has always been a builder of world peace, a contributor to global development, and a defender of the international order,\" he said. Last month, MI5 warned MPs, peers and parliamentary staff about the risk from Chinese spies after identifying two LinkedIn profiles it said are being used by the Chinese Ministry of State Security to act as \"civilian recruitment headhunters\"."
    },
    {
        "title": "Ukraine war: No breakthrough in Russia-US talks - after Putin tells Ukraine's allies he's ready for war",
        "description": "Talks between US negotiators and Vladimir Putin about Ukraine were \"productive\" but there was no breakthrough, according to Russian officials.",
        "url": "https://news.sky.com/story/if-europe-wants-to-fight-a-war-we-are-ready-now-says-putin-13478316",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-vladimir-putin-steve-witkoff_7098730.jpg?20251202172647",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-02 14:01:00",
        "Headline": "Vladimir Putin struck a defiant tone earlier on Tuesday when he warned Russia was \"ready right now\" if Europe wanted a war. ",
        "Content": " Talks between US negotiators and Vladimir Putin about Ukraine were \"productive\" but there was no breakthrough, according to Russian officials. Donald Trump sent special envoy Steve Witkoff and his own son-in-law, Jared Kushner, to Tuesday's summit in Moscow. They were pictured in Red Square prior to the summit and Mr Witkoff later told a smiling Mr Putin that Moscow was a \"magnificent city\". Shortly before the summit, the Russian president warned his country was ready to fight if Europe wanted a war. Analysis: Why Putin won't agree to latest peace plan Russian foreign policy aide Yuri Ushakov and investment envoy Kirill Dmitriev were involved in the talks, which lasted over five fours and ended after midnight. Both sides agreed not to disclose precise details, but in a one-word social media post, Mr Dmitriev described the meeting as \"productive\". Mr Ushakov called it \"rather useful, constructive\" and asked whether peace was closer or further, he commented: \"Not further, that's for sure\". However, he said a compromise hadn't been reached on the issue of territories and that the Kremlin sees \"no resolution to the crisis\" without one. Russia wants the whole of the Donbas region - even the parts it does not hold - but Ukraine has balked at the prospect. Mr Ushakov said there was \"still a lot of work to be done, both in Washington and in Moscow\" and that \"contacts will continue\". The meeting took place after an initial 28-point US peace plan was leaked and alarmed European officials, who said it heavily favoured Russia. An \"updated and refined peace framework\" was formulated after talks between Europe, the US, and Ukraine in Geneva last month, but Mr Putin has indicated he will not accept it. Putin: Europe on the side of war Earlier on Tuesday, Mr Putin said Russia was ready to fight if Europe wanted a war. The Russian president accused European powers of changing peace proposals for Ukraine with \"demands\" that Russia considered \"absolutely unacceptable\". Mr Putin said the Europeans were \"on the side of war\".  \"We're not planning to go to war with Europe, I've said that a hundred times,\" he said following an investment forum. \"But if Europe suddenly wants to fight us and starts, we're ready right now. There can be no doubt about that.\" \"If Europe suddenly wants to start a war with us and does, then a situation could very quickly arise in which we have no one to negotiate with,\" he added.  Zelenskyy in Dublin Ukraine's President Volodymyr Zelenskyy was in Dublin on Tuesday to meet Ireland's prime minister and president. During the trip, Mr Zelenskyy said he was ready to meet Mr Trump again, but it would depend on how successful the Moscow talks were. He said the chances of ending the war were \"better now than ever\" but warned there would be \"no easy decisions\" and there must be \"no games behind Ukraine's back\". Calling it \"one of the most challenging but optimistic moments\" since Russia invaded in 2022, he said the US was \"taking serious steps to end this war one way or another\". He admitted \"some things still need to be worked out\" and said a \"decent, dignified peace\" was needed. Read more:How history could view Trump as 'biggest useful idiot'Hotspots: Reality of life on frontline of journalism The Irish government announced €100m (£88m) in non-lethal aid for Ukraine, \"generosity\" for which Mr Zelenskyy said Ukraine was grateful. It brings the total in non-lethal military aid provided to Ukraine this year to €200m (£176m). The funding is part of a new Ireland-Ukraine partnership, which builds on an agreement signed last year. It includes €25m (£22m) for the restoration and protection of energy infrastructure and a scheme to support training and other efforts as part of Ukraine's path to EU accession, which Mr Zelenskyy said he hoped to achieve within five years."
    },
    {
        "title": "Why Putin won't agree to latest Ukraine peace plan",
        "description": "The Americans were given the full VIP treatment on their visit to Moscow.&#160;",
        "url": "https://news.sky.com/story/once-again-the-us-defaults-to-a-position-that-favours-moscow-and-latest-putin-talks-show-how-13478589",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-putin-witkoff_7099197.jpg?20251203000124",
        "type": "US",
        "Author": "Ivor Bennett",
        "Date Published": "2025-12-02 23:44:00",
        "Headline": "There's no sign of a breakthrough in Ukraine peace talks after a lengthy meeting between Vladimir Putin and a delegation sent by Donald Trump. And there are two major reasons why the Russian president won't budge.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  The Americans were given the full VIP treatment on their visit to Moscow.  There was a motorcade from the airport, lunch at a Michelin-starred restaurant, and even a stroll around Red Square. It felt like Steve Witkoff and Jared Kushner were on more of a tourist trail than the path to peace.  They finally got down to business in the Kremlin more than six hours after arriving in Russia. And by that point, it was already clear that the one thing they had come to Moscow for wasn't on offer: Russia's agreement to their latest peace plan. According to Vladimir Putin, it's all Europe's fault. While his guests were having lunch, he was busy accusing Ukraine's allies of blocking the peace process by imposing demands that are unacceptable to Russia. The Europeans, of course, would say it's the other way round. But where there was hostility to Europe, only hospitality to the Americans - part of Russia's strategy to distance the US from its NATO allies, and bring them back to Moscow's side. Putin thinks he's winning… Russia wants to return to the 28-point plan that caved in to its demands. And it believes it has the right to because of what's happening on the battlefield. It's no coincidence that on the eve of the US delegation's visit to Moscow, Russia announced the apparent capture of Pokrovsk, a key strategic target in the Donetsk region. It was a message designed to assert Russian dominance, and by extension, reinforce its demands rather than dilute them. Read more:Michael Clarke answers your Ukraine war questions'Thousands' of Westerners applying to live in Russia  …and believes US-Russian interests are aligned The other reason I think Vladimir Putin doesn't feel the need to compromise is because he believes Moscow and Washington want the same thing: closer US-Russia relations, which can only come after the war is over. It's easy to see why. Time and again in this process, the US has defaulted to a position that favours Moscow. The way these negotiations are being conducted is merely the latest example. With Kyiv, the Americans force the Ukrainians to come to them - first in Geneva, then Florida. As for Moscow, it's the other way around. Witkoff is happy to make the long overnight journey, and then endure the long wait ahead of any audience with Putin. It all gives the impression that when it comes to Russia, the US prefers to placate rather than pressure. According to the Kremlin, both Russia and the US have agreed not to disclose the details of yesterday's talks in Moscow. I doubt Volodymyr Zelenskyy is filled with hope."
    },
    {
        "title": "Hegseth cites 'fog of war' in defence of second US strike on alleged drug boat",
        "description": "US defence secretary Pete Hegseth has cited the \"fog of war\" in defence of a follow-up strike earlier this year on a boat alleged to be carrying drugs in the Caribbean Sea.",
        "url": "https://news.sky.com/story/pope-leo-urges-donald-trump-not-to-try-to-oust-venezuelan-president-by-force-13478264",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-defence-secretary-pete-hegseth_7098888.jpg?20251202200519",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-02 12:09:00",
        "Headline": "American defence secretary's comments come as Pope urges Donald Trump not to try to oust Venezuelan President Nicolas Maduro using military force.",
        "Content": "US defence secretary Pete Hegseth has cited the \"fog of war\" in defence of a follow-up strike earlier this year on a boat alleged to be carrying drugs in the Caribbean Sea. His comments came on the day the Pope urged Donald Trump not to try to oust Venezuelan President Nicolas Maduro using military force. Speaking at a cabinet meeting on Tuesday alongside Mr Trump, Mr Hegseth said the US had paused strikes because it was hard to find drug boats. But strikes against drug traffickers would continue, he said. During the cabinet meeting at the White House, Mr Hegseth said that he did not see that there were survivors in the water when the second strike was ordered and launched in early September, saying that \"the thing was on fire\". Mr Hegseth also said he \"didn't stick around\" for the rest of the mission following the first strike, adding that the admiral in charge had \"made the right call\" in ordering it, which he \"had complete authority to do\". The Washington Post first reported that Mr Hegseth issued a verbal order for the second strike that killed survivors on the boat. On Monday, the White House said that Navy vice admiral Frank \"Mitch\" Bradley acted \"within his authority and the law\" when he ordered the second strike.  Asked if he supported the second strike on a boat in the Caribbean Sea in September, President Trump said he \"didn't know anything\" and \"still haven't gotten a lot of information because I rely on Pete\", referencing Mr Hegseth. On Tuesday, Pope Leo, the first American pontiff, said it would be better to attempt dialogue or impose economic pressure on Venezuela if Washington wanted to pursue change there. Read more from Sky News: Government delays Chinese 'super embassy' decisionImran Khan healthy but isolated in jail, his sister says The Trump administration has been weighing options to combat what it has portrayed as Mr Maduro's role in supplying illegal drugs that have killed Americans. The socialist Venezuelan president has denied having any links to the illegal drug trade. Asked during a news conference about President Trump's threats to remove Mr Maduro by force, the Pope said: \"It is better to search for ways of dialogue, or perhaps pressure, including economic pressure.\" He added that Washington should search for other ways to achieve change \"if that is what they want to do in the United States\". The Pope was speaking as he flew home from visiting Turkey and Lebanon - his first overseas trip in the role. Mr Maduro has said Venezuelans are ready to defend their country as the US considers a land attack. The president held a rally in Caracas amid heightened tensions with Mr Trump's administration, which has been targeting what it says are boats carrying drug smugglers. Mr Trump met his national security team on Monday evening, having warned last week that land strikes would start \"very soon\". It has not been confirmed what was discussed at the meeting. But White House press secretary Karoline Leavitt told reporters: \"There's many options at the president's disposal that are on the table - and I'll let him speak on those.\" US forces have carried out at least 21 strikes on boats it claims were carrying narcotics to its shores over the last few months.  Mr Maduro - considered a dictator by many in the West - said on Monday that Venezuelans were ready \"to defend [the country] and lead it to the path of peace\". \"We have lived through 22 weeks of aggression that can only be described as psychological terrorism,\" he said. Venezuela has said the boat attacks, which have killed more than 80 people, amount to murder - and that Mr Trump's true motivation is to oust Mr Maduro and access its oil."
    },
    {
        "title": "Spirit animal: Raccoon gets drunk as a skunk in a booze store - and sleeps off hangover in the toilet ",
        "description": "A raccoon has gotten as drunk as a skunk.",
        "url": "https://news.sky.com/story/spirit-animal-raccoon-gets-drunk-as-a-skunk-in-a-booze-store-and-sleeps-off-hangover-in-the-toilet-13478586",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-raccoon-california_7099187.jpg?20251202232615",
        "type": "US",
        "Author": "Connor Sephton",
        "Date Published": "2025-12-02 23:12:00",
        "Headline": "Officials say the raccoon was taken into custody and allowed to sleep for a few hours before being released into the wild - presumably with a headache.",
        "Content": "\n          News reporter\n              @ConnorSephton\n A raccoon has gotten as drunk as a skunk. On a wild Friday night, the trash panda broke into a liquor store in Virginia - and began helping themselves to the stock. The following morning, an officer was asked to investigate reports of a break-in… and wasn't prepared for what happened next. She was greeted by a soaked aisle that reeked of booze and was littered with smashed bottles. Spirits were the tipple of choice - this wasn't a wine racc. Officer Martin's inquiries soon took her to the bathroom, where she discovered the raucous raccoon sleeping it off in between a toilet and a bin. The sozzled suspect was rumbled and described as \"very intoxicated\" by Hanover County Animal Protection and Shelter. \n                  The night Democrats fought back against Trump\n                 \n                  Letitia James indicted for fraud after Donald Trump demanded case against New York attorney general\n                 \n                  Virginia man dies after bear shot by fellow hunter falls on top of him from tree\n                 Read more like this:Judge wears Elvis wig in courtDie Hard's Christmas credentials questioned A Facebook statement said: \"Officer Martin safely secured our masked bandit and transported him back to the shelter to sober up before questioning. \"After a few hours of sleep and zero signs of injury (other than maybe a hangover and poor life choices), he was safely released back to the wild, hopefully having learned that breaking and entering is not the answer.\" The spirit animal has now been barred - and unfortunately, there's no CCTV footage of him getting completely pawless. Why? Because he entered the building through the ceiling… and took the camera down with him. The store has thanked Officer Martin for \"providing our visitor with a sober ride home\" after he racked up a substantial bill."
    },
    {
        "title": "Sabrina Carpenter hits out at 'evil and disgusting' White House video featuring her song",
        "description": "Sabrina Carpenter has hit out at an \"evil and disgusting\" White House video of migrants being detained that uses one of her songs.",
        "url": "https://news.sky.com/story/sabrina-carpenter-hits-out-at-evil-and-disgusting-white-house-video-featuring-her-song-13478430",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sabrina-carpenter-mtv-vmas_7014111.jpg?20250908073947",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-02 18:26:00",
        "Headline": "Singers Olivia Rodrigo and Jess Glynne have also attacked Mr Trump's government for using their music on anti-illegal immigration videos.",
        "Content": " Sabrina Carpenter has hit out at an \"evil and disgusting\" White House video of migrants being detained that uses one of her songs. \"Do not ever involve me or my music to benefit your inhumane agenda,\" the pop star posted on X. The White House used part of Carpenter's upbeat song Juno over pictures of immigration agents handcuffing, chasing and detaining people. It was posted on social media on Monday and has been viewed 1.2 million times so far. President Trump's policy of sending officers into communities to forcibly round up illegal immigrants has proved controversial, with protests and legal challenges ongoing. Mr Trump promised the biggest deportation in US history, but some of those detained have been living and working in the US for decades and have no criminal record. Carpenter is not the only star to express disgust over the administration's use of their music. \n                  Kendrick Lamar leads Grammy nominations as K-pop makes it mark\n                 \n                  MTV VMAs in pictures: Lady Gaga, Ariana Grande and Sabrina Carpenter triumph as tribute paid to Ozzy Osbourne\n                 \n                  Sabrina Carpenter and Charli XCX BRIT Awards appearances spark hundreds of Ofcom complaints\n                 Olivia Rodrigo last month warned the White House not to \"ever use my songs to promote your racist, hateful propaganda\" after All-American Bitch was used in a video urging undocumented migrants to leave voluntarily. Read more from Sky News:Pope urges Trump not to oust Venezuelan president by forceGovernment delays Chinese 'super embassy' decision In July, English singer Jess Glynne also said she felt \"sick\" when her song from the viral Jet2 advert was used over footage of people in handcuffs being loaded on a plane.Other artists have also previously hit out at Trump officials for using their music at political campaign events, including Guns N' Roses, Foo Fighters, Celine Dion, Ozzy Osbourne and The Rolling Stones."
    },
    {
        "title": "Bank of England warns of heightened risks but trims banks' reserve requirements",
        "description": "The Bank of England has warned of heightened risks to the UK's financial system but cut the amount of money that banks need to hold in reserve in case of shock.",
        "url": "https://news.sky.com/story/bank-of-england-warns-of-heightened-risks-but-trims-banks-reserve-requirements-13478139",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-boe-bank-of-england_7073665.jpg?20251106120726",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-12-02 05:37:00",
        "Headline": "The Bank, which had come under pressure from government to help support bank lending, trims its limit on the funds they must hold in reserve while also warning of greater risks in the financial system.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The Bank of England has warned of heightened risks to the UK's financial system but cut the amount of money that banks need to hold in reserve in case of shock. The twice-yearly financial stability report highlights a series of pressures, from higher government borrowing costs to risks around lending to major tech firms and record stock market valuations - particularly in areas exposed to artificial intelligence (AI). \"Risks to financial stability have increased during 2025,\" the Bank's financial policy committee (FPC) said. \"Global risks remain elevated and material uncertainty in the global macroeconomic outlook persists. Key sources of risk include geopolitical tensions, fragmentation of trade and financial markets, and pressures on sovereign debt markets. Money latest: My supermarket delivery row \"Elevated geopolitical tensions increase the likelihood of cyberattacks and other operational disruptions. \"In the FPC's judgement, many risky asset valuations remain materially stretched, particularly for technology companies focused on AI. \n                  Pharma bosses and ministers to shape future drug pricing regime\n                 \n                  Is Starmer continuing to mislead public over the budget?\n                 \n                  BA to fly to two new destinations; Aldi recalls Christmas chocolate; house prices defy budget fears | Money\n                 \"Equity valuations in the US are close to the most stretched they have been since the dot-com bubble, and in the UK since the global financial crisis (GFC). This heightens the risk of a sharp correction.\" Its concern extended to the growing trend of tech firms using debt finance to fund investment.  The Bank, which joined the International Monetary Fund in warning over an AI-led bubble in October, delivered its verdict at a time when UK regulators are under pressure from the government to place a greater focus on supporting economic growth. It is understood, for example, the UK's ringfencing regime - that sees retail banking separated from more risky investment banking operations within major lenders - is the subject of a review between the Bank and government. Efforts by the chancellor to grow the economy will be potentially helped by the Bank's decision today to lower capital requirements - the reserves banks must hold to help them withstand shocks in the financial system such as the global crisis of 2008/9. The sector's main capital requirement was cut by the Bank from 14% to 13%. Such a move was urged, not only by the government, but by businesses to bolster UK lending and competitiveness. The relaxation of the buffer does not take effect until 2027. It was announced alongside confirmation that the country's biggest lenders - Barclays, HSBC, Lloyds, NatWest, Santander UK, Standard Chartered and Nationwide building society - had passed the Bank's latest stress tests. The shocks each was exposed to included a 5% contraction in UK economic output, a 28% drop in house prices and Bank rate at 8%. Despite the growing risks identified by the FPC, the Bank said that each was strong enough to support households and businesses even in the event of such scenarios, given the healthy state of their reserves. It is widely expected that the gradual reduction in Bank rate will continue next year, assuming the outlook for inflation remains on a downwards trajectory, helping wider borrowing costs - a source of record bank profitability - decline. The Bank said that three million households were expected to see their mortgage payments decrease in the next three years but that 3.9 million were forecast to refinance onto higher rates. As such, it projected a £64 (8%) rise in costs for a typical owner-occupier mortgage customer rolling off a fixed rate deal in the next two years. Banking stocks, which have enjoyed strong gains this year, were up when the FTSE 100 opened for business despite wider market caution globally which is aligned with the risks spoken of in the financial stability report. Matt Britzman, senior equity analyst at Hargreaves Lansdown, said: \"UK banks are offering a dose of optimism this morning in what's turning out to be a good couple of weeks for the major lenders. \"The UK's seven biggest banks sailed through the latest stress test, reaffirming their resilience and earning a regulatory nod to ease capital buffers. \"Most banks already hold capital well above the minimum by choice, so any shift in strategy may take time - but in theory, it frees up extra capital for lending or capital returns. \"However they use the new freedom, this is another clear signal that the UK banking sector is in robust health. This was largely expected, but the confirmation should still be taken well, especially after dodging tax hikes in last week's budget.\""
    },
    {
        "title": "Pharma bosses and ministers to shape future drug pricing regime",
        "description": "Some of the global pharmaceutical industry's top executives are to form a new panel with the government aimed at devising a new pricing regime for key medicines.",
        "url": "https://news.sky.com/story/pharma-bosses-and-ministers-to-shape-future-drug-pricing-regime-13478313",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-astrazeneca-nyse-lse_7035889.jpg?20250929105216",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-02 14:17:00",
        "Headline": "Executives from AstraZeneca and GSK will be among those invited by the government to help shape a new pricing regime to replace the heavily criticised VPAG scheme, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Some of the global pharmaceutical industry's top executives are to form a new panel with the government aimed at devising a new pricing regime for key medicines. Sky News understands that Whitehall officials and ministers will invite bosses from companies including AstraZeneca and GSK to join the new working group in the coming weeks. The move follows this week's announcement of a new drug-pricing deal between the UK and US which will see the NHS pay 25% more for branded medicines, as well as reducing the 'clawback tax' that drug companies pay to the NHS. The agreement means that the UK will avoid tariffs on medicines exports to the US for at least three years, an outcome the government was determined to secure. Industry sources said the new working group was expected to examine a range of options for replacing the existing Voluntary Scheme for Branded Medicines Pricing and Access (VPAG) when it expires in about three years' time. These options are likely to include an outcomes-based model which would entail variations in drug pricing, as well as exploring a link between pricing and the extent of pharmaceuticals companies' drug development activity which takes place in the UK. The VPAG scheme has drawn the ire of pharmaceuticals groups, which have been warning that they could delay or cancel billions of pounds of investment in Britain as a result of its continued adoption. \n                  Bank of England warns of heightened risks but trims banks' reserve requirements\n                 \n                  Is Starmer continuing to mislead public over the budget?\n                 \n                  BA to fly to two new destinations; Aldi recalls Christmas chocolate; house prices defy budget fears | Money\n                 Liz Kendall, the science and technology secretary, described this week's announcement as a \"vital deal [that] will ensure UK patients get the cutting-edge medicines they need sooner, and our world-leading UK firms keep developing the treatments that can change lives\". \"It will also enable and incentivise life sciences companies to continue to invest and innovate right here in the UK,\" she added. The Department for Science, Innovation and Technology declined to comment on the new working group."
    },
    {
        "title": "Thames Water to decide on controversial £2m payouts to bosses",
        "description": "Directors of Thames Water will meet within days to decide whether to proceed with more than &#163;2m of retention payments to senior executives amid fierce scrutiny from MPs.",
        "url": "https://news.sky.com/story/thames-water-to-decide-on-controversial-1632m-payouts-to-bosses-13478228",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-adrian-montague-thames-water_6965211.jpg?20250715103835",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-02 10:18:00",
        "Headline": "Members of the struggling utility’s remuneration committee will meet next week to decide whether to proceed with nearly £2.5m in retention payments to 21 senior managers, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Directors of Thames Water will meet within days to decide whether to proceed with more than £2m of retention payments to senior executives amid fierce scrutiny from MPs. Sky News has learnt that the crisis-hit water utility's remuneration committee will hold talks next week after taking legal advice on whether to press ahead with the second instalment of a multimillion pound payout to 21 of its most senior managers. In total, the latest payouts equate to £2.46m, the same as a previous tranche of money handed out earlier this year. Money latest: My supermarket delivery row A Whitehall source said on Tuesday that Sir Adrian Montague, Thames Water's chairman, had written to Alistair Carmichael, chair of the environment, food and rural affairs select committee to inform him of the remuneration committee's deliberations. Mr Carmichael wrote to Sir Adrian last week demanding to know by 1 December whether the money would be handed out.  Chris Weston, Thames Water's chief executive, is already the subject of a bonus 'ban' imposed by the regulator, Ofwat, under new rules preventing payouts at water companies which are failing to meet environmental, financial resilience or consumer standards. \n                  Bond giant Pimco sells bulk of Thames Water debt position\n                 \n                  English water firms get lowest environmental rating since records began\n                 \n                  Thames Water defers decision on fight for higher bills\n                 Mr Weston is not a member of the retention payment scheme. The controversial retention payments at Thames Water are due to be decided on with the company remaining in the grip of a survival battle. Its largest group of creditors remain locked in talks with Ofwat, other regulators and the government about the terms of a prospective deal that would write off billions of pounds of the company's debt. They would also inject billions of pounds in fresh equity, in return for an adjustment in Ofwat's approach to future financial penalties. Thames Water declined to comment."
    },
    {
        "title": "Apple's AI chief steps down as company falls behind in tech race",
        "description": "Apple's head of artificial intelligence and machine learning has stepped down from the company.&#160;",
        "url": "https://news.sky.com/story/apples-ai-chief-steps-down-as-company-falls-behind-in-tech-race-13478218",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-iphone-17-apple_7067440.jpg?20251202101257",
        "type": "Business",
        "Author": "Mickey Carroll",
        "Date Published": "2025-12-02 10:01:00",
        "Headline": "John Giannandrea, the current senior vice president for machine Learning and AI strategy, will be replaced by former Microsoft AI executive Amar Subramanya.",
        "Content": "\n          Science and technology reporter\n       Apple's head of artificial intelligence and machine learning has stepped down from the company.  John Giannandrea, the current senior vice president for machine Learning and AI strategy, will be replaced by former Microsoft AI executive Amar Subramanya. Mr Subramanya has overseen the development of Gemini, Google's AI and spent two decades in the industry.  Mr Giannandrea will stay on as an advisor to Apple until he retires next spring. \"We are thankful for the role John played in building and advancing our AI work, helping Apple continue to innovate and enrich the lives of our users,\" said Tim Cook, Apple's chief executive. Read more on AI:The graph that explains why AI is going to be so hugeMillions of jobs at risk due to AI, forecasting watchdog saysAre we becoming too reliant on AI - or too cautious? While machine learning has \"long been central\" to Apple's work, according to Mr Cook, the company seems to have fallen behind competitors like Google recently. \n                  Apple and Amazon defy expectations with latest results\n                 \n                  Apple users could get 'significant' compensation say lawyers, after tech firm loses competition ruling over 'unfair' £1.5bn app store fees\n                 \n                  Jessica Chastain criticises decision to delay release of The Savant after Charlie Kirk killing\n                 Apple has spent years lagging behind its competitors in AI, particularly in its AI agent Siri, which was industry-leading when it was first released. The company has a \"second-mover advantage\" attitude, where it sees value in taking time to refine and improve new technologies before releasing them to customers.  But it has been criticised recently for the slow roll-out of its AI system, Apple AI, which still isn't as integrated with apps as Android phones powered by Gemini. In order to do more complex tasks, like creating a shopping list, it contacts ChatGPT instead. Other updates, such as AI-powered translation in its AirPod earbuds, have arrived years after its competitors released similar products, and its long-awaited upgrade to Siri has been repeatedly delayed. Mr Cook said he was pleased Mr Subramanya will \"bring his extraordinary AI expertise to Apple\". Apple said the leadership changes will make sure \"Apple is poised to accelerate its work in delivering intelligent, trusted, and profoundly personal experiences\". Antitrust case In other news for Apple, today the Court of Justice of the European Union ruled that an antitrust case against the company can go ahead in Dutch courts. Apple is facing allegations that their fees for third-party apps on the App Store are excessive, hurt users and are consistent with an unlawful abuse of a dominant position. Apple had said a Dutch court does not have jurisdiction as the alleged harmful event did not occur in the Netherlands; that has now been overruled."
    },
    {
        "title": "The Wargame: Inside the decades-long saga that's left UK shockingly unprepared for war",
        "description": "The UK is \"really unprepared\" to fight a war and has been living on a \"mirage\" of military strength that was shocking to discover, interviews with almost every defence secretary since the end of the Cold War have revealed.",
        "url": "https://news.sky.com/story/the-wargame-inside-the-decades-long-saga-thats-left-uk-shockingly-unprepared-for-war-13478178",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-war-game-the-wargame_7097730.jpg?20251201161007",
        "type": "Politics",
        "Author": "Deborah Haynes",
        "Date Published": "2025-12-02 08:15:00",
        "Headline": "Sky News podcast The Wargame returns to uncover what happened behind the scenes as the UK switched funding from warfare to peacetime priorities, as told by defence secretaries who oversaw it.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  The UK is \"really unprepared\" to fight a war and has been living on a \"mirage\" of military strength that was shocking to discover, interviews with almost every defence secretary since the end of the Cold War have revealed. With Sir Keir Starmer under pressure to accelerate plans to reverse the decline, two new episodes of Sky News and Tortoise's podcast series The Wargame uncover what happened behind the scenes as Britain switched funding away from warfare and into peacetime priorities such as health and welfare after the Soviet Union collapsed. 👉Search for The Wargame on your podcast app👈 This decades-long saga, spanning multiple Labour, Conservative and coalition governments, includes heated rows between the Ministry of Defence (MoD) and the Treasury, threats to resign, and dire warnings of weakness. It also exposes a failure by the military and civil service to spend Britain's still-significant defence budget effectively, further compounding the erosion of fighting power.  'Russia knew' about UK's weaknesses Now, with the threat from Russia returning, there is a concern the UK has been left to bluff about its ability to respond, rather than pivot decisively back to a war footing. \"We've been living on a sort of mirage for so long,\" says Sir Ben Wallace, a Conservative defence secretary from 2019 until 2023. \"As long as Trooping the Colour was happening, and the Red Arrows flew, and prime ministers could pose at NATO, everything was fine. \"But it wasn't fine. And the people who knew it wasn't fine were actually the Americans, but also the Russians.\" Not enough troops, medics, or ammo Lord George Robertson, a Labour defence secretary from 1997 to 1999 and the lead author of a major defence review this year, says when he most recently \"lifted the bonnet\" to look at the state of the Army, Royal Navy and Royal Air Force, he found \"we were really unprepared\". \"We don't have enough ammunition, we don't have enough logistics, we don't have enough trained soldiers, the training is not right, and we don't have enough medics to take the casualties that would be involved in a full-scale war.\" Asked if the situation was worse than he had imagined, Lord Robertson says: \"Much worse.\" 'I was shocked,' says ex-defence secretary Sir Gavin Williamson, a former Conservative defence secretary, says he too had been \"quite shocked as to how thin things were\" when he was in charge at the MoD between 2017 and 2019. \"There was this sort of sense of: 'Oh, the MoD is always good for a billion [pounds] from Treasury - you can always take a billion out of the MoD and nothing will really change.' \"And maybe that had been the case in the past, but the cupboards were really bare. \"You were just taking the cupboards.\"  But Lord Philip Hammond, a Conservative defence secretary from 2011 to 2014 and chancellor from 2016 until 2019, appears less sympathetic to the cries for increased cash. \"Gavin Williamson came in [to the Ministry of Defence], the military polished up their bleeding stumps as best they could and convinced him that the UK's defence capability was about to collapse,\" he says. \"He came scuttling across the road to Downing Street to say, I need billions of pounds more money… To be honest, I didn't think that he had sufficiently interrogated the military begging bowls that had been presented to him.\" What to expect from The Wargame's return Episodes one to five of The Wargame simulate a Russian attack on the UK and imagine what might happen, with former politicians and military chiefs back in the hot seat. The drama reveals how vulnerable the country has really become to an attack on the home front. The two new episodes seek to find out why. The story of the UK's hollowed-out defences starts in a different era when an Iron Curtain divided Europe, Ronald Reagan was president of the US, and an Iron Lady was in power in Britain. Sir Malcolm Rifkind, who went on to serve as defence secretary between 1992 and 1995 under John Major, recalls his time as minister for state at the Foreign Office in 1984. In December of that year, then prime minister Margaret Thatcher agreed to host a relatively unknown member of the Soviet Communist Party Politburo called Mikhail Gorbachev, who subsequently became the last leader of the Soviet Union. Sir Malcolm remembers how Mrs Thatcher emerged from the meeting to say: \"I think Mr Gorbachev is a man with whom we can do business.\" It was an opinion she shared with her close ally, the US president. Sir Malcolm says: \"Reagan would have said, 'I'm not going to speak to some unknown communist in the Politburo'. But if the Iron Lady, who Reagan thought very highly of, says he's worth talking to, he must be worth it. We'd better get in touch with this guy. Which they did. \"And I'm oversimplifying it, but that led to the Cold War ending without a shot being fired.\" Read more from Sky News:Courts in 'calamitous' stateReeves faces rural Labour rebellion In the years that followed, the UK and  much of the rest of Europe reaped a so-called peace dividend, cutting defence budgets, shrinking militaries and reducing wider readiness for war. Into this different era stepped Tony Blair as Labour's first post-Cold War prime minister, with Lord Robertson as his defence secretary. Lord Robertson reveals the threat he and his ministerial team secretly made to protect their budget from then chancellor Gordon Brown amid a sweeping review of defence, which was meant to be shaped by foreign policy, not financial envelopes. \"I don't think I've ever said this in public before, but John Reid, who was the minister for the Armed Forces, and John Speller, who was one of the junior ministers in the department, the three of us went to see Tony Blair late at night - he was wearing a tracksuit, we always remember - and we said that if the money was taken out of our budget, the budget that was based on the foreign policy baseline, then we would have to resign,\" Lord Robertson says. \"We obviously didn't resign - but we kept the money.\" The podcast hears from three other Labour defence secretaries: Geoff Hoon, Lord John Hutton and the current incumbent, John Healey. For the Conservatives, as well as Rifkind, Hammond, Williamson and Wallace, there are interviews with Liam Fox, Sir Michael Fallon, Dame Penny Mordaunt and Sir Grant Shapps. In addition, military commanders have their say, with recollections from Field Marshal Lord David Richards, who was chief of the defence staff from 2010 until 2013, General Sir Nick Carter, who led the armed forces from 2018 until 2021, and Vice Admiral Sir Nick Hine, who was second in charge of the navy from 2019 until 2022. 'We cut too far' At one point, Sir Grant, who held a variety of cabinet roles, including defence secretary, is asked whether he regrets the decisions the Conservative government took when in power. He says: \"Yes, I think it did cut defence too far. I mean, I'll just be completely black and white about it.\" Lord Robertson says Labour too shares some responsibility: \"Everyone took the peace dividend right through.\""
    },
    {
        "title": "'Systematic failures' in China spy trial could be repeated, MPs warn",
        "description": "\"Systematic failures\" led to the Chinese spy case collapsing - and there's a risk they could be repeated, a parliamentary inquiry has said.",
        "url": "https://news.sky.com/story/systematic-failures-in-china-spy-trial-could-be-repeated-mps-warn-13478435",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-christopher-cash-christopher-berry_7045458.png?20251007215609",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-02 18:42:00",
        "Headline": "The China spy case collapse caused a blame game between the government, the CPS, and the Conservatives, who were in power when the case began.",
        "Content": " \"Systematic failures\" led to the Chinese spy case collapsing - and there's a risk they could be repeated, a parliamentary inquiry has said. A report by the Joint Committee on the National Security Strategy (JCNSS) criticised the government and Crown Prosecution Service (CPS) after the case against two British men accused of spying for China collapsed. Former parliamentary researcher Christopher Cash and teacher Christopher Berry were accused of passing secrets to Beijing between 2021 and 2023. They deny the allegations. The charges were dropped in September as the CPS said it could not get evidence from the government referring to China as a national security threat, prompting accusations of a \"cover-up\" by the Conservatives. The report by the cross-party group of MPS and peers said the case was beset by \"confusion and misaligned expectations\" and cautioned against dismissing the case as a \"one-off\" caused by outdated espionage laws - something the government blamed for the case's collapse.  'Serious systemic failures' The committee - which launched a highly unusual investigation following the controversy - warned there are parallels in new legislation which must be handled carefully to prevent a similar issue from recurring. But while \"the sequence of some events has raised eyebrows\", it found no evidence of deliberate or co-ordinated attempts to block or collapse the prosecution - including by the prime minister's national security adviser Jonathan Powell, who met with officials about the case two days before it was dropped. However, the committee added: \"Overall it is clear that there were serious systemic failures and deficiencies in communications, co-ordination and decision-making.\" It described communications between the government and CPS as \"inadequate\" and lacking clarity, with an \"insufficiently robust\" level of senior oversight right from the start of proceedings in 2023 under the Tories. Read more:Key witness 'surprised' case collapsedMPs warned of new spying attempts Not enough 'common sense'? A statement by deputy national security adviser (DNSA) Matt Collins became the focus after the case's collapse. Prosecutors said his refusal to describe Beijing as a \"threat\" to national security meant the case could not continue. Mr Collins, the central expert prosecution witness, told the investigation he had provided evidence of a \"range of threats\" posed by China, but did not describe it as a \"generic\" threat as that was not the then Tory government's position. The committee acknowledged the CPS's assertion it would have undermined the case at trial if Mr Collins refused to describe China as an active threat, but suggested his statements taken together would have been sufficient. \"We regret that common sense interpretations of the wording provided in the DNSA's witness statements were apparently not a sufficiently strong basis for meeting the evidential requirements the Crown Prosecution Service considered necessary under the Official Secrets Act 1911,\" it said. It accepted the \"root cause\" of the problems lay with the Official Secrets Act, which required the term \"enemy\" to be used of a foreign power, but warned the new National Security Act 2023 doesn't eliminate \"diplomatic sensitivities\" around labelling people members of a foreign intelligence service.  The committee recommends: • The Cabinet Office and security services to work with the CPS to formalise principles for handling sensitive cases within the next six months • Establishing a new rule for a formal case \"conference\" within 30 days of such charges to avoid a \"lack of clarity\" over evidence in future. \"We urge the government to avoid characterising the failure of the Cash/Berry case as a one-off peculiarity created solely by outdated legislation: there are structural parallels in the National Security Act 2023 which will require careful handling to avoid comparable issues recurring,\" the committee said. A CPS spokesperson said: \"We recognise the strong interest in this case. We will review the recommendations carefully and work with partners to identify where improvements can be made. \"Our decisions are made independently and based on law and evidence, and that principle remains at the heart of our work.\" A government spokesperson said: \"We welcome the committee's report that makes clear that allegations about interference in this case were baseless and untrue. \"The decision to drop the case was taken independently by the Crown Prosecution Service. We remain disappointed that this case did not reach trial. \"Protecting national security is our first duty, and we will never waver from our efforts to keep the British people safe.\""
    },
    {
        "title": "Rachel Reeves hit by Labour rural rebellion over inheritance tax on farmers",
        "description": "Chancellor Rachel Reeves has suffered another budget blow with a rebellion by rural Labour MPs over inheritance tax on farmers.",
        "url": "https://news.sky.com/story/rachel-reeves-hit-by-labour-rural-rebellion-over-inheritance-tax-on-farmers-13478529",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-farmer-protest_7099103.jpg?20251202223002",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-12-02 21:52:00",
        "Headline": "A number of Labour MPs in rural seats declined to back the government's move to impose inheritance tax on farmers, but just one voted against.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Chancellor Rachel Reeves has suffered another budget blow with a rebellion by rural Labour MPs over inheritance tax on farmers. Speaking during the final day of the Commons debate on the budget, Labour backbenchers demanded a U-turn on the controversial proposals. Plans to introduce a 20% tax on farm estates worth more than £1m from April have drawn protesters to London in their tens of thousands, with many fearing huge tax bills that would force small farms to sell up for good. MPs voted on the so-called \"family farms tax\" just after 8pm on Tuesday, with dozens of Labour MPs appearing to have abstained, and one backbencher - borders MP Markus Campbell-Savours - voting against, alongside Conservative members. In the vote, the fifth out of seven at the end of the budget debate, Labour's vote slumped from 371 in the first vote on tax changes, down by 44 votes to 327. The mini-mutiny followed a plea to Labour MPs from the National Farmers Union to abstain. \"To Labour MPs: We ask you to abstain on Budget Resolution 50,\" the NFU urged. \n                  Starmer cuts short Buckinghamshire visit after farmers stage noisy tractor protest\n                 \n                  UK's 'most expensive coffee' goes on sale to fund farm's future\n                 \n                  Ex-Labour adviser John McTernan suggests doing to farms 'what Thatcher did to coal mines'\n                 \"With your help, we can show the government there is still time to get it right on the family farm tax. A policy with such cruel human costs demands change. Now is the time to stand up for the farmers you represent.\" After the vote, NFU president Tom Bradshaw said: \"The MPs who have shown their support are the rural representatives of the Labour Party. They represent the working people of the countryside and have spoken up on behalf of their constituents. \"It is vital that the chancellor and prime minister listen to the clear message they have delivered this evening. The next step in the fight against the family farm tax is removing the impact of this unjust and unfair policy on the most vulnerable members of our community.\"  The government comfortably won the vote by 327-182, a majority of 145. But the mini-mutiny served notice to the chancellor and Sir Keir Starmer that newly elected Labour MPs from the shires are prepared to rebel. Speaking in the debate earlier, Mr Campbell-Savours said: \"There remain deep concerns about the proposed changes to agricultural property relief (APR). \"Changes which leave many, not least elderly farmers, yet to make arrangements to transfer assets, devastated at the impact on their family farms.\" Samantha Niblett, Labour MP for South Derbyshire abstained after telling MPs: \"I do plead with the government to look again at APR inheritance tax. \"Most farmers are not wealthy land barons, they live hand to mouth on tiny, sometimes non-existent profit margins. Many were explicitly advised not to hand over their farm to children, (but) now face enormous, unexpected tax bills. \"We must acknowledge a difficult truth: we have lost the trust of our farmers, and they deserve our utmost respect, our honesty and our unwavering support.\"  Labour MPs from rural constituencies who did not vote included Tonia Antoniazzi (Gower), Julia Buckley (Shrewsbury), Torquil Crichton (Western Isles), Jonathan Davies (Mid Derbyshire), Maya Ellis (Ribble Valley), and Anna Gelderd (South East Cornwall), Ben Goldsborough (South Norfolk), Alison Hume (Scarborough and Whitby), Terry Jermy (South West Norfolk), Jayne Kirkham (Truro and Falmouth), Noah Law (St Austell and Newquay), Perran Moon, (Camborne and Redruth), Samantha Niblett (South Derbyshire), Jenny Riddell-Carpenter (Suffolk Coastal), Henry Tufnell (Mid and South Pembrokeshire), John Whitby (Derbyshire Dales) and Steve Witherden (Montgomeryshire and Glyndwr)."
    },
    {
        "title": "Government delays Chinese 'super embassy' decision",
        "description": "The UK government has again delayed its decision over whether to approve a Chinese \"super embassy\" in London until January.",
        "url": "https://news.sky.com/story/government-delays-chinese-super-embassy-decision-again-13478365",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-china-embassy_7050654.jpg?20251014113348",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-12-02 15:55:00",
        "Headline": "There have been large-scale protests against the embassy over fears it will become a European spy hub for China.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The UK government has again delayed its decision over whether to approve a Chinese \"super embassy\" in London until January. A decision over the controversial plan close to the Tower of London will now take place on 20 January, instead of 10 December, a letter from the planning inspectorate seen by Sky News says. A spokesperson for the embassy condemned the postponement, adding: \"We strongly urge the UK side to approve our planning application quickly to avoid further undermining the mutual trust and cooperation between the two sides.\" Despite multiple delays, Sky News understands the government is expected to approve the plans for what would be Europe's largest embassy, with both MI5 and MI6 said to have given their blessing to the decision. Housing Secretary Steve Reed has said he needs more time to consider new representations from the Foreign Office and Home Office. A letter from the home and foreign secretaries to the planning inspectorate, published with the latest delay letter, said their national security concerns have been addressed by the Chinese government committing to ensure all its diplomatic premises in London, excluding the ambassador's house, are consolidated on to the new embassy site. The new letter sent to ministers and \"interested parties\", including the Inter Parliamentary Alliance on China (IPAC) - which has warned against approving the embassy - said the government aims \"to issue the decision as quickly as possible\" on or before 20 January. \n                  PM issues China warning - and hits out at Brexit\n                 \n                  Death toll rises to 146 in Hong Kong apartment complex fire as more bodies found in burned buildings\n                 \n                  Almost 280 people missing as huge fire engulfs Hong Kong flats - dozens confirmed dead\n                 Luke de Pulford, executive director of IPAC, told Sky News: \"This is the third delay, and entirely of the government's own making. \"Residents and dissidents have endured months of dithering as the government tries to choose between UK national security and upsetting Beijing.\" Three delays by Labour government Mr Reed became housing secretary in September and had already delayed the decision once from October, as he said he had not had enough time to look at the details. A decision had also been delayed earlier this year by the former housing secretary Angela Rayner, months after the Chinese re-submitted their planning application two weeks after Labour won the general election. That was after Tower Hamlets Council rejected the application in 2022 and the Conservative government said it would not call it in for ministers to decide. Read more:Everything we know about China's new 'super embassy' National security concerns There have been large-scale protests against the embassy - on the site of the former Royal Mint - over concerns it will be used as a Chinese spy hub for Europe. Hong Kong dissidents who have fled to the UK have expressed fears that rooms redacted \"for security reasons\" in submitted plans might be used to detain them. The latest delay comes less than 24 hours after Sir Keir Starmer warned China poses \"real national security threats to the United Kingdom\" and said being tough on national security will enable the UK to pursue economic opportunities with Beijing. He said UK government policy towards China cannot continue to blow \"hot and cold\" and said his government will focus on the relationship with Beijing.  Chinese embassy says UK interfering in its affairs A Chinese embassy spokesman in London said China \"firmly opposes the erroneous remarks\" and accused Sir Keir of making \"groundless accusations against China\" and interfering in China's internal affairs. \"Facts have fully demonstrated that China has always been a builder of world peace, a contributor to global development, and a defender of the international order,\" he said. Last month, MI5 warned MPs, peers and parliamentary staff about the risk from Chinese spies after identifying two LinkedIn profiles it said are being used by the Chinese Ministry of State Security to act as \"civilian recruitment headhunters\"."
    },
    {
        "title": "Courts system in a 'calamitous' state, warns ex-judge who recommended jury cuts",
        "description": "Sir Brian Leveson, who conducted the independent review of the courts system that guided the government's decision to reduce on jury trials, has suggested there is no alternative.",
        "url": "https://news.sky.com/story/courts-system-in-a-calamitous-state-warns-ex-judge-who-recommended-jury-cuts-13478489",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/2336f464f1df495ed6ddd4016130bbe9c18a0cb101cb4996740a07ddaf8ff622_7098834.jpg?20251202192722",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-02 20:46:00",
        "Headline": "Sir Brian Leveson told Sky's Politics Hub that the government plan to restrict jury trials will mean at least a \"20% time saving\" and help tackle the courts backlog.",
        "Content": " Sir Brian Leveson, who conducted the independent review of the courts system that guided the government's decision to reduce on jury trials, has suggested there is no alternative. Speaking to Sky's Politics Hub programme, the retired judge argued that by restricting jury trials, Justice Secretary David Lammy is \"aiming to try to solve the systemic problems\" in courts. He told Sky presenter Ali Fortescue: \"I am a great believer in trial by jury, but trials with a jury take very much longer than trials conducted otherwise than with 12 people who are utterly unused to criminal procedure and criminal evidence. \"So my concern is that we need to get through cases quicker.\" He said that it was likely a \"20% time saving would result\" from the move, although he thinks that \"a great deal more\" would be saved. Asked about the criticism today of the decision, Sir Brian said: \"I'm gaining no pleasure from it, but what I say to all of them is 'If not this, then what?' How do we reduce the backlog so the victims and witnesses get their day in court within a reasonable time?\" He argued that \"we should use our resources proportionately to the gravity of the offending\", and \"there are some cases which, to my mind, do not merit or require a trial by jury\". \n                  Jury trials will be scrapped for defendants facing sentences of three years or less, David Lammy announces\n                 \n                  Two mistakenly released prisoners still at large, says justice secretary\n                 \n                  David Lammy to unveil plans to tackle 'courts emergency' - but possible limits to jury trials spark concern\n                 Sir Brian said that some jurors he had spoken to said it was \"worthwhile\". But he added: \"They've given up two weeks of their life, sometimes without any pay except the small remuneration that they receive from the state doing jury service, and they've been trying cases which shouldn't merit their attention\". Asked if he would want a trial by jury if he had been wrongly accused of theft, Sir Brian said: \"If I'd been wrongly accused of theft, I'd be perfectly happy for a judge to decide I'd been wrongly accused of theft.\"  More broadly, he said: \"I don't see how you're going to bring down the backlog without more money, more sitting days, greater efficiency, and speedier trials... \"There aren't the judges, there aren't the court staff, more significantly there aren't the advocates.\" He said that the justice system had never been in such a \"calamitous\" state. 👉 Listen to Sky News Daily on your podcast app 👈 'The reforms are about fairness' Courts minister Sarah Sackman also defended the decision on Tuesday's Politics Hub. She acknowledged that jury trials were \"a success story\", and \"a cornerstone of British justice and will remain so after today's plans\". But she added: \"What's not such a success story is the fact that we inherited record and rising backlogs in our courts. \"Today the number starts at 80,000 cases, and it's on the rise - due to hit 100,000 by 2028.\" That leaves victims \"waiting for their case to be heard\". She argued that the measures announced on Tuesday were \"a set of reforms that will restore confidence in our justice system, get those delays down, and indeed preserve jury trials for the most serious cases\". Ms Sackman added that \"right now in our system, 90% of cases [are] being heard without a jury in our magistrates\", which is \"fair, robust justice\". \"Part of fairness is about the swiftness we need to deliver swifter justice for victims,\" she said. \"What's not fair is a victim of crime being told today that she needs to wait until 2029, 2030 for her day in court.\"  The minister gave an example of what will change, saying: \"Supposing a defendant is accused of stealing a bottle of whisky. \"Is it right that we allow the defendant to insist on a slower, more expensive jury trial in the same queue as the victim of rape, making her wait and in some cases, justice not being served? \"That's the choice that we've made today.\" But the minister refused to say how much this would reduce the backlog by."
    },
    {
        "title": "Inquiry into Crown Estate launched after controversy over Andrew's Royal Lodge residence",
        "description": "An influential parliamentary committee is launching an inquiry into the Crown Estate - the vast range of properties and land owned by the monarchy.",
        "url": "https://news.sky.com/story/inquiry-into-crown-estate-launched-after-controversy-over-andrews-royal-lodge-residence-13478350",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-king_7067960.jpg?20251031151214",
        "type": "Politics",
        "Author": "Laura Bundock",
        "Date Published": "2025-12-02 15:17:00",
        "Headline": "Answers from the estate and the Treasury about the Royal Lodge in Windsor, where  Mr Mountbatten-Windsor pays a peppercorn rent, have prompted the new scrutiny from Parliament's public accounts committee  ",
        "Content": "\n          Royal correspondent\n              @laurabundock\n An influential parliamentary committee is launching an inquiry into the Crown Estate - the vast range of properties and land owned by the monarchy. The move by the Public Accounts Committee follows scrutiny of Andrew Mountbatten-Windsor's living arrangements at Royal Lodge on the Windsor Estate, and the revelation he pays a peppercorn rent. The Crown Estate and the Treasury were asked to explain and justify his lease agreement to the committee after the series of scandals over Andrew's controversial links to Jeffrey Epstein which saw him step down from royal duties and lose his royal style and titles. The former prince has consistently denied allegations of sexual abuse and his accuser, Virginia Giuffre, took her own life this year. Public Accounts Committee chair Sir Geoffrey Clifton-Brown thanked the Treasury and Crown Estate for responding to questions and said the committee's \"overall\" mission was to \"secure value for money for the taxpayer\". Read more:Andrew Mountbatten-Windsor officially stripped of two more titlesAndrew loses his titles - everything we know He said: \"Having reflected on what we have received, the information provided clearly forms the beginnings of a basis for an inquiry.\" \n                  Andrew Mountbatten-Windsor officially stripped of two more titles\n                 \n                  Prince Andrew Way to be renamed - but council warns it won't be straightforward\n                 \n                  Starmer urges anyone with information on Epstein case to come forward - after Andrew misses Congress deadline\n                 The inquiry into the Crown Estate will start in the new year and will consider leases given to members of the royal family, as well as wider work based on the estate's annual accounts. Part of the responses given to the committee confirm Andrew won't receive any compensation for leaving Royal Lodge due to the maintenance and repairs the property needs. It has also been revealed that the Prince and Princess of Wales have a 20-year lease on their new home, Forest Lodge, also situated within Windsor Great Park."
    },
    {
        "title": "Two mistakenly released prisoners still at large, says justice secretary",
        "description": "Twelve more prisoners have been mistakenly released from prison over the past month, David Lammy has confirmed - and two remain at large.",
        "url": "https://news.sky.com/story/two-mistakenly-released-prisoners-still-at-large-says-justice-secretary-13478176",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-david-lammy_7098112.jpg?20251202074936",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-02 08:03:00",
        "Headline": "David Lammy has confirmed there have been more prisoners accidentally freed since he made a statement to the Commons last month.",
        "Content": " Twelve more prisoners have been mistakenly released from prison over the past month, David Lammy has confirmed - and two remain at large. Speaking to Mornings with Ridge and Frost, the justice secretary admitted that there have been further prisoners accidentally freed since he made a statement on the issue last month. Pushed on how many more people have been wrongly let out since his update to MPs on 11 November, Mr Lammy responded: \"There have been two.\" But he later clarified to the BBC afterwards that \"there have been 12 [mistaken releases] since then, two are currently at large\". Politics latest - follow live At the time, he said 91 people had been mistakenly freed from prisons in England and Wales since April this year. Mr Lammy told Sky News: \"There have been releases in error since I made that statement, but I want to convey that the trend this year is fortunately downwards. \n                  Courts system in a 'calamitous' state, warns ex-judge who recommended jury cuts\n                 \n                  Jury trials will be scrapped for defendants facing sentences of three years or less, David Lammy announces\n                 \n                  David Lammy to unveil plans to tackle 'courts emergency' - but possible limits to jury trials spark concern\n                 \"There are two people currently at large... and a prison system that is paper-based. Mistakes happen.\" But pushed for more detail on these mistaken releases, Mr Lammy said he doesn't want to give a \"running commentary\". He said: \"It's important that I release that data in the way that it's always been released. And it's also important that I work with police where someone is at large, and sometimes because the police are about to nab somebody, they actually don't want me to discuss it, and it's important that they get on to it.\" Mr Lammy also told ITV that the two prisoners who remain at large are not violent or sexual offenders. Reacting to Mr Lammy's admission, the shadow justice secretary, Robert Jenrick, said: \"Calamity Lammy admits two more dangerous prisoners have been mistakenly released. \"But he won't say who they are or where they are. When will this fiasco end?\" Following the justice secretary's admission to the BBC, Mr Jenrick added: \"Fifteen minutes later, Calamity says 12 prisoners have in fact been released by mistake, not two. \"Twelve in three weeks. So the problem has got worse since he intervened. \"This is a total shambles.\"  Mr Jenrick's shadow Cabinet colleague, Sir Mel Stride, has told Sky News that the justice secretary should \"tell us a bit more\" about the two prisoners who are on the run. He said: \"I think it is appropriate that he comes forward and tells us a bit more about who they are, what they were convicted for, how dangerous they might be, so that we're properly informed.\" Pushed on whether it should be for the police to decide to share this information, the shadow chancellor responded: \"It seems to me, on the face of it, that if you've got two people out there, who have been let go by mistake... then we should know a little bit more about it.\"  Meanwhile, Liberal Democrat justice spokesperson Jess Brown-Fuller has said it is utterly unacceptable that public safety has been put at risk yet again\". She added: \"The public deserves a full explanation about how this has happened again, and how the government are going to get a grip on this dangerous level of incompetence within our justice system. \"Both the government and the Prison Service must own up to their failures and guarantee that these mistakes will stop happening once and for all.\" Read more:Lammy to unveil plans to tackle 'courts emergency'Mistaken releases 'could be opportunity' for Lammy Some 262 prisoners were mistakenly freed in the year to March 2025, a 128% increase on the 115 in the previous 12 months, according to figures from the Ministry of Justice. Since then, Mr Lammy has faced a number of high-profile man-hunts, after inmates were mistakenly released and temporarily went on the run. These include: All three have subsequently been returned to prison, and Kebatu was later deported to his home country of Ethiopia. Following these, Mr Lammy admitted the government had a \"mountain to climb\"."
    },
    {
        "title": "Apple's AI chief steps down as company falls behind in tech race",
        "description": "Apple's head of artificial intelligence and machine learning has stepped down from the company.&#160;",
        "url": "https://news.sky.com/story/apples-ai-chief-steps-down-as-company-falls-behind-in-tech-race-13478218",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-iphone-17-apple_7067440.jpg?20251202101257",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-12-02 10:01:00",
        "Headline": "John Giannandrea, the current senior vice president for machine Learning and AI strategy, will be replaced by former Microsoft AI executive Amar Subramanya.",
        "Content": "\n          Science and technology reporter\n       Apple's head of artificial intelligence and machine learning has stepped down from the company.  John Giannandrea, the current senior vice president for machine Learning and AI strategy, will be replaced by former Microsoft AI executive Amar Subramanya. Mr Subramanya has overseen the development of Gemini, Google's AI and spent two decades in the industry.  Mr Giannandrea will stay on as an advisor to Apple until he retires next spring. \"We are thankful for the role John played in building and advancing our AI work, helping Apple continue to innovate and enrich the lives of our users,\" said Tim Cook, Apple's chief executive. Read more on AI:The graph that explains why AI is going to be so hugeMillions of jobs at risk due to AI, forecasting watchdog saysAre we becoming too reliant on AI - or too cautious? While machine learning has \"long been central\" to Apple's work, according to Mr Cook, the company seems to have fallen behind competitors like Google recently. \n                  Apple and Amazon defy expectations with latest results\n                 \n                  Apple users could get 'significant' compensation say lawyers, after tech firm loses competition ruling over 'unfair' £1.5bn app store fees\n                 \n                  Jessica Chastain criticises decision to delay release of The Savant after Charlie Kirk killing\n                 Apple has spent years lagging behind its competitors in AI, particularly in its AI agent Siri, which was industry-leading when it was first released. The company has a \"second-mover advantage\" attitude, where it sees value in taking time to refine and improve new technologies before releasing them to customers.  But it has been criticised recently for the slow roll-out of its AI system, Apple AI, which still isn't as integrated with apps as Android phones powered by Gemini. In order to do more complex tasks, like creating a shopping list, it contacts ChatGPT instead. Other updates, such as AI-powered translation in its AirPod earbuds, have arrived years after its competitors released similar products, and its long-awaited upgrade to Siri has been repeatedly delayed. Mr Cook said he was pleased Mr Subramanya will \"bring his extraordinary AI expertise to Apple\". Apple said the leadership changes will make sure \"Apple is poised to accelerate its work in delivering intelligent, trusted, and profoundly personal experiences\". Antitrust case In other news for Apple, today the Court of Justice of the European Union ruled that an antitrust case against the company can go ahead in Dutch courts. Apple is facing allegations that their fees for third-party apps on the App Store are excessive, hurt users and are consistent with an unlawful abuse of a dominant position. Apple had said a Dutch court does not have jurisdiction as the alleged harmful event did not occur in the Netherlands; that has now been overruled."
    },
    {
        "title": "More than 800,000 young children seeing social media content 'designed to hook adults', figures show",
        "description": "Children as young as three are \"being fed content and algorithms designed to hook adults\" on social media, a former education minister has warned.",
        "url": "https://news.sky.com/story/more-than-800000-young-children-seeing-social-media-content-designed-to-hook-adults-figures-show-13478155",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-mobile-phone-child_7098059.jpg?20251202064511",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-02 06:45:00",
        "Headline": "Former education secretary Lord John Nash calls for major public health campaign, and says the findings by the Centre for Social Justice (CSJ) should \"concern us all\"",
        "Content": "Children as young as three are \"being fed content and algorithms designed to hook adults\" on social media, a former education minister has warned. Lord John Nash said analysis by the Centre for Social Justice (CSJ) suggesting more than 800,000 UK children aged between three and five were already engaging with social media was \"deeply alarming\". The peer, who served as minister for the school system between 2013 and 2017, said that \"children who haven't yet learned to read [are] being fed content and algorithms designed to hook adults\", which, he said, \"should concern us all\". He called for \"a major public health campaign so parents better understand the damage being done, and legislation that raises the age limit for social media to 16 whilst holding tech giants to account when they fail to keep children off their platforms\". The CSJ reached the figure by applying the latest population data to previous research by Ofcom. The internet and communications watchdog found that almost four in 10 parents of a three to five year-old reported that their child uses at least one social media app or site. With roughly 2.2 million children in this age group as of 2024, the CSJ said this suggests there could be 814,000 users of social media between three and five years old, a rise of around 220,000 users from the year before. \n                  Australia's Anthony Albanese gets married - and makes history as country's first prime minister to wed in office\n                 \n                  Swiss tourist killed in Australia shark attack - as partner in critical condition after fighting to save her\n                 \n                  Woman killed and man injured in shark attack in New South Wales, Australia\n                 Lord Nash is among those who have demanded the Children's Wellbeing and Schools Bill ban under-16s from having access to social media, something that will become law in Australia next month. From 10 December, social media platforms will have to take reasonable steps to prevent under-16s from having a social media account, in effect blocking them from platforms such as Meta's Instagram, TikTok and Snap's Snapchat. Ministers hope it will protect children from harmful content and online predators. But one teenager who is against the idea is suing the Australian government as, he says, the measure would make the internet more dangerous for young people, many of whom would ignore the ban. Read more on Sky News:Call to trial four-day week for teachersPrimary school tests 'devastating'AI to tackle truancy Noah Jones, 15, co-plaintiff in a High Court case said a better plan would be \"cutting off the bad things about social media\", adding, \"I most likely will get around the ban. I know a lot of my mates will\". UK campaigners have called for stronger policies to stop students using phones in schools, which already have the power to ban phones. The CSJ wants to see smartphones banned in all schools \"to break the 24-hour cycle of phone use\", and said a public health campaign is needed \"to highlight the harms of social media\". Last week Health Secretary Wes Streeting said he worries \"about the mind-numbing impact of doomscrolling on social media on young minds and our neurodevelopment\"."
    },
    {
        "title": "Holly Willoughby fined after colliding with moped and injuring rider",
        "description": "TV presenter Holly Willoughby has been fined in court after she admitted driving without due care and attention when her car collided with a moped, injuring the rider.",
        "url": "https://news.sky.com/story/holly-willoughby-fined-after-colliding-with-moped-and-injuring-rider-13478444",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-holly-willoughby-bear-hunt_7098840.jpg?20251202193232",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-02 19:19:00",
        "Headline": "Police were called to a collision in Barnes, southwest London, on 28 August. It happened as the TV presenter was driving her Mini Cooper near her Richmond home. She was fined £1,653 for driving without due care.",
        "Content": "TV presenter Holly Willoughby has been fined in court after she admitted driving without due care and attention when her car collided with a moped, injuring the rider. The star, 44, pleaded guilty by post to the charge at Lavender Hill Magistrates' Court on Tuesday but did not attend the hearing. Willoughby was fined £1,653 alongside £130 in costs and a £661 victim surcharge and given six points on her licence, the Metropolitan Police said. According to court documents, the incident happened on 28 August as she was driving her Mini Cooper near her home in Richmond, southwest London. Police were called to Church Road, Barnes, following reports of a collision. The rider of the moped, a 43-year-old man, was taken to hospital. His injuries were assessed as neither life-threatening nor life-changing. Read more from Sky News:Gavin Plumb loses appealWilloughby tells of 'tough' year The presenter is best known for fronting Dancing On Ice as well as ITV daytime show This Morning, which she left in October 2023."
    },
    {
        "title": "Sabrina Carpenter hits out at 'evil and disgusting' White House video featuring her song",
        "description": "Sabrina Carpenter has hit out at an \"evil and disgusting\" White House video of migrants being detained that uses one of her songs.",
        "url": "https://news.sky.com/story/sabrina-carpenter-hits-out-at-evil-and-disgusting-white-house-video-featuring-her-song-13478430",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sabrina-carpenter-mtv-vmas_7014111.jpg?20250908073947",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-02 18:26:00",
        "Headline": "Singers Olivia Rodrigo and Jess Glynne have also attacked Mr Trump's government for using their music on anti-illegal immigration videos.",
        "Content": " Sabrina Carpenter has hit out at an \"evil and disgusting\" White House video of migrants being detained that uses one of her songs. \"Do not ever involve me or my music to benefit your inhumane agenda,\" the pop star posted on X. The White House used part of Carpenter's upbeat song Juno over pictures of immigration agents handcuffing, chasing and detaining people. It was posted on social media on Monday and has been viewed 1.2 million times so far. President Trump's policy of sending officers into communities to forcibly round up illegal immigrants has proved controversial, with protests and legal challenges ongoing. Mr Trump promised the biggest deportation in US history, but some of those detained have been living and working in the US for decades and have no criminal record. Carpenter is not the only star to express disgust over the administration's use of their music. \n                  Kendrick Lamar leads Grammy nominations as K-pop makes it mark\n                 \n                  MTV VMAs in pictures: Lady Gaga, Ariana Grande and Sabrina Carpenter triumph as tribute paid to Ozzy Osbourne\n                 \n                  Sabrina Carpenter and Charli XCX BRIT Awards appearances spark hundreds of Ofcom complaints\n                 Olivia Rodrigo last month warned the White House not to \"ever use my songs to promote your racist, hateful propaganda\" after All-American Bitch was used in a video urging undocumented migrants to leave voluntarily. Read more from Sky News:Pope urges Trump not to oust Venezuelan president by forceGovernment delays Chinese 'super embassy' decision In July, English singer Jess Glynne also said she felt \"sick\" when her song from the viral Jet2 advert was used over footage of people in handcuffs being loaded on a plane.Other artists have also previously hit out at Trump officials for using their music at political campaign events, including Guns N' Roses, Foo Fighters, Celine Dion, Ozzy Osbourne and The Rolling Stones."
    },
    {
        "title": "Is Die Hard a Christmas film? The public have spoken - and you might not like the result ",
        "description": "It's a debate that's torn families apart for years - with selection boxes thrown in rage, and stony silences around the dinner table.",
        "url": "https://news.sky.com/story/is-die-hard-a-christmas-film160the-public-have-spoken-and-you-might-not-like-the-result-13478136",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-bruce-willis-obit-die-hard_6682165.jpg?20240911142419",
        "type": "Entertainment",
        "Author": "Connor Sephton",
        "Date Published": "2025-12-02 03:26:00",
        "Headline": "Even Bruce Willis himself thinks the blockbuster isn't a Christmas film. \"It's a goddamn Bruce Willis movie!\" he said in 2018.",
        "Content": "\n          News reporter\n              @ConnorSephton\n It's a debate that's torn families apart for years - with selection boxes thrown in rage, and stony silences around the dinner table. But now, the public have spoken and settled the matter once and for all: Die Hard is not a Christmas film. That's according to 44% of those who responded to a new poll by the British Board of Film Classification, anyway. They narrowly outnumbered the 38% who argued that the Bruce Willis blockbuster is festive - with another 5% declaring it's their favourite Christmas movie of them all. A further 17%, who presumably have been embroiled in this debate before and want a quiet life, said they were unsure. Willis himself waded into the row back in 2018, when he declared during a comedy roast: \"Die Hard is not a Christmas movie. It's a goddamn Bruce Willis movie!\" He has also found an ally in Home Alone star Macaulay Culkin, who was booed by an audience after sharing his opinion last month. \"It's just a movie set at Christmas,\" he said. \"If you set it at St Patrick's Day, the exact same movie. But you set Home Alone at St Patrick's Day…\" Culkin kind of has a point there. What's the Christmas number one? Thankfully, other questions in the BBFC's poll weren't as divisive - with respondents asked to crown their favourite Christmas film of all time. Incidentally, Home Alone came out on top with 20% of the vote. That's streets ahead of Love Actually, which was in second place on 9%. (If Alan Rickman had been nicer to Emma Thompson, it would have easily won.) It's A Wonderful Life was third and chosen by 8%, with Elf fourth on 7%. Read more offbeat news:Runaway reindeer sparks emergency rescue operationOxford Dictionary publisher reveals Word of the Year The research also revealed that 43% believe it's acceptable to start watching Christmas movies from the beginning of December - with 13% turning on their favourite festive films from the start of November. Meanwhile, 8% admitted enjoying Christmas movies all year round… presumably when they're home alone."
    },
    {
        "title": "Spirit animal: Raccoon gets drunk as a skunk in a booze store - and sleeps off hangover in the toilet ",
        "description": "A raccoon has gotten as drunk as a skunk.",
        "url": "https://news.sky.com/story/spirit-animal-raccoon-gets-drunk-as-a-skunk-in-a-booze-store-and-sleeps-off-hangover-in-the-toilet-13478586",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-raccoon-california_7099187.jpg?20251202232615",
        "type": "Strange",
        "Author": "Connor Sephton",
        "Date Published": "2025-12-02 23:12:00",
        "Headline": "Officials say the raccoon was taken into custody and allowed to sleep for a few hours before being released into the wild - presumably with a headache.",
        "Content": "\n          News reporter\n              @ConnorSephton\n A raccoon has gotten as drunk as a skunk. On a wild Friday night, the trash panda broke into a liquor store in Virginia - and began helping themselves to the stock. The following morning, an officer was asked to investigate reports of a break-in… and wasn't prepared for what happened next. She was greeted by a soaked aisle that reeked of booze and was littered with smashed bottles. Spirits were the tipple of choice - this wasn't a wine racc. Officer Martin's inquiries soon took her to the bathroom, where she discovered the raucous raccoon sleeping it off in between a toilet and a bin. The sozzled suspect was rumbled and described as \"very intoxicated\" by Hanover County Animal Protection and Shelter. \n                  The night Democrats fought back against Trump\n                 \n                  Letitia James indicted for fraud after Donald Trump demanded case against New York attorney general\n                 \n                  Virginia man dies after bear shot by fellow hunter falls on top of him from tree\n                 Read more like this:Judge wears Elvis wig in courtDie Hard's Christmas credentials questioned A Facebook statement said: \"Officer Martin safely secured our masked bandit and transported him back to the shelter to sober up before questioning. \"After a few hours of sleep and zero signs of injury (other than maybe a hangover and poor life choices), he was safely released back to the wild, hopefully having learned that breaking and entering is not the answer.\" The spirit animal has now been barred - and unfortunately, there's no CCTV footage of him getting completely pawless. Why? Because he entered the building through the ceiling… and took the camera down with him. The store has thanked Officer Martin for \"providing our visitor with a sober ride home\" after he racked up a substantial bill."
    },
    {
        "title": "Is Die Hard a Christmas film? The public have spoken - and you might not like the result ",
        "description": "It's a debate that's torn families apart for years - with selection boxes thrown in rage, and stony silences around the dinner table.",
        "url": "https://news.sky.com/story/is-die-hard-a-christmas-film160the-public-have-spoken-and-you-might-not-like-the-result-13478136",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-bruce-willis-obit-die-hard_6682165.jpg?20240911142419",
        "type": "Strange",
        "Author": "Connor Sephton",
        "Date Published": "2025-12-02 03:26:00",
        "Headline": "Even Bruce Willis himself thinks the blockbuster isn't a Christmas film. \"It's a goddamn Bruce Willis movie!\" he said in 2018.",
        "Content": "\n          News reporter\n              @ConnorSephton\n It's a debate that's torn families apart for years - with selection boxes thrown in rage, and stony silences around the dinner table. But now, the public have spoken and settled the matter once and for all: Die Hard is not a Christmas film. That's according to 44% of those who responded to a new poll by the British Board of Film Classification, anyway. They narrowly outnumbered the 38% who argued that the Bruce Willis blockbuster is festive - with another 5% declaring it's their favourite Christmas movie of them all. A further 17%, who presumably have been embroiled in this debate before and want a quiet life, said they were unsure. Willis himself waded into the row back in 2018, when he declared during a comedy roast: \"Die Hard is not a Christmas movie. It's a goddamn Bruce Willis movie!\" He has also found an ally in Home Alone star Macaulay Culkin, who was booed by an audience after sharing his opinion last month. \"It's just a movie set at Christmas,\" he said. \"If you set it at St Patrick's Day, the exact same movie. But you set Home Alone at St Patrick's Day…\" Culkin kind of has a point there. What's the Christmas number one? Thankfully, other questions in the BBFC's poll weren't as divisive - with respondents asked to crown their favourite Christmas film of all time. Incidentally, Home Alone came out on top with 20% of the vote. That's streets ahead of Love Actually, which was in second place on 9%. (If Alan Rickman had been nicer to Emma Thompson, it would have easily won.) It's A Wonderful Life was third and chosen by 8%, with Elf fourth on 7%. Read more offbeat news:Runaway reindeer sparks emergency rescue operationOxford Dictionary publisher reveals Word of the Year The research also revealed that 43% believe it's acceptable to start watching Christmas movies from the beginning of December - with 13% turning on their favourite festive films from the start of November. Meanwhile, 8% admitted enjoying Christmas movies all year round… presumably when they're home alone."
    }
]