[
    {
        "title": "Scottish Labour win Hamilton, Larkhall and Stonehouse by-election as SNP suffer shock defeat",
        "description": "Scottish Labour's Davy Russell has won the Hamilton, Larkhall and Stonehouse by-election.",
        "url": "https://news.sky.com/story/scottish-labour-win-hamilton-larkhall-and-stonehouse-by-election-13379805",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-davy-russell-scottish-labour_6935574.jpg?20250606021146",
        "type": "Home",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-06-05 23:00:00",
        "Headline": "Voters in South Lanarkshire went to the polls on Thursday following the death of SNP MSP Christina McKelvie.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n  Scottish Labour's Davy Russell has won the Hamilton, Larkhall and Stonehouse by-election. Mr Russell took top spot with 8,559 votes. The SNP placed second with 7,957 votes, with Reform UK closely taking third with 7,088 votes. The new MSP said he was \"proud\" to have been elected, adding: \"I said in this campaign that I will put this community, our community first. \"I will work every single day to do that.\" The by-election was called following the death of SNP MSP Christina McKelvie. The Scottish government minister died in March at the age of 57, having last year taken medical leave to undergo treatment for secondary breast cancer. South Lanarkshire councillor Katy Loudon had hoped to retain the Holyrood seat for the SNP, given her party's heavy losses to Labour at last year's UK general election. \n                  Hamilton, Larkhall and Stonehouse by-election: Polls close and count begins to replace late MSP\n                 \n                  Liz Truss was 'right' to be radical, but the numbers need to 'add up', shadow chancellor Sir Mel Stride tells Sky News\n                 \n                  Hamilton, Larkhall and Stonehouse by-election: Who are the candidates?\n                 First Minister John Swinney congratulated Mr Russell following the result. In a post on X, the SNP leader said Ms Loudon had \"fought a superb SNP campaign\". He added: \"We have made progress since the election last year but not enough. We still have work to do and we will do it.\" All eyes were also on Reform UK and whether it would enjoy a \"tartan bounce\" in light of the party's recent slew of local election wins in England. With Reform UK never having won an election in Scotland, party deputy leader Richard Tice said candidate Ross Lambie coming in third was a \"massive boost for us\". He added: \"It's a fantastic result, just a few hundred votes away from the SNP, nobody predicted that. \"I think that sets us up with excitement and momentum for the next 11 months into the Holyrood elections.\" Mr Russell said the constituents had voted to \"take a new direction\" with his party. He added: \"Like the people here in Hamilton, Larkhall and Stonehouse, and right across Scotland, we all feel we have been let down by the SNP. \"They've broken our NHS, wasted our money, and after nearly two decades they don't deserve another chance.\" Mr Russell said the community had also \"sent a message\" to Reform UK leader Nigel Farage \"and his mob tonight\". He added: \"The poison of Reform isn't us, it isn't Scotland, and we don't want your division here. \"Reform have no real answers to the issues we face, and they can't beat the SNP here or replace them across Scotland.\" Mr Russell said his party was ready to \"fix\" the NHS and \"end the SNP's addiction to wasting your money\". He added: \"The road to a new direction for Scotland in 2026 - with Anas Sarwar as first minister and a Scottish Labour government - begins right here. So, let's go and win it together.\" Ten candidates went head-to-head in the Holyrood by-election: • Collette Bradley, Scottish Socialist Party - 278 votes• Andy Brady, Scottish Family Party - 219 votes• Ross Lambie, Reform UK - 7,088 votes• Katy Loudon, Scottish National Party (SNP) - 7,957 votes• Janice MacKay, UK Independence Party (UKIP) - 50 votes• Ann McGuinness, Scottish Green Party - 695 votes• Aisha Mir, Scottish Liberal Democrats - 533 votes• Richard Nelson, Scottish Conservative and Unionist Party - 1,621 votes• Davy Russell, Scottish Labour Party - 8,559 votes• Marc Wilkinson, Independent - 109 votes The votes were verified and manually counted at South Lanarkshire Council headquarters in Hamilton. Campaigning became heated in the run up to the by-election, with Reform UK accused of running a \"racist\" ad on Facebook against Scottish Labour leader Anas Sarwar. Reform leader Mr Farage continued to double down, accusing his rival of \"sectarian politics\". Read more from Sky News:'Farage could become PM - this is how Labour can stop him'Prisoners to be transferred to lower security jails In response, the Scottish Labour MSP branded Mr Farage a \"poisonous little man\" and accused him of running a \"campaign of dirt and smear\". First Minister Mr Swinney had earlier warned it was a \"two-horse race\" between the SNP and Reform UK, urging voters to \"defeat the gutter politics\" of Mr Farage. With less than a year to go before the Scottish parliament election, the result potentially offers a snapshot of how the political landscape north of the border could look in 2026. Mr Sarwar said: \"I think people need to change the script, because we've proven the pollsters wrong. \"We've proven the commentators wrong, we've proven the bookies wrong. We've proven John Swinney wrong and so many others wrong too.\""
    },
    {
        "title": "Musk says Trump appears in Epstein files and $150bn wiped off Tesla's value as row between them explodes",
        "description": "Elon Musk says Donald Trump appears in files relating to the disgraced paedophile financier Jeffrey Epstein.",
        "url": "https://news.sky.com/story/donald-trump-disappointed-with-elon-musk-after-he-turned-on-his-big-beautiful-bill-13379714",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-jeffrey-epstein_6935517.jpg?20250605215509",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-05 16:48:00",
        "Headline": "In a post on X, the tech billionaire said: \"@realDonaldTrump is in the Epstein files. That is the real reason they have not been made public.\" He gave no evidence for the claim. The White House described Musk's comments as \"unfortunate\".",
        "Content": " Elon Musk says Donald Trump appears in files relating to the disgraced paedophile financier Jeffrey Epstein. It's the latest in a string of barbs between the men as they appear to have dramatically fallen out in a public spat. In a post on X, the tech billionaire said: \"@realDonaldTrump is in the Epstein files. That is the real reason they have not been made public. \"Mark this post for the future. The truth will come out.\" He gave no evidence for the claim. Meanwhile, White House press secretary Karoline Leavitt dismissed the comment. In a statement, she said: \"This is an unfortunate episode from Elon, who is unhappy with the One Big Beautiful Bill [a Republican tax and spending bill] because it does not include the policies he wanted. \"The president is focused on passing this historic piece of legislation and making our country great again.\" Epstein killed himself in his jail cell in August 2019 while awaiting trial on charges of sex trafficking minors. Read more:Analysis: Trump v Musk has got very messy very quicklyJanuary 2024: Epstein list - Who is named in unsealed documents? Donald Trump has been named in previously released documents relating to Jeffrey Epstein. One Epstein accuser in 2016 said she spent several hours with the disgraced financier at a Trump casino but she did not say if she met Mr Trump and did not accuse him of any wrongdoing. Mr Trump once said he believed Epstein was a \"terrific guy\" but that they later fell out. The latest claims by Musk about the Epstein files tap into conspiracy theories that sensitive files the government possesses have not yet been released.  In another post on Thursday, Musk, the owner of social media platform X, attacked Mr Trump's tariffs, saying they \"will cause a recession in the second half of this year.\" The Tesla boss shared a post calling for Mr Trump's impeachment and asked whether it was \"time to create a new political party in America that actually represents the 80% in the middle\". Musk also said his company SpaceX will begin decommissioning its Dragon spacecraft \"immediately\" following Mr Trump's threats to cancel government contracts with Musk's businesses. Dragon is the only US spacecraft available to deliver crew to and from the International Space Station. The spat has already hit Tesla shares, which lost about $150bn (£111bn) in value, closing down 14.3% for the day. It comes after the president said he was \"disappointed\" with Musk after the entrepreneur publicly criticised Mr Trump's signature tax bill. The president suggested his former backer and adviser missed being in government and has \"Trump derangement syndrome\". He added: \"I'm very disappointed in Elon. I've helped Elon a lot.\"  In a Truth Social post, the US president said: \"Elon was 'wearing thin,' I asked him to leave, I took away his EV mandate that forced everyone to buy electric cars that nobody else wanted (that he knew for months I was going to do!), and he just went crazy!\". On Tuesday, the world's richest man called the president's tax and spending bill \"outrageous\" and a \"disgusting abomination\" - days after abruptly leaving his position spearheading the Department of Government Efficiency (DOGE). The bill, which includes multi-trillion-dollar tax breaks, was passed by the House Republicans in May and has been described by the president as a \"big, beautiful bill\". By contrast, Musk has called it the \"big, ugly bill\". Shortly after the president expressed his disappointment in Musk on Thursday, the SpaceX boss responded. \"False\", he wrote on his X platform. \"This bill was never shown to me even once and was passed in the dead of night so fast that almost no one in Congress could even read it!\" In another scathing post on X, Musk claimed responsibility for Donald Trump's re-election success. He wrote: \"Without me, Trump would have lost the election, Dems would control the House and the Republicans would be 51-49 in the Senate.\"  It came after Mr Trump told reporters the Tesla chief executive was unimpressed electric vehicle incentives were being debated in the Senate and could face being cut. Read more on Sky News:Russian ambassador partly blames UK for Ukrainian drone attackFarage 'genuinely sorry' over Reform chair's shock resignationJudge threatens to remove Sean 'Diddy' Combs from court Last Thursday, Musk revealed on X that his scheduled time as a \"special government employee\" was coming to an end. Before the news broke, Musk's father told Sky News his son was \"not a very good politician\". But speaking to Gillian Joseph on The World, Errol Musk insisted there was \"no rift between Elon and Donald Trump\"."
    },
    {
        "title": "Trump v Musk has got very messy very quickly, and TV's punchline writers will be the only winners",
        "description": "And so, in the end, it was the big, beautiful bill that prompted the big, beautiful bust-up almost everyone knew was coming.",
        "url": "https://news.sky.com/story/trump-v-musk-has-get-very-messy-very-quickly-and-tvs-punchline-writers-will-be-the-only-winners-13379865",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-musk-trump_6931566.jpg?20250530192043",
        "type": "Home",
        "Author": "Martha Kelner",
        "Date Published": "2025-06-05 21:55:00",
        "Headline": "This almighty row has all the hallmarks of an ugly celebrity breakup, but has implications far beyond their billionaire clique.",
        "Content": "\n          US correspondent\n              @marthakelner\n  And so, in the end, it was the big, beautiful bill that prompted the big, beautiful bust-up almost everyone knew was coming. Ever since the Trump and Musk alliance was formed almost a year ago, megalomaniac watchers the world over have been asking when and how it would end. Now we have our answer; 137 days into Trump's presidency and with the fire-powered ferocity of one of Musk's rocket launches. At times, it felt voyeuristic to watch, the kind of rubbernecking that takes place with the ugliest of celebrity breakups. It's a Brangelina inside the beltway, but with implications far beyond it. Because Musk was as close to the president as anyone outside his own family. He spent weekends living at Trump's Mar-a-Lago home, his mum attended parties there, his son wiped his bogies on the resolute desk. But like so many domestic disputes, it got very messy, very quickly. As always when Trump has something to say, he waits for the inevitable question. It came immediately after his meeting inside the Oval Office with German Chancellor Freidrich Merz. A journalist asked about Musk's criticism of his \"big, beautiful\" bill. Trump saw his opening. \"I've always liked Elon. I'd rather have him criticise me than the bill,\" he said, quickly noting that he and Musk had a great relationship. \"I don't know if we will anymore,\" he added. \n                  Serving coffee in America, under fear of death from the Taliban in Afghanistan\n                 \n                  Americans are wearing biggest smiles in NATO defence spending battle\n                 \n                  Musk says Trump appears in Epstein files and $150bn wiped off Tesla's value as row between them explodes\n                 Less than half an hour later, a post on X by Musk made it very apparent that they would, indeed, no longer have a great relationship. \"Without me, Trump would have lost the election,\" he wrote. It was a torpedo that unleashed an, at times, unhinged back and forth including an unfounded allegation from Musk about Trump being part of the \"Epstein files\". Just a week after Trump presented Musk with a golden key in a grand farewell, Musk was burning the house down. But this break up will affect everyone involved, not to mention the American public. Brand Trump will be damaged by the loss of Musk's endorsement and loyalty.  Read more on Sky News:Russian ambassador partly blames UK for Ukrainian drone attackFarage 'genuinely sorry' over Reform chair's shock resignationJudge threatens to remove Sean 'Diddy' Combs from court Republican politicians will be wary of angering Musk by voting for Trump's spending bill. The world's richest man has shown he is willing to put his money on the line in election races and the midterms are looming. The government's reliance on Musk's companies is also huge. Space X is the key player in space exploration and Musk has been providing invaluable advice to the White House on artificial intelligence and electric vehicles. What will now happen to the Department of Government efficiency?  Meanwhile shares are down significantly at all of Musk's companies with Trump likely to seek vengeance. There could also be an investigation, now, into allegations that Musk's drug use while in government was out of control. There are so many unknowns and one certainty - there are no winners here, apart from the comedians who trade in jokes about this pair of impulsive billionaires."
    },
    {
        "title": "Russian ambassador partly blames UK for Ukrainian drone attack",
        "description": "Russia's UK ambassador has told Sky News that Ukraine's recent attacks risk escalating the conflict to \"World War III\" as he partly blamed the UK.",
        "url": "https://news.sky.com/story/russian-ambassador-partly-blames-uk-for-ukrainian-drone-attack-13379594",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-andrei-kelin-russian_6935108.jpg?20250605143743",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-05 13:28:00",
        "Headline": "Andrei Kelin pointed the finger at the UK when he said Ukraine must have had assistance in the weekend's drone attacks.",
        "Content": " Russia's UK ambassador has told Sky News that Ukraine's recent attacks risk escalating the conflict to \"World War III\" as he partly blamed the UK. Andrei Kelin warned that Ukraine's actions \"are bringing the conflict to a different level of escalation\", in an interview with Sky News' Yalda Hakim, and said Kyiv should \"not try to engulf World War III\". \"That's the very worst case scenario that we can imagine,\" he said. More than a hundred Ukrainian drones were deployed inside Russia over the weekend, destroying more than 40 warplanes in an attack Volodymyr Zelenskyy said \"will undoubtedly be in history books\".  Mr Kelin pointed the finger at the UK when he said Ukraine must have had assistance in the attacks. \"[This] kind of attack involves, of course, provision of very high technology, so-called geospaced data, which only can be done by those who have it in possession. And this is London and Washington,\" he said.  \"I don't believe that America [is involved], that has been denied by President Trump, definitely, but it has not been denied by London. \n                  Americans are wearing biggest smiles in NATO defence spending battle\n                 \n                  Arsonist told to watch spy drama by Russian mercenary group before fire, court told\n                 \n                  Why Putin is in 'victim mode' over Ukraine's airbase drone attack\n                  \"We perfectly know how much London is involved, how deeply British forces are involved in working together with Ukraine.\" On Wednesday, Donald Trump said Vladimir Putin told him \"very strongly\" that Russia \"will have to respond to the recent attack on the airfields\". The US president said that he discussed the attack with Mr Putin during a phone call that lasted more than an hour. \"It was a good conversation, but not a conversation that will lead to immediate peace,\" he wrote. Mr Kelin repeated this sentiment, telling Sky News: \"It is up to the Ministry of Defence to make a right solution, but we have to respond to it.\" A Downing Street spokesperson said: \"We never comment on operational matters at home or abroad.\""
    },
    {
        "title": "Former girlfriend tells Diddy trial of sex with male escorts - as rapper is warned by judge",
        "description": "A former girlfriend of Sean \"Diddy\" Combs has told his sex trafficking trial how a whirlwind romance opened a \"Pandora's box\" of sex sessions with male escorts that she did not know how to stop.",
        "url": "https://news.sky.com/story/former-girlfriend-tells-diddy-trial-of-sex-with-male-escorts-as-rapper-is-warned-by-judge-13379819",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sean-diddy-combs-sex-trafficking-trial_6935407.jpg?20250605190740",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2025-06-05 20:14:00",
        "Headline": "\"Jane\" is one of three alleged victims giving evidence during Sean \"Diddy\" Combs's trial, and her allegations mirror those given by his former long-term partner Cassie Ventura.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n A former girlfriend of Sean \"Diddy\" Combs has told his sex trafficking trial how a whirlwind romance opened a \"Pandora's box\" of sex sessions with male escorts that she did not know how to stop. The witness, who is testifying under the pseudonym \"Jane\", alleges the hip-hop mogul coerced her into participating in drug-fuelled \"debauchery\" nights throughout their relationship, which began in 2021 and ended when he was arrested in September 2024. She began her evidence on a dramatic day at the Manhattan court, taking to the stand not long after Judge Arun Subramanian issued a warning to Combs's lawyers after seeing the rapper \"nodding vigorously\" towards the jury during earlier testimony. If the \"totally unacceptable\" behaviour happens again during the trial, the judge said, he could take steps to remove the defendant from the courtroom. Diddy trial day 17 - as it happened Jane is one of three alleged victims of Combs giving evidence during his trial, and her allegations mirror those given by his former long-term partner Cassie Ventura. Both women said the rapper would sit in the corner and masturbate as he watched them have sex, and that the sessions would often last for more than 24 hours with \"no sleep\". Combs, 55, is accused of sex trafficking, racketeering conspiracy and transportation to engage in prostitution. He has pleaded not guilty to all charges. In court on Thursday, he often looked straight at Jane as she gave evidence. The single mother began her testimony by describing her whirlwind romance with Combs, saying he made her feel special and showered her with love and gifts in the first few months from January 2021. Asked what happened in May 2021, she bowed her head and became emotional as she told the court how Combs started to talk about fantasies of role play with other men. One night, he told her he could make the fantasy a reality, she says - and did so straight away. Jane told the court she agreed to having sex with the male escort because she wanted to make Combs happy - and even \"felt excited\" afterwards after doing something \"taboo\". However, she said she thought it was a one-off. Instead, \"it opened a Pandora's box\" and \"set the tone\" going forward, she said. After that first night in May 2021, Jane said she was having sex with other men \"90%\" of the time. Asked if this is what she wanted, she said it wasn't, but that she \"went along with it because I loved him at this point\". Combs kept pushing her into these sex sessions, and she felt \"obligated\" to go along with it, she said. He also had control over her life in other ways, she told the court, including by paying the rent on her home. Read more:Everything you need to know about the Sean Combs trialThe rise and fall of Sean 'Diddy' CombsWhat we learned from Cassie's testimony But as their relationship continued, she said she did tell him, \"many times\", she did not want to keep having sex with other men, but he would dismiss her, make her feel uncomfortable, or seemingly threaten to stop paying her rent. These encounters were referred to as \"debauchery\" or hotel nights, she told the court, and they always followed the same pattern - \"hotel suites, red lights, music, lotions and alcohol, there would be bed sheets covering everything, blankets and towels, because of the excessive use of baby oil everywhere\". Jane said she would \"have drugs in my system\" and wear \"provocative\" lingerie and \"high stripper shoes\", and Combs would ask her to pour baby oil on the men and on herself. These sessions typically lasted between 24 and 30 hours, she said, with \"no sleep\". In her testimony, Cassie Ventura told of similar sexual encounters, which Combs referred to as \"freak offs\", she said. Jane's evidence is set to continue on Friday and on several days next week."
    },
    {
        "title": "Boy, 16, dies in hit-and-run as man arrested",
        "description": "A 20-year-old man has been arrested on suspicion of murder after a teenager was killed in a hit-and-run collision in Sheffield.",
        "url": "https://news.sky.com/story/electric-bike-pedestrian-and-car-collision-leaves-teen-dead-and-another-seriously-injured-13379359",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sheffield-fatal-crash_6934832.jpg?20250605063650",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-05 00:43:00",
        "Headline": "Three people, a 45-year-old woman and two men aged 26 and 46, have been arrested on suspicion of assisting an offender and remain in custody.",
        "Content": " A 20-year-old man has been arrested on suspicion of murder after a teenager was killed in a hit-and-run collision in Sheffield. Emergency services responded shortly after 4.50pm on Wednesday to reports of an accident in Staniforth Road in the Darnall area of the city. South Yorkshire Police said it is understood that a grey Audi drove towards three electric bikes, colliding with one rider. The car continued to travel following the crash with the electric bike and was further involved in a collision with a teenage pedestrian.  The driver of the Audi failed to stop at the scene. Graphic CCTV footage of the incident appears to show the car veer into the opposite carriageway before hitting the 16-year-old pedestrian at speed. The boy was taken to hospital. Despite emergency treatment, he died as a result of his injuries. The boy's family has been informed and are being supported by specialist officers. An 18-year-old man, who was the rider of the electric bike, remains in hospital with serious injuries which are not thought to be life-threatening. A 20-year-old man in Kent has been arrested on suspicion of murder. He remains in police custody. Three people, a 45-year-old woman and two men aged 26 and 46, have been arrested on suspicion of assisting an offender. All three remain in custody. Read more from Sky News:Weight loss jab warningTrump signs travel bans Senior Investigating Officer in the case, Detective Chief Inspector Benjamin Wood, said: \"This is a tragic incident in which an entirely innocent bystander, who was going about his daily business, has sadly lost his life. Our thoughts are with the boy's loved ones, and we remain focused on securing justice for them. \"We know that this incident will have caused concern in the local community, and we have a team of detectives working at pace to piece together the circumstances which unfolded. \"We're aware of footage being shared online and I'd like to reiterate our message to the public to withhold from speculating or circulating videos which may cause distress to the boy's family. \"If you have any footage, imagery or information that may help our investigation then please share this directly with us - it may form an important part of our enquiries. We are also keen to hear from the riders of two electric bikes who were in the area at the time of the incident.\""
    },
    {
        "title": "Madeleine McCann: Investigators end latest searches for missing British girl",
        "description": "Investigators in Portugal have ended their latest searches for Madeleine McCann after three days.",
        "url": "https://news.sky.com/story/madeleine-mccann-investigators-end-latest-searches-for-missing-british-girl-13379673",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-madeleine-mccann-portugal_6935293.jpg?20250605171324",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-05 15:55:00",
        "Headline": "Police have been scouring scrubland and abandoned structures near the town of Praia da Luz, where the three-year-old British girl went missing 18 years ago.",
        "Content": "Investigators in Portugal have ended their latest searches for Madeleine McCann after three days. Police have been scouring scrubland and abandoned structures near the town of Praia da Luz, where the three-year-old British girl went missing 18 years ago. Officers could be seen holding pitchforks as they combed land in an area on the outskirts of Lagos in the Algarve on Thursday. Search teams involving German and Portuguese officers, as well as firefighters, used pickaxes and shovels to dig undergrowth, and a digger was again used to remove rubble from an abandoned structure at the site. They spent two days focusing on one particular derelict building, using a ground-penetrating radar on the cobbled ground after clearing the area of debris and vegetation. British officers have not been present for the latest searches, the Metropolitan Police said. German and Portuguese investigators could be seen shaking hands and embracing as the search drew to a close. \n                  Madeleine McCann search: Abandoned buildings examined as ground radar may be deployed\n                 \n                  Madeleine McCann: New search under way brings fresh hope - but there are big unanswered questions\n                 \n                  What we know about new Madeleine McCann searches in Portugal\n                 The officers stood in a circle for a debrief before taking part in a round of applause. Authorities have not yet commented on the ending of the latest searches. So far, officers have not announced they have found anything of significance. Read more: What we know about new searches German authorities had requested the search as part of their continued attempts to find evidence to implicate suspect Christian B. The suspect, who cannot be fully identified under German law, is coming to the end of a prison sentence for the rape of an elderly American woman in Praia da Luz in 2005. He has not been charged or indicted over Madeleine's disappearance and denies any involvement. It comes 18 years after three-year-old Madeleine disappeared from Praia da Luz while on holiday with her family in 2007. She vanished after she was left sleeping while her parents, Kate and Gerry McCann, went for dinner in a nearby restaurant."
    },
    {
        "title": "Equalities watchdog writes to GMB union over sexual harassment claims",
        "description": "The Equality and Human Rights Commission (EHRC) has formally written to the GMB union asking for information on how it's complying with the Equality Act following allegations of sexual harassment, victimisation and sex discrimination, Sky News understands.",
        "url": "https://news.sky.com/story/equalities-watchdog-writes-to-gmb-union-over-sexual-harassment-claims-13379813",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-gmb-union_6806577.jpg?20250121165230",
        "type": "Home",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-06-05 19:55:00",
        "Headline": "It's the first step in a possible investigation by the equalities watchdog into activity at the union over systemic sexism, and GMB has just under a month to respond.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n The Equality and Human Rights Commission (EHRC) has formally written to the GMB union asking for information on how it's complying with the Equality Act following allegations of sexual harassment, victimisation and sex discrimination, Sky News understands. Former staffers and members of the union had launched an official complaint to the equalities watchdog earlier this year over claims of institutional sexism and bullying, but this is the first time it has deemed them serious enough to start inquiries. Reform chair resigns - politics latest It's the first step in a possible investigation by the equalities watchdog into activity at the union over systemic sexism, and GMB has just under a month to respond. GMB has said it categorically denies claims of a culture of bullying or sexism within the union. \"GMB has been contacted by the EHRC with a request for information,\" said a statement. \"This is a procedural matter and not an investigation. \"We look forward to responding properly and professionally to their request.\" Read more:Sexism 'worse than ever' at GMB 'Institutionally sexist' In the original complaint, which Sky News has seen, a number of women allege there is a \"pattern of victimisation and harassment against women who speak out\" about wrongdoing inside the Labour-backed union. They argue it could be a breach of GMB's duties under the Equality Act. GMB is one of the biggest unions in the UK, but has been struggling with its reputation for years. Four years ago, a damning report written by Karon Monaghan KC branded the union \"institutionally sexist\" and a number of women who complained to the EHRC insist the union hasn't changed. GMB represents about 630,000 workers in the UK and is one of the Labour Party's major funders. Sir Keir Starmer gave the keynote speech at the GMB conference a year before the last general election and numerous cabinet ministers, including the prime minister, are members. This weekend, the union, which prides itself on fighting for people in their own workplaces, will once again meet for its annual conference in Brighton - but this time with looming questions over how fairly it treats its own."
    },
    {
        "title": "Cancer patients missing holidays or travelling uninsured amid unfair insurance costs, charity says",
        "description": "Cancer patients are being priced out of holidays because they can't afford the inflated insurance premiums companies are charging, a charity has said.",
        "url": "https://news.sky.com/story/cancer-patients-missing-holidays-or-travelling-uninsured-amid-unfair-insurance-costs-charity-says-13379607",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-josh-cull-millie-tharakan_6935152.jpg?20250605151642",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-05 13:57:00",
        "Headline": "Just having a cancer diagnosis can mean being faced with increased travel insurance costs, Maggie's warns, pointing to one patient quoted £3,000 for a trip to Asia after recovering from the deadly illness.",
        "Content": "Cancer patients are being priced out of holidays because they can't afford the inflated insurance premiums companies are charging, a charity has said. Patients and people in recovery from the deadly disease are \"frequently\" refused cover or quoted unaffordable premiums, forcing some to travel without insurance or miss trips altogether, according to Maggie's cancer support charity. Prohibitively high prices mean they cannot visit friends and family abroad and are forced to avoid business travel, the charity said. Josh Cull, from Bournemouth, was quoted a minimum of £3,000 for insurance when he decided to visit South Asia after he had recovered from \"completely unexpected\" brain cancer. Josh, who was diagnosed with a medulloblastoma brain tumour in 2021 when he was 25, said he \"went through chemotherapy and radiotherapy as well as major surgery to remove the tumour, which affected my eyesight and my ability to walk\". Initially told he had only three months to live, Josh, now 28, admitted he \"was lucky to come out the other side, and the trip [with his fiancee and brother] was supposed to be a reward for everything we'd been through\". But, he said, he \"couldn't get an insurance quote for less than £3,000\", despite having been out of treatment \"for two-and-a-half years\", and being \"healthy and fully recovered\". \n                  Jessie J diagnosed with early breast cancer\n                 \n                  Exercise may benefit colon cancer patients as much as some drugs, study finds\n                 \n                  'Transformational' new drug could stop breast cancer tumours before they grow, trial finds\n                 \"Simply having a cancer diagnosis in my past meant the insurance was extremely expensive,\" he said. \"It felt so unfair. I ended up travelling uninsured because I just couldn't afford the cover.\"  Millie Tharakan, 72, from north London, was first diagnosed with breast cancer in 2008, and her cancer returned in 2020. She has since been receiving immunotherapy and has regular CT scans to monitor her condition. £1,300 bill was 'so unfair' Ms Tharakan was \"steady\" and fit to fly, her oncologist said, but was forced to pay £1,300 for annual cover for travel insurance in Europe. The mother of three and grandmother of five said: \"We wanted to go on a family holiday and given my health I didn't feel comfortable travelling without insurance, but it's been incredibly stressful. \"Most insurance companies I spoke to wouldn't even consider covering me. It feels so unfair.\" 'Inflated' insurance costs Maggie's chief executive, Dame Laura Lee, said they are hearing from growing numbers of cancer sufferers about the diffculties they face \"trying to obtain travel insurance, and the emotional distress this can cause\". \"The last thing people should have to think about is inflated insurance costs when they should be focused on recovering from treatment and living well with cancer,\" she said. \"Travelling and taking holidays can be so important for someone's wellbeing and recovery, and it is extremely unfair that people with cancer are being priced out of the opportunity to visit family and friends abroad or simply explore the world.\" Read more:Jessie J: 'I have breast cancer'Exercise 'as good as drugs''Transformational' breast cancer drug A spokesperson for the Association of British Insurers (ABI) said the group understands how beneficial travel and holidays are for cancer patients and are \"committed to supporting customers who have or have had cancer\". \"Unfortunately, people with pre-existing medical conditions may be more likely to need emergency medical treatment whilst abroad, which can come at a significant cost,\" they added.  Insurers will take this, and other issues, into account, when deciding whether to offer \"suitable\" cover. \"If an insurer is unable to offer you cover because of a pre-existing medical condition, they will point you to specialist providers who can help you find an appropriate policy.\" The charity has called on Treasury minister Emma Reynolds to investigate and wants ministers to work with travel insurance companies, the Financial Conduct Authority, and cancer patients to get a \"fairer deal\" for insurance. The Treasury has been approached for comment."
    },
    {
        "title": "Scottish Labour win Hamilton, Larkhall and Stonehouse by-election as SNP suffer shock defeat",
        "description": "Scottish Labour's Davy Russell has won the Hamilton, Larkhall and Stonehouse by-election.",
        "url": "https://news.sky.com/story/scottish-labour-win-hamilton-larkhall-and-stonehouse-by-election-13379805",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-davy-russell-scottish-labour_6935574.jpg?20250606021146",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-06-05 23:00:00",
        "Headline": "Voters in South Lanarkshire went to the polls on Thursday following the death of SNP MSP Christina McKelvie.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n  Scottish Labour's Davy Russell has won the Hamilton, Larkhall and Stonehouse by-election. Mr Russell took top spot with 8,559 votes. The SNP placed second with 7,957 votes, with Reform UK closely taking third with 7,088 votes. The new MSP said he was \"proud\" to have been elected, adding: \"I said in this campaign that I will put this community, our community first. \"I will work every single day to do that.\" The by-election was called following the death of SNP MSP Christina McKelvie. The Scottish government minister died in March at the age of 57, having last year taken medical leave to undergo treatment for secondary breast cancer. South Lanarkshire councillor Katy Loudon had hoped to retain the Holyrood seat for the SNP, given her party's heavy losses to Labour at last year's UK general election. \n                  Hamilton, Larkhall and Stonehouse by-election: Polls close and count begins to replace late MSP\n                 \n                  Liz Truss was 'right' to be radical, but the numbers need to 'add up', shadow chancellor Sir Mel Stride tells Sky News\n                 \n                  Hamilton, Larkhall and Stonehouse by-election: Who are the candidates?\n                 First Minister John Swinney congratulated Mr Russell following the result. In a post on X, the SNP leader said Ms Loudon had \"fought a superb SNP campaign\". He added: \"We have made progress since the election last year but not enough. We still have work to do and we will do it.\" All eyes were also on Reform UK and whether it would enjoy a \"tartan bounce\" in light of the party's recent slew of local election wins in England. With Reform UK never having won an election in Scotland, party deputy leader Richard Tice said candidate Ross Lambie coming in third was a \"massive boost for us\". He added: \"It's a fantastic result, just a few hundred votes away from the SNP, nobody predicted that. \"I think that sets us up with excitement and momentum for the next 11 months into the Holyrood elections.\" Mr Russell said the constituents had voted to \"take a new direction\" with his party. He added: \"Like the people here in Hamilton, Larkhall and Stonehouse, and right across Scotland, we all feel we have been let down by the SNP. \"They've broken our NHS, wasted our money, and after nearly two decades they don't deserve another chance.\" Mr Russell said the community had also \"sent a message\" to Reform UK leader Nigel Farage \"and his mob tonight\". He added: \"The poison of Reform isn't us, it isn't Scotland, and we don't want your division here. \"Reform have no real answers to the issues we face, and they can't beat the SNP here or replace them across Scotland.\" Mr Russell said his party was ready to \"fix\" the NHS and \"end the SNP's addiction to wasting your money\". He added: \"The road to a new direction for Scotland in 2026 - with Anas Sarwar as first minister and a Scottish Labour government - begins right here. So, let's go and win it together.\" Ten candidates went head-to-head in the Holyrood by-election: • Collette Bradley, Scottish Socialist Party - 278 votes• Andy Brady, Scottish Family Party - 219 votes• Ross Lambie, Reform UK - 7,088 votes• Katy Loudon, Scottish National Party (SNP) - 7,957 votes• Janice MacKay, UK Independence Party (UKIP) - 50 votes• Ann McGuinness, Scottish Green Party - 695 votes• Aisha Mir, Scottish Liberal Democrats - 533 votes• Richard Nelson, Scottish Conservative and Unionist Party - 1,621 votes• Davy Russell, Scottish Labour Party - 8,559 votes• Marc Wilkinson, Independent - 109 votes The votes were verified and manually counted at South Lanarkshire Council headquarters in Hamilton. Campaigning became heated in the run up to the by-election, with Reform UK accused of running a \"racist\" ad on Facebook against Scottish Labour leader Anas Sarwar. Reform leader Mr Farage continued to double down, accusing his rival of \"sectarian politics\". Read more from Sky News:'Farage could become PM - this is how Labour can stop him'Prisoners to be transferred to lower security jails In response, the Scottish Labour MSP branded Mr Farage a \"poisonous little man\" and accused him of running a \"campaign of dirt and smear\". First Minister Mr Swinney had earlier warned it was a \"two-horse race\" between the SNP and Reform UK, urging voters to \"defeat the gutter politics\" of Mr Farage. With less than a year to go before the Scottish parliament election, the result potentially offers a snapshot of how the political landscape north of the border could look in 2026. Mr Sarwar said: \"I think people need to change the script, because we've proven the pollsters wrong. \"We've proven the commentators wrong, we've proven the bookies wrong. We've proven John Swinney wrong and so many others wrong too.\""
    },
    {
        "title": "Labour pledges to end 'corridor care' and long waits with almost £450m NHS investment in England",
        "description": "Nearly &#163;450m is being invested in the NHS in England to cut hospital waiting times and tackle persistently failing trusts, the health secretary has announced.",
        "url": "https://news.sky.com/story/labour-pledges-to-end-corridor-care-and-long-waits-with-almost-163450m-nhs-investment-in-england-13379868",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-ambulances-nhs_6793345.jpg?20250107083117",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-05 22:29:00",
        "Headline": "The new Urgent and Emergency Care Plan for England says more needs to be done to drive down long waits, cut delayed discharges and improve care for patients.",
        "Content": "Nearly £450m is being invested in the NHS in England to cut hospital waiting times and tackle persistently failing trusts, the health secretary has announced. Wes Streeting says his NHS reforms aim to deliver around 40 new centres to fast-track treatment for patients, up to 15 mental health crisis assessment units and almost 500 new ambulances. It is part of an attempt to shift patients away from A&E and avoid unnecessary hospital admissions. \"No patient should ever be left waiting for hours in hospital corridors or for an ambulance which ought to arrive in minutes,\" said Mr Streeting. \"The package of investment and reforms we are announcing today will help the NHS treat more patients in the community, so they don't end up stuck on trolleys in A&E,\" he added.  In an example of the challenge facing the health secretary, Sky News on Wednesday revealed the scale of England's mental health crisis, exacerbated by a shortage of specialist beds and an overwhelmed social care network. The new Urgent and Emergency Care Plan for England says more needs to be done to drive down long waits, cut delayed discharges and improve care for patients. \n                  Weight loss jab warning from health watchdog over unborn babies\n                 \n                  Kyle Enos: Man who made and sold poisonous diet pills is jailed\n                 \n                  New blood test to 'revolutionise' NHS cancer treatment\n                 The document requires Trusts to reduce the number of patients waiting over 12 hours and make progress on \"eliminating corridor care\". It is estimated \"over 800,000 people a month will receive more timely care\". A&E league tables published A&E \"league tables\" will be published to drive up performance, including driving down delayed discharges from hospital. This can often impact elderly people when they are fit to leave but have additional care needs which require the involvement of social care teams. The plan also sets out aims to cut ambulance waiting times for category 2 patients - like those suffering stroke, heart attack, sepsis or major trauma - from 35 to 30 minutes. A previous target of 18 minutes has been repeatedly missed. Trusts have also been told to tackle lengthy ambulance handover delays by meeting a maximum 45-minute target for patients to enter A&E. The aim is to avoid a repeat of a crisis last winter when patients were waiting hours for beds and regularly being treated in corridors - so-called corridor care. Among the other plans revealed by NHS England are: virtual wards, where patients are monitored by hospital staff from their home, and a greater role for paramedics and urgent community response teams to treat people in the community to avoid hospital admission.  Some reforms 'lack ambition' Royal College of Emergency Medicine president Dr Adrian Boyle accepted the plan had \"some good and some bad\" points but also that NHS England had acknowledged \"the shameful situation being experienced by patients and clinicians across the country's emergency departments\". In a statement, Mr Boyle said: \"Some parts lack ambition - for example accepting that 10% of people will face A&E waits of more than 12 hours, when no patient should. \"Also maintaining the four-hour standard at 78% when the stated aim is that 95% of patients should move through the emergency department within this time - something which hasn't happened for a decade.\" Read more:A&E waits linked to deathsNHS waiting list increases Association of Ambulance Chief Executives managing director Anna Parry said: \"Handover delays have the greatest detrimental impact on ambulance resources and create unnecessary delays and additional harm for thousands of patients each year. \"The elimination of corridor care and the focus on reducing 12-hour waits at emergency departments is also welcomed.\" The Liberal Democrats broadly welcomed the plans but called on ministers to follow through on their promises. \"Patients have heard these kinds of promises before only to be led up the garden path,\" said Lib Dem health spokesperson Helen Morgan MP. \"The misery in our A&Es will only be prolonged if they continue to move at a snail's pace on social care,\" she added."
    },
    {
        "title": "Boy, 16, dies in hit-and-run as man arrested",
        "description": "A 20-year-old man has been arrested on suspicion of murder after a teenager was killed in a hit-and-run collision in Sheffield.",
        "url": "https://news.sky.com/story/electric-bike-pedestrian-and-car-collision-leaves-teen-dead-and-another-seriously-injured-13379359",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sheffield-fatal-crash_6934832.jpg?20250605063650",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-05 00:43:00",
        "Headline": "Three people, a 45-year-old woman and two men aged 26 and 46, have been arrested on suspicion of assisting an offender and remain in custody.",
        "Content": " A 20-year-old man has been arrested on suspicion of murder after a teenager was killed in a hit-and-run collision in Sheffield. Emergency services responded shortly after 4.50pm on Wednesday to reports of an accident in Staniforth Road in the Darnall area of the city. South Yorkshire Police said it is understood that a grey Audi drove towards three electric bikes, colliding with one rider. The car continued to travel following the crash with the electric bike and was further involved in a collision with a teenage pedestrian.  The driver of the Audi failed to stop at the scene. Graphic CCTV footage of the incident appears to show the car veer into the opposite carriageway before hitting the 16-year-old pedestrian at speed. The boy was taken to hospital. Despite emergency treatment, he died as a result of his injuries. The boy's family has been informed and are being supported by specialist officers. An 18-year-old man, who was the rider of the electric bike, remains in hospital with serious injuries which are not thought to be life-threatening. A 20-year-old man in Kent has been arrested on suspicion of murder. He remains in police custody. Three people, a 45-year-old woman and two men aged 26 and 46, have been arrested on suspicion of assisting an offender. All three remain in custody. Read more from Sky News:Weight loss jab warningTrump signs travel bans Senior Investigating Officer in the case, Detective Chief Inspector Benjamin Wood, said: \"This is a tragic incident in which an entirely innocent bystander, who was going about his daily business, has sadly lost his life. Our thoughts are with the boy's loved ones, and we remain focused on securing justice for them. \"We know that this incident will have caused concern in the local community, and we have a team of detectives working at pace to piece together the circumstances which unfolded. \"We're aware of footage being shared online and I'd like to reiterate our message to the public to withhold from speculating or circulating videos which may cause distress to the boy's family. \"If you have any footage, imagery or information that may help our investigation then please share this directly with us - it may form an important part of our enquiries. We are also keen to hear from the riders of two electric bikes who were in the area at the time of the incident.\""
    },
    {
        "title": "Cancer patients missing holidays or travelling uninsured amid unfair insurance costs, charity says",
        "description": "Cancer patients are being priced out of holidays because they can't afford the inflated insurance premiums companies are charging, a charity has said.",
        "url": "https://news.sky.com/story/cancer-patients-missing-holidays-or-travelling-uninsured-amid-unfair-insurance-costs-charity-says-13379607",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-josh-cull-millie-tharakan_6935152.jpg?20250605151642",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-05 13:57:00",
        "Headline": "Just having a cancer diagnosis can mean being faced with increased travel insurance costs, Maggie's warns, pointing to one patient quoted £3,000 for a trip to Asia after recovering from the deadly illness.",
        "Content": "Cancer patients are being priced out of holidays because they can't afford the inflated insurance premiums companies are charging, a charity has said. Patients and people in recovery from the deadly disease are \"frequently\" refused cover or quoted unaffordable premiums, forcing some to travel without insurance or miss trips altogether, according to Maggie's cancer support charity. Prohibitively high prices mean they cannot visit friends and family abroad and are forced to avoid business travel, the charity said. Josh Cull, from Bournemouth, was quoted a minimum of £3,000 for insurance when he decided to visit South Asia after he had recovered from \"completely unexpected\" brain cancer. Josh, who was diagnosed with a medulloblastoma brain tumour in 2021 when he was 25, said he \"went through chemotherapy and radiotherapy as well as major surgery to remove the tumour, which affected my eyesight and my ability to walk\". Initially told he had only three months to live, Josh, now 28, admitted he \"was lucky to come out the other side, and the trip [with his fiancee and brother] was supposed to be a reward for everything we'd been through\". But, he said, he \"couldn't get an insurance quote for less than £3,000\", despite having been out of treatment \"for two-and-a-half years\", and being \"healthy and fully recovered\". \n                  Jessie J diagnosed with early breast cancer\n                 \n                  Exercise may benefit colon cancer patients as much as some drugs, study finds\n                 \n                  'Transformational' new drug could stop breast cancer tumours before they grow, trial finds\n                 \"Simply having a cancer diagnosis in my past meant the insurance was extremely expensive,\" he said. \"It felt so unfair. I ended up travelling uninsured because I just couldn't afford the cover.\"  Millie Tharakan, 72, from north London, was first diagnosed with breast cancer in 2008, and her cancer returned in 2020. She has since been receiving immunotherapy and has regular CT scans to monitor her condition. £1,300 bill was 'so unfair' Ms Tharakan was \"steady\" and fit to fly, her oncologist said, but was forced to pay £1,300 for annual cover for travel insurance in Europe. The mother of three and grandmother of five said: \"We wanted to go on a family holiday and given my health I didn't feel comfortable travelling without insurance, but it's been incredibly stressful. \"Most insurance companies I spoke to wouldn't even consider covering me. It feels so unfair.\" 'Inflated' insurance costs Maggie's chief executive, Dame Laura Lee, said they are hearing from growing numbers of cancer sufferers about the diffculties they face \"trying to obtain travel insurance, and the emotional distress this can cause\". \"The last thing people should have to think about is inflated insurance costs when they should be focused on recovering from treatment and living well with cancer,\" she said. \"Travelling and taking holidays can be so important for someone's wellbeing and recovery, and it is extremely unfair that people with cancer are being priced out of the opportunity to visit family and friends abroad or simply explore the world.\" Read more:Jessie J: 'I have breast cancer'Exercise 'as good as drugs''Transformational' breast cancer drug A spokesperson for the Association of British Insurers (ABI) said the group understands how beneficial travel and holidays are for cancer patients and are \"committed to supporting customers who have or have had cancer\". \"Unfortunately, people with pre-existing medical conditions may be more likely to need emergency medical treatment whilst abroad, which can come at a significant cost,\" they added.  Insurers will take this, and other issues, into account, when deciding whether to offer \"suitable\" cover. \"If an insurer is unable to offer you cover because of a pre-existing medical condition, they will point you to specialist providers who can help you find an appropriate policy.\" The charity has called on Treasury minister Emma Reynolds to investigate and wants ministers to work with travel insurance companies, the Financial Conduct Authority, and cancer patients to get a \"fairer deal\" for insurance. The Treasury has been approached for comment."
    },
    {
        "title": "Russian ambassador partly blames UK for Ukrainian drone attack",
        "description": "Russia's UK ambassador has told Sky News that Ukraine's recent attacks risk escalating the conflict to \"World War III\" as he partly blamed the UK.",
        "url": "https://news.sky.com/story/russian-ambassador-partly-blames-uk-for-ukrainian-drone-attack-13379594",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-andrei-kelin-russian_6935108.jpg?20250605143743",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-05 13:28:00",
        "Headline": "Andrei Kelin pointed the finger at the UK when he said Ukraine must have had assistance in the weekend's drone attacks.",
        "Content": " Russia's UK ambassador has told Sky News that Ukraine's recent attacks risk escalating the conflict to \"World War III\" as he partly blamed the UK. Andrei Kelin warned that Ukraine's actions \"are bringing the conflict to a different level of escalation\", in an interview with Sky News' Yalda Hakim, and said Kyiv should \"not try to engulf World War III\". \"That's the very worst case scenario that we can imagine,\" he said. More than a hundred Ukrainian drones were deployed inside Russia over the weekend, destroying more than 40 warplanes in an attack Volodymyr Zelenskyy said \"will undoubtedly be in history books\".  Mr Kelin pointed the finger at the UK when he said Ukraine must have had assistance in the attacks. \"[This] kind of attack involves, of course, provision of very high technology, so-called geospaced data, which only can be done by those who have it in possession. And this is London and Washington,\" he said.  \"I don't believe that America [is involved], that has been denied by President Trump, definitely, but it has not been denied by London. \n                  Americans are wearing biggest smiles in NATO defence spending battle\n                 \n                  Arsonist told to watch spy drama by Russian mercenary group before fire, court told\n                 \n                  Why Putin is in 'victim mode' over Ukraine's airbase drone attack\n                  \"We perfectly know how much London is involved, how deeply British forces are involved in working together with Ukraine.\" On Wednesday, Donald Trump said Vladimir Putin told him \"very strongly\" that Russia \"will have to respond to the recent attack on the airfields\". The US president said that he discussed the attack with Mr Putin during a phone call that lasted more than an hour. \"It was a good conversation, but not a conversation that will lead to immediate peace,\" he wrote. Mr Kelin repeated this sentiment, telling Sky News: \"It is up to the Ministry of Defence to make a right solution, but we have to respond to it.\" A Downing Street spokesperson said: \"We never comment on operational matters at home or abroad.\""
    },
    {
        "title": "Prisoners to be transferred to lower security jails to ease overcrowding",
        "description": "Prisoners are to be transferred to lower security jails in an effort to ease overcrowding, as part of a new measure quietly unveiled by the government.",
        "url": "https://news.sky.com/story/prisoners-to-be-transferred-to-lower-security-jails-to-ease-overcrowding-13379713",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prison-officer-prisons_6932011.jpg?20250531160740",
        "type": "UK",
        "Author": "Mollie Malone",
        "Date Published": "2025-06-05 16:48:00",
        "Headline": "From Monday, offenders serving standard sentences can be transferred to open or category D prisons up to three years earlier than previously.",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n Prisoners are to be transferred to lower security jails in an effort to ease overcrowding, as part of a new measure quietly unveiled by the government. Sky News understands that as of Monday, offenders serving standard sentences can be transferred to open or category D prisons up to three years earlier than previously, to free up space in higher security jails. Open prisons have minimal security and allow eligible prisoners to spend time on day release away from the prison on licence conditions to carry out work or education. It's unclear how many prisoners this will apply to, but the majority of those in prison custody serve standard determinate sentences. This is an extension of a policy which previously existed, as the prison service is warned of urgent capacity pressures. Exemptions will include sex offenders, terrorists, violent criminals, those convicted of stalking, and prisoners serving a sentence of over four years. It could mean those convicted of domestic abuse-related crimes are eligible for transfer to open prisons. The Prison Governors' Association told Sky News it has \"concerns\" about the measure. \"This would still mean that after just two weeks in prison a man serving a seven and a half year prison sentence could be moved to an open prison, where there are no physical barriers like high walls, fences, secure gates and minimal staff supervision that could prevent prisoners from simply walking out,\" the association said in a statement. Prison governors will have some discretion to judge the risk of the move, but it's understood the \"presumption\" will be that the transfer should take place. Despite early release measures, prisons in England and Wales continue to face chronic overcrowding. The male estate is currently operating at around 98% capacity. Read more from Sky News:Russian ambassador partly blames UK for Ukrainian drone attackTrump 'disappointed' with Musk after he turned on 'beautiful bill' This latest measure comes after the government accepted recommendations made in the sentencing review, which will see almost 10,000 fewer people sent to prison in the next three years. However, these measures will take time to become legislation. A Ministry of Justice spokesperson said: \"We are building new prisons and are on track for 14,000 places by 2031 - the largest expansion since the Victorians. Our sentencing reforms will also force prisoners to earn their way to release or face longer in jail for bad behaviour, while ensuring the most dangerous offenders can be kept off the street. \"Only certain thoroughly risk-assessed offenders are eligible for moves to open prison and anyone found breaching the rules can be immediately returned to a closed prison.\""
    },
    {
        "title": "Bonuses for water bosses end - as six firms found guilty of most serious pollution breaches",
        "description": "Bosses at six water companies have been banned from receiving bonuses for the last financial year under new legislation that comes into force on Friday.",
        "url": "https://news.sky.com/story/bonuses-for-water-bosses-end-as-six-firms-found-guilty-of-most-serious-pollution-breaches-13379668",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-water-tap_6935279.jpg?20250605170452",
        "type": "UK",
        "Author": "Paul Kelso",
        "Date Published": "2025-06-05 21:30:00",
        "Headline": "Thames Water, Yorkshire Water, Anglian Water, Wessex Water, United Utilities and Southern Water all face the restriction on performance-related pay but Ofwat cannot prevent lost earnings being replaced by increased salaries.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n Bosses at six water companies have been banned from receiving bonuses for the last financial year under new legislation that comes into force on Friday. Senior executives at Thames Water, Yorkshire Water, Anglian Water, Wessex Water, United Utilities and Southern Water all face the restriction on performance-related pay for breaches of environmental, customer service or financial standards. All six companies committed the most serious 'Category 1' pollution breaches, with Thames responsible for six such incidents, as well as breaching financial resilience regulations when its credit rating was downgraded.  The nine largest water and wastewater providers paid a total of £112m in executive bonuses since 2014-15, though the 2023-24 total of £7.6m was the smallest annual figure in a decade. The new rules give water industry regulator Ofwat the power to retrospectively prevent bonuses paid in cash, shares or long-term incentive schemes to chief executives and chief financial officers for breaches in a given financial year. Ofwat cannot, however, prevent lost bonuses being replaced by increased salaries, as routinely happened in the banking sector when bonus pots were capped following the financial crisis. Government sources insist they do not want to cap executive pay, but suggested the regulator could consider expanding its powers to ensure any remuneration is covered by shareholder funds rather than customer bills. \n                  Thames Water creditors line up McTighe to spearhead rescue deal\n                 \n                  Thames crisis underlines scale of water industry turnaround task\n                 \n                  Thames Water survival hopes suffer fresh blow\n                 Water suppliers have routinely defended executive bonuses and pay on the grounds that awards are necessary to attract and retain the best talent to lead complex, multi-stakeholder organisations. Thames Water's chief executive, Chris Weston, was paid a bonus of £195,000 three months after joining the company in January 2024, taking his total remuneration to £2.3m.   Last month, the company withdrew plans to pay \"retention\" bonuses of up to 50% of annual salary to senior executives after securing an emergency £3bn loan intended to keep the company afloat into next year. Earlier this week, its preferred equity partner, US private equity giant KKR, walked away from a deal to inject £4bn despite direct lobbying from 10 Downing Street, in part because of concern over the negative political sentiment towards the water industry. The decision came a few days after Thames was hit with a record fine of £123m for multiple pollution incidents and breaching dividend payment rules. Welcoming the bonus ban, the Environment Secretary Steve Reed said: \"Water company bosses, like anyone else, should only get bonuses if they've performed well, certainly not if they've failed to tackle water pollution. \"Undeserved bonuses will now be banned as part of the government's plan to clean up our rivers, lakes and seas for good.\" Read more:Water boss defends six-figure bonusThames Water fined £123mYorkshire Water fined £40m Whitehall sources say they \"make no apology\" for calling out water company conduct, despite concerns raised by an independent reviewer that negative sentiment and misdirected regulation has put off investors and raised the cost of financing the privatised system. In an interim report, former Bank of England deputy governor Sir Jon Cunliffe said \"negative political and public narrative and Ofwat's approach to financial regulation have made the sector less attractive\". Sir Jon will publish final recommendations to reform water regulation next month, with the aim of addressing public concerns over pollution and customer service, while attracting long-term, low-risk, low-return investors. Water bills will rise on average by 36% over the next five years as companies pledge to spend £103bn on operating, maintaining, and improving infrastructure, including £12bn on cutting sewage spills."
    },
    {
        "title": "Woman charged with murder of Izabela Zablocka who disappeared 15 years ago",
        "description": "A woman has been charged with the murder of Izabela Zablocka who disappeared 15 years ago, Derbyshire Police have said.",
        "url": "https://news.sky.com/story/woman-charged-with-murder-of-izabela-zablocka-who-disappeared-15-years-ago-13379811",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-izabela-helena-zablocka_6933491.jpg?20250602235547",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-05 19:51:00",
        "Headline": "Ms Zablocka came to the UK from Poland in 2009 – but lost contact with her family in August 2010.",
        "Content": "A woman has been charged with the murder of Izabela Zablocka who disappeared 15 years ago, Derbyshire Police have said. Ms Zablocka, a Polish national, came to the UK in 2009 - and lived in the Normanton area of Derby. She lost contact with her family in August 2010 when she was 30. However, new information recently came to light and a murder investigation was launched a fortnight ago. Officers have since found human remains - believed to be those of Ms Zablocka - in the garden of a property on Princes Street in Normanton. Police have now charged Anna Podedworna, 39, of Boyer Street, Derby, with murder. She was also charged with preventing a lawful burial and perverting the course of justice. Podedworna remains in custody, and will appear at Southern Derbyshire Magistrates' Court on Friday. Read more on Sky News:Musk says Trump appears in Epstein filesRussian ambassador partly blames UK for Ukrainian drone attackAnonymous ex-girlfriend of Sean 'Diddy' Combs gives evidence Five people have been arrested as part of the murder investigation. Two other women, aged 39 and 43, and two men, aged 41 and 48, were arrested on suspicion of murder. They have all been bailed pending further inquiries."
    },
    {
        "title": "Arsonist told to watch spy drama by Russian mercenary group before fire, court told",
        "description": "A man who has admitted to aggravated arson at a Ukraine-linked warehouse was told to watch a Cold War spy drama as his \"manual\", the Old Bailey has heard.",
        "url": "https://news.sky.com/story/arsonist-told-to-watch-spy-drama-by-russian-mercenary-group-before-fire-court-told-13379708",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-fire-leyton_6935338.jpg?20250605173850",
        "type": "UK",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2025-06-05 16:30:00",
        "Headline": "Six men have gone on trial following the blaze at an east London warehouse supplying StarLink satellite equipment to Ukraine.",
        "Content": "\n          News correspondent\n              @esadiya\n A man who has admitted to aggravated arson at a Ukraine-linked warehouse was told to watch a Cold War spy drama as his \"manual\", the Old Bailey has heard. The Russian mercenary Wagner group allegedly recommended that Dylan Earl, 20, \"please see\" The Americans - a show where undercover spies carry out dangerous missions for the Soviet Union - to \"understand\" the work better, the jury was told. Prosecutors say that Earl was \"knowingly acting at the behest\" of Wagner - a private military contractor linked to Russia, which is proscribed as a terrorist organisation - who \"commissioned the arson attack\" in Leyton, East London, on 20 March 2024. The arson attack took place at an industrial unit supplying StarLink satellite equipment to Ukraine, and caused around £1m of damage. Earl pleaded guilty to arson and 'preparatory conduct' - actively planning a crime - after being arrested in April last year. Before his arrest, the prosecution says Earl, on behalf of Wagner Group, also planned arson attacks on two businesses - a wine shop called Hedonism, and a restaurant called HIDE - in Mayfair, as well as the kidnap of the businesses' owner, a Russian dissident. The Americans The jury was told Earl had been sent details about the TV spy drama on 19 March - the day before the arson attack. Duncan Penny KC, prosecuting, said Earl had been tasked by Telegram user Privet Bot to watch the show. \"Will you please see the serial Americans\", one message read. \"I recommend to watch it in order to understand work\", read another. The next day - the day of the fire - other messages from 'Privet Bot' invited Earl to form a \"movement\", which it would offer \"support\" to. The messages also urged Earl to \"watch this [The Americans] series\" - adding \"it will be your manual\". Ashton Evans Mr Penny said Earl subsequently sent a message on Snapchat to one of the defendants, Ashton Evans, on 28 March 2024 with two words: \"The Americans\". The prosecution claims Earl was giving Evans a similar instruction to watch the show. Evans, 20, who is charged with failing to disclose information about terrorist acts, was in contact with Earl, \"the architect of these offences\", across three messaging platforms: iMessage chat, Snapchat and Signal, the court heard. He is accused of being aware of the Leyton arson before it occurred, the Mayfair plots and knowing that Earl was acting on the instructions of the Wagner Group. Evans admitted using the name 'Alexander Solonik' on Signal, Mr Penny said, explaining that the individual was reputed to be a Russian gangster, known for his reputation as a notorious hitman in the Russian criminal underworld. Kidnap plot Citing messages between Evans and Earl on 26 March 2024, Mr Penny said Evans had messaged to ask for details about the kidnap plot. \"Send deets\", Mr Penny read from the court bundle, quoting Evans, \"they only paying 40k for a man worth a billion\". The reference to \"a man worth a billion\", Mr Penny explained, is likely to be to the owner of Hide and Hedonism. The court heard that Earl and Evans exchanged further messages about the Mayfair plot on 30 March 2024, and Earl had explained it was a \"wine shop\" with \"20 million pounds of stock\". Read more on Sky News:Russian ambassador partly blames UK for Ukrainian drone attackZia Yusuf resigns as chair of Reform UK Another message read: \"Obviously maybe only 1-2 million damnged (sic) but it be insured\". \"The thing is\", another message acknowledged, \"There's houses above\", around \"120ft nbove (sic)\", and so recommended: \"maybe we find a way so no one harmed.\" \"But clean only bro\", the prosecution quoted Earl texting, \"Because there will be a good amount of heat after this it will be on every news channel and radio in our country\". Four other men are on trial at the Old Bailey - Nii Kojo Mensah, 23, Jakeem Rose, 23, both from Thornton Heath, South London, Paul English, 61, from Roehampton, South London, and Ugnius Asmena, 20, of no fixed abode - deny aggravated arson. Ashton Evans and Dmitrijus Paulauskas, 22, both from Newport, Gwent, deny failing to disclose information about terrorist acts. Duncan Penny KC, prosecuting, told the court the defendants \"may have been ignorant of that influence and the motive may have been financial - good old-fashioned greed\". He added: \"For others, however, it appears to have been both political and ideological.\" The trial continues."
    },
    {
        "title": "Russian ambassador partly blames UK for Ukrainian drone attack",
        "description": "Russia's UK ambassador has told Sky News that Ukraine's recent attacks risk escalating the conflict to \"World War III\" as he partly blamed the UK.",
        "url": "https://news.sky.com/story/russian-ambassador-partly-blames-uk-for-ukrainian-drone-attack-13379594",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-andrei-kelin-russian_6935108.jpg?20250605143743",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-05 13:28:00",
        "Headline": "Andrei Kelin pointed the finger at the UK when he said Ukraine must have had assistance in the weekend's drone attacks.",
        "Content": " Russia's UK ambassador has told Sky News that Ukraine's recent attacks risk escalating the conflict to \"World War III\" as he partly blamed the UK. Andrei Kelin warned that Ukraine's actions \"are bringing the conflict to a different level of escalation\", in an interview with Sky News' Yalda Hakim, and said Kyiv should \"not try to engulf World War III\". \"That's the very worst case scenario that we can imagine,\" he said. More than a hundred Ukrainian drones were deployed inside Russia over the weekend, destroying more than 40 warplanes in an attack Volodymyr Zelenskyy said \"will undoubtedly be in history books\".  Mr Kelin pointed the finger at the UK when he said Ukraine must have had assistance in the attacks. \"[This] kind of attack involves, of course, provision of very high technology, so-called geospaced data, which only can be done by those who have it in possession. And this is London and Washington,\" he said.  \"I don't believe that America [is involved], that has been denied by President Trump, definitely, but it has not been denied by London. \n                  Americans are wearing biggest smiles in NATO defence spending battle\n                 \n                  Arsonist told to watch spy drama by Russian mercenary group before fire, court told\n                 \n                  Why Putin is in 'victim mode' over Ukraine's airbase drone attack\n                  \"We perfectly know how much London is involved, how deeply British forces are involved in working together with Ukraine.\" On Wednesday, Donald Trump said Vladimir Putin told him \"very strongly\" that Russia \"will have to respond to the recent attack on the airfields\". The US president said that he discussed the attack with Mr Putin during a phone call that lasted more than an hour. \"It was a good conversation, but not a conversation that will lead to immediate peace,\" he wrote. Mr Kelin repeated this sentiment, telling Sky News: \"It is up to the Ministry of Defence to make a right solution, but we have to respond to it.\" A Downing Street spokesperson said: \"We never comment on operational matters at home or abroad.\""
    },
    {
        "title": "Trump and China's Xi have 'very good' phone call and agree to more talks amid trade war",
        "description": "Donald Trump says he has had a \"very good\" phone call with Xi Jinping amid their ongoing trade war, during which they agreed to more tariff talks.",
        "url": "https://news.sky.com/story/trump-and-chinas-xi-have-phone-call-amid-trade-war-13379596",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-xi-jinping-donald-trump_6935139.jpg?20250605145713",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-05 13:26:00",
        "Headline": "Trade negotiations between the United States and China stalled shortly after a 12 May agreement between the two countries to reduce their tariff rates while talks took place.",
        "Content": "Donald Trump says he has had a \"very good\" phone call with Xi Jinping amid their ongoing trade war, during which they agreed to more tariff talks. Trade negotiations between the United States and China stalled shortly after a 12 May agreement between the two countries to reduce their rates on levies while talks took place. The call was first reported by Chinese state media and confirmed by the Chinese foreign ministry. According to Chinese state media, Mr Trump initiated the call with the Chinese president. In a post on his Truth Social platform, the US president said: \"I just concluded a very good phone call with President Xi of China, discussing some of the intricacies of our recently made, and agreed to, trade deal.\" He said the call lasted around an hour and a half and \"resulted in a very positive conclusion for both countries\". There \"should no longer be any questions\" on rare earth products, he said. \"The conversation was focused almost entirely on trade. Nothing was discussed concerning Russia/Ukraine, or Iran,\" Mr Trump added. He said the two nations had agreed to further tariff talks, and both leaders invited each other to visit their respective countries. According to Chinese state media, Mr Xi \"pointed out that it is especially important to correct the course of the big ship of China-US relations, which requires us to keep the rudder and set the direction, especially to remove all kinds of interference and even sabotage\". Mr Xi \"emphasised that the US should handle the Taiwan issue carefully\" to avoid the two countries being dragged \"into a dangerous situation of conflict and confrontation\". According to the readout of the call, Mr Trump \"expressed great respect for President Xi Jinping and the importance of the US-China relationship\". It came a day after Mr Trump declared it was difficult to reach a deal with his Chinese counterpart. \"I like President Xi of China, always have, and always will, but he is very tough, and extremely hard to make a deal with!!!,\" Mr Trump said in a post on Truth Social. The US president has cut his 145% tariffs on Chinese goods to 30% for 90 days to allow for talks, while China reduced its taxes on US goods from 125% to 10%. The trade war has produced sharp swings in global markets and threatens to damage trade between the two nations. Read more:Trump travel ban: The notable countries omittedWhat a weakening dollar means for US president Mr Trump's treasury secretary Scott Bessent had suggested only a conversation between the two leaders could resolve their differences in order for talks to begin in earnest. Mr Trump and Mr Xi last spoke in January, three days before his inauguration, where they discussed trade, as well as Mr Trump's demand for China to do more to stop the drug fentanyl from entering the US."
    },
    {
        "title": "Americans are wearing biggest smiles in NATO defence spending battle",
        "description": "Everyone at NATO knows about battles.",
        "url": "https://news.sky.com/story/americans-are-wearing-biggest-smiles-in-nato-defence-spending-battle-13379723",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-pete-hegseth-us-defence-secretary_6935453.jpg?20250605194806",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-06-05 17:13:00",
        "Headline": "Increased military spending may be good for global security, but until Europe expands its own defence industry, it's also excellent news for the US economy.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n  Everyone at NATO knows about battles. Sometimes you come out on top and sometimes you have to know when you're beaten. And here, it's the Americans who are wearing the biggest smiles. It has long been a mantra of President Trump that European nations should spend a lot more money on defence. During his first term in office, when he seemed to be deriding NATO on a regular basis, he amplified a debate that had long rumbled; now it feels like it's coming to a resolution.  Certainly there was a bounce in the step of US defence secretary Pete Hegseth when we spoke. \"We all need increased capabilities and we all need to spend more,\" he said. \"Thank you to President Trump for reviving this alliance. It was an alliance that was sleepwalking to irrelevance and President Trump, in his first term, said you need to step up and spend more. And he has in this term done the same.\" \n                  Serving coffee in America, under fear of death from the Taliban in Afghanistan\n                 \n                  Trump v Musk has got very messy very quickly, and TV's punchline writers will be the only winners\n                 \n                  Musk says Trump appears in Epstein files and $150bn wiped off Tesla's value as row between them explodes\n                 \"What I saw in there\", gesturing to the meeting rooms where all the ministers had met, \"were countries prepared to step up to push the limits of what they can do. That's a good thing. That's friends helping friends.\" Mr Hegseth came into this meeting in Brussels with one big demand - for NATO allies to bump up their defence spending to a total of 5% of GDP - more than any of them are spending at the moment. Of that, he believes that at least 3.5% should be going towards core defence spending - soldiers, planes, guns and so on - while a further 1.5% could be spent on other \"defence-related\" elements - infrastructure, espionage, civil defence. Pot one is clear. Pot two is vague - nobody seems quite sure what counts as \"defence-related\". Climate change resilience, for instance, has been suggested by some countries. That one will need clearing up. But even the 3.5% demand is a huge one. Over third of worldwide defence spending by US According to the latest data I've seen, only one NATO member presently spends above that target - and no, that isn't America.  It's Poland, which has ramped up military spending ever since neighbouring Ukraine was invaded. Lithuania, Estonia and Latvia have all done the same, nervously looking towards Russia. The United States sits at 3.4% of GDP. But that's 3.4% of a very big number, so it equates to an awful lot of spending. To put that in context, more than a third of worldwide spending on defence is carried out by America. Look at the top 10 nations in the world for defence spending, and America is top by a mile. It spends more than the other nine countries on that list put together. What's more, the vast majority of that money goes to American companies, and a great deal of it is shared among a relatively small number of those companies. Read more:Trump and Musk trade insultsRussia partly blames UK for drone attackTrump and Xi's 'very good' call Increased military spending may well be good for global security, but until such time as Europe expands its own defence industry, it's also excellent news for the American economy. Mark Rutte, the NATO secretary general, admitted that it was a huge challenge, but said that he would not accept countries simply kicking the financial can down the street. Countries will be monitored constantly to ensure they are making annual progress towards the 5% target. A finishing line hasn't been established yet, but it's probably going to be 10 years from now. Still, Rutte said he didn't want \"hockey sticks\" - the statistical model where things stay flat for a long time, and the big rise only comes at the end."
    },
    {
        "title": "Bodies of husband and wife taken into Gaza by Hamas recovered after special operation by Israeli forces",
        "description": "The bodies of a couple taken into Gaza by Hamas during the 7 October attacks have been recovered by Israeli forces, Benjamin Netanyahu has announced.",
        "url": "https://news.sky.com/story/bodies-of-two-israeli-hostages-recovered-from-gaza-says-netanyahu-13379422",
        "image_url": "https://e3.365dm.com/23/12/1920x1080/2372312220476067307_6401442.jpg?20231222121523",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-05 06:44:00",
        "Headline": "The husband and wife were killed on 7 October, 2023, and their bodies taken into Gaza by Hamas.",
        "Content": "The bodies of a couple taken into Gaza by Hamas during the 7 October attacks have been recovered by Israeli forces, Benjamin Netanyahu has announced. The Israeli prime minister said the bodies of husband and wife Gad Haggai, 72, and Judi Weinstein Haggai, 70, were recovered during a special operation by the Israeli military and the country's security agency, Shin Bet. Mr Netanyahu said they were killed on 7 October, 2023, and their bodies were taken into Gaza by Hamas. In a statement, he said: \"Together with all the citizens of Israel, my wife and I extend our heartfelt condolences to the dear families. \"Our hearts ache for the most terrible loss. May their memory be blessed. \"We will not rest or be silent until we return all of our abductees home - the living and the dead alike.\" The Hostages and Missing Persons Families Forum has been campaigning for the safe return of all Israeli citizens held hostage by Hamas. The hostage families said in a statement: \"The return of Judi and Gad is painful and heartbreaking, yet it also brings healing to our uncertainty. \"Their return reminds us all that it is the state's duty to bring everyone home, so that we, the families, together with all the people of Israel, can begin the process of healing and recovery. \"Decision-makers must do everything necessary to reach an agreement that will return all 56 remaining hostages - the living for rehabilitation and the deceased for burial. There is no need to wait another 608 agonising days for this. \"The mission can be completed as early as tomorrow morning. This is what the majority of the Israeli people want.\"  Most of the hostages returned alive to Israel so far have been released as part of deals with Hamas during two temporary ceasefires in late 2023 and early 2025. The most recent ceasefire that saw a pause in the fighting and the exchange of Israeli hostages and Palestinian prisoners fell apart in March. Israel has rejected calls for an unconditional or permanent ceasefire, saying Hamas cannot stay in Gaza. On Wednesday, the US vetoed a draft UN Security Council resolution that demanded an \"immediate, unconditional and permanent ceasefire\" between Israel and Hamas militants in Gaza and unhindered aid access across the war-ravaged territory. The other 14 countries on the council voted in favour of the draft. \"The United States has been clear: We would not support any measure that fails to condemn Hamas and does not call for Hamas to disarm and leave Gaza,\" said Dorothy Shea, acting US ambassador to the UN, ahead of the vote. She told the council it would also undermine ongoing US-led efforts to broker a ceasefire. Read more from Sky News:Trump signs travel bansPutin vows revenge against Ukraine 👉 Listen to Sky News Daily on your podcast app 👈 Hamas took 251 hostages and killed more than 1,200 people in its attacks on Israel in October 2023. Israel has responded with an air and ground assault on Gaza - and has recently escalated its bombing campaign. The Hamas-run Gaza health ministry says more than 54,000 Palestinians have been killed in Israeli attacks since the start of the war. Its figures do not differentiate between civilians and fighters. Israel says its two war aims are to destroy Hamas and release the hostages."
    },
    {
        "title": "Madeleine McCann: Investigators end latest searches for missing British girl",
        "description": "Investigators in Portugal have ended their latest searches for Madeleine McCann after three days.",
        "url": "https://news.sky.com/story/madeleine-mccann-investigators-end-latest-searches-for-missing-british-girl-13379673",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-madeleine-mccann-portugal_6935293.jpg?20250605171324",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-05 15:55:00",
        "Headline": "Police have been scouring scrubland and abandoned structures near the town of Praia da Luz, where the three-year-old British girl went missing 18 years ago.",
        "Content": "Investigators in Portugal have ended their latest searches for Madeleine McCann after three days. Police have been scouring scrubland and abandoned structures near the town of Praia da Luz, where the three-year-old British girl went missing 18 years ago. Officers could be seen holding pitchforks as they combed land in an area on the outskirts of Lagos in the Algarve on Thursday. Search teams involving German and Portuguese officers, as well as firefighters, used pickaxes and shovels to dig undergrowth, and a digger was again used to remove rubble from an abandoned structure at the site. They spent two days focusing on one particular derelict building, using a ground-penetrating radar on the cobbled ground after clearing the area of debris and vegetation. British officers have not been present for the latest searches, the Metropolitan Police said. German and Portuguese investigators could be seen shaking hands and embracing as the search drew to a close. \n                  Madeleine McCann search: Abandoned buildings examined as ground radar may be deployed\n                 \n                  Madeleine McCann: New search under way brings fresh hope - but there are big unanswered questions\n                 \n                  What we know about new Madeleine McCann searches in Portugal\n                 The officers stood in a circle for a debrief before taking part in a round of applause. Authorities have not yet commented on the ending of the latest searches. So far, officers have not announced they have found anything of significance. Read more: What we know about new searches German authorities had requested the search as part of their continued attempts to find evidence to implicate suspect Christian B. The suspect, who cannot be fully identified under German law, is coming to the end of a prison sentence for the rape of an elderly American woman in Praia da Luz in 2005. He has not been charged or indicted over Madeleine's disappearance and denies any involvement. It comes 18 years after three-year-old Madeleine disappeared from Praia da Luz while on holiday with her family in 2007. She vanished after she was left sleeping while her parents, Kate and Gerry McCann, went for dinner in a nearby restaurant."
    },
    {
        "title": "Trump's new travel ban: The notable countries omitted - amid anger over 'moral disgrace'",
        "description": "Donald Trump has banned people from 12 countries entering the US, in a move he said protects against \"foreign terrorists\" and other security threats.",
        "url": "https://news.sky.com/story/what-you-need-to-know-about-trumps-travel-ban-13379431",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-us-customs-border-immigration_6934967.jpg?20250605110439",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-05 07:16:00",
        "Headline": "A new proclamation signed by Donald Trump means a total of 12 countries have been handed a full or partial ban from travelling to the US. Here is what you need to know.",
        "Content": " Donald Trump has banned people from 12 countries entering the US, in a move he said protects against \"foreign terrorists\" and other security threats. Some countries are subject to a full travel ban, while others are under a partial ban - with the order allowing countries to be removed or added from the list. The proclamation is due to come into effect just after midnight on 9 June local time. The ban echoes one in 2017 that Mr Trump implemented in his first term in the White House. This banned citizens from seven predominantly Muslim countries - Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen - from travelling to the US. Here is everything you need to know. Which countries are affected? The proclamation bans nationals from the following countries to travel to the US: • Afghanistan• Myanmar• Chad• Republic of the Congo• Equatorial Guinea• Eritrea• Haiti• Iran• Libya• Somalia• Sudan• Yemen. The following seven countries are affected by a partial ban: • Burundi• Cuba• Laos• Sierra Leone• Togo• Turkmenistan• Venezuela. Both bans will affect foreign nationals from the designated countries who are outside the US on 9 June or do not have a valid visa. Visas issued before 9 June when the law comes into force will remain valid, the proclamation states. How many people come to the US from these countries? From October 2023-September 2024 (the fiscal year), the US handed out more than 60,000 permanent visas to the 12 countries on the permanent ban list, according to data from the US Department of State. The highest by far was to people from Afghanistan - 39,055 - with the most going to nationals who are employed by or on behalf of the US government and their immediate family members. Under the new proclamation, Afghan nationals who hold special immigrant visas - people who worked most closely with the US government during the two-decade war there - are exempt from the ban. The figures below do not include people who were given temporary visas. Are there any exemptions? Mr Trump said on Thursday that policy was a \"key part of preventing major foreign terror attacks on American soil\". His new list notably leaves out Syria, after Mr Trump met its leader recently on a trip to the Middle East. Athletes competing in the 2026 World Cup, 2028 Olympics and other major sporting events will also be exempt. The ban also does not apply to the following individuals: • Diplomats travelling on valid non-immigration visas• Immediate family members who hold immigrant visas• People who have been adopted• Afghan nationals holding special immigrant visas• People who hold immigrant visas for ethnic and religious minorities facing \"persecution in Iran\"• Dual nationals who have citizenship in countries not included in the travel ban Why has the ban been introduced? The proclamation states that America must ensure people entering don't have \"hostile attitudes toward its citizens, culture, government, institutions, or founding principles\" - and don't support terror groups. In a video posted to social media, Mr Trump said an attack in Colorado, in which eight were injured, had shown \"the extreme dangers\" of \"foreign nationals who are not properly vetted, as well as those who come as temporary visitors and overstay their visas\". The suspect in the attack is from Egypt, a country that is not on Mr Trump's restricted list, but homeland security claimed he had overstayed a tourist visa. The list was put together after the president asked homeland security officials and the director of national intelligence to compile a report on countries whose citizens could pose a threat. The White House said some of the named countries had a \"significant terrorist presence\" and accused others of poor screening for dangerous individuals and not accepting deportees. Critics, however, suggest the move is really designed to further cultivate hostility to immigrants in general, and that the president's claim it is driven by security concerns is a lie. What has the reaction been? International aid groups and refugee resettlement organisations have condemned the new travel ban. \"This policy is not about national security - it is about sowing division and vilifying communities that are seeking safety and opportunity in the United States,\" said Abby Maxman, president of Oxfam America. The inclusion of Afghanistan has also angered some supporters, who have worked to resettle its people. Over a 12-month period to September 2024 there has been an estimated 14,000 arrivals from Afghanistan. Mr Trump suspended refugee resettlement on his first day in office. Shawn VanDiver, president and board chairman of the organisation #AfghanEvac, labelled the proclamation a \"moral disgrace\". \"To include Afghanistan - a nation whose people stood alongside American service members for 20 years - is a moral disgrace,\" he said. \"It spits in the face of our allies, our veterans, and every value we claim to uphold.\" Meanwhile, the Iranian government offered no immediate reaction to being included on the list. What happened in 2017? Mr Trump's first travel restrictions in 2017 were criticised by opponents and human rights groups as a \"Muslim ban\". It led to some chaotic scenes, including tourists, students and business travellers prevented from boarding planes - or being held at US airports when they landed. Mr Trump denied it was Islamophobic, despite calling for a ban on Muslims entering America in his first presidential campaign. The ban faced legal challenges and was modified until the Supreme Court upheld a third version in June 2018, calling it \"squarely within the scope of presidential authority\"."
    },
    {
        "title": "Serving coffee in America, under fear of death from the Taliban in Afghanistan",
        "description": "At a coffee shop in northern Virginia, you'll find a taste of the Middle East.",
        "url": "https://news.sky.com/story/serving-coffee-in-america-under-fear-of-death-from-the-taliban-in-afghanistan-13379867",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-blevins-usa_6935561.jpg?20250605232811",
        "type": "World",
        "Author": "David Blevins",
        "Date Published": "2025-06-05 22:16:00",
        "Headline": "\"This 2025 version of Trump's 2017 'Muslim ban' turns the so-called American dream into a nightmare for millions around the globe,\" writes Sky's David Blevins.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  At a coffee shop in northern Virginia, you'll find a taste of the Middle East. But President Trump's travel ban has turned the stomachs of the owner and her staff. Layla Atik is from Yemen, her employees are from Afghanistan and Eritrea, three of the 12 countries on the restricted list. \"I see firsthand the struggles that my own colleagues go through, and they're very hard-working people,\" Layla told me. \"So, coming here, they're adding value to this economy. They're not coming here and causing trouble or anything,\" she added. Atefeh Aslami, who works in the cafe, fled from Afghanistan but now fears she won't be granted asylum in America. \"If I go back to Afghanistan, the Taliban will kill us,\" she said. \"My children don't want to go back to Afghanistan, especially my girl, who will not be allowed to go to school. \"It's a matter of life for me, for my husband, for my children, for all of us.\" Pouring from a cezve, a Turkish coffee pot, her Afghan colleague Zahir Moradi said: \"If someone is trying to come here… it's because they need help, because they want to live a better life, that's it.\" A wall, emblazoned in gold with the words \"life begins\", forms the backdrop to a vast array of Middle Eastern coffee and pastries. Read more on Sky News:Musk says Trump appears in Epstein filesRussian ambassador partly blames UK for Ukrainian drone attackFormer girlfriend tells Diddy trial of sex with male escorts  But this 2025 version of Trump's 2017 'Muslim ban' turns the so-called American dream into a nightmare for millions around the globe. President Trump claimed last weekend's firebomb attack in Boulder, Colorado, justified new travel restrictions. But a Vietnam veteran, drinking coffee with his family at the cafe in Virginia, didn't believe the latest ban would make America safer.  He said: \"I'm a firm believer in allowing immigration, and I think it's terrible that we're deporting people that really have never done anything wrong. \"They just happened to be in the wrong place at the wrong time, they get picked up by ICE (Immigration Compliance and Enforcement), and off they go.\" Trump's travel ban: The notable countries omitted - amid anger over 'moral disgrace' His nephew, seated beside him, told me those who think the travel ban is about security were \"misguided\". \"I think you fear what you don't understand,\" he said. When I asked what the administration doesn't understand, he replied: \"Other cultures.\""
    },
    {
        "title": "Moon lander 'likely to have crashed', says Japan's ispace",
        "description": "Japan's private space company ispace has said its latest uncrewed moon lander has probably crashed onto the surface, two years after another unsuccessful touchdown attempt.",
        "url": "https://news.sky.com/story/moon-landing-declared-a-failure-on-second-attempt-lander-probably-crashed-says-japans-ispace-13379843",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ispace-moon_6935522.png?20250605221234",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-05 22:30:00",
        "Headline": "The spacecraft is believed to have descended too fast after a laser system for measuring altitude did not work as expected. But despite the failure, the firm ispace is pledging to press ahead with more moon missions.",
        "Content": "Japan's private space company ispace has said its latest uncrewed moon lander has probably crashed onto the surface, two years after another unsuccessful touchdown attempt. The Tokyo-based company declared the mission a failure on Saturday, several hours after communication was lost with the lander, named Resilience. It follows its failed inaugural mission in 2023. CEO and founder Takeshi Hakamada issued an apology at a news conference. \"This is the second time that we were not able to land. So we really have to take it very seriously,\" he told reporters. But he stressed that the company would press ahead with more lunar missions. On Wednesday, ispace released footage from the Resilience lander circling the moon, ahead of Friday's planned landing. Initial analysis of the mission failure suggests the laser system for measuring the altitude did not work as planned, and the lander descended too fast, officials said. \n                  Europe's first rover to land on moon - and it's carrying a tiny red house\n                 \n                  First moon rocks on Earth in half a century arrive in UK\n                 \n                  NASA watch live: Space agency confirms Artemis moon mission delayed \n                 \"Based on these circumstances, it is currently assumed that the lander likely performed a hard landing on the lunar surface,\" the company said in a written statement. The Tokyo-based firm had hoped to follow in the steps of US companies Intuitive Machines and Firefly Aerospace - which have already conducted successful, or partially successful, commercial landings. Resilience was launched in January from Florida on a long, roundabout journey, and entered lunar orbit last month. It shared a SpaceX ride with Firefly Aerospace's Blue Ghost, which reached the moon faster and became the first private entity to successfully land there in March. Another US company, Intuitive Machines, arrived at the moon a few days later, although that lander skidded into a crater near the south pole and was declared dead within hours.  Resilience was targeting a flat area at the top of the moon, in a long, narrow region full of craters and ancient lava flows that stretches across the near side's northern tier. On board was ispace's European-built rover - named Tenacious - with a high-definition camera and a shovel to scoop up some lunar dirt for NASA. Besides science and tech experiments, the lander was also carrying a tiny, Swedish-style red cottage with white trim and a green door. It was called the Moonhouse by creator Mikael Genberg and was supposed to be placed on the lunar surface."
    },
    {
        "title": "Trump signs travel ban targeting 12 countries with 'hostile attitudes' to the US",
        "description": "Donald Trump has signed an order banning people from 12 countries from entering the US.",
        "url": "https://news.sky.com/story/president-trump-signs-travel-ban-targeting-12-countries-with-hostile-attitudes-to-the-us-13379358",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-trump-us-customs-border_6934928.jpg?20250605094223",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-05 00:53:00",
        "Headline": "The White House says it's the president's \"sacred duty to take action to ensure that those seeking to enter our country will not harm the American people\".",
        "Content": " Donald Trump has signed an order banning people from 12 countries from entering the US. He said Sunday's attack in Colorado had shown \"the extreme dangers\" of \"foreign nationals who are not properly vetted, as well as those who come as temporary visitors and overstay their visas\". \"We will not allow people to enter our country who wish to do us harm,\" the president said. Trump's travel ban: The notable countries omitted - amid anger over 'moral disgrace' The countries affected are: Afghanistan, Myanmar, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen. The White House said some had a \"significant terrorist presence\" and accused others of poor screening for dangerous individuals and not accepting deportees. People from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela will face partial restrictions. \n                  Serving coffee in America, under fear of death from the Taliban in Afghanistan\n                 \n                  Trump v Musk has got very messy very quickly, and TV's punchline writers will be the only winners\n                 \n                  Americans are wearing biggest smiles in NATO defence spending battle\n                 Mr Trump's proclamation said America must ensure people entering don't have \"hostile attitudes toward its citizens, culture, government, institutions, or founding principles\" - and don't support terror groups. The move echoes a controversial and chaotic order enacted eight years ago during his first term, when he banned people from predominately Muslim countries. The countries initially targeted then were Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen. President Trump said on Thursday that policy was a \"key part of preventing major foreign terror attacks on American soil\". His new list notably removes Syria after Mr Trump met its leader recently on a trip to the Middle East. Athletes competing in the 2026 World Cup and the 2028 Olympics will also be exempt, as will others such as permanent US residents and Afghans with special immigrant visas. US correspondent President Trump hailed travel restrictions imposed during his first term as \"one of our most successful policies\". It was also one of the most controversial, with what became known as \"the Muslim ban\" sparking widespread protest. Thousands gathered at US airports to oppose the detainment of travellers arriving from affected countries.\n The then German chancellor, Angela Merkel, said the fight against terrorism didn't justify suspicion of people based on their faith. Her French counterpart at the time, President Hollande, warned against the dangers of isolationism.\n Still smarting perhaps from that criticism, Trump announced his new ban with a commitment to \"not let what happened in Europe happen to America\".\n\n\n In addition to restrictions on 12 countries and partial restrictions on another seven, he warned others could be added as \"threats emerge around the world\". In a second proclamation, the US president escalated his war with Harvard University, suspending international visas for new students and authorising the secretary of state to consider revoking existing ones.  Having blamed Joe Biden for \"millions and millions\" of \"illegals\" in America, he issued a third proclamation ordering an investigation into the use of autopen during Biden's presidency. In a memorandum, President Trump claimed his predecessor's aides used autopen to sign bills in a bid to cover up his cognitive decline.\n\n If we didn't know what the Trump administration meant when they talked about \"flooding the zone\", we know now.\n The list was put together after the president asked homeland security officials and the director of national intelligence to compile a report on countries whose citizens could pose a threat. The ban takes effect from 9 June - but countries could be removed or added. The proclamation states it will be reviewed within 90 days, and every 180 days after, to decide if it should be \"continued, terminated, modified, or supplemented\". President Trump's first travel restrictions in 2017 were criticised by opponents and human rights groups as a \"Muslim ban\". It led to some chaotic scenes, including tourists, students and business travellers prevented from boarding planes - or being held at US airports when they landed. Mr Trump denied it was Islamophobic despite calling for a ban on Muslims entering America in his first presidential campaign. The ban faced legal challenges and was modified until the Supreme Court upheld a third version in June 2018, calling it \"squarely within the scope of presidential authority\"."
    },
    {
        "title": "Erin Patterson: Woman accused of killing three people with poisonous mushrooms denies measuring 'fatal dose'",
        "description": "A woman accused of murdering three of her estranged husband's relatives with poisonous death cap mushrooms inside a beef wellington has denied she measured a \"fatal dose\" on her kitchen scales.",
        "url": "https://news.sky.com/story/erin-patterson-woman-accused-of-killing-three-people-with-poisonous-mushrooms-denies-measuring-fatal-dose-13379423",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-erin-patterson-mushroom_6934271.jpg?20250604091206",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-05 06:42:00",
        "Headline": "Erin Patterson is on trial in the Australian town of Morwell where she denies cooking and serving a beef wellington containing lethal death cap mushrooms to her estranged husband's relatives after inviting them to her home for lunch.",
        "Content": "A woman accused of murdering three of her estranged husband's relatives with poisonous death cap mushrooms inside a beef wellington has denied she measured a \"fatal dose\" on her kitchen scales. Erin Patterson is charged with murdering her mother-in-law Gail Patterson, father-in-law Donald Patterson, and Gail's sister, Heather Wilkinson. She is also charged with the attempted murder of Ian Wilkinson, Heather's husband. Her estranged husband, Simon Patterson, was also invited to lunch but didn't attend. Prosecutors say Patterson knowingly served the guests lethal death cap mushrooms in a beef wellington at her home in Leongatha, Victoria, Australia, on 29 July, 2023. The 50-year-old denies all the charges, claiming the deaths were a \"terrible accident\". Under cross-examination on Thursday by the prosecution in court, Patterson was asked whether a series of photos of mushrooms placed on weighing scales in her kitchen was evidence she had been measuring a \"fatal dose\" to serve to her lunch guests. \"I suggest that you were weighing these death cap mushrooms so that you could calculate the weight required for the administration of a fatal dose for one person. Agree or disagree?\" barrister Nanette Rogers said. \"Disagree,\" Patterson replied. Patterson accepted she had lied to police and medical professionals after the lunch when she was asked whether she had ever foraged for mushrooms or owned a food dehydrator - which was later found in a waste disposal plant containing traces of death caps. Read more from Sky News:Weight loss jab warningTrump signs travel bans Giving evidence earlier in the day while being questioned by her own barrister, Colin Mandy, Patterson told the trial in Morwell, Victoria, she did not intentionally pick death cap mushrooms, or knowingly serve them to her lunch guests. She also denied that she pretended to be sick after the lunch to avoid becoming a suspect in the case. The trial continues."
    },
    {
        "title": "Musk says Trump appears in Epstein files and $150bn wiped off Tesla's value as row between them explodes",
        "description": "Elon Musk says Donald Trump appears in files relating to the disgraced paedophile financier Jeffrey Epstein.",
        "url": "https://news.sky.com/story/donald-trump-disappointed-with-elon-musk-after-he-turned-on-his-big-beautiful-bill-13379714",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-jeffrey-epstein_6935517.jpg?20250605215509",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-05 16:48:00",
        "Headline": "In a post on X, the tech billionaire said: \"@realDonaldTrump is in the Epstein files. That is the real reason they have not been made public.\" He gave no evidence for the claim. The White House described Musk's comments as \"unfortunate\".",
        "Content": " Elon Musk says Donald Trump appears in files relating to the disgraced paedophile financier Jeffrey Epstein. It's the latest in a string of barbs between the men as they appear to have dramatically fallen out in a public spat. In a post on X, the tech billionaire said: \"@realDonaldTrump is in the Epstein files. That is the real reason they have not been made public. \"Mark this post for the future. The truth will come out.\" He gave no evidence for the claim. Meanwhile, White House press secretary Karoline Leavitt dismissed the comment. In a statement, she said: \"This is an unfortunate episode from Elon, who is unhappy with the One Big Beautiful Bill [a Republican tax and spending bill] because it does not include the policies he wanted. \"The president is focused on passing this historic piece of legislation and making our country great again.\" Epstein killed himself in his jail cell in August 2019 while awaiting trial on charges of sex trafficking minors. Read more:Analysis: Trump v Musk has got very messy very quicklyJanuary 2024: Epstein list - Who is named in unsealed documents? Donald Trump has been named in previously released documents relating to Jeffrey Epstein. One Epstein accuser in 2016 said she spent several hours with the disgraced financier at a Trump casino but she did not say if she met Mr Trump and did not accuse him of any wrongdoing. Mr Trump once said he believed Epstein was a \"terrific guy\" but that they later fell out. The latest claims by Musk about the Epstein files tap into conspiracy theories that sensitive files the government possesses have not yet been released.  In another post on Thursday, Musk, the owner of social media platform X, attacked Mr Trump's tariffs, saying they \"will cause a recession in the second half of this year.\" The Tesla boss shared a post calling for Mr Trump's impeachment and asked whether it was \"time to create a new political party in America that actually represents the 80% in the middle\". Musk also said his company SpaceX will begin decommissioning its Dragon spacecraft \"immediately\" following Mr Trump's threats to cancel government contracts with Musk's businesses. Dragon is the only US spacecraft available to deliver crew to and from the International Space Station. The spat has already hit Tesla shares, which lost about $150bn (£111bn) in value, closing down 14.3% for the day. It comes after the president said he was \"disappointed\" with Musk after the entrepreneur publicly criticised Mr Trump's signature tax bill. The president suggested his former backer and adviser missed being in government and has \"Trump derangement syndrome\". He added: \"I'm very disappointed in Elon. I've helped Elon a lot.\"  In a Truth Social post, the US president said: \"Elon was 'wearing thin,' I asked him to leave, I took away his EV mandate that forced everyone to buy electric cars that nobody else wanted (that he knew for months I was going to do!), and he just went crazy!\". On Tuesday, the world's richest man called the president's tax and spending bill \"outrageous\" and a \"disgusting abomination\" - days after abruptly leaving his position spearheading the Department of Government Efficiency (DOGE). The bill, which includes multi-trillion-dollar tax breaks, was passed by the House Republicans in May and has been described by the president as a \"big, beautiful bill\". By contrast, Musk has called it the \"big, ugly bill\". Shortly after the president expressed his disappointment in Musk on Thursday, the SpaceX boss responded. \"False\", he wrote on his X platform. \"This bill was never shown to me even once and was passed in the dead of night so fast that almost no one in Congress could even read it!\" In another scathing post on X, Musk claimed responsibility for Donald Trump's re-election success. He wrote: \"Without me, Trump would have lost the election, Dems would control the House and the Republicans would be 51-49 in the Senate.\"  It came after Mr Trump told reporters the Tesla chief executive was unimpressed electric vehicle incentives were being debated in the Senate and could face being cut. Read more on Sky News:Russian ambassador partly blames UK for Ukrainian drone attackFarage 'genuinely sorry' over Reform chair's shock resignationJudge threatens to remove Sean 'Diddy' Combs from court Last Thursday, Musk revealed on X that his scheduled time as a \"special government employee\" was coming to an end. Before the news broke, Musk's father told Sky News his son was \"not a very good politician\". But speaking to Gillian Joseph on The World, Errol Musk insisted there was \"no rift between Elon and Donald Trump\"."
    },
    {
        "title": "Trump v Musk has got very messy very quickly, and TV's punchline writers will be the only winners",
        "description": "And so, in the end, it was the big, beautiful bill that prompted the big, beautiful bust-up almost everyone knew was coming.",
        "url": "https://news.sky.com/story/trump-v-musk-has-get-very-messy-very-quickly-and-tvs-punchline-writers-will-be-the-only-winners-13379865",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-musk-trump_6931566.jpg?20250530192043",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2025-06-05 21:55:00",
        "Headline": "This almighty row has all the hallmarks of an ugly celebrity breakup, but has implications far beyond their billionaire clique.",
        "Content": "\n          US correspondent\n              @marthakelner\n  And so, in the end, it was the big, beautiful bill that prompted the big, beautiful bust-up almost everyone knew was coming. Ever since the Trump and Musk alliance was formed almost a year ago, megalomaniac watchers the world over have been asking when and how it would end. Now we have our answer; 137 days into Trump's presidency and with the fire-powered ferocity of one of Musk's rocket launches. At times, it felt voyeuristic to watch, the kind of rubbernecking that takes place with the ugliest of celebrity breakups. It's a Brangelina inside the beltway, but with implications far beyond it. Because Musk was as close to the president as anyone outside his own family. He spent weekends living at Trump's Mar-a-Lago home, his mum attended parties there, his son wiped his bogies on the resolute desk. But like so many domestic disputes, it got very messy, very quickly. As always when Trump has something to say, he waits for the inevitable question. It came immediately after his meeting inside the Oval Office with German Chancellor Freidrich Merz. A journalist asked about Musk's criticism of his \"big, beautiful\" bill. Trump saw his opening. \"I've always liked Elon. I'd rather have him criticise me than the bill,\" he said, quickly noting that he and Musk had a great relationship. \"I don't know if we will anymore,\" he added. \n                  Serving coffee in America, under fear of death from the Taliban in Afghanistan\n                 \n                  Americans are wearing biggest smiles in NATO defence spending battle\n                 \n                  Musk says Trump appears in Epstein files and $150bn wiped off Tesla's value as row between them explodes\n                 Less than half an hour later, a post on X by Musk made it very apparent that they would, indeed, no longer have a great relationship. \"Without me, Trump would have lost the election,\" he wrote. It was a torpedo that unleashed an, at times, unhinged back and forth including an unfounded allegation from Musk about Trump being part of the \"Epstein files\". Just a week after Trump presented Musk with a golden key in a grand farewell, Musk was burning the house down. But this break up will affect everyone involved, not to mention the American public. Brand Trump will be damaged by the loss of Musk's endorsement and loyalty.  Read more on Sky News:Russian ambassador partly blames UK for Ukrainian drone attackFarage 'genuinely sorry' over Reform chair's shock resignationJudge threatens to remove Sean 'Diddy' Combs from court Republican politicians will be wary of angering Musk by voting for Trump's spending bill. The world's richest man has shown he is willing to put his money on the line in election races and the midterms are looming. The government's reliance on Musk's companies is also huge. Space X is the key player in space exploration and Musk has been providing invaluable advice to the White House on artificial intelligence and electric vehicles. What will now happen to the Department of Government efficiency?  Meanwhile shares are down significantly at all of Musk's companies with Trump likely to seek vengeance. There could also be an investigation, now, into allegations that Musk's drug use while in government was out of control. There are so many unknowns and one certainty - there are no winners here, apart from the comedians who trade in jokes about this pair of impulsive billionaires."
    },
    {
        "title": "Former girlfriend tells Diddy trial of sex with male escorts - as rapper is warned by judge",
        "description": "A former girlfriend of Sean \"Diddy\" Combs has told his sex trafficking trial how a whirlwind romance opened a \"Pandora's box\" of sex sessions with male escorts that she did not know how to stop.",
        "url": "https://news.sky.com/story/former-girlfriend-tells-diddy-trial-of-sex-with-male-escorts-as-rapper-is-warned-by-judge-13379819",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sean-diddy-combs-sex-trafficking-trial_6935407.jpg?20250605190740",
        "type": "US",
        "Author": "Gemma Peplow",
        "Date Published": "2025-06-05 20:14:00",
        "Headline": "\"Jane\" is one of three alleged victims giving evidence during Sean \"Diddy\" Combs's trial, and her allegations mirror those given by his former long-term partner Cassie Ventura.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n A former girlfriend of Sean \"Diddy\" Combs has told his sex trafficking trial how a whirlwind romance opened a \"Pandora's box\" of sex sessions with male escorts that she did not know how to stop. The witness, who is testifying under the pseudonym \"Jane\", alleges the hip-hop mogul coerced her into participating in drug-fuelled \"debauchery\" nights throughout their relationship, which began in 2021 and ended when he was arrested in September 2024. She began her evidence on a dramatic day at the Manhattan court, taking to the stand not long after Judge Arun Subramanian issued a warning to Combs's lawyers after seeing the rapper \"nodding vigorously\" towards the jury during earlier testimony. If the \"totally unacceptable\" behaviour happens again during the trial, the judge said, he could take steps to remove the defendant from the courtroom. Diddy trial day 17 - as it happened Jane is one of three alleged victims of Combs giving evidence during his trial, and her allegations mirror those given by his former long-term partner Cassie Ventura. Both women said the rapper would sit in the corner and masturbate as he watched them have sex, and that the sessions would often last for more than 24 hours with \"no sleep\". Combs, 55, is accused of sex trafficking, racketeering conspiracy and transportation to engage in prostitution. He has pleaded not guilty to all charges. In court on Thursday, he often looked straight at Jane as she gave evidence. The single mother began her testimony by describing her whirlwind romance with Combs, saying he made her feel special and showered her with love and gifts in the first few months from January 2021. Asked what happened in May 2021, she bowed her head and became emotional as she told the court how Combs started to talk about fantasies of role play with other men. One night, he told her he could make the fantasy a reality, she says - and did so straight away. Jane told the court she agreed to having sex with the male escort because she wanted to make Combs happy - and even \"felt excited\" afterwards after doing something \"taboo\". However, she said she thought it was a one-off. Instead, \"it opened a Pandora's box\" and \"set the tone\" going forward, she said. After that first night in May 2021, Jane said she was having sex with other men \"90%\" of the time. Asked if this is what she wanted, she said it wasn't, but that she \"went along with it because I loved him at this point\". Combs kept pushing her into these sex sessions, and she felt \"obligated\" to go along with it, she said. He also had control over her life in other ways, she told the court, including by paying the rent on her home. Read more:Everything you need to know about the Sean Combs trialThe rise and fall of Sean 'Diddy' CombsWhat we learned from Cassie's testimony But as their relationship continued, she said she did tell him, \"many times\", she did not want to keep having sex with other men, but he would dismiss her, make her feel uncomfortable, or seemingly threaten to stop paying her rent. These encounters were referred to as \"debauchery\" or hotel nights, she told the court, and they always followed the same pattern - \"hotel suites, red lights, music, lotions and alcohol, there would be bed sheets covering everything, blankets and towels, because of the excessive use of baby oil everywhere\". Jane said she would \"have drugs in my system\" and wear \"provocative\" lingerie and \"high stripper shoes\", and Combs would ask her to pour baby oil on the men and on herself. These sessions typically lasted between 24 and 30 hours, she said, with \"no sleep\". In her testimony, Cassie Ventura told of similar sexual encounters, which Combs referred to as \"freak offs\", she said. Jane's evidence is set to continue on Friday and on several days next week."
    },
    {
        "title": "Serving coffee in America, under fear of death from the Taliban in Afghanistan",
        "description": "At a coffee shop in northern Virginia, you'll find a taste of the Middle East.",
        "url": "https://news.sky.com/story/serving-coffee-in-america-under-fear-of-death-from-the-taliban-in-afghanistan-13379867",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-blevins-usa_6935561.jpg?20250605232811",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-06-05 22:16:00",
        "Headline": "\"This 2025 version of Trump's 2017 'Muslim ban' turns the so-called American dream into a nightmare for millions around the globe,\" writes Sky's David Blevins.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  At a coffee shop in northern Virginia, you'll find a taste of the Middle East. But President Trump's travel ban has turned the stomachs of the owner and her staff. Layla Atik is from Yemen, her employees are from Afghanistan and Eritrea, three of the 12 countries on the restricted list. \"I see firsthand the struggles that my own colleagues go through, and they're very hard-working people,\" Layla told me. \"So, coming here, they're adding value to this economy. They're not coming here and causing trouble or anything,\" she added. Atefeh Aslami, who works in the cafe, fled from Afghanistan but now fears she won't be granted asylum in America. \"If I go back to Afghanistan, the Taliban will kill us,\" she said. \"My children don't want to go back to Afghanistan, especially my girl, who will not be allowed to go to school. \"It's a matter of life for me, for my husband, for my children, for all of us.\" Pouring from a cezve, a Turkish coffee pot, her Afghan colleague Zahir Moradi said: \"If someone is trying to come here… it's because they need help, because they want to live a better life, that's it.\" A wall, emblazoned in gold with the words \"life begins\", forms the backdrop to a vast array of Middle Eastern coffee and pastries. Read more on Sky News:Musk says Trump appears in Epstein filesRussian ambassador partly blames UK for Ukrainian drone attackFormer girlfriend tells Diddy trial of sex with male escorts  But this 2025 version of Trump's 2017 'Muslim ban' turns the so-called American dream into a nightmare for millions around the globe. President Trump claimed last weekend's firebomb attack in Boulder, Colorado, justified new travel restrictions. But a Vietnam veteran, drinking coffee with his family at the cafe in Virginia, didn't believe the latest ban would make America safer.  He said: \"I'm a firm believer in allowing immigration, and I think it's terrible that we're deporting people that really have never done anything wrong. \"They just happened to be in the wrong place at the wrong time, they get picked up by ICE (Immigration Compliance and Enforcement), and off they go.\" Trump's travel ban: The notable countries omitted - amid anger over 'moral disgrace' His nephew, seated beside him, told me those who think the travel ban is about security were \"misguided\". \"I think you fear what you don't understand,\" he said. When I asked what the administration doesn't understand, he replied: \"Other cultures.\""
    },
    {
        "title": "Americans are wearing biggest smiles in NATO defence spending battle",
        "description": "Everyone at NATO knows about battles.",
        "url": "https://news.sky.com/story/americans-are-wearing-biggest-smiles-in-nato-defence-spending-battle-13379723",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-pete-hegseth-us-defence-secretary_6935453.jpg?20250605194806",
        "type": "US",
        "Author": "Adam Parsons",
        "Date Published": "2025-06-05 17:13:00",
        "Headline": "Increased military spending may be good for global security, but until Europe expands its own defence industry, it's also excellent news for the US economy.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n  Everyone at NATO knows about battles. Sometimes you come out on top and sometimes you have to know when you're beaten. And here, it's the Americans who are wearing the biggest smiles. It has long been a mantra of President Trump that European nations should spend a lot more money on defence. During his first term in office, when he seemed to be deriding NATO on a regular basis, he amplified a debate that had long rumbled; now it feels like it's coming to a resolution.  Certainly there was a bounce in the step of US defence secretary Pete Hegseth when we spoke. \"We all need increased capabilities and we all need to spend more,\" he said. \"Thank you to President Trump for reviving this alliance. It was an alliance that was sleepwalking to irrelevance and President Trump, in his first term, said you need to step up and spend more. And he has in this term done the same.\" \n                  Serving coffee in America, under fear of death from the Taliban in Afghanistan\n                 \n                  Trump v Musk has got very messy very quickly, and TV's punchline writers will be the only winners\n                 \n                  Musk says Trump appears in Epstein files and $150bn wiped off Tesla's value as row between them explodes\n                 \"What I saw in there\", gesturing to the meeting rooms where all the ministers had met, \"were countries prepared to step up to push the limits of what they can do. That's a good thing. That's friends helping friends.\" Mr Hegseth came into this meeting in Brussels with one big demand - for NATO allies to bump up their defence spending to a total of 5% of GDP - more than any of them are spending at the moment. Of that, he believes that at least 3.5% should be going towards core defence spending - soldiers, planes, guns and so on - while a further 1.5% could be spent on other \"defence-related\" elements - infrastructure, espionage, civil defence. Pot one is clear. Pot two is vague - nobody seems quite sure what counts as \"defence-related\". Climate change resilience, for instance, has been suggested by some countries. That one will need clearing up. But even the 3.5% demand is a huge one. Over third of worldwide defence spending by US According to the latest data I've seen, only one NATO member presently spends above that target - and no, that isn't America.  It's Poland, which has ramped up military spending ever since neighbouring Ukraine was invaded. Lithuania, Estonia and Latvia have all done the same, nervously looking towards Russia. The United States sits at 3.4% of GDP. But that's 3.4% of a very big number, so it equates to an awful lot of spending. To put that in context, more than a third of worldwide spending on defence is carried out by America. Look at the top 10 nations in the world for defence spending, and America is top by a mile. It spends more than the other nine countries on that list put together. What's more, the vast majority of that money goes to American companies, and a great deal of it is shared among a relatively small number of those companies. Read more:Trump and Musk trade insultsRussia partly blames UK for drone attackTrump and Xi's 'very good' call Increased military spending may well be good for global security, but until such time as Europe expands its own defence industry, it's also excellent news for the American economy. Mark Rutte, the NATO secretary general, admitted that it was a huge challenge, but said that he would not accept countries simply kicking the financial can down the street. Countries will be monitored constantly to ensure they are making annual progress towards the 5% target. A finishing line hasn't been established yet, but it's probably going to be 10 years from now. Still, Rutte said he didn't want \"hockey sticks\" - the statistical model where things stay flat for a long time, and the big rise only comes at the end."
    },
    {
        "title": "Trump and China's Xi have 'very good' phone call and agree to more talks amid trade war",
        "description": "Donald Trump says he has had a \"very good\" phone call with Xi Jinping amid their ongoing trade war, during which they agreed to more tariff talks.",
        "url": "https://news.sky.com/story/trump-and-chinas-xi-have-phone-call-amid-trade-war-13379596",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-xi-jinping-donald-trump_6935139.jpg?20250605145713",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-05 13:26:00",
        "Headline": "Trade negotiations between the United States and China stalled shortly after a 12 May agreement between the two countries to reduce their tariff rates while talks took place.",
        "Content": "Donald Trump says he has had a \"very good\" phone call with Xi Jinping amid their ongoing trade war, during which they agreed to more tariff talks. Trade negotiations between the United States and China stalled shortly after a 12 May agreement between the two countries to reduce their rates on levies while talks took place. The call was first reported by Chinese state media and confirmed by the Chinese foreign ministry. According to Chinese state media, Mr Trump initiated the call with the Chinese president. In a post on his Truth Social platform, the US president said: \"I just concluded a very good phone call with President Xi of China, discussing some of the intricacies of our recently made, and agreed to, trade deal.\" He said the call lasted around an hour and a half and \"resulted in a very positive conclusion for both countries\". There \"should no longer be any questions\" on rare earth products, he said. \"The conversation was focused almost entirely on trade. Nothing was discussed concerning Russia/Ukraine, or Iran,\" Mr Trump added. He said the two nations had agreed to further tariff talks, and both leaders invited each other to visit their respective countries. According to Chinese state media, Mr Xi \"pointed out that it is especially important to correct the course of the big ship of China-US relations, which requires us to keep the rudder and set the direction, especially to remove all kinds of interference and even sabotage\". Mr Xi \"emphasised that the US should handle the Taiwan issue carefully\" to avoid the two countries being dragged \"into a dangerous situation of conflict and confrontation\". According to the readout of the call, Mr Trump \"expressed great respect for President Xi Jinping and the importance of the US-China relationship\". It came a day after Mr Trump declared it was difficult to reach a deal with his Chinese counterpart. \"I like President Xi of China, always have, and always will, but he is very tough, and extremely hard to make a deal with!!!,\" Mr Trump said in a post on Truth Social. The US president has cut his 145% tariffs on Chinese goods to 30% for 90 days to allow for talks, while China reduced its taxes on US goods from 125% to 10%. The trade war has produced sharp swings in global markets and threatens to damage trade between the two nations. Read more:Trump travel ban: The notable countries omittedWhat a weakening dollar means for US president Mr Trump's treasury secretary Scott Bessent had suggested only a conversation between the two leaders could resolve their differences in order for talks to begin in earnest. Mr Trump and Mr Xi last spoke in January, three days before his inauguration, where they discussed trade, as well as Mr Trump's demand for China to do more to stop the drug fentanyl from entering the US."
    },
    {
        "title": "Trump signs travel ban targeting 12 countries with 'hostile attitudes' to the US",
        "description": "Donald Trump has signed an order banning people from 12 countries from entering the US.",
        "url": "https://news.sky.com/story/president-trump-signs-travel-ban-targeting-12-countries-with-hostile-attitudes-to-the-us-13379358",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-trump-us-customs-border_6934928.jpg?20250605094223",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-05 00:53:00",
        "Headline": "The White House says it's the president's \"sacred duty to take action to ensure that those seeking to enter our country will not harm the American people\".",
        "Content": " Donald Trump has signed an order banning people from 12 countries from entering the US. He said Sunday's attack in Colorado had shown \"the extreme dangers\" of \"foreign nationals who are not properly vetted, as well as those who come as temporary visitors and overstay their visas\". \"We will not allow people to enter our country who wish to do us harm,\" the president said. Trump's travel ban: The notable countries omitted - amid anger over 'moral disgrace' The countries affected are: Afghanistan, Myanmar, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen. The White House said some had a \"significant terrorist presence\" and accused others of poor screening for dangerous individuals and not accepting deportees. People from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela will face partial restrictions. \n                  Serving coffee in America, under fear of death from the Taliban in Afghanistan\n                 \n                  Trump v Musk has got very messy very quickly, and TV's punchline writers will be the only winners\n                 \n                  Americans are wearing biggest smiles in NATO defence spending battle\n                 Mr Trump's proclamation said America must ensure people entering don't have \"hostile attitudes toward its citizens, culture, government, institutions, or founding principles\" - and don't support terror groups. The move echoes a controversial and chaotic order enacted eight years ago during his first term, when he banned people from predominately Muslim countries. The countries initially targeted then were Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen. President Trump said on Thursday that policy was a \"key part of preventing major foreign terror attacks on American soil\". His new list notably removes Syria after Mr Trump met its leader recently on a trip to the Middle East. Athletes competing in the 2026 World Cup and the 2028 Olympics will also be exempt, as will others such as permanent US residents and Afghans with special immigrant visas. US correspondent President Trump hailed travel restrictions imposed during his first term as \"one of our most successful policies\". It was also one of the most controversial, with what became known as \"the Muslim ban\" sparking widespread protest. Thousands gathered at US airports to oppose the detainment of travellers arriving from affected countries.\n The then German chancellor, Angela Merkel, said the fight against terrorism didn't justify suspicion of people based on their faith. Her French counterpart at the time, President Hollande, warned against the dangers of isolationism.\n Still smarting perhaps from that criticism, Trump announced his new ban with a commitment to \"not let what happened in Europe happen to America\".\n\n\n In addition to restrictions on 12 countries and partial restrictions on another seven, he warned others could be added as \"threats emerge around the world\". In a second proclamation, the US president escalated his war with Harvard University, suspending international visas for new students and authorising the secretary of state to consider revoking existing ones.  Having blamed Joe Biden for \"millions and millions\" of \"illegals\" in America, he issued a third proclamation ordering an investigation into the use of autopen during Biden's presidency. In a memorandum, President Trump claimed his predecessor's aides used autopen to sign bills in a bid to cover up his cognitive decline.\n\n If we didn't know what the Trump administration meant when they talked about \"flooding the zone\", we know now.\n The list was put together after the president asked homeland security officials and the director of national intelligence to compile a report on countries whose citizens could pose a threat. The ban takes effect from 9 June - but countries could be removed or added. The proclamation states it will be reviewed within 90 days, and every 180 days after, to decide if it should be \"continued, terminated, modified, or supplemented\". President Trump's first travel restrictions in 2017 were criticised by opponents and human rights groups as a \"Muslim ban\". It led to some chaotic scenes, including tourists, students and business travellers prevented from boarding planes - or being held at US airports when they landed. Mr Trump denied it was Islamophobic despite calling for a ban on Muslims entering America in his first presidential campaign. The ban faced legal challenges and was modified until the Supreme Court upheld a third version in June 2018, calling it \"squarely within the scope of presidential authority\"."
    },
    {
        "title": "Trump's new travel ban: The notable countries omitted - amid anger over 'moral disgrace'",
        "description": "Donald Trump has banned people from 12 countries entering the US, in a move he said protects against \"foreign terrorists\" and other security threats.",
        "url": "https://news.sky.com/story/what-you-need-to-know-about-trumps-travel-ban-13379431",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-us-customs-border-immigration_6934967.jpg?20250605110439",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-05 07:16:00",
        "Headline": "A new proclamation signed by Donald Trump means a total of 12 countries have been handed a full or partial ban from travelling to the US. Here is what you need to know.",
        "Content": " Donald Trump has banned people from 12 countries entering the US, in a move he said protects against \"foreign terrorists\" and other security threats. Some countries are subject to a full travel ban, while others are under a partial ban - with the order allowing countries to be removed or added from the list. The proclamation is due to come into effect just after midnight on 9 June local time. The ban echoes one in 2017 that Mr Trump implemented in his first term in the White House. This banned citizens from seven predominantly Muslim countries - Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen - from travelling to the US. Here is everything you need to know. Which countries are affected? The proclamation bans nationals from the following countries to travel to the US: • Afghanistan• Myanmar• Chad• Republic of the Congo• Equatorial Guinea• Eritrea• Haiti• Iran• Libya• Somalia• Sudan• Yemen. The following seven countries are affected by a partial ban: • Burundi• Cuba• Laos• Sierra Leone• Togo• Turkmenistan• Venezuela. Both bans will affect foreign nationals from the designated countries who are outside the US on 9 June or do not have a valid visa. Visas issued before 9 June when the law comes into force will remain valid, the proclamation states. How many people come to the US from these countries? From October 2023-September 2024 (the fiscal year), the US handed out more than 60,000 permanent visas to the 12 countries on the permanent ban list, according to data from the US Department of State. The highest by far was to people from Afghanistan - 39,055 - with the most going to nationals who are employed by or on behalf of the US government and their immediate family members. Under the new proclamation, Afghan nationals who hold special immigrant visas - people who worked most closely with the US government during the two-decade war there - are exempt from the ban. The figures below do not include people who were given temporary visas. Are there any exemptions? Mr Trump said on Thursday that policy was a \"key part of preventing major foreign terror attacks on American soil\". His new list notably leaves out Syria, after Mr Trump met its leader recently on a trip to the Middle East. Athletes competing in the 2026 World Cup, 2028 Olympics and other major sporting events will also be exempt. The ban also does not apply to the following individuals: • Diplomats travelling on valid non-immigration visas• Immediate family members who hold immigrant visas• People who have been adopted• Afghan nationals holding special immigrant visas• People who hold immigrant visas for ethnic and religious minorities facing \"persecution in Iran\"• Dual nationals who have citizenship in countries not included in the travel ban Why has the ban been introduced? The proclamation states that America must ensure people entering don't have \"hostile attitudes toward its citizens, culture, government, institutions, or founding principles\" - and don't support terror groups. In a video posted to social media, Mr Trump said an attack in Colorado, in which eight were injured, had shown \"the extreme dangers\" of \"foreign nationals who are not properly vetted, as well as those who come as temporary visitors and overstay their visas\". The suspect in the attack is from Egypt, a country that is not on Mr Trump's restricted list, but homeland security claimed he had overstayed a tourist visa. The list was put together after the president asked homeland security officials and the director of national intelligence to compile a report on countries whose citizens could pose a threat. The White House said some of the named countries had a \"significant terrorist presence\" and accused others of poor screening for dangerous individuals and not accepting deportees. Critics, however, suggest the move is really designed to further cultivate hostility to immigrants in general, and that the president's claim it is driven by security concerns is a lie. What has the reaction been? International aid groups and refugee resettlement organisations have condemned the new travel ban. \"This policy is not about national security - it is about sowing division and vilifying communities that are seeking safety and opportunity in the United States,\" said Abby Maxman, president of Oxfam America. The inclusion of Afghanistan has also angered some supporters, who have worked to resettle its people. Over a 12-month period to September 2024 there has been an estimated 14,000 arrivals from Afghanistan. Mr Trump suspended refugee resettlement on his first day in office. Shawn VanDiver, president and board chairman of the organisation #AfghanEvac, labelled the proclamation a \"moral disgrace\". \"To include Afghanistan - a nation whose people stood alongside American service members for 20 years - is a moral disgrace,\" he said. \"It spits in the face of our allies, our veterans, and every value we claim to uphold.\" Meanwhile, the Iranian government offered no immediate reaction to being included on the list. What happened in 2017? Mr Trump's first travel restrictions in 2017 were criticised by opponents and human rights groups as a \"Muslim ban\". It led to some chaotic scenes, including tourists, students and business travellers prevented from boarding planes - or being held at US airports when they landed. Mr Trump denied it was Islamophobic, despite calling for a ban on Muslims entering America in his first presidential campaign. The ban faced legal challenges and was modified until the Supreme Court upheld a third version in June 2018, calling it \"squarely within the scope of presidential authority\"."
    },
    {
        "title": "Bonuses for water bosses end - as six firms found guilty of most serious pollution breaches",
        "description": "Bosses at six water companies have been banned from receiving bonuses for the last financial year under new legislation that comes into force on Friday.",
        "url": "https://news.sky.com/story/bonuses-for-water-bosses-end-as-six-firms-found-guilty-of-most-serious-pollution-breaches-13379668",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-water-tap_6935279.jpg?20250605170452",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-06-05 21:30:00",
        "Headline": "Thames Water, Yorkshire Water, Anglian Water, Wessex Water, United Utilities and Southern Water all face the restriction on performance-related pay but Ofwat cannot prevent lost earnings being replaced by increased salaries.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n Bosses at six water companies have been banned from receiving bonuses for the last financial year under new legislation that comes into force on Friday. Senior executives at Thames Water, Yorkshire Water, Anglian Water, Wessex Water, United Utilities and Southern Water all face the restriction on performance-related pay for breaches of environmental, customer service or financial standards. All six companies committed the most serious 'Category 1' pollution breaches, with Thames responsible for six such incidents, as well as breaching financial resilience regulations when its credit rating was downgraded.  The nine largest water and wastewater providers paid a total of £112m in executive bonuses since 2014-15, though the 2023-24 total of £7.6m was the smallest annual figure in a decade. The new rules give water industry regulator Ofwat the power to retrospectively prevent bonuses paid in cash, shares or long-term incentive schemes to chief executives and chief financial officers for breaches in a given financial year. Ofwat cannot, however, prevent lost bonuses being replaced by increased salaries, as routinely happened in the banking sector when bonus pots were capped following the financial crisis. Government sources insist they do not want to cap executive pay, but suggested the regulator could consider expanding its powers to ensure any remuneration is covered by shareholder funds rather than customer bills. \n                  Thames Water creditors line up McTighe to spearhead rescue deal\n                 \n                  Thames crisis underlines scale of water industry turnaround task\n                 \n                  Thames Water survival hopes suffer fresh blow\n                 Water suppliers have routinely defended executive bonuses and pay on the grounds that awards are necessary to attract and retain the best talent to lead complex, multi-stakeholder organisations. Thames Water's chief executive, Chris Weston, was paid a bonus of £195,000 three months after joining the company in January 2024, taking his total remuneration to £2.3m.   Last month, the company withdrew plans to pay \"retention\" bonuses of up to 50% of annual salary to senior executives after securing an emergency £3bn loan intended to keep the company afloat into next year. Earlier this week, its preferred equity partner, US private equity giant KKR, walked away from a deal to inject £4bn despite direct lobbying from 10 Downing Street, in part because of concern over the negative political sentiment towards the water industry. The decision came a few days after Thames was hit with a record fine of £123m for multiple pollution incidents and breaching dividend payment rules. Welcoming the bonus ban, the Environment Secretary Steve Reed said: \"Water company bosses, like anyone else, should only get bonuses if they've performed well, certainly not if they've failed to tackle water pollution. \"Undeserved bonuses will now be banned as part of the government's plan to clean up our rivers, lakes and seas for good.\" Read more:Water boss defends six-figure bonusThames Water fined £123mYorkshire Water fined £40m Whitehall sources say they \"make no apology\" for calling out water company conduct, despite concerns raised by an independent reviewer that negative sentiment and misdirected regulation has put off investors and raised the cost of financing the privatised system. In an interim report, former Bank of England deputy governor Sir Jon Cunliffe said \"negative political and public narrative and Ofwat's approach to financial regulation have made the sector less attractive\". Sir Jon will publish final recommendations to reform water regulation next month, with the aim of addressing public concerns over pollution and customer service, while attracting long-term, low-risk, low-return investors. Water bills will rise on average by 36% over the next five years as companies pledge to spend £103bn on operating, maintaining, and improving infrastructure, including £12bn on cutting sewage spills."
    },
    {
        "title": "Trump and China's Xi have 'very good' phone call and agree to more talks amid trade war",
        "description": "Donald Trump says he has had a \"very good\" phone call with Xi Jinping amid their ongoing trade war, during which they agreed to more tariff talks.",
        "url": "https://news.sky.com/story/trump-and-chinas-xi-have-phone-call-amid-trade-war-13379596",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-xi-jinping-donald-trump_6935139.jpg?20250605145713",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-05 13:26:00",
        "Headline": "Trade negotiations between the United States and China stalled shortly after a 12 May agreement between the two countries to reduce their tariff rates while talks took place.",
        "Content": "Donald Trump says he has had a \"very good\" phone call with Xi Jinping amid their ongoing trade war, during which they agreed to more tariff talks. Trade negotiations between the United States and China stalled shortly after a 12 May agreement between the two countries to reduce their rates on levies while talks took place. The call was first reported by Chinese state media and confirmed by the Chinese foreign ministry. According to Chinese state media, Mr Trump initiated the call with the Chinese president. In a post on his Truth Social platform, the US president said: \"I just concluded a very good phone call with President Xi of China, discussing some of the intricacies of our recently made, and agreed to, trade deal.\" He said the call lasted around an hour and a half and \"resulted in a very positive conclusion for both countries\". There \"should no longer be any questions\" on rare earth products, he said. \"The conversation was focused almost entirely on trade. Nothing was discussed concerning Russia/Ukraine, or Iran,\" Mr Trump added. He said the two nations had agreed to further tariff talks, and both leaders invited each other to visit their respective countries. According to Chinese state media, Mr Xi \"pointed out that it is especially important to correct the course of the big ship of China-US relations, which requires us to keep the rudder and set the direction, especially to remove all kinds of interference and even sabotage\". Mr Xi \"emphasised that the US should handle the Taiwan issue carefully\" to avoid the two countries being dragged \"into a dangerous situation of conflict and confrontation\". According to the readout of the call, Mr Trump \"expressed great respect for President Xi Jinping and the importance of the US-China relationship\". It came a day after Mr Trump declared it was difficult to reach a deal with his Chinese counterpart. \"I like President Xi of China, always have, and always will, but he is very tough, and extremely hard to make a deal with!!!,\" Mr Trump said in a post on Truth Social. The US president has cut his 145% tariffs on Chinese goods to 30% for 90 days to allow for talks, while China reduced its taxes on US goods from 125% to 10%. The trade war has produced sharp swings in global markets and threatens to damage trade between the two nations. Read more:Trump travel ban: The notable countries omittedWhat a weakening dollar means for US president Mr Trump's treasury secretary Scott Bessent had suggested only a conversation between the two leaders could resolve their differences in order for talks to begin in earnest. Mr Trump and Mr Xi last spoke in January, three days before his inauguration, where they discussed trade, as well as Mr Trump's demand for China to do more to stop the drug fentanyl from entering the US."
    },
    {
        "title": "Energy costs 'an anchor on our ambition', CBI chief warns government",
        "description": "The head of a major business lobby group is warning that energy bills in the UK are an \"anchor\" on private sector ambitions, exacerbating the effects of an annual &#163;24bn burden from government costs.",
        "url": "https://news.sky.com/story/energy-costs-an-anchor-on-our-ambition-cbi-chief-warns-government-13379409",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-cbi-rain-newton-smith_6757380.jpg?20241125102239",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-05 06:11:00",
        "Headline": "CBI boss Rain Newton-Smith argues that high energy bills are not just an additional cost burden but a strain on private sector jobs and growth.",
        "Content": "The head of a major business lobby group is warning that energy bills in the UK are an \"anchor\" on private sector ambitions, exacerbating the effects of an annual £24bn burden from government costs. CBI boss Rain Newton-Smith was to tell the body's annual business dinner in London that a \"serious\" plan was needed to address the energy issue, arguing it was holding back investment and the country's competitiveness. A reliance on natural gas has meant that both households and businesses have been exposed to volatile prices since Russia's invasion of Ukraine. Money latest: Cheapest cars to insure in the UK revealed The CBI says UK companies pay 50% more for their energy than counterparts in France and Germany - and four times more than comparable operators in the US and Canada. Ms Newton-Smith was to tell her audience of business leaders and politicians that 40% of UK firms were holding back on investment due to punitive energy costs alone. She argued they were on top of an estimated extra £24bn a year in tax and wage hikes imposed by government. \n                  Bonuses for water bosses end - as six firms found guilty of most serious pollution breaches\n                 \n                  Trump and China's Xi have 'very good' phone call and agree to more talks amid trade war\n                 \n                  Money blog: Nationwide cuts mortgage rates; Nintendo Switch gamers queue for new console\n                 They included three increases to minimum pay rates since the 2023/24 financial year and rises to employer national insurance contributions which came into force in April.  The CBI said Ms Newton-Smith will say: \"Business is now straining under £24bn in extra costs per year. \"That's more than the cost of Crossrail. More than the Home Office budget - on business, every year.\" She will add: \"With costs running so high, there is one issue we absolutely must tackle. \"Without it, any industrial strategy, any serious plan for economic security will fall flat on its face. Energy.\" She will say the rising cost of energy \"isn't just a cost issue\". \"It's a jobs issue. An investment issue. A security issue. \"Because how can UK business compete with one hand tied behind its back - and the other straining to keep the lights on? \"This is an anchor on our ambition. A crack in our economic security. And it must be fixed.\" The CBI's suggestions include removing policy costs from electricity bills and a focus on low-carbon energy to help achieve economic security. The latter wish has formed the centrepiece of the Labour government's approach, arguing that a push for renewable energy is a key pathway to bring down bills, emissions and grow the economy at the same time. A government spokesperson said: \"Through our sprint to clean power, we will get off the rollercoaster of fossil fuel markets - protecting business and household finances with clean, homegrown energy that we control. \"We are already bringing energy costs for key UK industries closer in line with other major economies through the British industry supercharger - saving businesses £5bn over the next 10 years.\""
    },
    {
        "title": "Harry Kane-backed SeatUnique to score with £10m funding ",
        "description": "A premium ticketing platform backed by the England football captain Harry Kane is raising a further &#163;10m in funding to take advantage of the fast-growing \"experience economy\".",
        "url": "https://news.sky.com/story/harry-kane-backed-seatunique-to-score-with-16310m-funding-13379515",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-harry-kane-football_6856566.jpg?20250314185737",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-05 10:06:00",
        "Headline": "The premium ticketing start-up, which is also backed by England cricketer Ben Stokes, is close to finalising the additional funding from existing investors, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A premium ticketing platform backed by the England football captain Harry Kane is raising a further £10m in funding to take advantage of the fast-growing \"experience economy\". Sky News has learnt that SeatUnique, which is run by co-founder Robin Sherry, is in talks to secure the new capital in an extension of its recent Series A round. The funding is expected to be committed entirely by existing investors, led by Nickleby Capital, which has backed a string of technology unicorns. Money latest: Cheapest cars to insure in the UK revealed SeatUnique has deals with venues such as Wembley Stadium, Manchester's Co-op Live arena and the 16 racecourses operated by Arena Racing. A number of additional contracts are said to be under negotiation. Ben Stokes, the England men's Test cricket captain, and Dame Jessica Ennis-Hill, the 2012 Olympic heptathlon champion, are also backers of SeatUnique. \n                  Bonuses for water bosses end - as six firms found guilty of most serious pollution breaches\n                 \n                  Trump and China's Xi have 'very good' phone call and agree to more talks amid trade war\n                 \n                  Energy costs 'an anchor on our ambition', CBI chief warns government\n                 One source close to the situation said the new funding was likely to be followed by a much larger Series B fundraising next year. The company is chaired by Richard Flint, the former SkyBet chief who also chairs the investment platform Hargreaves Lansdown. It markets original ticketing inventory, unlike secondary platforms which have come under growing political pressure for their treatment of consumers. SeatUnique declined to comment on its Series A extension."
    },
    {
        "title": "British Airways-owner IAG braced for turbulence over pay",
        "description": "The owner of British Airways (BA) is the latest in a string of blue-chip London-listed companies to face investor unrest this year over its executives' multimillion pound pay packages.",
        "url": "https://news.sky.com/story/british-airways-owner-iag-braced-for-turbulence-over-pay-13379473",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-london-city-airport_6811205.jpg?20250126144325",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-05 09:27:00",
        "Headline": "Shareholders in International Airlines Group have been told to oppose a new pay policy that could hand its boss a one-off share award worth more than £2.7m, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of British Airways (BA) is the latest in a string of blue-chip London-listed companies to face investor unrest this year over its executives' multimillion pound pay packages. Sky News has learnt that International Airlines Group (IAG) is braced for a shareholder revolt at its annual meeting on 18 June over a remuneration policy that will include a one-off share award potentially worth more than £2.7m to Luis Gallego, its chief executive. Institutional Shareholder Services (ISS), the influential proxy voting adviser, has recommended that investors vote against the award, which would vest based on a three-year performance period ending in 2028. Money latest: Cheapest cars to insure in the UK revealed The share windfall would be in addition to Mr Gallego's salary, annual bonus and regular incentive award. \"The one-time award is tied to operating margin performance above the company's medium-term ambition,\" ISS said in a report to clients which has been seen by Sky News. \"The company states that this proposal aims to align the CEO's compensation package with senior management, address pay compression, enhance competitiveness, and bring the CEO's pay closer to comparable FTSE peers. \n                  Plane fire at Gatwick Airport broke out after pilot mixed up left and right hands, report finds\n                 \n                  Heathrow in talks with airlines about terminal shake-up\n                 \n                  British Airways flights delayed after 'technical issue'\n                 \"While the company's rationale is noted, material concerns are identified with the concurrent operation of the one-time award and the existing RSP [restricted stock plan], particularly as no reduction has been made to the RSP opportunity.\" Remuneration policy votes are binding on companies, although the level of opposition that IAG was facing was unclear. Since the disruption caused by the COVID pandemic, IAG's performance has recovered strongly, with the company reporting stronger-than-expected first-quarter profits last month. On Thursday, shares in IAG were trading at around 331p, giving the company a market capitalisation of more than £15.7bn. IAG, which also owns Aer Lingus and Iberia, has been contacted for comment."
    },
    {
        "title": "Trade war: What a weakening dollar means for Trump - and the UK",
        "description": "The weakening of the US dollar has arguably been the story of the year for financial markets.",
        "url": "https://news.sky.com/story/trade-war-what-a-weakening-dollar-means-for-trump-and-the-uk-13379435",
        "image_url": "https://e3.365dm.com/22/09/1920x1080/skynews-pound-dollar-currency_5911337.jpg?20220926120720",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-06-05 07:25:00",
        "Headline": "The implications are huge, not only for Americans but also for countries holding the world's reserve currency and any asset priced in dollars. ",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The weakening of the US dollar has arguably been the story of the year for financial markets. The mighty greenback is the world's reserve currency by virtue of the fact that so many nations and investors hold it. But it has taken a mighty tumble under the Donald Trump 2.0 presidency - to the point this week that the dollar index, which measures it against six other major currencies, is down 9% this year and on course for its worst annual performance since 2017. Money latest: New blow for Musk as Tesla sales plunge It is no coincidence that that decline also took place under a Trump-controlled White House. The reasons for it are similar, but against a far weaker domestic and global economic backdrop than seen last time round. Why is the dollar falling?  \n                  Serving coffee in America, under fear of death from the Taliban in Afghanistan\n                 \n                  Trump v Musk has got very messy very quickly, and TV's punchline writers will be the only winners\n                 \n                  Americans are wearing biggest smiles in NATO defence spending battle\n                 It all forms part of the wider investor turmoil over the president's trade war, its implications for the US economy and, crucially, the impact of his agenda on the public finances. The main cause for concern recently had been the potential for recession in the world's largest economy due to trade war import duties - tariffs - stoking inflation. The fallout has damaged the potential for interest rate cuts by the US central bank - a scenario that would normally be supportive of a currency. But attention has increasingly turned towards the US budget deficit and total debt pile, given Mr Trump's controversial tax cut and spending hike plans. Independent figures suggest they will add about $2.4trn to the $36.2trn total for US government debt - a debt pile that has become more expensive to service. 👉 Follow Trump100 on your podcast app 👈 This isn't good news for Trump's popularity, surely? It's fair to say weaker stock markets, bond sell-offs and a weaker dollar are not the reactions the president wants to see at the start of his second term. For all the headline-seeking slogans of \"America First\" and \"Make America Great Again\", the on-off trade war designed to restore US manufacturing might and jobs is taking a toll. It explains the tax cut push, but the president cannot escape the fact that federal, corporate and personal finances - such as investments and pension values - have taken a hit. Despite that, YouGov poll data this week showed that for the first time in two months, less than half of US adult citizens strongly or somewhat disapproved of how he was handling the job. What does it all mean for Americans? If you strip out the short-term hits to pensions and asset values, a weaker dollar will offset some of the additional tariff-related costs paid by importers to the US, as a dollar will go further when buying goods in a currency that has strengthened. In theory, it will help limit the impact of any rising costs paid by consumers once goods have made their way down the supply chain. Conversely, Americans heading abroad will find their buck doesn't get them as much. Read more:The problem facing the UK as US trade deal deadline loomsUK escapes Trump's increased 50% tariffs How about for us Brits?  We have not been immune from the market turmoil - with pension and fund holdings (especially those containing US interests) taking a knock. The weaker dollar is bad news for UK-based firms booking dollar earnings back home as they won't go as far when recorded in pounds. But a weaker dollar means a pound will go further if you're travelling to the US. Sterling is more than 8% up versus the dollar in the year to date and the spot rate currently stands at $1.3566 - around levels last seen in 2022. Travel money sites suggested that UK tourists heading stateside would get a conversion around the $1.3230 level. What about the outlook?  Much will depend on how the Trump trade war plays out in the months ahead. These values say more about the dollar weakness than pound strength because the UK has many similar challenges to the US - sticky inflation, worries about the sustainability of government debt and weak growth. The currency shift MAY help to further reduce UK inflationary pressure. It is hoped, for example, that the weakening dollar will continue to help drive down oil costs. Brent crude - priced in dollars, crucially, - struck a four-year low in April and a barrel is currently $1 above that level at $64."
    },
    {
        "title": "Scottish Labour win Hamilton, Larkhall and Stonehouse by-election as SNP suffer shock defeat",
        "description": "Scottish Labour's Davy Russell has won the Hamilton, Larkhall and Stonehouse by-election.",
        "url": "https://news.sky.com/story/scottish-labour-win-hamilton-larkhall-and-stonehouse-by-election-13379805",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-davy-russell-scottish-labour_6935574.jpg?20250606021146",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-06-05 23:00:00",
        "Headline": "Voters in South Lanarkshire went to the polls on Thursday following the death of SNP MSP Christina McKelvie.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n  Scottish Labour's Davy Russell has won the Hamilton, Larkhall and Stonehouse by-election. Mr Russell took top spot with 8,559 votes. The SNP placed second with 7,957 votes, with Reform UK closely taking third with 7,088 votes. The new MSP said he was \"proud\" to have been elected, adding: \"I said in this campaign that I will put this community, our community first. \"I will work every single day to do that.\" The by-election was called following the death of SNP MSP Christina McKelvie. The Scottish government minister died in March at the age of 57, having last year taken medical leave to undergo treatment for secondary breast cancer. South Lanarkshire councillor Katy Loudon had hoped to retain the Holyrood seat for the SNP, given her party's heavy losses to Labour at last year's UK general election. \n                  Hamilton, Larkhall and Stonehouse by-election: Polls close and count begins to replace late MSP\n                 \n                  Liz Truss was 'right' to be radical, but the numbers need to 'add up', shadow chancellor Sir Mel Stride tells Sky News\n                 \n                  Hamilton, Larkhall and Stonehouse by-election: Who are the candidates?\n                 First Minister John Swinney congratulated Mr Russell following the result. In a post on X, the SNP leader said Ms Loudon had \"fought a superb SNP campaign\". He added: \"We have made progress since the election last year but not enough. We still have work to do and we will do it.\" All eyes were also on Reform UK and whether it would enjoy a \"tartan bounce\" in light of the party's recent slew of local election wins in England. With Reform UK never having won an election in Scotland, party deputy leader Richard Tice said candidate Ross Lambie coming in third was a \"massive boost for us\". He added: \"It's a fantastic result, just a few hundred votes away from the SNP, nobody predicted that. \"I think that sets us up with excitement and momentum for the next 11 months into the Holyrood elections.\" Mr Russell said the constituents had voted to \"take a new direction\" with his party. He added: \"Like the people here in Hamilton, Larkhall and Stonehouse, and right across Scotland, we all feel we have been let down by the SNP. \"They've broken our NHS, wasted our money, and after nearly two decades they don't deserve another chance.\" Mr Russell said the community had also \"sent a message\" to Reform UK leader Nigel Farage \"and his mob tonight\". He added: \"The poison of Reform isn't us, it isn't Scotland, and we don't want your division here. \"Reform have no real answers to the issues we face, and they can't beat the SNP here or replace them across Scotland.\" Mr Russell said his party was ready to \"fix\" the NHS and \"end the SNP's addiction to wasting your money\". He added: \"The road to a new direction for Scotland in 2026 - with Anas Sarwar as first minister and a Scottish Labour government - begins right here. So, let's go and win it together.\" Ten candidates went head-to-head in the Holyrood by-election: • Collette Bradley, Scottish Socialist Party - 278 votes• Andy Brady, Scottish Family Party - 219 votes• Ross Lambie, Reform UK - 7,088 votes• Katy Loudon, Scottish National Party (SNP) - 7,957 votes• Janice MacKay, UK Independence Party (UKIP) - 50 votes• Ann McGuinness, Scottish Green Party - 695 votes• Aisha Mir, Scottish Liberal Democrats - 533 votes• Richard Nelson, Scottish Conservative and Unionist Party - 1,621 votes• Davy Russell, Scottish Labour Party - 8,559 votes• Marc Wilkinson, Independent - 109 votes The votes were verified and manually counted at South Lanarkshire Council headquarters in Hamilton. Campaigning became heated in the run up to the by-election, with Reform UK accused of running a \"racist\" ad on Facebook against Scottish Labour leader Anas Sarwar. Reform leader Mr Farage continued to double down, accusing his rival of \"sectarian politics\". Read more from Sky News:'Farage could become PM - this is how Labour can stop him'Prisoners to be transferred to lower security jails In response, the Scottish Labour MSP branded Mr Farage a \"poisonous little man\" and accused him of running a \"campaign of dirt and smear\". First Minister Mr Swinney had earlier warned it was a \"two-horse race\" between the SNP and Reform UK, urging voters to \"defeat the gutter politics\" of Mr Farage. With less than a year to go before the Scottish parliament election, the result potentially offers a snapshot of how the political landscape north of the border could look in 2026. Mr Sarwar said: \"I think people need to change the script, because we've proven the pollsters wrong. \"We've proven the commentators wrong, we've proven the bookies wrong. We've proven John Swinney wrong and so many others wrong too.\""
    },
    {
        "title": "Kemi Badenoch to launch review into ECHR exit ",
        "description": "Kemi Badenoch is to launch a review into whether the UK should leave the European Convention on Human Rights (ECHR) - and set out plans to revive a Rwanda-style deportation scheme. ",
        "url": "https://news.sky.com/story/kemi-badenoch-to-launch-review-into-echr-exit-13379434",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kemi-badenoch-eu-deal_6921527.jpg?20250519153132",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-05 07:24:00",
        "Headline": "The Tory leader wants to \"bring the shadow cabinet together\" on an issue that has long divided the party.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Kemi Badenoch is to launch a review into whether the UK should leave the European Convention on Human Rights (ECHR) - and set out plans to revive a Rwanda-style deportation scheme.  In a speech on Friday, the Conservative leader will announce a commission into how lawyers could be prevented from using international legislation to block government decisions on immigration. Politics Live: Senior Tory to take aim at Truss and Farage in speech She will also announce plans to prevent people who arrive by small boat from claiming asylum and deport them to a third country. It is unclear if this would be Rwanda or another location. One of Labour's first acts in government was to scrap the Tories' Rwanda scheme, which would have deported illegal immigrations to the African nation for them to claim asylum there. The plan was held up by a series of legal challenges and ultimately failed to get off the ground before the election, despite around £700m being spent on it, according to the Home Office. \n                  'She's a goner': Dominic Cummings predicts timing of Kemi Badenoch's downfall\n                 \n                  Nigel Farage's big announcement will pile more pressure on PM\n                 \n                  Kemi Badenoch rules out 'any coalitions' with Reform at 'national level'\n                 The saga sparked a debate within the Tory party about whether the UK would need to leave the ECHR, which was established after the Second World War and sets out the rights and freedoms of people in the 46 countries signed up to it. During the Conservative leadership race, Ms Badenoch said leaving the ECHR wasn't a \"silver bullet\" and \"not even the most radical thing that we probably will have to do\" to control immigration. It put her at odds with her rival Robert Jenrick, now the shadow justice secretary, who claimed the Tories would \"die\" if they did not back exiting the ECHR.  Ms Badenoch's commission will be chaired by Tory peer and former justice minister Lord Wolfson of Tredegar, the shadow attorney general. A Conservative Party aide close to the detail said: \"Kemi has worked hard to bring the shadow cabinet together on this very difficult issue. \"She has always said she will take her time to build a proper, workable plan to tackle the issue of the courts subverting parliamentary democracy. This commission, led by the brilliant lawyer Lord Wolfson, will make sure we're ready to take the tough decisions.\" Reform UK leader Nigel Farage, who has enjoyed a meteoric rise in the polls since the general election, has also said he would leave the ECHR. Read More:What are Starmer's new immigration rules?'Farage could become PM - this is how Labour can stop him' Labour's policy is to remain in it, but to bring forward legislation to \"ensure it is the government and parliament that decides who should have the right to remain in the UK\". According to the immigration white paper unveiled last month, this would address cases where Article 8 right to family life legal arguments have been used to frustrate deportation, often in the case of foreign criminals. Article 8 was also used in the case of a Palestinian family fleeing Gaza after they applied to enter the UK through a Ukrainian refugee scheme. Home Secretary Yvette Cooper told the Home Affairs Select Committee on Tuesday that family migration has become \"so complex\" that courts are applying \"exceptional\" human rights guarantees to about a third of cases. She said: \"The proportion of decisions being taken as exceptional - often under interpretations around Article 8 - end up being about 30 percent of the cases. That is not exceptional, that is a much broader proportion.\" However, she rejected calls to disapply the ECHR, saying compliance with international law has helped the government strike deals with France and Germany to help crack down on criminal gangs. She said the government will draw up a \"clear framework\" that will be \"much easier for the courts to interpret and will reflect what the public want to see\"."
    },
    {
        "title": "Zia Yusuf: Chairman of Reform UK resigns",
        "description": "The chairman of Reform UK, Zia Yusuf, has resigned.",
        "url": "https://news.sky.com/story/zia-yusuf-chairman-of-reform-uk-resigns-13379706",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-reform-uk-zia-yusuf_6932379.jpg?20250601104858",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-05 16:26:00",
        "Headline": "The unelected chair of the party stood down from his role in the party, following a row in which he called a question from a Reform MP about banning burkas \"dumb\".",
        "Content": "The chairman of Reform UK, Zia Yusuf, has resigned. Mr Yusuf said in a post on X that working to get the party elected is no longer \"a good use of my time\". He said: \"11 months ago I became chairman of Reform. I've worked full time as a volunteer to take the party from 14 to 30%, quadrupled its membership and delivered historic electoral results. \"I no longer believe working to get a Reform government elected is a good use of my time, and hereby resign the office.\" Politics latest: PM dodges more questions on benefits It comes after a row in which he described a question to Sir Keir Starmer about a ban on burkas from his party's newest MP Sarah Pochin as \"dumb\". Many credited businessman Mr Yusuf with professionalising the party's operations after they secured millions of votes at last year's general election. \n                  The big mistake Labour think Nigel Farage has made - and how the chancellor hopes to capitalise  \n                 \n                  Hamilton, Larkhall and Stonehouse by-election: Who are the candidates?\n                 \n                  Will Scotland ride the 'Farage tsunami' at the Hamilton by-election like England has with Reform?\n                 Read more:Can chancellor take advantage of Farage mistake?Charges against Rupert Lowe dropped Reacting to the news, party leader Nigel Farage said: \"I am genuinely sorry that Zia Yusuf has decided to stand down as Reform UK chairman. \"As I said just last week, he was a huge factor in our success on 1 May and is an enormously talented person. \"Politics can be a highly pressured and difficult game and Zia has clearly had enough. He is a loss to us and public life.\" Deputy leader Richard Tice said the party would \"not be where we are today without him\". Rupert Lowe, a former Reform MP, was less complimentary. He said: \"The question is - how did a man with no political experience be given such vast power within Reform?\" Mr Lowe added that he is still taking legal action against Mr Yusuf. In March, Reform referred Mr Lowe to police over allegations including threats of physical violence against Mr Yusuf. Prosecutors later said they would not bring charges against Mr Lowe, who was suspended by the party. The latest row in the party stemmed from the newly elected Reform MP asking a question to the prime minister in the Commons on Wednesday. She asked if the burka would be banned \"in the interests of public safety\". Political correspondent Zia Yusuf quitting as Reform's chairman is unlikely to dent the party's surging popularity in the polls.\n For many supporters, Nigel Farage is the party - and so long as he's there, they'll back Reform.\n But since the last general election, Farage has wanted to transform Reform from merely being a popular party and into a credible force in British politics.\n That means more seats at Westminster - they still only have five MPs.\n They want to do what the Lib Dems did last time - transform popularity into seats.\n Both parties got a similar vote share, but the Lib Dems got more than 70 MPs out of it, thanks to our first-past-the-post voting system.\n Yusuf was the man behind that effort. His departure might not hurt Reform's polling numbers, but where it will hurt them is translating that into more of a credible machine. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Sir Keir Starmer declined to \"follow her down that line\", before taking the opportunity to attack Reform's economic policies. Mr Yusuf later said on social media that it was a \"dumb\" question for Ms Pochin to ask, and said it was not party policy.  Responding to Mr Yusuf's resignation, a Labour spokesperson said: \"If Nigel Farage can't manage a handful of politicians, how on earth could he run a country? He has fallen out with everyone he has ever worked with.\" Lib Dem deputy leader Daisy Cooper MP said: \"It's already clear Reform UK cannot deliver for the communities they are elected to stand up for. Instead, they have copied the Conservative playbook of fighting like rats in a sack.\""
    },
    {
        "title": "Ministers share 'same frustrations' over Gaza war as protesters, says Wes Streeting",
        "description": "Ministers share the \"same frustrations\" over the Gaza war as protesters, Wes Streeting has said.",
        "url": "https://news.sky.com/story/ministers-share-same-frustrations-over-gaza-war-as-protesters-says-wes-streeting-13379684",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-palestine-gaza-israel_6935318.jpg?20250605172119",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-06-05 16:11:00",
        "Headline": "The health secretary called the situation in Gaza a \"horror show\", with the UN saying most people are at risk of famine after an 11-week aid blockade by Israel.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Ministers share the \"same frustrations\" over the Gaza war as protesters, Wes Streeting has said. The health secretary said Prime Minister Sir Keir Starmer and Foreign Secretary David Lammy are \"working intensively\" with international allies to try to bring the conflict to an end. This includes the return of Israeli hostages from Gaza and a ceasefire - \"and crucially, the establishment of an independent Palestinian state\", he said. Politics latest: Reform chair quits after disagreement over burka ban Mr Streeting added: \"Those of us who are in positions of power in government share all the same frustrations that the people who are marching on the streets because we want to see an end to this conflict, we want to see peace for Israelis and for Palestinians, and we want to see justice and statehood for the Palestinian people.\" He called the situation in the coastal territory \"a horror show\" and said the UK is working with international allies to try to get more aid into Gaza. But, he said international leaders have not \"delivered the results that we want to see\". \n                  Bodies of husband and wife taken into Gaza by Hamas recovered after special operation by Israeli forces\n                 \n                  Hundreds of thousands in Gaza 'catastrophically food insecure', says aid chief\n                 \n                  UK 'appalled' by reports of Palestinians killed while trying to reach new Gaza aid sites\n                 On whether Israel is committing genocide, Mr Streeting said: \"That's a question for international courts to weigh up. \"Whether or not we use that term and whether or not the courts make that judgment doesn't alter the fact that we can see with our own eyes - that innocent children are dying in great numbers. \"They are either starving or they are being bombed. And it's not just children, it's other innocent civilians, it's civilian infrastructure.\" Read more:Israeli hostages' bodies recovered from GazaHundreds of thousands in Gaza 'catastrophically food insecure' A new Israel and US-backed aid system launched last week was paused on Wednesday and part of Thursday after dozens of Palestinians were killed as they attempted to collect aid in southern Gaza on Tuesday. The Gaza Humanitarian Foundation reopened two distribution sites on Thursday as the UN warned most of Gaza's 2.3m population is at risk of famine after the 11-week Israeli blockade.  Data collected by the UN from humanitarian groups found the rate of young children suffering from acute malnutrition in Gaza has nearly tripled since a ceasefire earlier this year when aid flowed more freely than it is now.  Around 5.8% out of nearly 50,000 children under five screened in the second half of May were diagnosed with acute malnutrition. This was up from 4.7% in early May and nearly three times the rate in February during a pause in fighting in the 20-month war between Israel and Hamas. Also on Thursday, Israel announced it had recovered the bodies of two dual-nationality Israeli-American hostages in their 70s, Gadi Hagi and his wife Judy Weinstein-Hagi, who were killed in Hamas' 7 October attack then taken to Gaza. At least 20 Palestinians were killed in Israeli strikes across Gaza on Thursday, including four journalists in a hospital, the Hamas-run local health authority said."
    },
    {
        "title": "Prisoners to be transferred to lower security jails to ease overcrowding",
        "description": "Prisoners are to be transferred to lower security jails in an effort to ease overcrowding, as part of a new measure quietly unveiled by the government.",
        "url": "https://news.sky.com/story/prisoners-to-be-transferred-to-lower-security-jails-to-ease-overcrowding-13379713",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prison-officer-prisons_6932011.jpg?20250531160740",
        "type": "Politics",
        "Author": "Mollie Malone",
        "Date Published": "2025-06-05 16:48:00",
        "Headline": "From Monday, offenders serving standard sentences can be transferred to open or category D prisons up to three years earlier than previously.",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n Prisoners are to be transferred to lower security jails in an effort to ease overcrowding, as part of a new measure quietly unveiled by the government. Sky News understands that as of Monday, offenders serving standard sentences can be transferred to open or category D prisons up to three years earlier than previously, to free up space in higher security jails. Open prisons have minimal security and allow eligible prisoners to spend time on day release away from the prison on licence conditions to carry out work or education. It's unclear how many prisoners this will apply to, but the majority of those in prison custody serve standard determinate sentences. This is an extension of a policy which previously existed, as the prison service is warned of urgent capacity pressures. Exemptions will include sex offenders, terrorists, violent criminals, those convicted of stalking, and prisoners serving a sentence of over four years. It could mean those convicted of domestic abuse-related crimes are eligible for transfer to open prisons. The Prison Governors' Association told Sky News it has \"concerns\" about the measure. \"This would still mean that after just two weeks in prison a man serving a seven and a half year prison sentence could be moved to an open prison, where there are no physical barriers like high walls, fences, secure gates and minimal staff supervision that could prevent prisoners from simply walking out,\" the association said in a statement. Prison governors will have some discretion to judge the risk of the move, but it's understood the \"presumption\" will be that the transfer should take place. Despite early release measures, prisons in England and Wales continue to face chronic overcrowding. The male estate is currently operating at around 98% capacity. Read more from Sky News:Russian ambassador partly blames UK for Ukrainian drone attackTrump 'disappointed' with Musk after he turned on 'beautiful bill' This latest measure comes after the government accepted recommendations made in the sentencing review, which will see almost 10,000 fewer people sent to prison in the next three years. However, these measures will take time to become legislation. A Ministry of Justice spokesperson said: \"We are building new prisons and are on track for 14,000 places by 2031 - the largest expansion since the Victorians. Our sentencing reforms will also force prisoners to earn their way to release or face longer in jail for bad behaviour, while ensuring the most dangerous offenders can be kept off the street. \"Only certain thoroughly risk-assessed offenders are eligible for moves to open prison and anyone found breaching the rules can be immediately returned to a closed prison.\""
    },
    {
        "title": "Spending review 2025: How much cash will Rachel Reeves give to each government department?",
        "description": "Chancellor Rachel Reeves is set to announce how much cash each government department will get over the next few years at the spending review on 11 June.",
        "url": "https://news.sky.com/story/spending-review-how-much-cash-will-rachel-reeves-give-to-each-government-department-13379725",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-rachel-reeves-derby_6916959.jpg?20250605215018",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-06-05 17:14:00",
        "Headline": "Each government department is awaiting to hear their fate - how much money they will be given for the next few years.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Chancellor Rachel Reeves is set to announce how much cash each government department will get over the next few years at the spending review on 11 June. Last October, Ms Reeves set out departmental budgets for 2025-26, and will now confirm how much each department will get for the remaining years of the parliament, which ends in 2029. Sky News' politics team takes a look at what may be announced in the spending review. What could be announced? Health and social care How much funding the Department of Health and Social Care will get is one of the most highly anticipated announcements, as due to its size it is set to get nearly 40% of the total day-to-day expenditure on all departments. How much other departments get depends largely on health and defence. \n                  Spending review 2025: What is it and what might Rachel Reeves announce?\n                 \n                  How risky is Rachel Reeves's winter fuel U-turn?\n                 \n                  The big mistake Labour think Nigel Farage has made - and how the chancellor hopes to capitalise  \n                 Two-child benefit cap After much pressure from his own MPs, Sir Keir and his ministers started softening their previous hard stance on the Conservative-introduced policy that means families cannot claim child benefits for any more than their first two children. Just a week before the spending review, the PM refused to rule out scrapping it, so this could be announced in the spending review. Energy security and net zero There have been reports Ms Reeves could give the go-ahead to a new nuclear power station in Suffolk: Sizewell C. It would mark the end of a 15-year journey for the project, developed alongside French energy giant EDF, to secure investment for the plant. The chancellor may also set out details of plans to build small modular reactors (mini nuclear power stations) in England and Wales. Read more: What is a spending review? What has the government already announced? In a show of what is to come, the government has already said that any increase in spending will be relatively modest - and has announced sizeable cuts to some areas, while other departments have got a boost. Foreign aid In February, the government announced it will reduce aid spending from 0.5% to 0.3% of gross national income in 2027 - the lowest level since 1999 - to fund higher defence spending. Defence spending Sir Keir Starmer has agreed to increase defence spending from its current 2.3% of GDP to 2.5% by 2027 and to 3% in the next parliament, from 2029. However, NATO chief Mark Rutte wants allies to sign up to 3.5% by 2035, so there are questions about whether the PM will agree to that after his recent hard stance on defence.  Transport On 4 June, the chancellor announced £15bn for tram, train and bus infrastructure outside London. It is part of a £113bn investment in capital projects over the rest of the parliament. Winter fuel payments Sir Keir Starmer shocked parliament when he U-turned just weeks before the spending review and said more pensioners will be given the winter fuel payment. Shortly after Labour won last July's election, they took the universal payment away from most pensioners and made it means-tested. Ms Reeves is expected to share some information at the spending review about who will receive the payment, but full details will not be revealed until the autumn budget.  Free school meals A week before the spending review, the government announced it will be expanding free school meals to all children in households on universal credit, instead of just those in households earning less than £7,400.  The government said this would mean more than 500,000 more children would be eligible from September 2026, and £1bn has been set aside to pay for it."
    },
    {
        "title": "Starmer doesn't rule out scrapping two-child benefit cap after free school meals expansion",
        "description": "The expansion of free school meals is a \"down payment\" on the plan to lift children out of poverty, Sir Keir Starmer has said, as he did not rule out scrapping the two-child benefit cap.",
        "url": "https://news.sky.com/story/starmer-doesnt-rule-out-scrapping-two-child-benefit-cap-after-free-school-meals-expansion-13379551",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-school_6935038.jpg?20250605125909",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-05 11:55:00",
        "Headline": "Sir Keir Starmer said expanding free school meals is a \"statement of intent\" to reduce child poverty, amid speculation the two-child benefit cap could go. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  The expansion of free school meals is a \"down payment\" on the plan to lift children out of poverty, Sir Keir Starmer has said, as he did not rule out scrapping the two-child benefit cap. The prime minister hinted that he wants to go further after opening up free school dinners to half a million more pupils. Politics live: Senior Tory attacks Liz Truss in speech  Currently only those whose parents or guardians have an income of less than £7,400 a year are eligible, but from 2026 it will include children in households on universal credit - a move welcomed by child poverty campaigners. Asked if the change is a substitute for lifting the two-child benefit cap, or laying the groundwork to do so, Sir Keir described it as a \"statement of intent\" that he's wanted to do \"for a long time\". Pressed if intent meant going further and lifting the cap, he said: \"I would say this is a down payment on child poverty. We've got a taskforce that will come out with a strategy. \"I want to get to the root causes of child poverty. One of the greatest things the last Labour government did was to drive down child poverty. I am determined we will do that.\" \n                  Labour needs to focus on the working class, says Andy Burnham \n                 \n                  Fears for future of Welsh rugby amid cuts to grassroots scheme\n                 \n                  Husband of teacher stabbed at school in West Wales calls for action on pupil behaviour\n                 Sir Keir has been under pressure to lift the cap from the moment he entered Downing Street, with seven Labour MPs suspended within weeks of last year's general election for voting with the SNP to scrap the cap. The cap was announced by the then Conservative chancellor George Osborne before coming into force in 2017 and prevents parents from claiming universal credit or child tax credits from the third child onwards, except in very limited circumstances. It was supposed to encourage parents to work, but has plunged a rising number of children into poverty, multiple studies have shown. This includes 10,000 more children in the first three months of the Labour government, the Child Poverty Action Group found, adding to the 4.3 million children already living in relative poverty across the UK. Poverty taskforce delayed  The government has resisted calls to scrap the cap, instead announcing a child poverty taskforce last July to look at tackling the \"root causes\" of child poverty, which essentially kicked the issue into the long grass. It was due to report its findings this spring but publication has been pushed back to later this year, fuelling speculation the government wants to use the next budget in the autumn to fund the policy. According to the Resolution Foundation, axing the cap would lift 500,000 children out of poverty by the end of the parliament at a cost of £4.5bn.  The thinktank said the government's child poverty strategy won't be credible without a commitment to scrap the limit, as other welfare cuts mean child poverty is projected to rise to an all-time high of 4.6 million by 2029. Pressure is mounting on the government following a drubbing at last month's local elections fuelled by the rise in Reform UK's popularity. Reform leader Nigel Farage has committed his party to scrapping the two-child cap, as well as reinstating the winter fuel benefit in full. Sir Keir has recently U-turned on his unpopular cuts to the winter fuel allowance, though the government has ruled out a return to all pensioners receiving it. Chancellor Rachel Reeves has said more people will get the payment this winter, but it will likely still be means tested in some form. Read more:Cost of sending kids to state school up by over £500Extra 50,000 children 'could be pushed into poverty' Calls to bring back Sure Start As well as being urged to scrap the two-child benefit cap, there are growing calls for ministers to revive Sure Start centres, seen by many in the party as one of the crowning achievements of New Labour. The early years service had a \"remarkably long-lasting\" positive impact on the health and education outcomes of children, a report by the Institute for Fiscal Studies last month found. They were disbanded by the coalition government, but the Child Task Force is expected to recommend their return, according to The Guardian. At a Westminster Hall debate on Wednesday, Labour MP for Bournemouth East Tom Hayes said stamping out child poverty required \"nothing less than the resurrection of Sure Start\". Meanwhile, writing in Labour List this week, Rother Valley MP Jake Richards suggested investing in Sure Start would be a better long-term approach to child poverty than removing the two-child benefit cap, saying family centres could deliver \"tangible change\" across the country on the government's key missions."
    },
    {
        "title": "How risky is Rachel Reeves's winter fuel U-turn?",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>",
        "url": "https://news.sky.com/story/how-risky-is-rachel-reevess-winter-fuel-u-turn-13379387",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-05 05:07:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈 Sky News's Sam Coates and Politico's Anne McElvoy serve up their essential guide to the day in British politics. More details of Chancellor Rachel Reeves's spending squeeze next week are trickling out - including a U-turn on the winter fuel allowance, which we now know is happening in the spending review. The political implications of the U-turn, rather than the broader spending review itself, threaten to dominate the political narrative for the next week and more. How much pressure will that pile on Sir Keir Starmer and his chancellor?"
    },
    {
        "title": "Moon lander 'likely to have crashed', says Japan's ispace",
        "description": "Japan's private space company ispace has said its latest uncrewed moon lander has probably crashed onto the surface, two years after another unsuccessful touchdown attempt.",
        "url": "https://news.sky.com/story/moon-landing-declared-a-failure-on-second-attempt-lander-probably-crashed-says-japans-ispace-13379843",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ispace-moon_6935522.png?20250605221234",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-05 22:30:00",
        "Headline": "The spacecraft is believed to have descended too fast after a laser system for measuring altitude did not work as expected. But despite the failure, the firm ispace is pledging to press ahead with more moon missions.",
        "Content": "Japan's private space company ispace has said its latest uncrewed moon lander has probably crashed onto the surface, two years after another unsuccessful touchdown attempt. The Tokyo-based company declared the mission a failure on Saturday, several hours after communication was lost with the lander, named Resilience. It follows its failed inaugural mission in 2023. CEO and founder Takeshi Hakamada issued an apology at a news conference. \"This is the second time that we were not able to land. So we really have to take it very seriously,\" he told reporters. But he stressed that the company would press ahead with more lunar missions. On Wednesday, ispace released footage from the Resilience lander circling the moon, ahead of Friday's planned landing. Initial analysis of the mission failure suggests the laser system for measuring the altitude did not work as planned, and the lander descended too fast, officials said. \n                  Europe's first rover to land on moon - and it's carrying a tiny red house\n                 \n                  First moon rocks on Earth in half a century arrive in UK\n                 \n                  NASA watch live: Space agency confirms Artemis moon mission delayed \n                 \"Based on these circumstances, it is currently assumed that the lander likely performed a hard landing on the lunar surface,\" the company said in a written statement. The Tokyo-based firm had hoped to follow in the steps of US companies Intuitive Machines and Firefly Aerospace - which have already conducted successful, or partially successful, commercial landings. Resilience was launched in January from Florida on a long, roundabout journey, and entered lunar orbit last month. It shared a SpaceX ride with Firefly Aerospace's Blue Ghost, which reached the moon faster and became the first private entity to successfully land there in March. Another US company, Intuitive Machines, arrived at the moon a few days later, although that lander skidded into a crater near the south pole and was declared dead within hours.  Resilience was targeting a flat area at the top of the moon, in a long, narrow region full of craters and ancient lava flows that stretches across the near side's northern tier. On board was ispace's European-built rover - named Tenacious - with a high-definition camera and a shovel to scoop up some lunar dirt for NASA. Besides science and tech experiments, the lander was also carrying a tiny, Swedish-style red cottage with white trim and a green door. It was called the Moonhouse by creator Mikael Genberg and was supposed to be placed on the lunar surface."
    },
    {
        "title": "Musk says Trump appears in Epstein files and $150bn wiped off Tesla's value as row between them explodes",
        "description": "Elon Musk says Donald Trump appears in files relating to the disgraced paedophile financier Jeffrey Epstein.",
        "url": "https://news.sky.com/story/donald-trump-disappointed-with-elon-musk-after-he-turned-on-his-big-beautiful-bill-13379714",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-jeffrey-epstein_6935517.jpg?20250605215509",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-05 16:48:00",
        "Headline": "In a post on X, the tech billionaire said: \"@realDonaldTrump is in the Epstein files. That is the real reason they have not been made public.\" He gave no evidence for the claim. The White House described Musk's comments as \"unfortunate\".",
        "Content": " Elon Musk says Donald Trump appears in files relating to the disgraced paedophile financier Jeffrey Epstein. It's the latest in a string of barbs between the men as they appear to have dramatically fallen out in a public spat. In a post on X, the tech billionaire said: \"@realDonaldTrump is in the Epstein files. That is the real reason they have not been made public. \"Mark this post for the future. The truth will come out.\" He gave no evidence for the claim. Meanwhile, White House press secretary Karoline Leavitt dismissed the comment. In a statement, she said: \"This is an unfortunate episode from Elon, who is unhappy with the One Big Beautiful Bill [a Republican tax and spending bill] because it does not include the policies he wanted. \"The president is focused on passing this historic piece of legislation and making our country great again.\" Epstein killed himself in his jail cell in August 2019 while awaiting trial on charges of sex trafficking minors. Read more:Analysis: Trump v Musk has got very messy very quicklyJanuary 2024: Epstein list - Who is named in unsealed documents? Donald Trump has been named in previously released documents relating to Jeffrey Epstein. One Epstein accuser in 2016 said she spent several hours with the disgraced financier at a Trump casino but she did not say if she met Mr Trump and did not accuse him of any wrongdoing. Mr Trump once said he believed Epstein was a \"terrific guy\" but that they later fell out. The latest claims by Musk about the Epstein files tap into conspiracy theories that sensitive files the government possesses have not yet been released.  In another post on Thursday, Musk, the owner of social media platform X, attacked Mr Trump's tariffs, saying they \"will cause a recession in the second half of this year.\" The Tesla boss shared a post calling for Mr Trump's impeachment and asked whether it was \"time to create a new political party in America that actually represents the 80% in the middle\". Musk also said his company SpaceX will begin decommissioning its Dragon spacecraft \"immediately\" following Mr Trump's threats to cancel government contracts with Musk's businesses. Dragon is the only US spacecraft available to deliver crew to and from the International Space Station. The spat has already hit Tesla shares, which lost about $150bn (£111bn) in value, closing down 14.3% for the day. It comes after the president said he was \"disappointed\" with Musk after the entrepreneur publicly criticised Mr Trump's signature tax bill. The president suggested his former backer and adviser missed being in government and has \"Trump derangement syndrome\". He added: \"I'm very disappointed in Elon. I've helped Elon a lot.\"  In a Truth Social post, the US president said: \"Elon was 'wearing thin,' I asked him to leave, I took away his EV mandate that forced everyone to buy electric cars that nobody else wanted (that he knew for months I was going to do!), and he just went crazy!\". On Tuesday, the world's richest man called the president's tax and spending bill \"outrageous\" and a \"disgusting abomination\" - days after abruptly leaving his position spearheading the Department of Government Efficiency (DOGE). The bill, which includes multi-trillion-dollar tax breaks, was passed by the House Republicans in May and has been described by the president as a \"big, beautiful bill\". By contrast, Musk has called it the \"big, ugly bill\". Shortly after the president expressed his disappointment in Musk on Thursday, the SpaceX boss responded. \"False\", he wrote on his X platform. \"This bill was never shown to me even once and was passed in the dead of night so fast that almost no one in Congress could even read it!\" In another scathing post on X, Musk claimed responsibility for Donald Trump's re-election success. He wrote: \"Without me, Trump would have lost the election, Dems would control the House and the Republicans would be 51-49 in the Senate.\"  It came after Mr Trump told reporters the Tesla chief executive was unimpressed electric vehicle incentives were being debated in the Senate and could face being cut. Read more on Sky News:Russian ambassador partly blames UK for Ukrainian drone attackFarage 'genuinely sorry' over Reform chair's shock resignationJudge threatens to remove Sean 'Diddy' Combs from court Last Thursday, Musk revealed on X that his scheduled time as a \"special government employee\" was coming to an end. Before the news broke, Musk's father told Sky News his son was \"not a very good politician\". But speaking to Gillian Joseph on The World, Errol Musk insisted there was \"no rift between Elon and Donald Trump\"."
    },
    {
        "title": "Former girlfriend tells Diddy trial of sex with male escorts - as rapper is warned by judge",
        "description": "A former girlfriend of Sean \"Diddy\" Combs has told his sex trafficking trial how a whirlwind romance opened a \"Pandora's box\" of sex sessions with male escorts that she did not know how to stop.",
        "url": "https://news.sky.com/story/former-girlfriend-tells-diddy-trial-of-sex-with-male-escorts-as-rapper-is-warned-by-judge-13379819",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sean-diddy-combs-sex-trafficking-trial_6935407.jpg?20250605190740",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-06-05 20:14:00",
        "Headline": "\"Jane\" is one of three alleged victims giving evidence during Sean \"Diddy\" Combs's trial, and her allegations mirror those given by his former long-term partner Cassie Ventura.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n A former girlfriend of Sean \"Diddy\" Combs has told his sex trafficking trial how a whirlwind romance opened a \"Pandora's box\" of sex sessions with male escorts that she did not know how to stop. The witness, who is testifying under the pseudonym \"Jane\", alleges the hip-hop mogul coerced her into participating in drug-fuelled \"debauchery\" nights throughout their relationship, which began in 2021 and ended when he was arrested in September 2024. She began her evidence on a dramatic day at the Manhattan court, taking to the stand not long after Judge Arun Subramanian issued a warning to Combs's lawyers after seeing the rapper \"nodding vigorously\" towards the jury during earlier testimony. If the \"totally unacceptable\" behaviour happens again during the trial, the judge said, he could take steps to remove the defendant from the courtroom. Diddy trial day 17 - as it happened Jane is one of three alleged victims of Combs giving evidence during his trial, and her allegations mirror those given by his former long-term partner Cassie Ventura. Both women said the rapper would sit in the corner and masturbate as he watched them have sex, and that the sessions would often last for more than 24 hours with \"no sleep\". Combs, 55, is accused of sex trafficking, racketeering conspiracy and transportation to engage in prostitution. He has pleaded not guilty to all charges. In court on Thursday, he often looked straight at Jane as she gave evidence. The single mother began her testimony by describing her whirlwind romance with Combs, saying he made her feel special and showered her with love and gifts in the first few months from January 2021. Asked what happened in May 2021, she bowed her head and became emotional as she told the court how Combs started to talk about fantasies of role play with other men. One night, he told her he could make the fantasy a reality, she says - and did so straight away. Jane told the court she agreed to having sex with the male escort because she wanted to make Combs happy - and even \"felt excited\" afterwards after doing something \"taboo\". However, she said she thought it was a one-off. Instead, \"it opened a Pandora's box\" and \"set the tone\" going forward, she said. After that first night in May 2021, Jane said she was having sex with other men \"90%\" of the time. Asked if this is what she wanted, she said it wasn't, but that she \"went along with it because I loved him at this point\". Combs kept pushing her into these sex sessions, and she felt \"obligated\" to go along with it, she said. He also had control over her life in other ways, she told the court, including by paying the rent on her home. Read more:Everything you need to know about the Sean Combs trialThe rise and fall of Sean 'Diddy' CombsWhat we learned from Cassie's testimony But as their relationship continued, she said she did tell him, \"many times\", she did not want to keep having sex with other men, but he would dismiss her, make her feel uncomfortable, or seemingly threaten to stop paying her rent. These encounters were referred to as \"debauchery\" or hotel nights, she told the court, and they always followed the same pattern - \"hotel suites, red lights, music, lotions and alcohol, there would be bed sheets covering everything, blankets and towels, because of the excessive use of baby oil everywhere\". Jane said she would \"have drugs in my system\" and wear \"provocative\" lingerie and \"high stripper shoes\", and Combs would ask her to pour baby oil on the men and on herself. These sessions typically lasted between 24 and 30 hours, she said, with \"no sleep\". In her testimony, Cassie Ventura told of similar sexual encounters, which Combs referred to as \"freak offs\", she said. Jane's evidence is set to continue on Friday and on several days next week."
    }
]