[
    {
        "title": "My father the fraud: Daughter reveals how key scientist in Primodos scandal built career on lies",
        "description": "A renowned pharmacologist and expert witness in the Primodos drug scandal has been unmasked as a fraud - by his daughter.",
        "url": "https://news.sky.com/story/my-father-the-fraud-daughter-reveals-how-key-scientist-in-primodos-scandal-built-career-on-lies-13415496",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-primodos-nicholas-briggs_6997133.jpg?20250821184021",
        "type": "Home",
        "Author": "Jason Farrell",
        "Date Published": "2025-09-13 23:01:00",
        "Headline": "As an expert witness, Professor Michael Briggs challenged mothers who claimed Primodos damaged their babies in the womb. He has now been exposed as a conman who faked his qualifications.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  A renowned pharmacologist and expert witness in the Primodos drug scandal has been unmasked as a fraud - by his daughter. Professor Michael Briggs, who was also a NASA scientist and adviser to the World Health Organisation, built his glittering career on lies by faking his qualifications. The revelations come in a new book called The Scientist Who Wasn't There, written by his daughter Joanne Briggs - and Sky News can now reveal how his story sheds new light on a medical scandal that has rumbled on for five decades. From 1966 to 1970, Professor Briggs was UK research director for Schering pharmaceuticals, which made the pregnancy test drug Primodos, sold in the UK with great commercial success. Later, hundreds of mothers would claim that the drug damaged their babies in the womb - and Briggs was called as an expert witness to challenge their case. His involvement in understanding the effects of Primodos runs from the 1960s to the current day, and questions remain over whether his research was among a more recent body of work which has been used by the government to justify not setting up a redress scheme for disabled claimants. Yet, Briggs was a man who faked research. \"When I was small, I believed my dad to be the only man who knew all science,\" Joanne Briggs writes. Son of a typewriter mechanic from Manchester, he was an enigmatic figure, often dressed in a blazer and sunglasses. In one old family photo, Joanne says he looks like \"an operative from MI5, after he'd been issued with a wife and child\". Professor Briggs claimed he had advised film director Stanley Kubrick on the making of 2001: A Space Odyssey. He had indeed worked for NASA on the Mars probe, based at the California Institute of Technology, though Joanne believes he used \"a three-card trick\" to get the job. Speaking to Sky News in her kitchen in Sussex, she pulls out two A4-bound books. One purports to be a PhD thesis from Cornell University in 1959 by MH Briggs. The other is a Doctor of Science degree dated 1961 from Wellington University in New Zealand. \"Both of these documents are unfortunately fakes,\" says Joanne, explaining that her father worked for a year as a teaching assistant at Cornell and, at best, did a master's thesis. The \"super doctorate\" from Wellington would have required a real PhD, and Joanne believes he did submit something, but examiners described it as \"unfavourable\". \"He had a very contorted CV, that's for sure,\" says Joanne. \"He never completed a sustained piece of work leading to a higher degree of the kind that you would expect a scientist to have.\" Professor Briggs's name cropped up in Sky News investigations into Primodos. First in leaked letters from Schering in which scientists were discussing their concerns about the safety of the drug. Read more:Primodos - the secret drug scandalEvidence could reveal 'one of the biggest medical frauds of 20th century' A paediatrician named Isabel Gal raised the alarm in a paper published in science journal Nature, warning of a higher incidence of spina bifida in babies born to mothers who used hormone pregnancy tests. Briggs then asked a statistician, Dennis Cook, to see if there was a correlation between increased sales of the drug and malformations in UK newborns. Mr Cook, who later shared his study with Sky News, wrote to Briggs warning that the correlation was \"alarming\". Yet Briggs didn't act on this. He later left Schering, taking up senior roles in universities in Zambia then Australia, but in 1982, when Primodos campaigners attempted to sue Schering for damages, Briggs was a key expert witnesses offering to give evidence on behalf of the company. Joanne says: \"The collapse of the trial has been attributed to him by many people on the campaign side. He appeared to be an expert on a world stage, an incomparable expert. \"He advised the World Health Organisation's hormone pharmaceutical committee, so you couldn't ask for a better CV, but unfortunately what was in his CV was largely of his own making.\" Joanne describes her father's career as \"a series of fraudulent acts\". In the late 1980s he was caught out by Sunday Times journalist Brian Deer who found Briggs had been fabricating research for Schering and another company, relating to the safety of the contraceptive pill. Mr Deer told Sky News: \"He was in those days of typewriters, essentially sitting there and thinking of what the data ought to be, and typing it in to tables and sending it off to medical journals to publish.\" Aged 51, Briggs died in mysterious circumstances, shortly after the article was published. But his legacy wasn't over. Sky News has found animal studies produced while he was UK research director at Schering were among dozens of studies submitted by the manufacturer for use in an expert working group (EWG) report published in 2017 that examined Primodos for the government. Twenty-eight animal studies from the 1960s and 70s were provided by Schering, and while a number were produced in the late 70s after Briggs left the company, some of those were outsourced and done in preparation for the litigation in which Briggs was a key witness. Joanne believes based on the dates and \"hallmark characteristics of his turn of phrase\" that some of the studies were produced by her father. \"There are research papers there that were actually produced by my dad,\" she says. \"And they were relied on by the expert working group as part and parcel of their conclusion.\" The EWG report has since been used by government and manufacturers to dismiss more recent claims by campaigners about the drug's damaging effects. When asked specifically about one rabbit study from 1970, the Medicines and Healthcare products Regulatory Agency (MHRA), which oversaw the EWG, was able to confirm it was not done by Briggs, but asked us to direct further questions about Schering's studies to the manufacturer. It added that the MHRA is \"committed to reviewing any new scientific data which becomes available since the conclusion of the Expert Working Group's review\". Schering is now owned by Bayer, which told us: \"In 2017, the Expert Working Group of the UK's Commission on Human Medicines concluded that the available scientific data from a variety of scientific disciplines does not support a causal relationship between the use of sex hormones in pregnancy and an increased incidence of congenital anomalies or other adverse outcomes, such as miscarriage.\" Responding to specific questions about Professor Briggs, they added: \"Backed by the considerable body of scientific research and evidence, Bayer maintains that there is no causal relationship between use of Primodos and an increased incidence of congenital anomalies.\" But they have not told us whether studies by a serial faker were or weren't used to argue that the drug was safe. Joanne hopes her revelations could lead to a rethink about the evidence. \"I think this story about a man in the centre of this who happens to be a fabricated person, a hollow man, who has been relied on to such an extent for his expertise,\" she says. \"That doesn't strike me as irrelevant.\""
    },
    {
        "title": "25 arrested and officers injured - as up to 150,000 people join 'Unite the Kingdom' march in London",
        "description": "There were 25 arrests in London on Saturday as up to 150,000 people turned up to join a march organised by far-right activist Tommy Robinson. ",
        "url": "https://news.sky.com/story/nine-arrested-amid-significant-aggression-as-110000-people-join-unite-the-kingdom-march-in-london-13430478",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-unite-the-kingdom-tommy-robinson_7019641.jpg?20250913192909",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-13 18:17:00",
        "Headline": "Tech billionaire Elon Musk appeared via video link to address crowds gathered in central London for the Tommy Robinson-led rally.",
        "Content": " There were 25 arrests in London on Saturday as up to 150,000 people turned up to join a march organised by far-right activist Tommy Robinson.  Protesters forming the \"Unite the Kingdom\" rally gathered in the centre of the capital, holding Union and St George's flags. They heard a series of speeches, including from Mr Robinson, who called it the \"biggest freedom of speech\" in British history. Police estimated that between 110,000 to 150,000 attended the event, significantly exceeding the estimates of organisers. An anti-racism counter-protest, attended by about 5,000 campaigners, also took place, with the two groups clashing on Whitehall and Trafalgar Square, separated by lines of police. There were 25 arrests made, with many more likely, the Metropolitan Police said, adding that officers faced \"significant aggression\" from \"Unite the Kingdom\" attendees. \"The violence they faced was wholly unacceptable,\" police said. \n                  Police charge man over 'revolting' attacks on London synagogues \n                 \n                  Man dies after double shooting in south London\n                 \n                  890 people arrested at Palestine Action protest - including 17 on suspicion of assaulting police officers\n                 \"26 officers were injured, including four seriously - among them broken teeth, a possible broken nose, a concussion, a prolapsed disc and a head injury.\"  Police said the Robinson crowd was too big to fit into Whitehall and confrontation happened when police tried to stop them from encircling counter-protesters and accessing the area from different routes. A spokesman said: \"When officers moved in to stop them, they faced unacceptable violence. They were assaulted with kicks and punches. Bottles, flares and other projectiles were thrown. \"Nine arrests have been made so far for various offences, but many more people have been identified as committing offences. We will find them and they will face police action, even if it is not possible to do so today. \"Officers are continuing to face aggression in multiple locations, in particular at the north of Whitehall as they work to create a safe exit route for those who have been taking part in the Stand Up To Racism protest.\" Home Secretary Shabana Mahmood condemned \"those who have attacked and injured police officers\" during the protests, promising anyone taking part in criminal activity will \"face the full force of the law\". Musk makes surprise appearance  Robinson live-streamed the rally on X, with its audience peaking at 2.9 million viewers on Saturday afternoon. Making a surprise appearance via video link, tech billionaire Elon Musk called for a \"change of government\" in the UK. \"You can't - we don't have another four years, or whenever the next election is, it's too long,\" Musk told the crowd. \"Something's got to be done. There's got to be a dissolution of parliament and a new vote held.\" TV presenter Katie Hopkins also spoke after earlier appearing alongside Robinson, Lawrence Fox and Ant Middleton at the front of the march. 'Revolution has started - you can't stop it' With a voice which sounded hoarse from shouting, Robinson told crowds during his speech that \"millions\" had showed up for the rally. \"The dam has well and truly burst,\" he said. \"The cat is out of the bag and there is no putting it back in. The silent majority will be silent no longer.\" Addressing Sir Keir Starmer and the Labour government, Robinson said: \"The revolution has started - and you can't stop it.\" Referring to a Court of Appeal decision to overturn an injunction blocking asylum seekers being housed at The Bell Hotel in Epping, Essex, Robinson claimed UK courts found the rights of undocumented migrants supersede those of the \"local community\". He said: \"They told the world that Somalians, Afghanis, Pakistanis, all of them, their rights supersede yours - the British public, the people that built this nation.\""
    },
    {
        "title": "Why Tommy Robinson rally was different to any other",
        "description": "This was the biggest nationalist rally in recent memory - perhaps ever.",
        "url": "https://news.sky.com/story/why-tommy-robinson-rally-was-different-to-any-other-13430517",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-unite-the-kingdom-tommy-robinson_7019705.jpg?20250913200517",
        "type": "Home",
        "Author": "Tom Cheshire",
        "Date Published": "2025-09-13 18:51:00",
        "Headline": "Police said up to 150,000 people were in London on Saturday for the \"Unite the Kingdom\" rally led by far-right activist Tommy Robinson.",
        "Content": "\n          Data and forensics correspondent\n              @chesh\n  This was the biggest nationalist rally in recent memory - perhaps ever. Well before the march started, thousands of people flowed over Blackfriars bridge, or came up from Waterloo station, flags everywhere, hailing from everywhere - from Yorkshire roses to the diamond of the Isle of Wight. What exactly it was that \"United the Kingdom\" was left vague, for people to cheer their own particular cause.   This was billed as a free speech rally and the most common chants we heard were \"Keir Starmer's a w*****r\", \"oh Tommy Tommy\" and \"we want our country back\". That means different things to different people. \n                  25 arrested and officers injured - as up to 150,000 people join 'Unite the Kingdom' march in London\n                 \n                  Tommy Robinson bailed after arrest over alleged assault at railway station\n                 \n                  Police investigate assault as video appears to show Tommy Robinson at station\n                 As it happened: Thousands attend 'Unite the Kingdom' rally Dawn, up from Southampton and wearing a red sequined jacket, said it was because the country was \"getting overrun\". She said she was talking only about illegal migration. Others didn't draw that distinction. Danny from south Birmingham was holding a sign that said: \"Send them Back\" - and said he was unhappy with migration \"in general\". He came to \"stand up for what we believe in, the religion and identity of our country\". That's been a difference with this rally compared to past ones I've covered - an overt Christian nationalism. People carried wooden crosses. One person had a light up crucifix. When the crowd arrived at Whitehall, they were led from the stage in a chant of 'Christ is king'. And then a public recital of the Lord's Prayer shortly after that. It's an important difference. Not just a flag to rally around, but a religion too. At the centre of it all, the anti-Islam activist Tommy Robinson. When Robinson took the stage, it was more like a football match or festival than a political rally. \"We rode the storm, we weathered the storm, and today we are the storm,\" he shouted hoarsely. That's not much of an exaggeration, not when Elon Musk, the world's richest man, made a virtual appearance to back Robinson. Other speakers included those who can be uncontroversially classed as far right. And thugs clashed violently with police. And it's clear that simply writing off protestors as far right doesn't really capture what's going on either. The audience is too broad to fit just that label. The tinderbox summer of protest promised by activists never really caught flame. Instead, there has been the slow, steady burn of nationalism. This was its culmination but also, those here hoped, the beginning of something even bigger."
    },
    {
        "title": "Kemi Badenoch accuses Sir Keir Starmer of 'lying' about Peter Mandelson prior to sacking him",
        "description": "Kemi Badenoch has accused Sir Keir Starmer of \"lying to the whole country\" about what he knew regarding Peter Mandelson's correspondence with Jeffrey Epstein.",
        "url": "https://news.sky.com/story/kemi-badenoch-accuses-sir-keir-starmer-of-lying-about-peter-mandelson-prior-to-sacking-him-13430071",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-kemi-badenoch-sir-keir-starmer_7019073.jpg?20250913155944",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-13 14:24:00",
        "Headline": "The prime minister initially defended Lord Mandelson but sacked him as US ambassador after it was revealed he sent messages of support to Epstein even as the financier faced jail for sex offences in 2008.",
        "Content": " Kemi Badenoch has accused Sir Keir Starmer of \"lying to the whole country\" about what he knew regarding Peter Mandelson's correspondence with Jeffrey Epstein. Lord Mandelson was this week stripped of his position as ambassador to the US amid fresh scrutiny over his years-long friendship with the convicted paedophile. The prime minister initially defended the Labour peer but removed him from his post on Thursday after newly seen emails revealed he sent messages of support to Epstein even as he faced jail for sex offences in 2008. Politics latest: 'Unite the Kingdom' rally takes place with counterprotest nearby   The Times has now reported that Downing Street and the Foreign Office were aware of the emails on Tuesday - a day before Sir Keir gave Lord Mandelson his backing at Prime Minister's Questions (PMQs). In a post on X, Conservative leader Ms Badenoch wrote: \"Looks like the Prime Minister and Labour MPs spent the week lying to the whole country about what they knew regarding Mandelson's involvement with convicted paedophile Jeffrey Epstein.\" She continued: \"If No 10 had those emails for 48 hours before acting, it means he lied at PMQs and ministers lied again about new additional information. These are yet more errors of judgment. \"The Prime Minister has very serious questions to answer. The only way to clear this up is full transparency about who knew what, and when.\" 👉 Listen to Sky News Daily on your podcast app 👈 Sources said Sir Keir was not aware of the contents of the emails when he told MPs he had \"confidence\" in Lord Mandelson. A media enquiry outlining details of the messages between Lord Mandelson and Epstein was sent to the Foreign Office on Tuesday, and passed on to Number 10. Sir Oliver Robbins, the permanent under-secretary at the Foreign Office, asked Lord Mandelson about the emails on Tuesday, but did not receive a response until the following day. Sir Keir is understood not to have been aware of the contents of the emails until Wednesday evening. Speaking to Sky News, one Labour MP called for more information on what happened behind closed doors at Number 10 this week. Jo White, MP for Bassetlaw, in Nottinghamshire, said: \"We cannot move on until we find out how he [Sir Keir] was not briefed properly before PMQs.\" \"What he needs to do now is get on top and sort out this mess,\" she said. \"Suspend the whip from Peter Mandelson and expel him from the party, then have a transparent enquiry about what went wrong at Number 10.\" The call came as Sir Keir enjoyed some time away from Downing Street. The prime minister was on Saturday pictured watching Arsenal face Nottingham Forest in a Premier League match at the Emirates Stadium. Lord Mandelson's exit came after less than a fortnight after another high-profile loss for the Labour government, as Angela Rayner was forced to quit as deputy prime minister and deputy Labour leader over her tax affairs. As Sir Keir has faced a scandal-hit start to the month, a growing number of Labour MPs have begun calling his leadership into question. Read more from Sky News:Mandelson's exit leaves Trump visit in the lurchWhat we know about Mandelson-Epstein relationship Lucy Powell, who is running to replace Ms Rayner as Labour's deputy leader, has called for a \"change of culture\" at Downing Street. \"We've got a bit of a groupthink happening at the top, that culture of not being receptive to interrogation, not being receptive to differing views,\" she told The Guardian newspaper. Meanwhile, senior Labour MP Emily Thornberry has written to the new foreign secretary, Yvette Cooper, demanding answers about the vetting process for UK diplomats in the wake of Lord Mandelson's sacking."
    },
    {
        "title": "Donald Trump urges NATO countries to stop 'shocking' Russian oil purchases to end Ukraine war",
        "description": "The war in Ukraine would end if all NATO countries stopped buying oil from Russia, Donald Trump has said.",
        "url": "https://news.sky.com/story/donald-trump-urges-nato-countries-to-stop-shocking-russian-oil-purchases-to-end-ukraine-war-13429901",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-president-donald-trump_7018969.jpg?20250913152217",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-13 12:56:00",
        "Headline": "The US president says the alliance's commitment to winning the war \"has been far less than 100%\" and the purchase of Russian oil by some members is \"shocking\", as it \"greatly weakens your negotiating position and bargaining power, over Russia\".",
        "Content": "The war in Ukraine would end if all NATO countries stopped buying oil from Russia, Donald Trump has said. The US president, in a post on his Truth Social platform on Saturday, said the alliance's commitment to winning the war \"has been far less than 100%\" and the purchase of Russian oil by some members is \"shocking\". Doing so \"greatly weakens your negotiating position and bargaining power, over Russia,\" he said. NATO member Turkey has been the third largest buyer of Russian oil since 2023, after China and India, according to the Centre for Research on Energy and Clean Air, with fellow members Hungary and Slovakia also buying energy supplies from Moscow.  A NATO ban on the practice plus tariffs on China would \"also be of great help in ENDING this deadly, but RIDICULOUS, WAR\", he added. The president said NATO members should also put 50% to 100% tariffs on China - and only withdraw them if the conflict ends. 'China's grip' on Russia \"China has a strong control, and even grip, over Russia,\" Mr Trump posted, and powerful tariffs \"will break that grip\". The US president has already placed a 25% import tax on goods from India over its buying of Russian energy products. Mr Trump said responsibility for the war fell on his predecessor Joe Biden and Ukrainian President Volodymyr Zelensky. He did not include in that list Russian President Vladimir Putin, who launched the invasion. Village changes hands On the battlefield on Saturday, Russian troops took control of the village of Novomykolaivka in Ukraine's southeastern Dnipropetrovsk region, the Russian Defence Ministry said. A drone attack hit an oil refinery in the city of Ufa, around 870 miles (1,400km) from the border with Ukraine, the local governor said, calling it a terrorist incident. Read more on Sky News:All we know about Kirk murder suspectNepal's first female PMMan admits constituency arson  NATO Secretary-General Mark Rutte said on Friday the 32-nation alliance would place military equipment on the border with Belarus, Russia and Ukraine to deter potential Russian aggression. Operation 'Eastern Sentry' followed Wednesday's provocative incursion by multiple Russian drones into the airspace of Poland, another NATO member. Polish forces shot down the drones, which Moscow said went astray because they were jammed.  Prince Harry's surprise visit The Duke of Sussex made a surprise visit to Ukraine on Friday, promising to do \"everything possible\" to help the recovery of injured military staff. Travelling on an overnight train to Kyiv, Prince Harry, who has since left the country, told The Guardian: \"We cannot stop the war but what we can do is do everything we can to help the recovery process. \"We have to keep it [the war] in the forefront of people's minds. I hope this trip will help to bring it home to people because it's easy to become desensitised to what has been going on.\""
    },
    {
        "title": "Sikh woman raped in 'racially aggravated attack' speaks out",
        "description": "A Sikh woman who was raped in a \"racially aggravated attack\" in the West Midlands says she \"would never wish this on anyone\".",
        "url": "https://news.sky.com/story/sikh-woman-raped-in-racially-aggravated-attack-speaks-out-13429896",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-smethwick-sikh-rape-incident_7018573.jpg?20250913014210",
        "type": "Home",
        "Author": "Bethany Minelle, news reporter",
        "Date Published": "2025-09-13 12:54:00",
        "Headline": "The young woman, who said she was on her way to work when the attack took place, has thanked everyone for their \"love and support\" during a \"difficult\" time.",
        "Content": "By Bethany Minelle, news reporter  A Sikh woman who was raped in a \"racially aggravated attack\" in the West Midlands says she \"would never wish this on anyone\". Police were called just before 8.30am on Tuesday after the woman, who is in her 20s, reported being attacked by two white men in the area around Tame Road in Oldbury. The Sikh Federation (UK) said the perpetrators allegedly told the woman during the attack: \"You don't belong in this country, get out.\" The woman, who is entitled to anonymity as the victim of a sex offence, issued a statement through community group Sikh Youth UK. Thanking everyone for their support, she said: \"We are going through a lot, but the strength and kindness shown by the right people in the community has been incredible and I can't thank them enough for being my voice. \"I would never wish this on anyone. All I was doing was going about my day on my way to work, and what has happened has deeply affected us.\" Calling her family her \"rock,\" she went on: \"The police are doing their best to find those responsible, and I truly hope they are caught so that this doesn't happen to anyone else.\" \n                  Community voices shock and fear after woman raped in 'racially aggravated attack'\n                 \n                  Paul Topham: Man who murdered great-grandfather Harold Monk during Wolverhampton burglary jailed for at least 33 years\n                 \n                  On the streets with England's flag-raisers - as one claims link to Tommy Robinson\n                 She said she was \"truly humbled\" by the love and support she'd received. She added: \"I want to personally thank my family, Sikh Youth UK, who have been so supportive, the local Gurdwara committees and Sikh orgs, and everyone in my community who has stood by me. I cannot thank you enough for helping me get through this difficult time.\" 'How do we feel safe?' An emergency meeting was later held at the Guru Nanak Gurdwara temple in Smethwick, a few miles from Oldbury, following concerns within the community. Pervinder Kaur, vice president at Guru Nanak Gurdwara temple in Smethwick, told Sky News Midlands correspondent Shamaan Freeman-Powell: \"For something to happen during rush hour when the roads are so busy, how do we feel safe? When do we feel safe? \"A lot of the time you say, 'oh, it was dark, it was a secluded area' or whatnot. But for this to be happening in broad daylight, people have got no fear in them.\" Kuldeep Singh Deol, executive member of the Sikh Federation UK, said he is \"worried for the local community\" and said there had been a rise in hate crimes. Speaking to Sky News, he said: \"We've seen the Union Jacks appearing up and down the UK, which we don't have an issue with. \"But when it's becoming like this, hate is being festered and people are getting attacked as a result of this, something needs to be done.\" Read more:Arrests made at 'Unite the Kingdom' rallyTory leader accuses Starmer of 'lying' Police are still trying to identify the perpetrators of the attack, which they say is being treated as \"racially aggravated\". Officers said CCTV, forensic and other enquiries are well underway, but have appealed for anyone in the area who may have seen the men, or have any further information, to contact the force. One of the men is described as having a shaved head, of heavy build, and was reported to be wearing a dark coloured sweatshirt and gloves. The second man was reportedly wearing a grey top with a silver zip."
    },
    {
        "title": "'Bella Ciao' to 'OwO' - what do the engravings on the bullets in the Charlie Kirk shooting mean?",
        "description": "Experts have described engravings left on ammunition at the scene of the Charlie Kirk shooting as \"extremely online\" &#8211; so what do the words and symbols actually mean?",
        "url": "https://news.sky.com/story/bella-ciao-to-owo-what-do-the-engravings-on-the-bullets-in-the-charlie-kirk-shooting-mean-13430554",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-utah-valley-university_7016545.jpg?20250910214533",
        "type": "Home",
        "Author": "Torin Gillies, social media producer, and Rachel McGrath, news reporter",
        "Date Published": "2025-09-13 19:26:00",
        "Headline": "To those who aren't chronically online, the messages may appear to be total gibberish. But for others, specifically gamers, many of the meanings are clear.",
        "Content": "By Torin Gillies, social media producer, and Rachel McGrath, news reporter   Experts have described engravings left on ammunition at the scene of the Charlie Kirk shooting as \"extremely online\" – so what do the words and symbols actually mean? Authorities said on Friday that the suspect accused of fatally shooting the Conservative activist left behind bullet casings featuring references to fascism, video games and internet memes. To those who aren't chronically online, the messages may appear to be total gibberish. But for others, specifically gamers, many of the meanings will have immediately been clear. Here's what each of the casings reference - and why experts have cautioned against using them to make assumptions about the suspect's political leanings.  1. 'notices, bulges, OWO, what's this?' This writing appears to reference a meme about the furry subculture, which centres on an interest in anthropomorphic animal characters. Within the furry community, OwO is an emoticon of a cute face (with the Os as the eyes and the w as a cute mouth or nose) and used as a way of flirting - but outside the community, it is often used in a mocking way, or as part of trolling. It's incredibly common for phrases used by people who are \"extremely online\" - which essentially means highly engaged in online culture - to have double or multiple meanings. For this reason, experts have cautioned against trying to interpret messages such as these engravings to determine an attacker's political leanings or motive.  Jamie Cohen, an assistant professor of media studies who studies memes at Queens College in New York, said: \"Oftentimes this extremely online disguise is meant to be doublespeak.\" Speaking to Sky News' US partner NBC News, he continued: \"It's meant specifically for someone like me to dive into what they would call meme culture and declare them something so that they get more press. \"So it could just be another bait and switch for researchers who are falling into the same trap that they are designing for more viral exposure.\" 2. 'Hey, fascist! Catch ↑ → ↓↓↓' When asked by Sky News' US correspondent James Matthews what the messages on the casings meant, Utah governor Spencer Cox said the writing referring to a fascist \"speaks for itself\".  The second half of the inscription - the directional arrows - were immediately identified by some gamers. Helldivers 2 players have pointed out that the arrow sequence is the code used to summon a 500kg bomb in the 2024 game - which itself has been interpreted as a satire of fascism. 👉 Follow Trump100 on your podcast app 👈   3. 'Oh bella ciao, bella ciao, bella ciao ciao ciao' Bella Ciao is a classic Italian song that became a popular anti-fascism anthem during Benito Mussolini's dictatorship. It has won renewed popularity in recent years thanks, in part, to featuring multiple times in Netflix's Spanish television series Money Heist. A popular remix of Bella Ciao has hit more than 260 million streams on Spotify worldwide and it's become a favourite on TikTok, as well as within the gaming community. Read more:All we know about the suspected assassinThe string of bloody political violence in the MAGA era 4. 'If you read this, you are gay lmao'  This juvenile insult, using the well-known abbreviation for 'laughing my ass off', is a common 'gotcha' phrase and simply appears to mock investigators. The messages, another expert has said, make one thing clear - the suspect was likely seeking fame. Lindsay Hahn, a University at Buffalo associate professor who researches ideological extremism and the ways in which perpetrators of violence justify their actions, said the messages do not necessarily indicate a specific ideology. \"But what they do indicate, is that the shooter wanted to get a message across and therefore be talked about online,\" she told NBC. \"It sort of seems like these messages, at the very minimum, were selected because he knew they were going to be talked about.\""
    },
    {
        "title": "China warns UK and US after USS Higgins and HMS Richmond sail through Taiwan Strait",
        "description": "China has warned the UK and the US after their warships sailed through the diplomatically-fraught Taiwan Strait.",
        "url": "https://news.sky.com/story/china-warns-uk-and-us-after-uss-higgins-and-hms-richmond-sail-through-taiwan-strait-13429780",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-hms-richmond-plymouth-sound_7018617.jpg?20250913093923",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-13 08:43:00",
        "Headline": "The US destroyer USS Higgins and British frigate HMS Richmond were engaged in \"trouble-making and provocation\", Beijing said.",
        "Content": "China has warned the UK and the US after their warships sailed through the diplomatically-fraught Taiwan Strait. Chinese naval and air forces were ordered to monitor and warn the two ships, the HMS Richmond and the USS Higgins, as they made their way through the 110-mile (180km) passage between the island and the Chinese mainland on Friday. The pair were engaged in \"trouble-making and provocation\", according to Beijing's People's Liberation Army's (PLA) Eastern Theatre Command. \"The actions of the United States and Britain send the wrong signals and undermine peace and stability across the Taiwan Strait,\" it said in a statement. The Ministry of Defence said the sailing was a routine passage, adding that wherever the Royal Navy operates, \"it does so in full compliance with international law and norms, and exercises freedom of navigation rights in accordance with the United Nations Convention on the Law of the Sea\". The US Indo-Pacific Command also described the mission as a routine transit, describing the strait as \"beyond the territorial sea of any coastal state. \"Navigational rights and freedoms in the Taiwan Strait should not be limited,\" it said in a statement. \n                  Donald Trump urges NATO countries to stop 'shocking' Russian oil purchases to end Ukraine war\n                 \n                  MPs around the world urge leaders to follow Trump's call for Jimmy Lai's release\n                 \n                  China's Xi believes in destiny - and it's bad news for the West\n                 The British vessel, deployed in the East China Sea in 2021, is a Type 34, or Duke Class frigate, and the US ship is an Arleigh Burke-class (Flight II) Aegis guided missile destroyer.  China's navy said earlier on Friday that its third aircraft carrier, the Fujian, which is still undergoing sea trials, had passed through the strait as well. Last week, a Canadian and an Australian warship made the journey along the strategic waterway. The US and its allies, including Canada, Britain and France, send ships along the strait, which they see as being in international waters, around once a month. In June, another British warship, the HMS Spey, sailed through the strait to \"cause trouble\", in Beijing's words. China views Taiwan as its own territory, which Taipei rejects, and claims the strait is part of its territorial waters. Beijing has increased its military pressure on the island over the last five years, including by staging war games nearby. Taiwan's top China policymaker and head of its Mainland Affairs Council, said on Friday China was preparing to invade Taiwan. Speaking in Washington, Chiu Chui-cheng warned that if Taiwan were to fall it would cause a regional \"domino effect\" that would threaten US security. US Secretary of State Marco Rubio condemned what he called China's \"destabilising plans\" for a disputed atoll in the South China Sea. Read more on Sky News:Kirk suspect arrested after father's tip-offRoadworks Britain - thanks to BorisMigrant hotel critics meet asylum seekers Mr Rubio said in a statement on Friday: \"Beijing claiming Scarborough Reef as a nature preserve is yet another coercive attempt to advance sweeping territorial and maritime claims in the South China Sea at the expense of its neighbours.\" The shoal lies within the Philippines' exclusive economic zone but has been under Beijing's control since 2012. China claims almost all the sea, which is used to transport more than $3 trillion of shipping commerce annually, despite competing claims by the Philippines, Brunei, Malaysia and Vietnam."
    },
    {
        "title": "My father the fraud: Daughter reveals how key scientist in Primodos scandal built career on lies",
        "description": "A renowned pharmacologist and expert witness in the Primodos drug scandal has been unmasked as a fraud - by his daughter.",
        "url": "https://news.sky.com/story/my-father-the-fraud-daughter-reveals-how-key-scientist-in-primodos-scandal-built-career-on-lies-13415496",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-primodos-nicholas-briggs_6997133.jpg?20250821184021",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-09-13 23:01:00",
        "Headline": "As an expert witness, Professor Michael Briggs challenged mothers who claimed Primodos damaged their babies in the womb. He has now been exposed as a conman who faked his qualifications.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  A renowned pharmacologist and expert witness in the Primodos drug scandal has been unmasked as a fraud - by his daughter. Professor Michael Briggs, who was also a NASA scientist and adviser to the World Health Organisation, built his glittering career on lies by faking his qualifications. The revelations come in a new book called The Scientist Who Wasn't There, written by his daughter Joanne Briggs - and Sky News can now reveal how his story sheds new light on a medical scandal that has rumbled on for five decades. From 1966 to 1970, Professor Briggs was UK research director for Schering pharmaceuticals, which made the pregnancy test drug Primodos, sold in the UK with great commercial success. Later, hundreds of mothers would claim that the drug damaged their babies in the womb - and Briggs was called as an expert witness to challenge their case. His involvement in understanding the effects of Primodos runs from the 1960s to the current day, and questions remain over whether his research was among a more recent body of work which has been used by the government to justify not setting up a redress scheme for disabled claimants. Yet, Briggs was a man who faked research. \"When I was small, I believed my dad to be the only man who knew all science,\" Joanne Briggs writes. Son of a typewriter mechanic from Manchester, he was an enigmatic figure, often dressed in a blazer and sunglasses. In one old family photo, Joanne says he looks like \"an operative from MI5, after he'd been issued with a wife and child\". Professor Briggs claimed he had advised film director Stanley Kubrick on the making of 2001: A Space Odyssey. He had indeed worked for NASA on the Mars probe, based at the California Institute of Technology, though Joanne believes he used \"a three-card trick\" to get the job. Speaking to Sky News in her kitchen in Sussex, she pulls out two A4-bound books. One purports to be a PhD thesis from Cornell University in 1959 by MH Briggs. The other is a Doctor of Science degree dated 1961 from Wellington University in New Zealand. \"Both of these documents are unfortunately fakes,\" says Joanne, explaining that her father worked for a year as a teaching assistant at Cornell and, at best, did a master's thesis. The \"super doctorate\" from Wellington would have required a real PhD, and Joanne believes he did submit something, but examiners described it as \"unfavourable\". \"He had a very contorted CV, that's for sure,\" says Joanne. \"He never completed a sustained piece of work leading to a higher degree of the kind that you would expect a scientist to have.\" Professor Briggs's name cropped up in Sky News investigations into Primodos. First in leaked letters from Schering in which scientists were discussing their concerns about the safety of the drug. Read more:Primodos - the secret drug scandalEvidence could reveal 'one of the biggest medical frauds of 20th century' A paediatrician named Isabel Gal raised the alarm in a paper published in science journal Nature, warning of a higher incidence of spina bifida in babies born to mothers who used hormone pregnancy tests. Briggs then asked a statistician, Dennis Cook, to see if there was a correlation between increased sales of the drug and malformations in UK newborns. Mr Cook, who later shared his study with Sky News, wrote to Briggs warning that the correlation was \"alarming\". Yet Briggs didn't act on this. He later left Schering, taking up senior roles in universities in Zambia then Australia, but in 1982, when Primodos campaigners attempted to sue Schering for damages, Briggs was a key expert witnesses offering to give evidence on behalf of the company. Joanne says: \"The collapse of the trial has been attributed to him by many people on the campaign side. He appeared to be an expert on a world stage, an incomparable expert. \"He advised the World Health Organisation's hormone pharmaceutical committee, so you couldn't ask for a better CV, but unfortunately what was in his CV was largely of his own making.\" Joanne describes her father's career as \"a series of fraudulent acts\". In the late 1980s he was caught out by Sunday Times journalist Brian Deer who found Briggs had been fabricating research for Schering and another company, relating to the safety of the contraceptive pill. Mr Deer told Sky News: \"He was in those days of typewriters, essentially sitting there and thinking of what the data ought to be, and typing it in to tables and sending it off to medical journals to publish.\" Aged 51, Briggs died in mysterious circumstances, shortly after the article was published. But his legacy wasn't over. Sky News has found animal studies produced while he was UK research director at Schering were among dozens of studies submitted by the manufacturer for use in an expert working group (EWG) report published in 2017 that examined Primodos for the government. Twenty-eight animal studies from the 1960s and 70s were provided by Schering, and while a number were produced in the late 70s after Briggs left the company, some of those were outsourced and done in preparation for the litigation in which Briggs was a key witness. Joanne believes based on the dates and \"hallmark characteristics of his turn of phrase\" that some of the studies were produced by her father. \"There are research papers there that were actually produced by my dad,\" she says. \"And they were relied on by the expert working group as part and parcel of their conclusion.\" The EWG report has since been used by government and manufacturers to dismiss more recent claims by campaigners about the drug's damaging effects. When asked specifically about one rabbit study from 1970, the Medicines and Healthcare products Regulatory Agency (MHRA), which oversaw the EWG, was able to confirm it was not done by Briggs, but asked us to direct further questions about Schering's studies to the manufacturer. It added that the MHRA is \"committed to reviewing any new scientific data which becomes available since the conclusion of the Expert Working Group's review\". Schering is now owned by Bayer, which told us: \"In 2017, the Expert Working Group of the UK's Commission on Human Medicines concluded that the available scientific data from a variety of scientific disciplines does not support a causal relationship between the use of sex hormones in pregnancy and an increased incidence of congenital anomalies or other adverse outcomes, such as miscarriage.\" Responding to specific questions about Professor Briggs, they added: \"Backed by the considerable body of scientific research and evidence, Bayer maintains that there is no causal relationship between use of Primodos and an increased incidence of congenital anomalies.\" But they have not told us whether studies by a serial faker were or weren't used to argue that the drug was safe. Joanne hopes her revelations could lead to a rethink about the evidence. \"I think this story about a man in the centre of this who happens to be a fabricated person, a hollow man, who has been relied on to such an extent for his expertise,\" she says. \"That doesn't strike me as irrelevant.\""
    },
    {
        "title": "25 arrested and officers injured - as up to 150,000 people join 'Unite the Kingdom' march in London",
        "description": "There were 25 arrests in London on Saturday as up to 150,000 people turned up to join a march organised by far-right activist Tommy Robinson. ",
        "url": "https://news.sky.com/story/nine-arrested-amid-significant-aggression-as-110000-people-join-unite-the-kingdom-march-in-london-13430478",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-unite-the-kingdom-tommy-robinson_7019641.jpg?20250913192909",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-13 18:17:00",
        "Headline": "Tech billionaire Elon Musk appeared via video link to address crowds gathered in central London for the Tommy Robinson-led rally.",
        "Content": " There were 25 arrests in London on Saturday as up to 150,000 people turned up to join a march organised by far-right activist Tommy Robinson.  Protesters forming the \"Unite the Kingdom\" rally gathered in the centre of the capital, holding Union and St George's flags. They heard a series of speeches, including from Mr Robinson, who called it the \"biggest freedom of speech\" in British history. Police estimated that between 110,000 to 150,000 attended the event, significantly exceeding the estimates of organisers. An anti-racism counter-protest, attended by about 5,000 campaigners, also took place, with the two groups clashing on Whitehall and Trafalgar Square, separated by lines of police. There were 25 arrests made, with many more likely, the Metropolitan Police said, adding that officers faced \"significant aggression\" from \"Unite the Kingdom\" attendees. \"The violence they faced was wholly unacceptable,\" police said. \n                  Police charge man over 'revolting' attacks on London synagogues \n                 \n                  Man dies after double shooting in south London\n                 \n                  890 people arrested at Palestine Action protest - including 17 on suspicion of assaulting police officers\n                 \"26 officers were injured, including four seriously - among them broken teeth, a possible broken nose, a concussion, a prolapsed disc and a head injury.\"  Police said the Robinson crowd was too big to fit into Whitehall and confrontation happened when police tried to stop them from encircling counter-protesters and accessing the area from different routes. A spokesman said: \"When officers moved in to stop them, they faced unacceptable violence. They were assaulted with kicks and punches. Bottles, flares and other projectiles were thrown. \"Nine arrests have been made so far for various offences, but many more people have been identified as committing offences. We will find them and they will face police action, even if it is not possible to do so today. \"Officers are continuing to face aggression in multiple locations, in particular at the north of Whitehall as they work to create a safe exit route for those who have been taking part in the Stand Up To Racism protest.\" Home Secretary Shabana Mahmood condemned \"those who have attacked and injured police officers\" during the protests, promising anyone taking part in criminal activity will \"face the full force of the law\". Musk makes surprise appearance  Robinson live-streamed the rally on X, with its audience peaking at 2.9 million viewers on Saturday afternoon. Making a surprise appearance via video link, tech billionaire Elon Musk called for a \"change of government\" in the UK. \"You can't - we don't have another four years, or whenever the next election is, it's too long,\" Musk told the crowd. \"Something's got to be done. There's got to be a dissolution of parliament and a new vote held.\" TV presenter Katie Hopkins also spoke after earlier appearing alongside Robinson, Lawrence Fox and Ant Middleton at the front of the march. 'Revolution has started - you can't stop it' With a voice which sounded hoarse from shouting, Robinson told crowds during his speech that \"millions\" had showed up for the rally. \"The dam has well and truly burst,\" he said. \"The cat is out of the bag and there is no putting it back in. The silent majority will be silent no longer.\" Addressing Sir Keir Starmer and the Labour government, Robinson said: \"The revolution has started - and you can't stop it.\" Referring to a Court of Appeal decision to overturn an injunction blocking asylum seekers being housed at The Bell Hotel in Epping, Essex, Robinson claimed UK courts found the rights of undocumented migrants supersede those of the \"local community\". He said: \"They told the world that Somalians, Afghanis, Pakistanis, all of them, their rights supersede yours - the British public, the people that built this nation.\""
    },
    {
        "title": "Why Tommy Robinson rally was different to any other",
        "description": "This was the biggest nationalist rally in recent memory - perhaps ever.",
        "url": "https://news.sky.com/story/why-tommy-robinson-rally-was-different-to-any-other-13430517",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-unite-the-kingdom-tommy-robinson_7019705.jpg?20250913200517",
        "type": "UK",
        "Author": "Tom Cheshire",
        "Date Published": "2025-09-13 18:51:00",
        "Headline": "Police said up to 150,000 people were in London on Saturday for the \"Unite the Kingdom\" rally led by far-right activist Tommy Robinson.",
        "Content": "\n          Data and forensics correspondent\n              @chesh\n  This was the biggest nationalist rally in recent memory - perhaps ever. Well before the march started, thousands of people flowed over Blackfriars bridge, or came up from Waterloo station, flags everywhere, hailing from everywhere - from Yorkshire roses to the diamond of the Isle of Wight. What exactly it was that \"United the Kingdom\" was left vague, for people to cheer their own particular cause.   This was billed as a free speech rally and the most common chants we heard were \"Keir Starmer's a w*****r\", \"oh Tommy Tommy\" and \"we want our country back\". That means different things to different people. \n                  25 arrested and officers injured - as up to 150,000 people join 'Unite the Kingdom' march in London\n                 \n                  Tommy Robinson bailed after arrest over alleged assault at railway station\n                 \n                  Police investigate assault as video appears to show Tommy Robinson at station\n                 As it happened: Thousands attend 'Unite the Kingdom' rally Dawn, up from Southampton and wearing a red sequined jacket, said it was because the country was \"getting overrun\". She said she was talking only about illegal migration. Others didn't draw that distinction. Danny from south Birmingham was holding a sign that said: \"Send them Back\" - and said he was unhappy with migration \"in general\". He came to \"stand up for what we believe in, the religion and identity of our country\". That's been a difference with this rally compared to past ones I've covered - an overt Christian nationalism. People carried wooden crosses. One person had a light up crucifix. When the crowd arrived at Whitehall, they were led from the stage in a chant of 'Christ is king'. And then a public recital of the Lord's Prayer shortly after that. It's an important difference. Not just a flag to rally around, but a religion too. At the centre of it all, the anti-Islam activist Tommy Robinson. When Robinson took the stage, it was more like a football match or festival than a political rally. \"We rode the storm, we weathered the storm, and today we are the storm,\" he shouted hoarsely. That's not much of an exaggeration, not when Elon Musk, the world's richest man, made a virtual appearance to back Robinson. Other speakers included those who can be uncontroversially classed as far right. And thugs clashed violently with police. And it's clear that simply writing off protestors as far right doesn't really capture what's going on either. The audience is too broad to fit just that label. The tinderbox summer of protest promised by activists never really caught flame. Instead, there has been the slow, steady burn of nationalism. This was its culmination but also, those here hoped, the beginning of something even bigger."
    },
    {
        "title": "Sikh woman raped in 'racially aggravated attack' speaks out",
        "description": "A Sikh woman who was raped in a \"racially aggravated attack\" in the West Midlands says she \"would never wish this on anyone\".",
        "url": "https://news.sky.com/story/sikh-woman-raped-in-racially-aggravated-attack-speaks-out-13429896",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-smethwick-sikh-rape-incident_7018573.jpg?20250913014210",
        "type": "UK",
        "Author": "Bethany Minelle, news reporter",
        "Date Published": "2025-09-13 12:54:00",
        "Headline": "The young woman, who said she was on her way to work when the attack took place, has thanked everyone for their \"love and support\" during a \"difficult\" time.",
        "Content": "By Bethany Minelle, news reporter  A Sikh woman who was raped in a \"racially aggravated attack\" in the West Midlands says she \"would never wish this on anyone\". Police were called just before 8.30am on Tuesday after the woman, who is in her 20s, reported being attacked by two white men in the area around Tame Road in Oldbury. The Sikh Federation (UK) said the perpetrators allegedly told the woman during the attack: \"You don't belong in this country, get out.\" The woman, who is entitled to anonymity as the victim of a sex offence, issued a statement through community group Sikh Youth UK. Thanking everyone for their support, she said: \"We are going through a lot, but the strength and kindness shown by the right people in the community has been incredible and I can't thank them enough for being my voice. \"I would never wish this on anyone. All I was doing was going about my day on my way to work, and what has happened has deeply affected us.\" Calling her family her \"rock,\" she went on: \"The police are doing their best to find those responsible, and I truly hope they are caught so that this doesn't happen to anyone else.\" \n                  Community voices shock and fear after woman raped in 'racially aggravated attack'\n                 \n                  Paul Topham: Man who murdered great-grandfather Harold Monk during Wolverhampton burglary jailed for at least 33 years\n                 \n                  On the streets with England's flag-raisers - as one claims link to Tommy Robinson\n                 She said she was \"truly humbled\" by the love and support she'd received. She added: \"I want to personally thank my family, Sikh Youth UK, who have been so supportive, the local Gurdwara committees and Sikh orgs, and everyone in my community who has stood by me. I cannot thank you enough for helping me get through this difficult time.\" 'How do we feel safe?' An emergency meeting was later held at the Guru Nanak Gurdwara temple in Smethwick, a few miles from Oldbury, following concerns within the community. Pervinder Kaur, vice president at Guru Nanak Gurdwara temple in Smethwick, told Sky News Midlands correspondent Shamaan Freeman-Powell: \"For something to happen during rush hour when the roads are so busy, how do we feel safe? When do we feel safe? \"A lot of the time you say, 'oh, it was dark, it was a secluded area' or whatnot. But for this to be happening in broad daylight, people have got no fear in them.\" Kuldeep Singh Deol, executive member of the Sikh Federation UK, said he is \"worried for the local community\" and said there had been a rise in hate crimes. Speaking to Sky News, he said: \"We've seen the Union Jacks appearing up and down the UK, which we don't have an issue with. \"But when it's becoming like this, hate is being festered and people are getting attacked as a result of this, something needs to be done.\" Read more:Arrests made at 'Unite the Kingdom' rallyTory leader accuses Starmer of 'lying' Police are still trying to identify the perpetrators of the attack, which they say is being treated as \"racially aggravated\". Officers said CCTV, forensic and other enquiries are well underway, but have appealed for anyone in the area who may have seen the men, or have any further information, to contact the force. One of the men is described as having a shaved head, of heavy build, and was reported to be wearing a dark coloured sweatshirt and gloves. The second man was reportedly wearing a grey top with a silver zip."
    },
    {
        "title": "Kemi Badenoch accuses Sir Keir Starmer of 'lying' about Peter Mandelson prior to sacking him",
        "description": "Kemi Badenoch has accused Sir Keir Starmer of \"lying to the whole country\" about what he knew regarding Peter Mandelson's correspondence with Jeffrey Epstein.",
        "url": "https://news.sky.com/story/kemi-badenoch-accuses-sir-keir-starmer-of-lying-about-peter-mandelson-prior-to-sacking-him-13430071",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-kemi-badenoch-sir-keir-starmer_7019073.jpg?20250913155944",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-13 14:24:00",
        "Headline": "The prime minister initially defended Lord Mandelson but sacked him as US ambassador after it was revealed he sent messages of support to Epstein even as the financier faced jail for sex offences in 2008.",
        "Content": " Kemi Badenoch has accused Sir Keir Starmer of \"lying to the whole country\" about what he knew regarding Peter Mandelson's correspondence with Jeffrey Epstein. Lord Mandelson was this week stripped of his position as ambassador to the US amid fresh scrutiny over his years-long friendship with the convicted paedophile. The prime minister initially defended the Labour peer but removed him from his post on Thursday after newly seen emails revealed he sent messages of support to Epstein even as he faced jail for sex offences in 2008. Politics latest: 'Unite the Kingdom' rally takes place with counterprotest nearby   The Times has now reported that Downing Street and the Foreign Office were aware of the emails on Tuesday - a day before Sir Keir gave Lord Mandelson his backing at Prime Minister's Questions (PMQs). In a post on X, Conservative leader Ms Badenoch wrote: \"Looks like the Prime Minister and Labour MPs spent the week lying to the whole country about what they knew regarding Mandelson's involvement with convicted paedophile Jeffrey Epstein.\" She continued: \"If No 10 had those emails for 48 hours before acting, it means he lied at PMQs and ministers lied again about new additional information. These are yet more errors of judgment. \"The Prime Minister has very serious questions to answer. The only way to clear this up is full transparency about who knew what, and when.\" 👉 Listen to Sky News Daily on your podcast app 👈 Sources said Sir Keir was not aware of the contents of the emails when he told MPs he had \"confidence\" in Lord Mandelson. A media enquiry outlining details of the messages between Lord Mandelson and Epstein was sent to the Foreign Office on Tuesday, and passed on to Number 10. Sir Oliver Robbins, the permanent under-secretary at the Foreign Office, asked Lord Mandelson about the emails on Tuesday, but did not receive a response until the following day. Sir Keir is understood not to have been aware of the contents of the emails until Wednesday evening. Speaking to Sky News, one Labour MP called for more information on what happened behind closed doors at Number 10 this week. Jo White, MP for Bassetlaw, in Nottinghamshire, said: \"We cannot move on until we find out how he [Sir Keir] was not briefed properly before PMQs.\" \"What he needs to do now is get on top and sort out this mess,\" she said. \"Suspend the whip from Peter Mandelson and expel him from the party, then have a transparent enquiry about what went wrong at Number 10.\" The call came as Sir Keir enjoyed some time away from Downing Street. The prime minister was on Saturday pictured watching Arsenal face Nottingham Forest in a Premier League match at the Emirates Stadium. Lord Mandelson's exit came after less than a fortnight after another high-profile loss for the Labour government, as Angela Rayner was forced to quit as deputy prime minister and deputy Labour leader over her tax affairs. As Sir Keir has faced a scandal-hit start to the month, a growing number of Labour MPs have begun calling his leadership into question. Read more from Sky News:Mandelson's exit leaves Trump visit in the lurchWhat we know about Mandelson-Epstein relationship Lucy Powell, who is running to replace Ms Rayner as Labour's deputy leader, has called for a \"change of culture\" at Downing Street. \"We've got a bit of a groupthink happening at the top, that culture of not being receptive to interrogation, not being receptive to differing views,\" she told The Guardian newspaper. Meanwhile, senior Labour MP Emily Thornberry has written to the new foreign secretary, Yvette Cooper, demanding answers about the vetting process for UK diplomats in the wake of Lord Mandelson's sacking."
    },
    {
        "title": "Police charge man over 'revolting' attacks on London synagogues ",
        "description": "A 37-year-old man has been charged with a series of attacks on synagogues in northwest London.",
        "url": "https://news.sky.com/story/police-charge-man-over-revolting-attacks-on-london-synagogues-13430618",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-golders-green-synagogue_7019850.jpg?20250913220331",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-13 20:53:00",
        "Headline": "The Metropolitan Police said four synagogues and a private residence had a substance and liquid smeared on them - understood to be bodily fluids - in northwest London earlier this month.",
        "Content": "A 37-year-old man has been charged with a series of attacks on synagogues in northwest London. Ionut-Cristian Bold, of no fixed address, has been charged with six counts of racially or religiously aggravated criminal damage and one count of racially or religiously aggravated harassment without violence. The Metropolitan Police said four synagogues and a private residence had a substance smeared on them in northwest London between 4 September and 11 September. Other incidents, which police described as \"revolting and appalling\", involved liquid being thrown towards a school and over a car in Barnet, north London. It is understood the substance and liquid were bodily fluids. Read more from Sky News:Man admits constituency arsonWoman raped in 'racially aggravated attack' speaks outArrests made at 'Unite the Kingdom' rally Bold has also been charged with three counts of destruction or damage to property and also of having an article with intent to destroy or damage property. \n                  Man jailed after beating his frail father to death with dumbbell in row over £40\n                 \n                  Man sentenced for gangland shooting that left girl aged nine with bullet lodged in brain\n                 \n                  New Banksy artwork being removed from Royal Courts of Justice wall in London\n                 He was remanded in custody to appear at Willesden Magistrates' Court on Monday. Superintendent Zubin Writer, who leads local policing in Barnet, Brent and Harrow, said: \"We will always treat allegations of this nature extremely seriously and these charges follow an investigation by a team of local officers. \"We continue to offer support to local residents, including members of the Jewish community.\" Barry Rawlings, leader of Barnet Council, condemned the attack, saying: \"The horrendous antisemitic attacks on our synagogues and a school disgust us. We all stand united in our condemnation of such appalling acts.\""
    },
    {
        "title": "Charlie Kirk's widow pays tribute to 'perfect' husband and says her cries 'will echo around the world'",
        "description": "Erika Kirk, the widow of conservative activist Charlie Kirk, described him as a \"perfect\" husband and father, and said the \"evildoers\" who assassinated him have no idea what they have unleashed.",
        "url": "https://news.sky.com/story/charlie-kirks-widow-pays-tribute-to-perfect-husband-and-says-her-cries-will-echo-around-the-world-13429729",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-erika-kirk_7018579.jpg?20250913033522",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-13 03:44:00",
        "Headline": "Erika Kirk said her husband \"loved life\" and that \"evildoers\" have no idea what they have unleashed, in her first public remarks since his assassination.",
        "Content": " Erika Kirk, the widow of conservative activist Charlie Kirk, described him as a \"perfect\" husband and father, and said the \"evildoers\" who assassinated him have no idea what they have unleashed. \"You have no idea of the fire that you have ignited within this wife, the cries of this widow will echo around the world like a battle cry,\" she said on Friday in her first public remarks since the assassination. \"If you thought that my husband's mission was powerful before, you have no idea, you have no idea what you just have unleashed across this entire country and this world, you have no idea.\" Mrs Kirk addressed the public after a silent prayer from the studio where her husband recorded his podcast. She thanked President Donald Trump and vice president JD Vance and his \"phenomenal\" wife, Usha, for the support, and praised the emergency teams who tried to save her husband's life. \"Charlie said if he ever ran for office, his top priority would be to revive the American family. That was his priority,\" Mrs Kirk said. \"But most of all, Charlie loved his children. And he loved me. With all his heart. And he made sure I knew that every day,\" she said. \n                  'Bella Ciao' to 'OwO' - what do the engravings on the bullets in the Charlie Kirk shooting mean?\n                 \n                  Tyler Robinson: All we know about suspect in Charlie Kirk's shooting - and how he was caught\n                 \n                  Charlie Kirk suspect arrested after tip-off from father\n                 She called him a \"perfect\" father and husband, as she held back tears. She also talked about some of his favourite hobbies. Read more:Charlie Kirk suspect arrested after tip-off from fatherAll we know about the suspect Mrs Kirk said the campus tour that his organisation, Turning Point USA, had started will continue - and urged young people to join her late husband's political movement. \"I promise I will never let your legacy die,\" she said, addressing her husband, vowing to make his movement the \"biggest thing this nation has ever seen\". Mrs Kirk says she doesn't remember the last time she slept, and shared a story about their daughter when she ran into her arms and asked: \"Where's daddy?\" \"What do you tell a three-year-old?\" Mrs Kirk finished her remarks, speaking directly to her husband: \"I can't wait to see you again one day.\" \"God bless you all, and may God bless America,\" she said as she wrapped up her speech."
    },
    {
        "title": "At least 32 people killed as Israel intensifies airstrikes in Gaza City, medical staff say",
        "description": "A barrage of airstrikes has killed at least 32 people in Gaza City as Israel continued intensifying its offensive there, medical staff have said.",
        "url": "https://news.sky.com/story/at-least-32-people-killed-as-israel-intensifies-airstrikes-in-gaza-city-medical-staff-say-13430175",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gaza-strike_7019193.jpg?20250913165147",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-13 15:46:00",
        "Headline": "Israel has in recent days increased its strikes on Gaza City, having ordered residents to leave what it says is Hamas's last stronghold.",
        "Content": "A barrage of airstrikes has killed at least 32 people in Gaza City as Israel continued intensifying its offensive there, medical staff have said. The dead include 12 children, according to the morgue in Shifa Hospital, where the bodies were brought. Health officials said one of the strikes killed a family of 10, including a mother and her three children. The Palestinian Football Association said a player for the Al-Helal Sporting Club, Mohammed Ramez Sultan, was killed with 14 members of his family.  Israel's army did not immediately respond to questions about the strikes when contacted by the Associated Press news agency. Israel has in recent days increased its strikes on Gaza City, having ordered residents to leave what it says is Hamas's last stronghold. Hundreds of thousands of people are still in the city, struggling under conditions of famine, which was declared by the Integrated Food Security Phase Classification (IPC) three weeks ago. Israel previously denied there is a famine in Gaza. Aid workers say the number of people leaving has spiked in recent weeks, but many families remain stuck due to difficulties with transportation and housing. Others have been displaced many times and do not want to move again, not trusting that anywhere in the Strip is safe.  In a message shared on social media on Saturday, Israel's army told the remaining Palestinians in Gaza City to \"leave immediately\" and move south into what it is calling a humanitarian zone. Sites in southern Gaza, where Israel is telling people to go, are overcrowded, the United Nations has said. A spokesperson for the Israeli army said more than 250,000 people have left Gaza City - but the UN puts the number at around 100,000 between mid-August and mid-September. The UN and aid groups have warned that displacing hundreds of thousands of people will exacerbate the dire humanitarian crisis in the enclave. Read more:Trump's 'heated call' with NetanyahuMedia groups unite against Israeli attacks The Hamas-run Gaza health ministry said on Saturday that seven people, including children, died from malnutrition-related causes over the past 24 hours. Israel has said it now controls 75% of Gaza, much of which has been reduced to fields of rubble. It has vowed to take the rest. The current conflict followed Hamas's attack on Israel on 7 October 2023, when militants killed 1,200 people and took around 250 people hostage. Israel's retaliatory offensive has killed at least 64,803 Palestinians, according to Gaza's health authorities. It does not distinguish between civilians and combatants in its count."
    },
    {
        "title": "Donald Trump urges NATO countries to stop 'shocking' Russian oil purchases to end Ukraine war",
        "description": "The war in Ukraine would end if all NATO countries stopped buying oil from Russia, Donald Trump has said.",
        "url": "https://news.sky.com/story/donald-trump-urges-nato-countries-to-stop-shocking-russian-oil-purchases-to-end-ukraine-war-13429901",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-president-donald-trump_7018969.jpg?20250913152217",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-13 12:56:00",
        "Headline": "The US president says the alliance's commitment to winning the war \"has been far less than 100%\" and the purchase of Russian oil by some members is \"shocking\", as it \"greatly weakens your negotiating position and bargaining power, over Russia\".",
        "Content": "The war in Ukraine would end if all NATO countries stopped buying oil from Russia, Donald Trump has said. The US president, in a post on his Truth Social platform on Saturday, said the alliance's commitment to winning the war \"has been far less than 100%\" and the purchase of Russian oil by some members is \"shocking\". Doing so \"greatly weakens your negotiating position and bargaining power, over Russia,\" he said. NATO member Turkey has been the third largest buyer of Russian oil since 2023, after China and India, according to the Centre for Research on Energy and Clean Air, with fellow members Hungary and Slovakia also buying energy supplies from Moscow.  A NATO ban on the practice plus tariffs on China would \"also be of great help in ENDING this deadly, but RIDICULOUS, WAR\", he added. The president said NATO members should also put 50% to 100% tariffs on China - and only withdraw them if the conflict ends. 'China's grip' on Russia \"China has a strong control, and even grip, over Russia,\" Mr Trump posted, and powerful tariffs \"will break that grip\". The US president has already placed a 25% import tax on goods from India over its buying of Russian energy products. Mr Trump said responsibility for the war fell on his predecessor Joe Biden and Ukrainian President Volodymyr Zelensky. He did not include in that list Russian President Vladimir Putin, who launched the invasion. Village changes hands On the battlefield on Saturday, Russian troops took control of the village of Novomykolaivka in Ukraine's southeastern Dnipropetrovsk region, the Russian Defence Ministry said. A drone attack hit an oil refinery in the city of Ufa, around 870 miles (1,400km) from the border with Ukraine, the local governor said, calling it a terrorist incident. Read more on Sky News:All we know about Kirk murder suspectNepal's first female PMMan admits constituency arson  NATO Secretary-General Mark Rutte said on Friday the 32-nation alliance would place military equipment on the border with Belarus, Russia and Ukraine to deter potential Russian aggression. Operation 'Eastern Sentry' followed Wednesday's provocative incursion by multiple Russian drones into the airspace of Poland, another NATO member. Polish forces shot down the drones, which Moscow said went astray because they were jammed.  Prince Harry's surprise visit The Duke of Sussex made a surprise visit to Ukraine on Friday, promising to do \"everything possible\" to help the recovery of injured military staff. Travelling on an overnight train to Kyiv, Prince Harry, who has since left the country, told The Guardian: \"We cannot stop the war but what we can do is do everything we can to help the recovery process. \"We have to keep it [the war] in the forefront of people's minds. I hope this trip will help to bring it home to people because it's easy to become desensitised to what has been going on.\""
    },
    {
        "title": "China warns UK and US after USS Higgins and HMS Richmond sail through Taiwan Strait",
        "description": "China has warned the UK and the US after their warships sailed through the diplomatically-fraught Taiwan Strait.",
        "url": "https://news.sky.com/story/china-warns-uk-and-us-after-uss-higgins-and-hms-richmond-sail-through-taiwan-strait-13429780",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-hms-richmond-plymouth-sound_7018617.jpg?20250913093923",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-13 08:43:00",
        "Headline": "The US destroyer USS Higgins and British frigate HMS Richmond were engaged in \"trouble-making and provocation\", Beijing said.",
        "Content": "China has warned the UK and the US after their warships sailed through the diplomatically-fraught Taiwan Strait. Chinese naval and air forces were ordered to monitor and warn the two ships, the HMS Richmond and the USS Higgins, as they made their way through the 110-mile (180km) passage between the island and the Chinese mainland on Friday. The pair were engaged in \"trouble-making and provocation\", according to Beijing's People's Liberation Army's (PLA) Eastern Theatre Command. \"The actions of the United States and Britain send the wrong signals and undermine peace and stability across the Taiwan Strait,\" it said in a statement. The Ministry of Defence said the sailing was a routine passage, adding that wherever the Royal Navy operates, \"it does so in full compliance with international law and norms, and exercises freedom of navigation rights in accordance with the United Nations Convention on the Law of the Sea\". The US Indo-Pacific Command also described the mission as a routine transit, describing the strait as \"beyond the territorial sea of any coastal state. \"Navigational rights and freedoms in the Taiwan Strait should not be limited,\" it said in a statement. \n                  Donald Trump urges NATO countries to stop 'shocking' Russian oil purchases to end Ukraine war\n                 \n                  MPs around the world urge leaders to follow Trump's call for Jimmy Lai's release\n                 \n                  China's Xi believes in destiny - and it's bad news for the West\n                 The British vessel, deployed in the East China Sea in 2021, is a Type 34, or Duke Class frigate, and the US ship is an Arleigh Burke-class (Flight II) Aegis guided missile destroyer.  China's navy said earlier on Friday that its third aircraft carrier, the Fujian, which is still undergoing sea trials, had passed through the strait as well. Last week, a Canadian and an Australian warship made the journey along the strategic waterway. The US and its allies, including Canada, Britain and France, send ships along the strait, which they see as being in international waters, around once a month. In June, another British warship, the HMS Spey, sailed through the strait to \"cause trouble\", in Beijing's words. China views Taiwan as its own territory, which Taipei rejects, and claims the strait is part of its territorial waters. Beijing has increased its military pressure on the island over the last five years, including by staging war games nearby. Taiwan's top China policymaker and head of its Mainland Affairs Council, said on Friday China was preparing to invade Taiwan. Speaking in Washington, Chiu Chui-cheng warned that if Taiwan were to fall it would cause a regional \"domino effect\" that would threaten US security. US Secretary of State Marco Rubio condemned what he called China's \"destabilising plans\" for a disputed atoll in the South China Sea. Read more on Sky News:Kirk suspect arrested after father's tip-offRoadworks Britain - thanks to BorisMigrant hotel critics meet asylum seekers Mr Rubio said in a statement on Friday: \"Beijing claiming Scarborough Reef as a nature preserve is yet another coercive attempt to advance sweeping territorial and maritime claims in the South China Sea at the expense of its neighbours.\" The shoal lies within the Philippines' exclusive economic zone but has been under Beijing's control since 2012. China claims almost all the sea, which is used to transport more than $3 trillion of shipping commerce annually, despite competing claims by the Philippines, Brunei, Malaysia and Vietnam."
    },
    {
        "title": "Nepal gets first female PM after week of deadly anti-corruption protests",
        "description": "Nepal has appointed its first female prime minister, following a week of deadly protests.",
        "url": "https://news.sky.com/story/nepal-gets-first-female-pm-after-week-of-deadly-anti-corruption-protests-13429783",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sushila-karki-nepal_7018621.jpg?20250913095717",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-13 08:54:00",
        "Headline": "Sushila Karki, who is 73 and is a former Supreme Court chief justice, has been sworn in as Nepal's interim prime minister.",
        "Content": " Nepal has appointed its first female prime minister, following a week of deadly protests. Former Supreme Court chief justice Sushila Karki was sworn in as interim prime minister by Nepal's president, Ramchandra Paudel, on Friday. The 73-year-old served as the court's only female chief justice in 2016 and 2017 and was popular in the role.  The move follows massive protests that collapsed the previous administration. Rallies began after the government decided to ban social media platforms, including Facebook and YouTube, and were also in protest at alleged government corruption. Violence over the past seven days has left at least 51 dead. Peaceful street demonstrations began on Monday in Kathmandu but ended with some protesters attacking government buildings and police opening fire. \n                  Charlie Kirk's widow pays tribute to 'perfect' husband and says her cries 'will echo around the world'\n                 \n                  Charlie Kirk suspect arrested after tip-off from father\n                 \n                  At least 32 people killed as Israel intensifies airstrikes in Gaza City, medical staff say\n                 Officers also fired tear gas and used water cannon, the Associated Press news agency reported. Read more: Nepal's anti-government protests are a powder keg moment that could change the country for years The ban was rescinded the following day, but the unrest continued, with tens of thousands of protesters attacking and burning the parliament, the presidential residence and private businesses. Luxury hotels, including the Hilton and Hyatt were set on fire, and a jailbreak also took place in the heart of the capital. The violence prompted prime minister Khadga Prasad Oli to resign on Tuesday and flee his official residence. Nepal's army took control of the capital on Tuesday night, restoring order and initiating negotiations among the protesters, army and president over the interim government. Nepal is no stranger to unrest, with large pro-democracy protests in 1990 and the anti-monarchy 2006 demonstrations that ended with the abolition of the monarchy in 2008."
    },
    {
        "title": "Charlie Kirk's widow pays tribute to 'perfect' husband and says her cries 'will echo around the world'",
        "description": "Erika Kirk, the widow of conservative activist Charlie Kirk, described him as a \"perfect\" husband and father, and said the \"evildoers\" who assassinated him have no idea what they have unleashed.",
        "url": "https://news.sky.com/story/charlie-kirks-widow-pays-tribute-to-perfect-husband-and-says-her-cries-will-echo-around-the-world-13429729",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-erika-kirk_7018579.jpg?20250913033522",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-13 03:44:00",
        "Headline": "Erika Kirk said her husband \"loved life\" and that \"evildoers\" have no idea what they have unleashed, in her first public remarks since his assassination.",
        "Content": " Erika Kirk, the widow of conservative activist Charlie Kirk, described him as a \"perfect\" husband and father, and said the \"evildoers\" who assassinated him have no idea what they have unleashed. \"You have no idea of the fire that you have ignited within this wife, the cries of this widow will echo around the world like a battle cry,\" she said on Friday in her first public remarks since the assassination. \"If you thought that my husband's mission was powerful before, you have no idea, you have no idea what you just have unleashed across this entire country and this world, you have no idea.\" Mrs Kirk addressed the public after a silent prayer from the studio where her husband recorded his podcast. She thanked President Donald Trump and vice president JD Vance and his \"phenomenal\" wife, Usha, for the support, and praised the emergency teams who tried to save her husband's life. \"Charlie said if he ever ran for office, his top priority would be to revive the American family. That was his priority,\" Mrs Kirk said. \"But most of all, Charlie loved his children. And he loved me. With all his heart. And he made sure I knew that every day,\" she said. \n                  'Bella Ciao' to 'OwO' - what do the engravings on the bullets in the Charlie Kirk shooting mean?\n                 \n                  Tyler Robinson: All we know about suspect in Charlie Kirk's shooting - and how he was caught\n                 \n                  Charlie Kirk suspect arrested after tip-off from father\n                 She called him a \"perfect\" father and husband, as she held back tears. She also talked about some of his favourite hobbies. Read more:Charlie Kirk suspect arrested after tip-off from fatherAll we know about the suspect Mrs Kirk said the campus tour that his organisation, Turning Point USA, had started will continue - and urged young people to join her late husband's political movement. \"I promise I will never let your legacy die,\" she said, addressing her husband, vowing to make his movement the \"biggest thing this nation has ever seen\". Mrs Kirk says she doesn't remember the last time she slept, and shared a story about their daughter when she ran into her arms and asked: \"Where's daddy?\" \"What do you tell a three-year-old?\" Mrs Kirk finished her remarks, speaking directly to her husband: \"I can't wait to see you again one day.\" \"God bless you all, and may God bless America,\" she said as she wrapped up her speech."
    },
    {
        "title": "'Bella Ciao' to 'OwO' - what do the engravings on the bullets in the Charlie Kirk shooting mean?",
        "description": "Experts have described engravings left on ammunition at the scene of the Charlie Kirk shooting as \"extremely online\" &#8211; so what do the words and symbols actually mean?",
        "url": "https://news.sky.com/story/bella-ciao-to-owo-what-do-the-engravings-on-the-bullets-in-the-charlie-kirk-shooting-mean-13430554",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-utah-valley-university_7016545.jpg?20250910214533",
        "type": "US",
        "Author": "Torin Gillies, social media producer, and Rachel McGrath, news reporter",
        "Date Published": "2025-09-13 19:26:00",
        "Headline": "To those who aren't chronically online, the messages may appear to be total gibberish. But for others, specifically gamers, many of the meanings are clear.",
        "Content": "By Torin Gillies, social media producer, and Rachel McGrath, news reporter   Experts have described engravings left on ammunition at the scene of the Charlie Kirk shooting as \"extremely online\" – so what do the words and symbols actually mean? Authorities said on Friday that the suspect accused of fatally shooting the Conservative activist left behind bullet casings featuring references to fascism, video games and internet memes. To those who aren't chronically online, the messages may appear to be total gibberish. But for others, specifically gamers, many of the meanings will have immediately been clear. Here's what each of the casings reference - and why experts have cautioned against using them to make assumptions about the suspect's political leanings.  1. 'notices, bulges, OWO, what's this?' This writing appears to reference a meme about the furry subculture, which centres on an interest in anthropomorphic animal characters. Within the furry community, OwO is an emoticon of a cute face (with the Os as the eyes and the w as a cute mouth or nose) and used as a way of flirting - but outside the community, it is often used in a mocking way, or as part of trolling. It's incredibly common for phrases used by people who are \"extremely online\" - which essentially means highly engaged in online culture - to have double or multiple meanings. For this reason, experts have cautioned against trying to interpret messages such as these engravings to determine an attacker's political leanings or motive.  Jamie Cohen, an assistant professor of media studies who studies memes at Queens College in New York, said: \"Oftentimes this extremely online disguise is meant to be doublespeak.\" Speaking to Sky News' US partner NBC News, he continued: \"It's meant specifically for someone like me to dive into what they would call meme culture and declare them something so that they get more press. \"So it could just be another bait and switch for researchers who are falling into the same trap that they are designing for more viral exposure.\" 2. 'Hey, fascist! Catch ↑ → ↓↓↓' When asked by Sky News' US correspondent James Matthews what the messages on the casings meant, Utah governor Spencer Cox said the writing referring to a fascist \"speaks for itself\".  The second half of the inscription - the directional arrows - were immediately identified by some gamers. Helldivers 2 players have pointed out that the arrow sequence is the code used to summon a 500kg bomb in the 2024 game - which itself has been interpreted as a satire of fascism. 👉 Follow Trump100 on your podcast app 👈   3. 'Oh bella ciao, bella ciao, bella ciao ciao ciao' Bella Ciao is a classic Italian song that became a popular anti-fascism anthem during Benito Mussolini's dictatorship. It has won renewed popularity in recent years thanks, in part, to featuring multiple times in Netflix's Spanish television series Money Heist. A popular remix of Bella Ciao has hit more than 260 million streams on Spotify worldwide and it's become a favourite on TikTok, as well as within the gaming community. Read more:All we know about the suspected assassinThe string of bloody political violence in the MAGA era 4. 'If you read this, you are gay lmao'  This juvenile insult, using the well-known abbreviation for 'laughing my ass off', is a common 'gotcha' phrase and simply appears to mock investigators. The messages, another expert has said, make one thing clear - the suspect was likely seeking fame. Lindsay Hahn, a University at Buffalo associate professor who researches ideological extremism and the ways in which perpetrators of violence justify their actions, said the messages do not necessarily indicate a specific ideology. \"But what they do indicate, is that the shooter wanted to get a message across and therefore be talked about online,\" she told NBC. \"It sort of seems like these messages, at the very minimum, were selected because he knew they were going to be talked about.\""
    },
    {
        "title": "Donald Trump urges NATO countries to stop 'shocking' Russian oil purchases to end Ukraine war",
        "description": "The war in Ukraine would end if all NATO countries stopped buying oil from Russia, Donald Trump has said.",
        "url": "https://news.sky.com/story/donald-trump-urges-nato-countries-to-stop-shocking-russian-oil-purchases-to-end-ukraine-war-13429901",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-president-donald-trump_7018969.jpg?20250913152217",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-13 12:56:00",
        "Headline": "The US president says the alliance's commitment to winning the war \"has been far less than 100%\" and the purchase of Russian oil by some members is \"shocking\", as it \"greatly weakens your negotiating position and bargaining power, over Russia\".",
        "Content": "The war in Ukraine would end if all NATO countries stopped buying oil from Russia, Donald Trump has said. The US president, in a post on his Truth Social platform on Saturday, said the alliance's commitment to winning the war \"has been far less than 100%\" and the purchase of Russian oil by some members is \"shocking\". Doing so \"greatly weakens your negotiating position and bargaining power, over Russia,\" he said. NATO member Turkey has been the third largest buyer of Russian oil since 2023, after China and India, according to the Centre for Research on Energy and Clean Air, with fellow members Hungary and Slovakia also buying energy supplies from Moscow.  A NATO ban on the practice plus tariffs on China would \"also be of great help in ENDING this deadly, but RIDICULOUS, WAR\", he added. The president said NATO members should also put 50% to 100% tariffs on China - and only withdraw them if the conflict ends. 'China's grip' on Russia \"China has a strong control, and even grip, over Russia,\" Mr Trump posted, and powerful tariffs \"will break that grip\". The US president has already placed a 25% import tax on goods from India over its buying of Russian energy products. Mr Trump said responsibility for the war fell on his predecessor Joe Biden and Ukrainian President Volodymyr Zelensky. He did not include in that list Russian President Vladimir Putin, who launched the invasion. Village changes hands On the battlefield on Saturday, Russian troops took control of the village of Novomykolaivka in Ukraine's southeastern Dnipropetrovsk region, the Russian Defence Ministry said. A drone attack hit an oil refinery in the city of Ufa, around 870 miles (1,400km) from the border with Ukraine, the local governor said, calling it a terrorist incident. Read more on Sky News:All we know about Kirk murder suspectNepal's first female PMMan admits constituency arson  NATO Secretary-General Mark Rutte said on Friday the 32-nation alliance would place military equipment on the border with Belarus, Russia and Ukraine to deter potential Russian aggression. Operation 'Eastern Sentry' followed Wednesday's provocative incursion by multiple Russian drones into the airspace of Poland, another NATO member. Polish forces shot down the drones, which Moscow said went astray because they were jammed.  Prince Harry's surprise visit The Duke of Sussex made a surprise visit to Ukraine on Friday, promising to do \"everything possible\" to help the recovery of injured military staff. Travelling on an overnight train to Kyiv, Prince Harry, who has since left the country, told The Guardian: \"We cannot stop the war but what we can do is do everything we can to help the recovery process. \"We have to keep it [the war] in the forefront of people's minds. I hope this trip will help to bring it home to people because it's easy to become desensitised to what has been going on.\""
    },
    {
        "title": "Zoopla and Uswitch owner plots break-up and sale",
        "description": "The owner of Uswitch, one of Britain's biggest price comparison platforms, and Zoopla, the online property portal, is plotting a break-up that could lead to the sale of some of Britain's best-known consumer websites in the next 12 months.",
        "url": "https://news.sky.com/story/zoopla-and-uswitch-owner-plots-break-up-and-sale-13429748",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-zoopla-amazon-booking-com_7018587.jpg?20250913072725",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-13 06:19:00",
        "Headline": "Silver Lake Partners has hired bankers from JP Morgan and Arma Partners to examine options for the assets owned by ZPG, which include insurance site Confused.com, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of Uswitch, one of Britain's biggest price comparison platforms, and Zoopla, the online property portal, is plotting a break-up that could lead to the sale of some of Britain's best-known consumer websites in the next 12 months. Sky News has learnt that Silver Lake Partners, the American private equity firm, has hired two investment banks to launch a review of strategic options for the assets which sit within holding company ZPG. This weekend, City sources said that JP Morgan and Arma Partners had been engaged by Silver Lake in recent weeks to advise on the project. Although no firm decisions have been reached about the future of ZPG's operating businesses, a series of sale processes for its various assets is seen as the likeliest outcome. The most prominent of the group's subsidiaries is RVU, a smaller holding company which owns Confused.com, the insurance comparison venture; Uswitch; Money.co.uk; mortgage brokerage Mojo Mortgages; and Tempcover, a temporary car insurance provider. ZPG also has three other businesses: Zoopla, which sits behind Rightmove in the rankings of Britain's biggest property portals; Hometrack, a property information site which also has common ownership with PrimeLocation.com; and Alto Software Group, which provides software services to estate agents through a further group of subsidiaries. Silver Lake took ZPG private from the London Stock Exchange in 2018 in a deal worth about £2.2bn. \n                  BlackRock to invest £500m in UK data centres during Trump visit\n                 \n                  Zero growth in July as economy 'continued to slow', official figures show\n                 \n                  Money blog: A £1 pay rise could leave you tens of thousands worse off in Britain - here's why\n                 Since then, it has acquired a number of other businesses, and reorganised itself into four more independent entities which sit within the ZPG holding company. A source indicated that there was \"no particular path or outcome\" for the strategic review to take. Confused.com was added to the group in 2020 when it was absorbed by RVU following the brand's acquisition from Admiral, the London-listed insurer. ZPG has also sold several assets, including RVU's international arm, in 2023. Industry sources said there was little or no chance of ZPG being sold in one transaction, with its assets more likely to be offloaded through several processes operating on distinct timetables. The valuation that ZPG's subsidiaries might fetch in future sale processes was unclear this weekend, with some potentially worth less than their implied value in the 2018 takeover. Many of ZPG's businesses operate in markets which have come under increasing pricing pressure, with growing competition placing a tighter squeeze on margins. Uswitch, which claims to have saved consumers close to £3bn on their household bills since sits launch in 2000, is expected to attract interest from bidders, according to insiders. Other mooted transactions in the price comparison sector, such as the sale of a minority stake in Compare The Market, have not materialised. Moneysupermarket, which is now publicly traded under the name Mony Group, is among the other major players in the industry. Accounts filed at Companies House for Zephyr Midco 2 Limited for the year ended December 31, 2023 showed group revenues of £451.5m, up from £391m the previous year. It made an operating loss from continuing operations of £23.3m, against a comparable figure of £630.1m in 2022. Silver Lake is one of the world's biggest private equity firms, holding stakes in companies including Manchester City Football Club's immediate parent, City Football Group, and the RAC breakdown recovery service. Sky News revealed last month that the RAC's owners were preparing to pursue a stock market flotation or sale of the company. The buyout firm is also an investor in the New Zealand All Blacks' commercial rights entity, following a protracted approval process. Silver Lake declined to comment."
    },
    {
        "title": "BlackRock to invest £500m in UK data centres during Trump visit",
        "description": "The world&#8217;s largest money manager will use President Trump&#8217;s state visit to the UK next week to unveil a &#163;500m plan to invest in UK data centres, one of the fastest-growing areas of global infrastructure spending.",
        "url": "https://news.sky.com/story/blackrock-to-invest-163500m-in-uk-data-centres-during-trump-visit-13429741",
        "image_url": "https://e3.365dm.com/21/02/1920x1080/skynews-blackrock-offices_5267671.jpg?20210303192149",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-13 05:20:00",
        "Headline": "The world’s largest asset manager will announce a data centre partnership with Digital Gravity Partners, one of a string of deals to be announced during President Trump’s state visit, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The world’s largest money manager will use President Trump’s state visit to the UK next week to unveil a £500m plan to invest in UK data centres, one of the fastest-growing areas of global infrastructure spending. Sky News has learnt that BlackRock plans to announce a joint venture with Digital Gravity Partners, a digital infrastructure investment manager, that will focus on acquiring and modernising existing data centres to improve their capacity. The project will be among dozens hailed by the government as evidence of the strength of the economic partnership between Britain and the US, as President Trump arrives in the UK against the politically tumultuous backdrop of Lord Mandelson's sacking as the US ambassador. BlackRock, which has more than $12.5 trillion in assets under management, has a significant presence in Britain, and will next week open a new Edinburgh office employing about 1,300 people. Earlier this week, Sky News revealed that Larry Fink, BlackRock's chairman and chief executive, would be part of the business delegation accompanying President Trump on the state visit. Other bosses in attendance will include Jensen Huang of Nvidia, the world's most valuable public company, and Sam Altman of ChatGPT architect OpenAI. Bloomberg News reported on Friday that the two companies would launch a multibillion-pound investment in the UK next week that will form part of the vast $500bn Stargate data centre project. \n                  Donald Trump urges NATO countries to stop 'shocking' Russian oil purchases to end Ukraine war\n                 \n                  'I'm afraid of leaving the house' - what it's like to live undocumented in Trump's America\n                 \n                  'Epstein is rolling in his grave laughing': Artist reveals why he photographed convicted paedophile - and Donald Trump\n                 The vast quantities being spent on artificial intelligence-related data centre infrastructure around the world represents one of the most important trends in the global economy, with the attendant strains on power resources also being throw into sharp focus. The government hopes to announce early next week aggregate figures for investment and job creation that will rival the £63bn it claimed to have secured as a result of last October's International Investment Summit, according to insiders. Critically, at a difficult time for an economy which official data shows is flat lining, the string of major corporate announcements will be hailed by Sir Keir Starmer's administration as evidence that Britain remains a top global destination for foreign investment. The Office for Investment, which was recently given a beefed-up role in Whitehall, has been involved in coordinating many of the deals to be announced next week, which will encompass energy, financial services, nuclear power and technology, according to insiders. Corporate and Whitehall sources said that BlackRock's £500m data centre deal would reflect the efforts of the prime minister, his business adviser Varun Chandra and chancellor Rachel Reeves to strengthen the government's relationship with the asset management behemoth during the last year. Dozens of bosses will attend a state banquet at Windsor Castle hosted by King Charles III during next week's trip. President Trump's visit will, however, come amid tensions over his tariff regime, with continuing uncertainty about the impact on British manufacturing sectors, including steel. There are also continuing tensions between the UK government and major drugmakers over pricing, with the US administration pressuring pharmaceutical companies to slash the price of prescription medicines in the US. BlackRock declined to comment."
    },
    {
        "title": "Kemi Badenoch accuses Sir Keir Starmer of 'lying' about Peter Mandelson prior to sacking him",
        "description": "Kemi Badenoch has accused Sir Keir Starmer of \"lying to the whole country\" about what he knew regarding Peter Mandelson's correspondence with Jeffrey Epstein.",
        "url": "https://news.sky.com/story/kemi-badenoch-accuses-sir-keir-starmer-of-lying-about-peter-mandelson-prior-to-sacking-him-13430071",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-kemi-badenoch-sir-keir-starmer_7019073.jpg?20250913155944",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-13 14:24:00",
        "Headline": "The prime minister initially defended Lord Mandelson but sacked him as US ambassador after it was revealed he sent messages of support to Epstein even as the financier faced jail for sex offences in 2008.",
        "Content": " Kemi Badenoch has accused Sir Keir Starmer of \"lying to the whole country\" about what he knew regarding Peter Mandelson's correspondence with Jeffrey Epstein. Lord Mandelson was this week stripped of his position as ambassador to the US amid fresh scrutiny over his years-long friendship with the convicted paedophile. The prime minister initially defended the Labour peer but removed him from his post on Thursday after newly seen emails revealed he sent messages of support to Epstein even as he faced jail for sex offences in 2008. Politics latest: 'Unite the Kingdom' rally takes place with counterprotest nearby   The Times has now reported that Downing Street and the Foreign Office were aware of the emails on Tuesday - a day before Sir Keir gave Lord Mandelson his backing at Prime Minister's Questions (PMQs). In a post on X, Conservative leader Ms Badenoch wrote: \"Looks like the Prime Minister and Labour MPs spent the week lying to the whole country about what they knew regarding Mandelson's involvement with convicted paedophile Jeffrey Epstein.\" She continued: \"If No 10 had those emails for 48 hours before acting, it means he lied at PMQs and ministers lied again about new additional information. These are yet more errors of judgment. \"The Prime Minister has very serious questions to answer. The only way to clear this up is full transparency about who knew what, and when.\" 👉 Listen to Sky News Daily on your podcast app 👈 Sources said Sir Keir was not aware of the contents of the emails when he told MPs he had \"confidence\" in Lord Mandelson. A media enquiry outlining details of the messages between Lord Mandelson and Epstein was sent to the Foreign Office on Tuesday, and passed on to Number 10. Sir Oliver Robbins, the permanent under-secretary at the Foreign Office, asked Lord Mandelson about the emails on Tuesday, but did not receive a response until the following day. Sir Keir is understood not to have been aware of the contents of the emails until Wednesday evening. Speaking to Sky News, one Labour MP called for more information on what happened behind closed doors at Number 10 this week. Jo White, MP for Bassetlaw, in Nottinghamshire, said: \"We cannot move on until we find out how he [Sir Keir] was not briefed properly before PMQs.\" \"What he needs to do now is get on top and sort out this mess,\" she said. \"Suspend the whip from Peter Mandelson and expel him from the party, then have a transparent enquiry about what went wrong at Number 10.\" The call came as Sir Keir enjoyed some time away from Downing Street. The prime minister was on Saturday pictured watching Arsenal face Nottingham Forest in a Premier League match at the Emirates Stadium. Lord Mandelson's exit came after less than a fortnight after another high-profile loss for the Labour government, as Angela Rayner was forced to quit as deputy prime minister and deputy Labour leader over her tax affairs. As Sir Keir has faced a scandal-hit start to the month, a growing number of Labour MPs have begun calling his leadership into question. Read more from Sky News:Mandelson's exit leaves Trump visit in the lurchWhat we know about Mandelson-Epstein relationship Lucy Powell, who is running to replace Ms Rayner as Labour's deputy leader, has called for a \"change of culture\" at Downing Street. \"We've got a bit of a groupthink happening at the top, that culture of not being receptive to interrogation, not being receptive to differing views,\" she told The Guardian newspaper. Meanwhile, senior Labour MP Emily Thornberry has written to the new foreign secretary, Yvette Cooper, demanding answers about the vetting process for UK diplomats in the wake of Lord Mandelson's sacking."
    },
    {
        "title": "My father the fraud: Daughter reveals how key scientist in Primodos scandal built career on lies",
        "description": "A renowned pharmacologist and expert witness in the Primodos drug scandal has been unmasked as a fraud - by his daughter.",
        "url": "https://news.sky.com/story/my-father-the-fraud-daughter-reveals-how-key-scientist-in-primodos-scandal-built-career-on-lies-13415496",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-primodos-nicholas-briggs_6997133.jpg?20250821184021",
        "type": "Technology",
        "Author": "Jason Farrell",
        "Date Published": "2025-09-13 23:01:00",
        "Headline": "As an expert witness, Professor Michael Briggs challenged mothers who claimed Primodos damaged their babies in the womb. He has now been exposed as a conman who faked his qualifications.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  A renowned pharmacologist and expert witness in the Primodos drug scandal has been unmasked as a fraud - by his daughter. Professor Michael Briggs, who was also a NASA scientist and adviser to the World Health Organisation, built his glittering career on lies by faking his qualifications. The revelations come in a new book called The Scientist Who Wasn't There, written by his daughter Joanne Briggs - and Sky News can now reveal how his story sheds new light on a medical scandal that has rumbled on for five decades. From 1966 to 1970, Professor Briggs was UK research director for Schering pharmaceuticals, which made the pregnancy test drug Primodos, sold in the UK with great commercial success. Later, hundreds of mothers would claim that the drug damaged their babies in the womb - and Briggs was called as an expert witness to challenge their case. His involvement in understanding the effects of Primodos runs from the 1960s to the current day, and questions remain over whether his research was among a more recent body of work which has been used by the government to justify not setting up a redress scheme for disabled claimants. Yet, Briggs was a man who faked research. \"When I was small, I believed my dad to be the only man who knew all science,\" Joanne Briggs writes. Son of a typewriter mechanic from Manchester, he was an enigmatic figure, often dressed in a blazer and sunglasses. In one old family photo, Joanne says he looks like \"an operative from MI5, after he'd been issued with a wife and child\". Professor Briggs claimed he had advised film director Stanley Kubrick on the making of 2001: A Space Odyssey. He had indeed worked for NASA on the Mars probe, based at the California Institute of Technology, though Joanne believes he used \"a three-card trick\" to get the job. Speaking to Sky News in her kitchen in Sussex, she pulls out two A4-bound books. One purports to be a PhD thesis from Cornell University in 1959 by MH Briggs. The other is a Doctor of Science degree dated 1961 from Wellington University in New Zealand. \"Both of these documents are unfortunately fakes,\" says Joanne, explaining that her father worked for a year as a teaching assistant at Cornell and, at best, did a master's thesis. The \"super doctorate\" from Wellington would have required a real PhD, and Joanne believes he did submit something, but examiners described it as \"unfavourable\". \"He had a very contorted CV, that's for sure,\" says Joanne. \"He never completed a sustained piece of work leading to a higher degree of the kind that you would expect a scientist to have.\" Professor Briggs's name cropped up in Sky News investigations into Primodos. First in leaked letters from Schering in which scientists were discussing their concerns about the safety of the drug. Read more:Primodos - the secret drug scandalEvidence could reveal 'one of the biggest medical frauds of 20th century' A paediatrician named Isabel Gal raised the alarm in a paper published in science journal Nature, warning of a higher incidence of spina bifida in babies born to mothers who used hormone pregnancy tests. Briggs then asked a statistician, Dennis Cook, to see if there was a correlation between increased sales of the drug and malformations in UK newborns. Mr Cook, who later shared his study with Sky News, wrote to Briggs warning that the correlation was \"alarming\". Yet Briggs didn't act on this. He later left Schering, taking up senior roles in universities in Zambia then Australia, but in 1982, when Primodos campaigners attempted to sue Schering for damages, Briggs was a key expert witnesses offering to give evidence on behalf of the company. Joanne says: \"The collapse of the trial has been attributed to him by many people on the campaign side. He appeared to be an expert on a world stage, an incomparable expert. \"He advised the World Health Organisation's hormone pharmaceutical committee, so you couldn't ask for a better CV, but unfortunately what was in his CV was largely of his own making.\" Joanne describes her father's career as \"a series of fraudulent acts\". In the late 1980s he was caught out by Sunday Times journalist Brian Deer who found Briggs had been fabricating research for Schering and another company, relating to the safety of the contraceptive pill. Mr Deer told Sky News: \"He was in those days of typewriters, essentially sitting there and thinking of what the data ought to be, and typing it in to tables and sending it off to medical journals to publish.\" Aged 51, Briggs died in mysterious circumstances, shortly after the article was published. But his legacy wasn't over. Sky News has found animal studies produced while he was UK research director at Schering were among dozens of studies submitted by the manufacturer for use in an expert working group (EWG) report published in 2017 that examined Primodos for the government. Twenty-eight animal studies from the 1960s and 70s were provided by Schering, and while a number were produced in the late 70s after Briggs left the company, some of those were outsourced and done in preparation for the litigation in which Briggs was a key witness. Joanne believes based on the dates and \"hallmark characteristics of his turn of phrase\" that some of the studies were produced by her father. \"There are research papers there that were actually produced by my dad,\" she says. \"And they were relied on by the expert working group as part and parcel of their conclusion.\" The EWG report has since been used by government and manufacturers to dismiss more recent claims by campaigners about the drug's damaging effects. When asked specifically about one rabbit study from 1970, the Medicines and Healthcare products Regulatory Agency (MHRA), which oversaw the EWG, was able to confirm it was not done by Briggs, but asked us to direct further questions about Schering's studies to the manufacturer. It added that the MHRA is \"committed to reviewing any new scientific data which becomes available since the conclusion of the Expert Working Group's review\". Schering is now owned by Bayer, which told us: \"In 2017, the Expert Working Group of the UK's Commission on Human Medicines concluded that the available scientific data from a variety of scientific disciplines does not support a causal relationship between the use of sex hormones in pregnancy and an increased incidence of congenital anomalies or other adverse outcomes, such as miscarriage.\" Responding to specific questions about Professor Briggs, they added: \"Backed by the considerable body of scientific research and evidence, Bayer maintains that there is no causal relationship between use of Primodos and an increased incidence of congenital anomalies.\" But they have not told us whether studies by a serial faker were or weren't used to argue that the drug was safe. Joanne hopes her revelations could lead to a rethink about the evidence. \"I think this story about a man in the centre of this who happens to be a fabricated person, a hollow man, who has been relied on to such an extent for his expertise,\" she says. \"That doesn't strike me as irrelevant.\""
    }
]