[
    {
        "title": "Hadush Kebatu: CCTV images show last sightings of wanted asylum seeker after he was released from prison in error",
        "description": "CCTV images have been released of a jailed asylum seeker who was accidentally freed from prison - as police detailed the last sighting of him.",
        "url": "https://news.sky.com/story/hadush-kebatu-cctv-images-show-last-sightings-of-wanted-asylum-seeker-after-he-was-released-from-prison-in-error-13457502",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hadush-kebatu-chelmsford_7062196.jpg?20251025231638",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-25 16:29:00",
        "Headline": "The images show him in Chelmsford on Friday and later in Dalston, east London, where he was carrying a \"distinctive white bag with pictures of avocados on it\", said the Metropolitan Police. ",
        "Content": " CCTV images have been released of a jailed asylum seeker who was accidentally freed from prison - as police detailed the last sighting of him. Hadush Kebatu was released in error from HMP Chelmsford on Friday instead of being handed over to immigration officials for deportation - one month into a 12-month sentence. As the manhunt continues, the images show him in the Essex town on Friday and later the same day in Dalston, east London, where he was carrying a \"distinctive white bag with pictures of avocados on it\", said the Metropolitan Police. The last sighting of the Ethiopian national was in Dalston CLR James Library in Dalston Square on Friday evening.  Kebatu had been found guilty in September of sexually assaulting a 14-year-old girl and a woman in Epping. His crimes while staying at The Bell Hotel in Epping sparked weeks of protests over the summer. \n                  Timeline of how manhunt for wrongly-released sex offender migrant Hadush Kebatu has unfolded\n                 \n                  Wrongly-released migrant 'tried to return to prison 4 or 5 times', witness says\n                 \n                  Father of teenage girl sexually assaulted by migrant sex offender reacts to his accidental release\n                  The Met Police, which has been leading the search for Kebatu, alongside Essex Police and the British Transport Police, has made a direct appeal to the fugitive to hand himself in. He left Chelmsford train station at 12.42pm on Friday and arrived at Stratford station in east London soon after at 1.12pm. Kebatu had since taken \"a number of journeys\" across London and had \"access to funds\", according to Met Commander James Conway. Last sighting The force said he was last seen shortly before 8pm on Friday evening in the Dalston area of Hackney in east London. It has released two CCTV images of him from Friday, one in Chelmsford where he was wearing his prison-issued, grey tracksuit and holding a clear, plastic bag containing his possessions. The other was taken in Dalston, where he was still wearing his grey tracksuit, but was carrying his belongings \"in a distinctive white bag with pictures of avocados on it\". A Met statement added: \"Additional officers have been deployed to the area to carry out further searches, but we are appealing for the help of local residents to report any sightings as soon as possible.\" Mr Conway has asked for members of the public who have given assistance to Kebatu to contact them or anyone who sees him to call 999. And in a direct appeal to Kebatu, Mr Conway added: \"We want to locate you in a safe and controlled way. \"You had already indicated a desire to return to Ethiopia when speaking to immigration staff, the best outcome for you is to make contact directly with us by either calling 999 or reporting yourself to a police station.\"  Meanwhile, a lorry driver, who was delivering equipment to Chelmsford jail on Friday, told Sky News correspondent Tom Parmenter he saw the \"confused\" offender outside the facility being directed by prison staff to the town's railway station following his release. The witness, called Sim, said Kebatu came out of the jail saying, \"Where am I going? What am I doing?\" and hanging around for about 90 minutes as he tried to find out where he should be going. Sim said the offender returned to the prison \"four or five times\" but was turned away. He said Kebatu knew he should be deported but the prison staff were \"basically sending him away\" and saying to him, \"Go, you've been released, you go\". Kebatu was spotted later in Chelmsford town centre asking for assistance before getting on a train to London. HM Prison and Probation Service is introducing new and mandatory procedures for prisoner releases after Kebatu was mistakenly freed, Ministry of Justice sources say. Duty governors, who are responsible for the daily secure operation of prisons, will now be required to complete additional checks the evening before a release, it is understood. Governors will need to provide assurance that the procedure is in place on Monday, Sky News understands. Justice Secretary David Lammy said on Friday night that Kebatu was \"at large in London\". He said he was \"livid on behalf of the public\" and added that he had launched an investigation. Sir Keir Starmer said he was \"appalled\" at the accidental release and said it was \"totally unacceptable\", adding: \"This man must be caught and deported for his crimes.\" A prison officer has been taken off duties to discharge prisoners while an investigation takes place."
    },
    {
        "title": "Wrongly-released migrant 'tried to return to prison 4 or 5 times', witness says",
        "description": "A delivery driver who spoke to wanted migrant Hadush Kebatu at Chelmsford prison has told Sky News the \"confused\" offender was guided to the railway station by prison staff.",
        "url": "https://news.sky.com/story/witness-wanted-migrant-was-confused-and-directed-to-station-by-prison-staff-13457133",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-hadush-kebatu-epping_7029360.jpg?20251025080729",
        "type": "Home",
        "Author": "Tom Parmenter",
        "Date Published": "2025-10-25 12:42:00",
        "Headline": "The driver says Kebatu returned to the prison 'four or five times' and was eventually sent away in a 'stressed' and 'upset' state.",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  A delivery driver who spoke to wanted migrant Hadush Kebatu at Chelmsford prison has told Sky News the \"confused\" offender was guided to the railway station by prison staff. The mistake triggered a manhunt that now involves three police forces looking for the Ethiopian in London. Live updates on the manhunt The driver, called Sim, was delivering equipment to the prison on Friday when Kebatu was released in error instead of being handed over to immigration officials for deportation. The lorry driver explained to Sky News that Kebatu approached him and seemed to have no idea of where he was supposed to go.  \"He came out of the airlock, and kept saying to the officers there, 'Where am I going? What am I doing? I don't know where I'm going and what I'm doing.' \"He was holding a pack of paperwork in his arms, and his bag of bits… \"He knew he'd been deported. He came over to me and said, 'I need you to help me.' \"His English was pretty good.\" Sim, who still has the vehicle pass from the prison, said that after a while a member of prison staff directed the offender to Chelmsford station to catch a train to London, and \"told him that he had to get on a train\". He says Kebatu must have been outside the prison for roughly \"an hour and a half\" before finally leaving, adding, \"They [the officers] were basically sending him away, saying, 'Go, you've been released, you go.' Sim describes Kebatu as being \"very confused,\" saying, \"He kept scratching his head and saying, 'Where do I go, where do I go?' \"The fourth or fifth time [he went into the reception] he was starting to get upset, he was getting stressed. I'm not sticking up for the guy, but in my eyes, he was trying to do the right thing. He knew he was getting deported, but he didn't know where he was going or how he should get there.\" He added that the officers had no interest in helping him, saying, 'You're released, you're released'.  Read more: How many prisoners are released by mistake? Sim describes witnessing a \"a big, massive manhunt\" when he left the prison after making his delivery, with a police helicopter in the sky and lots of sirens and officers everywhere. He says it wasn't until he got home that he realised the drama was around the man he had been speaking to. Describing his feelings about the debacle, Sim said: \"It's scary how this has all unfolded, and how easily he's been able to get out and then be around the public. \"He's obviously not a secure man. He shouldn't have been released and the fact there's so many officers there - how come no one's clocked it sooner?\"  He went on: \"Someone here has messed up… I know someone has been taken off duty… But to me, there's got to be more people that allowed this to happen, not just one person... \"It's not the first time it's happened, and I very much doubt it will be the last\" When approached for comment, the Ministry of Justice referred Sky News to comments by David Lammy on Friday night, where he said: \"I'm appalled, I'm livid on behalf of the public that Kebatu is at large. \"He should be deported back to Ethiopia after the sexual assaults that he's committed.\""
    },
    {
        "title": "Twenty warnings for Sir Keir Starmer from new deputy leader Lucy Powell",
        "description": "Labour's new deputy leader Lucy Powell promised to be Sir Keir Starmer's ally.",
        "url": "https://news.sky.com/story/twenty-warnings-for-sir-keir-starmer-from-new-deputy-leader-lucy-powell-13457232",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lucy-powell-labour_7037947.jpg?20251001094236",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-10-25 13:53:00",
        "Headline": "Sky's Jon Craig breaks down what Labour's Lucy Powell said - and what she meant - as she was crowned the party's new deputy leader after a closely fought race against Education Secretary Bridget Phillipson.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Labour's new deputy leader Lucy Powell promised to be Sir Keir Starmer's ally. Yet in her victory speech she criticised his government and its record no fewer than 20 times. And told him to raise his game, or else. Politics live: Follow for updates as Labour names new deputy leader Here's what she said - and what she meant: Read more from Sky News:The one thing Farage and Polanski have in commonChina 'enemy' reference removed from witness statement She said it all with a smile, but there was menace there. As deputy leader, Lucy Powell was always going to be a critical friend. So there you go, prime minister. Here's 20 things you need to do for her to be more friend than critic."
    },
    {
        "title": "Independent candidate Catherine Connolly wins Irish presidential election",
        "description": "Independent candidate Catherine Connolly has won Ireland's presidential election after her rival conceded.",
        "url": "https://news.sky.com/story/catherine-connolly-set-to-become-irelands-next-president-as-rival-concedes-13457154",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-cathering-connolly_7062002.jpg?20251025192649",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-25 13:01:00",
        "Headline": "Left-wing Catherine Connolly pledged to be an \"inclusive president for all\" after being elected to replace Michael D Higgins, a popular poet and former arts minister who has served the maximum two terms in office.",
        "Content": " Independent candidate Catherine Connolly has won Ireland's presidential election after her rival conceded. The 68-year-old former barrister from Galway secured 63% of first preferences, in an election that was marked by a significant number of spoiled votes. Speaking at Dublin Castle after officially being declared the winner, Ms Connolly pledged to be \"an inclusive president for all\". Analysis: A landslide victory in a lacklustre presidential election  She said: \"I will be a president who listens and reflects and who speaks when it's necessary. \"I will be a voice for peace, a voice that builds on our policy of neutrality, a voice that articulates the existential threat posed by climate change, and a voice that recognises the tremendous work being done the length and breadth of the country. \"But my message is, use your voice in every way you can, because our public and democracy needs constructive questioning and, together, we can shape a new republic that values everybody, that values and champions diversity and that takes confidence in our own identity, our Irish language, our English language, and new people who have come to our country.\" The Irish presidency - which has been held by Michael D Higgins, a popular poet and former arts minister for the past 14 years - is largely ceremonial, but one with real national significance.  'A president for all of us' Congratulations from across the political spectrum poured in for Ms Connolly, including her only opponent in the race, Fine Gael candidate Heather Humphreys. She told reporters at the Cavan-Monaghan count centre: \"Catherine will be a president for all of us and she will be my president, and I really would like to wish her all the very, very best. \"I have absolutely not one regret.\" Also speaking at Dublin Castle, Ireland's Prime Minister Micheal Martin said he was looking forward to working with Ms Connolly. \"What an outstanding honour that has been bestowed upon her by the people of Ireland,\" he said. \"The people are sovereign in our democracy, we have one of the oldest democracies in the world, and it's something we cherish very much indeed. \"And the people have spoken resoundingly today. They've given Catherine a tremendous majority and a very clear mandate.\" Ireland's deputy premier, Simon Harris, who leads the Fine Gael party, said in a statement that Ms Connolly will be a president \"for all this country and for all of us\". The final result was officially announced by presidential returning officer Barry Ryan after counting in all 43 constituencies had completed. From early on Saturday, Ms Connolly was ahead in count centres nationwide, which she said she was \"absolutely delighted\" by. The election was, however, marked by a significant number of spoiled votes, with 213,738 invalid polls nationwide - a tenfold increase on the last presidential election in 2018. Among the anti-government messages on the ballots were \"no democracy\", \"EU puppets\" and \"no from me\". Read more: Who is Catherine Connolly? 'Seismic moment in our history' Social Democrats leader Holly Cairns added Ms Connolly's win represented a \"seismic moment in our history\". The Social Democrats were one of a number of parties backing Independent Ms Connolly in the election. She said: \"The momentum behind Catherine's presidential bid was incredible, growing from a small campaign run by dedicated volunteers to the grassroots movement it became. \"From day one, her message of inclusion, equality and social justice resonated with voters in every corner of Ireland. \"Catherine had a clear vision for the presidency and was determined to speak out on issues that mattered to people - housing, cost of living, disability services, climate action, the Irish language and neutrality. \"Catherine's considered, focused and compassionate approach to this campaign was hugely impressive.\""
    },
    {
        "title": "Trump's Venezuela drug bust shows he's either misinformed or has another motive",
        "description": "The world's largest aircraft carrier is steaming towards the Caribbean supported by the rest of its \"carrier group\" to add even more muscle to the US forces already threateningly close to Venezuela.",
        "url": "https://news.sky.com/story/trumps-venezuela-drug-bust-shows-hes-either-misinformed-or-has-another-motive-13457711",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-venezuela-trump-us_7052301.jpg?20251016112919",
        "type": "Home",
        "Author": "Stuart Ramsay",
        "Date Published": "2025-10-25 20:07:00",
        "Headline": "Sky's Stuart Ramsay says while the US president acknowledges that the synthetic opioid fentanyl is a huge killer in the US (which it is) and is supplied by drug gangs (which it is), to blame Venezuela for fentanyl production is simply incorrect.",
        "Content": "\n          Chief correspondent\n        The world's largest aircraft carrier is steaming towards the Caribbean supported by the rest of its \"carrier group\" to add even more muscle to the US forces already threateningly close to Venezuela. The question is simple - is this really all about President Trump's war on drugs in South America? I doubt it. A sledgehammer to crack a nut isn't even in it.   There are a few reasons to doubt the American government's stated aim of wiping out these so-called \"narco terrorist\" gangs threatening the US from Venezuela, even after one takes out of the equation the sort of equipment the military is deploying - which isn't what they would need for effective drug smuggling interdiction. While the president acknowledges that the synthetic opioid fentanyl is a huge killer in the US (which it is) and is supplied by drug gangs (which it is), to blame Venezuela for fentanyl production is simply incorrect.  Mexican cartels produce fentanyl with precursors largely supplied from China, and it is from Mexico - America's neighbour - that the fentanyl is smuggled directly into the US across its southern border. Venezuela isn't involved in this fentanyl business in any meaningful way, and I know this because I have reported from the Sinaloa cartel's fentanyl production labs in Mexico. The Mexican cartels are very proud of their business, and from my experience covering this story over the years, when the drugs cartels are proud of something, and it makes them a lot of money - which fentanyl does - they don't share the market with anyone, and certainly not with Venezuela. President Trump is right that Venezuela is now a large supplier of other illegal drugs, especially cocaine, but they come from countries like Colombia, Peru, and Bolivia, which are the largest producers of the coca leaf in the world (the coca leaf is what cocaine is made from). Read more:US accused of 'inventing a war'Survivors reported after boat strikeUS destroys 'drug smuggling submarine' Venezuela, which borders Colombia, is largely a transit country to the Caribbean in the same way that Ecuador, which also borders Colombia, is a transit country to the Pacific. Neither Venezuela nor Ecuador are significant drug producers. The drugs enter Venezuela overland, primarily from Colombia, and then mainly leave the country from ports on the northern coast of the country - and these are the departure points of the boats the US government has recently targeted and destroyed, along with the crews on board.  President Trump claims these boats from Venezuela are heading to the US, but in reality they are mainly heading to the nearby islands of Trinidad and Tobago, and from there they largely go to West Africa and Europe - mostly Spain and Portugal. Drugs heading to America either pass through Mexico over the border into the US or are transported via the Pacific Ocean route through countries like Ecuador. In this instance, Venezuela isn't involved. Read more: Inside Pablo Escobar's home city where drugs are readily available  It's widely accepted the two most exported drugs from South America are cocaine and marijuana - and the volume of production is staggering. But the Centres for Disease Control and Prevention in the US says that synthetic opioids like fentanyl are responsible for most overdose deaths there - and fentanyl is not produced in South America, whatever the president says. So one can only conclude he is either mistaken and misinformed, or he has another motive. I suspect it is the latter, and that regime change in Venezuela is top of the list."
    },
    {
        "title": "British Airways pulls Louis Theroux podcast funding over Bob Vylan interview",
        "description": "British Airways (BA) has paused its sponsorship of The Louis Theroux Podcast following an interview with Bob Vylan's frontman.",
        "url": "https://news.sky.com/story/british-airways-pulls-louis-theroux-podcast-funding-over-bob-vylan-interview-13457331",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-louis-theroux-bob-vylan_7061640.jpg?20251025163303",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-25 15:17:00",
        "Headline": "The frontman of the controversial punk duo Bob Vylan was quizzed by Theroux after his IDF chant at Glastonbury caused uproar.",
        "Content": "British Airways (BA) has paused its sponsorship of The Louis Theroux Podcast following an interview with Bob Vylan's frontman. Pascal Robinson-Foster, one half of the controversial punk duo, told Theroux in an episode which aired earlier this week that he was \"not regretful\" of chanting \"death, death to the IDF [Israel Defence Forces]\" at this year's Glastonbury. He added that he would \"do it again tomorrow, twice on Sundays\". British Airways said on Saturday that the content \"breaches\" its sponsorship policy and has since paused its advertising on the podcast, the Jewish News first reported. An airline spokesperson said: \"Our sponsorship of the series has now been paused and the advert has been removed. \"We're grateful that this was brought to our attention, as the content clearly breaches our sponsorship policy in relation to politically sensitive or controversial subject matters. \"We and our third-party media agency have processes in place to ensure these issues don't occur and we're investigating how this happened.\" \n                  Bob Vylan on 'death, death to the IDF' chant: 'I'd do it again tomorrow, twice on Sundays'\n                 \n                  'I felt like a trespasser and imposter': Louis Theroux to be awarded prestigious NFTS fellowship\n                 \n                  Barry Keoghan hits back at 'disgusting' online attacks calling him an 'absent father'\n                 Following Bob Vylan's Glastonbury performance, the band were dropped by a number of festivals and performances including Radar festival, a show at a German music venue and their US tour after their visas were revoked. The comments were condemned by the US as a \"hateful tirade\" and \"appalling hate speech\" by British Prime Minister Sir Keir Starmer. The BBC's Executive Complaints Unit has since found the broadcast of Bob Vylan's set breached editorial standards related to harm and offence. The band have also had to reschedule dates of its upcoming We Won't Go Quietly UK tour in Manchester and Leeds after Jewish leaders and politicians called for the show to be postponed. In a statement on Facebook, the group said: \"Due to political pressure from the likes of Bridget Phillipson and groups in the Northwest of England we have had to reschedule our Leeds and Manchester shows. \"All tickets remain valid and all other shows are continuing as planned.\"  When asked by Theroux, Vylan said he was taken aback by the uproar the chant has caused, saying: \"It wasn't like we came off stage, and everybody was like [gasps]. It's just normal.\" He added that he wanted an end to \"the oppression that Palestinian people are facing\". Read more: Who are Bob Vylan? Despite the criticism, the group have seen support from fans, with their album Humble As The Sun re-entering the charts and climbing to number one in the UK Hip Hop and R&B album category. A spokesperson at Mindhouse Productions - which was founded by Theroux and produces The Louis Theroux Podcast - has not commented on the BA sponsorship, but told Sky News: \"Louis is a journalist with a long history of speaking to controversial figures who may divide opinion. \"We would suggest people watch or listen to the interview in its entirety to get the full context of the conversation.\""
    },
    {
        "title": "Timeline of how manhunt for wrongly-released sex offender migrant Hadush Kebatu has unfolded",
        "description": "The manhunt for Hadush Kebatu, an asylum seeker and convicted sex offender who was wrongly freed from prison, continues.",
        "url": "https://news.sky.com/story/timeline-of-how-manhunt-for-wrongly-released-sex-offender-migrant-hadush-kebatu-has-unfolded-13457575",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kebatu-manhunt_7061973.jpg?20251025234319",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-25 17:19:00",
        "Headline": "The Ethiopian national was due to be released in order to be immediately deported, but instead he was able to board a train to London - triggering a manhunt involving three police forces.",
        "Content": " The manhunt for Hadush Kebatu, an asylum seeker and convicted sex offender who was wrongly freed from prison, continues. The Ethiopian national had been serving a 12-month sentence at HMP Chelmsford since September. He was due to be released in order to be immediately deported, but instead he was able to board a train to London. The mistake triggered a manhunt that now involves three police forces looking for the prisoner. His current whereabouts are unknown. Here, Sky News examines how the event has unfolded: Kebatu is released from HMP Chelmsford wearing a prison-issued grey tracksuit. He is also holding a clear plastic bag containing his possessions. The prison released him on the expectation that he would be picked up by immigration enforcement, and the Home Office was ready to take Kebatu to an immigration removal centre, it is understood. But it is unclear exactly what happened next. A lorry driver, who was delivering equipment to Chelmsford jail on Friday, told Sky News correspondent Tom Parmenter he saw the \"confused\" offender outside the facility being directed by prison staff to the town's railway station following his release. The offender is said to have returned to the prison \"four or five times\" but was turned away. Footage later appears to show Kebatu in Chelmsford High Street. In the video he appears to ask a group of people for help. 12.41pm: The prisoner boards a Greater Anglia London-bound train at Chelmsford station. 12.51pm: The train arrives at Shenfield station, in the Essex borough of Brentwood. 12.57pm: Essex Police are informed by the prison service that Kebatu was mistakenly released. The force says it has launched a search operation and is working closely with partner agencies. By the time the search started, the train that Kebatu boarded at Chelmsford had already called at Shenfield, according to Trainline data. Essex Police appeals to anyone who has seen the prisoner to contact the force immediately. 1.12pm: Kebatu gets off the train at Stratford in east London. 8pm: The last time Kebatu was seen. The Metropolitan Police say the prisoner was spotted in the Dalston area of Hackney. He was pictured still wearing his prison-issue grey tracksuit top and bottoms, and was carrying his belongings \"in a distinctive white bag with pictures of avocados on it\".  12.37pm: The Metropolitan Police announce it has taken over the manhunt for Kebatu. In a statement, commander James Conway says senior investigating officers are \"examining CCTV\" from around Stratford station and further afield, to establish information about the prisoner's subsequent movements.  2.00pm: A delivery driver who spoke to Kebatu outside Chelmsford prison tells Sky News the \"confused\" offender was guided to the railway station by prison staff. He says Kebatu approached him with no idea of where he was supposed to go. He adds the prisoner must have been outside the prison for roughly \"an hour and a half\", before he finally left, adding: \"They [the officers] were basically sending him away, saying, 'Go, you've been released, you go'.\"  4.30pm: Met Police Commander James Conway makes a direct appeal to Kebatu. \"We want to locate you in a safe and controlled way. You had already indicated a desire to return to Ethiopia when speaking to immigration staff,\" he says. \"The best outcome for you is to make contact directly with us by either calling 999 or reporting yourself to a police station.\" He says he believes Kebatu has access to funds and that he's sought assistance from members of the public and station staff in both Chelmsford and London. Read more:How many prisoners are released by mistake? What happened in the lead up to the wrongful release? Kebatu was found guilty of five offences after a three-day trial at Chelmsford and Colchester magistrates' courts in September. His case led to protesters and counter-protesters taking to the streets in Epping, Essex, and eventually outside hotels housing asylum seekers across the country. The incidents occurred in July, eight days after he arrived in the UK by small boat. Use the arrows below to click through a timeline of how the case has unfolded. "
    },
    {
        "title": "Sheffield Wednesday fans 'elated' after club administration - but the road ahead won't be straightforward",
        "description": "When a football club is placed into administration, it's usually a devastating moment for their fan base.",
        "url": "https://news.sky.com/story/sheffield-wednesday-fans-elated-after-club-administration-but-the-road-ahead-wont-be-straightforward-13457500",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sheffield-wednesday_7061832.jpg?20251025175848",
        "type": "Home",
        "Author": "Shingi Mararike",
        "Date Published": "2025-10-25 17:50:00",
        "Headline": "Sky's Shingi Mararike speaks to Sheffield Wednesday fans about their reaction to the club entering administration.",
        "Content": "\n          North of England correspondent\n              @ShingiMararike\n When a football club is placed into administration, it's usually a devastating moment for their fan base. But as home fans began to stream through the turnstiles at Hillsborough for Sheffield Wednesday's match against Oxford United, the mood was one of relief and even a little bit of delight. That's because for the last few seasons, The Owls, one of world football's oldest teams, have been in disarray. Unhappiness under the 10-year ownership of Thai businessman Dejphon Chansiri had led to fans boycotting games.   The club had a raft of unpaid debts, with rumours of an imminent winding-up petition being issued by HMRC. James Silverwood, the vice chair of the Sheffield Wednesday Supporters Trust, summed up the mood a couple of hours before kick off. \"We're probably an unusual fan base in that we're actually quite elated and optimistic about going into administration,\" he said. \"It means that the previous owner has gone, an owner who was mismanaging the club, who had no respect for the community and the fan base. So this is really a fresh start.\" That fan base, who had largely stayed away this season, were out in full-force. The club shop was full of people of all ages, buying scarves, shirts and hats, while other fans stood by the gates, bursting into applause when the players arrived. One woman sitting outside the shop wearing a club scarf summed up the highs and lows of the past few years. \"I've been a season ticket holder for a long time,\" she said. \"Coming into Hillsborough, sometimes it can be the best place on Earth, but sometimes it can be toxic as well. Just to move forward now is the best thing for us.\" The club is 158 years old and plenty of people were reflecting on how coming here is a family tradition. Gareth came with his five-year-old son Elliot, who he'd bought a new kit to wear for the youngster's second ever Sheffield Wednesday game. \"You don't really choose your football club, your dad tells you who you support, and his grandad tells him who to support. \"It's been in the family for years, so hopefully the club can move forward now,\" he said. Read more:Sheffield Wednesday deducted 12 pointsWhat will happen to Sheffield Wednesday? There is newfound optimism about the future, but things from here won't be straightforward, with Saturday's 2-1 defeat leaving them even further adrift at the bottom of the Championship following a 12-point point deduction. As they look for both a buyer and better results, plenty of Sheffield Wednesday fans will be living by the last thing Gareth tells me: \"I think we're fully aware that we have to take a step backwards before we can take a step forward.\""
    },
    {
        "title": "June Lockhart: Lassie and Lost In Space actress dies aged 100",
        "description": "June Lockhart, who starred in television shows such as Lassie and Lost In Space, has died at the age of 100.",
        "url": "https://news.sky.com/story/june-lockhart-lassie-and-lost-in-space-actress-dies-aged-100-13457717",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-june-lockhart-lassie_7062116.jpg?20251025212939",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-25 20:13:00",
        "Headline": "Between 1958 and 1964, she played the role of Ruth Martin, who raised the orphaned Timmy in Lassie. And from 1965 to 1968, Lockhart was Maureen Robinson, a mother who was part of a marooned family in Lost In Space.",
        "Content": "June Lockhart, who starred in television shows such as Lassie and Lost In Space, has died at the age of 100. The US actress died of natural causes at her home in Santa Monica, California, on Thursday, according to family spokesman Lyle Gregory. He said: \"She was very happy up until the very end, reading the New York Times and LA Times every day. \"It was very important to her to stay focused on the news of the day.\" For more than 200 episodes between 1958 and 1964, she played the role of Ruth Martin, who raised the orphaned Timmy (Jon Provost) in Lassie - a show about the adventures of a brave and intelligent Rough Collie dog. And from 1965 to 1968 spanning over 80 episodes, Lockhart was Maureen Robinson, a mother who was part of a marooned family that travelled on the spaceship Jupiter II in Lost In Space. She was nominated for two Emmys, including best actress in a leading role in a dramatic series for her performance in Lassie in 1959. \n                  British Airways pulls Louis Theroux podcast funding over Bob Vylan interview\n                 \n                  Rapper Ghetts charged after man killed in hit-and-run\n                 \n                  Kim Kardashian diagnosed with brain aneurysm\n                 She also received two stars on the Hollywood Walk of Fame, one for motion picture and one for television. Born in New York City in 1925, she was the daughter of actor Gene Lockhart and actress Kathleen Lockhart. Feature film debut She made her feature film debut aged 13, starring alongside both of her parents in the 1938 production A Christmas Carol, where she played Belinda Cratchit, the daughter of Bob Cratchit. After her breakout role, she appeared in films such as All This, and Heaven Too, Meet Me in St. Louis, The Yearling, and Sergeant York. She was also in Son Of Lassie, the 1945 sequel to Lassie, Come Home, playing the grown-up version of the role created by Elizabeth Taylor. Over almost eight decades on screen, Lockhart appeared in dozens of TV series and movies, including when she was well in her 80s. Other roles She had recurring roles on Petticoat Junction, General Hospital, and Beverly Hills 90210, and guest appearances on shows including The Beverly Hillbillies, The Colbys, Knots Landing and Happy Days, as well as Full House, Roseanne and Grey's Anatomy. Of her time on Lassie, Lockhart spoke frankly about her canine co-star. She said: \"I worked with four Lassies. There was only one main Lassie at a time. Then there was a dog that did the running, a dog that did the fighting, and a dog that was a stand-in, because only humans can work 14 hours a day without needing a nap. \"Lassie was not especially friendly with anybody. Lassie was wholly concentrated on the trainers.\" Even though she sometimes mocked the show, she conceded: \"How wonderful that in a career there is one role for which you are known. Many actors work all their lives and never have one part that is really theirs.\" Read more from Sky News:BA pulls Louis Theroux podcast funding over Bob Vylan interviewCCTV images show last sightings of wanted asylum seeker In Lost In Space, Lockhart was part of a family that left Earth on a five-year flight to a faraway planet. After their mission was sabotaged by fellow passenger Dr Zachary Smith, the group went from planet to planet, encountering strange creatures and near-disasters where viewers needed to watch the following week to learn of the escape. Speaking fondly about working on Lost in Space, Lockhart said: \"It was like going to work at Disneyland every day.\" She was married and divorced twice: to John Maloney, a physician, father of her daughters Anne Kathleen and June Elizabeth; and architect John C Lindsay."
    },
    {
        "title": "Hadush Kebatu: CCTV images show last sightings of wanted asylum seeker after he was released from prison in error",
        "description": "CCTV images have been released of a jailed asylum seeker who was accidentally freed from prison - as police detailed the last sighting of him.",
        "url": "https://news.sky.com/story/hadush-kebatu-cctv-images-show-last-sightings-of-wanted-asylum-seeker-after-he-was-released-from-prison-in-error-13457502",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hadush-kebatu-chelmsford_7062196.jpg?20251025231638",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-25 16:29:00",
        "Headline": "The images show him in Chelmsford on Friday and later in Dalston, east London, where he was carrying a \"distinctive white bag with pictures of avocados on it\", said the Metropolitan Police. ",
        "Content": " CCTV images have been released of a jailed asylum seeker who was accidentally freed from prison - as police detailed the last sighting of him. Hadush Kebatu was released in error from HMP Chelmsford on Friday instead of being handed over to immigration officials for deportation - one month into a 12-month sentence. As the manhunt continues, the images show him in the Essex town on Friday and later the same day in Dalston, east London, where he was carrying a \"distinctive white bag with pictures of avocados on it\", said the Metropolitan Police. The last sighting of the Ethiopian national was in Dalston CLR James Library in Dalston Square on Friday evening.  Kebatu had been found guilty in September of sexually assaulting a 14-year-old girl and a woman in Epping. His crimes while staying at The Bell Hotel in Epping sparked weeks of protests over the summer. \n                  Timeline of how manhunt for wrongly-released sex offender migrant Hadush Kebatu has unfolded\n                 \n                  Wrongly-released migrant 'tried to return to prison 4 or 5 times', witness says\n                 \n                  Father of teenage girl sexually assaulted by migrant sex offender reacts to his accidental release\n                  The Met Police, which has been leading the search for Kebatu, alongside Essex Police and the British Transport Police, has made a direct appeal to the fugitive to hand himself in. He left Chelmsford train station at 12.42pm on Friday and arrived at Stratford station in east London soon after at 1.12pm. Kebatu had since taken \"a number of journeys\" across London and had \"access to funds\", according to Met Commander James Conway. Last sighting The force said he was last seen shortly before 8pm on Friday evening in the Dalston area of Hackney in east London. It has released two CCTV images of him from Friday, one in Chelmsford where he was wearing his prison-issued, grey tracksuit and holding a clear, plastic bag containing his possessions. The other was taken in Dalston, where he was still wearing his grey tracksuit, but was carrying his belongings \"in a distinctive white bag with pictures of avocados on it\". A Met statement added: \"Additional officers have been deployed to the area to carry out further searches, but we are appealing for the help of local residents to report any sightings as soon as possible.\" Mr Conway has asked for members of the public who have given assistance to Kebatu to contact them or anyone who sees him to call 999. And in a direct appeal to Kebatu, Mr Conway added: \"We want to locate you in a safe and controlled way. \"You had already indicated a desire to return to Ethiopia when speaking to immigration staff, the best outcome for you is to make contact directly with us by either calling 999 or reporting yourself to a police station.\"  Meanwhile, a lorry driver, who was delivering equipment to Chelmsford jail on Friday, told Sky News correspondent Tom Parmenter he saw the \"confused\" offender outside the facility being directed by prison staff to the town's railway station following his release. The witness, called Sim, said Kebatu came out of the jail saying, \"Where am I going? What am I doing?\" and hanging around for about 90 minutes as he tried to find out where he should be going. Sim said the offender returned to the prison \"four or five times\" but was turned away. He said Kebatu knew he should be deported but the prison staff were \"basically sending him away\" and saying to him, \"Go, you've been released, you go\". Kebatu was spotted later in Chelmsford town centre asking for assistance before getting on a train to London. HM Prison and Probation Service is introducing new and mandatory procedures for prisoner releases after Kebatu was mistakenly freed, Ministry of Justice sources say. Duty governors, who are responsible for the daily secure operation of prisons, will now be required to complete additional checks the evening before a release, it is understood. Governors will need to provide assurance that the procedure is in place on Monday, Sky News understands. Justice Secretary David Lammy said on Friday night that Kebatu was \"at large in London\". He said he was \"livid on behalf of the public\" and added that he had launched an investigation. Sir Keir Starmer said he was \"appalled\" at the accidental release and said it was \"totally unacceptable\", adding: \"This man must be caught and deported for his crimes.\" A prison officer has been taken off duties to discharge prisoners while an investigation takes place."
    },
    {
        "title": "Wrongly-released migrant 'tried to return to prison 4 or 5 times', witness says",
        "description": "A delivery driver who spoke to wanted migrant Hadush Kebatu at Chelmsford prison has told Sky News the \"confused\" offender was guided to the railway station by prison staff.",
        "url": "https://news.sky.com/story/witness-wanted-migrant-was-confused-and-directed-to-station-by-prison-staff-13457133",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-hadush-kebatu-epping_7029360.jpg?20251025080729",
        "type": "UK",
        "Author": "Tom Parmenter",
        "Date Published": "2025-10-25 12:42:00",
        "Headline": "The driver says Kebatu returned to the prison 'four or five times' and was eventually sent away in a 'stressed' and 'upset' state.",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  A delivery driver who spoke to wanted migrant Hadush Kebatu at Chelmsford prison has told Sky News the \"confused\" offender was guided to the railway station by prison staff. The mistake triggered a manhunt that now involves three police forces looking for the Ethiopian in London. Live updates on the manhunt The driver, called Sim, was delivering equipment to the prison on Friday when Kebatu was released in error instead of being handed over to immigration officials for deportation. The lorry driver explained to Sky News that Kebatu approached him and seemed to have no idea of where he was supposed to go.  \"He came out of the airlock, and kept saying to the officers there, 'Where am I going? What am I doing? I don't know where I'm going and what I'm doing.' \"He was holding a pack of paperwork in his arms, and his bag of bits… \"He knew he'd been deported. He came over to me and said, 'I need you to help me.' \"His English was pretty good.\" Sim, who still has the vehicle pass from the prison, said that after a while a member of prison staff directed the offender to Chelmsford station to catch a train to London, and \"told him that he had to get on a train\". He says Kebatu must have been outside the prison for roughly \"an hour and a half\" before finally leaving, adding, \"They [the officers] were basically sending him away, saying, 'Go, you've been released, you go.' Sim describes Kebatu as being \"very confused,\" saying, \"He kept scratching his head and saying, 'Where do I go, where do I go?' \"The fourth or fifth time [he went into the reception] he was starting to get upset, he was getting stressed. I'm not sticking up for the guy, but in my eyes, he was trying to do the right thing. He knew he was getting deported, but he didn't know where he was going or how he should get there.\" He added that the officers had no interest in helping him, saying, 'You're released, you're released'.  Read more: How many prisoners are released by mistake? Sim describes witnessing a \"a big, massive manhunt\" when he left the prison after making his delivery, with a police helicopter in the sky and lots of sirens and officers everywhere. He says it wasn't until he got home that he realised the drama was around the man he had been speaking to. Describing his feelings about the debacle, Sim said: \"It's scary how this has all unfolded, and how easily he's been able to get out and then be around the public. \"He's obviously not a secure man. He shouldn't have been released and the fact there's so many officers there - how come no one's clocked it sooner?\"  He went on: \"Someone here has messed up… I know someone has been taken off duty… But to me, there's got to be more people that allowed this to happen, not just one person... \"It's not the first time it's happened, and I very much doubt it will be the last\" When approached for comment, the Ministry of Justice referred Sky News to comments by David Lammy on Friday night, where he said: \"I'm appalled, I'm livid on behalf of the public that Kebatu is at large. \"He should be deported back to Ethiopia after the sexual assaults that he's committed.\""
    },
    {
        "title": "Timeline of how manhunt for wrongly-released sex offender migrant Hadush Kebatu has unfolded",
        "description": "The manhunt for Hadush Kebatu, an asylum seeker and convicted sex offender who was wrongly freed from prison, continues.",
        "url": "https://news.sky.com/story/timeline-of-how-manhunt-for-wrongly-released-sex-offender-migrant-hadush-kebatu-has-unfolded-13457575",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kebatu-manhunt_7061973.jpg?20251025234319",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-25 17:19:00",
        "Headline": "The Ethiopian national was due to be released in order to be immediately deported, but instead he was able to board a train to London - triggering a manhunt involving three police forces.",
        "Content": " The manhunt for Hadush Kebatu, an asylum seeker and convicted sex offender who was wrongly freed from prison, continues. The Ethiopian national had been serving a 12-month sentence at HMP Chelmsford since September. He was due to be released in order to be immediately deported, but instead he was able to board a train to London. The mistake triggered a manhunt that now involves three police forces looking for the prisoner. His current whereabouts are unknown. Here, Sky News examines how the event has unfolded: Kebatu is released from HMP Chelmsford wearing a prison-issued grey tracksuit. He is also holding a clear plastic bag containing his possessions. The prison released him on the expectation that he would be picked up by immigration enforcement, and the Home Office was ready to take Kebatu to an immigration removal centre, it is understood. But it is unclear exactly what happened next. A lorry driver, who was delivering equipment to Chelmsford jail on Friday, told Sky News correspondent Tom Parmenter he saw the \"confused\" offender outside the facility being directed by prison staff to the town's railway station following his release. The offender is said to have returned to the prison \"four or five times\" but was turned away. Footage later appears to show Kebatu in Chelmsford High Street. In the video he appears to ask a group of people for help. 12.41pm: The prisoner boards a Greater Anglia London-bound train at Chelmsford station. 12.51pm: The train arrives at Shenfield station, in the Essex borough of Brentwood. 12.57pm: Essex Police are informed by the prison service that Kebatu was mistakenly released. The force says it has launched a search operation and is working closely with partner agencies. By the time the search started, the train that Kebatu boarded at Chelmsford had already called at Shenfield, according to Trainline data. Essex Police appeals to anyone who has seen the prisoner to contact the force immediately. 1.12pm: Kebatu gets off the train at Stratford in east London. 8pm: The last time Kebatu was seen. The Metropolitan Police say the prisoner was spotted in the Dalston area of Hackney. He was pictured still wearing his prison-issue grey tracksuit top and bottoms, and was carrying his belongings \"in a distinctive white bag with pictures of avocados on it\".  12.37pm: The Metropolitan Police announce it has taken over the manhunt for Kebatu. In a statement, commander James Conway says senior investigating officers are \"examining CCTV\" from around Stratford station and further afield, to establish information about the prisoner's subsequent movements.  2.00pm: A delivery driver who spoke to Kebatu outside Chelmsford prison tells Sky News the \"confused\" offender was guided to the railway station by prison staff. He says Kebatu approached him with no idea of where he was supposed to go. He adds the prisoner must have been outside the prison for roughly \"an hour and a half\", before he finally left, adding: \"They [the officers] were basically sending him away, saying, 'Go, you've been released, you go'.\"  4.30pm: Met Police Commander James Conway makes a direct appeal to Kebatu. \"We want to locate you in a safe and controlled way. You had already indicated a desire to return to Ethiopia when speaking to immigration staff,\" he says. \"The best outcome for you is to make contact directly with us by either calling 999 or reporting yourself to a police station.\" He says he believes Kebatu has access to funds and that he's sought assistance from members of the public and station staff in both Chelmsford and London. Read more:How many prisoners are released by mistake? What happened in the lead up to the wrongful release? Kebatu was found guilty of five offences after a three-day trial at Chelmsford and Colchester magistrates' courts in September. His case led to protesters and counter-protesters taking to the streets in Epping, Essex, and eventually outside hotels housing asylum seekers across the country. The incidents occurred in July, eight days after he arrived in the UK by small boat. Use the arrows below to click through a timeline of how the case has unfolded. "
    },
    {
        "title": "Lucy Powell named Labour's new deputy leader",
        "description": "Former Commons leader Lucy Powell has been crowned Labour's new deputy leader in a closely fought race against Education Secretary Bridget Phillipson. ",
        "url": "https://news.sky.com/story/lucy-powell-named-labours-new-deputy-leader-13457044",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lucy-powell-labour_7061573.jpg?20251025160141",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-25 08:19:00",
        "Headline": "The former Commons leader beat the education secretary in a two-horse race that was widely seen as a referendum on Sir Keir Starmer's leadership. ",
        "Content": " Former Commons leader Lucy Powell has been crowned Labour's new deputy leader in a closely fought race against Education Secretary Bridget Phillipson.  Ms Powell received 87,407 votes to Ms Phillipson's 73,536 - a majority of 13,871 - in a contest that was widely perceived as a referendum on Sir Keir Starmer's popularity with the membership. Ms Powell was seen as the \"anti-Starmer\" candidate given she was sacked from cabinet just last month, and centred her campaign on being an independent voice for the backbenches. Politics live: Follow for updates as Labour names new deputy leader  Ms Phillipson was seen as Number 10's preferred option, and she had pitched herself as the \"unity candidate\", warning that voting for her opponent would result in \"internal debate and divisions that leads us back to opposition\". However speaking to Sky News's political editor Beth Rigby following the result, Ms Powell insisted she would be a \"friend\" to the prime minister, adding: \"I am confident we can work well together.\" \n                  Labour's Lucy Powell will take a 'submarine approach' as deputy PM - for now\n                 \n                  Twenty warnings for Sir Keir Starmer from new deputy leader Lucy Powell\n                 \n                  Who is Labour's new deputy leader Lucy Powell and what does she stand for?\n                 She said she was not here to \"write an alternative policy platform\" but rather \"to make sure Labour values and beliefs are right at the heart of the conversation, and that we're giving a really clear sense of who we're for\". Ms Powell's earlier victory speech made clear where she thought Labour was going wrong, and what she would challenge the government on. The Manchester Central MP said Labour \"won't win by trying to out-Reform Reform, but by building a broad progressive consensus\". She said that started with \"wrestling back the political megaphone\" from Reform leader Nigel Farage, and \"setting the agenda more strongly\". \"Let's be honest, we've let Farage and his ilk run away with it. He wants to blame immigration for all the country's problems. We reject that,\" she said. \"Our diagnosis is different, that for too long the country and the economy has worked in the interests of the few, not the many.\" The reference to \"for the many not the few\" - the slogan during Jeremy Corbyn's time at the helm, was not lost on his then shadow chancellor John McDonnell. The veteran left-winger said on X: \"The Labour Party members have spoken & the message is clear, they want change. It's good to see a return to references to the Labour Party serving once more the many not the few & that Labour must not try out Reform, Reform. Our members realise a new start is desperately needed.\" 'Unwanted deputy imposed on PM' The deputy leadership role is important as it's the key connection between the Labour members and the upper echelons of the Labour Party. The race was triggered by the sudden departure of Angela Rayner, after she admitted to underpaying stamp duty. The scandal sparked a reshuffle in which Ms Powell was one of the only casualties. It makes the new partnership potentially very awkward for Sir Keir, especially as his new deputy will be free to speak out against his policies from the back benches rather than being bound by collective responsibility like Ms Phillipson. However in a possible olive branch, Sky News understands Ms Powell will be asked to attend political cabinet meetings, even though she will not officially be a member of cabinet. Tory chairman Kevin Hollinrake said \"weak Keir Starmer\" has had an unwanted deputy leader \"imposed on him by the Labour Party\", adding: \"The failure of the Keir Starmer candidate, Bridget Philipson, is another defeat of the prime minister's authority.\" Turnout for the vote was low - just 16.6%, suggesting a lack of enthusiasm among party members and its affiliates. Sir Keir congratulated Ms Powell after the results were announced, saying she \"has always been a proud defender of Labour values, and that is exactly what we need at this moment\".  He echoed some of her language around immigration, as he attacked the Tories for this week suggesting they supported a policy to deport people who have settled in the UK legally, something Reform UK has advocated. \"That is what we're up against on the right of politics, a politics of division and grievance that wants to take this great country to a very dark place\", Sir Keir said. PM warns of 'battle for the soul of our nation' The prime minister is under pressure as the party plummets in the polls, with many MPs on the left predicting he could be gone by May if the local elections go badly. Sir Keir acknowledged Labour is having a difficult time after it lost the Caerphilly by-election to Plaid Cymru on Thursday. He said it was a \"bad result\" and \"a reminder that people need to look out their window and see change and renewal in their community, opportunities for their children, public services rebuilt, the cost of living crisis tackled\".  \"We must unite. We must keep our focus on what is, in my view, the defining battle for the soul of our nation. I know that Lucy will do just that,\" he said. Saturday's result is the culmination of a six week contest, with the pair having had to secure nominations from 80 MPs in the first round and then win the backing of 5% of local parties or Labour affiliated groups before making it to the final vote. Initially six candidates entered, but it quickly became a two-horse race as only Ms Powell and Ms Phillipson reached the 80 threshold, following claims from the left of a \"stitch up\". Ms Phillipson said she was \"disappointed to lose\" but Ms Powell \"has my full support\". She added: \"What we all need to do now is unite this party, beat Reform and secure that second term Labour government.\""
    },
    {
        "title": "Labour's Lucy Powell will take a 'submarine approach' as deputy PM - for now",
        "description": "Lucy Powell's had quite the political comeback. Sacked from cabinet by the prime minister but weeks ago, she's back with her own powerbase and voice at the top of the party as the deputy Labour leader.",
        "url": "https://news.sky.com/story/labours-lucy-powell-will-take-a-submarine-approach-as-deputy-pm-for-now-13457291",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lucy-powell-keir-starmer_7061752.jpg?20251025172507",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-10-25 14:40:00",
        "Headline": "Lucy Powell says Labour need to pull together to see off Reform, but will she become more critical as we approach the next general election?",
        "Content": "\n          Political editor\n              @BethRigby\n  Lucy Powell's had quite the political comeback. Sacked from cabinet by the prime minister but weeks ago, she's back with her own powerbase and voice at the top of the party as the deputy Labour leader. She was not Keir Starmer's choice and, while the prime minister was quick to embrace her on Saturday as the result was announced, he is probably right to feel some unease about the outcome for a few different reasons. For in Powell, the party has a new, alternative figurehead that sits outside of the government machine. Politics live: Follow updates as Labour names new deputy leader  She ran a campaign in which she pledged to be the voice of the membership to the leadership and the membership picked her. She will have serious influence on the National Executive Committee, and sit in the political cabinet. What she won't do is return to the cabinet table, which means that she has power and profile, but will remain an independent voice, free from collective cabinet responsibility. \n                  Two Ukrainian nationals deny arson attacks on properties and car linked to Starmer\n                 \n                  Is the government too close to China?  \n                 \n                  PM faces 'more unanswered questions' after evidence in China spying case released\n                 As I understand it, Powell doesn't want to destabilise the leadership - for now at least. She will take a submarine approach when it comes to interventions around government policy rather than offering a running commentary on Starmer's government and choose her battles. That way, when she does weigh in, she is harder to ignore. She could also over time become a lightning rod for discontent should the party's fortunes remain as parlous as they are now.  On Friday, Labour suffered a cataclysmic defeat in the Caerphilly by-election, coming third in a seat it has held for over a century as Labour endured their biggest ever drop in support in a Welsh by-election. It's a terrible omen for next May's Sennedd election. Labour have been the governing party in Wales since the Senedd's beginning in 1999. That could be about to change. When I asked Keir Starmer about the loss on Friday, he didn't try to deflect, saying: \"I'm deeply disappointed by the results.\" When I asked him if it was a gut punch, he said: \"I'm not going to suggest otherwise. I spoke to the first minister on Saturday morning, and clearly we need to reflect and regroup, and double down on the delivery, in Wales. And we clearly need to do much more.\"  Powell's position now is that the party needs to pull together, get campaigning and try to build support with their voters. But she is equally clear that this has to be down to delivery of the \"national renewal\" Labour promised voters in the election of 2024. There will surely come a point, further down the road, where this new deputy leader will become more robust in her critique of the government if it fails to deliver and the party suffers. This race has also exposed the ugliness in a party that is uneasy with its leadership and seems intent on infighting. The constant briefing wars that emanate from Number 10 cascade down in what has been, at times, a dirty fight. Lucy Powell accused Bridget Phillipson's team of \"throwing mud\" and briefing against her in the Labour deputy leadership race on our Electoral Dysfunction podcast, while Phillipson also said she was at the sharp end of vicious smears.  👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 For all the talk on Saturday for coming together and unity, it is hard to see that materialising while doubts persist over Starmer's leadership and while rivals, such as Powell's close ally Andy Burnham, are waiting in the wings. There is also the big question of apathy. Only 16.6% of party members, trade union members and affiliates chose to vote in this election, against 59% in 2020. This is partly distorted because in the last leadership election, members were voting for both the leader and deputy leaders. But what it also suggests is disengagement from the wider Labour movement. In 2020, there were 552,000 party members eligible to vote, out of a total membership which stood at 782,000, including union-affiliated members who are perhaps less likely to cast a vote. This time around there were 970,000 eligible voters - but the Labour Party did not reveal how many actual party members cast a vote. This might be because membership figures are dropping, and it didn't want to reveal that information. At the end of last year, party membership stood at 332,000, which is around 200,000 members less than the end of 2019. For now, Powell insists that she and Starmer will work as a team and the message from both Powell and the PM following her victory is that all of those party must put its shoulder to the wheel to try and see off the threat of Reform. She is undoubtedly starting out as the party's campaigner in chief, but I suspect she may become a far more critical - and dangerous - voice, if Starmer looks like he can't get the party in good enough shape to win the next general election."
    },
    {
        "title": "British Airways pulls Louis Theroux podcast funding over Bob Vylan interview",
        "description": "British Airways (BA) has paused its sponsorship of The Louis Theroux Podcast following an interview with Bob Vylan's frontman.",
        "url": "https://news.sky.com/story/british-airways-pulls-louis-theroux-podcast-funding-over-bob-vylan-interview-13457331",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-louis-theroux-bob-vylan_7061640.jpg?20251025163303",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-25 15:17:00",
        "Headline": "The frontman of the controversial punk duo Bob Vylan was quizzed by Theroux after his IDF chant at Glastonbury caused uproar.",
        "Content": "British Airways (BA) has paused its sponsorship of The Louis Theroux Podcast following an interview with Bob Vylan's frontman. Pascal Robinson-Foster, one half of the controversial punk duo, told Theroux in an episode which aired earlier this week that he was \"not regretful\" of chanting \"death, death to the IDF [Israel Defence Forces]\" at this year's Glastonbury. He added that he would \"do it again tomorrow, twice on Sundays\". British Airways said on Saturday that the content \"breaches\" its sponsorship policy and has since paused its advertising on the podcast, the Jewish News first reported. An airline spokesperson said: \"Our sponsorship of the series has now been paused and the advert has been removed. \"We're grateful that this was brought to our attention, as the content clearly breaches our sponsorship policy in relation to politically sensitive or controversial subject matters. \"We and our third-party media agency have processes in place to ensure these issues don't occur and we're investigating how this happened.\" \n                  Bob Vylan on 'death, death to the IDF' chant: 'I'd do it again tomorrow, twice on Sundays'\n                 \n                  'I felt like a trespasser and imposter': Louis Theroux to be awarded prestigious NFTS fellowship\n                 \n                  Barry Keoghan hits back at 'disgusting' online attacks calling him an 'absent father'\n                 Following Bob Vylan's Glastonbury performance, the band were dropped by a number of festivals and performances including Radar festival, a show at a German music venue and their US tour after their visas were revoked. The comments were condemned by the US as a \"hateful tirade\" and \"appalling hate speech\" by British Prime Minister Sir Keir Starmer. The BBC's Executive Complaints Unit has since found the broadcast of Bob Vylan's set breached editorial standards related to harm and offence. The band have also had to reschedule dates of its upcoming We Won't Go Quietly UK tour in Manchester and Leeds after Jewish leaders and politicians called for the show to be postponed. In a statement on Facebook, the group said: \"Due to political pressure from the likes of Bridget Phillipson and groups in the Northwest of England we have had to reschedule our Leeds and Manchester shows. \"All tickets remain valid and all other shows are continuing as planned.\"  When asked by Theroux, Vylan said he was taken aback by the uproar the chant has caused, saying: \"It wasn't like we came off stage, and everybody was like [gasps]. It's just normal.\" He added that he wanted an end to \"the oppression that Palestinian people are facing\". Read more: Who are Bob Vylan? Despite the criticism, the group have seen support from fans, with their album Humble As The Sun re-entering the charts and climbing to number one in the UK Hip Hop and R&B album category. A spokesperson at Mindhouse Productions - which was founded by Theroux and produces The Louis Theroux Podcast - has not commented on the BA sponsorship, but told Sky News: \"Louis is a journalist with a long history of speaking to controversial figures who may divide opinion. \"We would suggest people watch or listen to the interview in its entirety to get the full context of the conversation.\""
    },
    {
        "title": "Sheffield Wednesday fans 'elated' after club administration - but the road ahead won't be straightforward",
        "description": "When a football club is placed into administration, it's usually a devastating moment for their fan base.",
        "url": "https://news.sky.com/story/sheffield-wednesday-fans-elated-after-club-administration-but-the-road-ahead-wont-be-straightforward-13457500",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sheffield-wednesday_7061832.jpg?20251025175848",
        "type": "UK",
        "Author": "Shingi Mararike",
        "Date Published": "2025-10-25 17:50:00",
        "Headline": "Sky's Shingi Mararike speaks to Sheffield Wednesday fans about their reaction to the club entering administration.",
        "Content": "\n          North of England correspondent\n              @ShingiMararike\n When a football club is placed into administration, it's usually a devastating moment for their fan base. But as home fans began to stream through the turnstiles at Hillsborough for Sheffield Wednesday's match against Oxford United, the mood was one of relief and even a little bit of delight. That's because for the last few seasons, The Owls, one of world football's oldest teams, have been in disarray. Unhappiness under the 10-year ownership of Thai businessman Dejphon Chansiri had led to fans boycotting games.   The club had a raft of unpaid debts, with rumours of an imminent winding-up petition being issued by HMRC. James Silverwood, the vice chair of the Sheffield Wednesday Supporters Trust, summed up the mood a couple of hours before kick off. \"We're probably an unusual fan base in that we're actually quite elated and optimistic about going into administration,\" he said. \"It means that the previous owner has gone, an owner who was mismanaging the club, who had no respect for the community and the fan base. So this is really a fresh start.\" That fan base, who had largely stayed away this season, were out in full-force. The club shop was full of people of all ages, buying scarves, shirts and hats, while other fans stood by the gates, bursting into applause when the players arrived. One woman sitting outside the shop wearing a club scarf summed up the highs and lows of the past few years. \"I've been a season ticket holder for a long time,\" she said. \"Coming into Hillsborough, sometimes it can be the best place on Earth, but sometimes it can be toxic as well. Just to move forward now is the best thing for us.\" The club is 158 years old and plenty of people were reflecting on how coming here is a family tradition. Gareth came with his five-year-old son Elliot, who he'd bought a new kit to wear for the youngster's second ever Sheffield Wednesday game. \"You don't really choose your football club, your dad tells you who you support, and his grandad tells him who to support. \"It's been in the family for years, so hopefully the club can move forward now,\" he said. Read more:Sheffield Wednesday deducted 12 pointsWhat will happen to Sheffield Wednesday? There is newfound optimism about the future, but things from here won't be straightforward, with Saturday's 2-1 defeat leaving them even further adrift at the bottom of the Championship following a 12-point point deduction. As they look for both a buyer and better results, plenty of Sheffield Wednesday fans will be living by the last thing Gareth tells me: \"I think we're fully aware that we have to take a step backwards before we can take a step forward.\""
    },
    {
        "title": "Administrators lined up for North Sea oilfield services group Petrofac",
        "description": "Administrators are on standby this weekend to handle the collapse of Petrofac, the oil and energy services group - an insolvency which could threaten the future of more than 2,000 jobs in Scotland.",
        "url": "https://news.sky.com/story/administrators-lined-up-for-north-sea-oilfield-services-group-petrofac-13457010",
        "image_url": "https://e3.365dm.com/20/05/1920x1080/skynews-petrofac-offshore_4990539.jpg?20200514172935",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-25 06:56:00",
        "Headline": "Petrofac’s board has lined up Teneo to act as administrator, a move which could be triggered as early as Monday morning and imperil more than 2,000 jobs in Scotland, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Administrators are on standby this weekend to handle the collapse of Petrofac, the oil and energy services group - an insolvency which could threaten the future of more than 2,000 jobs in Scotland. Sky News has learnt that directors of Petrofac have lined up Teneo for an administration process which could be confirmed as early as Monday morning. The company's board, chaired by former Anglo American finance director Rene Medori, is said to be holding emergency talks this weekend. One industry executive said a decision to file for administration was likely to be taken before the stock market opens on Monday. Ed Miliband, the energy secretary, and other ministers have been briefed on the situation, with more than 2,000 Scottish-based jobs potentially at risk. Kroll, the advisory firm, has been engaged by the Department for Energy Security and Net Zero to work with ministers and officials on the unfolding crisis. Government sources claimed this weekend that Petrofac's UK operations were \"growing\". \n                  Cutting cash ISA allowance could backfire - and make mortgages more expensive, MPs warn \n                 \n                  Money blog: Complete guide to buying a house - from gazumping to wardrobe rule \n                 \n                  Sheffield Wednesday deducted 12 points after entering administration\n                 \"This government is supporting jobs and investment in Scotland including building a world leading carbon capture industry in the North Sea, alongside our biggest ever investment in offshore wind,\" one official said. A source close to Petrofac said on Saturday that the UK arm of the group had not been beset by any lossmaking contracts and would be in a strong position to secure its future. The administration process would affect the parent company, Petrofac Limited, which does not directly employ the company's workforce, they added. Petrofac's potential collapse comes at a sensitive time for Mr Miliband, who is coming under enormous pressure to permit more North Sea oil and gas drilling despite Labour's manifesto commitment not to grant licences on new fields. Petrofac employs about 7,300 people globally, according to a recent stock exchange filing. It designs, constructs and operates offshore equipment for energy companies. The company's shares have been suspended since April. Petrofac, which now has a market capitalisation of barely £20m, has been mired in financial trouble for years. Once-valued at more than £6bn, it has been drowning in a sea of debt, and faced a Serious Fraud Office investigation which resulted in a 2021 conviction for failing to prevent bribery, and the payment of more than $100m in penalties. In a stock exchange announcement on Thursday, Petrofac said the cancellation of a contract by TenneT, an operator of electricity grids in Europe which is its biggest customer, meant that a solvent restructuring was now not viable. \"Having carefully assessed the impact of TenneT's decision, the Board has determined that the restructuring, which had last week reached an advanced stage, is no longer deliverable in its current form,\" the company said. \"The group is in close and constant dialogue with its key creditors and other stakeholders as it actively pursues alternative options for the group. \"In the meantime, Petrofac remains focused on serving its clients and maintaining operational capability and delivery of services across its businesses.\" Founded in 1981 in Texas, Petrofac has been in talks about a far-reaching financial restructuring for more than a year. A formal restructuring plan was sanctioned by the High Court in May 2025 with the aim of writing off much of its debt and injecting new equity into the business. This was subsequently overturned, prompting talks with creditors about a revised agreement. If Petrofac does fall into administration, it is expected to be broken up, with some of its assets - including key contracts - likely to be taken over by other industry players. Petrofac has been contacted for comment. A DESNZ spokesman declined to comment."
    },
    {
        "title": "Who is Labour's new deputy leader Lucy Powell and what does she stand for?",
        "description": "Lucy Powell has been elected as the deputy leader of the Labour Party.",
        "url": "https://news.sky.com/story/who-is-labours-new-deputy-leader-lucy-powell-and-what-does-she-stand-for-13457202",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-powell-commons-labour_6909845.jpg?20251025180030",
        "type": "UK",
        "Author": "Mhari Aurora",
        "Date Published": "2025-10-25 13:45:00",
        "Headline": "Powell insists she wants to help Keir Starmer, providing constructive criticism and a voice for Labour members. But will he see it that way?",
        "Content": "\n          Political correspondent\n              @MhariAurora\n  Lucy Powell has been elected as the deputy leader of the Labour Party. But who is she and what does she stand for? Powell began her career in politics working for Labour MPs Glenda Jackson and Beverley Hughes. She then worked for a pro-EU campaign group.  After that, she ran Ed Miliband's successful Labour leadership campaign and was his deputy chief of staff until she was elected as the MP for Manchester Central in 2012. She has been at the forefront of Labour politics for over a decade, serving under Ed Miliband, Jeremy Corbyn and Keir Starmer. After Labour won the last general election, she was appointed as the leader of the House of Commons in Starmer's cabinet. But last month she was sacked in the cabinet reshuffle and came to be seen as the anti-Starmer candidate. During the deputy leadership campaign, Powell promised to \"provide a stronger, more independent voice\" for members of the Labour Party. And in her acceptance speech, she said the government hadn't been bold enough, and that it needed to step up. So how much of a problem is she going to be for Keir Starmer? Her new role - and being outside the cabinet - means she will be free to criticise the government, which could make life more difficult for the prime minister. Read More:Lucy Powell named Labour's new deputy leaderPowell will take a 'submarine approach' - for now Powell has been outspoken about her desire for the government to lift the two child benefit cap - and also called for the country to work for the many and not the few - a Corbyn-era slogan - and that Labour must stop handing the megaphone over to Reform and letting them run away with it. Starmer will be conscious that an MP he sacked not long ago is now in a powerful role able to speak freely and attack his decisions. But Powell is not free from her own controversies. In May, Lucy Powell called grooming gangs a dog whistle issue - something she later had to clarify after it caused outrage among campaigners and opposition parties. She also vocally defended Labour's unpopular cut to winter fuel allowance while in cabinet, before the government then U-turned on the policy - she then criticised the proposed welfare cuts after she was sacked from government. Powell insists she wants to help Keir Starmer, providing constructive criticism and a voice for Labour members. But will Keir Starmer see it that way?"
    },
    {
        "title": "Twenty warnings for Sir Keir Starmer from new deputy leader Lucy Powell",
        "description": "Labour's new deputy leader Lucy Powell promised to be Sir Keir Starmer's ally.",
        "url": "https://news.sky.com/story/twenty-warnings-for-sir-keir-starmer-from-new-deputy-leader-lucy-powell-13457232",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lucy-powell-labour_7037947.jpg?20251001094236",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-10-25 13:53:00",
        "Headline": "Sky's Jon Craig breaks down what Labour's Lucy Powell said - and what she meant - as she was crowned the party's new deputy leader after a closely fought race against Education Secretary Bridget Phillipson.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Labour's new deputy leader Lucy Powell promised to be Sir Keir Starmer's ally. Yet in her victory speech she criticised his government and its record no fewer than 20 times. And told him to raise his game, or else. Politics live: Follow for updates as Labour names new deputy leader Here's what she said - and what she meant: Read more from Sky News:The one thing Farage and Polanski have in commonChina 'enemy' reference removed from witness statement She said it all with a smile, but there was menace there. As deputy leader, Lucy Powell was always going to be a critical friend. So there you go, prime minister. Here's 20 things you need to do for her to be more friend than critic."
    },
    {
        "title": "Trump's Venezuela drug bust shows he's either misinformed or has another motive",
        "description": "The world's largest aircraft carrier is steaming towards the Caribbean supported by the rest of its \"carrier group\" to add even more muscle to the US forces already threateningly close to Venezuela.",
        "url": "https://news.sky.com/story/trumps-venezuela-drug-bust-shows-hes-either-misinformed-or-has-another-motive-13457711",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-venezuela-trump-us_7052301.jpg?20251016112919",
        "type": "World",
        "Author": "Stuart Ramsay",
        "Date Published": "2025-10-25 20:07:00",
        "Headline": "Sky's Stuart Ramsay says while the US president acknowledges that the synthetic opioid fentanyl is a huge killer in the US (which it is) and is supplied by drug gangs (which it is), to blame Venezuela for fentanyl production is simply incorrect.",
        "Content": "\n          Chief correspondent\n        The world's largest aircraft carrier is steaming towards the Caribbean supported by the rest of its \"carrier group\" to add even more muscle to the US forces already threateningly close to Venezuela. The question is simple - is this really all about President Trump's war on drugs in South America? I doubt it. A sledgehammer to crack a nut isn't even in it.   There are a few reasons to doubt the American government's stated aim of wiping out these so-called \"narco terrorist\" gangs threatening the US from Venezuela, even after one takes out of the equation the sort of equipment the military is deploying - which isn't what they would need for effective drug smuggling interdiction. While the president acknowledges that the synthetic opioid fentanyl is a huge killer in the US (which it is) and is supplied by drug gangs (which it is), to blame Venezuela for fentanyl production is simply incorrect.  Mexican cartels produce fentanyl with precursors largely supplied from China, and it is from Mexico - America's neighbour - that the fentanyl is smuggled directly into the US across its southern border. Venezuela isn't involved in this fentanyl business in any meaningful way, and I know this because I have reported from the Sinaloa cartel's fentanyl production labs in Mexico. The Mexican cartels are very proud of their business, and from my experience covering this story over the years, when the drugs cartels are proud of something, and it makes them a lot of money - which fentanyl does - they don't share the market with anyone, and certainly not with Venezuela. President Trump is right that Venezuela is now a large supplier of other illegal drugs, especially cocaine, but they come from countries like Colombia, Peru, and Bolivia, which are the largest producers of the coca leaf in the world (the coca leaf is what cocaine is made from). Read more:US accused of 'inventing a war'Survivors reported after boat strikeUS destroys 'drug smuggling submarine' Venezuela, which borders Colombia, is largely a transit country to the Caribbean in the same way that Ecuador, which also borders Colombia, is a transit country to the Pacific. Neither Venezuela nor Ecuador are significant drug producers. The drugs enter Venezuela overland, primarily from Colombia, and then mainly leave the country from ports on the northern coast of the country - and these are the departure points of the boats the US government has recently targeted and destroyed, along with the crews on board.  President Trump claims these boats from Venezuela are heading to the US, but in reality they are mainly heading to the nearby islands of Trinidad and Tobago, and from there they largely go to West Africa and Europe - mostly Spain and Portugal. Drugs heading to America either pass through Mexico over the border into the US or are transported via the Pacific Ocean route through countries like Ecuador. In this instance, Venezuela isn't involved. Read more: Inside Pablo Escobar's home city where drugs are readily available  It's widely accepted the two most exported drugs from South America are cocaine and marijuana - and the volume of production is staggering. But the Centres for Disease Control and Prevention in the US says that synthetic opioids like fentanyl are responsible for most overdose deaths there - and fentanyl is not produced in South America, whatever the president says. So one can only conclude he is either mistaken and misinformed, or he has another motive. I suspect it is the latter, and that regime change in Venezuela is top of the list."
    },
    {
        "title": "Independent candidate Catherine Connolly wins Irish presidential election",
        "description": "Independent candidate Catherine Connolly has won Ireland's presidential election after her rival conceded.",
        "url": "https://news.sky.com/story/catherine-connolly-set-to-become-irelands-next-president-as-rival-concedes-13457154",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-cathering-connolly_7062002.jpg?20251025192649",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-25 13:01:00",
        "Headline": "Left-wing Catherine Connolly pledged to be an \"inclusive president for all\" after being elected to replace Michael D Higgins, a popular poet and former arts minister who has served the maximum two terms in office.",
        "Content": " Independent candidate Catherine Connolly has won Ireland's presidential election after her rival conceded. The 68-year-old former barrister from Galway secured 63% of first preferences, in an election that was marked by a significant number of spoiled votes. Speaking at Dublin Castle after officially being declared the winner, Ms Connolly pledged to be \"an inclusive president for all\". Analysis: A landslide victory in a lacklustre presidential election  She said: \"I will be a president who listens and reflects and who speaks when it's necessary. \"I will be a voice for peace, a voice that builds on our policy of neutrality, a voice that articulates the existential threat posed by climate change, and a voice that recognises the tremendous work being done the length and breadth of the country. \"But my message is, use your voice in every way you can, because our public and democracy needs constructive questioning and, together, we can shape a new republic that values everybody, that values and champions diversity and that takes confidence in our own identity, our Irish language, our English language, and new people who have come to our country.\" The Irish presidency - which has been held by Michael D Higgins, a popular poet and former arts minister for the past 14 years - is largely ceremonial, but one with real national significance.  'A president for all of us' Congratulations from across the political spectrum poured in for Ms Connolly, including her only opponent in the race, Fine Gael candidate Heather Humphreys. She told reporters at the Cavan-Monaghan count centre: \"Catherine will be a president for all of us and she will be my president, and I really would like to wish her all the very, very best. \"I have absolutely not one regret.\" Also speaking at Dublin Castle, Ireland's Prime Minister Micheal Martin said he was looking forward to working with Ms Connolly. \"What an outstanding honour that has been bestowed upon her by the people of Ireland,\" he said. \"The people are sovereign in our democracy, we have one of the oldest democracies in the world, and it's something we cherish very much indeed. \"And the people have spoken resoundingly today. They've given Catherine a tremendous majority and a very clear mandate.\" Ireland's deputy premier, Simon Harris, who leads the Fine Gael party, said in a statement that Ms Connolly will be a president \"for all this country and for all of us\". The final result was officially announced by presidential returning officer Barry Ryan after counting in all 43 constituencies had completed. From early on Saturday, Ms Connolly was ahead in count centres nationwide, which she said she was \"absolutely delighted\" by. The election was, however, marked by a significant number of spoiled votes, with 213,738 invalid polls nationwide - a tenfold increase on the last presidential election in 2018. Among the anti-government messages on the ballots were \"no democracy\", \"EU puppets\" and \"no from me\". Read more: Who is Catherine Connolly? 'Seismic moment in our history' Social Democrats leader Holly Cairns added Ms Connolly's win represented a \"seismic moment in our history\". The Social Democrats were one of a number of parties backing Independent Ms Connolly in the election. She said: \"The momentum behind Catherine's presidential bid was incredible, growing from a small campaign run by dedicated volunteers to the grassroots movement it became. \"From day one, her message of inclusion, equality and social justice resonated with voters in every corner of Ireland. \"Catherine had a clear vision for the presidency and was determined to speak out on issues that mattered to people - housing, cost of living, disability services, climate action, the Irish language and neutrality. \"Catherine's considered, focused and compassionate approach to this campaign was hugely impressive.\""
    },
    {
        "title": "Trump says he is '100% open' to meeting Kim Jong Un during Asia trip",
        "description": "Donald Trump has said he would be \"100% open\" to meeting Kim Jong Un during his visit to Asia.",
        "url": "https://news.sky.com/story/trump-says-he-is-100-open-to-meeting-kim-jong-un-during-asia-trip-13457175",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-kim-north-korea_7001447.jpg?20250922104729",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-25 13:33:00",
        "Headline": "The US president said he gets along with his North Korean counterpart \"very well\" and would be open for a meeting during his five-day trip to Asia.",
        "Content": "Donald Trump has said he would be \"100% open\" to meeting Kim Jong Un during his visit to Asia. The US president said he gets along with his North Korean counterpart \"very well\" when asked by reporters aboard Air Force One, urging them to \"put out the word\". In 2019, Mr Trump became the first serving US president to cross the border into North Korea during his first term in office. The pair haven't met since, and the White House said nothing is planned for Mr Trump's five-day trip to Asia, which will see him meet with the leaders of Malaysia, Japan and South Korea.   Mr Kim said last month he still holds \"good personal memories\" of Mr Trump and that there is \"no reason not to\" resume talks with the US if it \"abandons\" what he called a \"delusional obsession\" with wanting North Korea to give up its nuclear weapons. Mr Kim has since accelerated the expansion of an arsenal of nuclear-capable missiles and strengthened his position by aligning with Russia over its war in Ukraine and tightening relations with China. While some experts predict a meeting between Mr Kim and Mr Trump is not likely, others predict the pair will eventually sit down for talks in the coming months.  \"We should see prospects for their meeting have increased,\" Ban Kil Joo, assistant professor at the Korea National Diplomatic Academy in Seoul told the Associated Press. He cited the recent suspension of civilian tours to the southern side of Panmunjom and Mr Kim's comments about a possible return to talks. Professor Ban said Mr Kim will likely determine whether to resume diplomacy with the US president when he holds a major ruling party conference, which is expected in January. Read more from Sky News:Turkey urges US to act after accusing Israel of breaching Gaza ceasefireWho is Japan's first female prime minister? Chung Jin-young, a former dean at South Korea's Kyung Hee University, said: \"If a meeting with Kim Jong Un happens, Trump would brag of it and boast he's the one who can resolve Korean Peninsula issues as well, so he has something to gain. \"But would the US have something substantial to give Kim Jong Un in return?\" Koh Yu-hwan, a former president of South Korea's Institute of National Unification, agreed, saying to secure a meeting, Mr Trump would have to bring \"something enticing to the table this time around\"."
    },
    {
        "title": "A landslide victory in a lacklustre presidential election that wounds the Irish government",
        "description": "In a result that was never in doubt, Catherine Connolly will become Ireland's 10th president, with an overwhelming victory.",
        "url": "https://news.sky.com/story/a-landslide-victory-in-a-lacklustre-presidential-election-that-wounds-the-irish-government-13457590",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-catherine-connolly_7061920.jpg?20251025184546",
        "type": "World",
        "Author": "Stephen Murphy",
        "Date Published": "2025-10-25 17:34:00",
        "Headline": "This was possibly the least enthusiastic presidential contest in Irish history. Voters  are used to six or seven candidates, but in the end there were just two.",
        "Content": "\n          Ireland correspondent\n              @SMurphyTV\n In a result that was never in doubt, Catherine Connolly will become Ireland's 10th president, with an overwhelming victory. That's the headline, but there's so much more to unpack here. This was possibly the least enthusiastic presidential contest in Irish history. Voters here are used to six or seven candidates, with a diverse range of views, fighting it out in often chaotic debates.   This time round, there were just three. Then two. Fianna Fail's Jim Gavin pulled out after one of the worst campaigns in recent history, leaving a two-horse race between independent Connolly and former cabinet minister Heather Humphreys. Humphreys, popular within Fine Gael, failed to make much of a connection with the electorate, and the party had privately accepted her fate weeks ago. The constitutional obstacles to getting on the ballot - that kept the likes of disgraced UFC fighter Conor McGregor at bay - also prevented several credible conservative candidates from competing. That led to a concerted \"spoil the vote\" campaign by activists, and many listened. Read more:Connolly to be next presidentWho is Catherine Connolly? Last time out, just 1.2% of ballots were spoiled. This time, it seems likely the number will be 10 times that. In certain working class areas, we saw boxes containing more than 50% of ballots marked spoiled. That's a staggering amount. Lack of choice Along with the perennial cartoons of male genitalia, there were anti-government comments scrawled on ballots. Angry commentary on the lack of choice in the tiny field, and anti-government slogans on issues like immigration were a regular feature. Many stayed away. Many who didn't stay away spoiled their vote. Humbling election Most who cast a valid vote didn't vote for the Fine Gael candidate. There's no doubt this has been a humbling election for the coalition Irish government. Read more from Sky News:Wrongly-released migrant 'tried to return to prison 4 or 5 times'Lucy Powell named Labour's new deputy leader Deputy prime minister Simon Harris, the Fine Gael leader, showed up at the results centre at Dublin Castle, sounding contrite and magnanimous in defeat. Ivan Yates, a former Fine Gael minister and podcaster, told me the backlash within Fianna Fail (the largest party) over the shambolic Gavin campaign, was so strong that it actually threatened to topple Irish Prime Minister Micheal Martin. \"A political earthquake\" was how an opposition party leader, Peadar Tobin, described it to Sky News. It's in the opposition's interest to leverage the presidential election - for an important but ultimately symbolic office - into something that might actually exert real political pressure on the government. But it's also fair to say that Micheal Martin may have a troubled night's sleep."
    },
    {
        "title": "Trump's Venezuela drug bust shows he's either misinformed or has another motive",
        "description": "The world's largest aircraft carrier is steaming towards the Caribbean supported by the rest of its \"carrier group\" to add even more muscle to the US forces already threateningly close to Venezuela.",
        "url": "https://news.sky.com/story/trumps-venezuela-drug-bust-shows-hes-either-misinformed-or-has-another-motive-13457711",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-venezuela-trump-us_7052301.jpg?20251016112919",
        "type": "US",
        "Author": "Stuart Ramsay",
        "Date Published": "2025-10-25 20:07:00",
        "Headline": "Sky's Stuart Ramsay says while the US president acknowledges that the synthetic opioid fentanyl is a huge killer in the US (which it is) and is supplied by drug gangs (which it is), to blame Venezuela for fentanyl production is simply incorrect.",
        "Content": "\n          Chief correspondent\n        The world's largest aircraft carrier is steaming towards the Caribbean supported by the rest of its \"carrier group\" to add even more muscle to the US forces already threateningly close to Venezuela. The question is simple - is this really all about President Trump's war on drugs in South America? I doubt it. A sledgehammer to crack a nut isn't even in it.   There are a few reasons to doubt the American government's stated aim of wiping out these so-called \"narco terrorist\" gangs threatening the US from Venezuela, even after one takes out of the equation the sort of equipment the military is deploying - which isn't what they would need for effective drug smuggling interdiction. While the president acknowledges that the synthetic opioid fentanyl is a huge killer in the US (which it is) and is supplied by drug gangs (which it is), to blame Venezuela for fentanyl production is simply incorrect.  Mexican cartels produce fentanyl with precursors largely supplied from China, and it is from Mexico - America's neighbour - that the fentanyl is smuggled directly into the US across its southern border. Venezuela isn't involved in this fentanyl business in any meaningful way, and I know this because I have reported from the Sinaloa cartel's fentanyl production labs in Mexico. The Mexican cartels are very proud of their business, and from my experience covering this story over the years, when the drugs cartels are proud of something, and it makes them a lot of money - which fentanyl does - they don't share the market with anyone, and certainly not with Venezuela. President Trump is right that Venezuela is now a large supplier of other illegal drugs, especially cocaine, but they come from countries like Colombia, Peru, and Bolivia, which are the largest producers of the coca leaf in the world (the coca leaf is what cocaine is made from). Read more:US accused of 'inventing a war'Survivors reported after boat strikeUS destroys 'drug smuggling submarine' Venezuela, which borders Colombia, is largely a transit country to the Caribbean in the same way that Ecuador, which also borders Colombia, is a transit country to the Pacific. Neither Venezuela nor Ecuador are significant drug producers. The drugs enter Venezuela overland, primarily from Colombia, and then mainly leave the country from ports on the northern coast of the country - and these are the departure points of the boats the US government has recently targeted and destroyed, along with the crews on board.  President Trump claims these boats from Venezuela are heading to the US, but in reality they are mainly heading to the nearby islands of Trinidad and Tobago, and from there they largely go to West Africa and Europe - mostly Spain and Portugal. Drugs heading to America either pass through Mexico over the border into the US or are transported via the Pacific Ocean route through countries like Ecuador. In this instance, Venezuela isn't involved. Read more: Inside Pablo Escobar's home city where drugs are readily available  It's widely accepted the two most exported drugs from South America are cocaine and marijuana - and the volume of production is staggering. But the Centres for Disease Control and Prevention in the US says that synthetic opioids like fentanyl are responsible for most overdose deaths there - and fentanyl is not produced in South America, whatever the president says. So one can only conclude he is either mistaken and misinformed, or he has another motive. I suspect it is the latter, and that regime change in Venezuela is top of the list."
    },
    {
        "title": "Trump says he is '100% open' to meeting Kim Jong Un during Asia trip",
        "description": "Donald Trump has said he would be \"100% open\" to meeting Kim Jong Un during his visit to Asia.",
        "url": "https://news.sky.com/story/trump-says-he-is-100-open-to-meeting-kim-jong-un-during-asia-trip-13457175",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-kim-north-korea_7001447.jpg?20250922104729",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-25 13:33:00",
        "Headline": "The US president said he gets along with his North Korean counterpart \"very well\" and would be open for a meeting during his five-day trip to Asia.",
        "Content": "Donald Trump has said he would be \"100% open\" to meeting Kim Jong Un during his visit to Asia. The US president said he gets along with his North Korean counterpart \"very well\" when asked by reporters aboard Air Force One, urging them to \"put out the word\". In 2019, Mr Trump became the first serving US president to cross the border into North Korea during his first term in office. The pair haven't met since, and the White House said nothing is planned for Mr Trump's five-day trip to Asia, which will see him meet with the leaders of Malaysia, Japan and South Korea.   Mr Kim said last month he still holds \"good personal memories\" of Mr Trump and that there is \"no reason not to\" resume talks with the US if it \"abandons\" what he called a \"delusional obsession\" with wanting North Korea to give up its nuclear weapons. Mr Kim has since accelerated the expansion of an arsenal of nuclear-capable missiles and strengthened his position by aligning with Russia over its war in Ukraine and tightening relations with China. While some experts predict a meeting between Mr Kim and Mr Trump is not likely, others predict the pair will eventually sit down for talks in the coming months.  \"We should see prospects for their meeting have increased,\" Ban Kil Joo, assistant professor at the Korea National Diplomatic Academy in Seoul told the Associated Press. He cited the recent suspension of civilian tours to the southern side of Panmunjom and Mr Kim's comments about a possible return to talks. Professor Ban said Mr Kim will likely determine whether to resume diplomacy with the US president when he holds a major ruling party conference, which is expected in January. Read more from Sky News:Turkey urges US to act after accusing Israel of breaching Gaza ceasefireWho is Japan's first female prime minister? Chung Jin-young, a former dean at South Korea's Kyung Hee University, said: \"If a meeting with Kim Jong Un happens, Trump would brag of it and boast he's the one who can resolve Korean Peninsula issues as well, so he has something to gain. \"But would the US have something substantial to give Kim Jong Un in return?\" Koh Yu-hwan, a former president of South Korea's Institute of National Unification, agreed, saying to secure a meeting, Mr Trump would have to bring \"something enticing to the table this time around\"."
    },
    {
        "title": "June Lockhart: Lassie and Lost In Space actress dies aged 100",
        "description": "June Lockhart, who starred in television shows such as Lassie and Lost In Space, has died at the age of 100.",
        "url": "https://news.sky.com/story/june-lockhart-lassie-and-lost-in-space-actress-dies-aged-100-13457717",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-june-lockhart-lassie_7062116.jpg?20251025212939",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-25 20:13:00",
        "Headline": "Between 1958 and 1964, she played the role of Ruth Martin, who raised the orphaned Timmy in Lassie. And from 1965 to 1968, Lockhart was Maureen Robinson, a mother who was part of a marooned family in Lost In Space.",
        "Content": "June Lockhart, who starred in television shows such as Lassie and Lost In Space, has died at the age of 100. The US actress died of natural causes at her home in Santa Monica, California, on Thursday, according to family spokesman Lyle Gregory. He said: \"She was very happy up until the very end, reading the New York Times and LA Times every day. \"It was very important to her to stay focused on the news of the day.\" For more than 200 episodes between 1958 and 1964, she played the role of Ruth Martin, who raised the orphaned Timmy (Jon Provost) in Lassie - a show about the adventures of a brave and intelligent Rough Collie dog. And from 1965 to 1968 spanning over 80 episodes, Lockhart was Maureen Robinson, a mother who was part of a marooned family that travelled on the spaceship Jupiter II in Lost In Space. She was nominated for two Emmys, including best actress in a leading role in a dramatic series for her performance in Lassie in 1959. \n                  British Airways pulls Louis Theroux podcast funding over Bob Vylan interview\n                 \n                  Rapper Ghetts charged after man killed in hit-and-run\n                 \n                  Kim Kardashian diagnosed with brain aneurysm\n                 She also received two stars on the Hollywood Walk of Fame, one for motion picture and one for television. Born in New York City in 1925, she was the daughter of actor Gene Lockhart and actress Kathleen Lockhart. Feature film debut She made her feature film debut aged 13, starring alongside both of her parents in the 1938 production A Christmas Carol, where she played Belinda Cratchit, the daughter of Bob Cratchit. After her breakout role, she appeared in films such as All This, and Heaven Too, Meet Me in St. Louis, The Yearling, and Sergeant York. She was also in Son Of Lassie, the 1945 sequel to Lassie, Come Home, playing the grown-up version of the role created by Elizabeth Taylor. Over almost eight decades on screen, Lockhart appeared in dozens of TV series and movies, including when she was well in her 80s. Other roles She had recurring roles on Petticoat Junction, General Hospital, and Beverly Hills 90210, and guest appearances on shows including The Beverly Hillbillies, The Colbys, Knots Landing and Happy Days, as well as Full House, Roseanne and Grey's Anatomy. Of her time on Lassie, Lockhart spoke frankly about her canine co-star. She said: \"I worked with four Lassies. There was only one main Lassie at a time. Then there was a dog that did the running, a dog that did the fighting, and a dog that was a stand-in, because only humans can work 14 hours a day without needing a nap. \"Lassie was not especially friendly with anybody. Lassie was wholly concentrated on the trainers.\" Even though she sometimes mocked the show, she conceded: \"How wonderful that in a career there is one role for which you are known. Many actors work all their lives and never have one part that is really theirs.\" Read more from Sky News:BA pulls Louis Theroux podcast funding over Bob Vylan interviewCCTV images show last sightings of wanted asylum seeker In Lost In Space, Lockhart was part of a family that left Earth on a five-year flight to a faraway planet. After their mission was sabotaged by fellow passenger Dr Zachary Smith, the group went from planet to planet, encountering strange creatures and near-disasters where viewers needed to watch the following week to learn of the escape. Speaking fondly about working on Lost in Space, Lockhart said: \"It was like going to work at Disneyland every day.\" She was married and divorced twice: to John Maloney, a physician, father of her daughters Anne Kathleen and June Elizabeth; and architect John C Lindsay."
    },
    {
        "title": "Pentagon accepts $130m donation to help pay the military during government shutdown",
        "description": "The Pentagon has confirmed it has accepted an anonymous $130m (&#163;98m) gift to help pay members of the military during the government shutdown.",
        "url": "https://news.sky.com/story/pentagon-accepts-130m-donation-to-help-pay-the-military-during-government-shutdown-13457040",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-pentagon-911-flag_7016995.jpg?20250911121315",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-25 08:06:00",
        "Headline": "The identity of the donor is being withheld, with President Trump referring to the anonymous man who gave the gift as a \"patriot\" and \"friend of mine\".",
        "Content": "The Pentagon has confirmed it has accepted an anonymous $130m (£98m) gift to help pay members of the military during the government shutdown. President Donald Trump announced the donation at the White House on Thursday, calling the donor a \"patriot\" and \"friend of mine,\" but withholding his name, saying they did not want recognition. Mr Trump said: \"He called us the other day and he said, 'I'd like to contribute any shortfall you have because of the Democrat shutdown. I'd like to contribute, personally contribute, any shortfall you have with the military, because I love the military and I love the country' ... And today, he sent us a check for $130 million\". The Pentagon confirmed it had accepted the donation on Thursday \"under its general gift acceptance authority.\" \"The donation was made on the condition that it be used to offset the cost of service members' salaries and benefits,\" Sean Parnell, chief spokesman for the Pentagon, said in a statement. \"We are grateful for this donor's assistance after Democrats opted to withhold pay from troops.\" The government shutdown is now approaching its fifth week, and is on track to become one of the longest federal closures ever. \n                  Trump's Venezuela drug bust shows he's either misinformed or has another motive\n                 \n                  Trump says he is '100% open' to meeting Kim Jong Un during Asia trip\n                 \n                  Canadian TV advert pulled after angry Donald Trump 'terminates' trade talks\n                 Neither Republicans, who have control of the House, Senate and White House, nor Democrats, in the minority, are willing to budge in their broader stand-off over health care funding. Explained: What is a shutdown and who does it impact? On Thursday, the Senate failed to advance a GOP bill that would have provided pay for some federal workers, and an alternative offered by the Democrats to pay all federal workers also failed. Although a large sum, the $130m gift amounts to just a small contribution toward the billions needed to cover service member pay. The Trump administration told Congress last week that it used $6.5bn to cover military pay. The next payday is due within the week, and it is unclear if the administration will again move money around to ensure the military does not go without pay. The Trump administration diverted $8bn from military research and development funds to pay troops on time. 👉 Follow Trump100 on your podcast app 👈 Ethical concerns have been raised over the donation. A spokesman for Senator Chris Coons, the ranking member of the Senate Appropriations subcommittee on Defence, said the anonymous nature of the donation raised concerns. \"Using anonymous donations to fund our military raises troubling questions of whether our own troops are at risk of literally being bought and paid for by foreign powers,\" the spokesman said. Pentagon policy says authorities \"must consult with their appropriate ethics official before accepting such a gift valued in excess of $10,000 to determine whether the donor is involved in any claims, procurement actions, litigation, or other particular matters involving the Department that must be considered prior to gift acceptance.\""
    },
    {
        "title": "Administrators lined up for North Sea oilfield services group Petrofac",
        "description": "Administrators are on standby this weekend to handle the collapse of Petrofac, the oil and energy services group - an insolvency which could threaten the future of more than 2,000 jobs in Scotland.",
        "url": "https://news.sky.com/story/administrators-lined-up-for-north-sea-oilfield-services-group-petrofac-13457010",
        "image_url": "https://e3.365dm.com/20/05/1920x1080/skynews-petrofac-offshore_4990539.jpg?20200514172935",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-25 06:56:00",
        "Headline": "Petrofac’s board has lined up Teneo to act as administrator, a move which could be triggered as early as Monday morning and imperil more than 2,000 jobs in Scotland, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Administrators are on standby this weekend to handle the collapse of Petrofac, the oil and energy services group - an insolvency which could threaten the future of more than 2,000 jobs in Scotland. Sky News has learnt that directors of Petrofac have lined up Teneo for an administration process which could be confirmed as early as Monday morning. The company's board, chaired by former Anglo American finance director Rene Medori, is said to be holding emergency talks this weekend. One industry executive said a decision to file for administration was likely to be taken before the stock market opens on Monday. Ed Miliband, the energy secretary, and other ministers have been briefed on the situation, with more than 2,000 Scottish-based jobs potentially at risk. Kroll, the advisory firm, has been engaged by the Department for Energy Security and Net Zero to work with ministers and officials on the unfolding crisis. Government sources claimed this weekend that Petrofac's UK operations were \"growing\". \n                  Cutting cash ISA allowance could backfire - and make mortgages more expensive, MPs warn \n                 \n                  Money blog: Complete guide to buying a house - from gazumping to wardrobe rule \n                 \n                  Sheffield Wednesday deducted 12 points after entering administration\n                 \"This government is supporting jobs and investment in Scotland including building a world leading carbon capture industry in the North Sea, alongside our biggest ever investment in offshore wind,\" one official said. A source close to Petrofac said on Saturday that the UK arm of the group had not been beset by any lossmaking contracts and would be in a strong position to secure its future. The administration process would affect the parent company, Petrofac Limited, which does not directly employ the company's workforce, they added. Petrofac's potential collapse comes at a sensitive time for Mr Miliband, who is coming under enormous pressure to permit more North Sea oil and gas drilling despite Labour's manifesto commitment not to grant licences on new fields. Petrofac employs about 7,300 people globally, according to a recent stock exchange filing. It designs, constructs and operates offshore equipment for energy companies. The company's shares have been suspended since April. Petrofac, which now has a market capitalisation of barely £20m, has been mired in financial trouble for years. Once-valued at more than £6bn, it has been drowning in a sea of debt, and faced a Serious Fraud Office investigation which resulted in a 2021 conviction for failing to prevent bribery, and the payment of more than $100m in penalties. In a stock exchange announcement on Thursday, Petrofac said the cancellation of a contract by TenneT, an operator of electricity grids in Europe which is its biggest customer, meant that a solvent restructuring was now not viable. \"Having carefully assessed the impact of TenneT's decision, the Board has determined that the restructuring, which had last week reached an advanced stage, is no longer deliverable in its current form,\" the company said. \"The group is in close and constant dialogue with its key creditors and other stakeholders as it actively pursues alternative options for the group. \"In the meantime, Petrofac remains focused on serving its clients and maintaining operational capability and delivery of services across its businesses.\" Founded in 1981 in Texas, Petrofac has been in talks about a far-reaching financial restructuring for more than a year. A formal restructuring plan was sanctioned by the High Court in May 2025 with the aim of writing off much of its debt and injecting new equity into the business. This was subsequently overturned, prompting talks with creditors about a revised agreement. If Petrofac does fall into administration, it is expected to be broken up, with some of its assets - including key contracts - likely to be taken over by other industry players. Petrofac has been contacted for comment. A DESNZ spokesman declined to comment."
    },
    {
        "title": "Cutting cash ISA allowance could backfire - and make mortgages more expensive, MPs warn ",
        "description": "Cutting the annual allowance for cash ISAs could backfire in multiple ways, an influential group of MPs has warned the government.",
        "url": "https://news.sky.com/story/cutting-cash-isa-allowance-could-backfire-and-make-mortgages-more-expensive-mps-warn-13456982",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-notes-banknotes_6938843.jpg?20250611021632",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-25 02:25:00",
        "Headline": "The latest figures suggest two-thirds of contributions to ISAs in the 2023/24 tax year went to cash accounts - bringing total holdings to £360bn. An estimated 14.4 million consumers solely save in a cash ISA, with the average balance standing at £6,993.",
        "Content": "Cutting the annual allowance for cash ISAs could backfire in multiple ways, an influential group of MPs has warned the government. For months, speculation has been growing that the chancellor may slash the yearly limit for tax-free savings - potentially from £20,000 to £10,000. The government is hoping to encourage savers to invest in stocks and shares ISAs instead, which can offer greater long-term returns and improve financial health. But according to the Treasury Committee, slashing allowances would be unlikely to achieve this - and could lead to higher prices for consumers.  Building societies rely on cash ISA savings to fund mortgage lending - and a drop in deposits might lead to higher interest rates or fewer products on the market. Committee chairwoman Dame Meg Hillier said \"we are a long way\" from achieving a culture where substantial numbers of Britons invest in the stock market. \"This is not the right time to cut the cash ISA limit,\" she warned. \"Instead, the Treasury should focus on ensuring that people are equipped with the necessary information and confidence to make informed investment decisions. \n                  Be bold with tax hikes or risk 'groundhog day', chancellor told as limited growth recorded\n                 \n                  Chancellor Rachel Reeves admits tax rises and spending cuts considered for budget\n                 \n                  'Make or break': Chancellor warned businesses can't take more tax hikes in budget\n                 \"Without this, I fear the chancellor's attempts to transform the UK's investment culture simply will not deliver the change she seeks, instead hitting savers and borrowers.\" Read more: How to get started with a stocks and shares ISA  The latest figures suggest two-thirds of contributions to ISAs in the 2023/24 tax year went to cash accounts - bringing total holdings to £360bn. An estimated 14.4 million consumers solely save in a cash ISA, with the average balance standing at £6,993. Surveys suggest that, if allowances were cut, consumers may move their cash to alternative savings accounts where they would have to pay tax on interest. Skipton Group executive Charlotte Harrison previously warned: \"Building societies, which funds over a third of all first-time buyer mortgages, rely on retail deposits like cash ISAs to fund their lending. \"If ISA inflows fall, the cost of funding is likely to rise, and that means mortgages could become both more expensive and harder to access.\" She claimed a policy change could end up \"penalising savers who want low-risk, flexible options\" - adding: \"Cash ISAs work. Undermining them doesn't.\" Read more money news:What's behind surprising rise in retail salesTesco rolls out bodycams to security staff  Chancellor Rachel Reeves said: \"At the moment, often returns on savings and returns on pensions are lower than in comparable countries around the world. \"I do want to make sure that when people put something aside for the future, they get good returns on those savings.\" The committee's warning comes amid speculation over whether Ms Reeves will raise income tax at next month's budget - breaking a key Labour manifesto pledge. Newspaper reports have suggested that the basic rate of income tax could be increased for the first time since the 1970s - up 1p to 21%. This could raise about £8bn and help tackle a black hole in the country's finances, but risks squeezing consumers further as a cost-of-living crisis continues. A 1p rise to the higher band of income tax - taking that rate to 41% - is also believed to be under consideration, but this would only boost the nation's coffers by £2bn. Ms Reeves has refused to rule out such a move, telling Sky's deputy political editor Sam Coates that she is looking at both tax rises and spending cuts ahead of her statement to the Commons on 26 November. Shadow chancellor Sir Mel Stride said: \"It's no surprise the Treasury Select Committee is warning against cutting the Cash ISA allowance - because Labour's plan is nothing less than a savings tax. \"Rachel Reeves wants to punish people who do the right thing by saving for their future. That's wrong. Saving should be rewarded, not taxed. \"If Rachel Reeves had a plan and a backbone, she would control spending - not raise taxes.\""
    },
    {
        "title": "Labour's Lucy Powell will take a 'submarine approach' as deputy PM - for now",
        "description": "Lucy Powell's had quite the political comeback. Sacked from cabinet by the prime minister but weeks ago, she's back with her own powerbase and voice at the top of the party as the deputy Labour leader.",
        "url": "https://news.sky.com/story/labours-lucy-powell-will-take-a-submarine-approach-as-deputy-pm-for-now-13457291",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lucy-powell-keir-starmer_7061752.jpg?20251025172507",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-10-25 14:40:00",
        "Headline": "Lucy Powell says Labour need to pull together to see off Reform, but will she become more critical as we approach the next general election?",
        "Content": "\n          Political editor\n              @BethRigby\n  Lucy Powell's had quite the political comeback. Sacked from cabinet by the prime minister but weeks ago, she's back with her own powerbase and voice at the top of the party as the deputy Labour leader. She was not Keir Starmer's choice and, while the prime minister was quick to embrace her on Saturday as the result was announced, he is probably right to feel some unease about the outcome for a few different reasons. For in Powell, the party has a new, alternative figurehead that sits outside of the government machine. Politics live: Follow updates as Labour names new deputy leader  She ran a campaign in which she pledged to be the voice of the membership to the leadership and the membership picked her. She will have serious influence on the National Executive Committee, and sit in the political cabinet. What she won't do is return to the cabinet table, which means that she has power and profile, but will remain an independent voice, free from collective cabinet responsibility. \n                  Two Ukrainian nationals deny arson attacks on properties and car linked to Starmer\n                 \n                  Is the government too close to China?  \n                 \n                  PM faces 'more unanswered questions' after evidence in China spying case released\n                 As I understand it, Powell doesn't want to destabilise the leadership - for now at least. She will take a submarine approach when it comes to interventions around government policy rather than offering a running commentary on Starmer's government and choose her battles. That way, when she does weigh in, she is harder to ignore. She could also over time become a lightning rod for discontent should the party's fortunes remain as parlous as they are now.  On Friday, Labour suffered a cataclysmic defeat in the Caerphilly by-election, coming third in a seat it has held for over a century as Labour endured their biggest ever drop in support in a Welsh by-election. It's a terrible omen for next May's Sennedd election. Labour have been the governing party in Wales since the Senedd's beginning in 1999. That could be about to change. When I asked Keir Starmer about the loss on Friday, he didn't try to deflect, saying: \"I'm deeply disappointed by the results.\" When I asked him if it was a gut punch, he said: \"I'm not going to suggest otherwise. I spoke to the first minister on Saturday morning, and clearly we need to reflect and regroup, and double down on the delivery, in Wales. And we clearly need to do much more.\"  Powell's position now is that the party needs to pull together, get campaigning and try to build support with their voters. But she is equally clear that this has to be down to delivery of the \"national renewal\" Labour promised voters in the election of 2024. There will surely come a point, further down the road, where this new deputy leader will become more robust in her critique of the government if it fails to deliver and the party suffers. This race has also exposed the ugliness in a party that is uneasy with its leadership and seems intent on infighting. The constant briefing wars that emanate from Number 10 cascade down in what has been, at times, a dirty fight. Lucy Powell accused Bridget Phillipson's team of \"throwing mud\" and briefing against her in the Labour deputy leadership race on our Electoral Dysfunction podcast, while Phillipson also said she was at the sharp end of vicious smears.  👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 For all the talk on Saturday for coming together and unity, it is hard to see that materialising while doubts persist over Starmer's leadership and while rivals, such as Powell's close ally Andy Burnham, are waiting in the wings. There is also the big question of apathy. Only 16.6% of party members, trade union members and affiliates chose to vote in this election, against 59% in 2020. This is partly distorted because in the last leadership election, members were voting for both the leader and deputy leaders. But what it also suggests is disengagement from the wider Labour movement. In 2020, there were 552,000 party members eligible to vote, out of a total membership which stood at 782,000, including union-affiliated members who are perhaps less likely to cast a vote. This time around there were 970,000 eligible voters - but the Labour Party did not reveal how many actual party members cast a vote. This might be because membership figures are dropping, and it didn't want to reveal that information. At the end of last year, party membership stood at 332,000, which is around 200,000 members less than the end of 2019. For now, Powell insists that she and Starmer will work as a team and the message from both Powell and the PM following her victory is that all of those party must put its shoulder to the wheel to try and see off the threat of Reform. She is undoubtedly starting out as the party's campaigner in chief, but I suspect she may become a far more critical - and dangerous - voice, if Starmer looks like he can't get the party in good enough shape to win the next general election."
    },
    {
        "title": "Who is Labour's new deputy leader Lucy Powell and what does she stand for?",
        "description": "Lucy Powell has been elected as the deputy leader of the Labour Party.",
        "url": "https://news.sky.com/story/who-is-labours-new-deputy-leader-lucy-powell-and-what-does-she-stand-for-13457202",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-powell-commons-labour_6909845.jpg?20251025180030",
        "type": "Politics",
        "Author": "Mhari Aurora",
        "Date Published": "2025-10-25 13:45:00",
        "Headline": "Powell insists she wants to help Keir Starmer, providing constructive criticism and a voice for Labour members. But will he see it that way?",
        "Content": "\n          Political correspondent\n              @MhariAurora\n  Lucy Powell has been elected as the deputy leader of the Labour Party. But who is she and what does she stand for? Powell began her career in politics working for Labour MPs Glenda Jackson and Beverley Hughes. She then worked for a pro-EU campaign group.  After that, she ran Ed Miliband's successful Labour leadership campaign and was his deputy chief of staff until she was elected as the MP for Manchester Central in 2012. She has been at the forefront of Labour politics for over a decade, serving under Ed Miliband, Jeremy Corbyn and Keir Starmer. After Labour won the last general election, she was appointed as the leader of the House of Commons in Starmer's cabinet. But last month she was sacked in the cabinet reshuffle and came to be seen as the anti-Starmer candidate. During the deputy leadership campaign, Powell promised to \"provide a stronger, more independent voice\" for members of the Labour Party. And in her acceptance speech, she said the government hadn't been bold enough, and that it needed to step up. So how much of a problem is she going to be for Keir Starmer? Her new role - and being outside the cabinet - means she will be free to criticise the government, which could make life more difficult for the prime minister. Read More:Lucy Powell named Labour's new deputy leaderPowell will take a 'submarine approach' - for now Powell has been outspoken about her desire for the government to lift the two child benefit cap - and also called for the country to work for the many and not the few - a Corbyn-era slogan - and that Labour must stop handing the megaphone over to Reform and letting them run away with it. Starmer will be conscious that an MP he sacked not long ago is now in a powerful role able to speak freely and attack his decisions. But Powell is not free from her own controversies. In May, Lucy Powell called grooming gangs a dog whistle issue - something she later had to clarify after it caused outrage among campaigners and opposition parties. She also vocally defended Labour's unpopular cut to winter fuel allowance while in cabinet, before the government then U-turned on the policy - she then criticised the proposed welfare cuts after she was sacked from government. Powell insists she wants to help Keir Starmer, providing constructive criticism and a voice for Labour members. But will Keir Starmer see it that way?"
    },
    {
        "title": "Twenty warnings for Sir Keir Starmer from new deputy leader Lucy Powell",
        "description": "Labour's new deputy leader Lucy Powell promised to be Sir Keir Starmer's ally.",
        "url": "https://news.sky.com/story/twenty-warnings-for-sir-keir-starmer-from-new-deputy-leader-lucy-powell-13457232",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lucy-powell-labour_7037947.jpg?20251001094236",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-10-25 13:53:00",
        "Headline": "Sky's Jon Craig breaks down what Labour's Lucy Powell said - and what she meant - as she was crowned the party's new deputy leader after a closely fought race against Education Secretary Bridget Phillipson.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Labour's new deputy leader Lucy Powell promised to be Sir Keir Starmer's ally. Yet in her victory speech she criticised his government and its record no fewer than 20 times. And told him to raise his game, or else. Politics live: Follow for updates as Labour names new deputy leader Here's what she said - and what she meant: Read more from Sky News:The one thing Farage and Polanski have in commonChina 'enemy' reference removed from witness statement She said it all with a smile, but there was menace there. As deputy leader, Lucy Powell was always going to be a critical friend. So there you go, prime minister. Here's 20 things you need to do for her to be more friend than critic."
    },
    {
        "title": "Cutting cash ISA allowance could backfire - and make mortgages more expensive, MPs warn ",
        "description": "Cutting the annual allowance for cash ISAs could backfire in multiple ways, an influential group of MPs has warned the government.",
        "url": "https://news.sky.com/story/cutting-cash-isa-allowance-could-backfire-and-make-mortgages-more-expensive-mps-warn-13456982",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-notes-banknotes_6938843.jpg?20250611021632",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-25 02:25:00",
        "Headline": "The latest figures suggest two-thirds of contributions to ISAs in the 2023/24 tax year went to cash accounts - bringing total holdings to £360bn. An estimated 14.4 million consumers solely save in a cash ISA, with the average balance standing at £6,993.",
        "Content": "Cutting the annual allowance for cash ISAs could backfire in multiple ways, an influential group of MPs has warned the government. For months, speculation has been growing that the chancellor may slash the yearly limit for tax-free savings - potentially from £20,000 to £10,000. The government is hoping to encourage savers to invest in stocks and shares ISAs instead, which can offer greater long-term returns and improve financial health. But according to the Treasury Committee, slashing allowances would be unlikely to achieve this - and could lead to higher prices for consumers.  Building societies rely on cash ISA savings to fund mortgage lending - and a drop in deposits might lead to higher interest rates or fewer products on the market. Committee chairwoman Dame Meg Hillier said \"we are a long way\" from achieving a culture where substantial numbers of Britons invest in the stock market. \"This is not the right time to cut the cash ISA limit,\" she warned. \"Instead, the Treasury should focus on ensuring that people are equipped with the necessary information and confidence to make informed investment decisions. \n                  Be bold with tax hikes or risk 'groundhog day', chancellor told as limited growth recorded\n                 \n                  Chancellor Rachel Reeves admits tax rises and spending cuts considered for budget\n                 \n                  'Make or break': Chancellor warned businesses can't take more tax hikes in budget\n                 \"Without this, I fear the chancellor's attempts to transform the UK's investment culture simply will not deliver the change she seeks, instead hitting savers and borrowers.\" Read more: How to get started with a stocks and shares ISA  The latest figures suggest two-thirds of contributions to ISAs in the 2023/24 tax year went to cash accounts - bringing total holdings to £360bn. An estimated 14.4 million consumers solely save in a cash ISA, with the average balance standing at £6,993. Surveys suggest that, if allowances were cut, consumers may move their cash to alternative savings accounts where they would have to pay tax on interest. Skipton Group executive Charlotte Harrison previously warned: \"Building societies, which funds over a third of all first-time buyer mortgages, rely on retail deposits like cash ISAs to fund their lending. \"If ISA inflows fall, the cost of funding is likely to rise, and that means mortgages could become both more expensive and harder to access.\" She claimed a policy change could end up \"penalising savers who want low-risk, flexible options\" - adding: \"Cash ISAs work. Undermining them doesn't.\" Read more money news:What's behind surprising rise in retail salesTesco rolls out bodycams to security staff  Chancellor Rachel Reeves said: \"At the moment, often returns on savings and returns on pensions are lower than in comparable countries around the world. \"I do want to make sure that when people put something aside for the future, they get good returns on those savings.\" The committee's warning comes amid speculation over whether Ms Reeves will raise income tax at next month's budget - breaking a key Labour manifesto pledge. Newspaper reports have suggested that the basic rate of income tax could be increased for the first time since the 1970s - up 1p to 21%. This could raise about £8bn and help tackle a black hole in the country's finances, but risks squeezing consumers further as a cost-of-living crisis continues. A 1p rise to the higher band of income tax - taking that rate to 41% - is also believed to be under consideration, but this would only boost the nation's coffers by £2bn. Ms Reeves has refused to rule out such a move, telling Sky's deputy political editor Sam Coates that she is looking at both tax rises and spending cuts ahead of her statement to the Commons on 26 November. Shadow chancellor Sir Mel Stride said: \"It's no surprise the Treasury Select Committee is warning against cutting the Cash ISA allowance - because Labour's plan is nothing less than a savings tax. \"Rachel Reeves wants to punish people who do the right thing by saving for their future. That's wrong. Saving should be rewarded, not taxed. \"If Rachel Reeves had a plan and a backbone, she would control spending - not raise taxes.\""
    },
    {
        "title": "UK makes world's biggest-ever seizure of fake weight loss jabs",
        "description": "More than 2,000 counterfeit weight loss jabs have been confiscated from a factory in Northampton, in what's believed to be the world's largest seizure.",
        "url": "https://news.sky.com/story/uk-makes-worlds-biggest-ever-seizure-of-fake-weight-loss-jabs-13456989",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-mhra-weight-loss_7061140.jpg?20251025041708",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-25 03:13:00",
        "Headline": "\"This is a victory in the fight against the shameless criminals who are putting lives at risk by peddling dangerous and illegal weight loss jabs to make a quick buck,\" the health secretary says.",
        "Content": "More than 2,000 counterfeit weight loss jabs have been confiscated from a factory in Northampton, in what's believed to be the world's largest seizure. The UK's medicines regulator and police joined forces to smash the illicit facility, which was manufacturing and distributing unlicensed products. Labels suggested the knock-off pens contained tirzepatide, an ingredient found in Mounjaro. But Eli Lilly, the company behind the real medication, said anyone who bought these jabs on the black market would have \"no way of knowing what they actually contain\". This is the first seizure of its kind in the UK - with raw chemicals, equipment, tens of thousands of empty pens and £20,000 in cash also recovered from the site. Estimates suggest that the street value of the counterfeit jabs is about £250,000. Health Secretary Wes Streeting said: \"This is a victory in the fight against the shameless criminals who are putting lives at risk by peddling dangerous and illegal weight loss jabs to make a quick buck. \n                  Former police chief Nick Adderley charged with fraud over alleged false military service claims\n                 \n                  Policeman, 24, dies after being hit by car in Northamptonshire\n                 \n                  Second arrest after man found dead on bench near Northampton canal\n                 \"These unregulated products, made with no regard for safety or quality, posed a major risk to unwitting consumers.\" Mr Streeting urged the public not to buy weight loss medication from unregulated sources - as this \"lines the pockets of criminals who don't care about your health\". Read more from Sky News:Could the UK run out of drinking water?First significant cold snap of season looms Andy Morling, the head of the Medicines and Healthcare products Regulatory Agency's (MHRA) criminal enforcement unit, described the seizure as a \"landmark result and a major blow to the illegal trade\". He added: \"These products are untested, unauthorised and potentially deadly. By taking this organised criminal network out of operation - and stopping tens of thousands of products from entering circulation - we've prevented a serious risk to public health.\" According to Pharmacy magazine, no arrests have been made in connection with the seizure so far. At the moment, weight loss jabs are only available on the NHS to patients who meet strict criteria. Private prescriptions are available but can cost hundreds of pounds a month."
    },
    {
        "title": "June Lockhart: Lassie and Lost In Space actress dies aged 100",
        "description": "June Lockhart, who starred in television shows such as Lassie and Lost In Space, has died at the age of 100.",
        "url": "https://news.sky.com/story/june-lockhart-lassie-and-lost-in-space-actress-dies-aged-100-13457717",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-june-lockhart-lassie_7062116.jpg?20251025212939",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-25 20:13:00",
        "Headline": "Between 1958 and 1964, she played the role of Ruth Martin, who raised the orphaned Timmy in Lassie. And from 1965 to 1968, Lockhart was Maureen Robinson, a mother who was part of a marooned family in Lost In Space.",
        "Content": "June Lockhart, who starred in television shows such as Lassie and Lost In Space, has died at the age of 100. The US actress died of natural causes at her home in Santa Monica, California, on Thursday, according to family spokesman Lyle Gregory. He said: \"She was very happy up until the very end, reading the New York Times and LA Times every day. \"It was very important to her to stay focused on the news of the day.\" For more than 200 episodes between 1958 and 1964, she played the role of Ruth Martin, who raised the orphaned Timmy (Jon Provost) in Lassie - a show about the adventures of a brave and intelligent Rough Collie dog. And from 1965 to 1968 spanning over 80 episodes, Lockhart was Maureen Robinson, a mother who was part of a marooned family that travelled on the spaceship Jupiter II in Lost In Space. She was nominated for two Emmys, including best actress in a leading role in a dramatic series for her performance in Lassie in 1959. \n                  British Airways pulls Louis Theroux podcast funding over Bob Vylan interview\n                 \n                  Rapper Ghetts charged after man killed in hit-and-run\n                 \n                  Kim Kardashian diagnosed with brain aneurysm\n                 She also received two stars on the Hollywood Walk of Fame, one for motion picture and one for television. Born in New York City in 1925, she was the daughter of actor Gene Lockhart and actress Kathleen Lockhart. Feature film debut She made her feature film debut aged 13, starring alongside both of her parents in the 1938 production A Christmas Carol, where she played Belinda Cratchit, the daughter of Bob Cratchit. After her breakout role, she appeared in films such as All This, and Heaven Too, Meet Me in St. Louis, The Yearling, and Sergeant York. She was also in Son Of Lassie, the 1945 sequel to Lassie, Come Home, playing the grown-up version of the role created by Elizabeth Taylor. Over almost eight decades on screen, Lockhart appeared in dozens of TV series and movies, including when she was well in her 80s. Other roles She had recurring roles on Petticoat Junction, General Hospital, and Beverly Hills 90210, and guest appearances on shows including The Beverly Hillbillies, The Colbys, Knots Landing and Happy Days, as well as Full House, Roseanne and Grey's Anatomy. Of her time on Lassie, Lockhart spoke frankly about her canine co-star. She said: \"I worked with four Lassies. There was only one main Lassie at a time. Then there was a dog that did the running, a dog that did the fighting, and a dog that was a stand-in, because only humans can work 14 hours a day without needing a nap. \"Lassie was not especially friendly with anybody. Lassie was wholly concentrated on the trainers.\" Even though she sometimes mocked the show, she conceded: \"How wonderful that in a career there is one role for which you are known. Many actors work all their lives and never have one part that is really theirs.\" Read more from Sky News:BA pulls Louis Theroux podcast funding over Bob Vylan interviewCCTV images show last sightings of wanted asylum seeker In Lost In Space, Lockhart was part of a family that left Earth on a five-year flight to a faraway planet. After their mission was sabotaged by fellow passenger Dr Zachary Smith, the group went from planet to planet, encountering strange creatures and near-disasters where viewers needed to watch the following week to learn of the escape. Speaking fondly about working on Lost in Space, Lockhart said: \"It was like going to work at Disneyland every day.\" She was married and divorced twice: to John Maloney, a physician, father of her daughters Anne Kathleen and June Elizabeth; and architect John C Lindsay."
    },
    {
        "title": "British Airways pulls Louis Theroux podcast funding over Bob Vylan interview",
        "description": "British Airways (BA) has paused its sponsorship of The Louis Theroux Podcast following an interview with Bob Vylan's frontman.",
        "url": "https://news.sky.com/story/british-airways-pulls-louis-theroux-podcast-funding-over-bob-vylan-interview-13457331",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-louis-theroux-bob-vylan_7061640.jpg?20251025163303",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-25 15:17:00",
        "Headline": "The frontman of the controversial punk duo Bob Vylan was quizzed by Theroux after his IDF chant at Glastonbury caused uproar.",
        "Content": "British Airways (BA) has paused its sponsorship of The Louis Theroux Podcast following an interview with Bob Vylan's frontman. Pascal Robinson-Foster, one half of the controversial punk duo, told Theroux in an episode which aired earlier this week that he was \"not regretful\" of chanting \"death, death to the IDF [Israel Defence Forces]\" at this year's Glastonbury. He added that he would \"do it again tomorrow, twice on Sundays\". British Airways said on Saturday that the content \"breaches\" its sponsorship policy and has since paused its advertising on the podcast, the Jewish News first reported. An airline spokesperson said: \"Our sponsorship of the series has now been paused and the advert has been removed. \"We're grateful that this was brought to our attention, as the content clearly breaches our sponsorship policy in relation to politically sensitive or controversial subject matters. \"We and our third-party media agency have processes in place to ensure these issues don't occur and we're investigating how this happened.\" \n                  Bob Vylan on 'death, death to the IDF' chant: 'I'd do it again tomorrow, twice on Sundays'\n                 \n                  'I felt like a trespasser and imposter': Louis Theroux to be awarded prestigious NFTS fellowship\n                 \n                  Barry Keoghan hits back at 'disgusting' online attacks calling him an 'absent father'\n                 Following Bob Vylan's Glastonbury performance, the band were dropped by a number of festivals and performances including Radar festival, a show at a German music venue and their US tour after their visas were revoked. The comments were condemned by the US as a \"hateful tirade\" and \"appalling hate speech\" by British Prime Minister Sir Keir Starmer. The BBC's Executive Complaints Unit has since found the broadcast of Bob Vylan's set breached editorial standards related to harm and offence. The band have also had to reschedule dates of its upcoming We Won't Go Quietly UK tour in Manchester and Leeds after Jewish leaders and politicians called for the show to be postponed. In a statement on Facebook, the group said: \"Due to political pressure from the likes of Bridget Phillipson and groups in the Northwest of England we have had to reschedule our Leeds and Manchester shows. \"All tickets remain valid and all other shows are continuing as planned.\"  When asked by Theroux, Vylan said he was taken aback by the uproar the chant has caused, saying: \"It wasn't like we came off stage, and everybody was like [gasps]. It's just normal.\" He added that he wanted an end to \"the oppression that Palestinian people are facing\". Read more: Who are Bob Vylan? Despite the criticism, the group have seen support from fans, with their album Humble As The Sun re-entering the charts and climbing to number one in the UK Hip Hop and R&B album category. A spokesperson at Mindhouse Productions - which was founded by Theroux and produces The Louis Theroux Podcast - has not commented on the BA sponsorship, but told Sky News: \"Louis is a journalist with a long history of speaking to controversial figures who may divide opinion. \"We would suggest people watch or listen to the interview in its entirety to get the full context of the conversation.\""
    }
]