[
    {
        "title": "CIA chief says Iran nuclear site 'severely damaged' by US strikes - despite leaked report claiming the impact was minimal",
        "description": "The head of the CIA has said a \"body of credible intelligence\" indicates that Iran's nuclear programme was \"severely damaged\" by a US operation last weekend.",
        "url": "https://news.sky.com/story/cia-chief-says-iran-nuclear-site-severely-damaged-by-us-strikes-despite-leaked-report-claiming-the-impact-was-minimal-13388729",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-maxar-fordow_6947984.jpg?20250622130856",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-25 22:17:00",
        "Headline": "Donald Trump says Defence Secretary Pete Hegseth will be holding a \"major news conference\" on Thursday afternoon that will be \"interesting and irrefutable\".",
        "Content": " The head of the CIA has said a \"body of credible intelligence\" indicates that Iran's nuclear programme was \"severely damaged\" by a US operation last weekend. Director John Ratcliffe revealed that information from a \"historically reliable and accurate source\" suggests several key sites were destroyed - and will take years to rebuild. This contrasts with a recently leaked report from the US Defence Intelligence Agency that cast doubt on the effectiveness of Operation Midnight Hammer. An assessment obtained by several media outlets concluded that bombing of three nuclear facilities might only have set back Iran's capabilities by a few months. Follow the latest developments Donald Trump has refuted this leak in the strongest possible terms - describing it as \"fake news\" and insisting the military's targets were \"totally obliterated\". He added: \"This was a devastating attack, and it knocked them for a loop.\" \n                  Woman shot outside CIA headquarters after driving towards gates and refusing to stop\n                 \n                  CIA believes lab leak most likely caused COVID outbreak\n                 \n                  Malcolm X family brings $100m lawsuit against FBI, CIA and NYPD over 'conspiracy to assassinate' civil rights leader\n                 The US president went on to reveal that defence secretary Pete Hegseth will be holding a \"major news conference\" later today that will be \"interesting and irrefutable\". On Truth Social, he claimed that the \"Great American Pilots\" involved in the operation were \"very upset\" by the leaked report. \"After 36 hours of dangerously flying through Enemy Territory, they landed, they knew the Success was LEGENDARY, and then, two days later, they started reading Fake News by CNN and The Failing New York Times,\" he wrote. US correspondent The B-2 bombers have returned to their US base, but questions about the success of their airstrikes last weekend hang in the air. President Donald Trump is pushing back hard against a leaked preliminary intelligence report, suggesting the audacious bombing raid only set Iran's nuclear ambition back \"by months\". But Democrats say the president was claiming Iran's underground facilities had been \"obliterated\" long before any intelligence had been received. Read the full analysis from James Matthews here. The White House has highlighted an Israeli statement that suggested Tehran's nuclear efforts have now been delayed for a few years, with Iran's foreign ministry also confirming the facilities have suffered significant damage. But drawing reliable conclusions about the impact of the bunker buster bombs remains difficult - especially only days after they took place. Jeffrey Lewis, a professor of non-proliferation at the Middlebury Institute, said: \"If it's too early to know, why is Trump saying it's obliterated? Either it's too early to know, or you know.\" Read more:NATO chief refers to Trump as 'daddy'Why did US attack avoid some nuclear sites?Mapping the strikes in Israel and Iran  In other developments, Mr Trump has confirmed the US will be holding talks with Iran next week. However, he said he doesn't think an agreement to curtail its nuclear programme is needed, because Iran's facilities are now too badly damaged. \"They're not going to be doing it anyway. They've had it,\" he claimed.  A fragile ceasefire between Israel and Iran has held for a second day - with the skies over major cities quiet overnight. The president joined fellow world leaders at a NATO summit in The Hague yesterday, where members agreed to increase defence spending to 5% of GDP."
    },
    {
        "title": "The truth about the success of US airstrikes on Iran lies buried deep underground",
        "description": "The B-2 bombers have returned to their US base, but questions about the success of their airstrikes last weekend hang in the air.",
        "url": "https://news.sky.com/story/the-truth-about-the-success-of-us-airstrikes-on-iran-lies-buried-deep-underground-13388681",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-isfahan-iran-nuclear_6950788.jpg?20250625214829",
        "type": "Home",
        "Author": "David Blevins",
        "Date Published": "2025-06-25 20:42:00",
        "Headline": "Whether the military operation achieved its objectives has become a battle of political narratives in Congress. ",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  The B-2 bombers have returned to their US base, but questions about the success of their airstrikes last weekend hang in the air. President Donald Trump is pushing back hard against a leaked preliminary intelligence report, suggesting the audacious bombing raid only set Iran's nuclear ambition back \"by months\". \"It's destroyed… Iran will not have nuclear. We blew it up. It's blown to kingdom come,\" Mr Trump told a news conference. Read more: Iran and NATO summit latest updates A statement from CIA director John Ratcliffe backed that up. He said: \"[The] CIA can confirm that a body of credible intelligence indicates Iran's nuclear programme has been severely damaged by the recent, targeted strikes. \"This includes new intelligence from a historically reliable and accurate source/method that several key Iranian nuclear facilities were destroyed and would have to be rebuilt over the course of years.\"  But Democrats say the president was claiming Iran's underground facilities had been \"obliterated\" long before any intelligence had been received. Arizona senator Mark Kelly, who flew 39 combat missions in the first Gulf War, said: \"He's just saying that because he wants that to be the narrative. \"He said it the night of the strike, without any information, not even satellite imagery, and certainly without any information about what happened underneath 200 feet of rock and granite and dirt.\" \"The likelihood of something underground like that being obliterated is incredibly low,\" he added.  Senator Kelly blamed Mr Trump for Iran's enrichment growing from \"less than 4% to, public reporting, 60%\", accusing him of \"chucking the Obama deal out the window\". The leaking of the classified report from the Pentagon and subsequent debate has enraged US defence secretary Pete Hegseth. Read more:How much damage has been done to Iran's nuclear facilities?Why did the US attack on Iran avoid some nuclear sites? \"If you want to make an assessment of what happened at Fordow [nuclear site], you better get a big shovel and go really deep because Iran's nuclear programme is obliterated,\" Mr Hegseth said. \"Those that dropped the bombs precisely in the right place know exactly what happened when they exploded, and you know who else knows? Iran.\"  The White House is railing against what it calls the \"fake news media\" for reporting the content of the leaked report. But the success of a military operation has become a battle of political narratives in Congress. That will last longer than a 12-day war because the truth lies buried, quite literally, deep underground."
    },
    {
        "title": "Starmer's team ask Labour MPs to remove names from rebel amendment that could bring down welfare bill",
        "description": "Cabinet ministers have been asking Labour MPs to take their name off a rebel amendment to the government's controversial welfare bill, Sky News can reveal.",
        "url": "https://news.sky.com/story/revealed-the-frantic-phone-calls-starmers-team-are-making-to-stop-welfare-rebellion-that-could-defeat-him-13388488",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-starmer-prime-minister_6950634.jpg?20250625170908",
        "type": "Home",
        "Author": "Alexandra Rogers and Faye Brown, political reporters",
        "Date Published": "2025-06-25 13:51:00",
        "Headline": "Cabinet ministers have been calling Labour rebels unhappy with the government's welfare reforms ahead of a crunch vote next week. One MP says a cabinet minister warned them defeat will trigger a leadership contest.",
        "Content": "By Alexandra Rogers and Faye Brown, political reporters   Cabinet ministers have been asking Labour MPs to take their name off a rebel amendment to the government's controversial welfare bill, Sky News can reveal. In an attempt to quell the mounting rebellion of more than 100 MPs across all wings of the party, cabinet ministers were instructed to ring around the signatories of the amendment in a bid to get them to back the welfare cuts ahead of a planned vote next Tuesday. Politics latest: PM 'very confident' he'll remain Labour leader Two Labour MPs said they had been asked if they would take their names off the amendment, while one was asked if they would be prepared to abstain on the bill next week. One Labour MP said: \"'The more they tell people to take their names off, the more names are added on.\" Others were also told their actions could provoke a fresh leadership challenge and that they were aligning themselves with Nigel Farage in a bid to get them to back down. \"I had a conversation with a senior cabinet member yesterday who basically said if the government is defeated next week it will trigger a leadership contest,\" a Labour MP said. \n                  Inside the blame game as the welfare rebellion grows\n                 \n                  Sir Keir Starmer defiant over welfare cuts as Sir Sadiq Khan hits out at proposals\n                 \n                  What is Sir Keir Starmer's welfare bill and why is he facing a major Labour rebellion over it?\n                 \"I can see how that might be the case but I would argue if that's where we end up it's because the government have allowed that to happen. The ball is very much in their court. \"By and large the rebels do not want this to be about leadership. We just want to government to listen.\" Another added that while they had not received a call from a cabinet minister, they knew \"some colleagues are being told there will be a leadership challenge or a general election which is utter nonsense\", adding: \"Everything is all over the place.\" The amendment, if passed, would effectively kill the government's welfare reforms by failing to give it a second reading in the Commons. The most controversial elements of the government's welfare bill are changes to PIP and Universal Credit. PIP is money for people who have extra care needs or mobility needs as a result of a disability. People who claim it - some of whom are in work - are awarded points depending on their ability to do certain activities, such as washing and preparing food, and this influences how much they will receive. Under the plans, from November 2026, people will need to score a minimum of four points in at least one activity to qualify for the daily living element of PIP - instead of fewer points across a broader range of tasks the person needs help with. The changes do not affect the mobility component of PIP. And from April next year, the health element of Universal Credit will be frozen in cash terms for existing claimants at £97 per week until 2029/2030. For new claimants, the health element of Universal Credit will be reduced to £50 per week. \n\nHowever, ministers point to the fact that the Universal Credit standard allowance will increase from £92 per week in 2025-26 to £106 per week by 2029-30. Overall, 3.2 million families are expected to lose an average of £1,720 by the end of 2030 due to the changes.\n\nHowever, the government has stressed that these figures do not take into account the £1bn that is being put towards helping the long-term sick and disabled back into work.\n\n\n It calls for a delay to the £5bn package to assess the impact of cuts to personal independence payments (PIP) and expresses concerns about the government's own figures showing 250,000 people could be pushed into poverty - including 50,000 children. The fact the amendment was tabled by Dame Meg Hillier, chair of the Treasury select committee, with the support of 12 other select committee chairs, has alarmed Downing Street - as has the sheer scale of the rebellion. At least 123 Labour MPs have signed the public amendment, but Sky News understands more names are likely to appear in the coming days. While Sir Keir Starmer and his deputy, Angela Rayner, have insisted the vote will go ahead next Tuesday, the decision to instruct cabinet ministers to call around colleagues suggests the government is concerned about potentially losing the vote. 'The government is not listening' A Labour MP who signed the amendment said most rebels wanted the government to pause the proposals pending a proper consultation. They said the fact that the text of the bill had been published before the consultation had closed was proof the government was \"not listening\". Another MP said they had raised concerns that if constituents are moved from PIP to universal credit they could potentially exceed the benefits cap, which could disproportionally hit those living in cities where the cost of living is higher. Read more:Welfare versus warfare - the PM faces the hardest fight of his premiershipRayner refuses to repeat chancellor's tax pledge \"I can't look at my constituents and say I'm confident this won't negatively affect them,\" they said. The MP also criticised the government's approach to keeping MPs on side, saying it had failed to make the case for reform consistently. \"The engagement stopped after the initial flurry of bad press. Now there is a small amount of activity before the vote. Ministers need to be out there; the PM needs to be out there.\"  Despite the growing rebellion, the prime minister has indicated he is not willing to offer concessions on the government's welfare plans. Asked by reporters at the NATO summit in the Netherlands if he was willing to make changes to the bill, Sir Keir said: \"We have got to make the reforms to our system. It isn't working as it is. \"It doesn't work as it stands for people who desperately need help to get into work or for people who need protection. It is broken. \"We were elected in to change that which is broken, and that's what we will do, and that's why we will press ahead with reforms.\" Speaking to Sky News, armed forces minister Luke Pollard accepted rebels were \"not doing this to cause trouble or to be argumentative\" - but instead because they \"have a genuine, heartfelt concern about some of the impacts\". Downing Street has been contacted for comment."
    },
    {
        "title": "Hainault sword attacker Marcus Monzo found guilty of murdering boy, 14, and three attempted murders",
        "description": "A man has been found guilty of murdering a 14-year-old boy with a samurai sword as he walked to school in east London. ",
        "url": "https://news.sky.com/story/hainault-sword-attacker-marcus-monzo-found-guilty-of-murdering-boy-14-and-three-attempted-murders-13387288",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-marcus-monzo_6938346.jpg?20250610140156",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-25 04:00:00",
        "Headline": "Marcus Arduini Monzo, 37, nearly decapitated Daniel Anjorin and attacked five others during a 20-minute rampage in April last year.",
        "Content": " A man has been found guilty of murdering a 14-year-old boy with a samurai sword as he walked to school in east London.  Marcus Arduini Monzo, 37, nearly decapitated Daniel Anjorin and attacked five others during a 20-minute rampage in Hainault on 30 April last year. Prosecutors said he skinned and deboned his pet cat Wizard before trying \"to kill as many people as he could\" while under the influence of cannabis. Monzo, a Spanish-Brazilian national from Newham in east London, admitted two charges of possessing an offensive weapon relating to two swords, which he said he bought for display purposes. He claimed he had no memory of carrying out the attacks and denied Daniel's murder along with four charges of attempted murder, wounding with intent, aggravated burglary and possession of a bladed article. He was cleared of one count of attempted murder - instead found guilty of wounding with intent to cause grievous bodily harm - and convicted of all other charges following a trial at the Old Bailey. The court heard Monzo was a \"talented martial artist\" and the jury was shown footage of him unboxing a samurai sword on 4 April last year. In the four-minute video clip, he calls the weapon \"freaking sexy\" as he lunges towards the camera and makes different moves. The court was also shown CCTV footage from the morning of 30 April, with audible screams in one clip as Monzo drove his grey Ford Transit van at speed into pedestrian Donato Iwule.  Mr Iwule told jurors: \"I thought I was dying\" and \"I saw blood coming out of my neck\", after he was struck with a sword before running away. Witnesses described how Monzo was running around \"like a maniac\" and \"looked a bit mad, like there was nothing there\". Daniel, who had left home at around 7am wearing headphones and school sports clothes, suffered \"a near-decapitation\" when Monzo attacked him with the weapon from behind, prosecutor Tom Little KC told the jury. PC Yasmin Mechem-Whitfield chased the armed attacker through alleyways before Monzo struck her three times with the 60cm blade using \"extreme force\", the court heard. He then entered a nearby house through the back door and walked upstairs before attacking sleeping couple Sindy Arias and Henry De Los Rios Polania, who he asked: \"Do you believe in God?\" Mr Little said their lives were only spared because their four-year-old daughter, who was sleeping nearby, woke up and started to cry. Monzo, who had been cornered by police, also struck Inspector Moloy Campbell once with the sword before he was finally disarmed and arrested after trying to climb onto a garage to escape. Doorbell footage shows the moment officers shout: \"Don't move, don't f****** move\", after he was brought to the ground by three separate taser discharges. Monzo told police he had \"many personalities\", including a \"professional assassin\", and compared the events to The Hunger Games film franchise. He wept while giving evidence as he said he did not intend to harm anybody and told jurors he had no memory of what happened. He told how he had previously used psychedelic drugs and smoked cannabis \"three or four times a week\" before the attack, but denied doing so on the day. Prosecutors said he likely suffered from a psychotic disorder with \"schizophrenic-like symptoms\", including \"delusional beliefs\" that both he and his family were in \"mortal danger\". But Mr Little said his psychotic state was self-induced and did not meet the threshold for diminished responsibility."
    },
    {
        "title": "Hainault sword rampage survivor recalls moment attacker told him: 'I'm going to kill you'",
        "description": "A survivor of the Hainault samurai sword rampage has told Sky News of the moment that attacker Marcus Arduini Monzo looked him in the eye and said: \"I'm going to kill you\".",
        "url": "https://news.sky.com/story/hainault-sword-rampage-survivor-recalls-moment-attacker-told-him-im-going-to-kill-you-13388624",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donato-iwule-hainault_6950807.jpg?20250625221204",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-25 18:49:00",
        "Headline": "Donato Iwule, a young father, was hit by Marcus Arduini Monzo's van and then slashed in the neck during the 20-minute rampage.",
        "Content": " A survivor of the Hainault samurai sword rampage has told Sky News of the moment that attacker Marcus Arduini Monzo looked him in the eye and said: \"I'm going to kill you\". Donato Iwule recalled his \"escape from death\" after Monzo was found guilty on Wednesday of charges including one count of murder and three counts of attempted murder following the attack in east London on 30 April last year. Among the victims was 14-year-old schoolboy Daniel Anjorin, who died of his injuries. Mr Iwule was the first person to be attacked during the 20-minute rampage, which he described as being like a \"horror movie\". He was on his way to work when Monzo drove his grey Ford Transit van into him at speed. The attacker then leapt out of the vehicle and slashed the young father in the neck, before running off. Mr Iwule told Sky News correspondent Ashna Hurynag he remembered being \"on the floor\" for a short time after being hit and then looked up to see Monzo. \"I saw this guy and I went to him, I said: 'Are you okay?' He didn't talk to me. He was angry and said: 'I need to kill'. I was like 'Huh?' \"I said to him: 'Are you okay?' Then the next thing I saw was a samurai sword... I took a step back and said: 'What are you doing? Hello?' And he was like: 'I'm going to kill you, yeah, yeah'.\"  Mr Iwule said he then got to his feet and tried to move away as Monzo began swinging his sword around. \"He came again and that's when I turned my eye, to see where I am, in case there were two or three [other attackers]... I looked at my back for a split second and I saw out of the corner of my eye, he was trying to swing. So I, kind of, moved back and this way he caught me right in my neck. \"When he caught me, straight away I panicked for a couple of seconds.\" However, Mr Iwule said he recalled the words of his cousin, a doctor, about injuries, and used his thumb and jumpers to put pressure on the wound to stem the bleeding. He said hospital staff later told him he could have died in less than a minute due to the severity of his injuries. \"He thought that he won. But he didn't... I was supposed to be dead,\" he added. Mr Iwule said his life flashed before his eyes during the incident and he was left traumatised for months afterwards. \"I wasn't even going out, I was even scared to stay at my own house. I had to stay with my mum and have some sleepless nights because, for the past six to five months, I was reliving the same moment every single day,\" he said. Mr Iwule added he was \"relieved\" his attacker had now been convicted. Monzo, 37, will be sentenced on Friday."
    },
    {
        "title": "Harry Dunn's family say inquiry into Foreign Office's treatment of them will start within three weeks",
        "description": "The family of Harry Dunn have said the government is about to start an inquiry into how the Foreign Office treated them after the 19-year-old was killed. ",
        "url": "https://news.sky.com/story/harry-dunns-family-say-enquiry-into-foreign-offices-treatment-of-them-will-start-within-three-weeks-13388600",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-harry-dunn-anne-sacoolas_6264477.jpg?20230827094558",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-25 17:51:00",
        "Headline": "Motorbike rider Harry, 19, died after a head-on collision in 2019 with US spy Anne Sacoolas, who left the country with diplomatic immunity 19 days after the road accident. ",
        "Content": " The family of Harry Dunn have said the government is about to start an inquiry into how the Foreign Office treated them after the 19-year-old was killed.  Harry, who was riding a motorbike, died after a head-on collision in 2019 with a car driven by Anne Sacoolas, who was exiting the American intelligence base RAF Croughton in Northamptonshire. Sacoolas left the UK 19 days after the incident, as the US government had asserted diplomatic immunity on her behalf, claiming she was the wife of a diplomat. She was later revealed to be a US spy. The Dunn family began a long fight for justice, which eventually saw the former spy receive a suspended sentence after she pleaded guilty to causing Harry's death by dangerous driving. She was sentenced in an \"unprecedented\" case at the Old Bailey - but did not attend the hearing in person after American officials stepped in. Instead, she was sentenced via a video link from her lawyer's office in Washington. Speaking to Sky News, a lawyer who has advised the family since Harry's death has now said an inquiry promised by David Lammy when Labour got into power will begin \"within three weeks\". Radd Seiger told The News Hour with Mark Austin that the enquiry will be chaired by Dame Anne Owers, who is \"going to do a rapid piece of work\". \"We just want to leave a legacy for Harry, so what his family went through never happens again,\" he said. Harry's mother, Charlotte Charles, added: \"The failings need to be out there for all to see. \"Certainly for us to learn about and for everyone else to learn about, so we can make sure in future, families like us do not get treated the way that we were treated.\" It is understood that the investigation, which is expected to last three months, will not include scrutiny of the role or actions of the US government. The inquiry is separate from a recent report on how Northamptonshire Police proceeded in the case. The force last week apologised and admitted failures in their handling of the investigation, after the report found officers prioritised the suspect's welfare. Read more:Harry Dunn killer apologiesCriticism over lack of driver training at US base  Assistant Chief Constable Emma James apologised \"for what is now clear was a failure on our part to do the very best for the victim in this case, Harry, and his family who fought tirelessly in the years that followed to achieve justice for him\". She added in a statement: \"The picture which emerges is one of a force which has failed the family on a number of fronts.\" The Dunn family have filed a complaint against the force's former police chief over the report."
    },
    {
        "title": "Robert Bush: Funeral director in court after investigation into remains found at his premises",
        "description": "A funeral director has appeared in court charged with 63 offences, spanning more than a decade, after a major investigation into human remains found at his premises.",
        "url": "https://news.sky.com/story/robert-bush-funeral-director-in-court-after-investigation-into-remains-found-at-his-premises-13388570",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-robert-bush-court-hull_6950292.jpg?20250625115818",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-25 16:30:00",
        "Headline": "Humberside Police launched its investigation into Legacy Independent Funeral Directors in March last year.",
        "Content": "A funeral director has appeared in court charged with 63 offences, spanning more than a decade, after a major investigation into human remains found at his premises. Robert Bush, 47, faces 30 counts of preventing a lawful burial and 30 counts of fraud by false representation, relating to bodies found at the Legacy Independent Funeral Directors site on Hessle Road in Hull, in March last year. Those charges date from between April 2023 and March 2024. He has also been charged with one count of fraudulent trading in relation to funeral plans and one count of fraud by false representation in relation to human ashes. These charges are between May 2012 and March 2024, and August 2017 and March 2024, respectively. The 47-year-old is also accused of theft from 12 charities: the Salvation Army, Macmillan Cancer Support, CHIEF, the Dogs Trust, Dove House, Help for Heroes, Maister Lodge, Oakwood Dog Rescue, RNLI, Sailors Children's Charity, WISHH and Hull Fishing Heritage Charity. Bush, formerly of Kirk Ella, East Yorkshire, but now of Otley, West Yorkshire, attended a five-minute hearing at Hull Magistrates' Court on Tuesday, where he spoke only to confirm his name, date of birth, and address. He was not asked to indicate any pleas as the charges and names of 30 alleged victims were read out. Bush was told 30 of the charges could only be dealt with at a crown court, and his case was adjourned until 13 August, when he will appear at Hull Crown Court. He was bailed with conditions to attend a local police station every day from Monday to Friday. The charges of fraud - relating to named victims - allege that Bush falsely claimed: • He would \"properly care for the remains of the deceased in accordance with the normal expected practices of a competent funeral director\" • Bush would \"arrange for the cremation of those remains to take place immediately or soon after the conclusion of the funeral service\" • And he would ensure \"the ashes presented to the customer were the remains of the deceased person after cremation\". Humberside Police launched its investigation into Legacy Independent Funeral Directors across three premises in Hull and East Yorkshire in March last year."
    },
    {
        "title": "More than a dozen people killed in Kenya during anti-government protests, human rights group says",
        "description": "Sixteen people have died and hundreds of others have been injured in nationwide anti-government protests in Kenya, a human rights charity has said.",
        "url": "https://news.sky.com/story/more-than-a-dozen-people-killed-in-kenya-as-anti-government-protests-turn-deadly-13388657",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nairobi-kenya_6950793.jpg?20250625215530",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-25 19:34:00",
        "Headline": "Thousands of Kenyans took to the streets on Wednesday to commemorate last year's demonstrations, in which more than 60 people died. ",
        "Content": "Sixteen people have died and hundreds of others have been injured in nationwide anti-government protests in Kenya, a human rights charity has said. It comes a year after deadly demonstrations against a tax bill resulted in the storming of parliament. Most were killed by police, the head of Amnesty Kenya said. Thousands of Kenyans took to the streets on Wednesday to commemorate last year's protests, in which more than 60 people died. Police used water cannons and fired tear gas to disperse demonstrations in Nairobi. Amnesty Kenya's executive director Irungu Houghton told Reuters that 16 people had been \"verified as dead\". \"Most were killed by police,\" he added, saying at least five people had been shot dead. Mr Houghton said the number of deaths had been verified by the global rights watchdog and the Kenya National Commission on Human Rights (KNCHR). In a statement posted on X, the government-funded KNCHR earlier said eight deaths had been reported from across Kenya, all \"allegedly from gunshot wounds\". \"Over 400 casualties have been reported, including demonstrators, police officers and journalists,\" it said. The watchdog noted heavy police deployment and \"allegations of excessive use of force, including rubber bullets, live ammunition and water cannons, resulting in numerous injuries\". Kenyan police spokesperson Muchiri Nyaga declined to comment on the statements. An official at the capital's main Kenyatta National Hospital said it had admitted 107 injured people, \"most with gunshot wounds\" from either rubber bullets or live rounds. Large crowds were seen heading in the direction of the president's official residence in Nairobi, which had been barricaded with razor wire. The scenes were broadcast by Kenyan channel NTV before it and another were pulled off air after defying an order to stop showing the demonstrations live. Isolated clashes were reported in the port city of Mombasa by NTV, with protests also taking place in towns including Kitengela, Kisii, Matuu and Nyeri. The Independent Policing Oversight Authority, a state-funded body, said in a statement that at least 61 people were arrested during the protests. More from Sky News:NATO chief refers to Trump as 'daddy'New reward to find British backpacker's remains Protests in June 2024 saw demonstrators shot dead and fires started inside the Kenyan parliament after politicians voted in favour of a controversial tax bill. Protests faded after President William Ruto withdrew the bill, but public anger has remained over police brutality and the rising cost of living."
    },
    {
        "title": " EU warns Europe must start building 'millions of drones' to defend itself against possible Russian attacks",
        "description": "The EU's defence commissioner has warned Europe must be capable of building a drone army in case Russia attacks.",
        "url": "https://news.sky.com/story/eu-warns-europe-must-start-building-millions-of-drones-to-defend-itself-against-possible-russian-attacks-13388472",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ukrainian-fighter-lyman_6948596.jpg?20250623121404",
        "type": "Home",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-06-25 13:32:00",
        "Headline": "EU defence commissioner Andrius Kubilius says Europeans will require millions of drones to create an \"army\" and they need to start preparing now.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  The EU's defence commissioner has warned Europe must be capable of building a drone army in case Russia attacks. Military intelligence has suggested Russian forces could be ready to strike a NATO country within the next five years. In order to defend themselves, Andrius Kubilius says Europeans will require millions of drones and need to start preparing now. \"Russia can have around five million drones, so we need to have capacities bigger than those in order to prevail,\" he told Sky News, warning that if President Putin ordered an attack, the target would face a \"battle-tested\" Russian army with the ability to use millions of drones\". The 2022 invasion of Ukraine sparked a revolution in drone warfare. Facing one of the world's strongest militaries, the Ukrainians used the cheap, adaptable technology to their advantage. It estimates its drone units are now responsible for 80% of Russian frontline losses. \n                  Why is the UK buying nuclear-carrying fighter jets?\n                 \n                  More Britons than ever struggling to make ends meet, report warns\n                 \n                  UK to buy F-35 stealth jets that can carry US nuclear warheads\n                 Mr Kubilius has visited Ukraine to learn the lessons from the battlefield. Along the 1200km (745 miles) front line is an area nicknamed \"Death Valley\". \"Nothing can move. Everything is controlled by drones. A traditional tank in that zone survives six minutes,\" he explained. This year, Ukraine's expected to produce more than four million drones. Contemplating how many units other countries would need, the commissioner used the example of his home country of Lithuania. The former Soviet republic shares a border of around 900km (559 miles) with Russia and Belarus. \"If Ukrainians need four million for 1200km, we need something like three million drones for one year if the war is starting, if 'Day X' is coming,\" he said. To try to stay ahead in the fight, both Russia and Ukraine are constantly updating their drone technology. For this reason, the commissioner believes that rather than stockpiling drones now, which will go out of date, Europe should instead build up teams of pilots, engineers, and producers ready to scale up production should the time come. \"On the European continent, at the moment, there are only two armies battle-tested with the ability to use millions of drones: one is Russian, which is planning new aggressions; another one is Ukrainian,\" said Mr Kubilius. \"We need to learn a lot from Ukraine... how to organise defences against millions of drones, and also how to make your defence industry innovative,\" he added. It's a point many in the business agree with. German start-up STARK has been testing loitering munitions or \"attack drones\" ready to supply to Kyiv. \"It's all made for easy handling for soldiers, so you don't have to use any tools on the front line, and you just plug in the rudders,\" said STARK's senior vice president, Josef Kranawetvogl, as he quickly clicked the unit's tail together. He spent 18 years in the German military before making the jump to weapons production. He says staying ahead of the enemy requires tactics and technology to be frequently updated. \"Every day you have to adapt. You have such fast development cycles in Ukraine - two or three weeks, then there's something new upcoming and you have to be prepared for this.\" Since the start of June, Russia has repeatedly used drone swarms to attack Ukraine. It involves hundreds of drones hammering cities in one night. I asked Josef whether he believes NATO's European members are ready to defend against such an attack. \"I see quite a lot of European armies starting right now to develop or to purchase unmanned systems, and it's a good development, but it's all about time. How can we speed up?\" he replied. Close to the border with France, another German start-up, Alpine Eagle, is testing defence drone units for Ukraine. \"This is our interceptor drone,\" explained the company's CEO, Jan-Hendrik Boelens, holding up a prototype which looks a bit like a small black plane. The interceptor is carried underneath a large grey drone. On-board radar means it can be fired at enemy drones up to 5km (3 miles) away. Jan thinks that could be a game changer in an aerial battle as it means hostile units could be picked off before they get close. And he believes NATO is unprepared if one of its countries was to be hit by a wave of drones like those in Ukraine. \"We are absolutely not ready in my view,\" he said. He explained that Ukraine produced around 1.3 million drones a year last year. \"I would be surprised if NATO even bought a thousand drones last year. I think Germany procured, I don't know, 100, maybe 200. So now you do the math on what that means and how quickly you run out of drones. \"If Ukraine consumed 1.3 million drones per year, that's 3,000 a day. So, if you have 100 in your inventory, that would not last an hour.\" A spokesperson from the German Defence Ministry said the numbers stated \"do not closely reflect reality\". \"Drones are now part of everyday life for soldiers, they are omnipresent and are used extensively in service operations and training,\" they added. Drones are a key part of NATO's defence plan. The alliance's leadership has repeatedly said producing, procuring, and protecting against drones is a priority. At the NATO summit, members agreed to boost defence spending to 5% of gross domestic product (GDP) by 2035. In addition to increasing training and development, NATO Chief Mark Rutte has said he wants more investment in drone technology as well as boosting air defences fivefold. \"We see Russia's deadly terror from the skies over Ukraine every day, and we must be able to defend ourselves from such attacks,\" he told an audience at the summit. Lessons from Ukraine have prompted members to embrace unmanned technology in various ways. Britain is one of the countries pledging to put drones front and centre of its new defence plan. Earlier this month, the government's Strategic Defence Review outlined a new way forward for British Army warfighting based around a drone-centric 20-40-40 strategy where uncrewed systems are deployed for first wave attacks, before tanks, attack helicopters and other manned platforms arrive on the battlefield. In essence, the new weapons mix would be 20% traditional heavy platforms (like tanks), 40% single-use expendable drones and munitions, and the remaining 40% reusable, high-end drones. It's been confirmed that an extra £2bn will be spent on army drones this parliament. Defence Secretary John Healey said Britain's adversaries were working more in alliance and technology was changing how war was fought. \"Drones now kill more people than traditional artillery in the war in Ukraine and whoever gets new technology into the hands of their armed forces the quickest will win,\" he said. This week, the prime minister announced a deal with Ukraine to co-produce drones. Germany and Denmark have made similar agreements with the German Ministry of Defence, telling Sky News that drones are a top priority. In a drone showroom in central Berlin, we meet Sven Weizenegger, head of the German military's cyber innovation hub. He said they have noticed a boom in pitches from potential suppliers. Every day, his department receives up to 20 enquiries from companies asking how their products could be used by the military. He believes things need to move more quickly so soldiers get weapons faster. \"We are very advanced in the innovation process. That means we have a lot of ideas and many companies that are ready to deliver,\" he explained. \"Unfortunately, what we are not good at right now, due to our current processes, is getting these things into real operations, into frontline use. We need to fix that.\" Germany has promised to turbo-charge defence spending, with the Chancellor pledging to create the \"strongest conventional army in Europe\". Plans announced this week include boosting unmanned systems and air defences. Read more:NATO chief calls for 400% increase in air and missile defencePutin humiliated by Ukrainian drone attackUkrainian drone attack puts Russians and the world on notice The German Ministry of Defence said it couldn't reveal stock levels due to security, but a spokesperson confirmed the country is investing in a range of different units, including signing two contracts for attack drones. \"We are procuring not just a few but quite large quantities and testing them directly with the troops,\" the spokesperson added. However, they agreed with the EU defence commissioner that rather than stockpiling tech which would go out of date, it was better to have a system in place to allow for large quantities to be made quickly in the event of war. In May, the EU approved a €150bn (£125bn) loan scheme to boost defence production across the bloc."
    },
    {
        "title": "Hainault sword attacker Marcus Monzo found guilty of murdering boy, 14, and three attempted murders",
        "description": "A man has been found guilty of murdering a 14-year-old boy with a samurai sword as he walked to school in east London. ",
        "url": "https://news.sky.com/story/hainault-sword-attacker-marcus-monzo-found-guilty-of-murdering-boy-14-and-three-attempted-murders-13387288",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-marcus-monzo_6938346.jpg?20250610140156",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-25 04:00:00",
        "Headline": "Marcus Arduini Monzo, 37, nearly decapitated Daniel Anjorin and attacked five others during a 20-minute rampage in April last year.",
        "Content": " A man has been found guilty of murdering a 14-year-old boy with a samurai sword as he walked to school in east London.  Marcus Arduini Monzo, 37, nearly decapitated Daniel Anjorin and attacked five others during a 20-minute rampage in Hainault on 30 April last year. Prosecutors said he skinned and deboned his pet cat Wizard before trying \"to kill as many people as he could\" while under the influence of cannabis. Monzo, a Spanish-Brazilian national from Newham in east London, admitted two charges of possessing an offensive weapon relating to two swords, which he said he bought for display purposes. He claimed he had no memory of carrying out the attacks and denied Daniel's murder along with four charges of attempted murder, wounding with intent, aggravated burglary and possession of a bladed article. He was cleared of one count of attempted murder - instead found guilty of wounding with intent to cause grievous bodily harm - and convicted of all other charges following a trial at the Old Bailey. The court heard Monzo was a \"talented martial artist\" and the jury was shown footage of him unboxing a samurai sword on 4 April last year. In the four-minute video clip, he calls the weapon \"freaking sexy\" as he lunges towards the camera and makes different moves. The court was also shown CCTV footage from the morning of 30 April, with audible screams in one clip as Monzo drove his grey Ford Transit van at speed into pedestrian Donato Iwule.  Mr Iwule told jurors: \"I thought I was dying\" and \"I saw blood coming out of my neck\", after he was struck with a sword before running away. Witnesses described how Monzo was running around \"like a maniac\" and \"looked a bit mad, like there was nothing there\". Daniel, who had left home at around 7am wearing headphones and school sports clothes, suffered \"a near-decapitation\" when Monzo attacked him with the weapon from behind, prosecutor Tom Little KC told the jury. PC Yasmin Mechem-Whitfield chased the armed attacker through alleyways before Monzo struck her three times with the 60cm blade using \"extreme force\", the court heard. He then entered a nearby house through the back door and walked upstairs before attacking sleeping couple Sindy Arias and Henry De Los Rios Polania, who he asked: \"Do you believe in God?\" Mr Little said their lives were only spared because their four-year-old daughter, who was sleeping nearby, woke up and started to cry. Monzo, who had been cornered by police, also struck Inspector Moloy Campbell once with the sword before he was finally disarmed and arrested after trying to climb onto a garage to escape. Doorbell footage shows the moment officers shout: \"Don't move, don't f****** move\", after he was brought to the ground by three separate taser discharges. Monzo told police he had \"many personalities\", including a \"professional assassin\", and compared the events to The Hunger Games film franchise. He wept while giving evidence as he said he did not intend to harm anybody and told jurors he had no memory of what happened. He told how he had previously used psychedelic drugs and smoked cannabis \"three or four times a week\" before the attack, but denied doing so on the day. Prosecutors said he likely suffered from a psychotic disorder with \"schizophrenic-like symptoms\", including \"delusional beliefs\" that both he and his family were in \"mortal danger\". But Mr Little said his psychotic state was self-induced and did not meet the threshold for diminished responsibility."
    },
    {
        "title": "Hainault sword rampage survivor recalls moment attacker told him: 'I'm going to kill you'",
        "description": "A survivor of the Hainault samurai sword rampage has told Sky News of the moment that attacker Marcus Arduini Monzo looked him in the eye and said: \"I'm going to kill you\".",
        "url": "https://news.sky.com/story/hainault-sword-rampage-survivor-recalls-moment-attacker-told-him-im-going-to-kill-you-13388624",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donato-iwule-hainault_6950807.jpg?20250625221204",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-25 18:49:00",
        "Headline": "Donato Iwule, a young father, was hit by Marcus Arduini Monzo's van and then slashed in the neck during the 20-minute rampage.",
        "Content": " A survivor of the Hainault samurai sword rampage has told Sky News of the moment that attacker Marcus Arduini Monzo looked him in the eye and said: \"I'm going to kill you\". Donato Iwule recalled his \"escape from death\" after Monzo was found guilty on Wednesday of charges including one count of murder and three counts of attempted murder following the attack in east London on 30 April last year. Among the victims was 14-year-old schoolboy Daniel Anjorin, who died of his injuries. Mr Iwule was the first person to be attacked during the 20-minute rampage, which he described as being like a \"horror movie\". He was on his way to work when Monzo drove his grey Ford Transit van into him at speed. The attacker then leapt out of the vehicle and slashed the young father in the neck, before running off. Mr Iwule told Sky News correspondent Ashna Hurynag he remembered being \"on the floor\" for a short time after being hit and then looked up to see Monzo. \"I saw this guy and I went to him, I said: 'Are you okay?' He didn't talk to me. He was angry and said: 'I need to kill'. I was like 'Huh?' \"I said to him: 'Are you okay?' Then the next thing I saw was a samurai sword... I took a step back and said: 'What are you doing? Hello?' And he was like: 'I'm going to kill you, yeah, yeah'.\"  Mr Iwule said he then got to his feet and tried to move away as Monzo began swinging his sword around. \"He came again and that's when I turned my eye, to see where I am, in case there were two or three [other attackers]... I looked at my back for a split second and I saw out of the corner of my eye, he was trying to swing. So I, kind of, moved back and this way he caught me right in my neck. \"When he caught me, straight away I panicked for a couple of seconds.\" However, Mr Iwule said he recalled the words of his cousin, a doctor, about injuries, and used his thumb and jumpers to put pressure on the wound to stem the bleeding. He said hospital staff later told him he could have died in less than a minute due to the severity of his injuries. \"He thought that he won. But he didn't... I was supposed to be dead,\" he added. Mr Iwule said his life flashed before his eyes during the incident and he was left traumatised for months afterwards. \"I wasn't even going out, I was even scared to stay at my own house. I had to stay with my mum and have some sleepless nights because, for the past six to five months, I was reliving the same moment every single day,\" he said. Mr Iwule added he was \"relieved\" his attacker had now been convicted. Monzo, 37, will be sentenced on Friday."
    },
    {
        "title": "Starmer's team ask Labour MPs to remove names from rebel amendment that could bring down welfare bill",
        "description": "Cabinet ministers have been asking Labour MPs to take their name off a rebel amendment to the government's controversial welfare bill, Sky News can reveal.",
        "url": "https://news.sky.com/story/revealed-the-frantic-phone-calls-starmers-team-are-making-to-stop-welfare-rebellion-that-could-defeat-him-13388488",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-starmer-prime-minister_6950634.jpg?20250625170908",
        "type": "UK",
        "Author": "Alexandra Rogers and Faye Brown, political reporters",
        "Date Published": "2025-06-25 13:51:00",
        "Headline": "Cabinet ministers have been calling Labour rebels unhappy with the government's welfare reforms ahead of a crunch vote next week. One MP says a cabinet minister warned them defeat will trigger a leadership contest.",
        "Content": "By Alexandra Rogers and Faye Brown, political reporters   Cabinet ministers have been asking Labour MPs to take their name off a rebel amendment to the government's controversial welfare bill, Sky News can reveal. In an attempt to quell the mounting rebellion of more than 100 MPs across all wings of the party, cabinet ministers were instructed to ring around the signatories of the amendment in a bid to get them to back the welfare cuts ahead of a planned vote next Tuesday. Politics latest: PM 'very confident' he'll remain Labour leader Two Labour MPs said they had been asked if they would take their names off the amendment, while one was asked if they would be prepared to abstain on the bill next week. One Labour MP said: \"'The more they tell people to take their names off, the more names are added on.\" Others were also told their actions could provoke a fresh leadership challenge and that they were aligning themselves with Nigel Farage in a bid to get them to back down. \"I had a conversation with a senior cabinet member yesterday who basically said if the government is defeated next week it will trigger a leadership contest,\" a Labour MP said. \n                  Inside the blame game as the welfare rebellion grows\n                 \n                  Sir Keir Starmer defiant over welfare cuts as Sir Sadiq Khan hits out at proposals\n                 \n                  What is Sir Keir Starmer's welfare bill and why is he facing a major Labour rebellion over it?\n                 \"I can see how that might be the case but I would argue if that's where we end up it's because the government have allowed that to happen. The ball is very much in their court. \"By and large the rebels do not want this to be about leadership. We just want to government to listen.\" Another added that while they had not received a call from a cabinet minister, they knew \"some colleagues are being told there will be a leadership challenge or a general election which is utter nonsense\", adding: \"Everything is all over the place.\" The amendment, if passed, would effectively kill the government's welfare reforms by failing to give it a second reading in the Commons. The most controversial elements of the government's welfare bill are changes to PIP and Universal Credit. PIP is money for people who have extra care needs or mobility needs as a result of a disability. People who claim it - some of whom are in work - are awarded points depending on their ability to do certain activities, such as washing and preparing food, and this influences how much they will receive. Under the plans, from November 2026, people will need to score a minimum of four points in at least one activity to qualify for the daily living element of PIP - instead of fewer points across a broader range of tasks the person needs help with. The changes do not affect the mobility component of PIP. And from April next year, the health element of Universal Credit will be frozen in cash terms for existing claimants at £97 per week until 2029/2030. For new claimants, the health element of Universal Credit will be reduced to £50 per week. \n\nHowever, ministers point to the fact that the Universal Credit standard allowance will increase from £92 per week in 2025-26 to £106 per week by 2029-30. Overall, 3.2 million families are expected to lose an average of £1,720 by the end of 2030 due to the changes.\n\nHowever, the government has stressed that these figures do not take into account the £1bn that is being put towards helping the long-term sick and disabled back into work.\n\n\n It calls for a delay to the £5bn package to assess the impact of cuts to personal independence payments (PIP) and expresses concerns about the government's own figures showing 250,000 people could be pushed into poverty - including 50,000 children. The fact the amendment was tabled by Dame Meg Hillier, chair of the Treasury select committee, with the support of 12 other select committee chairs, has alarmed Downing Street - as has the sheer scale of the rebellion. At least 123 Labour MPs have signed the public amendment, but Sky News understands more names are likely to appear in the coming days. While Sir Keir Starmer and his deputy, Angela Rayner, have insisted the vote will go ahead next Tuesday, the decision to instruct cabinet ministers to call around colleagues suggests the government is concerned about potentially losing the vote. 'The government is not listening' A Labour MP who signed the amendment said most rebels wanted the government to pause the proposals pending a proper consultation. They said the fact that the text of the bill had been published before the consultation had closed was proof the government was \"not listening\". Another MP said they had raised concerns that if constituents are moved from PIP to universal credit they could potentially exceed the benefits cap, which could disproportionally hit those living in cities where the cost of living is higher. Read more:Welfare versus warfare - the PM faces the hardest fight of his premiershipRayner refuses to repeat chancellor's tax pledge \"I can't look at my constituents and say I'm confident this won't negatively affect them,\" they said. The MP also criticised the government's approach to keeping MPs on side, saying it had failed to make the case for reform consistently. \"The engagement stopped after the initial flurry of bad press. Now there is a small amount of activity before the vote. Ministers need to be out there; the PM needs to be out there.\"  Despite the growing rebellion, the prime minister has indicated he is not willing to offer concessions on the government's welfare plans. Asked by reporters at the NATO summit in the Netherlands if he was willing to make changes to the bill, Sir Keir said: \"We have got to make the reforms to our system. It isn't working as it is. \"It doesn't work as it stands for people who desperately need help to get into work or for people who need protection. It is broken. \"We were elected in to change that which is broken, and that's what we will do, and that's why we will press ahead with reforms.\" Speaking to Sky News, armed forces minister Luke Pollard accepted rebels were \"not doing this to cause trouble or to be argumentative\" - but instead because they \"have a genuine, heartfelt concern about some of the impacts\". Downing Street has been contacted for comment."
    },
    {
        "title": "Shell denies report of BP takeover talks",
        "description": "Shell has denied it is in talks with BP over a possible takeover of its smaller rival.",
        "url": "https://news.sky.com/story/bp-shares-soar-on-report-of-shell-takeover-talks-13388562",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-shell-bp_6950660.jpg?20250625175327",
        "type": "UK",
        "Author": "James Sillars",
        "Date Published": "2025-06-25 15:56:00",
        "Headline": "A tie-up has long been the subject of speculation, but Shell insists its focus is on delivering shareholder value through its own operational performance.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Shell has denied it is in talks with BP over a possible takeover of its smaller rival. The Wall Street Journal, citing a number of sources, reported on Wednesday evening that discussions between the two UK-based energy firms were at an early, but active, stage. The US publication added that BP was considering the approach. Money latest: Prize fund rate for Premium Bonds lowered Its story was published soon after the London Stock Exchange had closed for the day, but US-listed depository shares in BP were 10% up in New York shortly after publication, while those for Shell were down. However, Shell responded to the story by telling Sky News: \"This is further market speculation. No talks are taking place. \"As we have said many times before, we are sharply focused on capturing the value of Shell through continuing to focus on performance, discipline and simplification.\" The rally for BP shares fell back in the wake of the statement. BP declined to comment. The company has been widely seen as a possible takeover target for years, as its market value has lagged behind the growth of industry peers. It was valued at nearly £59bn as of Wednesday, while Shell had a market capitalisation of over £153bn. Read more from Sky News:Briton charged after 'mock wedding' with nine-year-oldGuests descend on Venice for Jeff Bezos wedding The gulf between them has widened since 2020, when BP, under the then-chief executive Bernard Looney, embarked on a fundamental shift towards a green energy future. The lofty ambitions were slowly chipped away following record leaps in oil and natural gas costs in the wake of Russia's invasion of Ukraine. Much of the strategy was overturned in a reset by current boss Murray Auchincloss in February this year, under pressure from shareholders. BP's debt pile has been seen as a potential barrier to takeover interest."
    },
    {
        "title": "Robert Bush: Funeral director in court after investigation into remains found at his premises",
        "description": "A funeral director has appeared in court charged with 63 offences, spanning more than a decade, after a major investigation into human remains found at his premises.",
        "url": "https://news.sky.com/story/robert-bush-funeral-director-in-court-after-investigation-into-remains-found-at-his-premises-13388570",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-robert-bush-court-hull_6950292.jpg?20250625115818",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-25 16:30:00",
        "Headline": "Humberside Police launched its investigation into Legacy Independent Funeral Directors in March last year.",
        "Content": "A funeral director has appeared in court charged with 63 offences, spanning more than a decade, after a major investigation into human remains found at his premises. Robert Bush, 47, faces 30 counts of preventing a lawful burial and 30 counts of fraud by false representation, relating to bodies found at the Legacy Independent Funeral Directors site on Hessle Road in Hull, in March last year. Those charges date from between April 2023 and March 2024. He has also been charged with one count of fraudulent trading in relation to funeral plans and one count of fraud by false representation in relation to human ashes. These charges are between May 2012 and March 2024, and August 2017 and March 2024, respectively. The 47-year-old is also accused of theft from 12 charities: the Salvation Army, Macmillan Cancer Support, CHIEF, the Dogs Trust, Dove House, Help for Heroes, Maister Lodge, Oakwood Dog Rescue, RNLI, Sailors Children's Charity, WISHH and Hull Fishing Heritage Charity. Bush, formerly of Kirk Ella, East Yorkshire, but now of Otley, West Yorkshire, attended a five-minute hearing at Hull Magistrates' Court on Tuesday, where he spoke only to confirm his name, date of birth, and address. He was not asked to indicate any pleas as the charges and names of 30 alleged victims were read out. Bush was told 30 of the charges could only be dealt with at a crown court, and his case was adjourned until 13 August, when he will appear at Hull Crown Court. He was bailed with conditions to attend a local police station every day from Monday to Friday. The charges of fraud - relating to named victims - allege that Bush falsely claimed: • He would \"properly care for the remains of the deceased in accordance with the normal expected practices of a competent funeral director\" • Bush would \"arrange for the cremation of those remains to take place immediately or soon after the conclusion of the funeral service\" • And he would ensure \"the ashes presented to the customer were the remains of the deceased person after cremation\". Humberside Police launched its investigation into Legacy Independent Funeral Directors across three premises in Hull and East Yorkshire in March last year."
    },
    {
        "title": "Trade strategy aims to boost UK firms amid Trump tariff chaos",
        "description": "Plans to better protect vital UK industries and help businesses export have been revealed by the government, as the world continues to grapple with the effects of Donald Trump's trade war.",
        "url": "https://news.sky.com/story/trade-strategy-aims-to-boost-uk-firms-amid-trump-tariff-chaos-13388437",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-port-tariffs-container-ship_6910922.jpg?20250625204642",
        "type": "UK",
        "Author": "James Sillars",
        "Date Published": "2025-06-25 12:31:00",
        "Headline": "The government says its plans, designed to bolster its growth priorities, will make the UK the \"most connected nation in the world\" as Donald Trump's trade war continues to shake up the global order.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Plans to better protect vital UK industries and help businesses export have been revealed by the government, as the world continues to grapple with the effects of Donald Trump's trade war. A trade strategy, to be published on Thursday, aims to make the UK the best-connected country to do business, aided by looser regulation and increased access to finance. It forms part of the government's efforts to get business back on side after the backlash which followed the tax-raising budget and its \"plan for change\" to boost meagre economic growth. The plan follows hot on the heels of a trade deal which spares the UK from some of the US president's most punitive duties, and a more wide-ranging agreement with India. Money latest: Prize fund rate for Premium Bonds lowered The strategy - the first since Brexit - also aims to capitalise on a relaxation in some EU rules on trade, and the separate industrial strategy outlined earlier this week that will give energy-intensive businesses help in bolstering their competitiveness through cuts to their bills. Jonathan Reynolds, the business and trade secretary, said: \"The UK is an open trading nation but we must reconcile this with a new geopolitical reality and work in our own national interest. \n                  Shell denies report of BP takeover talks\n                 \n                  More Britons than ever struggling to make ends meet, report warns\n                 \n                  Money blog: Prize fund rate for Premium Bonds lowered\n                 \"Our Trade Strategy will sharpen our trade defence so we can ensure British businesses are protected from harm, while also relentlessly pursuing every opportunity to sell to more markets under better terms than before.\"  The department said that the capacity of UK Export Finance, the UK's export credit agency, was to be expanded by £20bn and funding would also be set aside to tackle complex regulatory issues and remove obstacles for exporters. The US trade war provides both opportunities and threats to UK firms. The steel sector is to be consulted on what new protections can be put in place from June 2026 once current safeguards, covering things like cheap Chinese imports, are due to expire. The trade and industrial strategies have been revealed at a time of crisis for both steel and chemicals linked to high costs.  British Steel is now under the control of the UK government in a bid to protect the country's ability to produce so-called virgin steel following the closures of the blast furnaces at Tata's Port Talbot works. It was announced on Wednesday that Saudi firm Sabic was to shut its Olefins 6 ethylene plant at Wilton on Teesside, leaving more than 300 jobs at risk. Like British Steel's owner Jingye, Sabic has blamed high energy bills. Eliminating some of those costs, under the industrial strategy plans, would not kick in until 2026 at the earliest. At the same time, Associated British Foods (ABF) is to make a decision on Thursday on whether to shut the UK's largest bioethanol plant in Hull. ABF has complained that the Vivergo Fuels factory has had the rug pulled from under it by the UK government as its recent trade deal with the US allows subsidised US ethanol into the country. A second UK bioethanol plant, owned by Ensus, is at risk of closure on Teesside. The steel industry lobby group said the trade strategy would build on work in the industrial strategy to provide a more stable platform for the sector. UK Steel's director general Gareth Stace, said: \"For too long, the government has been hamstrung by self-imposed rules that allow bad actors to take advantage of our open market. \"This has enabled state-subsidised steel to rip market share away from domestic producers, at the cost of thousands of good jobs in some of the most economically vulnerable regions in the country, and fracturing manufacturing supply chains, making us more reliant on imports. \"We need swift and decisive action to build a trade defence regime that is fit for purpose and in place before current safeguards expire in 2026. \"With the right tools and the political will to use them, the UK can reassert control over its steel market, protect skilled jobs, and give investors the confidence that the UK steel sector has a strong and sustainable future.\""
    },
    {
        "title": "Harry Dunn's family say inquiry into Foreign Office's treatment of them will start within three weeks",
        "description": "The family of Harry Dunn have said the government is about to start an inquiry into how the Foreign Office treated them after the 19-year-old was killed. ",
        "url": "https://news.sky.com/story/harry-dunns-family-say-enquiry-into-foreign-offices-treatment-of-them-will-start-within-three-weeks-13388600",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-harry-dunn-anne-sacoolas_6264477.jpg?20230827094558",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-25 17:51:00",
        "Headline": "Motorbike rider Harry, 19, died after a head-on collision in 2019 with US spy Anne Sacoolas, who left the country with diplomatic immunity 19 days after the road accident. ",
        "Content": " The family of Harry Dunn have said the government is about to start an inquiry into how the Foreign Office treated them after the 19-year-old was killed.  Harry, who was riding a motorbike, died after a head-on collision in 2019 with a car driven by Anne Sacoolas, who was exiting the American intelligence base RAF Croughton in Northamptonshire. Sacoolas left the UK 19 days after the incident, as the US government had asserted diplomatic immunity on her behalf, claiming she was the wife of a diplomat. She was later revealed to be a US spy. The Dunn family began a long fight for justice, which eventually saw the former spy receive a suspended sentence after she pleaded guilty to causing Harry's death by dangerous driving. She was sentenced in an \"unprecedented\" case at the Old Bailey - but did not attend the hearing in person after American officials stepped in. Instead, she was sentenced via a video link from her lawyer's office in Washington. Speaking to Sky News, a lawyer who has advised the family since Harry's death has now said an inquiry promised by David Lammy when Labour got into power will begin \"within three weeks\". Radd Seiger told The News Hour with Mark Austin that the enquiry will be chaired by Dame Anne Owers, who is \"going to do a rapid piece of work\". \"We just want to leave a legacy for Harry, so what his family went through never happens again,\" he said. Harry's mother, Charlotte Charles, added: \"The failings need to be out there for all to see. \"Certainly for us to learn about and for everyone else to learn about, so we can make sure in future, families like us do not get treated the way that we were treated.\" It is understood that the investigation, which is expected to last three months, will not include scrutiny of the role or actions of the US government. The inquiry is separate from a recent report on how Northamptonshire Police proceeded in the case. The force last week apologised and admitted failures in their handling of the investigation, after the report found officers prioritised the suspect's welfare. Read more:Harry Dunn killer apologiesCriticism over lack of driver training at US base  Assistant Chief Constable Emma James apologised \"for what is now clear was a failure on our part to do the very best for the victim in this case, Harry, and his family who fought tirelessly in the years that followed to achieve justice for him\". She added in a statement: \"The picture which emerges is one of a force which has failed the family on a number of fronts.\" The Dunn family have filed a complaint against the force's former police chief over the report."
    },
    {
        "title": "Sarah de Lagarde, who lost two limbs in Tube fall, hails 'significant milestone' as legal case progresses",
        "description": "A mother-of-two who lost her right arm and leg after being hit by two Tube trains has hailed a \"significant milestone\" in her \"journey towards justice\" as her legal case has progressed. ",
        "url": "https://news.sky.com/story/sarah-de-lagarde-who-lost-two-limbs-in-tube-fall-hails-significant-milestone-as-legal-case-progresses-13388531",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-lagarde-court_6950605.jpg?20250625164240",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-25 15:16:00",
        "Headline": "The mother-of-two is bringing legal action against London Underground after losing her right arm and leg after being hit by two Tube trains at a station in north London. ",
        "Content": "A mother-of-two who lost her right arm and leg after being hit by two Tube trains has hailed a \"significant milestone\" in her \"journey towards justice\" as her legal case has progressed.  Sarah de Lagarde, 47, suffered the injuries after falling down the gap between a train and the platform at High Barnet station in north London in September 2022. After being struck by two trains, she was taken to hospital and had to have the limbs amputated. She now uses two prosthetic limbs, including a bionic arm. Ms de Lagarde is bringing a legal claim against London Underground Ltd (LUL), part of Transport for London, and the case has reached the High Court. The first hearing was held at the Royal Courts of Justice for breach of duty. LUL is defending the claim. Speaking outside the court after the hearing, Mrs de Lagarde said the accident \"cost me dearly\". \"That night I also lost my mobility, my independence, my dignity and, above all, my ability to hug my two young children with both arms,\" she said. \n                  Hainault sword rampage survivor recalls moment attacker told him: 'I'm going to kill you'\n                 \n                  Police make 10 arrests over phone shop robberies\n                 \n                  Hainault sword attacker Marcus Monzo found guilty of murdering boy, 14, and three attempted murders\n                 \"Today, I stand before you not just as a survivor, but as a voice for change. \"This afternoon's court hearing marks a significant milestone in my journey towards justice against Transport for London, and I am optimistic.\" Ms de Lagarde added that she is \"not just fighting for justice for myself but for a safer, more accountable transport network for all\". At the preliminary hearing, Judge Roger Eastman said a further hearing will take place in September this year before a full trial, likely at the beginning of 2027. Mrs de Lagarde previously recalled how she \"screamed for help\" after being hit by the first train. \"There were no staff on that platform, and no one was watching CCTV,\" she said. \"Twenty-two tonnes of steel crushed my limbs, and, if that wasn't bad enough, I remained on the tracks undetected until the second train came into the station, crushing me for a second time.\"  In written submissions to the court, Ms de Lagarde's lawyer said the issues the trial judge will have to decide include whether LUL was in breach by not having a system in place to ensure CCTV on the platform is monitored as passengers are getting off a train. Another issue is whether LUL \"was in breach by virtue of its train operators not being trained to look for passengers on the tracks when entering a station\". More from Sky News:Sword attacker guilty of murdering 14-year-oldUK to buy nuclear-carrying fighter jets A lawyer acting for LUL said: \"We recognise that this is a tragic case, and the claimant sustained some horrific injuries.\" In written submissions, Prashant Popat added: \"The defendant denies these allegations. It also pleads contributory negligence. \"The parties are agreed that the case should proceed first towards a preliminary issue trial on liability. This would encompass breach of duty, causation and the issue of contributory negligence.\""
    },
    {
        "title": "Patient's death linked to cyber attack on NHS, hospital trust says",
        "description": "The death of a patient has been linked to a cyber attack on the NHS.",
        "url": "https://news.sky.com/story/patient-death-linked-to-cyber-attack-on-nhs-hospital-trust-says-13388485",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nhs-logo-national-health-service_6924608.jpg?20250522220322",
        "type": "UK",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-25 13:41:00",
        "Headline": "King's College Hospital NHS Foundation Trust says the patient died \"unexpectedly\" during the cyber attack after a \"long wait for a blood test result\".",
        "Content": "\n          Science and Technology reporter\n       The death of a patient has been linked to a cyber attack on the NHS. The attack last year saw 1,100 cancer treatments delayed, 2,000 outpatient appointments cancelled and more than 1,000 operations postponed. Now, the first death of a patient linked to the attack has been confirmed by King's College Hospital NHS Foundation Trust. \"One patient sadly died unexpectedly during the cyber attack,\" said a spokesperson. \"The patient safety incident investigation identified a number of contributing factors that led to the patient's death. \"This included a long wait for a blood test result due to the cyber attack impacting pathology services at the time. \"We have met with the patient's family, and shared the findings of the safety investigation with them.\" IT company Synnovis, which provides blood test services primarily in southeast London, was the victim of a ransomware attack, understood to be carried out by the Russian group Qilin, on 3 June last year. The hospital trusts affected were Guy's and St Thomas', King's College, and Lewisham and Greenwich, along with primary care across six boroughs and two mental health trusts. Read more from Sky News:Doctors using unapproved AI to record patient meetingsMinecraft users targeted by cyber criminals The healthcare providers were unable to do work involving transfusions or blood matching and were forced to use the universal O-type blood for everyone. This, in turn, contributed to a national shortage of O-type blood supplies, according to NHS England.  Sensitive data stolen from an NHS provider in a cyber attack was apparently published online. \"The death now confirmed is tragic, but it is not surprising,\" said Deryck Mitchelson, a former chief information security officer for NHS Scotland, who now holds the same role at cyber security firm Check Point. He added: \"The NHS is critically reliant on a complex network of suppliers and service providers. But that means we are only ever as secure as the weakest link in the chain. \"To those behind these attacks: this wasn't a faceless act. It wasn't just systems or data you targeted - it was care. It was people. One of them has now lost their life. That should weigh heavily.\" Synnovis CEO Mark Dollar said: \"We are deeply saddened to hear that last year's criminal cyberattack has been identified as one of the contributing factors that led to this patient's death. \"Our hearts go out to the family involved.\""
    },
    {
        "title": " EU warns Europe must start building 'millions of drones' to defend itself against possible Russian attacks",
        "description": "The EU's defence commissioner has warned Europe must be capable of building a drone army in case Russia attacks.",
        "url": "https://news.sky.com/story/eu-warns-europe-must-start-building-millions-of-drones-to-defend-itself-against-possible-russian-attacks-13388472",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ukrainian-fighter-lyman_6948596.jpg?20250623121404",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-06-25 13:32:00",
        "Headline": "EU defence commissioner Andrius Kubilius says Europeans will require millions of drones to create an \"army\" and they need to start preparing now.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  The EU's defence commissioner has warned Europe must be capable of building a drone army in case Russia attacks. Military intelligence has suggested Russian forces could be ready to strike a NATO country within the next five years. In order to defend themselves, Andrius Kubilius says Europeans will require millions of drones and need to start preparing now. \"Russia can have around five million drones, so we need to have capacities bigger than those in order to prevail,\" he told Sky News, warning that if President Putin ordered an attack, the target would face a \"battle-tested\" Russian army with the ability to use millions of drones\". The 2022 invasion of Ukraine sparked a revolution in drone warfare. Facing one of the world's strongest militaries, the Ukrainians used the cheap, adaptable technology to their advantage. It estimates its drone units are now responsible for 80% of Russian frontline losses. \n                  Why is the UK buying nuclear-carrying fighter jets?\n                 \n                  More Britons than ever struggling to make ends meet, report warns\n                 \n                  UK to buy F-35 stealth jets that can carry US nuclear warheads\n                 Mr Kubilius has visited Ukraine to learn the lessons from the battlefield. Along the 1200km (745 miles) front line is an area nicknamed \"Death Valley\". \"Nothing can move. Everything is controlled by drones. A traditional tank in that zone survives six minutes,\" he explained. This year, Ukraine's expected to produce more than four million drones. Contemplating how many units other countries would need, the commissioner used the example of his home country of Lithuania. The former Soviet republic shares a border of around 900km (559 miles) with Russia and Belarus. \"If Ukrainians need four million for 1200km, we need something like three million drones for one year if the war is starting, if 'Day X' is coming,\" he said. To try to stay ahead in the fight, both Russia and Ukraine are constantly updating their drone technology. For this reason, the commissioner believes that rather than stockpiling drones now, which will go out of date, Europe should instead build up teams of pilots, engineers, and producers ready to scale up production should the time come. \"On the European continent, at the moment, there are only two armies battle-tested with the ability to use millions of drones: one is Russian, which is planning new aggressions; another one is Ukrainian,\" said Mr Kubilius. \"We need to learn a lot from Ukraine... how to organise defences against millions of drones, and also how to make your defence industry innovative,\" he added. It's a point many in the business agree with. German start-up STARK has been testing loitering munitions or \"attack drones\" ready to supply to Kyiv. \"It's all made for easy handling for soldiers, so you don't have to use any tools on the front line, and you just plug in the rudders,\" said STARK's senior vice president, Josef Kranawetvogl, as he quickly clicked the unit's tail together. He spent 18 years in the German military before making the jump to weapons production. He says staying ahead of the enemy requires tactics and technology to be frequently updated. \"Every day you have to adapt. You have such fast development cycles in Ukraine - two or three weeks, then there's something new upcoming and you have to be prepared for this.\" Since the start of June, Russia has repeatedly used drone swarms to attack Ukraine. It involves hundreds of drones hammering cities in one night. I asked Josef whether he believes NATO's European members are ready to defend against such an attack. \"I see quite a lot of European armies starting right now to develop or to purchase unmanned systems, and it's a good development, but it's all about time. How can we speed up?\" he replied. Close to the border with France, another German start-up, Alpine Eagle, is testing defence drone units for Ukraine. \"This is our interceptor drone,\" explained the company's CEO, Jan-Hendrik Boelens, holding up a prototype which looks a bit like a small black plane. The interceptor is carried underneath a large grey drone. On-board radar means it can be fired at enemy drones up to 5km (3 miles) away. Jan thinks that could be a game changer in an aerial battle as it means hostile units could be picked off before they get close. And he believes NATO is unprepared if one of its countries was to be hit by a wave of drones like those in Ukraine. \"We are absolutely not ready in my view,\" he said. He explained that Ukraine produced around 1.3 million drones a year last year. \"I would be surprised if NATO even bought a thousand drones last year. I think Germany procured, I don't know, 100, maybe 200. So now you do the math on what that means and how quickly you run out of drones. \"If Ukraine consumed 1.3 million drones per year, that's 3,000 a day. So, if you have 100 in your inventory, that would not last an hour.\" A spokesperson from the German Defence Ministry said the numbers stated \"do not closely reflect reality\". \"Drones are now part of everyday life for soldiers, they are omnipresent and are used extensively in service operations and training,\" they added. Drones are a key part of NATO's defence plan. The alliance's leadership has repeatedly said producing, procuring, and protecting against drones is a priority. At the NATO summit, members agreed to boost defence spending to 5% of gross domestic product (GDP) by 2035. In addition to increasing training and development, NATO Chief Mark Rutte has said he wants more investment in drone technology as well as boosting air defences fivefold. \"We see Russia's deadly terror from the skies over Ukraine every day, and we must be able to defend ourselves from such attacks,\" he told an audience at the summit. Lessons from Ukraine have prompted members to embrace unmanned technology in various ways. Britain is one of the countries pledging to put drones front and centre of its new defence plan. Earlier this month, the government's Strategic Defence Review outlined a new way forward for British Army warfighting based around a drone-centric 20-40-40 strategy where uncrewed systems are deployed for first wave attacks, before tanks, attack helicopters and other manned platforms arrive on the battlefield. In essence, the new weapons mix would be 20% traditional heavy platforms (like tanks), 40% single-use expendable drones and munitions, and the remaining 40% reusable, high-end drones. It's been confirmed that an extra £2bn will be spent on army drones this parliament. Defence Secretary John Healey said Britain's adversaries were working more in alliance and technology was changing how war was fought. \"Drones now kill more people than traditional artillery in the war in Ukraine and whoever gets new technology into the hands of their armed forces the quickest will win,\" he said. This week, the prime minister announced a deal with Ukraine to co-produce drones. Germany and Denmark have made similar agreements with the German Ministry of Defence, telling Sky News that drones are a top priority. In a drone showroom in central Berlin, we meet Sven Weizenegger, head of the German military's cyber innovation hub. He said they have noticed a boom in pitches from potential suppliers. Every day, his department receives up to 20 enquiries from companies asking how their products could be used by the military. He believes things need to move more quickly so soldiers get weapons faster. \"We are very advanced in the innovation process. That means we have a lot of ideas and many companies that are ready to deliver,\" he explained. \"Unfortunately, what we are not good at right now, due to our current processes, is getting these things into real operations, into frontline use. We need to fix that.\" Germany has promised to turbo-charge defence spending, with the Chancellor pledging to create the \"strongest conventional army in Europe\". Plans announced this week include boosting unmanned systems and air defences. Read more:NATO chief calls for 400% increase in air and missile defencePutin humiliated by Ukrainian drone attackUkrainian drone attack puts Russians and the world on notice The German Ministry of Defence said it couldn't reveal stock levels due to security, but a spokesperson confirmed the country is investing in a range of different units, including signing two contracts for attack drones. \"We are procuring not just a few but quite large quantities and testing them directly with the troops,\" the spokesperson added. However, they agreed with the EU defence commissioner that rather than stockpiling tech which would go out of date, it was better to have a system in place to allow for large quantities to be made quickly in the event of war. In May, the EU approved a €150bn (£125bn) loan scheme to boost defence production across the bloc."
    },
    {
        "title": "CIA chief says Iran nuclear site 'severely damaged' by US strikes - despite leaked report claiming the impact was minimal",
        "description": "The head of the CIA has said a \"body of credible intelligence\" indicates that Iran's nuclear programme was \"severely damaged\" by a US operation last weekend.",
        "url": "https://news.sky.com/story/cia-chief-says-iran-nuclear-site-severely-damaged-by-us-strikes-despite-leaked-report-claiming-the-impact-was-minimal-13388729",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-maxar-fordow_6947984.jpg?20250622130856",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-25 22:17:00",
        "Headline": "Donald Trump says Defence Secretary Pete Hegseth will be holding a \"major news conference\" on Thursday afternoon that will be \"interesting and irrefutable\".",
        "Content": " The head of the CIA has said a \"body of credible intelligence\" indicates that Iran's nuclear programme was \"severely damaged\" by a US operation last weekend. Director John Ratcliffe revealed that information from a \"historically reliable and accurate source\" suggests several key sites were destroyed - and will take years to rebuild. This contrasts with a recently leaked report from the US Defence Intelligence Agency that cast doubt on the effectiveness of Operation Midnight Hammer. An assessment obtained by several media outlets concluded that bombing of three nuclear facilities might only have set back Iran's capabilities by a few months. Follow the latest developments Donald Trump has refuted this leak in the strongest possible terms - describing it as \"fake news\" and insisting the military's targets were \"totally obliterated\". He added: \"This was a devastating attack, and it knocked them for a loop.\" \n                  Woman shot outside CIA headquarters after driving towards gates and refusing to stop\n                 \n                  CIA believes lab leak most likely caused COVID outbreak\n                 \n                  Malcolm X family brings $100m lawsuit against FBI, CIA and NYPD over 'conspiracy to assassinate' civil rights leader\n                 The US president went on to reveal that defence secretary Pete Hegseth will be holding a \"major news conference\" later today that will be \"interesting and irrefutable\". On Truth Social, he claimed that the \"Great American Pilots\" involved in the operation were \"very upset\" by the leaked report. \"After 36 hours of dangerously flying through Enemy Territory, they landed, they knew the Success was LEGENDARY, and then, two days later, they started reading Fake News by CNN and The Failing New York Times,\" he wrote. US correspondent The B-2 bombers have returned to their US base, but questions about the success of their airstrikes last weekend hang in the air. President Donald Trump is pushing back hard against a leaked preliminary intelligence report, suggesting the audacious bombing raid only set Iran's nuclear ambition back \"by months\". But Democrats say the president was claiming Iran's underground facilities had been \"obliterated\" long before any intelligence had been received. Read the full analysis from James Matthews here. The White House has highlighted an Israeli statement that suggested Tehran's nuclear efforts have now been delayed for a few years, with Iran's foreign ministry also confirming the facilities have suffered significant damage. But drawing reliable conclusions about the impact of the bunker buster bombs remains difficult - especially only days after they took place. Jeffrey Lewis, a professor of non-proliferation at the Middlebury Institute, said: \"If it's too early to know, why is Trump saying it's obliterated? Either it's too early to know, or you know.\" Read more:NATO chief refers to Trump as 'daddy'Why did US attack avoid some nuclear sites?Mapping the strikes in Israel and Iran  In other developments, Mr Trump has confirmed the US will be holding talks with Iran next week. However, he said he doesn't think an agreement to curtail its nuclear programme is needed, because Iran's facilities are now too badly damaged. \"They're not going to be doing it anyway. They've had it,\" he claimed.  A fragile ceasefire between Israel and Iran has held for a second day - with the skies over major cities quiet overnight. The president joined fellow world leaders at a NATO summit in The Hague yesterday, where members agreed to increase defence spending to 5% of GDP."
    },
    {
        "title": "The truth about the success of US airstrikes on Iran lies buried deep underground",
        "description": "The B-2 bombers have returned to their US base, but questions about the success of their airstrikes last weekend hang in the air.",
        "url": "https://news.sky.com/story/the-truth-about-the-success-of-us-airstrikes-on-iran-lies-buried-deep-underground-13388681",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-isfahan-iran-nuclear_6950788.jpg?20250625214829",
        "type": "World",
        "Author": "David Blevins",
        "Date Published": "2025-06-25 20:42:00",
        "Headline": "Whether the military operation achieved its objectives has become a battle of political narratives in Congress. ",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  The B-2 bombers have returned to their US base, but questions about the success of their airstrikes last weekend hang in the air. President Donald Trump is pushing back hard against a leaked preliminary intelligence report, suggesting the audacious bombing raid only set Iran's nuclear ambition back \"by months\". \"It's destroyed… Iran will not have nuclear. We blew it up. It's blown to kingdom come,\" Mr Trump told a news conference. Read more: Iran and NATO summit latest updates A statement from CIA director John Ratcliffe backed that up. He said: \"[The] CIA can confirm that a body of credible intelligence indicates Iran's nuclear programme has been severely damaged by the recent, targeted strikes. \"This includes new intelligence from a historically reliable and accurate source/method that several key Iranian nuclear facilities were destroyed and would have to be rebuilt over the course of years.\"  But Democrats say the president was claiming Iran's underground facilities had been \"obliterated\" long before any intelligence had been received. Arizona senator Mark Kelly, who flew 39 combat missions in the first Gulf War, said: \"He's just saying that because he wants that to be the narrative. \"He said it the night of the strike, without any information, not even satellite imagery, and certainly without any information about what happened underneath 200 feet of rock and granite and dirt.\" \"The likelihood of something underground like that being obliterated is incredibly low,\" he added.  Senator Kelly blamed Mr Trump for Iran's enrichment growing from \"less than 4% to, public reporting, 60%\", accusing him of \"chucking the Obama deal out the window\". The leaking of the classified report from the Pentagon and subsequent debate has enraged US defence secretary Pete Hegseth. Read more:How much damage has been done to Iran's nuclear facilities?Why did the US attack on Iran avoid some nuclear sites? \"If you want to make an assessment of what happened at Fordow [nuclear site], you better get a big shovel and go really deep because Iran's nuclear programme is obliterated,\" Mr Hegseth said. \"Those that dropped the bombs precisely in the right place know exactly what happened when they exploded, and you know who else knows? Iran.\"  The White House is railing against what it calls the \"fake news media\" for reporting the content of the leaked report. But the success of a military operation has become a battle of political narratives in Congress. That will last longer than a 12-day war because the truth lies buried, quite literally, deep underground."
    },
    {
        "title": "More than a dozen people killed in Kenya during anti-government protests, human rights group says",
        "description": "Sixteen people have died and hundreds of others have been injured in nationwide anti-government protests in Kenya, a human rights charity has said.",
        "url": "https://news.sky.com/story/more-than-a-dozen-people-killed-in-kenya-as-anti-government-protests-turn-deadly-13388657",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nairobi-kenya_6950793.jpg?20250625215530",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-25 19:34:00",
        "Headline": "Thousands of Kenyans took to the streets on Wednesday to commemorate last year's demonstrations, in which more than 60 people died. ",
        "Content": "Sixteen people have died and hundreds of others have been injured in nationwide anti-government protests in Kenya, a human rights charity has said. It comes a year after deadly demonstrations against a tax bill resulted in the storming of parliament. Most were killed by police, the head of Amnesty Kenya said. Thousands of Kenyans took to the streets on Wednesday to commemorate last year's protests, in which more than 60 people died. Police used water cannons and fired tear gas to disperse demonstrations in Nairobi. Amnesty Kenya's executive director Irungu Houghton told Reuters that 16 people had been \"verified as dead\". \"Most were killed by police,\" he added, saying at least five people had been shot dead. Mr Houghton said the number of deaths had been verified by the global rights watchdog and the Kenya National Commission on Human Rights (KNCHR). In a statement posted on X, the government-funded KNCHR earlier said eight deaths had been reported from across Kenya, all \"allegedly from gunshot wounds\". \"Over 400 casualties have been reported, including demonstrators, police officers and journalists,\" it said. The watchdog noted heavy police deployment and \"allegations of excessive use of force, including rubber bullets, live ammunition and water cannons, resulting in numerous injuries\". Kenyan police spokesperson Muchiri Nyaga declined to comment on the statements. An official at the capital's main Kenyatta National Hospital said it had admitted 107 injured people, \"most with gunshot wounds\" from either rubber bullets or live rounds. Large crowds were seen heading in the direction of the president's official residence in Nairobi, which had been barricaded with razor wire. The scenes were broadcast by Kenyan channel NTV before it and another were pulled off air after defying an order to stop showing the demonstrations live. Isolated clashes were reported in the port city of Mombasa by NTV, with protests also taking place in towns including Kitengela, Kisii, Matuu and Nyeri. The Independent Policing Oversight Authority, a state-funded body, said in a statement that at least 61 people were arrested during the protests. More from Sky News:NATO chief refers to Trump as 'daddy'New reward to find British backpacker's remains Protests in June 2024 saw demonstrators shot dead and fires started inside the Kenyan parliament after politicians voted in favour of a controversial tax bill. Protests faded after President William Ruto withdrew the bill, but public anger has remained over police brutality and the rising cost of living."
    },
    {
        "title": "NATO chief refers to Trump as 'daddy' as he praises US president over Israel-Iran ceasefire",
        "description": "The head of NATO referred to Donald Trump as \"daddy\" as he heaped praise on the US president over the Israel-Iran ceasefire.",
        "url": "https://news.sky.com/story/nato-chief-heaps-praise-on-trump-at-meeting-after-us-president-cast-doubt-on-commitment-to-collective-defence-13388255",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nato-donald-trump_6950176.jpg?20250625093755",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-25 06:15:00",
        "Headline": "Mark Rutte also thanked the president for pushing allies to agree to increase their spending contributions, saying it \"wouldn't have happened\" without him.",
        "Content": " The head of NATO referred to Donald Trump as \"daddy\" as he heaped praise on the US president over the Israel-Iran ceasefire. Speaking alongside Mr Trump at a NATO summit in The Hague, Mark Rutte also thanked him for pushing allies to agree to increase their spending contributions, saying it \"wouldn't have happened\" without him. Middle East latest: Trump rejects US intel on nuclear sites NATO leaders pledged to increase their annual defence spending to 5% of GDP at the summit on Wednesday, fulfilling a long-standing demand by Mr Trump. Addressing the US president directly, the NATO secretary general said: \"This would not have happened if you would not have been elected in 2016 and re-elected last year... so I want to thank you.\" Mr Rutte described Mr Trump as \"a man of strength\" and a \"man of peace\", praising him for securing a ceasefire between Israel and Iran. Mr Trump compared Israel and Iran to \"two kids in a school yard\" fighting, saying: \"They fight like hell. You can't stop them. Let them fight for about two, three minutes. Then it's easier to stop them.\" Mr Rutte then said: \"Then daddy has to sometimes use strong language.\" Tensions between Israel and Iran hung over the summit on Wednesday amid a fragile ceasefire. Several news outlets have published stories that intelligence reports in the US suggest that the American attack on Iran's nuclear programme over the weekend has only set it back by a few months, rather than \"obliterated\" it as Mr Trump has suggested. Speaking at the summit, the US president said the strikes were an \"obliteration\" but acknowledged the intelligence was \"very inconclusive\". \"The intelligence says we don't know,\" he added. \"It could've been very severe. That's what the intelligence suggests. \"It was very severe. There was obliteration.\" Mr Trump added: \"That hit ended the war.\"  Read more:How NATO's Article 5 clause worksUK to buy nuclear-carrying fighter jets Drawing comparisons to US atomic bombings during the Second World War, he said: \"I don't want to use an example of Hiroshima. I don't want to use an example of Nagasaki. But that was essentially the same thing. That ended that war.\" Meanwhile, US defence secretary Pete Hegseth said the Trump administration was launching an investigation into the disclosure of those intelligence findings. Trump shares flattering Rutte message Mr Rutte's choice of language when addressing Mr Trump has been a talking point of the two-day summit. On Tuesday, the US president shared a message from Mr Rutte, in which the NATO chief congratulated him for his \"decisive action in Iran\", as well as his push to increase defence spending. \"You will achieve something NO American president in decades could get done,\" Mr Rutte told Mr Trump. \"Europe is going to pay in a BIG way as they should, and it will be your win.\"  'Ironclad commitment' to collective defence Alongside their pledge to increase defence spending, NATO leaders affirmed their \"ironclad commitment\" to collective defence. Mr Trump had sparked concern on Tuesday after he cast doubt on his commitment to the alliance's mutual defence guarantees. The US president avoided directly endorsing Article 5, telling reporters en route to the summit that there were \"numerous definitions\" of the clause. NATO's Article 5 requires members to defend each other from attack. All NATO members have backed a statement enshrining the 5% target - to be achieved over the next 10 years. However Spain has already come out to warn it will agree to the new target but without having a plan to reach it."
    },
    {
        "title": "'Great progress' made in Gaza ceasefire talks, says Donald Trump",
        "description": "Donald Trump has suggested a ceasefire in Gaza may be imminent. ",
        "url": "https://news.sky.com/story/great-progress-made-in-gaza-ceasefire-talks-says-donald-trump-13388530",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gaza-israeli_6950143.jpg?20250625085625",
        "type": "World",
        "Author": "Tom Cheshire, Sky News correspondent",
        "Date Published": "2025-06-25 15:08:00",
        "Headline": "While missile strikes between Israel and Iran have dominated headlines in recent days, the war in Gaza has ground relentlessly on.",
        "Content": "By Tom Cheshire, Sky News correspondent   Donald Trump has suggested a ceasefire in Gaza may be imminent.  The US president told reporters that \"great progress\" had been made in talks as a result of the end of the recent 12-day conflict between Israel and Iran. On 22 June, the US carried out strikes on three Iranian nuclear enrichment sites. \"Because of this attack that we made [in Iran], I think we're going to have some good news… Gaza's very close,\" he added.  While missile strikes between Israel and Iran have dominated headlines in recent days, the war in Gaza has ground relentlessly on. On Wednesday, Israeli officials said seven soldiers were killed by an explosive device in Khan Younis, in the south of the territory. That was the highest number of deaths for its forces in a single incident since the breakdown of a previous truce in March. Meanwhile, the Hamas-run Gaza health ministry said another 33 people had been killed and 267 people injured while seeking aid at food distribution points. Read more: Doctors on the frontline – British surgeons on life in Gaza Sky News's Gaza Team observed bodies being laid out at Nasser Hospital, and people being treated, after reports of gunfire at an aid point near the Netzarim Corridor in central Gaza. Rabih Abed-Rabo, a Palestinian man, told Sky News that tens of thousands of people had gone to the site to seek food. \"I'm really thanking God I managed to get this bag. I have to feed 15 people. We've been trying for three months,\" he said. \"I went back and forth to that area 10 times. Near the tanks, near the Israelis, through intense gunfire. Thank God.\" Read more:Palestine Action supporters defiant as group faces banAnalysis: Israel's block on international journalists in Gaza should not be allowed to stand The Gaza health ministry said a total of 549 people had now been killed at food distribution centres since March. The aid stations are operated by the Gaza Humanitarian Foundation (GHF), a private organisation backed by Israel and now funded directly by the US too. A UN official has described the aid delivery mechanism as a \"death trap\". The Israeli military did not comment on the latest incident but told Sky News: \"The Ministry of Health in Gaza is controlled and directed by Hamas, and is therefore subject to its agenda. \"In consequence, as has been proved and demonstrated repeatedly, the data of the ministry is replete with inconsistencies and false determinations.\""
    },
    {
        "title": "NATO allies agree 'ironclad commitment' to collective defence - but no condemnation of Russia's war in Ukraine",
        "description": "Donald Trump and his NATO allies confirmed their \"ironclad commitment\" to collective defence in a communique released at the end of a brief summit in The Hague.",
        "url": "https://news.sky.com/story/nato-allies-agree-ironclad-commitment-to-collective-defence-but-no-condemnation-of-russias-war-in-ukraine-13388393",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nato-summit_6950326.jpg?20250625122640",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2025-06-25 10:58:00",
        "Headline": "In a statement at the end of their summit in The Hague, NATO allies agree to spend more on collective defence - but there is no word on membership for Ukraine.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Donald Trump and his NATO allies confirmed their \"ironclad commitment\" to collective defence in a communique released at the end of a brief summit in The Hague. But there was no condemnation of Russia's war in Ukraine - something that had been in previous statements by allied leaders when Joe Biden was in the White House. His successor has a closer relationship with Vladimir Putin than many of his allies. The document did describe Russia as a \"long-term threat\". But there was also no word about NATO membership for Ukraine - something that had previously been described an \"irreversible path\". The allies also agreed to spend more on their collective defence. Middle East latest: Trump rejects US intel on nuclear sites The endorsement of Article 5 of NATO's founding treaty came after the US commander-in-chief - the most powerful leader in the room - suggested on his way to the gathering that his definition of what it means may differ from other allies. The US president's words risked undermining the credibility of a commitment that has helped ensure the security of NATO for more than 75 years, though the joint statement, approved by the leaders of all 32 member states spelt out clearly what Article 5 constitutes.  \"We reaffirm our ironclad commitment to collective defence as enshrined in Article 5 of the Washington Treaty - that an attack on one is an attack on all,\" it said. \"We remain united and steadfast in our resolve to protect our one billion citizens, defend the Alliance, and safeguard our freedom and democracy.\" Sir Keir Starmer and the leaders of all European member states, as well as Canada, are all too aware of Mr Trump's scepticism about NATO. He has accused his allies of taking advantage of the US's far more powerful armed forces to defend Europe and wants the rest of the alliance to take on more of the burden. Read more:How NATO's Article 5 clause worksUK to buy nuclear-carrying fighter jetsDoubt cast over success of 'Operation Midnight Hammer' Urgently needing to keep him onside, Mark Rutte, the head of NATO, has been rallying member states to agree to a new pledge to spend 5% of GDP on defence and related areas - a level first touted by Mr Trump. The statement commits allies to hit this goal by 2035, though Spain has already come out to warn it will agree to the new target but without having a plan to reach it. The communique reads: \"United in the face of profound security threats and challenges, in particular the long term threat posed by Russia to Euro-Atlantic security and the persistent threat of terrorism, allies commit to invest 5% of GDP annually on core defence requirements as well as defence-and security-related spending by 2035.\"  It is a significant rise, that is broken down into 3.5% of GDP on core defence - up from a previous goal of 2% - and a further 1.5% to be invested in national resilience, such as roads, railways, energy and cyber security. The final communique was much shorter than usual, comprising just five paragraphs. In the only mention of Russia's war in Ukraine, it said: \"Allies reaffirm their enduring sovereign commitments to provide support to Ukraine, whose security contributes to ours, and, to this end, will include direct contributions towards Ukraine's defence and its defence industry when calculating allies' defence spending.\" Mr Trump has vowed to end Russia's war in Ukraine but has so far failed to stop the fighting."
    },
    {
        "title": "CIA chief says Iran nuclear site 'severely damaged' by US strikes - despite leaked report claiming the impact was minimal",
        "description": "The head of the CIA has said a \"body of credible intelligence\" indicates that Iran's nuclear programme was \"severely damaged\" by a US operation last weekend.",
        "url": "https://news.sky.com/story/cia-chief-says-iran-nuclear-site-severely-damaged-by-us-strikes-despite-leaked-report-claiming-the-impact-was-minimal-13388729",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-maxar-fordow_6947984.jpg?20250622130856",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-25 22:17:00",
        "Headline": "Donald Trump says Defence Secretary Pete Hegseth will be holding a \"major news conference\" on Thursday afternoon that will be \"interesting and irrefutable\".",
        "Content": " The head of the CIA has said a \"body of credible intelligence\" indicates that Iran's nuclear programme was \"severely damaged\" by a US operation last weekend. Director John Ratcliffe revealed that information from a \"historically reliable and accurate source\" suggests several key sites were destroyed - and will take years to rebuild. This contrasts with a recently leaked report from the US Defence Intelligence Agency that cast doubt on the effectiveness of Operation Midnight Hammer. An assessment obtained by several media outlets concluded that bombing of three nuclear facilities might only have set back Iran's capabilities by a few months. Follow the latest developments Donald Trump has refuted this leak in the strongest possible terms - describing it as \"fake news\" and insisting the military's targets were \"totally obliterated\". He added: \"This was a devastating attack, and it knocked them for a loop.\" \n                  Woman shot outside CIA headquarters after driving towards gates and refusing to stop\n                 \n                  CIA believes lab leak most likely caused COVID outbreak\n                 \n                  Malcolm X family brings $100m lawsuit against FBI, CIA and NYPD over 'conspiracy to assassinate' civil rights leader\n                 The US president went on to reveal that defence secretary Pete Hegseth will be holding a \"major news conference\" later today that will be \"interesting and irrefutable\". On Truth Social, he claimed that the \"Great American Pilots\" involved in the operation were \"very upset\" by the leaked report. \"After 36 hours of dangerously flying through Enemy Territory, they landed, they knew the Success was LEGENDARY, and then, two days later, they started reading Fake News by CNN and The Failing New York Times,\" he wrote. US correspondent The B-2 bombers have returned to their US base, but questions about the success of their airstrikes last weekend hang in the air. President Donald Trump is pushing back hard against a leaked preliminary intelligence report, suggesting the audacious bombing raid only set Iran's nuclear ambition back \"by months\". But Democrats say the president was claiming Iran's underground facilities had been \"obliterated\" long before any intelligence had been received. Read the full analysis from James Matthews here. The White House has highlighted an Israeli statement that suggested Tehran's nuclear efforts have now been delayed for a few years, with Iran's foreign ministry also confirming the facilities have suffered significant damage. But drawing reliable conclusions about the impact of the bunker buster bombs remains difficult - especially only days after they took place. Jeffrey Lewis, a professor of non-proliferation at the Middlebury Institute, said: \"If it's too early to know, why is Trump saying it's obliterated? Either it's too early to know, or you know.\" Read more:NATO chief refers to Trump as 'daddy'Why did US attack avoid some nuclear sites?Mapping the strikes in Israel and Iran  In other developments, Mr Trump has confirmed the US will be holding talks with Iran next week. However, he said he doesn't think an agreement to curtail its nuclear programme is needed, because Iran's facilities are now too badly damaged. \"They're not going to be doing it anyway. They've had it,\" he claimed.  A fragile ceasefire between Israel and Iran has held for a second day - with the skies over major cities quiet overnight. The president joined fellow world leaders at a NATO summit in The Hague yesterday, where members agreed to increase defence spending to 5% of GDP."
    },
    {
        "title": "The truth about the success of US airstrikes on Iran lies buried deep underground",
        "description": "The B-2 bombers have returned to their US base, but questions about the success of their airstrikes last weekend hang in the air.",
        "url": "https://news.sky.com/story/the-truth-about-the-success-of-us-airstrikes-on-iran-lies-buried-deep-underground-13388681",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-isfahan-iran-nuclear_6950788.jpg?20250625214829",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-06-25 20:42:00",
        "Headline": "Whether the military operation achieved its objectives has become a battle of political narratives in Congress. ",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  The B-2 bombers have returned to their US base, but questions about the success of their airstrikes last weekend hang in the air. President Donald Trump is pushing back hard against a leaked preliminary intelligence report, suggesting the audacious bombing raid only set Iran's nuclear ambition back \"by months\". \"It's destroyed… Iran will not have nuclear. We blew it up. It's blown to kingdom come,\" Mr Trump told a news conference. Read more: Iran and NATO summit latest updates A statement from CIA director John Ratcliffe backed that up. He said: \"[The] CIA can confirm that a body of credible intelligence indicates Iran's nuclear programme has been severely damaged by the recent, targeted strikes. \"This includes new intelligence from a historically reliable and accurate source/method that several key Iranian nuclear facilities were destroyed and would have to be rebuilt over the course of years.\"  But Democrats say the president was claiming Iran's underground facilities had been \"obliterated\" long before any intelligence had been received. Arizona senator Mark Kelly, who flew 39 combat missions in the first Gulf War, said: \"He's just saying that because he wants that to be the narrative. \"He said it the night of the strike, without any information, not even satellite imagery, and certainly without any information about what happened underneath 200 feet of rock and granite and dirt.\" \"The likelihood of something underground like that being obliterated is incredibly low,\" he added.  Senator Kelly blamed Mr Trump for Iran's enrichment growing from \"less than 4% to, public reporting, 60%\", accusing him of \"chucking the Obama deal out the window\". The leaking of the classified report from the Pentagon and subsequent debate has enraged US defence secretary Pete Hegseth. Read more:How much damage has been done to Iran's nuclear facilities?Why did the US attack on Iran avoid some nuclear sites? \"If you want to make an assessment of what happened at Fordow [nuclear site], you better get a big shovel and go really deep because Iran's nuclear programme is obliterated,\" Mr Hegseth said. \"Those that dropped the bombs precisely in the right place know exactly what happened when they exploded, and you know who else knows? Iran.\"  The White House is railing against what it calls the \"fake news media\" for reporting the content of the leaked report. But the success of a military operation has become a battle of political narratives in Congress. That will last longer than a 12-day war because the truth lies buried, quite literally, deep underground."
    },
    {
        "title": "NATO allies agree 'ironclad commitment' to collective defence - but no condemnation of Russia's war in Ukraine",
        "description": "Donald Trump and his NATO allies confirmed their \"ironclad commitment\" to collective defence in a communique released at the end of a brief summit in The Hague.",
        "url": "https://news.sky.com/story/nato-allies-agree-ironclad-commitment-to-collective-defence-but-no-condemnation-of-russias-war-in-ukraine-13388393",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nato-summit_6950326.jpg?20250625122640",
        "type": "US",
        "Author": "Deborah Haynes",
        "Date Published": "2025-06-25 10:58:00",
        "Headline": "In a statement at the end of their summit in The Hague, NATO allies agree to spend more on collective defence - but there is no word on membership for Ukraine.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Donald Trump and his NATO allies confirmed their \"ironclad commitment\" to collective defence in a communique released at the end of a brief summit in The Hague. But there was no condemnation of Russia's war in Ukraine - something that had been in previous statements by allied leaders when Joe Biden was in the White House. His successor has a closer relationship with Vladimir Putin than many of his allies. The document did describe Russia as a \"long-term threat\". But there was also no word about NATO membership for Ukraine - something that had previously been described an \"irreversible path\". The allies also agreed to spend more on their collective defence. Middle East latest: Trump rejects US intel on nuclear sites The endorsement of Article 5 of NATO's founding treaty came after the US commander-in-chief - the most powerful leader in the room - suggested on his way to the gathering that his definition of what it means may differ from other allies. The US president's words risked undermining the credibility of a commitment that has helped ensure the security of NATO for more than 75 years, though the joint statement, approved by the leaders of all 32 member states spelt out clearly what Article 5 constitutes.  \"We reaffirm our ironclad commitment to collective defence as enshrined in Article 5 of the Washington Treaty - that an attack on one is an attack on all,\" it said. \"We remain united and steadfast in our resolve to protect our one billion citizens, defend the Alliance, and safeguard our freedom and democracy.\" Sir Keir Starmer and the leaders of all European member states, as well as Canada, are all too aware of Mr Trump's scepticism about NATO. He has accused his allies of taking advantage of the US's far more powerful armed forces to defend Europe and wants the rest of the alliance to take on more of the burden. Read more:How NATO's Article 5 clause worksUK to buy nuclear-carrying fighter jetsDoubt cast over success of 'Operation Midnight Hammer' Urgently needing to keep him onside, Mark Rutte, the head of NATO, has been rallying member states to agree to a new pledge to spend 5% of GDP on defence and related areas - a level first touted by Mr Trump. The statement commits allies to hit this goal by 2035, though Spain has already come out to warn it will agree to the new target but without having a plan to reach it. The communique reads: \"United in the face of profound security threats and challenges, in particular the long term threat posed by Russia to Euro-Atlantic security and the persistent threat of terrorism, allies commit to invest 5% of GDP annually on core defence requirements as well as defence-and security-related spending by 2035.\"  It is a significant rise, that is broken down into 3.5% of GDP on core defence - up from a previous goal of 2% - and a further 1.5% to be invested in national resilience, such as roads, railways, energy and cyber security. The final communique was much shorter than usual, comprising just five paragraphs. In the only mention of Russia's war in Ukraine, it said: \"Allies reaffirm their enduring sovereign commitments to provide support to Ukraine, whose security contributes to ours, and, to this end, will include direct contributions towards Ukraine's defence and its defence industry when calculating allies' defence spending.\" Mr Trump has vowed to end Russia's war in Ukraine but has so far failed to stop the fighting."
    },
    {
        "title": "'Great progress' made in Gaza ceasefire talks, says Donald Trump",
        "description": "Donald Trump has suggested a ceasefire in Gaza may be imminent. ",
        "url": "https://news.sky.com/story/great-progress-made-in-gaza-ceasefire-talks-says-donald-trump-13388530",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gaza-israeli_6950143.jpg?20250625085625",
        "type": "US",
        "Author": "Tom Cheshire, Sky News correspondent",
        "Date Published": "2025-06-25 15:08:00",
        "Headline": "While missile strikes between Israel and Iran have dominated headlines in recent days, the war in Gaza has ground relentlessly on.",
        "Content": "By Tom Cheshire, Sky News correspondent   Donald Trump has suggested a ceasefire in Gaza may be imminent.  The US president told reporters that \"great progress\" had been made in talks as a result of the end of the recent 12-day conflict between Israel and Iran. On 22 June, the US carried out strikes on three Iranian nuclear enrichment sites. \"Because of this attack that we made [in Iran], I think we're going to have some good news… Gaza's very close,\" he added.  While missile strikes between Israel and Iran have dominated headlines in recent days, the war in Gaza has ground relentlessly on. On Wednesday, Israeli officials said seven soldiers were killed by an explosive device in Khan Younis, in the south of the territory. That was the highest number of deaths for its forces in a single incident since the breakdown of a previous truce in March. Meanwhile, the Hamas-run Gaza health ministry said another 33 people had been killed and 267 people injured while seeking aid at food distribution points. Read more: Doctors on the frontline – British surgeons on life in Gaza Sky News's Gaza Team observed bodies being laid out at Nasser Hospital, and people being treated, after reports of gunfire at an aid point near the Netzarim Corridor in central Gaza. Rabih Abed-Rabo, a Palestinian man, told Sky News that tens of thousands of people had gone to the site to seek food. \"I'm really thanking God I managed to get this bag. I have to feed 15 people. We've been trying for three months,\" he said. \"I went back and forth to that area 10 times. Near the tanks, near the Israelis, through intense gunfire. Thank God.\" Read more:Palestine Action supporters defiant as group faces banAnalysis: Israel's block on international journalists in Gaza should not be allowed to stand The Gaza health ministry said a total of 549 people had now been killed at food distribution centres since March. The aid stations are operated by the Gaza Humanitarian Foundation (GHF), a private organisation backed by Israel and now funded directly by the US too. A UN official has described the aid delivery mechanism as a \"death trap\". The Israeli military did not comment on the latest incident but told Sky News: \"The Ministry of Health in Gaza is controlled and directed by Hamas, and is therefore subject to its agenda. \"In consequence, as has been proved and demonstrated repeatedly, the data of the ministry is replete with inconsistencies and false determinations.\""
    },
    {
        "title": "Trump considers 'three or four' successors to 'stupid' Fed chair Powell",
        "description": "Donald Trump has revived his criticism of the head of the US central bank, describing Jay Powell as \"terrible\" and \"stupid\", adding that there were up to four candidates to succeed him.",
        "url": "https://news.sky.com/story/trump-considers-three-or-four-successors-to-stupid-powell-13388554",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-nato-summit_6950493.jpg?20250625201622",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-06-25 15:41:00",
        "Headline": "The US president is desperate to secure a higher rate of growth in the world's largest economy and is demanding the Federal Reserve get on board.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has revived his criticism of the head of the US central bank, describing Jay Powell as \"terrible\" and \"stupid\", adding that there were up to four candidates to succeed him. The president, who threatened to fire Mr Powell earlier this year before U-turning on that course this month, has consistently demanded the Federal Reserve cuts interest rates to help bolster economic growth. But the central bank has held off since Mr Trump's second term in office began, citing threats to the pace of price growth from his on-off trade war. Money latest: Prize fund rate for Premium Bonds lowered By raising tariffs on imports in a bid to boost American jobs and make US-produced goods more competitive, Mr Powell believes the spectre of inflation is looming over the world's largest economy. But the official inflation figures are yet to show any marked increase from rising import costs. \"I know within three or four people who I'm going to pick,\" Mr Trump said in remarks to reporters while on his visit to Europe for the NATO summit at The Hague. \n                  Shell denies report of BP takeover talks\n                 \n                  Trade strategy aims to boost UK firms amid Trump tariff chaos\n                 \n                  More Britons than ever struggling to make ends meet, report warns\n                 He said Mr Powell, the Fed chair, was \"an average-minded person\" with a \"low IQ for what he does\". \"I think he's a very stupid person, actually,\" he added. US media suggest the contenders to succeed Mr Powell include former Fed governor Kevin Warsh, National Economic Council head Kevin Hassett, current Fed governor Christopher Waller and Treasury Secretary Scott Bessent. The Fed chair is not due to leave his position until May next year. The Federal Reserve, like the Bank of England in the UK, is independent of government. Mr Trump is desperate to grow the US economy after a sharp slowdown in the first quarter of the year was blamed on the threat of his trade war and early salvoes. Read more:What's behind the Trump-Powell spat? Analysts see Mr Trump's on-off criticism of Mr Powell as an attempt to influence monetary policy through the back door. The prospects of a battle to remove him has previously rattled financial markets. For his part, Mr Powell told a Congressional hearing on policy on Tuesday that higher tariffs from the trade war could push up inflation this summer - a time when the Fed has already indicated it could move to cut its target range for interest rates."
    },
    {
        "title": "NATO chief refers to Trump as 'daddy' as he praises US president over Israel-Iran ceasefire",
        "description": "The head of NATO referred to Donald Trump as \"daddy\" as he heaped praise on the US president over the Israel-Iran ceasefire.",
        "url": "https://news.sky.com/story/nato-chief-heaps-praise-on-trump-at-meeting-after-us-president-cast-doubt-on-commitment-to-collective-defence-13388255",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nato-donald-trump_6950176.jpg?20250625093755",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-25 06:15:00",
        "Headline": "Mark Rutte also thanked the president for pushing allies to agree to increase their spending contributions, saying it \"wouldn't have happened\" without him.",
        "Content": " The head of NATO referred to Donald Trump as \"daddy\" as he heaped praise on the US president over the Israel-Iran ceasefire. Speaking alongside Mr Trump at a NATO summit in The Hague, Mark Rutte also thanked him for pushing allies to agree to increase their spending contributions, saying it \"wouldn't have happened\" without him. Middle East latest: Trump rejects US intel on nuclear sites NATO leaders pledged to increase their annual defence spending to 5% of GDP at the summit on Wednesday, fulfilling a long-standing demand by Mr Trump. Addressing the US president directly, the NATO secretary general said: \"This would not have happened if you would not have been elected in 2016 and re-elected last year... so I want to thank you.\" Mr Rutte described Mr Trump as \"a man of strength\" and a \"man of peace\", praising him for securing a ceasefire between Israel and Iran. Mr Trump compared Israel and Iran to \"two kids in a school yard\" fighting, saying: \"They fight like hell. You can't stop them. Let them fight for about two, three minutes. Then it's easier to stop them.\" Mr Rutte then said: \"Then daddy has to sometimes use strong language.\" Tensions between Israel and Iran hung over the summit on Wednesday amid a fragile ceasefire. Several news outlets have published stories that intelligence reports in the US suggest that the American attack on Iran's nuclear programme over the weekend has only set it back by a few months, rather than \"obliterated\" it as Mr Trump has suggested. Speaking at the summit, the US president said the strikes were an \"obliteration\" but acknowledged the intelligence was \"very inconclusive\". \"The intelligence says we don't know,\" he added. \"It could've been very severe. That's what the intelligence suggests. \"It was very severe. There was obliteration.\" Mr Trump added: \"That hit ended the war.\"  Read more:How NATO's Article 5 clause worksUK to buy nuclear-carrying fighter jets Drawing comparisons to US atomic bombings during the Second World War, he said: \"I don't want to use an example of Hiroshima. I don't want to use an example of Nagasaki. But that was essentially the same thing. That ended that war.\" Meanwhile, US defence secretary Pete Hegseth said the Trump administration was launching an investigation into the disclosure of those intelligence findings. Trump shares flattering Rutte message Mr Rutte's choice of language when addressing Mr Trump has been a talking point of the two-day summit. On Tuesday, the US president shared a message from Mr Rutte, in which the NATO chief congratulated him for his \"decisive action in Iran\", as well as his push to increase defence spending. \"You will achieve something NO American president in decades could get done,\" Mr Rutte told Mr Trump. \"Europe is going to pay in a BIG way as they should, and it will be your win.\"  'Ironclad commitment' to collective defence Alongside their pledge to increase defence spending, NATO leaders affirmed their \"ironclad commitment\" to collective defence. Mr Trump had sparked concern on Tuesday after he cast doubt on his commitment to the alliance's mutual defence guarantees. The US president avoided directly endorsing Article 5, telling reporters en route to the summit that there were \"numerous definitions\" of the clause. NATO's Article 5 requires members to defend each other from attack. All NATO members have backed a statement enshrining the 5% target - to be achieved over the next 10 years. However Spain has already come out to warn it will agree to the new target but without having a plan to reach it."
    },
    {
        "title": "Shell denies report of BP takeover talks",
        "description": "Shell has denied it is in talks with BP over a possible takeover of its smaller rival.",
        "url": "https://news.sky.com/story/bp-shares-soar-on-report-of-shell-takeover-talks-13388562",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-shell-bp_6950660.jpg?20250625175327",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-06-25 15:56:00",
        "Headline": "A tie-up has long been the subject of speculation, but Shell insists its focus is on delivering shareholder value through its own operational performance.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Shell has denied it is in talks with BP over a possible takeover of its smaller rival. The Wall Street Journal, citing a number of sources, reported on Wednesday evening that discussions between the two UK-based energy firms were at an early, but active, stage. The US publication added that BP was considering the approach. Money latest: Prize fund rate for Premium Bonds lowered Its story was published soon after the London Stock Exchange had closed for the day, but US-listed depository shares in BP were 10% up in New York shortly after publication, while those for Shell were down. However, Shell responded to the story by telling Sky News: \"This is further market speculation. No talks are taking place. \"As we have said many times before, we are sharply focused on capturing the value of Shell through continuing to focus on performance, discipline and simplification.\" The rally for BP shares fell back in the wake of the statement. BP declined to comment. The company has been widely seen as a possible takeover target for years, as its market value has lagged behind the growth of industry peers. It was valued at nearly £59bn as of Wednesday, while Shell had a market capitalisation of over £153bn. Read more from Sky News:Briton charged after 'mock wedding' with nine-year-oldGuests descend on Venice for Jeff Bezos wedding The gulf between them has widened since 2020, when BP, under the then-chief executive Bernard Looney, embarked on a fundamental shift towards a green energy future. The lofty ambitions were slowly chipped away following record leaps in oil and natural gas costs in the wake of Russia's invasion of Ukraine. Much of the strategy was overturned in a reset by current boss Murray Auchincloss in February this year, under pressure from shareholders. BP's debt pile has been seen as a potential barrier to takeover interest."
    },
    {
        "title": "Trade strategy aims to boost UK firms amid Trump tariff chaos",
        "description": "Plans to better protect vital UK industries and help businesses export have been revealed by the government, as the world continues to grapple with the effects of Donald Trump's trade war.",
        "url": "https://news.sky.com/story/trade-strategy-aims-to-boost-uk-firms-amid-trump-tariff-chaos-13388437",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-port-tariffs-container-ship_6910922.jpg?20250625204642",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-06-25 12:31:00",
        "Headline": "The government says its plans, designed to bolster its growth priorities, will make the UK the \"most connected nation in the world\" as Donald Trump's trade war continues to shake up the global order.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Plans to better protect vital UK industries and help businesses export have been revealed by the government, as the world continues to grapple with the effects of Donald Trump's trade war. A trade strategy, to be published on Thursday, aims to make the UK the best-connected country to do business, aided by looser regulation and increased access to finance. It forms part of the government's efforts to get business back on side after the backlash which followed the tax-raising budget and its \"plan for change\" to boost meagre economic growth. The plan follows hot on the heels of a trade deal which spares the UK from some of the US president's most punitive duties, and a more wide-ranging agreement with India. Money latest: Prize fund rate for Premium Bonds lowered The strategy - the first since Brexit - also aims to capitalise on a relaxation in some EU rules on trade, and the separate industrial strategy outlined earlier this week that will give energy-intensive businesses help in bolstering their competitiveness through cuts to their bills. Jonathan Reynolds, the business and trade secretary, said: \"The UK is an open trading nation but we must reconcile this with a new geopolitical reality and work in our own national interest. \n                  Shell denies report of BP takeover talks\n                 \n                  More Britons than ever struggling to make ends meet, report warns\n                 \n                  Money blog: Prize fund rate for Premium Bonds lowered\n                 \"Our Trade Strategy will sharpen our trade defence so we can ensure British businesses are protected from harm, while also relentlessly pursuing every opportunity to sell to more markets under better terms than before.\"  The department said that the capacity of UK Export Finance, the UK's export credit agency, was to be expanded by £20bn and funding would also be set aside to tackle complex regulatory issues and remove obstacles for exporters. The US trade war provides both opportunities and threats to UK firms. The steel sector is to be consulted on what new protections can be put in place from June 2026 once current safeguards, covering things like cheap Chinese imports, are due to expire. The trade and industrial strategies have been revealed at a time of crisis for both steel and chemicals linked to high costs.  British Steel is now under the control of the UK government in a bid to protect the country's ability to produce so-called virgin steel following the closures of the blast furnaces at Tata's Port Talbot works. It was announced on Wednesday that Saudi firm Sabic was to shut its Olefins 6 ethylene plant at Wilton on Teesside, leaving more than 300 jobs at risk. Like British Steel's owner Jingye, Sabic has blamed high energy bills. Eliminating some of those costs, under the industrial strategy plans, would not kick in until 2026 at the earliest. At the same time, Associated British Foods (ABF) is to make a decision on Thursday on whether to shut the UK's largest bioethanol plant in Hull. ABF has complained that the Vivergo Fuels factory has had the rug pulled from under it by the UK government as its recent trade deal with the US allows subsidised US ethanol into the country. A second UK bioethanol plant, owned by Ensus, is at risk of closure on Teesside. The steel industry lobby group said the trade strategy would build on work in the industrial strategy to provide a more stable platform for the sector. UK Steel's director general Gareth Stace, said: \"For too long, the government has been hamstrung by self-imposed rules that allow bad actors to take advantage of our open market. \"This has enabled state-subsidised steel to rip market share away from domestic producers, at the cost of thousands of good jobs in some of the most economically vulnerable regions in the country, and fracturing manufacturing supply chains, making us more reliant on imports. \"We need swift and decisive action to build a trade defence regime that is fit for purpose and in place before current safeguards expire in 2026. \"With the right tools and the political will to use them, the UK can reassert control over its steel market, protect skilled jobs, and give investors the confidence that the UK steel sector has a strong and sustainable future.\""
    },
    {
        "title": "More Britons than ever struggling to make ends meet, report warns",
        "description": "More people than ever are struggling to live on their current income - while just a third say they are living comfortably, according to new research.",
        "url": "https://news.sky.com/story/more-britons-than-ever-struggling-to-make-ends-meet-report-warns-13388026",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-notes-banknotes_6938843.jpg?20250611021632",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-25 01:18:00",
        "Headline": "Defence was also a key theme of the report - and researchers found about 40% of Britons support spending more money on weapons and troops.",
        "Content": "More people than ever are struggling to live on their current income - while just a third say they are living comfortably, according to new research. Rising prices and sluggish pay increases have put many people's finances under strain in recent years. A record 26% now say making ends meet is difficult. Before the pandemic, it was 16%.  Two-thirds also say their incomes haven't kept up with inflation, according to the British Social Attitudes report. That's only marginally better than the 70% recorded during the height of the cost of living crisis in 2023. Frozen tax thresholds also appear to be hitting home, with 61% saying taxes on low earners are too high, while 44% believe middle income earners also pay too much. Those figures are up nine points and 13 points respectively since 2016. \n                   EU warns Europe must start building 'millions of drones' to defend itself against possible Russian attacks\n                 \n                  Why is the UK buying nuclear-carrying fighter jets?\n                 \n                  UK to buy F-35 stealth jets that can carry US nuclear warheads\n                 However, when it comes to the highest earners, 44% believe their taxes are too low.  The report also asked people about the welfare system - a timely insight with Labour MPs currently rebelling over plans to save £5bn from the budget. It found support for more spending on disability benefits is at a record low of 45%, down from 67% in 2017 - but only 11% think spending should be reduced. About 29% of those polled think it's \"too easy\" for people to get disability benefits - but the same percentage also feel it's \"too difficult\". Meanwhile, long waiting times appear to have played a part in the finding that a record 59% are now dissatisfied with the NHS. In 2019, it was just 25%. Only 21% said they were satisfied with the health service.  The report is based on a representative, random sample of more than 4,000 people in the UK and was produced by the National Centre for Social Research. It's the longest-running measure of public opinion in Britain, having started in 1983. Professor Sir John Curtice, senior research fellow, said: \"The public are well aware of Britain's problems - not least those of a failing health service and an economy in which many are struggling to make ends meet. \"Yet rather than turning their back on the state, for the most part, the public are still inclined to look to government to provide solutions.\"  The report was published as fresh government figures showed an 11% increase, to a total of £6.6bn, in council tax arrears across England amid a continued squeeze on household finances from essential bills. Council tax, water and energy bills all rose above the rate of inflation in April. Defence was also a key theme of the report - and researchers found about 40% of Britons support spending more money on weapons and troops. A fifth (20%) said they would like to see a reduction. It comes as the government revealed it was buying at least 12 stealth jets that can carry nuclear weapons, and as NATO countries, including the UK, promise to increase defence spending. The National Security Strategy also said the UK must prepare for the potential of a \"wartime scenario\" in the \"UK homeland\" for the first time in many years. Read more from Sky News:Briton charged after 'mock wedding' with nine-year-oldGuests descend on Venice for Jeff Bezos wedding Almost everyone surveyed (90%) considered Russia a serious threat to world peace, followed by Iran (78%), North Korea (77%), Israel (73%), and China (69%). The percentage supporting more defence spending remains relatively unchanged since 2016, before Russia invaded Ukraine. However, the share supporting an increase is significantly higher now than that in 2006 (28%) and in the 1990s (17%)."
    },
    {
        "title": "Trump considers 'three or four' successors to 'stupid' Fed chair Powell",
        "description": "Donald Trump has revived his criticism of the head of the US central bank, describing Jay Powell as \"terrible\" and \"stupid\", adding that there were up to four candidates to succeed him.",
        "url": "https://news.sky.com/story/trump-considers-three-or-four-successors-to-stupid-powell-13388554",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-nato-summit_6950493.jpg?20250625201622",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-06-25 15:41:00",
        "Headline": "The US president is desperate to secure a higher rate of growth in the world's largest economy and is demanding the Federal Reserve get on board.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has revived his criticism of the head of the US central bank, describing Jay Powell as \"terrible\" and \"stupid\", adding that there were up to four candidates to succeed him. The president, who threatened to fire Mr Powell earlier this year before U-turning on that course this month, has consistently demanded the Federal Reserve cuts interest rates to help bolster economic growth. But the central bank has held off since Mr Trump's second term in office began, citing threats to the pace of price growth from his on-off trade war. Money latest: Prize fund rate for Premium Bonds lowered By raising tariffs on imports in a bid to boost American jobs and make US-produced goods more competitive, Mr Powell believes the spectre of inflation is looming over the world's largest economy. But the official inflation figures are yet to show any marked increase from rising import costs. \"I know within three or four people who I'm going to pick,\" Mr Trump said in remarks to reporters while on his visit to Europe for the NATO summit at The Hague. \n                  Shell denies report of BP takeover talks\n                 \n                  Trade strategy aims to boost UK firms amid Trump tariff chaos\n                 \n                  More Britons than ever struggling to make ends meet, report warns\n                 He said Mr Powell, the Fed chair, was \"an average-minded person\" with a \"low IQ for what he does\". \"I think he's a very stupid person, actually,\" he added. US media suggest the contenders to succeed Mr Powell include former Fed governor Kevin Warsh, National Economic Council head Kevin Hassett, current Fed governor Christopher Waller and Treasury Secretary Scott Bessent. The Fed chair is not due to leave his position until May next year. The Federal Reserve, like the Bank of England in the UK, is independent of government. Mr Trump is desperate to grow the US economy after a sharp slowdown in the first quarter of the year was blamed on the threat of his trade war and early salvoes. Read more:What's behind the Trump-Powell spat? Analysts see Mr Trump's on-off criticism of Mr Powell as an attempt to influence monetary policy through the back door. The prospects of a battle to remove him has previously rattled financial markets. For his part, Mr Powell told a Congressional hearing on policy on Tuesday that higher tariffs from the trade war could push up inflation this summer - a time when the Fed has already indicated it could move to cut its target range for interest rates."
    },
    {
        "title": "Full list of 33 River Island shop closures",
        "description": "High street retailer River Island has announced the locations of the 33 shops it is to shut. ",
        "url": "https://news.sky.com/story/full-list-of-33-river-island-shop-closures-13388381",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-river-island-riverisland_6946688.jpg?20250620135029",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-25 10:13:00",
        "Headline": "Hundreds of jobs could be lost as a result of the closures. ",
        "Content": "High street retailer River Island has announced the locations of the 33 shops it is to shut.  It confirms Sky News reporting that the clothing chain, which trades from about 230 stores, is to close 33 shops in a restructuring plan which will be put to creditors in August. The fate of another 70 shops depends on reaching agreements with landlords to slash rents. Money blog: These features could add thousands to home value Confirmation of the locations comes after Sky News revealed the company, which was founded in 1948 by Bernard Lewis, was working with PricewaterhouseCoopers (PwC) on a restructuring plan. A restructuring plan is a court-supervised process enabling companies in financial difficulty to compromise with creditors, like landlords, to avoid insolvency. It's unclear how many jobs are under threat from a formal rescue deal, though the business previously said: \"We regret any job losses as a result of store closures, and we will try to keep these to a minimum.\" Hundreds of jobs could be at risk. In total, River Island employs around 5,500 people. Closing in January 2026 are River Island stores in: BecktonBangor BloomfieldWrexhamEdinburgh Princes StreetHerefordSurrey QuaysDidcotSutton ColdfieldAylesburyBurton-Upon-TrentNorthwichTauntonWorkingtonFalkirkCumbernauldKirkcaldyGloucesterHartlepoolBrightonLisburnNorwichOxfordPooleKilmarnockHanleyBarnstapleGrimsbyLeeds Birstall ParkRochdale Great YarmouthSt HelensStockton On TeesPerth"
    },
    {
        "title": "Former EE chief Allera joins team at CVC sports empire",
        "description": "The former boss of mobile phone network EE is taking on a powerful new role at the heart of a sports portfolio which includes interests in Six Nations Rugby, Spanish top-flight football and the women's global tennis tour.",
        "url": "https://news.sky.com/story/former-ee-chief-allera-joins-team-at-cvc-sports-empire-13388479",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-six-nations-england_6857618.jpg?20250315172144",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-25 13:34:00",
        "Headline": "The owner of stakes in Six Nations rugby and La Liga's media rights has appointed former BT Sport chair Marc Allera as chairman of CVC SportsCo, a new entity spanning its sports portfolio, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The former boss of mobile phone network EE is taking on a powerful new role at the heart of a sports portfolio which includes interests in Six Nations Rugby, Spanish top-flight football and the women's global tennis tour. Sky News has learnt that Marc Allera, who stepped down as the boss of BT Group's consumer business earlier this year, has been appointed chairman of CVC SportsCo, a new entity aimed at providing more cohesive support to the buyout firm CVC Capital Partners' investments across the sector. The establishment of the new operating and investment group concept comes as CVC, the Amsterdam-listed private equity group, continues to diversify its sporting asset base. Money latest: Voice services down at mobile network Having made billions of dollars from its ownership of Formula One motor racing - one of the most lucrative deals in the history of sport - CVC has bought stakes in leagues and other assets spanning cricket, football, rugby union, tennis and volleyball over the last two decades. Its investment in the media rights to La Liga - Spain's equivalent of the Premier League - is expected to generate a handsome return for the firm, although a comparable deal in France has faced significant challenges amid broadcasters' financial challenges in the country. CVC's backing of global sports properties is intended to position it to maximise their commercial potential through new media and sponsorship rights deals, as well as their expansion into new formats aimed at drawing wider audiences amid rapid shifts in media consumption. \n                  Shell denies report of BP takeover talks\n                 \n                  Trade strategy aims to boost UK firms amid Trump tariff chaos\n                 \n                  More Britons than ever struggling to make ends meet, report warns\n                 In rugby union, its acquisition of a stake in Premiership Rugby's commercial rights was hit by the pandemic and the subsequent financial pressures on clubs which saw a number of the league's teams forced into insolvency. Sky News revealed earlier this year that CVC had extended further support to Newcastle Falcons as part of a broader financial package aimed at paving the way for the team's sale. Red Bull is reported to be the acquirer of Newcastle Falcons, with a deal expected imminently. CVC, which bought into Premiership Rugby in 2019, owns a 27% stake in the league. Under its stewardship, broadcast audiences and attendances have turned a corner, with total TV audiences up 40% this year - partly as a result of an increase in the number of games being shown. It recently agreed a more lucrative TV rights deal for the league. Sponsorship revenues are also said to have nearly doubled since CVC's initial investment, with fan interest among the crucial 18-34 age demographic rising by 30% during the last year. Its SportsCo strategy will see Mr Allera, who also chaired BT Sport, working across the CVC sports portfolio, with other executives expected to be recruited to assist the effort in due course. One source likened the initiative to the approach employed by the luxury goods conglomerate LVMH. They added that there would be parallels with the sharing of best practice used at US basketball's NBA through its TeamBusinessOperations (TeamBO) unit to unlock collective opportunities and drive further long-term growth projects. CVC's sporting assets will continue to remain autonomous and independent of one another, the source said. One expected benefit of the SportsCo approach would be the sourcing of new investment opportunities in future years, with another likely to mean CVC remaining a stakeholder in its existing portfolio for a longer duration. The firm was recently outbid in an auction of major tennis tournaments by Ari Emanuel, the Endeavor founder whose company was also the seller of the assets. Global sports properties have become one of the hottest growth areas for private capital in recent years, with firms such as Ares Management, Silver Lake Partners and Bridgepoint all investing substantial sums in teams, leagues and other assets across the industry. Mr Allera already has connections to CVC as chairman of JagEx, the mobile gaming business it bought last year, and as a broader adviser to the private equity firm. He spent nine years running BT's consumer arm following its acquisition of EE. CVC declined to comment on Wednesday."
    },
    {
        "title": "Welfare, telecoms and non-dom tax",
        "description": "As MPs push back against reforms to the welfare system, Darren McCaffrey speaks to Helen Thomas, former adviser to George Osborne and chief executive of financial consultancy firm Blonde Money.",
        "url": "https://news.sky.com/story/welfare-telecoms-and-non-dom-tax-13388483",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-biz-podcast-podcast_6937464.jpg?20250609141833",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-25 13:35:00",
        "Headline": "No subtitle found",
        "Content": "As MPs push back against reforms to the welfare system, Darren McCaffrey speaks to Helen Thomas, former adviser to George Osborne and chief executive of financial consultancy firm Blonde Money. Arun Advani, director of the independent Centre for the Analysis of Taxation, joins to talk about Labour's non-dom tax policy. And Darren looks at the Thames Freeport, which is getting a critical infrastructure upgrade, with US telecoms giant Verizon contracted to build a 5G network. :: Listen and subscribe to the Sky News Business Podcast here."
    },
    {
        "title": "Post Office scandal: Government has not done enough to ensure compensation for victims, committee of MPs finds",
        "description": "The government has not done enough to ensure all victims entitled to compensation from the Post Office scandal have applied for it, a report has found.",
        "url": "https://news.sky.com/story/post-office-scandal-govt-has-not-done-enough-to-ensure-compensation-for-victims-committee-of-mps-finds-13387923",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-post-office-sign_6839861.jpg?20250225230217",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-25 04:01:00",
        "Headline": "Many current and former postmasters affected by Horizon IT failings and associated miscarriages of justice are not yet receiving fair and timely compensation, according to a report by the Public Accounts Committee (PAC).",
        "Content": "The government has not done enough to ensure all victims entitled to compensation from the Post Office scandal have applied for it, a report has found. Many current and former postmasters affected by Horizon IT failings and associated miscarriages of justice are not yet receiving fair and timely compensation, according to the report by the Public Accounts Committee (PAC). Only 21% of the 18,500 letters the Post Office sent to postmasters to make them aware of the Horizon Shortfall Scheme had been responded to, figures provided by the Department for Business and Trade (DBT) show. About 5,000 further letters are expected to be sent in 2025. Long-time Post Office victims campaigner Sir Alan Bates told Sky News: \"What is evident is that the PAC, along with ourselves, are dismayed about the length of time all this is taking and the failure of all victims to be contacted. \"It really only goes to support what I have been saying time and time again, that government departments are the entirely wrong people to run these types of schemes as they only grind them into the dust with bureaucracy.\" Under the scheme, current and former postmasters who were financially affected by the Horizon IT system, but who were either not convicted or did not take the Post Office to the High Court, can either settle their claim for a final fixed sum of £75,000 or have it fully assessed. There is also the Horizon Convictions Redress Scheme (HCRS), which is for sub-postmasters who had their convictions quashed after the passing of the Post Office (Horizon System) Offences Act last year. \n                  Post Office Capture scandal: Sir Alan Bates calls for those responsible for wrongful convictions to be 'brought to account'\n                 \n                  Post Office scandal redress must not only be fair - it must be fast\n                 \n                  Could there be another Post Office scandal?\n                 The 800 or so sub-postmasters who are eligible to claim under the HCRS are entitled to a £600,000 full and final settlement, or the option to pursue a full claim assessment. By the end of March, 339 had accepted the settlement sum, the report by the PAC, which is made up of MPs from all sides of the House of Commons, found. But the PAC report states the government has no plans to follow up with people who are, or may be, eligible to claim but are yet to apply.  The committee recommends that the DBT should outline what more it will do to ensure every affected postmaster is fully aware of their options for claiming. A third scheme provides compensation to sub-postmasters who were wrongly convicted of fraud, theft and false accounting. Of the 111 sub-postmasters eligible to claim for the Overturned Convictions Scheme and who are either entitled to a £600,000 full and final settlement, or to pursue a full claim assessment, 25 have not yet submitted a claim, some of whom represent the most complex cases. The DBT has taken over the management of the scheme from the Post Office, and the PAC report recommends the department should outline how it plans to handle the remaining cases under the scheme. Read more on the Post Office scandal:Analysis: Redress must not only be fair - it must be fastPost Office hero reveals he received 'take it or leave it' offer Sir Geoffrey Clifton-Brown MP, chair of the PAC, said thousands of people were \"deeply failed\" by the system during \"one of the UK's worst ever miscarriages of justice\". He added: \"This committee would have hoped to have found government laser-focused on ensuring all those eligible were fully and fairly compensated for what happened. \"It is deeply dissatisfactory to find these schemes still moving far too slowly, with no government plans to track down the majority of potential claimants who may not yet be aware of their proper entitlements. \"It is entirely unacceptable that those affected by this scandal, some of whom have had to go through the courts to clear their names, are being forced to relitigate their cases a second time.\""
    },
    {
        "title": "Starmer's team ask Labour MPs to remove names from rebel amendment that could bring down welfare bill",
        "description": "Cabinet ministers have been asking Labour MPs to take their name off a rebel amendment to the government's controversial welfare bill, Sky News can reveal.",
        "url": "https://news.sky.com/story/revealed-the-frantic-phone-calls-starmers-team-are-making-to-stop-welfare-rebellion-that-could-defeat-him-13388488",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-starmer-prime-minister_6950634.jpg?20250625170908",
        "type": "Politics",
        "Author": "Alexandra Rogers and Faye Brown, political reporters",
        "Date Published": "2025-06-25 13:51:00",
        "Headline": "Cabinet ministers have been calling Labour rebels unhappy with the government's welfare reforms ahead of a crunch vote next week. One MP says a cabinet minister warned them defeat will trigger a leadership contest.",
        "Content": "By Alexandra Rogers and Faye Brown, political reporters   Cabinet ministers have been asking Labour MPs to take their name off a rebel amendment to the government's controversial welfare bill, Sky News can reveal. In an attempt to quell the mounting rebellion of more than 100 MPs across all wings of the party, cabinet ministers were instructed to ring around the signatories of the amendment in a bid to get them to back the welfare cuts ahead of a planned vote next Tuesday. Politics latest: PM 'very confident' he'll remain Labour leader Two Labour MPs said they had been asked if they would take their names off the amendment, while one was asked if they would be prepared to abstain on the bill next week. One Labour MP said: \"'The more they tell people to take their names off, the more names are added on.\" Others were also told their actions could provoke a fresh leadership challenge and that they were aligning themselves with Nigel Farage in a bid to get them to back down. \"I had a conversation with a senior cabinet member yesterday who basically said if the government is defeated next week it will trigger a leadership contest,\" a Labour MP said. \n                  Inside the blame game as the welfare rebellion grows\n                 \n                  Sir Keir Starmer defiant over welfare cuts as Sir Sadiq Khan hits out at proposals\n                 \n                  What is Sir Keir Starmer's welfare bill and why is he facing a major Labour rebellion over it?\n                 \"I can see how that might be the case but I would argue if that's where we end up it's because the government have allowed that to happen. The ball is very much in their court. \"By and large the rebels do not want this to be about leadership. We just want to government to listen.\" Another added that while they had not received a call from a cabinet minister, they knew \"some colleagues are being told there will be a leadership challenge or a general election which is utter nonsense\", adding: \"Everything is all over the place.\" The amendment, if passed, would effectively kill the government's welfare reforms by failing to give it a second reading in the Commons. The most controversial elements of the government's welfare bill are changes to PIP and Universal Credit. PIP is money for people who have extra care needs or mobility needs as a result of a disability. People who claim it - some of whom are in work - are awarded points depending on their ability to do certain activities, such as washing and preparing food, and this influences how much they will receive. Under the plans, from November 2026, people will need to score a minimum of four points in at least one activity to qualify for the daily living element of PIP - instead of fewer points across a broader range of tasks the person needs help with. The changes do not affect the mobility component of PIP. And from April next year, the health element of Universal Credit will be frozen in cash terms for existing claimants at £97 per week until 2029/2030. For new claimants, the health element of Universal Credit will be reduced to £50 per week. \n\nHowever, ministers point to the fact that the Universal Credit standard allowance will increase from £92 per week in 2025-26 to £106 per week by 2029-30. Overall, 3.2 million families are expected to lose an average of £1,720 by the end of 2030 due to the changes.\n\nHowever, the government has stressed that these figures do not take into account the £1bn that is being put towards helping the long-term sick and disabled back into work.\n\n\n It calls for a delay to the £5bn package to assess the impact of cuts to personal independence payments (PIP) and expresses concerns about the government's own figures showing 250,000 people could be pushed into poverty - including 50,000 children. The fact the amendment was tabled by Dame Meg Hillier, chair of the Treasury select committee, with the support of 12 other select committee chairs, has alarmed Downing Street - as has the sheer scale of the rebellion. At least 123 Labour MPs have signed the public amendment, but Sky News understands more names are likely to appear in the coming days. While Sir Keir Starmer and his deputy, Angela Rayner, have insisted the vote will go ahead next Tuesday, the decision to instruct cabinet ministers to call around colleagues suggests the government is concerned about potentially losing the vote. 'The government is not listening' A Labour MP who signed the amendment said most rebels wanted the government to pause the proposals pending a proper consultation. They said the fact that the text of the bill had been published before the consultation had closed was proof the government was \"not listening\". Another MP said they had raised concerns that if constituents are moved from PIP to universal credit they could potentially exceed the benefits cap, which could disproportionally hit those living in cities where the cost of living is higher. Read more:Welfare versus warfare - the PM faces the hardest fight of his premiershipRayner refuses to repeat chancellor's tax pledge \"I can't look at my constituents and say I'm confident this won't negatively affect them,\" they said. The MP also criticised the government's approach to keeping MPs on side, saying it had failed to make the case for reform consistently. \"The engagement stopped after the initial flurry of bad press. Now there is a small amount of activity before the vote. Ministers need to be out there; the PM needs to be out there.\"  Despite the growing rebellion, the prime minister has indicated he is not willing to offer concessions on the government's welfare plans. Asked by reporters at the NATO summit in the Netherlands if he was willing to make changes to the bill, Sir Keir said: \"We have got to make the reforms to our system. It isn't working as it is. \"It doesn't work as it stands for people who desperately need help to get into work or for people who need protection. It is broken. \"We were elected in to change that which is broken, and that's what we will do, and that's why we will press ahead with reforms.\" Speaking to Sky News, armed forces minister Luke Pollard accepted rebels were \"not doing this to cause trouble or to be argumentative\" - but instead because they \"have a genuine, heartfelt concern about some of the impacts\". Downing Street has been contacted for comment."
    },
    {
        "title": "Rayner refuses to repeat chancellor's pledge on tax hikes",
        "description": "Angela Rayner has refused to repeat Rachel Reeves' pledge that taxes will not be increased at the next budget. ",
        "url": "https://news.sky.com/story/rayner-refuses-to-repeat-chancellors-pledge-on-tax-hikes-13388411",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-angels-rayner-angela-rayner_6950309.jpg?20250625121342",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-25 11:30:00",
        "Headline": "The deputy PM was pressed on warnings from businesses that tax hikes look increasingly inevitable to fund the government's spending plans. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Angela Rayner has refused to repeat Rachel Reeves' pledge that taxes will not be increased at the next budget.  Standing in for Sir Keir Starmer at PMQs, the deputy prime minister was pressed on warnings from economists that tax rises are looking increasingly inevitable in the autumn to fund the chancellor's spending plans. Politics Live: Deputy PM vows to take on Labour welfare rebels The Tories want a commitment that this will not be the case in order to support the government's welfare bill, which is under threat from a growing and significant rebellion of Labour MPs. Shadow chancellor Mel stride, standing in for Tory leader Kemi Badenoch, said even if the planned benefit cuts go through, \"almost every respected economist now says tax rises are all but inevitable in the autumn\". He said Ms Reeves promised after her last budget that this will not be the case and asked Ms Rayner to give \"certainty\" to businesses and repeat that pledge. Ms Rayner said the question was \"a bit rich\" given the Tories raised taxes to record highs before the last election, adding: \"I take no lectures\". \n                  'Inflation and customer cutbacks' blamed for big dive in retail sales\n                 \n                  Bank of England holds rate but eyes cuts ahead despite global risks\n                 \n                  Trump tariffs a big factor - but latest UK economic performance makes for unpleasant reading\n                 Mr Stride pressed her on analysis from the Institute of Fiscal Studies (IFS) that local authorities will have to raise council tax to the maximum level allowed to pay for local services. He said: \"The IFS says that the spending review will mean the biggest council tax increases in a generation. \"A £7bn tax rise and yet the chancellor and the prime minister have repeatedly claimed that the government will not raise taxes on working people. So can I ask... why doesn't she think the council tax is paid by working people?\" Ms Rayner again attacked the Tories' record, saying he had \"absolute nerve\" as council tax \"rose every single year under that government\". She said Labour was \"delivering money for local government, when they had austerity, put taxes up and ruined the British economy\". Ms Reeves unveiled her spending review earlier this month, which outlined how much day-to-day funding government departments will get over the next three years, along with capital spending for longer-term projects. The chancellor has insisted her plans are fully funded, but Paul Johnson, director of the IFS, has said she has left herself such little headroom that \"any move in the wrong direction\" for the economy would \"almost certainly spark more tax rises\". Any tax hikes would likely spark a backlash given Ms Reeves' said last November that there would be no more tax hikes during this government's term, following her decision to raise employer National Insurance in the autumn budget. The government is facing further trouble as a key part of the spending review was a package of reforms aimed at shaving £5bn off the welfare budget by 2030.  However, an unprecedented rebellion of over 100 MPs is threatening that legislation, which is due to be voted on next Tuesday. Ms Rayner today insisted the vote will go ahead. She said: \"I'll tell the right honourable member why we're pressing ahead with our reforms. \"That is because we're investing £1 billion into tailored employment support, a right to try to help more people back into work and ending reassessments for the most severely disabled who will never be able to work. \"We won't walk away and stand by and abandon millions of people trapped in the failing system left behind by him and his colleagues.\""
    },
    {
        "title": "Businesses urged to strengthen cyber defences amid increase in Iran-adjacent attacks",
        "description": "UK businesses have been warned by the government to redouble their cybersecurity efforts - as experts warn of increased Iran-adjacent attacks following the escalation of tensions in the Middle East.",
        "url": "https://news.sky.com/story/businesses-urged-to-strengthen-cyber-defences-amid-increase-in-iran-adjacent-attacks-13388470",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-stock-cyber-hack_6950483.jpg?20250625150140",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-06-25 13:16:00",
        "Headline": "Prime Minister Sir Keir Starmer warned today of regular cyberattacks emanating from the like of Russia and Iran against the UK. Information shared with Sky News shows a rise in Iran-adjacent attacks since their conflict with Israel began.",
        "Content": "\n          Political reporter\n              @TimJ_B\n UK businesses have been warned by the government to redouble their cybersecurity efforts - as experts warn of increased Iran-adjacent attacks following the escalation of tensions in the Middle East. Cybersecurity researchers shared with Sky News details of an increase in action from online actors promoting Tehran taking aim at UK-based organisations, along with American and Israeli targets. Analysis from cybersecurity firm EclecticIQ noted a \"significant uptick\" in cyberattacks since the start of the Israel-Iran conflict started around a fortnight ago. Politics latest: PM 'confident' he'll remain Labour leader The company said this included evidence of \"growing collaborations between pro-Iranian and pro-Russian hacktivist groups\". Speaking at a NATO summit today, Prime Minister Sir Keir said the likes of Iran and Russia were carrying out cyberattacks \"on a regular basis\" - adding that the UK had \"to be prepared for them\". The prime minister added that cyberattacks should be considered \"an attack on our country\". \n                  Patient's death linked to cyber attack on NHS, hospital trust says\n                 \n                  Minecraft users targeted by criminals posing as game coders\n                 \n                  Co-op offers 25% off £40 shop as 'thank you' to members after cyberattack\n                 In response to the increase in attacks, a government spokesperson told Sky News: \"UK businesses face a growing number of threats from domestic and foreign cyber criminals who are intent on disrupting not only their operations, but our wider digital economy. \"While some companies are already taking steps to better protect themselves, it is vital that - regardless of size or sector - they all take immediate steps to review and strengthen their defences.\" Among the attacks seen recently were distributed denial of service - DDoS - attacks against British companies, including those in the defence sector. This involves trying to flood a company's computer networks with traffic in a bid to make it crash. Read more:Iranian threat to UK could increase after US strikesNHS trusts' data 'stolen' in cyberattackRussian-linked hackers targeted Ministry of Defence As well as DDoS attacks, malware that deletes data was also deployed, with disinformation and \"influence operations\" also increasing. It is difficult to establish who is carrying out attacks, including where they are located. Analysis of techniques and technical factors can point to an origin. One DDoS attack was launched at outsourcing giant Serco, although the company said its \"robust security operations infrastructure prevented the attack\". EclecticIQ says the scope of the attacks has extended past Israeli entities, with organisations in the US, UK and EU all targeted. Cody Farrow, EclecticIQ's chief executive officer, warned businesses should not \"assume they are out of scope\". Before working in the private sector, Mr Barrow was a senior intelligence officer in the US department of defence at the Pentagon, as well as the NSA and US cyber command. He told Sky News: \"UK companies could be being targeted not because of what they've done, but because of what they represent - which means resilience and remediation playbooks are crucial.\" 👉Search for The Wargame on your podcast app👈 Mr Farrow said Iran could retaliate against Israeli attacks in \"unexpected ways\" and has a history of responding to attacks via cyber operations. \"Retaliation may not be immediate or proportional, and could target companies with ties to Israel, entities perceived as supporting Israeli or Western operations, or symbolic infrastructure,\" he said."
    },
    {
        "title": "Starmer says welfare vote will go ahead despite threat of Labour rebellion",
        "description": "Sir Keir Starmer has said a vote on welfare reforms will go ahead next week despite an unprecedented number of Labour MPs expected to rebel.",
        "url": "https://news.sky.com/story/starmer-says-welfare-vote-will-go-ahead-despite-threat-of-labour-rebellion-13388452",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-nato-hague_6950459.jpg?20250625143632",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-25 12:51:00",
        "Headline": "More than 100 Labour MPs have put their names to a \"reasoned amendment\" that could stop the government's welfare bill in its tracks.",
        "Content": " Sir Keir Starmer has said a vote on welfare reforms will go ahead next week despite an unprecedented number of Labour MPs expected to rebel. Taking questions from journalists following a speech at the NATO summit, the prime minister was asked by Sky News' political editor Beth Rigby how he can govern the country if he cannot govern his party. Politics Live: PM insists he can 'read the room' despite growing rebellion He replied: \"On the question of welfare reform, we're committed to reforming our welfare system. It doesn't work. It traps people. And it has to be reformed. \"And it also has to ensure we've got a welfare system that is fit for the future. That is why there will be a vote and we will press ahead with the reforms.\" Responding to other questions, he went on to insist there was a \"pretty united front\" among Labour MPs that the UK's welfare system needs reform. \"You won't find many Labour MPs who are not accepting that we need reform, we are absolutely on the page with them,\" he said. \n                  Starmer's team ask Labour MPs to remove names from rebel amendment that could bring down welfare bill\n                 \n                  UK to buy F-35 stealth jets that can carry US nuclear warheads\n                 \n                  Rayner refuses to repeat chancellor's pledge on tax hikes\n                 Speaking later to the Politics Hub with Sophy Ridge, armed forces minister Luke Pollard said talks were ongoing with rebels about potential concessions. He said it was \"entirely reasonable\" for ministers, including in the Department for Work and Pensions, \"to engage in constructive dialogue with those folks\". Back at NATO, the prime minister also said he was \"very confident\" he will lead the Labour Party into the next election, saying \"it is really important that I lead from the front and take the long-term decisions about the future of our country\". More than 100 Labour MPs have put their names to a \"reasoned amendment\" that could stop the government's welfare bill in its tracks. Read More:Rayner refuses to repeat chancellor's pledge on tax hikes The plans restrict eligibility for personal independence payment (pip), the main disability payment in England, and limit the sickness-related element of universal credit, in a bid to shave £5bn off the welfare bill by 2030. Ministers say the reforms will help get people into work, but many MPs are worried it will push disabled people into poverty. Existing claimants will be given a 13-week phase-out period of financial support, a move seen as a bid to head off opposition. However, the rebels argue disabled people have not been properly consulted about the plan and say further analysis is required before making any changes."
    },
    {
        "title": "Post Office scandal: Government has not done enough to ensure compensation for victims, committee of MPs finds",
        "description": "The government has not done enough to ensure all victims entitled to compensation from the Post Office scandal have applied for it, a report has found.",
        "url": "https://news.sky.com/story/post-office-scandal-govt-has-not-done-enough-to-ensure-compensation-for-victims-committee-of-mps-finds-13387923",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-post-office-sign_6839861.jpg?20250225230217",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-25 04:01:00",
        "Headline": "Many current and former postmasters affected by Horizon IT failings and associated miscarriages of justice are not yet receiving fair and timely compensation, according to a report by the Public Accounts Committee (PAC).",
        "Content": "The government has not done enough to ensure all victims entitled to compensation from the Post Office scandal have applied for it, a report has found. Many current and former postmasters affected by Horizon IT failings and associated miscarriages of justice are not yet receiving fair and timely compensation, according to the report by the Public Accounts Committee (PAC). Only 21% of the 18,500 letters the Post Office sent to postmasters to make them aware of the Horizon Shortfall Scheme had been responded to, figures provided by the Department for Business and Trade (DBT) show. About 5,000 further letters are expected to be sent in 2025. Long-time Post Office victims campaigner Sir Alan Bates told Sky News: \"What is evident is that the PAC, along with ourselves, are dismayed about the length of time all this is taking and the failure of all victims to be contacted. \"It really only goes to support what I have been saying time and time again, that government departments are the entirely wrong people to run these types of schemes as they only grind them into the dust with bureaucracy.\" Under the scheme, current and former postmasters who were financially affected by the Horizon IT system, but who were either not convicted or did not take the Post Office to the High Court, can either settle their claim for a final fixed sum of £75,000 or have it fully assessed. There is also the Horizon Convictions Redress Scheme (HCRS), which is for sub-postmasters who had their convictions quashed after the passing of the Post Office (Horizon System) Offences Act last year. \n                  Post Office Capture scandal: Sir Alan Bates calls for those responsible for wrongful convictions to be 'brought to account'\n                 \n                  Post Office scandal redress must not only be fair - it must be fast\n                 \n                  Could there be another Post Office scandal?\n                 The 800 or so sub-postmasters who are eligible to claim under the HCRS are entitled to a £600,000 full and final settlement, or the option to pursue a full claim assessment. By the end of March, 339 had accepted the settlement sum, the report by the PAC, which is made up of MPs from all sides of the House of Commons, found. But the PAC report states the government has no plans to follow up with people who are, or may be, eligible to claim but are yet to apply.  The committee recommends that the DBT should outline what more it will do to ensure every affected postmaster is fully aware of their options for claiming. A third scheme provides compensation to sub-postmasters who were wrongly convicted of fraud, theft and false accounting. Of the 111 sub-postmasters eligible to claim for the Overturned Convictions Scheme and who are either entitled to a £600,000 full and final settlement, or to pursue a full claim assessment, 25 have not yet submitted a claim, some of whom represent the most complex cases. The DBT has taken over the management of the scheme from the Post Office, and the PAC report recommends the department should outline how it plans to handle the remaining cases under the scheme. Read more on the Post Office scandal:Analysis: Redress must not only be fair - it must be fastPost Office hero reveals he received 'take it or leave it' offer Sir Geoffrey Clifton-Brown MP, chair of the PAC, said thousands of people were \"deeply failed\" by the system during \"one of the UK's worst ever miscarriages of justice\". He added: \"This committee would have hoped to have found government laser-focused on ensuring all those eligible were fully and fairly compensated for what happened. \"It is deeply dissatisfactory to find these schemes still moving far too slowly, with no government plans to track down the majority of potential claimants who may not yet be aware of their proper entitlements. \"It is entirely unacceptable that those affected by this scandal, some of whom have had to go through the courts to clear their names, are being forced to relitigate their cases a second time.\""
    },
    {
        "title": "Patient's death linked to cyber attack on NHS, hospital trust says",
        "description": "The death of a patient has been linked to a cyber attack on the NHS.",
        "url": "https://news.sky.com/story/patient-death-linked-to-cyber-attack-on-nhs-hospital-trust-says-13388485",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nhs-logo-national-health-service_6924608.jpg?20250522220322",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-25 13:41:00",
        "Headline": "King's College Hospital NHS Foundation Trust says the patient died \"unexpectedly\" during the cyber attack after a \"long wait for a blood test result\".",
        "Content": "\n          Science and Technology reporter\n       The death of a patient has been linked to a cyber attack on the NHS. The attack last year saw 1,100 cancer treatments delayed, 2,000 outpatient appointments cancelled and more than 1,000 operations postponed. Now, the first death of a patient linked to the attack has been confirmed by King's College Hospital NHS Foundation Trust. \"One patient sadly died unexpectedly during the cyber attack,\" said a spokesperson. \"The patient safety incident investigation identified a number of contributing factors that led to the patient's death. \"This included a long wait for a blood test result due to the cyber attack impacting pathology services at the time. \"We have met with the patient's family, and shared the findings of the safety investigation with them.\" IT company Synnovis, which provides blood test services primarily in southeast London, was the victim of a ransomware attack, understood to be carried out by the Russian group Qilin, on 3 June last year. The hospital trusts affected were Guy's and St Thomas', King's College, and Lewisham and Greenwich, along with primary care across six boroughs and two mental health trusts. Read more from Sky News:Doctors using unapproved AI to record patient meetingsMinecraft users targeted by cyber criminals The healthcare providers were unable to do work involving transfusions or blood matching and were forced to use the universal O-type blood for everyone. This, in turn, contributed to a national shortage of O-type blood supplies, according to NHS England.  Sensitive data stolen from an NHS provider in a cyber attack was apparently published online. \"The death now confirmed is tragic, but it is not surprising,\" said Deryck Mitchelson, a former chief information security officer for NHS Scotland, who now holds the same role at cyber security firm Check Point. He added: \"The NHS is critically reliant on a complex network of suppliers and service providers. But that means we are only ever as secure as the weakest link in the chain. \"To those behind these attacks: this wasn't a faceless act. It wasn't just systems or data you targeted - it was care. It was people. One of them has now lost their life. That should weigh heavily.\" Synnovis CEO Mark Dollar said: \"We are deeply saddened to hear that last year's criminal cyberattack has been identified as one of the contributing factors that led to this patient's death. \"Our hearts go out to the family involved.\""
    },
    {
        "title": "Videos show driverless Tesla 'robotaxis' braking hard without warning - and on wrong side of the road ",
        "description": "Regulators are looking into suspected problems with Elon Musk's self-driving \"robotaxis\" after videos showed a few braking suddenly and driving on the wrong side of the road.",
        "url": "https://news.sky.com/story/videos-show-driverless-teslas-braking-hard-without-warning-and-on-wrong-side-of-the-road-13388213",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-tesla-robotaxi_6950024.jpg?20250625041219",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-25 02:43:00",
        "Headline": "The Teslas are being initially overseen by a human \"safety monitor\" in the front seat - but it's unclear if they've had to intervene so far.",
        "Content": "Regulators are looking into suspected problems with Elon Musk's self-driving \"robotaxis\" after videos showed a few braking suddenly and driving on the wrong side of the road. The tests began on Sunday in Austin, Texas, and it's the first time Tesla cars without a human driver have carried paying passengers. Musk sees the concept as a major part of the company's financial future and envisages thousands of the cars operating across the US. However, the National Highway Traffic Safety Administration said on Tuesday it was looking into the apparent errors. \"NHTSA is aware of the referenced incidents and is in contact with the manufacturer to gather additional information,\" the agency said. One video shows a Tesla in a left turn-only lane going straight through an intersection, with the steering wheel shaking erratically, before it briefly veers in the wrong lane. Another clip shows a robotaxi brake hard several times in the middle of the road, apparently responding to the flashing lights of parked police cars. \n                  Elon Musk posts 'negative drug test results'\n                 \n                  Has Gavin Newsom just made his bid for the presidency? \n                 \n                  Donald Trump responds after Elon Musk admitted 'regrets' over explosive row\n                 Tesla has so far not responded to the videos. Ten robotaxis are reportedly part of the Austin test - and in other social media videos they appear to operate as intended and get the thumbs up from reviewers. Tesla shares jumped 8% on Monday as the programme appeared to get off to a good start, but on Tuesday they dropped back nearly 3%. The cars are initially overseen by a human \"safety monitor\" in the front seat - but it's unclear if they've had to intervene in any incidents. Read more from Sky News:Minecraft users targeted by criminals posing as codersDoctors using unapproved AI to record patient meetings Federal regulators also last year launched an investigation into how some privately owned Teslas reacted in low-visibility scenarios following several accidents, including one that was fatal. Elon Musk's vision is to rapidly roll out the robotaxis, but apart from safety concerns he faces competition from current market leader Waymo. The company is a subsidiary of Google owner Alphabet and already offers self-driving taxis - mostly without any human \"safety monitor\" - in Austin, Los Angeles, Atlanta, San Francisco and Phoenix."
    },
    {
        "title": "Businesses urged to strengthen cyber defences amid increase in Iran-adjacent attacks",
        "description": "UK businesses have been warned by the government to redouble their cybersecurity efforts - as experts warn of increased Iran-adjacent attacks following the escalation of tensions in the Middle East.",
        "url": "https://news.sky.com/story/businesses-urged-to-strengthen-cyber-defences-amid-increase-in-iran-adjacent-attacks-13388470",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-stock-cyber-hack_6950483.jpg?20250625150140",
        "type": "Technology",
        "Author": "Tim Baker",
        "Date Published": "2025-06-25 13:16:00",
        "Headline": "Prime Minister Sir Keir Starmer warned today of regular cyberattacks emanating from the like of Russia and Iran against the UK. Information shared with Sky News shows a rise in Iran-adjacent attacks since their conflict with Israel began.",
        "Content": "\n          Political reporter\n              @TimJ_B\n UK businesses have been warned by the government to redouble their cybersecurity efforts - as experts warn of increased Iran-adjacent attacks following the escalation of tensions in the Middle East. Cybersecurity researchers shared with Sky News details of an increase in action from online actors promoting Tehran taking aim at UK-based organisations, along with American and Israeli targets. Analysis from cybersecurity firm EclecticIQ noted a \"significant uptick\" in cyberattacks since the start of the Israel-Iran conflict started around a fortnight ago. Politics latest: PM 'confident' he'll remain Labour leader The company said this included evidence of \"growing collaborations between pro-Iranian and pro-Russian hacktivist groups\". Speaking at a NATO summit today, Prime Minister Sir Keir said the likes of Iran and Russia were carrying out cyberattacks \"on a regular basis\" - adding that the UK had \"to be prepared for them\". The prime minister added that cyberattacks should be considered \"an attack on our country\". \n                  Patient's death linked to cyber attack on NHS, hospital trust says\n                 \n                  Minecraft users targeted by criminals posing as game coders\n                 \n                  Co-op offers 25% off £40 shop as 'thank you' to members after cyberattack\n                 In response to the increase in attacks, a government spokesperson told Sky News: \"UK businesses face a growing number of threats from domestic and foreign cyber criminals who are intent on disrupting not only their operations, but our wider digital economy. \"While some companies are already taking steps to better protect themselves, it is vital that - regardless of size or sector - they all take immediate steps to review and strengthen their defences.\" Among the attacks seen recently were distributed denial of service - DDoS - attacks against British companies, including those in the defence sector. This involves trying to flood a company's computer networks with traffic in a bid to make it crash. Read more:Iranian threat to UK could increase after US strikesNHS trusts' data 'stolen' in cyberattackRussian-linked hackers targeted Ministry of Defence As well as DDoS attacks, malware that deletes data was also deployed, with disinformation and \"influence operations\" also increasing. It is difficult to establish who is carrying out attacks, including where they are located. Analysis of techniques and technical factors can point to an origin. One DDoS attack was launched at outsourcing giant Serco, although the company said its \"robust security operations infrastructure prevented the attack\". EclecticIQ says the scope of the attacks has extended past Israeli entities, with organisations in the US, UK and EU all targeted. Cody Farrow, EclecticIQ's chief executive officer, warned businesses should not \"assume they are out of scope\". Before working in the private sector, Mr Barrow was a senior intelligence officer in the US department of defence at the Pentagon, as well as the NSA and US cyber command. He told Sky News: \"UK companies could be being targeted not because of what they've done, but because of what they represent - which means resilience and remediation playbooks are crucial.\" 👉Search for The Wargame on your podcast app👈 Mr Farrow said Iran could retaliate against Israeli attacks in \"unexpected ways\" and has a history of responding to attacks via cyber operations. \"Retaliation may not be immediate or proportional, and could target companies with ties to Israel, entities perceived as supporting Israeli or Western operations, or symbolic infrastructure,\" he said."
    },
    {
        "title": "'We watched Gavin And Stacey on repeat': Richard E Grant goes on 'emotional' tour in memory of his late wife",
        "description": "Richard E Grant has shared an emotional video of his trip to Barry - the town made famous by the hit TV show Gavin And Stacey.",
        "url": "https://news.sky.com/story/richard-e-grant-goes-on-emotional-gavin-and-stacey-tour-in-memory-of-his-late-wife-13388217",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-richard-e-grant-ruth-jones_6950022.jpg?20250625040624",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-25 03:06:00",
        "Headline": "\"It's really emotional being here,\" Grant said. \"The last months of my wife's life, we watched Gavin And Stacey on repeat - and it just cheered us up endlessly.\"",
        "Content": " Richard E Grant has shared an emotional video of his trip to Barry - the town made famous by the hit TV show Gavin And Stacey. He was joined by the show's co-creator Ruth Jones, who is best known for playing Nessa. They are both filming a new drama called The Other Bennet Sister, which delves into a character in Jane Austen's Pride And Prejudice. Grant excitedly said \"oh my god\" as he stood outside Stacey's family home - and headed across the road to Uncle Bryn's. A trip to Barry Island soon followed to visit some of the sitcom's most famous landmarks, including Marco's Cafe and the beachfront. And the actor's visit wouldn't have been complete without Jones putting on her best Nessa voice - and asking: \"Oh, Rich, what's occurin'? \"It's really emotional being here,\" Grant said. \"The last months of my wife's life, we watched Gavin And Stacey on repeat - and it just cheered us up endlessly.\" In 2021, Grant announced that his wife Joan Washington had died - eight months after she was diagnosed with stage four lung cancer. At the time, he described his family's loss as \"incalculable\"."
    },
    {
        "title": "Injured dog walkers could be costing NHS £23m a year",
        "description": "Injured dog walkers could be costing the NHS about &#163;23m a year, a study suggests.",
        "url": "https://news.sky.com/story/injured-dog-walkers-could-be-costing-nhs-16323m-a-year-13388228",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-dog-dog-walker-goldendoodle_6950028.jpg?20250625051428",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-06-25 03:58:00",
        "Headline": "Researchers recommend teaching \"optimal dog walking practices\" and enforcing proper dog training to minimise the chances of them hurting their human companion.",
        "Content": "Injured dog walkers could be costing the NHS about £23m a year, a study suggests. Hand and wrist injuries from a yanked lead are said to be the most common mishap. Experts from Raigmore Hospital in Inverness and Singapore's Sengkang Hospital looked at the \"understudied topic\" by reviewing five US studies of almost 500,000 dog-walking injuries. Women made up three-quarters of the injuries, and 31% of the cases were in over-65s. Researchers - writing in the journal Injury Prevention - found that broken fingers were the most common injury. Looking at the UK's population of about 8.5 million dogs - one for every seven or eight people - the study estimated the cost of fixing the fractures suffered by unfortunate owners. \"While finger fractures were the most frequently reported injury, the cost analysis in this review focused on distal radius [wrist] fractures due to their substantial economic impact,\" said researchers. \n                  Natalie Herron: Scottish woman jailed for sharing monkey torture videos\n                 \n                  'It's just wrong': Pet owner's plea after 43-year-old tortoise 'taken'\n                 \n                  UK's oldest polar bear euthanised at the age of 28\n                 \"We estimated the potential annual cost of dog walking-related wrist fractures in the UK to exceed £23m.\" Read more from Sky News:More Britons than ever struggling to make ends meet - report Foreign prisoners to be deported earlier under new plans However, they said the total economic cost would be bigger due to loss of productivity from some people needing time off work. \"Preventative measures, including safer leash practices and public safety guidance, should be implemented to reduce injury risk,\" the study suggested. As well as teaching \"optimal dog walking practices\", it also recommended enforcing proper dog training to minimise the chances of pets hurting their human companion."
    }
]