[
    {
        "title": "Trump hints Ukraine election may be needed for peace - as he addresses Kyiv being left out of Russia talks",
        "description": "Donald Trump has suggested Russia's war in Ukraine could have been \"settled very easily\" as he criticised Kyiv's negotiation skills.",
        "url": "https://news.sky.com/story/trump-hints-zelenskyy-election-may-be-needed-for-peace-as-he-addresses-ukraine-being-left-out-of-russia-meeting-13312044",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-president_6833230.jpg?20250219002234",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-18 17:50:00",
        "Headline": "The US president says he was more confident of a \"peace deal\" after Tuesday's talks in Saudi Arabia, in which Russian and American officials also agreed to explore closer relations and economic cooperation.",
        "Content": " Donald Trump has suggested Russia's war in Ukraine could have been \"settled very easily\" as he criticised Kyiv's negotiation skills. In comments after an extraordinary meeting between senior American and Russian officials on Tuesday morning in Saudi Arabia, the US president said of Ukraine: \"They've had a seat [at the table] for three years and a long time before that. \"This could have been settled very easily. Just a half-baked negotiator could have settled this years ago without, I think, the loss of much land and without the loss of any lives and without the loss of cities that are just laying on their side.\" While touting his own negotiation skills, Mr Trump also said he was \"more confident\" about a peace deal after Tuesday's talks, attended by US secretary of state Marco Rubio.  Follow live: Lavrov tells US that NATO troops in Ukraine is 'unacceptable' While speaking from Mar-a-Lago in Florida, Mr Trump also said he would not oppose seeing European peacekeeping troops stationed in Ukraine as part of a peace deal with Russia. He also repeated a proposal that Ukrainian leader Volodymyr Zelenskyy hold elections in Ukraine as a condition of peace. 'Not a Russian thing' \"We have a situation where we haven't had elections in Ukraine, where we have martial law, essentially martial law in Ukraine, where the leader in Ukraine, I mean, I hate to say it, but he's down to 4% approval rating.\" He added: \"If Ukraine wants a seat at the table, wouldn't the people have to say - it has been a long time since they had an election? \"That's not a Russian thing, that's something coming from me and coming from many other countries also.\" Mr Trump also told reporters he and Russian leader Vladimir Putin had discussed Ukraine before the full-scale invasion in 2022. 👉 Listen to Sky News Daily on your podcast app 👈 \"President Putin and I would talk about Ukraine, and it was the apple of his eye, I will tell you that,\" he said. \"But he never, there was never a chance of him going in. And I told him: 'You better not go in, don't go in, don't go in.' And he understood that and he understood it fully.\" US correspondent In another place, at another time, it would have been: \"You're fired.\" Donald Trump coined it differently when he was asked about Volodymyr Zelenskyy, but the sentiment was the same. Asked about suggestions that Russia wanted elections in Ukraine as part of a peace deal, the US president replied: \"I hate to say it, but he's down to a 4% approval… when they want a seat at the table, wouldn't the people of Ukraine say it's been a long time since we had an election? That's not a Russia thing, that's coming from me and other countries.\" From one president to another, it was goodbye. A farewell to the notion that Trump respects Zelenskyy as an equal player in peace negotiations. Read James Matthews's full analysis here US and Russia 'need vibrant diplomatic missions' Mr Trump added he will probably meet with Mr Putin before the end of the month. At Tuesday morning's talks, US and Russian officials agreed to restore embassy staffing and establish a high-level team to negotiate peace in Ukraine in another sign of the significant American change in diplomatic relations with Moscow. Mr Rubio said the two countries \"need to have vibrant diplomatic missions that are able to function normally\". The US and Russia also agreed to explore closer relations and economic cooperation at the meeting. \"Should this conflict come to an acceptable end, the incredible opportunities that exist to partner with the Russians geopolitically on issues of common interest and frankly, economically, on issues that hopefully will be good for the world and also improve our relations in the long term,\" Mr Rubio said. Read more from Sky News:Trump's 'diplomacy' does not look good for Ukraine - analysisStarmer wants US 'backstop' to deter RussiaWho is attending Russia and US peace talks? He added ending Russia's war in Ukraine would require concessions from all sides. The comments came as talks between Russian and US officials in Saudi Arabia ended - part of a remarkable US policy reversal after years of former president Joe Biden leading international efforts to isolate Moscow. 'Very useful' talks, Lavrov says Speaking to reporters after the meeting, Russian foreign minister Sergei Lavrov said \"the conversation was very useful\". \"We not only listened, but also heard each other,\" Mr Lavrov said. \"And I have reason to believe that the American side has started to better understand our position, which we have once again outlined in detail, using specific examples, based on President Putin's repeated speeches.\" US State Department spokesperson Tammy Bruce said even though Ukraine was not at the table on Tuesday, any actual peace negotiations will include the country. Meanwhile, President Volodymyr Zelenskyy said his country will not accept any outcome from this week's talks if Kyiv does not take part. No Ukrainian officials were present at the meeting. Ukraine losing ground to Russia The talks came as Ukraine is slowly but steadily losing ground against more numerous Russian troops in a grinding war that began nearly three years ago. The Ukrainian air force said Russian troops launched a barrage of 176 drones at Ukraine on Monday night, most of which were destroyed or disabled by jamming. One Russian drone struck a residential building in Dolynska in the Kirovohrad region, wounding a mother and her two children and prompting an evacuation of 38 apartments, the regional administration reported. Four more residential buildings were damaged by drone debris in the Cherkasy region of Ukraine, according to local officials. European allies left scrambling Ties between Russia and the US had fallen to their lowest level in decades in recent years - a rift that had been widening since Russia annexed Crimea from Ukraine in 2014 and worsened after Moscow's full-scale invasion in 2022. At that point, the US, along with European nations, imposed a raft of sanctions on Russia and the allies have repeatedly expanded the measures to damage the Russian economy. But the recent US diplomatic blitz on the war has sent Mr Zelenskyy and key European allies scrambling to ensure a seat at the table amid concerns that Washington and Moscow could press ahead with a deal that will not be favourable to Ukraine. On Monday, France called an emergency meeting of European nations, including the UK, to discuss the war. Saudi Arabia seeks to be diplomatic player The meeting between the US and Russia on Tuesday at the Diriyah Palace in the Saudi capital of Riyadh also highlights de facto leader Crown Prince Mohammed bin Salman's efforts to be a major diplomatic player, burnishing a reputation severely tarnished by the 2018 killing of Washington Post journalist Jamal Khashoggi. Saudi state media described the talks as happening at the prince's direction. Saudi Arabia has also helped in prisoner negotiations and hosted Mr Zelenskyy for an Arab League summit in 2023. Mr Zelenskyy had been due to travel to Saudi Arabia this week but rescheduled it to 10 March, suggesting he wanted to avoid his visit being linked to the US-Russia talks since Ukrainian officials were not invited."
    },
    {
        "title": "Donald Trump's direction of travel in diplomacy does not look good for Ukraine",
        "description": "That the United States chose to hold talks with Russia about Ukraine without Ukraine sums up the power imbalance that is upending security assumptions for the whole of Europe.",
        "url": "https://news.sky.com/story/donald-trumps-direction-of-travel-in-diplomacy-does-not-look-good-for-ukraine-13312187",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-steve-witkoff-marco-rubio_6832576.jpg?20250218140706",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-02-18 20:52:00",
        "Headline": "The only currency that seems to matter to the White House is power, and both Kyiv and its European partners are looking all too weak.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  That the United States chose to hold talks with Russia about Ukraine without Ukraine sums up the power imbalance that is upending security assumptions for the whole of Europe. Volodymyr Zelenskyy, the Ukrainian president, has consistently warned that Kyiv must have a seat at the negotiating table for any discussions about ending Vladimir Putin's war to have a chance of success. His European allies also want to have a voice. Yet these requests were ignored by Donald Trump and his strongman approach to diplomacy, with the president instead dispatching his top diplomat and two other senior envoys to meet Russian counterparts in Saudi Arabia on Tuesday. Ukraine war latest: Trump says he's 'more confident' of peace deal Mr Zelenskyy, apparently by chance, had been due to embark on a pre-planned trip to the kingdom later that same day. However, he decided to delay the visit to avoid the appearance of giving any kind of legitimacy to the bilateral encounter between Moscow and Washington. Unfortunately for Kyiv, beyond noisy protest, it has very limited options when it comes to channelling the disruptive force of the Trump White House in its favour. \n                  Trump hints Ukraine election may be needed for peace - as he addresses Kyiv being left out of Russia talks\n                 \n                  Russia 'releases US citizen detained on drug charges' ahead of Ukraine peace talks\n                 \n                  Day 30: What’s it like flying with the vice president?  \n                 👉 Listen to Sky News Daily on your podcast app 👈 The Ukrainian military remains hugely reliant on US weapons to fight Russia's invasion and Mr Zelenskyy has made clear he would want an American element in any international security force that might be agreed upon to monitor a ceasefire - even though this is a role the US appears reluctant to fill and the Kremlin has said would be \"unacceptable\". It means Mr Trump has significant leverage over his Ukrainian counterpart which he will surely use to try to force through negotiations even on terms less favourable to Kyiv. Read more:Analysis - Russia tries to appeal to Trump's business background  The US has already reportedly tried to make Ukraine sign away a large portion of its natural resources to pay for US support - an uncomfortable offer that Mr Zelenskyy has so far declined but an indication of the new transactional approach to US foreign policy. Mr Trump has repeatedly vowed to end Russia's war in Ukraine - even claiming during the US election campaign that he would do this within 24 hours. But he never spelled out how. The past week, however, has offered an indication of the direction of travel and it does not look good for Ukraine. From unilaterally picking up the phone to Vladimir Putin to sanctioning such a high-level meeting with the Russians in Riyadh, the only currency that seems to matter to the White House is power and right now both Kyiv and its European partners are looking all too weak."
    },
    {
        "title": "Easier for children to buy knives than paracetamol, police review finds amid government crackdown",
        "description": "It is easier for children to buy knives than it is to purchase paracetamol a police review has concluded.",
        "url": "https://news.sky.com/story/easier-for-children-to-buy-knives-than-paracetamol-police-review-finds-amid-government-crackdown-13312324",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-knives-knife-crime_6833220.png?20250218233306",
        "type": "Home",
        "Author": "Tom Parmenter",
        "Date Published": "2025-02-18 23:07:00",
        "Headline": "Tougher prison sentences will be introduced for selling knives to under-18s as part of the government crackdown on knife crime.",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  It is easier for children to buy knives than it is to purchase paracetamol a police review has concluded. The damning assessment came as the government launched a crackdown on the sale of bladed weapons to under-18s as part of a series of new anti-knife measures. Tougher prison sentences will be introduced for selling knives to under-18s and retailers will be obliged to report suspicious or bulk purchases of knives that could then be sold on via social media. Collectively the new measures will be known as Ronan's Law, in memory of 16-year-old Ronan Kanda who was stabbed to death in Wolverhampton in 2022 in a case of mistaken identity. His mother Pooja Kanda told Sky News: \"What a legacy to have in my son's name. \"Ronan will live on, he will live on making the difference that the laws exist, that's a legacy.\" On the morning of the attack, his teenage killers had picked up their online delivery of a machete and a ninja sword. \n                  Idris Elba on the power of football - and how it can help tackle knife crime\n                 \n                  I spent 20 years as a London teacher - if a child wants to bring a knife to school they will find a way\n                 \n                  Almost one in five teachers have seen students with knives in England's schools, Sky News survey finds\n                 Ms Kanda continued: \"The murderer of my son just was getting these type of weapons and selling (on social media) \"How scary is that? \"He was able to get them freely on his mother's ID and mother's bank account and then he was selling it for more profit to other children.\" Metropolitan Police Commander Stephen Clayman, who is the national lead for knife crime, said it is sometimes harder to buy paracetamol than it is to buy a knife. Mr Clayman said: \"The age verification is a huge vulnerability, both in terms of at point of sale and at delivery. \"We know that through the tragic stories we hear and have heard, but it continues that there are huge flaws that need to be addressed.\" \"Bizarrely, it is harder to buy paracetamol in some respects than it is to buy a knife. And that can't be right,\" he said. Read more from Sky News:British couple detained in Iran charged with espionageLarge sinkhole forces closure of village high streetWoman charged over 1978 death of five-year-old girl  Home Secretary Yvette Cooper said: \"Everyone has to take responsibility. \"We cannot continue with this online free for all. That makes it too easy with these lethal loopholes of selling knives and dangerous weapons to children. \"It has to be closed. And that's why we need everyone to act.\" Ronan's mother backed the government's strategy but said far more needs to be done across society. She vowed to hold politicians to their promises and continue fighting on behalf of her son for the rest of her life. \"My last breath is dedicated to Ronan, I will continue to fight for my son and to make sure that what has gone wrong is corrected. \"I will die doing that for my son.\""
    },
    {
        "title": "Government launches new vaping study and campaign to warn teens of the dangers",
        "description": "The government is backing a new study to track the long-term effects of vaping on young people &#8211; and launching an anti-vaping campaign aimed at teenagers. ",
        "url": "https://news.sky.com/story/government-launches-new-vaping-study-and-campaign-to-warn-teens-of-the-dangers-13312326",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-vapes-vaping_6833201.jpg?20250218231833",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-18 23:16:00",
        "Headline": "The YouTube and Instagram campaign - called Love Your Lungs - will see influencers such as Big Manny appeal to teenagers. ",
        "Content": "The government is backing a new study to track the long-term effects of vaping on young people – and launching an anti-vaping campaign aimed at teenagers.  The study will track 100,000 young people over 10 years. It will monitor them from the age of eight up to 18, collecting health data and tracking their wellbeing and other behaviours. The long-term effects of vaping are not fully known. It's hoped the UK Research and Innovation (UKRI)-funded study will provide the most detailed information yet on its long-term impacts on young people, officials said. Two other new studies will capture the latest data in vaping research. Public health minister Ashley Dalton said: \"We know that vaping can be a useful tool to quit smoking, but it's crucial we have clear evidence on the long-term health harms, especially for young people. \"This landmark series of studies, combined with our first nationwide youth vaping campaign, will help drive evidence-based, decisive action to protect our children's future.\" \n                  Sale and supply of single-use vapes to be banned\n                 \n                  How would an outdoor smoking ban work – and who would be part of the 'smoke-free generation'? \n                 \n                  Young girls in UK drink, smoke and vape more than boys, says study\n                 Health correspondent It’s a bit of a public health dilemma.  We know smoking kills so vaping has been promoted as a safer alternative, a useful tool to help adult smokers to quit.   But youth vaping has skyrocketed in recent years, with a quarter of 11 to 15 year olds having tried it – mostly young people who had never tried a cigarette before taking up the e-habit.  The problem here is we don’t yet fully understand the dangers of vaping.  So this new government-backed study will provide the most detailed information yet on the impacts of youth vaping. The 10-year study will track 100,000 young people and collect health data as well as monitoring information other physical and mental behaviours.  This will be crucial data to help people to make informed choices.  The government has introduced tough legislation to stop current 15-year-olds from ever being able to buy cigarettes.  They will be the first smoke-free generation.  But potentially also a generation of vapers doing incalculable harm to their bodies.  We just don’t know. Yet.  The YouTube and Instagram campaign - called Love Your Lungs - will see influencers such as Big Manny appeal to teenagers aged 13 to 18. It is the first nationwide campaign across England to inform young people about vaping and nicotine addiction, the Department of Health and Social Care (DHSC) said. The department has also commissioned a video which shows a woman in a toxic relationship, but it transpires her 'partner' is her vape. More from Sky News:The Jam drummer dies aged 69Brits detained in Iran charged with espionage Sarah Sleet, chief executive at Asthma and Lung UK, said: \"The number of non-smokers, particularly young people, taking up vaping is extremely worrying. \"The long-term impact of vaping on the lungs isn't yet known, so research into its effect on young people is really important.\""
    },
    {
        "title": "Pope Francis has 'bilateral pneumonia' but remains in 'good mood', Vatican says",
        "description": "The Pope has been diagnosed with bilateral pneumonia but is in a \"good mood\", the Vatican has said.",
        "url": "https://news.sky.com/story/vatican-cancels-the-popes-weekend-engagements-13311690",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pope-francis-popefrancis_6828458.jpg?20250214154634",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-18 06:03:00",
        "Headline": "Pope Francis, 88, has been in Rome's Gemelli hospital since Friday for bronchitis treatment. Despite his illness, the Vatican said he \"read and worked\" on Monday.",
        "Content": "The Pope has been diagnosed with bilateral pneumonia but is in a \"good mood\", the Vatican has said. It comes after it cancelled Pope Francis's weekend engagements. In a statement, the Vatican said: \"Laboratory tests, chest X-rays and the clinical conditions of the Holy Father continue to present a complex picture. \"The polymicrobial infection, which arose in a context of bronchiectasis and asthmatic bronchitis, and which required the use of antibiotic cortisone therapy, makes the therapeutic treatment more complex. \"The chest CT scan that the Holy Father underwent this afternoon, prescribed by the Vatican health team and the medical team of the Fondazione Policlinico 'A. Gemelli', demonstrated the onset of bilateral pneumonia that required further pharmacological therapy. \"Pope Francis is in a good mood, however.\" The statement went on to say he \"alternated rest with prayer and reading texts\" during Tuesday and that he \"gives thanks for the closeness he feels at this moment and asks, with a grateful heart, that we continue to pray for him\". \n                  Pope stable in hospital and 'asks for prayers', Vatican says - as doctors treat 'complex' infection\n                 \n                  Pope Francis to remain in hospital and miss Sunday prayer, Vatican says\n                 \n                  Pope Francis 'stable' in hospital after being admitted with 'slight fever'\n                 Bilateral pneumonia is inflammation of both lungs, usually caused by an infection, according to the NHS website. The 88-year-old, who as a young adult developed a case of pleurisy and had part of one of his lungs removed, has been in Rome's Gemelli hospital since Friday for bronchitis treatment. On Tuesday, the Vatican said: \"The Pope had a quiet night. He rested. This morning he had breakfast and read some newspaper.\" On Monday, the Vatican said his respiratory tract infection was presenting a \"complex clinical picture\" and he would need to remain in hospital. That evening, the Vatican said the Pope was in a \"stable\" condition with no fever. Spokesperson Matteo Bruni previously said the results of recent tests indicate the pontiff is suffering from a \"polymicrobial respiratory tract infection\" that needed a further change in his drug therapy. Polymicrobial infections are caused by a mix of viruses, bacteria, fungi and parasites. The Vatican said despite his illness, Francis \"read and worked\" on Monday morning, adding he was \"touched by the numerous messages of affection and closeness that he continues to receive in these hours\".  Concerns have been growing about the pontiff's increasingly frail health. Francis, who has been pontiff since 2013, has had influenza and other health problems several times over the past two years. Pilgrims arriving at the Vatican this week have offered their prayers that the pope would recover soon. \"We certainly wish for him to get better very quickly,\" said Reverend Tyler Carter, a Catholic priest from the US. \"He is our father and our shepherd, and so we want his continued health and blessing.\""
    },
    {
        "title": "The Jam drummer Rick Buckler dies aged 69",
        "description": "The Jam drummer Rick Buckler has died aged 69, his former bandmate Paul Weller has confirmed.",
        "url": "https://news.sky.com/story/the-jam-drummer-rick-buckler-dies-aged-69-13312161",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-rick-buckler-the-jam_6832913.jpg?20250218222435",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-18 19:55:00",
        "Headline": "Buckler played for the band from its formation in 1972 until they broke up a decade later. The group released six studio albums and had 18 consecutive UK top 40 singles, four of them reaching number one.",
        "Content": "The Jam drummer Rick Buckler has died aged 69, his former bandmate Paul Weller has confirmed. Buckler was in the mod punk band alongside bass player Bruce Foxton, 69, and lead singer, songwriter, and guitarist Weller, 66. The drummer was part of the group from their formation in 1972 until they broke up a decade later. They never fully reunited but Foxton and Buckler had played together on a number of occasions. Buckler died after a short illness. He \"passed away peacefully on Monday evening in Woking, after a short illness with family by his side\", his management company said in a statement. \"Rick was a loving husband, father and grandfather and was a devoted friend to many, who will be greatly missed.\" The Jam released six studio albums and Buckler played on them all, including the critically-acclaimed All Mod Cons (1978) and Sound Affects (1980). They had 18 consecutive UK top 40 singles, including four number ones, and also had a UK number one album - The Gift. The Jam are best remembered for tracks such as Town Called Malice, Going Underground, and Down In The Tube Station At Midnight. The band split in 1982 and never fully reunited, but Foxton and Buckler subsequently played together on a number of occasions as From The Jam. In a Facebook and Instagram post, Weller said: \"I'm shocked and saddened by Rick's passing. I'm thinking back to us all rehearsing in my bedroom in Stanley Road, Woking. To all the pubs and clubs we played at as kids, to eventually making a record. What a journey! \"We went far beyond our dreams and what we made stands the test of time. \"My deepest sympathy to all family and friends - P.W x\" Weller also shared a tribute from Foxton on the account, in which he said he \"was shocked and devastated to hear the sad news\". He said Buckler was \"a good guy and a great drummer whose innovative drum patterns helped shape our songs. \"I'm glad we had the chance to work together as much as we did. My thoughts are with Leslie and his family at this very difficult time.\" Early years Buckler was born in Woking in Surrey and attended Sheerwater Secondary School, where he met Weller and Foxton, according to multiple reports. The trio formed The Jam in 1972 when they were all still teenagers and released their first single, In The City, in 1977. By the time they split, they were one of the biggest bands in the UK and several of their hits re-entered the UK singles chart, reflecting their popularity at the time. Weller and Buckler reportedly never spoke again barring a brief interaction, with the singer going on to form The Style Council after the dissolution of The Jam. Post-Jam career Buckler formed a number of groups including Time UK, Sharp - which also featured Foxton, and The Gift, named after The Jam's last studio album and playing music from the band's back catalogue. He toured with From The Jam, a new band playing covers of his first group, from 2007 to 2009, where he was joined by Foxton, who is still touring with the group. Read more on Sky News:Blink 182 star selling Banksy artworkCarry On movie actor diesBig winners at the BAFTAs The drummer lived with his wife, with whom he had two children, Jason and Holly. He also wrote a number of books on the history of The Jam, along with his own autobiography That's Entertainment: My Life In The Jam, which was released in 2015."
    },
    {
        "title": "Large sinkhole forces closure of Godstone High Street in Surrey following burst water pipe",
        "description": "A large sinkhole has opened up in a Surrey village - forcing the high street to be closed.",
        "url": "https://news.sky.com/story/large-sinkhole-forces-closure-of-godstone-high-street-in-surrey-following-burst-water-pipe-13312005",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-godstone-surrey-sinkhole_6832802.jpg?20250218205714",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-18 15:55:00",
        "Headline": "Part of Godstone High Street was closed, people were evacuated from buildings and a cordon was put in place after the sinkhole was reported on Monday night.",
        "Content": " A large sinkhole has opened up in a Surrey village - forcing the high street to be closed. It happened after a water pipe burst, with some supplies to homes being affected. Godstone High Street was shut between the Oxted Road and Bletchingley Road junctions, Surrey Police said after reports of the sinkhole emerged on Monday night. A small number of buildings were evacuated as a precaution and a 100m cordon was put in place. The sinkhole measured up to 62ft (19m), according to reports, but this has not been confirmed by authorities. Surrey County Council has declared a major incident and local residents have been urged to avoid the area while repair work is being carried out. Godstone resident Sarah Dennis told Sky News' Matt Barbet on The UK Tonight her home's water supply has been cut off even though she lives around half a mile away. \n                  Man with Down's syndrome died after carer 'landed on him' when jumping into pool, inquest told\n                 \n                  Men who described themselves as 'pedos' plotted to kidnap and abuse boys, trial hears\n                 \n                  Judges who oversaw family court proceedings related to care of Sara Sharif can be named\n                 She said the sinkhole is \"getting bigger and bigger and more homes are being evacuated\". Those forced to leave their homes have \"no idea when they will be able to go back or even when they can get their personal possessions\". 'A lot of large lorries' Back in 2019, there was a \"slight sinkhole\" in the same place, she said, and the village is \"right next to the M25\", meaning there are \"a lot of large lorries using the road regularly\". \"It's really scary to think that's the road all the schoolchildren go down during school time,\" she said. \"Thankfully, we're on half-term at the moment, but it doesn't even bear thinking of what could have happened.\" Nicola and Damian Styles, 46 and 44, live in Godstone High Street and said they were woken up by police knocking on their door at about half past midnight on Tuesday morning, who told them to evacuate their home because there was a risk of a gas explosion. \"It was a shock,\" Mrs Styles said. \"My sister lives in Purley so we just drove there in the middle of the night.\" Mr Styles said: \"We just sort of grabbed everything, the clothes on our back and our work laptops, and drove out quickly.\" An 'absolute nightmare' Alan and Tracey Jones, 75 and 61, who also live in the high street, took in their daughter, her husband, and their baby girl at midnight on Tuesday after police told them to evacuate their flat across the road, whose building now stands on the edge of the sinkhole. Mrs Jones said: \"It's an absolute nightmare. Dreadful.\" \"They [the family] arrived at midnight - the police started to evacuate because there was a fear of a gas explosion.\" Carl Bussey, from Surrey County Council, said around 30 properties are within the cordon affected by the hole and those living there \"are being supported by Tandridge District Council with advice around accommodation\". Teams 'working hard to fix this' SES Water said one of its main water pipes had burst in the high street and it apologised for the disruption. An SES spokesperson said: \"The road has been closed and our teams are on site, together with emergency services and other utility providers, working hard to fix this as quickly as possible. \"A diversion route is in place and we are required to redirect traffic onto a like-for-like A-road to ensure the safety of motorists during the repair process. \"Unfortunately, the burst has impacted water supplies to homes in the area and we're sorry for the disruption this is causing customers. \"We're working hard to reroute water from across our network to restore supply for those customers.\" Avoid the area In a post on Facebook, Surrey Police said: \"If you are in the area, please follow the directions of the emergency services. \"There is currently a large emergency services presence in the area. The road is likely to be closed for an extended period of time - please avoid the area if you can.\" Read more from Sky News:Judge condemns politicians over Gaza familyToronto plane crash: What we knowBritish couple charged with spying Last month, a sinkhole the size of a small swimming pool opened up in Japan, swallowing a truck and trapping its driver. In December, a sinkhole appeared on a housing estate near Merthyr Tydfil in South Wales, while in Pennsylvania the body of a woman who fell into a sinkhole was found."
    },
    {
        "title": "Easier for children to buy knives than paracetamol, police review finds amid government crackdown",
        "description": "It is easier for children to buy knives than it is to purchase paracetamol a police review has concluded.",
        "url": "https://news.sky.com/story/easier-for-children-to-buy-knives-than-paracetamol-police-review-finds-amid-government-crackdown-13312324",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-knives-knife-crime_6833220.png?20250218233306",
        "type": "UK",
        "Author": "Tom Parmenter",
        "Date Published": "2025-02-18 23:07:00",
        "Headline": "Tougher prison sentences will be introduced for selling knives to under-18s as part of the government crackdown on knife crime.",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  It is easier for children to buy knives than it is to purchase paracetamol a police review has concluded. The damning assessment came as the government launched a crackdown on the sale of bladed weapons to under-18s as part of a series of new anti-knife measures. Tougher prison sentences will be introduced for selling knives to under-18s and retailers will be obliged to report suspicious or bulk purchases of knives that could then be sold on via social media. Collectively the new measures will be known as Ronan's Law, in memory of 16-year-old Ronan Kanda who was stabbed to death in Wolverhampton in 2022 in a case of mistaken identity. His mother Pooja Kanda told Sky News: \"What a legacy to have in my son's name. \"Ronan will live on, he will live on making the difference that the laws exist, that's a legacy.\" On the morning of the attack, his teenage killers had picked up their online delivery of a machete and a ninja sword. \n                  Idris Elba on the power of football - and how it can help tackle knife crime\n                 \n                  I spent 20 years as a London teacher - if a child wants to bring a knife to school they will find a way\n                 \n                  Almost one in five teachers have seen students with knives in England's schools, Sky News survey finds\n                 Ms Kanda continued: \"The murderer of my son just was getting these type of weapons and selling (on social media) \"How scary is that? \"He was able to get them freely on his mother's ID and mother's bank account and then he was selling it for more profit to other children.\" Metropolitan Police Commander Stephen Clayman, who is the national lead for knife crime, said it is sometimes harder to buy paracetamol than it is to buy a knife. Mr Clayman said: \"The age verification is a huge vulnerability, both in terms of at point of sale and at delivery. \"We know that through the tragic stories we hear and have heard, but it continues that there are huge flaws that need to be addressed.\" \"Bizarrely, it is harder to buy paracetamol in some respects than it is to buy a knife. And that can't be right,\" he said. Read more from Sky News:British couple detained in Iran charged with espionageLarge sinkhole forces closure of village high streetWoman charged over 1978 death of five-year-old girl  Home Secretary Yvette Cooper said: \"Everyone has to take responsibility. \"We cannot continue with this online free for all. That makes it too easy with these lethal loopholes of selling knives and dangerous weapons to children. \"It has to be closed. And that's why we need everyone to act.\" Ronan's mother backed the government's strategy but said far more needs to be done across society. She vowed to hold politicians to their promises and continue fighting on behalf of her son for the rest of her life. \"My last breath is dedicated to Ronan, I will continue to fight for my son and to make sure that what has gone wrong is corrected. \"I will die doing that for my son.\""
    },
    {
        "title": "Government launches new vaping study and campaign to warn teens of the dangers",
        "description": "The government is backing a new study to track the long-term effects of vaping on young people &#8211; and launching an anti-vaping campaign aimed at teenagers. ",
        "url": "https://news.sky.com/story/government-launches-new-vaping-study-and-campaign-to-warn-teens-of-the-dangers-13312326",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-vapes-vaping_6833201.jpg?20250218231833",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-18 23:16:00",
        "Headline": "The YouTube and Instagram campaign - called Love Your Lungs - will see influencers such as Big Manny appeal to teenagers. ",
        "Content": "The government is backing a new study to track the long-term effects of vaping on young people – and launching an anti-vaping campaign aimed at teenagers.  The study will track 100,000 young people over 10 years. It will monitor them from the age of eight up to 18, collecting health data and tracking their wellbeing and other behaviours. The long-term effects of vaping are not fully known. It's hoped the UK Research and Innovation (UKRI)-funded study will provide the most detailed information yet on its long-term impacts on young people, officials said. Two other new studies will capture the latest data in vaping research. Public health minister Ashley Dalton said: \"We know that vaping can be a useful tool to quit smoking, but it's crucial we have clear evidence on the long-term health harms, especially for young people. \"This landmark series of studies, combined with our first nationwide youth vaping campaign, will help drive evidence-based, decisive action to protect our children's future.\" \n                  Sale and supply of single-use vapes to be banned\n                 \n                  How would an outdoor smoking ban work – and who would be part of the 'smoke-free generation'? \n                 \n                  Young girls in UK drink, smoke and vape more than boys, says study\n                 Health correspondent It’s a bit of a public health dilemma.  We know smoking kills so vaping has been promoted as a safer alternative, a useful tool to help adult smokers to quit.   But youth vaping has skyrocketed in recent years, with a quarter of 11 to 15 year olds having tried it – mostly young people who had never tried a cigarette before taking up the e-habit.  The problem here is we don’t yet fully understand the dangers of vaping.  So this new government-backed study will provide the most detailed information yet on the impacts of youth vaping. The 10-year study will track 100,000 young people and collect health data as well as monitoring information other physical and mental behaviours.  This will be crucial data to help people to make informed choices.  The government has introduced tough legislation to stop current 15-year-olds from ever being able to buy cigarettes.  They will be the first smoke-free generation.  But potentially also a generation of vapers doing incalculable harm to their bodies.  We just don’t know. Yet.  The YouTube and Instagram campaign - called Love Your Lungs - will see influencers such as Big Manny appeal to teenagers aged 13 to 18. It is the first nationwide campaign across England to inform young people about vaping and nicotine addiction, the Department of Health and Social Care (DHSC) said. The department has also commissioned a video which shows a woman in a toxic relationship, but it transpires her 'partner' is her vape. More from Sky News:The Jam drummer dies aged 69Brits detained in Iran charged with espionage Sarah Sleet, chief executive at Asthma and Lung UK, said: \"The number of non-smokers, particularly young people, taking up vaping is extremely worrying. \"The long-term impact of vaping on the lungs isn't yet known, so research into its effect on young people is really important.\""
    },
    {
        "title": "The Jam drummer Rick Buckler dies aged 69",
        "description": "The Jam drummer Rick Buckler has died aged 69, his former bandmate Paul Weller has confirmed.",
        "url": "https://news.sky.com/story/the-jam-drummer-rick-buckler-dies-aged-69-13312161",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-rick-buckler-the-jam_6832913.jpg?20250218222435",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-18 19:55:00",
        "Headline": "Buckler played for the band from its formation in 1972 until they broke up a decade later. The group released six studio albums and had 18 consecutive UK top 40 singles, four of them reaching number one.",
        "Content": "The Jam drummer Rick Buckler has died aged 69, his former bandmate Paul Weller has confirmed. Buckler was in the mod punk band alongside bass player Bruce Foxton, 69, and lead singer, songwriter, and guitarist Weller, 66. The drummer was part of the group from their formation in 1972 until they broke up a decade later. They never fully reunited but Foxton and Buckler had played together on a number of occasions. Buckler died after a short illness. He \"passed away peacefully on Monday evening in Woking, after a short illness with family by his side\", his management company said in a statement. \"Rick was a loving husband, father and grandfather and was a devoted friend to many, who will be greatly missed.\" The Jam released six studio albums and Buckler played on them all, including the critically-acclaimed All Mod Cons (1978) and Sound Affects (1980). They had 18 consecutive UK top 40 singles, including four number ones, and also had a UK number one album - The Gift. The Jam are best remembered for tracks such as Town Called Malice, Going Underground, and Down In The Tube Station At Midnight. The band split in 1982 and never fully reunited, but Foxton and Buckler subsequently played together on a number of occasions as From The Jam. In a Facebook and Instagram post, Weller said: \"I'm shocked and saddened by Rick's passing. I'm thinking back to us all rehearsing in my bedroom in Stanley Road, Woking. To all the pubs and clubs we played at as kids, to eventually making a record. What a journey! \"We went far beyond our dreams and what we made stands the test of time. \"My deepest sympathy to all family and friends - P.W x\" Weller also shared a tribute from Foxton on the account, in which he said he \"was shocked and devastated to hear the sad news\". He said Buckler was \"a good guy and a great drummer whose innovative drum patterns helped shape our songs. \"I'm glad we had the chance to work together as much as we did. My thoughts are with Leslie and his family at this very difficult time.\" Early years Buckler was born in Woking in Surrey and attended Sheerwater Secondary School, where he met Weller and Foxton, according to multiple reports. The trio formed The Jam in 1972 when they were all still teenagers and released their first single, In The City, in 1977. By the time they split, they were one of the biggest bands in the UK and several of their hits re-entered the UK singles chart, reflecting their popularity at the time. Weller and Buckler reportedly never spoke again barring a brief interaction, with the singer going on to form The Style Council after the dissolution of The Jam. Post-Jam career Buckler formed a number of groups including Time UK, Sharp - which also featured Foxton, and The Gift, named after The Jam's last studio album and playing music from the band's back catalogue. He toured with From The Jam, a new band playing covers of his first group, from 2007 to 2009, where he was joined by Foxton, who is still touring with the group. Read more on Sky News:Blink 182 star selling Banksy artworkCarry On movie actor diesBig winners at the BAFTAs The drummer lived with his wife, with whom he had two children, Jason and Holly. He also wrote a number of books on the history of The Jam, along with his own autobiography That's Entertainment: My Life In The Jam, which was released in 2015."
    },
    {
        "title": "British couple detained in Iran charged with espionage",
        "description": "The British couple detained in Iran have been charged with espionage, according to the Iranian judiciary news agency.  ",
        "url": "https://news.sky.com/story/british-couple-detained-in-iran-charged-with-espionage-13311789",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-craig-and-lindsay-foreman_6831859.jpg?20250217182752",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-18 10:20:00",
        "Headline": "Iran has accused Craig and Lindsay Foreman of entering the country \"under the guise of tourists\" and - without providing evidence - accused them of being \"affiliated with intelligence services\".",
        "Content": " The British couple detained in Iran have been charged with espionage, according to the Iranian judiciary news agency.   The pair, named by their family on Monday as Craig and Lindsay Foreman, are accused of \"cooperating with covert institutions linked to the intelligence services of hostile and Western countries\". Iranian state media said last week that the couple were in custody in the southeastern city of Kerman on security-related charges. The UK's Foreign Office said it was \"deeply concerned\" by reports of the espionage charge. \"We continue to raise this case directly with the Iranian authorities,\" it said in a statement. \"We are providing them with consular assistance and remain in close contact with their family members.\" According to Ms Foreman's social media, the couple were on a motorbiking trip across the globe to Australia as part of a positive psychology mission. On Tuesday the Mizan news agency quoted a spokesperson for the judiciary who said the couple \"were monitored with the cooperation of security agencies and arrested\". \n                  Craig and Lindsay Foreman were warned to not travel to 'unsafe' Balochistan\n                 \n                  Craig and Lindsay Foreman: 'West has failed to counter Tehran's hostage diplomacy', says former Iranian prisoner\n                 \n                  Craig and Lindsay Foreman: British couple detained in Iran are named - as family 'significantly concerned'\n                 The statement, translated from Persian, claimed that \"the individuals entered Iran under the guise of tourists and, under the guise of investigative and research work, have collected information in several provinces of the country\". Without revealing sources, officials also allege that \"these individuals were cooperating with covert institutions linked to the intelligence services of hostile and Western countries\". \"The connection of these individuals with several institutions affiliated with intelligence services has been confirmed,\" the statement added. State media published a photograph reportedly showing the couple meeting the UK's ambassador to Iran Hugo Shorter last Wednesday. Two people sitting across a table, opposite to Mr Shorter, could not be identified as their faces were blurred. In December, Ms Foreman posted about how they were about to face \"one of the most challenging\" parts of their trip: Iran and Pakistan and issued an update in January about her visit to Isfahan, a city in central Iran. The couple had planned to travel to the Balochistan province of Pakistan, but had been warned by Khalid Mehmood, 30, about the potential dangers. He told Sky News he advised the couple against visiting some cities \"because they are not safe\". Read more from Sky News:Judge condemns politicians over Gaza familyUSA leaned on Romania over Andrew TateToronto plane crash: What we know The Foreign Office is currently warning people not to travel to Iran, because of the risk of \"arrest, detention and a death sentence\". It also advises against all travel to Balochistan, except the province's southern coast. A Foreign Office spokesperson previously said: \"We are providing consular assistance to two British nationals detained in Iran and are in contact with the local authorities.\" Iran's elite Revolutionary Guards have arrested dozens of foreign visitors and dual nationals in recent years, mostly on espionage and security-related charges. Human rights groups and some Western countries have accused Iran of trying to win concessions from other nations through arrests on trumped up charges. British-Iranian dual nationals like Nazanin Zaghari-Ratcliffe and Anoosheh Ashoori are among those who have spent years behind bars in Iran before diplomatic negotiations helped secure their release."
    },
    {
        "title": "Carry On actor Julian Holloway dies at 80 after brief illness",
        "description": "British actor Julian Holloway, best known for his appearance in eight Carry On films, has died at the age of 80.\n",
        "url": "https://news.sky.com/story/carry-on-actor-julian-holloway-dies-at-80-after-brief-illness-13311938",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-julian-holloway-carry-on-camping_6832556.jpg?20250218140827",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-18 15:37:00",
        "Headline": "Tributes have been pouring in for the TV and film star, the father of former supermodel  and author Sophie Dahl.",
        "Content": "British actor Julian Holloway, best known for his appearance in eight Carry On films, has died at the age of 80.\n Theatrical agency Sharkey and Co said he died on Sunday at the Royal Bournemouth Hospital in Dorset after \"a brief illness\". Another agency, Damn Good Voices, told the Press Association he will be missed. In the 60s and 70s, he played various characters in eight of the cult Carry On film series, including Carry On Doctor, Carry On Up The Khyber, and Carry On Camping. Holloway had a daughter, the supermodel turned author Sophie Dahl, who was born in 1976 to British actress Tessa Dahl, daughter of children's author Roald Dahl. In the 70s he also had parts on Whatever Happened To The Likely Lads?, The New Avengers and The Professionals and continued acting through the 80s and 90s appearing on shows like Doctor Who and Rumpole of the Bailey His film roles included The Rum Diary starring Johnny Depp and A Christmas Carol with Jim Carrey. \n                  MOBO award winners including Central Cee, Bashy and Darkoo revealed at ceremony in Newcastle\n                 \n                  A$AP Rocky found not guilty of firing gun at his former friend\n                 \n                  The Jam drummer Rick Buckler dies aged 69\n                 Heartfelt tributes have been posted online from the world of showbiz. Actress Sarah Douglas, who played Ursa in Superman, expressed her sadness in a post on Facebook describing her longtime friend as the \"wittiest of men\". Meanwhile, he was called \"an accomplished actor\" by the author Morris Bright who also shared pictures on X. He said Holloway \"could play comedy as deftly as serious roles\". In his later years, Holloway lived in California and performed voice work, mainly for cartoons. He featured in James Bond Jr, Where's Wally?, Star Wars: The Clone Wars and Captain Zed And The Zee Zone. Recent animation shows include the sitcom Regular Show, where he voiced the character of death. Holloway was born in Oxfordshire in 1944. His father was the comedian and film star Stanley Holloway, known for films including My Fair Lady and The Lavender Hill Mob. His mother was Violet Lane, a chorus girl who had a short acting career."
    },
    {
        "title": "Woman, 66, charged over 1978 death of five-year-old girl in south London",
        "description": "A 66-year-old woman has been charged with manslaughter over the death of a five-year-old girl in 1978.",
        "url": "https://news.sky.com/story/woman-66-charged-over-1978-death-of-five-year-old-girl-in-south-london-13312012",
        "image_url": "https://e3.365dm.com/21/09/1920x1080/skynews-police-cordon-tape_5507662.jpg?20210910165503",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-18 16:02:00",
        "Headline": "Andrea Bernard died from her injuries in hospital, just over a month after she was assaulted. ",
        "Content": "A 66-year-old woman has been charged with manslaughter over the death of a five-year-old girl in 1978. Metropolitan Police said Janice Nix was charged after Andrea Bernard died following an assault in south London. Nix, from Clapham, southwest London, was also charged with child cruelty in relation to offences towards another child, who was aged eight at the time.   Andrea and Nix were known to each other, the Met Police has said. Nix is due to appear before Uxbridge Magistrates' Court on Wednesday. \n                  Chiltern Firehouse: Fire at luxury London hotel 'started from pizza oven'\n                 \n                  Fire breaks out at Chiltern Firehouse two days before Netflix BAFTA party\n                 \n                  Driver charged over death of girl, 9, who was hit by bus in Bexleyheath\n                 It is reported Andrea was assaulted at an address in Thornton Heath, south London, on 6 June 1978. She was hospitalised and initially treated in Croydon, before being transferred to a specialist burns unit in East Grinstead, West Sussex. She died as a result of her injuries on 13 July 1978. An investigation was launched after the offences were reported in September 2022."
    },
    {
        "title": "Large sinkhole forces closure of Godstone High Street in Surrey following burst water pipe",
        "description": "A large sinkhole has opened up in a Surrey village - forcing the high street to be closed.",
        "url": "https://news.sky.com/story/large-sinkhole-forces-closure-of-godstone-high-street-in-surrey-following-burst-water-pipe-13312005",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-godstone-surrey-sinkhole_6832802.jpg?20250218205714",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-18 15:55:00",
        "Headline": "Part of Godstone High Street was closed, people were evacuated from buildings and a cordon was put in place after the sinkhole was reported on Monday night.",
        "Content": " A large sinkhole has opened up in a Surrey village - forcing the high street to be closed. It happened after a water pipe burst, with some supplies to homes being affected. Godstone High Street was shut between the Oxted Road and Bletchingley Road junctions, Surrey Police said after reports of the sinkhole emerged on Monday night. A small number of buildings were evacuated as a precaution and a 100m cordon was put in place. The sinkhole measured up to 62ft (19m), according to reports, but this has not been confirmed by authorities. Surrey County Council has declared a major incident and local residents have been urged to avoid the area while repair work is being carried out. Godstone resident Sarah Dennis told Sky News' Matt Barbet on The UK Tonight her home's water supply has been cut off even though she lives around half a mile away. \n                  Man with Down's syndrome died after carer 'landed on him' when jumping into pool, inquest told\n                 \n                  Men who described themselves as 'pedos' plotted to kidnap and abuse boys, trial hears\n                 \n                  Judges who oversaw family court proceedings related to care of Sara Sharif can be named\n                 She said the sinkhole is \"getting bigger and bigger and more homes are being evacuated\". Those forced to leave their homes have \"no idea when they will be able to go back or even when they can get their personal possessions\". 'A lot of large lorries' Back in 2019, there was a \"slight sinkhole\" in the same place, she said, and the village is \"right next to the M25\", meaning there are \"a lot of large lorries using the road regularly\". \"It's really scary to think that's the road all the schoolchildren go down during school time,\" she said. \"Thankfully, we're on half-term at the moment, but it doesn't even bear thinking of what could have happened.\" Nicola and Damian Styles, 46 and 44, live in Godstone High Street and said they were woken up by police knocking on their door at about half past midnight on Tuesday morning, who told them to evacuate their home because there was a risk of a gas explosion. \"It was a shock,\" Mrs Styles said. \"My sister lives in Purley so we just drove there in the middle of the night.\" Mr Styles said: \"We just sort of grabbed everything, the clothes on our back and our work laptops, and drove out quickly.\" An 'absolute nightmare' Alan and Tracey Jones, 75 and 61, who also live in the high street, took in their daughter, her husband, and their baby girl at midnight on Tuesday after police told them to evacuate their flat across the road, whose building now stands on the edge of the sinkhole. Mrs Jones said: \"It's an absolute nightmare. Dreadful.\" \"They [the family] arrived at midnight - the police started to evacuate because there was a fear of a gas explosion.\" Carl Bussey, from Surrey County Council, said around 30 properties are within the cordon affected by the hole and those living there \"are being supported by Tandridge District Council with advice around accommodation\". Teams 'working hard to fix this' SES Water said one of its main water pipes had burst in the high street and it apologised for the disruption. An SES spokesperson said: \"The road has been closed and our teams are on site, together with emergency services and other utility providers, working hard to fix this as quickly as possible. \"A diversion route is in place and we are required to redirect traffic onto a like-for-like A-road to ensure the safety of motorists during the repair process. \"Unfortunately, the burst has impacted water supplies to homes in the area and we're sorry for the disruption this is causing customers. \"We're working hard to reroute water from across our network to restore supply for those customers.\" Avoid the area In a post on Facebook, Surrey Police said: \"If you are in the area, please follow the directions of the emergency services. \"There is currently a large emergency services presence in the area. The road is likely to be closed for an extended period of time - please avoid the area if you can.\" Read more from Sky News:Judge condemns politicians over Gaza familyToronto plane crash: What we knowBritish couple charged with spying Last month, a sinkhole the size of a small swimming pool opened up in Japan, swallowing a truck and trapping its driver. In December, a sinkhole appeared on a housing estate near Merthyr Tydfil in South Wales, while in Pennsylvania the body of a woman who fell into a sinkhole was found."
    },
    {
        "title": "MOBO award winners including Central Cee, Bashy and Darkoo revealed at ceremony in Newcastle",
        "description": "Central Cee, Darkoo and Bashy are among the big winners at this year's MOBO Awards.",
        "url": "https://news.sky.com/story/mobo-award-winners-including-central-cee-bashy-and-darkoo-revealed-at-ceremony-in-newcastle-13311994",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-central-cee-reading_6833108.jpg?20250218221609",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-18 22:00:00",
        "Headline": "The 2025 MOBO Awards were held in Newcastle, with performers including Krept & Konan, Bashy, Spice, and Nova Twins. Special gongs were also handed out to athlete Denise Lewis, who took home the \"paving the way\" prize, and Vybz Kartel, who was given the MOBOs impact award.",
        "Content": "Central Cee, Darkoo and Bashy are among the big winners at this year's MOBO Awards. The ceremony took place in Newcastle this evening, with Krept & Konan, Bashy, Spice, and Nova Twins among the performers. Central Cee was named best male act, while Darkoo was named best female and picked up the MOBOs' song of the year award for Favourite Girl, featuring Dess Dior. Central Cee - who wasn't at the ceremony to accept his accolade - is now the joint most-decorated rapper in MOBOs history, tied with Stormzy on seven awards. Bashy's Being Poor Is Expensive was crowned the best album winner, and the actor and rapper was also named best hip-hop act. A special gong was handed out to athlete Denise Lewis, who took home the \"paving the way\" prize, recognising trailblazers across different industries including sports, media and entertainment, as well as music. She follows previous winners such as Idris Elba, Sir Lenny Henry, Nicola Adams, and the late Jamal Edwards. \"King of dancehall\" Vybz Kartel was also honoured with the MOBOs impact award. \"The MOBO Awards have always been about recognising and celebrating cultural pioneers who have reshaped the landscape of music and beyond,\" said MOBOs founder Kanya King ahead of the ceremony. \"Denise Lewis is a true inspiration and it's an absolute pleasure to honour such a legendary figure. Few people have contributed more to their field in this country.\" She went on to say that Vybz Kartel's impact on music was \"immeasurable\", with an influence extending \"beyond the world of dancehall, in which he is a musical giant\". Odeal was named best newcomer and also took the best R&B/soul act prize, while Ayra Starr made history with her two gongs. The Nigerian singer became the first African woman to win best international act and the first female winner of best African music act in 16 years. Other genre category awards included best jazz act for 2023 Mercury Prize winners Ezra Collective, best grime act for Scorcher, best drill act for Pozer, best electronic/dance act for TSHA, best gospel for Annatoria, best Caribbean music act for Shenseea, and best alternative music act for ALT BLK ERA. Elsewhere, Juls was named best producer, 90s Baby Show won the media personality prize, video of the year went to Mnelia's My Man, and actor and musician Jacob Anderson was recognised in the best TV/film performance category, for his role in the series Interview With The Vampire. Central Cee, Raye, and Dave were among the big winners last year, with Soul II Soul, Sugababes and Ghetts receiving special achievement prizes. The MOBOs celebrate black music in the UK and internationally and will mark their 30th anniversary in 2026. In December, King revealed she had been diagnosed with stage four cancer but said she would continue to lead the organisation."
    },
    {
        "title": "Sadiq Khan: London mayor says President Trump 'absolutely' welcome to visit UK in major U-turn",
        "description": "London's mayor Sir Sadiq Khan has defended his past attacks on Donald Trump, telling Sky News that standing up for the city \"does mean sometimes saying boo to a goose\".",
        "url": "https://news.sky.com/story/sadiq-khan-london-mayor-says-president-trump-absolutely-welcome-to-visit-uk-in-major-u-turn-13312116",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sadiq-khan-labour-heathrow_6832846.jpg?20250218185814",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-02-18 18:36:00",
        "Headline": "Sadiq Khan also appeared to strike a less hostile tone in his opposition to Heathrow expansion, after previously threatening a legal challenge against a third runway.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  London's mayor Sir Sadiq Khan has defended his past attacks on Donald Trump, telling Sky News that standing up for the city \"does mean sometimes saying boo to a goose\". But in a major U-turn since calling on the government to ban the US president's 2019 UK state visit, when he was asked if Mr Trump would be welcome this time, he declared: \"Absolutely!\" Sir Sadiq, who was knighted in the King's New Year Honours, was interviewed by Sky News as he hosted talks with the ambassadors of the European Union's 27 member states at a top London hotel. In the past, the mayor has denounced the president as \"ignorant\" on Islam, \"racist\", \"sexist\", \"a homophobe\" and likened his tactics to \"the fascists of the 20th century\". Asked if he still held those views, he said: \"President Trump has fairly and squarely won a second term. Let's judge President Trump on what he does to his second term rather than what he did in his first term. \"My job as the mayor of this great city is to stand up for our values, stand up for our businesses, stand up for our people. And that does mean sometimes saying boo to a goose.\" And Sir Sadiq did criticise new US vice president JD Vance for claiming in a Valentine's Day speech at the Munich Security Conference that free speech was in retreat in the UK and Europe. \n                  Australia 'should be prepared to contribute' to securing Ukraine's freedom, former PM says\n                 \n                  Politics latest: Trump's approach to Russia 'looks like appeasement'\n                 \n                  Public services prepare for up to 11% cuts - as defence secretary says 'we must rearm'\n                 \"We had a situation a couple of days ago where it was said in words to the effect that the biggest threat facing our country and our continent is a lack of freedom of speech,\" said the mayor. \"Woe betide me being criticised for exercising my freedom of speech. Contrary to what JD Vance might think, we have freedom of speech in this country.\"  Sir Sadiq was also critical of the president's threat of \"trade wars and tariffs\", suggesting they could damage American companies doing business in London and the UK. Read more from Sky News:Starmer wants US 'backstop' to deter RussiaWho attended Russia and US peace talks? \"London is the number one city of choice for foreign direct investment for many businesses across the globe,\" he said. \"We've got many great American companies invested in London, whether it's in culture - Netflix and many other studios have opened recently in this great city of ours - financial institutions, legal and others currently invested in London. \"We do great business with the USA in terms of services and goods. I want it to carry on. An issue with tariffs and trade wars is that there are more people who lose out from those than win from those.\" On another Trump state visit, which the president is known to want, the mayor said: \"I'd like President Trump to come to London so he can see some of the misunderstandings he has of our city. \"So he can see there is no threat to freedom of speech in this great city of ours. So he can see that actually Muslims, Jews, Christians, Hindus and Sikhs don't just tolerate each other, we respect, celebrate and embrace each other. \"So he can see for himself the fact that diversity is a strength, not a weakness. He can see for himself that many people in this great city of ours and country of ours love America, love American culture, indeed in the past have loved American politics and are looking forward to working closely with him going forward.\"  Sir Sadiq also appeared to strike a less hostile tone in his opposition to Heathrow expansion, after previously threatening a legal challenge against a third runway. \"I'm a pro-growth mayor,\" he said. \"I'm a pro-business mayor, as evidenced by the policies of the last eight years. I want a better Heathrow, not a bigger Heathrow. \"If Heathrow can come up with plans that address issues around noise, around air, around climate change, that pays for the underground M25, re-routing the A4, improvements to Southern Rail, improvements on the Piccadilly line, improvements on the Elizabeth line, we'll look at them. \"Let's see what Heathrow's plans are. What the Climate Change Committee - well respected - has said [is] that any expansion of aviation must abide with our climate change commitments. Let's wait and see what Heathrow come up with.\"  Denying this was a change in his position, he added: \"Not at all. I'm quite clear in relation to standing up for London, but also standing up for our environment, for air quality, for noise pollution and for Londoners. \"And it's really important to wait for Heathrow to have their plans before I launch a legal challenge against hypotheticals.\""
    },
    {
        "title": "Trump hints Ukraine election may be needed for peace - as he addresses Kyiv being left out of Russia talks",
        "description": "Donald Trump has suggested Russia's war in Ukraine could have been \"settled very easily\" as he criticised Kyiv's negotiation skills.",
        "url": "https://news.sky.com/story/trump-hints-zelenskyy-election-may-be-needed-for-peace-as-he-addresses-ukraine-being-left-out-of-russia-meeting-13312044",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-president_6833230.jpg?20250219002234",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-18 17:50:00",
        "Headline": "The US president says he was more confident of a \"peace deal\" after Tuesday's talks in Saudi Arabia, in which Russian and American officials also agreed to explore closer relations and economic cooperation.",
        "Content": " Donald Trump has suggested Russia's war in Ukraine could have been \"settled very easily\" as he criticised Kyiv's negotiation skills. In comments after an extraordinary meeting between senior American and Russian officials on Tuesday morning in Saudi Arabia, the US president said of Ukraine: \"They've had a seat [at the table] for three years and a long time before that. \"This could have been settled very easily. Just a half-baked negotiator could have settled this years ago without, I think, the loss of much land and without the loss of any lives and without the loss of cities that are just laying on their side.\" While touting his own negotiation skills, Mr Trump also said he was \"more confident\" about a peace deal after Tuesday's talks, attended by US secretary of state Marco Rubio.  Follow live: Lavrov tells US that NATO troops in Ukraine is 'unacceptable' While speaking from Mar-a-Lago in Florida, Mr Trump also said he would not oppose seeing European peacekeeping troops stationed in Ukraine as part of a peace deal with Russia. He also repeated a proposal that Ukrainian leader Volodymyr Zelenskyy hold elections in Ukraine as a condition of peace. 'Not a Russian thing' \"We have a situation where we haven't had elections in Ukraine, where we have martial law, essentially martial law in Ukraine, where the leader in Ukraine, I mean, I hate to say it, but he's down to 4% approval rating.\" He added: \"If Ukraine wants a seat at the table, wouldn't the people have to say - it has been a long time since they had an election? \"That's not a Russian thing, that's something coming from me and coming from many other countries also.\" Mr Trump also told reporters he and Russian leader Vladimir Putin had discussed Ukraine before the full-scale invasion in 2022. 👉 Listen to Sky News Daily on your podcast app 👈 \"President Putin and I would talk about Ukraine, and it was the apple of his eye, I will tell you that,\" he said. \"But he never, there was never a chance of him going in. And I told him: 'You better not go in, don't go in, don't go in.' And he understood that and he understood it fully.\" US correspondent In another place, at another time, it would have been: \"You're fired.\" Donald Trump coined it differently when he was asked about Volodymyr Zelenskyy, but the sentiment was the same. Asked about suggestions that Russia wanted elections in Ukraine as part of a peace deal, the US president replied: \"I hate to say it, but he's down to a 4% approval… when they want a seat at the table, wouldn't the people of Ukraine say it's been a long time since we had an election? That's not a Russia thing, that's coming from me and other countries.\" From one president to another, it was goodbye. A farewell to the notion that Trump respects Zelenskyy as an equal player in peace negotiations. Read James Matthews's full analysis here US and Russia 'need vibrant diplomatic missions' Mr Trump added he will probably meet with Mr Putin before the end of the month. At Tuesday morning's talks, US and Russian officials agreed to restore embassy staffing and establish a high-level team to negotiate peace in Ukraine in another sign of the significant American change in diplomatic relations with Moscow. Mr Rubio said the two countries \"need to have vibrant diplomatic missions that are able to function normally\". The US and Russia also agreed to explore closer relations and economic cooperation at the meeting. \"Should this conflict come to an acceptable end, the incredible opportunities that exist to partner with the Russians geopolitically on issues of common interest and frankly, economically, on issues that hopefully will be good for the world and also improve our relations in the long term,\" Mr Rubio said. Read more from Sky News:Trump's 'diplomacy' does not look good for Ukraine - analysisStarmer wants US 'backstop' to deter RussiaWho is attending Russia and US peace talks? He added ending Russia's war in Ukraine would require concessions from all sides. The comments came as talks between Russian and US officials in Saudi Arabia ended - part of a remarkable US policy reversal after years of former president Joe Biden leading international efforts to isolate Moscow. 'Very useful' talks, Lavrov says Speaking to reporters after the meeting, Russian foreign minister Sergei Lavrov said \"the conversation was very useful\". \"We not only listened, but also heard each other,\" Mr Lavrov said. \"And I have reason to believe that the American side has started to better understand our position, which we have once again outlined in detail, using specific examples, based on President Putin's repeated speeches.\" US State Department spokesperson Tammy Bruce said even though Ukraine was not at the table on Tuesday, any actual peace negotiations will include the country. Meanwhile, President Volodymyr Zelenskyy said his country will not accept any outcome from this week's talks if Kyiv does not take part. No Ukrainian officials were present at the meeting. Ukraine losing ground to Russia The talks came as Ukraine is slowly but steadily losing ground against more numerous Russian troops in a grinding war that began nearly three years ago. The Ukrainian air force said Russian troops launched a barrage of 176 drones at Ukraine on Monday night, most of which were destroyed or disabled by jamming. One Russian drone struck a residential building in Dolynska in the Kirovohrad region, wounding a mother and her two children and prompting an evacuation of 38 apartments, the regional administration reported. Four more residential buildings were damaged by drone debris in the Cherkasy region of Ukraine, according to local officials. European allies left scrambling Ties between Russia and the US had fallen to their lowest level in decades in recent years - a rift that had been widening since Russia annexed Crimea from Ukraine in 2014 and worsened after Moscow's full-scale invasion in 2022. At that point, the US, along with European nations, imposed a raft of sanctions on Russia and the allies have repeatedly expanded the measures to damage the Russian economy. But the recent US diplomatic blitz on the war has sent Mr Zelenskyy and key European allies scrambling to ensure a seat at the table amid concerns that Washington and Moscow could press ahead with a deal that will not be favourable to Ukraine. On Monday, France called an emergency meeting of European nations, including the UK, to discuss the war. Saudi Arabia seeks to be diplomatic player The meeting between the US and Russia on Tuesday at the Diriyah Palace in the Saudi capital of Riyadh also highlights de facto leader Crown Prince Mohammed bin Salman's efforts to be a major diplomatic player, burnishing a reputation severely tarnished by the 2018 killing of Washington Post journalist Jamal Khashoggi. Saudi state media described the talks as happening at the prince's direction. Saudi Arabia has also helped in prisoner negotiations and hosted Mr Zelenskyy for an Arab League summit in 2023. Mr Zelenskyy had been due to travel to Saudi Arabia this week but rescheduled it to 10 March, suggesting he wanted to avoid his visit being linked to the US-Russia talks since Ukrainian officials were not invited."
    },
    {
        "title": "Donald Trump's direction of travel in diplomacy does not look good for Ukraine",
        "description": "That the United States chose to hold talks with Russia about Ukraine without Ukraine sums up the power imbalance that is upending security assumptions for the whole of Europe.",
        "url": "https://news.sky.com/story/donald-trumps-direction-of-travel-in-diplomacy-does-not-look-good-for-ukraine-13312187",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-steve-witkoff-marco-rubio_6832576.jpg?20250218140706",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2025-02-18 20:52:00",
        "Headline": "The only currency that seems to matter to the White House is power, and both Kyiv and its European partners are looking all too weak.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  That the United States chose to hold talks with Russia about Ukraine without Ukraine sums up the power imbalance that is upending security assumptions for the whole of Europe. Volodymyr Zelenskyy, the Ukrainian president, has consistently warned that Kyiv must have a seat at the negotiating table for any discussions about ending Vladimir Putin's war to have a chance of success. His European allies also want to have a voice. Yet these requests were ignored by Donald Trump and his strongman approach to diplomacy, with the president instead dispatching his top diplomat and two other senior envoys to meet Russian counterparts in Saudi Arabia on Tuesday. Ukraine war latest: Trump says he's 'more confident' of peace deal Mr Zelenskyy, apparently by chance, had been due to embark on a pre-planned trip to the kingdom later that same day. However, he decided to delay the visit to avoid the appearance of giving any kind of legitimacy to the bilateral encounter between Moscow and Washington. Unfortunately for Kyiv, beyond noisy protest, it has very limited options when it comes to channelling the disruptive force of the Trump White House in its favour. \n                  Trump hints Ukraine election may be needed for peace - as he addresses Kyiv being left out of Russia talks\n                 \n                  Russia 'releases US citizen detained on drug charges' ahead of Ukraine peace talks\n                 \n                  Day 30: What’s it like flying with the vice president?  \n                 👉 Listen to Sky News Daily on your podcast app 👈 The Ukrainian military remains hugely reliant on US weapons to fight Russia's invasion and Mr Zelenskyy has made clear he would want an American element in any international security force that might be agreed upon to monitor a ceasefire - even though this is a role the US appears reluctant to fill and the Kremlin has said would be \"unacceptable\". It means Mr Trump has significant leverage over his Ukrainian counterpart which he will surely use to try to force through negotiations even on terms less favourable to Kyiv. Read more:Analysis - Russia tries to appeal to Trump's business background  The US has already reportedly tried to make Ukraine sign away a large portion of its natural resources to pay for US support - an uncomfortable offer that Mr Zelenskyy has so far declined but an indication of the new transactional approach to US foreign policy. Mr Trump has repeatedly vowed to end Russia's war in Ukraine - even claiming during the US election campaign that he would do this within 24 hours. But he never spelled out how. The past week, however, has offered an indication of the direction of travel and it does not look good for Ukraine. From unilaterally picking up the phone to Vladimir Putin to sanctioning such a high-level meeting with the Russians in Riyadh, the only currency that seems to matter to the White House is power and right now both Kyiv and its European partners are looking all too weak."
    },
    {
        "title": "In Ukraine peace talks Russia tries to appeal to Trump's business background - it sounds like Moscow's succeeding",
        "description": "As Russia's foreign minister of more than 20 years, Sergei Lavrov is not one for big emotions.",
        "url": "https://news.sky.com/story/in-ukraine-peace-talks-russia-tries-to-appeal-to-trumps-business-background-it-sounds-like-moscows-succeeding-13312058",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sergei-lavrov-yuri-ushakov_6832771.jpg?20250218175343",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-02-18 17:06:00",
        "Headline": "By dangling the carrot of untapped business opportunities, Russia has secured the sort of superpower respect it hasn't had for the last three years and even managed to push its claim that it is the victim, not the aggressor, in the conflict with Ukraine.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  As Russia's foreign minister of more than 20 years, Sergei Lavrov is not one for big emotions. So when he says the talks in Riyadh, Saudi Arabia, about ending the war in Ukraine were \"not unsuccessful\", that's diplomatic speak for \"we're pretty chuffed\". And the Russians have plenty of reasons to cheer. Ukraine-Russia peace talks latest The imagery, for starters. After three years in the international wilderness, isolated by the West, they once again have a seat at the table. Quite literally. And this wasn't just any table. This was superpower to superpower; a visual representation of respect from Washington that will go a long way in Moscow. What's more, it gave Russia the chance to reinforce its narrative around the war - that it is the victim, not the aggressor - and we're already seeing that. \n                  Trump hints Ukraine election may be needed for peace - as he addresses Kyiv being left out of Russia talks\n                 \n                  Donald Trump's direction of travel in diplomacy does not look good for Ukraine\n                 \n                  What next after US-Russia talks and why was meeting in Saudi Arabia?\n                 Russia's focus on peace \"has been there from the very beginning\", Kremlin spokesman Dmitry Peskov said. I think Russia will also be extremely pleased by the noises that have come from the other side of the table. 👉 Listen to Sky News Daily on your podcast app 👈 The Kremlin's got the US talking about geopolitical and economic cooperation. The State Department even mentioned \"historic investment opportunities\" in the same sentence as an end to the war. That suggests to me that the removal of sanctions and the resumption of relations with Moscow is all tied into a peace deal, which Russia will count as a victory already. More on peace talks:Unclear what the minerals offer meansThe new US-Russia world order Ahead of the talks, Russia made it clear what's in it for the Americans. Kirill Dmitriev, the head of Russia's sovereign wealth fund, spoke about the billions of dollars American business has lost by leaving the Russian market as a result of the invasion. Russia says its market is 'extremely attractive' \"The US and many other countries are beginning to understand that the Russian market is extremely attractive and that they need to be present there,\" he told Russian state media in Riyadh. By framing things financially, Moscow is trying to appeal to Donald Trump's business background. It sounds like they're succeeding, with the discussions already being shaped by cold, hard economics. Ukraine (and Europe) might accuse the two sides of putting profits first and peace second. More from Sky News:Plane passengers' miracle escapeSinkhole closes village high streetIs Germany turning to the far right? And while US secretary of state Marco Rubio spoke of all sides needing to make concessions, there hasn't been any sign of that from Moscow just yet. Quite the opposite. In his comments after the talks finished, Mr Lavrov took the chance to reassert Russia's red lines - no NATO membership for Ukraine and no NATO member troops there either, regardless of which flag they were operating under. Normally a negotiation is about give-and-take, but at the moment, Ukraine will no doubt feel like the US is doing all the giving while Russia is only taking."
    },
    {
        "title": "What next after US-Russia talks and why was meeting in Saudi Arabia?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/what-next-after-us-russia-talks-and-why-was-meeting-in-saudi-arabia-13312051",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-daily-podcast-180225_6832735.jpg?20250218165547",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-18 16:33:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 Russia's foreign minister and the US secretary of state have met in Saudi Arabia for the first time since the war in Ukraine began three years ago, to discuss a possible peace deal. Why is it such a significant moment?  With the meeting taking place in Saudi Arabia, and given its diplomacy in arranging the Israel-Hamas ceasefire, how has the kingdom under Mohammed bin Salman become a global power broker in President Trump's new world order? Tom Cheshire hosts today's Sky News Daily looking at what all the power players want from the talks. He's joined by security and defence editor Deborah Haynes and Dr Lina Khatib, associate fellow of the Middle East and North Africa programme at Chatham House. Producers: Soila Apparicio, Jada-Kai Meosa JohnEditor: Philly Beaumont "
    },
    {
        "title": "Pope Francis has 'bilateral pneumonia' but remains in 'good mood', Vatican says",
        "description": "The Pope has been diagnosed with bilateral pneumonia but is in a \"good mood\", the Vatican has said.",
        "url": "https://news.sky.com/story/vatican-cancels-the-popes-weekend-engagements-13311690",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pope-francis-popefrancis_6828458.jpg?20250214154634",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-18 06:03:00",
        "Headline": "Pope Francis, 88, has been in Rome's Gemelli hospital since Friday for bronchitis treatment. Despite his illness, the Vatican said he \"read and worked\" on Monday.",
        "Content": "The Pope has been diagnosed with bilateral pneumonia but is in a \"good mood\", the Vatican has said. It comes after it cancelled Pope Francis's weekend engagements. In a statement, the Vatican said: \"Laboratory tests, chest X-rays and the clinical conditions of the Holy Father continue to present a complex picture. \"The polymicrobial infection, which arose in a context of bronchiectasis and asthmatic bronchitis, and which required the use of antibiotic cortisone therapy, makes the therapeutic treatment more complex. \"The chest CT scan that the Holy Father underwent this afternoon, prescribed by the Vatican health team and the medical team of the Fondazione Policlinico 'A. Gemelli', demonstrated the onset of bilateral pneumonia that required further pharmacological therapy. \"Pope Francis is in a good mood, however.\" The statement went on to say he \"alternated rest with prayer and reading texts\" during Tuesday and that he \"gives thanks for the closeness he feels at this moment and asks, with a grateful heart, that we continue to pray for him\". \n                  Pope stable in hospital and 'asks for prayers', Vatican says - as doctors treat 'complex' infection\n                 \n                  Pope Francis to remain in hospital and miss Sunday prayer, Vatican says\n                 \n                  Pope Francis 'stable' in hospital after being admitted with 'slight fever'\n                 Bilateral pneumonia is inflammation of both lungs, usually caused by an infection, according to the NHS website. The 88-year-old, who as a young adult developed a case of pleurisy and had part of one of his lungs removed, has been in Rome's Gemelli hospital since Friday for bronchitis treatment. On Tuesday, the Vatican said: \"The Pope had a quiet night. He rested. This morning he had breakfast and read some newspaper.\" On Monday, the Vatican said his respiratory tract infection was presenting a \"complex clinical picture\" and he would need to remain in hospital. That evening, the Vatican said the Pope was in a \"stable\" condition with no fever. Spokesperson Matteo Bruni previously said the results of recent tests indicate the pontiff is suffering from a \"polymicrobial respiratory tract infection\" that needed a further change in his drug therapy. Polymicrobial infections are caused by a mix of viruses, bacteria, fungi and parasites. The Vatican said despite his illness, Francis \"read and worked\" on Monday morning, adding he was \"touched by the numerous messages of affection and closeness that he continues to receive in these hours\".  Concerns have been growing about the pontiff's increasingly frail health. Francis, who has been pontiff since 2013, has had influenza and other health problems several times over the past two years. Pilgrims arriving at the Vatican this week have offered their prayers that the pope would recover soon. \"We certainly wish for him to get better very quickly,\" said Reverend Tyler Carter, a Catholic priest from the US. \"He is our father and our shepherd, and so we want his continued health and blessing.\""
    },
    {
        "title": "Jannik Sinner: Lawyer for world tennis number one hits back at 'unfair' criticism of doping case settlement",
        "description": "Jannik Sinner's lawyer has hit back at \"unfair\" criticism over the world tennis number one only receiving a three-month ban in a doping case settlement.",
        "url": "https://news.sky.com/story/jannik-sinner-lawyer-for-world-tennis-number-one-hits-back-at-unfair-criticism-of-doping-case-settlement-13312159",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-jannik-jannik-sinner_6833039.jpg?20250218213425",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-02-18 20:12:00",
        "Headline": "Jannik Sinner has accepted a ban which expires in time for him to compete in the Italian and French Opens in May - triggering a \"favouritism\" accusation from Novak Djokovic. ",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  Jannik Sinner's lawyer has hit back at \"unfair\" criticism over the world tennis number one only receiving a three-month ban in a doping case settlement. Lawyers for the Italian player successfully argued it was not a case of cheating but contamination from a massage that was responsible for two positive tests last year for a banned anabolic steroid. Sinner has won two Grand Slams - the US Open and Australian Open - since testing positive. And there have been claims from 24-time Grand Slam champion Novak Djokovic that the majority of players do not feel that punishment is fair and \"there is favouritism\". But Sinner's lawyer, Jamie Singer, told Sky News: \"I think the players are always hawks when it's another player involved and possibly doves when it's them. \"It is very unfair. He [Sinner] has been through the process from the very beginning by the book. And there's no favouritism. It just so happens that these circumstances have been very unusual. \"He says he feels that he's been treated quite harshly. \"The players have quite a platform, but they don't necessarily have the opportunity to investigate and get into all the details that are out there. So they make their opinions known. But perhaps the facts do need a bit more investigation.\" The background to the case Having overturned a provisional - initially secret - suspension last April, Sinner was cleared to play on by the International Tennis Integrity Agency. They accepted Sinner's mitigation that Clostebol - a substance derived from testosterone - came into his system via a spray his physiotherapist had used on a cut. But a higher body, the World Anti-Doping Agency (WADA), appealed believing Sinner should face a sanction. Then, with a hearing looming at the Court of Arbitration for Sport (CAS), a deal was cut by Sinner's legal team to avoid the minimum one-year ban he could have faced. \"He sees it from completely the other perspective that he had an independent tribunal that found there was no sanction to be applied,\" Mr Singer said in an exclusive interview. \"And yet why is he accepting three months later? So it took a little bit of time to persuade him that it was actually the right thing to do - to accept WADA's offer rather than going all the way to a CAS case. \"He says he feels that he's been treated quite harshly, but he accepts that everyone's entitled to their own opinion.\" Past tests being looked at In a separate discovery on Tuesday, the world's top anti-doping lawyer revealed to Sky News that Sinner's past tests were examined again. WADA general counsel Ross Wenzel said: \"WADA went back and looked at every single one of Mr Sinner's samples for the 12 months before the two positives in March of last year to see whether there was any even indication, albeit not meeting the identification criteria, but any suspicious indication of this substance in any of those samples. \"And the answer from all of the labs, and this is a large number of samples, was that there was not. So I think whatever people say and think about this case, it is not a doping case or a cheating case.\" Read more from Sky News:Passengers describe plane crash escapeHuge sinkhole forces high street closure And there was an insistence that Sinner did not get off lightly and a convenient resolution was not provided to enable a return to play in time for the French Open in May. 'Right and fair outcome' - WADA \"A three-month sanction was the right and fair outcome in this case, given these very, very unique facts,\" Mr Wenzel said. \"The ability to agree this case resolution agreement at any stage of the process is something that is clearly set out in the rules. \"It's something that WADA has done on I think 67 occasions since this provision came into effect about four years ago… and it is something that we felt was the right outcome in this case.\" After seeing a bandage, Sinner had apparently sought assurances from his physio that no prohibited substance was used to treat the cut. Only after the bandage was removed was a spray applied that led to Sinner testing positive. Mr Wenzel said: \"This was, if you like, almost the paradigm case for agreeing a resolution, because the minimum sanction [a one-year ban] would, in our view, and I think many would agree with this, have been unfair given the specific facts of this case.\""
    },
    {
        "title": "Australia 'should be prepared to contribute' to securing Ukraine's freedom, former PM says",
        "description": "A former Australian prime minister has said his country should be \"prepared to make a contribution\" to protect the freedom of Ukraine.",
        "url": "https://news.sky.com/story/australia-should-be-prepared-to-contribute-to-securing-ukraines-freedom-former-pm-says-13312025",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-tony-abbott-australia_6832748.png?20250218182218",
        "type": "World",
        "Author": "Faye Brown",
        "Date Published": "2025-02-18 16:25:00",
        "Headline": "Tony Abbott, who led the conservative Liberal Party, also tells Sky News Donald Trump will \"blight\" his second presidency if he does not help Ukraine, and Britain should lead the way. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  A former Australian prime minister has said his country should be \"prepared to make a contribution\" to protect the freedom of Ukraine. Tony Abbott told Sky News' Politics Hub With Sophy Ridge that no country \"will be safe against a bully\" if Vladimir Putin wins the war. He called on Britain to take the lead in protecting Ukraine even without a US backstop - but said all the free countries of the world should be \"prepared to make a stand\". Politics Live: Tump warned against 'blight' on his presidency with Russia deal  Mr Abbott, who led the conservative Liberal Party, said: \"I personally think that Australia should be prepared to make a contribution to the long term freedom and security of Ukraine. \"The Ukrainians have been fighting for the freedom of everyone. And if Putin is able to snuff out the freedom and the independence of Ukraine, what smaller country anywhere is safe against a bully? \"Is Taiwan safe? Is Australia, for that matter, safe? Is Japan safe? \"This is why it's important that whatever the Americans ultimately do, the free countries of the world are prepared to make a stand in support of the freedom of Ukraine.\" It comes after Sir Keir Starmer urged America to provide a \"security guarantee\" to deter Putin and said he is prepared to send British troops to Ukraine if a peace deal is made. The UK prime minister was speaking following a summit of continental leaders that was arranged by French President Emmanuel Macron, after Donald Trump shocked the world by arranging bilateral talks between the US and Russia - excluding Europe and Ukraine.  Mr Abbott said Mr Trump \"will blight his second presidency\" if he hands a victory to Putin. \"If the result of anything the American president does is to leave Ukraine broken, defenceless, and ultimately a colony of imperial Russia, I think that would be a tragedy,\" he said. He said Sir Keir was \"sensible and brave\" to consider sending peace keeping troops, but he should be prepared to do this without America's help, and on its own if necessary. He said: \"Britain is a substantial power. After the United States, it's the second most powerful country, notwithstanding the current weakness of the British Army. And it should be prepared to take a stand for freedom by protecting Ukraine. \"Britain should be prepared to lead here and it should not expect yet again to ride on America's coat tails.\" Mr Trump has said the US no longer sees the defence of Europe as its primary concern in a major change of policy since the Second World War. It has prompted calls for the UK and other NATO countries to increase defence spending. Read More:Labour needs to 'rearm Britain' with 'more muscular defence'Analysis: Sombre Starmer confronts emerging new world order Speaking after the Paris summit on Monday night, Sir Keir said a \"US security guarantee\" is the only path to peace in Ukraine. But he also insisted \"Europe must play its role\", adding: \"I'm prepared to consider committing British forces on the ground alongside others if there is a lasting peace agreement. \"So I will go to Washington next week to meet President Trump and discuss what we see as the key elements of a lasting peace.\" 👉 Listen to Sky News Daily on your podcast app 👈 However, despite three hours of emergency talks, European leaders left the meeting without a common view. German Chancellor Olaf Scholz described the idea of deploying European peacekeepers as \"completely premature\" and said it was \"completely the wrong time to have this discussion\". And Denmark's Mette Frederiksen said her country was \"open to discussing many things\" but stressed her nation was still very far off deploying its own soldiers to Ukraine. Watch the full interview on the Politics Hub with Sophy Ridge from 6.30pm"
    },
    {
        "title": "British couple detained in Iran charged with espionage",
        "description": "The British couple detained in Iran have been charged with espionage, according to the Iranian judiciary news agency.  ",
        "url": "https://news.sky.com/story/british-couple-detained-in-iran-charged-with-espionage-13311789",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-craig-and-lindsay-foreman_6831859.jpg?20250217182752",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-18 10:20:00",
        "Headline": "Iran has accused Craig and Lindsay Foreman of entering the country \"under the guise of tourists\" and - without providing evidence - accused them of being \"affiliated with intelligence services\".",
        "Content": " The British couple detained in Iran have been charged with espionage, according to the Iranian judiciary news agency.   The pair, named by their family on Monday as Craig and Lindsay Foreman, are accused of \"cooperating with covert institutions linked to the intelligence services of hostile and Western countries\". Iranian state media said last week that the couple were in custody in the southeastern city of Kerman on security-related charges. The UK's Foreign Office said it was \"deeply concerned\" by reports of the espionage charge. \"We continue to raise this case directly with the Iranian authorities,\" it said in a statement. \"We are providing them with consular assistance and remain in close contact with their family members.\" According to Ms Foreman's social media, the couple were on a motorbiking trip across the globe to Australia as part of a positive psychology mission. On Tuesday the Mizan news agency quoted a spokesperson for the judiciary who said the couple \"were monitored with the cooperation of security agencies and arrested\". \n                  Craig and Lindsay Foreman were warned to not travel to 'unsafe' Balochistan\n                 \n                  Craig and Lindsay Foreman: 'West has failed to counter Tehran's hostage diplomacy', says former Iranian prisoner\n                 \n                  Craig and Lindsay Foreman: British couple detained in Iran are named - as family 'significantly concerned'\n                 The statement, translated from Persian, claimed that \"the individuals entered Iran under the guise of tourists and, under the guise of investigative and research work, have collected information in several provinces of the country\". Without revealing sources, officials also allege that \"these individuals were cooperating with covert institutions linked to the intelligence services of hostile and Western countries\". \"The connection of these individuals with several institutions affiliated with intelligence services has been confirmed,\" the statement added. State media published a photograph reportedly showing the couple meeting the UK's ambassador to Iran Hugo Shorter last Wednesday. Two people sitting across a table, opposite to Mr Shorter, could not be identified as their faces were blurred. In December, Ms Foreman posted about how they were about to face \"one of the most challenging\" parts of their trip: Iran and Pakistan and issued an update in January about her visit to Isfahan, a city in central Iran. The couple had planned to travel to the Balochistan province of Pakistan, but had been warned by Khalid Mehmood, 30, about the potential dangers. He told Sky News he advised the couple against visiting some cities \"because they are not safe\". Read more from Sky News:Judge condemns politicians over Gaza familyUSA leaned on Romania over Andrew TateToronto plane crash: What we know The Foreign Office is currently warning people not to travel to Iran, because of the risk of \"arrest, detention and a death sentence\". It also advises against all travel to Balochistan, except the province's southern coast. A Foreign Office spokesperson previously said: \"We are providing consular assistance to two British nationals detained in Iran and are in contact with the local authorities.\" Iran's elite Revolutionary Guards have arrested dozens of foreign visitors and dual nationals in recent years, mostly on espionage and security-related charges. Human rights groups and some Western countries have accused Iran of trying to win concessions from other nations through arrests on trumped up charges. British-Iranian dual nationals like Nazanin Zaghari-Ratcliffe and Anoosheh Ashoori are among those who have spent years behind bars in Iran before diplomatic negotiations helped secure their release."
    },
    {
        "title": "Hamas says bodies of Bibas family to be handed over - with six more Israelis to walk free on Saturday",
        "description": "The bodies of the family of an Israeli hostage who was released two weeks ago will be handed over on Thursday, Hamas has said.",
        "url": "https://news.sky.com/story/hamas-says-bodies-of-bibas-family-to-be-handed-over-with-six-more-israelis-to-walk-free-on-saturday-13311919",
        "image_url": "https://e3.365dm.com/23/11/1920x1080/skynews-shiri-bibas-ariel-kfir_6376697.jpg?20231129151946",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-18 13:37:00",
        "Headline": "Israel has said negotiations on the second phase of the deal will \"happen this week\".",
        "Content": "The bodies of the family of an Israeli hostage who was released two weeks ago will be handed over on Thursday, Hamas has said. Yarden Bibas was freed on 1 February - only to find out his wife Shiri and two children, four-year-old Ariel and nine-month-old Kfir, had reportedly died in an airstrike. Mr Bibas was taken hostage separately from his family. Israel has said it is extremely concerned about the condition of Shiri, Ariel and Kfir but has never confirmed their deaths. Hamas leader Khalil al Hayya said on Tuesday that the Bibas family would be among four bodies to be handed over. But in a statement, the Bibas family said they have not yet received any official confirmation about the return of the bodies. \"In the past few hours, we have been in turmoil following Hamas spokesperson's announcement about the planned return of our Shiri, Ariel, and Kfir this Thursday as part of the hostages' remains release phase,\" the statement read. \"We want to make it clear that while we are aware of these reports, we have not yet received any official confirmation regarding this matter. Until we receive definitive confirmation, our journey is not over.\" Six more living hostages, the final due to be released under the first phase of the Gaza ceasefire deal, will also walk free on Saturday, according to the group. Only three had been expected to be released this weekend. Meanwhile, Israel has said negotiations on the second phase of the deal will \"happen this week\". Foreign minister Gideon Saar said it would involve the country's remaining hostages being exchanged for more Palestinian prisoners. \"If we see there is a constructive dialogue with a possible horizon of getting to an agreement (then) we will make this timeframe work longer,\" Mr Saar said. Israelis who survived being kidnapped during the 7 October attack in 2023 have been released in small groups since the first six-week phase began last month.  Three more - Alexander Troufanov, Sagui Dekel Chen and Iair Horn - were freed last weekend. The swap included 369 Palestinians, the most released up until now, and 19 Israeli hostages have been returned so far in the current phase - which ends at the start of March.  The deal has provided a vital pause in the fighting that's devastated Gaza and left tens of thousands dead. It's allowed more food and aid to get in and some of the hundreds of thousands of displaced Palestinians have been able to return home. Continuation of the truce is not guaranteed, and negotiations on a second phase were supposed to begin on 2 February. Agreeing terms of the next phase is expected to be difficult as it includes questions about a lasting ceasefire and who will run Gaza in the future. Mr Saar told reporters on Tuesday a \"Hezbollah model\" wouldn't be acceptable and Israel demanded a \"total demilitarisation of Gaza\". Simply passing control from Hamas to the Palestinian Authority would not be allowed, he added. \"We will not accept the continued presence of Hamas or any other terrorist organisation in Gaza,\" said Mr Saar. Read more:Marco Rubio backs Netanyahu's war aimsIsrael receives US shipment of heavy bombs  President Trump has suggested a controversial plan for the US to \"take over\" Gaza, rebuild it, and move out Palestinians - a plan roundly rejected by Western powers but welcomed by Israeli leader Benjamin Netanyahu. Israel's foreign minister said he was aware of an alternative plan being worked on by Arab states. A separate Israeli official also said mobile homes would start to be delivered into Gaza to provide shelter for some of those displaced. Hamas had accused Israel of delaying the move and threatened to postpone the release of any more hostages. More than 48,000 Palestinians have been killed during the war, according to the Hamas-run Gaza health ministry, which does not differentiate between civilians and combatants. At least 1,200 Israelis were murdered and more than 250 kidnapped when the group attacked on 7 October 2023."
    },
    {
        "title": "Trump hints Ukraine election may be needed for peace - as he addresses Kyiv being left out of Russia talks",
        "description": "Donald Trump has suggested Russia's war in Ukraine could have been \"settled very easily\" as he criticised Kyiv's negotiation skills.",
        "url": "https://news.sky.com/story/trump-hints-zelenskyy-election-may-be-needed-for-peace-as-he-addresses-ukraine-being-left-out-of-russia-meeting-13312044",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-president_6833230.jpg?20250219002234",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-18 17:50:00",
        "Headline": "The US president says he was more confident of a \"peace deal\" after Tuesday's talks in Saudi Arabia, in which Russian and American officials also agreed to explore closer relations and economic cooperation.",
        "Content": " Donald Trump has suggested Russia's war in Ukraine could have been \"settled very easily\" as he criticised Kyiv's negotiation skills. In comments after an extraordinary meeting between senior American and Russian officials on Tuesday morning in Saudi Arabia, the US president said of Ukraine: \"They've had a seat [at the table] for three years and a long time before that. \"This could have been settled very easily. Just a half-baked negotiator could have settled this years ago without, I think, the loss of much land and without the loss of any lives and without the loss of cities that are just laying on their side.\" While touting his own negotiation skills, Mr Trump also said he was \"more confident\" about a peace deal after Tuesday's talks, attended by US secretary of state Marco Rubio.  Follow live: Lavrov tells US that NATO troops in Ukraine is 'unacceptable' While speaking from Mar-a-Lago in Florida, Mr Trump also said he would not oppose seeing European peacekeeping troops stationed in Ukraine as part of a peace deal with Russia. He also repeated a proposal that Ukrainian leader Volodymyr Zelenskyy hold elections in Ukraine as a condition of peace. 'Not a Russian thing' \"We have a situation where we haven't had elections in Ukraine, where we have martial law, essentially martial law in Ukraine, where the leader in Ukraine, I mean, I hate to say it, but he's down to 4% approval rating.\" He added: \"If Ukraine wants a seat at the table, wouldn't the people have to say - it has been a long time since they had an election? \"That's not a Russian thing, that's something coming from me and coming from many other countries also.\" Mr Trump also told reporters he and Russian leader Vladimir Putin had discussed Ukraine before the full-scale invasion in 2022. 👉 Listen to Sky News Daily on your podcast app 👈 \"President Putin and I would talk about Ukraine, and it was the apple of his eye, I will tell you that,\" he said. \"But he never, there was never a chance of him going in. And I told him: 'You better not go in, don't go in, don't go in.' And he understood that and he understood it fully.\" US correspondent In another place, at another time, it would have been: \"You're fired.\" Donald Trump coined it differently when he was asked about Volodymyr Zelenskyy, but the sentiment was the same. Asked about suggestions that Russia wanted elections in Ukraine as part of a peace deal, the US president replied: \"I hate to say it, but he's down to a 4% approval… when they want a seat at the table, wouldn't the people of Ukraine say it's been a long time since we had an election? That's not a Russia thing, that's coming from me and other countries.\" From one president to another, it was goodbye. A farewell to the notion that Trump respects Zelenskyy as an equal player in peace negotiations. Read James Matthews's full analysis here US and Russia 'need vibrant diplomatic missions' Mr Trump added he will probably meet with Mr Putin before the end of the month. At Tuesday morning's talks, US and Russian officials agreed to restore embassy staffing and establish a high-level team to negotiate peace in Ukraine in another sign of the significant American change in diplomatic relations with Moscow. Mr Rubio said the two countries \"need to have vibrant diplomatic missions that are able to function normally\". The US and Russia also agreed to explore closer relations and economic cooperation at the meeting. \"Should this conflict come to an acceptable end, the incredible opportunities that exist to partner with the Russians geopolitically on issues of common interest and frankly, economically, on issues that hopefully will be good for the world and also improve our relations in the long term,\" Mr Rubio said. Read more from Sky News:Trump's 'diplomacy' does not look good for Ukraine - analysisStarmer wants US 'backstop' to deter RussiaWho is attending Russia and US peace talks? He added ending Russia's war in Ukraine would require concessions from all sides. The comments came as talks between Russian and US officials in Saudi Arabia ended - part of a remarkable US policy reversal after years of former president Joe Biden leading international efforts to isolate Moscow. 'Very useful' talks, Lavrov says Speaking to reporters after the meeting, Russian foreign minister Sergei Lavrov said \"the conversation was very useful\". \"We not only listened, but also heard each other,\" Mr Lavrov said. \"And I have reason to believe that the American side has started to better understand our position, which we have once again outlined in detail, using specific examples, based on President Putin's repeated speeches.\" US State Department spokesperson Tammy Bruce said even though Ukraine was not at the table on Tuesday, any actual peace negotiations will include the country. Meanwhile, President Volodymyr Zelenskyy said his country will not accept any outcome from this week's talks if Kyiv does not take part. No Ukrainian officials were present at the meeting. Ukraine losing ground to Russia The talks came as Ukraine is slowly but steadily losing ground against more numerous Russian troops in a grinding war that began nearly three years ago. The Ukrainian air force said Russian troops launched a barrage of 176 drones at Ukraine on Monday night, most of which were destroyed or disabled by jamming. One Russian drone struck a residential building in Dolynska in the Kirovohrad region, wounding a mother and her two children and prompting an evacuation of 38 apartments, the regional administration reported. Four more residential buildings were damaged by drone debris in the Cherkasy region of Ukraine, according to local officials. European allies left scrambling Ties between Russia and the US had fallen to their lowest level in decades in recent years - a rift that had been widening since Russia annexed Crimea from Ukraine in 2014 and worsened after Moscow's full-scale invasion in 2022. At that point, the US, along with European nations, imposed a raft of sanctions on Russia and the allies have repeatedly expanded the measures to damage the Russian economy. But the recent US diplomatic blitz on the war has sent Mr Zelenskyy and key European allies scrambling to ensure a seat at the table amid concerns that Washington and Moscow could press ahead with a deal that will not be favourable to Ukraine. On Monday, France called an emergency meeting of European nations, including the UK, to discuss the war. Saudi Arabia seeks to be diplomatic player The meeting between the US and Russia on Tuesday at the Diriyah Palace in the Saudi capital of Riyadh also highlights de facto leader Crown Prince Mohammed bin Salman's efforts to be a major diplomatic player, burnishing a reputation severely tarnished by the 2018 killing of Washington Post journalist Jamal Khashoggi. Saudi state media described the talks as happening at the prince's direction. Saudi Arabia has also helped in prisoner negotiations and hosted Mr Zelenskyy for an Arab League summit in 2023. Mr Zelenskyy had been due to travel to Saudi Arabia this week but rescheduled it to 10 March, suggesting he wanted to avoid his visit being linked to the US-Russia talks since Ukrainian officials were not invited."
    },
    {
        "title": "Donald Trump's direction of travel in diplomacy does not look good for Ukraine",
        "description": "That the United States chose to hold talks with Russia about Ukraine without Ukraine sums up the power imbalance that is upending security assumptions for the whole of Europe.",
        "url": "https://news.sky.com/story/donald-trumps-direction-of-travel-in-diplomacy-does-not-look-good-for-ukraine-13312187",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-steve-witkoff-marco-rubio_6832576.jpg?20250218140706",
        "type": "US",
        "Author": "Deborah Haynes",
        "Date Published": "2025-02-18 20:52:00",
        "Headline": "The only currency that seems to matter to the White House is power, and both Kyiv and its European partners are looking all too weak.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  That the United States chose to hold talks with Russia about Ukraine without Ukraine sums up the power imbalance that is upending security assumptions for the whole of Europe. Volodymyr Zelenskyy, the Ukrainian president, has consistently warned that Kyiv must have a seat at the negotiating table for any discussions about ending Vladimir Putin's war to have a chance of success. His European allies also want to have a voice. Yet these requests were ignored by Donald Trump and his strongman approach to diplomacy, with the president instead dispatching his top diplomat and two other senior envoys to meet Russian counterparts in Saudi Arabia on Tuesday. Ukraine war latest: Trump says he's 'more confident' of peace deal Mr Zelenskyy, apparently by chance, had been due to embark on a pre-planned trip to the kingdom later that same day. However, he decided to delay the visit to avoid the appearance of giving any kind of legitimacy to the bilateral encounter between Moscow and Washington. Unfortunately for Kyiv, beyond noisy protest, it has very limited options when it comes to channelling the disruptive force of the Trump White House in its favour. \n                  Trump hints Ukraine election may be needed for peace - as he addresses Kyiv being left out of Russia talks\n                 \n                  Russia 'releases US citizen detained on drug charges' ahead of Ukraine peace talks\n                 \n                  Day 30: What’s it like flying with the vice president?  \n                 👉 Listen to Sky News Daily on your podcast app 👈 The Ukrainian military remains hugely reliant on US weapons to fight Russia's invasion and Mr Zelenskyy has made clear he would want an American element in any international security force that might be agreed upon to monitor a ceasefire - even though this is a role the US appears reluctant to fill and the Kremlin has said would be \"unacceptable\". It means Mr Trump has significant leverage over his Ukrainian counterpart which he will surely use to try to force through negotiations even on terms less favourable to Kyiv. Read more:Analysis - Russia tries to appeal to Trump's business background  The US has already reportedly tried to make Ukraine sign away a large portion of its natural resources to pay for US support - an uncomfortable offer that Mr Zelenskyy has so far declined but an indication of the new transactional approach to US foreign policy. Mr Trump has repeatedly vowed to end Russia's war in Ukraine - even claiming during the US election campaign that he would do this within 24 hours. But he never spelled out how. The past week, however, has offered an indication of the direction of travel and it does not look good for Ukraine. From unilaterally picking up the phone to Vladimir Putin to sanctioning such a high-level meeting with the Russians in Riyadh, the only currency that seems to matter to the White House is power and right now both Kyiv and its European partners are looking all too weak."
    },
    {
        "title": "Florida man shoots two Israeli tourists after mistaking them for Palestinians, police say",
        "description": "A Florida man has been charged with attempted murder after shooting two Israeli tourists - who he shot at because he thought they were Palestinian.&#160;",
        "url": "https://news.sky.com/story/florida-man-shoots-two-israeli-tourists-after-mistaking-them-for-palestinians-police-say-13311790",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-mordechai-brafman-miami-dade_6832259.jpg?20250218094515",
        "type": "US",
        "Author": "Sabah Choudhry",
        "Date Published": "2025-02-18 10:32:00",
        "Headline": "The victims - whose car was shot at 17 times - were Israeli tourists, according to local authorities. The suspect told police he opened fire because he thought they were Palestinian.",
        "Content": "\n          News correspondent\n       A Florida man has been charged with attempted murder after shooting two Israeli tourists - who he shot at because he thought they were Palestinian.  Mordechai Brafman, 27, shot at their car 17 times in Miami Beach on Saturday night. The men in the car - who local media are reporting as father and son - were Israeli visitors unknown to Brafman, according to Miami police. Both survived the attack. In a police interview, Brafman said he was driving his truck along Miami Beach when he saw two people he assumed were Palestinian - and so he stopped and fired shots, according to police. Sky News' US partner network NBC News named the father and son as Yaron and Ari Rabi, respectively. They report that Ari suffered a gunshot wound to his shoulder, while Yaron suffered a graze wound to his left forearm. Read more on Sky News:US-led peace talks with Russia beginVatican cancels Pope's weekend engagementsPlane crashes and flips at Toronto airport \"It was like a truck passing next to (us)\", Ari told Local 10 media in Miami. \"Boom, boom, boom - and he randomly started shooting. \"He put the window down, driver's seat, and just blasted (us).\" Ari said he was \"happy\" and thankful to be alive. Human rights advocates say there has been a rise in Islamophobic, anti-Palestinian and antisemitism in the US since Israel's war in Gaza. Other recent incidents include a man from Illinois stabbing 6-year-old Palestinian-American Wadea al Fayoume 26 times to death - and stabbing his mother a dozen times. A woman from Texas was also charged with attempted murder - after being accused of trying to drown a three-year-old Palestinian child."
    },
    {
        "title": "Meghan shares rare picture of Lilibet as she unveils renamed lifestyle brand As Ever",
        "description": "The Duchess of Sussex has relaunched her lifestyle brand under a new name - and shared a rare picture of her daughter Lilibet.",
        "url": "https://news.sky.com/story/meghan-shares-rare-picture-of-lilibet-as-she-unveils-renamed-lifestyle-brand-as-ever-13311902",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-meghan-markle-duchess-of-sussex_6789696.jpg?20250218152258",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-18 13:15:00",
        "Headline": "The Duchess of Sussex posts a video of herself on Instagram to announce the renaming of her lifestyle brand from American Riviera Orchard to As Ever. It comes as her Netflix show is set for release in two weeks.",
        "Content": "The Duchess of Sussex has relaunched her lifestyle brand under a new name - and shared a rare picture of her daughter Lilibet. Posting to her recently-created Instagram account, Meghan said she was \"thrilled\" to be changing the name of her American Riviera Orchard lifestyle brand to As Ever - a project which she \"poured my heart into\". As Ever's website features an image of Lilibet running outside with her mother, surrounded by nature. In the Instagram video post, Meghan, who married Prince Harry in 2018, says in the caption that As Ever \"means 'as it's always been' or some even say 'in the same way as always'. \"If you've followed along since my days of creating The Tig, you'll know this couldn't be truer for me. \"This new chapter is an extension of what has always been my love language, beautifully weaving together everything I cherish - food, gardening, entertaining, thoughtful living, and finding joy in the everyday.\" Her Netflix show With Love, Meghan - which the streamer says \"reimagines the genre of lifestyle\" - launches in two weeks. \n                  Meghan's Valentine's Day message to Harry after William and Kate share romantic photo\n                 \n                  Harry and Meghan make surprise visit to hand out food to LA fires evacuees in Pasadena\n                 \n                  Mindy Kaling spills the beans on Meghan's cooking skills\n                 Read more: Mindy Kaling spills the beans on Meghan's cooking skillsSussexes make surprise visit to hand out food to LA fires evacuees The former Suits star returned to Instagram after four years on 1 January, when she appeared in a black and white video as she ran along a beach and wrote \"2025\" in the sand. She followed it up the next day with the trailer for the upcoming Netflix show, with the message: \"I have been so excited to share this with you! I hope you love the show as much as I loved making it.\" The launch of the show was delayed due to the devastating LA wildfires in January. \"I'm thankful to my partners at Netflix for supporting me in delaying the launch, as we focus on the needs of those impacted by the wildfires in my home state of California,\" Meghan said at the time in a statement to Tudum, the official companion site to Netflix. Meghan's latest post before her video announcing As Ever was on Valentine's Day, when she posted a picture of her and Harry kissing and said: \"My love, I will eat burgers & fries and fish & chips with you forever. Thank you for you.\""
    },
    {
        "title": "Donald Trump administration leans on Romania to relax restrictions on Andrew Tate and brother Tristan, reports",
        "description": "Donald Trump's administration has reportedly made multiple attempts to pressurise Romania to lift travel restrictions on Andrew Tate and his brother Tristan, who are facing a series of criminal charges in the country.",
        "url": "https://news.sky.com/story/donald-trump-administration-leans-on-romania-to-relax-restrictions-on-andrew-tate-and-brother-tristan-reports-13311782",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-andrew-tate-tristan-tate_6832357.jpg?20250218111715",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-18 10:10:00",
        "Headline": "It is claimed that Mr Trump's special envoy - who admits supporting the Tate brothers - personally intervened after American officials requested their passports be returned.",
        "Content": "Donald Trump's administration has reportedly made multiple attempts to pressurise Romania to lift travel restrictions on Andrew Tate and his brother Tristan, who are facing a series of criminal charges in the country. The pair have been released from house arrest, but are not allowed to leave the country. They deny charges of human trafficking, sexual misconduct and money laundering, as well as starting an organised crime group. It is claimed US officials have discussed the Tates' case with their Romanian counterparts, according to reports in The Financial Times. Andrew Tate - a champion of Donald Trump - along with his brother are dual US and UK nationals. The newspaper reports that, during several conversations, a request was made to return the brothers' passports while legal proceedings continue. Tate brothers: What are the charges? It also claims that Mr Trump's special envoy Richard Grenell personally met Romania's foreign minister, although Mr Grenell said he had \"no substantive conversation\" with Emil Hurezeanu and there was no follow-up. \n                  MP launches legal action against Andrew and Tristan Tate over social media posts\n                 \n                  Andrew Tate house arrest order lifted by court in Romania\n                 \n                  Andrew Tate and brother Tristan lose £2.8m court case over unpaid tax claims\n                 However, according to The Financial Times, he said: \"I support the Tate brothers as evident by my publicly available tweets.\" A spokesperson for Mr Hurezeanu told the newspaper: \"Romanian courts are independent and operate based on the law, there is due process.\" Earlier this month Mr Grenell alleged that, under President Joe Biden's administration, America's aid programmes had been \"weaponised against people and politicians who weren't woke\", and referenced Romania as an example. The post on X suggested that funding from the US Agency for International Development (USAID) has been used to strengthen Romania's judicial system. Since Mr Trump's inauguration, USAID programmes have been slashed. Meanwhile, Tristan Tate also referenced the same claim in a post on X calling on supporters to find out \"if any USAID went to Romania to fund any particular Lawfare base investigations\". Andrew Tate has previously used the term 'lawfare' to compare the legal system to a weapon being used to target innocent people, like himself. Romania has also been targeted by vice president JD Vance, who last week criticised the decision of the country's top court to cancel Romania's elections because of accusations of Russian meddling. Mr Vance dismissed allegations of a disinformation campaign. \"If you're running in fear of your own voters, there is nothing America can do for you,\" he said. Read more from Sky News:Meta builds world's longest subsea cableThames Water handed lifelineVillage says sorry for fake snow The brothers are fighting a series of legal battles not just in Romania, but the UK and now also the US. The Tate brothers have consistently denied any wrongdoing in connection with all the legal action taking place. A recent lawsuit filed in Florida accuses both Tate brothers of conspiring to coerce a woman into sex work, luring her to Romania and defaming her after her testimony to Romanian authorities. The Tate brothers had previously sued her for defamation in 2023. Police in Bedfordshire are also investigating allegations of rape and human trafficking. In January, an appeal court in Romania sent the case against the brothers back to prosecutors. They were also released from house arrest but told they cannot leave Romania."
    },
    {
        "title": "Russia 'releases US citizen detained on drug charges' ahead of Ukraine peace talks",
        "description": "Russia has reportedly released a American citizen who had been detained on drug charges, just hours ahead of its talks with the US over Ukraine.",
        "url": "https://news.sky.com/story/russia-releases-us-citizen-detained-on-drug-charges-ahead-of-ukraine-peace-talks-13311676",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kalob-wayne-byers-russia_6832088.jpg?20250218015832",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-18 02:18:00",
        "Headline": "Kalob Byers Wayne was released by Russia on Monday, hours before the talks were set to begin, according to reports.",
        "Content": "Russia has reportedly released a American citizen who had been detained on drug charges, just hours ahead of its talks with the US over Ukraine. The New York Times said that Kalob Byers Wayne had been released by Russia on Monday, hours before the discussions were set to begin. The 28-year-old had been arrested at Moscow's Vnukovo airport after flying in from Istanbul on 7 February, on drug smuggling charges after allegedly being caught with cannabis-laced marmalade. Russian police claimed he had tried to smuggle a \"significant amount\" of drugs into the country. Last week, a court in the Russian capital ordered Mr Wayne be held in pre-trial detention for 30 days. It isn't clear if his release is aimed at easing tensions in the talks between the US and Russia ahead of negotiations. The US outlet quoted a Kremlin spokesperson who said the Saudi-based talks would aim to improve relations between Moscow and Washington, \"so certain events can be viewed in this context\". \n                  Donald Trump's direction of travel in diplomacy does not look good for Ukraine\n                 \n                  Trump hints Ukraine election may be needed for peace - as he addresses Kyiv being left out of Russia talks\n                 \n                  Day 30: What’s it like flying with the vice president?  \n                 Beginning on Tuesday, the two countries are set to meet in Saudi Arabia to discuss ending the war in Ukraine. But in doing so, the US has sidelined Kyiv from the discussions, as well as Europe, sparking alarm on the continent. European leaders have been left scrambling to readjust to their new reality where they cannot rely on the US as much in terms of security and defence under the Trump administration. Read more from Sky News:Starmer wants US 'backstop' to deter RussiaRussia says UK should stay out of Ukraine talksPope's infection is a 'complex clinical situation' 👉 Listen to Sky News Daily on your podcast app 👈 It comes after another US citizen, Marc Fogel, was recently released by Russia and welcomed home by US President Donald Trump. The 63-year-old history teacher was also arrested on drug smuggling charges - for what he said was medically prescribed cannabis. \"I feel like the luckiest man on earth right now,\" Mr Fogel said after President Trump welcomed him to the White House. An American flag draped around his shoulders and a beer in his hands, he added: \"I am not the hero in this at all. President Trump is the hero.\" Last year, the largest prisoner exchange between the West and Russia since the Cold War took place. It saw three Americans freed among 24 people being released."
    },
    {
        "title": "Alleged leader of cultlike 'Zizians' arrested in US as group linked to killings",
        "description": "The apparent leader of a cult-like group linked to multiple killings has been arrested in the US.",
        "url": "https://news.sky.com/story/alleged-leader-of-cultlike-zizians-arrested-in-us-as-group-linked-to-killings-13311735",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-jack-lasota-cult_6832234.jpg?20250218091136",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-18 08:35:00",
        "Headline": "Jack LaSota - known as Ziz - was arrested alongside two others, with alleged members of the group implicated in the death of a border patrol officer last month.",
        "Content": "The apparent leader of a cult-like group linked to multiple killings has been arrested in the US. Police said Jack LaSota - known as Ziz - was detained on Sunday in Maryland, and faces charges including trespass, possession of a handgun in a vehicle, and obstructing and loitering. Michelle Zajko, 32, and Daniel Blank, 26, were arrested on similar charges and all three are being held at a local jail. \"The Zizians\" have been tied to the killing of US border patrol agent David Maland in January, as well as five other homicides in Vermont, Pennsylvania and California. Mr Maland, 44, died in a shootout following a traffic stop near the Canadian border in Vermont. One of LaSota's followers, German national Ophelia Bauckholt, was also killed in the incident when a woman she was with, Teresa Youngblut, allegedly opened fire. LaSota, 34, who uses she/her pronouns and said online she is a transgender woman, is a computer programmer and appears to be the leader of the Zizians. According to the Associated Press news agency, the group appears to be made up of highly intelligent computer scientists, mostly in their 20s and 30s, who met online, shared anarchist beliefs, and became increasingly violent. Their goals aren't clear, but online writings cover topics from gender identity, radical veganism and artificial intelligence. LaSota's blog describes a theory that the two hemispheres of the brain could hold separate values and genders and \"often desire to kill each other\". One of the other killings the group has been linked to is the stabbing of an 82-year-old man in northern California last month. Prosecutors believe it was to silence him ahead of trial over an alleged 2022 sword attack by disgruntled tenants, in which he lost an eye. The man charged with the murder, Maximilian Snyder, is said to have a relationship with Teresa Youngblut - the alleged shooter in the death of the border patrol officer. Read more from Sky News:Ten dead as polar vortex brings 'life-threatening cold'Russia 'releases US citizen' ahead of Ukraine peace talks In 2023, the parents of Michelle Zajko - the woman arrested alongside LaSota on Sunday - were also found shot dead in their Pennsylvania home. LaSota was charged with obstructing the investigation and released on bail, and subject to an arrest warrant after failing to show up in court. Zajko was also questioned over her parents' killing, but was later released and hasn't been charged. A lawyer for LaSota, Daniel McGarrigle, declined to comment when asked whether if his client was connected to any of the deaths. A bail hearing is scheduled for Tuesday."
    },
    {
        "title": "Meta to build world's longest undersea cable",
        "description": "Meta is planning to build the world's longest undersea cable, aiming to connect the US, India, South Africa, Brazil and other regions.",
        "url": "https://news.sky.com/story/meta-to-build-worlds-longest-undersea-cable-13311761",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-cables-meta_6832253.jpg?20250218093650",
        "type": "US",
        "Author": "Mickey Carroll, science and technology reporter",
        "Date Published": "2025-02-18 10:06:00",
        "Headline": "Subsea cables are described as the \"backbone of the internet\" by one group, who says around 95% of all internet traffic goes through these cables.",
        "Content": "By Mickey Carroll, science and technology reporter  Meta is planning to build the world's longest undersea cable, aiming to connect the US, India, South Africa, Brazil and other regions. The owner of Instagram, Facebook, and WhatsApp will build a 50,000km (31,000-mile) cable, which is longer than the Earth's circumference, to make sure artificial intelligence and other new technologies are accessible around the world, it said in a blog post. Project Waterworth will open \"three new oceanic corridors with the abundant, high-speed connectivity needed to drive AI innovation around the world,\" wrote Meta on its engineering blog. Subsea cables are described as the \"backbone of the internet\" by the Global Digital Inclusion Partnership, a group trying to get the world's population \"meaningfully connected\" to the internet by 2030. It reports around 95% of internet traffic travels through these cables, but access to the huge network is patchy, which impacts society's most marginalised groups. Read more from Sky News:Gangs are making 'millions' from illegal rubbish dumpsIs Germany turning to the far right? \"As subsea cables increase data traffic competition and bandwidth availability, the price for each gigabyte of data decreases,\" wrote the group in a report on the topic last year. \n                  DeepSeek founder Liang Wengfeng spotted in public for first time since company upended AI in the West\n                 \n                  Why the UK didn't sign up to global AI agreement\n                 \n                  Has Elon Musk just put OpenAI in a tricky situation?\n                 \"Addressing the affordability barrier may offer key benefits for individuals on lower incomes who are more price sensitive - most of whom are women, people living in rural areas, or other marginalized groups (e.g., people with disabilities).\" Meta has already developed more than 20 subsea cables, while rival tech billionaire Elon Musk is using parades of low-orbit satellites to increase internet connectivity. His Starlink satellites have a different purpose, however. They connect remote, hard-to-reach areas to the internet where cables would struggle to reach. Stargazers can sometimes spot his train of satellites making their way across the night sky after they have been launched, with some of the eerie light chains being spotted over the UK in recent years. Meta's new subsea cable project is predicted to cost billions of dollars and take years to complete. The company described it as its \"most ambitious subsea cable endeavor yet\"."
    },
    {
        "title": "Why did the plane crash in Toronto - and how did everyone escape?",
        "description": "Investigators are trying to establish exactly what happened when eighty people miraculously escaped after a Delta Air Lines jet dramatically flipped upside down as it landed in Toronto.",
        "url": "https://news.sky.com/story/why-did-the-plane-crash-in-toronto-and-how-did-everyone-escape-13311762",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-toronto-plane_6832002.jpg?20250217213358",
        "type": "US",
        "Author": "Michael Drummond",
        "Date Published": "2025-02-18 09:33:00",
        "Headline": "Many questions remain about why a landing at Toronto's Pearson Airport went so wrong as a plane carrying 80 people flipped upside down. ",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n Investigators are trying to establish exactly what happened when eighty people miraculously escaped after a Delta Air Lines jet dramatically flipped upside down as it landed in Toronto. It's not clear what went so disastrously wrong as the plane - which was carrying 76 passengers and four crew - touched down on Monday. Eighteen people were injured, but the fact nobody was killed has been hailed as remarkable. Where was the flight coming from? The twin-engine Mitsubishi CRJ-900LR jet was coming to the end of a flight from Minneapolis in the US (around 700 miles away) when the landing at Toronto's Pearson Airport went catastrophically wrong. Weather conditions in the Canadian city, which has been blanketed by snow recently, saw winds gusting to 40mph when the flight attempted to land at around 2.15pm local time (7.15pm UK time) on Monday. Communications between the tower and pilot were normal on approach.  What happened when it tried to land? For reasons that have yet to be established, the 118ft jet flipped over onto its back after touching down on the tarmac - leaving passengers hanging upside down in the cabin. Peter Carlson, a passenger travelling to Toronto for a paramedics' conference, said the landing was \"very forceful\". \"All the sudden everything just kind of went sideways and then next thing I know it's kind of a blink and I'm upside down still strapped in,\" he told CBC News. Emergency responders reached the plane within a few minutes, Toronto Pearson Fire Chief Todd Aitken said, and the operation \"went as planned\". Pictures and videos from the scene show the plane's fuselage seemingly intact as firefighters doused what was left of the fire, with what appear to be scorch marks visible near the tail section. Passengers were able to climb out and walk across the tarmac. Was anyone injured in the crash? All 80 people on board the aircraft survived and Mr Aitken said 18 passengers were taken to the hospital. Earlier in the day, Ornge air ambulance said it was transporting one paediatric patient to Toronto's SickKids hospital and two injured adults to other hospitals in the city. A spokesperson for the Peel Region paramedic service told Sky News the injuries ranged from minor to serious - but none were life-threatening. Read more from Sky News:Ice hockey game has three fights in first nine secondsThe mood on Canada's border with US 'Crew did a remarkable job' Former air traffic controller Todd Yeary said it was \"remarkable\" nobody was killed in the crash. Asked about the weather, he told Sky News: \"There's some question about whether or not there were extreme wind gusts at about the time the flight was touching down, and whether or not that had any impact on the ability to control the landing.\"  He said ice on the runway could have been a factor as well. \"What we do know is the crew did a remarkable job to make sure that everybody got off that airplane safely,\" he added. Mr Aitken, the fire chief, has said \"the runway was dry and there was no cross-wind conditions\"."
    },
    {
        "title": "Thames Water multi-billion pound debt lifeline approved by High Court",
        "description": "Thames Water, which was due to run out of money, has been given a lifeline after a &#163;3bn loan was approved by the High Court. ",
        "url": "https://news.sky.com/story/thames-water-debt-lifeline-approved-by-high-court-13311763",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-demonstrators-protest_6778660.jpg?20241217125459",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-02-18 09:34:00",
        "Headline": "The costs wracked up by Thames Water in the case were said to be \"eye-watering\" by the judge. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Thames Water, which was due to run out of money, has been given a lifeline after a £3bn loan was approved by the High Court.  The loan gives the UK's biggest water provider time to sort out its finances and could ward off nationalisation. An appeal, however, will be launched by Lib Dem MP Charlie Maynard. Court approval had been needed for the rescue plan centred on an emergency £3bn loan. The business is provisionally attempting to borrow its way out of its financial problems as it struggled with £16bn in debt. It had said it would run out of money by 24 March. Money blog: The UK's favourite supermarket revealed It will now receive an initial tranche of £1.5bn to fund it until September 2025. \n                  Approval for higher bills and loading more debt begs the question: who is Thames Water serving anymore?\n                 \n                  What's happening with Thames Water, why's it in court and could it be nationalised?\n                 \n                  Thames Water launches appeal over bill limits\n                 Mr Justice Leech, who heard the case, said: \"The costs of finance and adviser fees in the present case are very high. \"Indeed, they might be described as eye-watering.\" What does the loan mean? The loan will cost at least £100m in fees and comes with a 9.75% interest rate. The funding will be released on a monthly, or interim basis as needed, subject to Thames Water satisfying loan requirements including that it has taken on new shareholder investment. Potential funders had submitted bids to invest in Thames Water and the company said it is now conducting a detailed assessment of each bid. Loan terms dictate it must be repaid first in the event of administration and existing creditors have their repayment dates set back two years. Read more:What's happening with Thames Water, why's it in court and could it be nationalised? The timeline for accessing loan funds depends on the impact of a potential appeal process by B-class creditors. They had objected to the loan as they face being wiped out completely in a restructuring. The company said it is considering when to draw down the money, loaned by so-called A-class creditors. What next for Thames Water? The government has been on standby to put Thames Water into special administration, a form of temporary nationalisation aimed at keeping the taps on in the event of financial collapse. Some campaigners have called for nationalisation, though the government opposes this.  Thames Water wants a full restructuring, taking in new shareholder investment and swapping debt for a portion of the company for existing creditors. Its chief executive Chris Weston welcomed the ruling. \"This is good news for our customers, puts our business on a firmer financial footing and enables us to continue to invest in our network and deliver critical infrastructure upgrades for our customers and the environment,\" he said. The water utility is seeking more expensive bills to pay for its future investments and continued existence. It's asking for bills to rise 53% from this year to 2030, challenging Ofwat's allowed 35% increase, equivalent to an extra £151 a year. Mismanagement and a lack of adequate investment have brought Thames Water to its current state."
    },
    {
        "title": "Surprise rise in wages - as unemployment unexpectedly stays the same",
        "description": "Wages have risen while unemployment unexpectedly saw no change, official figures show.",
        "url": "https://news.sky.com/story/surprise-rise-in-wages-as-unemployment-unexpectedly-stays-the-same-13311698",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-biz-banks-graphic_6643992.png?20250206124148",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-02-18 06:24:00",
        "Headline": "It marks the third month in a row of wage growth after a year of slowing - but it is expected not to last. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Wages have risen while unemployment unexpectedly saw no change, official figures show. Average weekly earnings rose 6% in the three months to December, data from the Office for National Statistics (ONS) showed, while wages - excluding bonuses - grew 5.9%, despite economists expecting a 5.8% rise. Money blog: Your parking disputes resolved by expert Even with inflation factored in, wages are still rising. In the same month as earnings grew 6%, prices rose at a rate of 2.5%. This marks the third month in a row of wage growth after a year of slowing. In November, both basic pay excluding bonuses, and average weekly earnings, rose at an annual rate of 5.6%. Both private and public sector worker pay increased. But the growth is expected to end and the rises are anticipated to slow to 3% by the end of the year, according to the chief economist at KPMG UK, Yael Selfin. \"We expect a steady downward trend over the coming months\", she said. Increased costs for employers from higher minimum wage and upped national insurance costs are forecast to dampen wage growth.  An unemployment surprise The unemployment rate remained unchanged at 4.4%. A rise was anticipated by economists who were polled by the Reuters news agency. The number of job vacancies also continued to fall in the latest three-month period, albeit more slowly, with the total number remaining a little above its pre-pandemic level. The ONS, however, has advised caution in interpreting changes in the monthly unemployment rate due to questions over the reliability of the figures. The exact number of unemployed people is not known - partly because people don't answer the phone when the ONS calls.  What does it mean for interest rates? Traders were pricing in a slim chance of an interest rate cut, of just 28%, before the data was released - but the likelihood fell to 25% after the announcement. Better wages can fuel inflation, which the interest rate setters at the Bank of England are fighting to bring down."
    },
    {
        "title": "Tata Steel's new electric arc furnace in Port Talbot given green light",
        "description": "Plans for a new electric arc furnace in Port Talbot have been approved by the local planning authority.",
        "url": "https://news.sky.com/story/tata-steels-new-electric-arc-furnace-in-port-talbot-given-green-light-13311882",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-artist-impression-steelplant_6832615.jpg?20250218143902",
        "type": "Business",
        "Author": "Tomos Evans",
        "Date Published": "2025-02-18 12:44:00",
        "Headline": "The plans, which Tata says will cut on-site CO2 emissions by 90%, were approved on Tuesday.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n Plans for a new electric arc furnace in Port Talbot have been approved by the local planning authority. Tata Steel's application was given the go-ahead on Tuesday morning at a meeting of Neath Port Talbot Council's planning committee. The company closed both of its blast furnaces last year and said they would be replaced by an electric arc furnace, as part of its transition to greener production methods. The closure of the blast furnaces have seen nearly 3,000 jobs lost, but Tata says 5,000 UK-based jobs have been saved, with on-site CO2 emissions cut by 90%. A supporting document considered by the planning committee, which recommended the application's approval, noted that it was a \"development of national strategic importance\". The application included the demolition of existing buildings and structures as well as the construction of the new facility. Rajesh Nair, chief executive of Tata Steel UK, said the company was \"committed to begin large-scale work on site this summer\". \n                  Ratan Tata, former chairman of Tata Group, dies aged 86\n                 \n                  How the end of coal in the UK and closure of Port Talbot steelworks are related\n                 \n                  Tata Steel: UK's biggest steelworks shuts down final furnace after more than 100 years\n                 Mr Nair said the £1.25bn investment was \"the most significant investment made in the UK steel industry in decades\". The investment was supported by funding from the UK government of £500m. It is anticipated the electric arc furnace will be in operation at the end of 2027. Read more from Sky News:British couple detained in Iran charged with espionagePassengers describe miracle escape from plane crash The news that planning permission has been granted has been welcomed by Wales Secretary Jo Stevens, who described it as a \"significant step forward\". She said the decision provided \"more certainty over Tata's plans for the site and for the future of steelmaking in South Wales\"."
    },
    {
        "title": "Meghan shares rare picture of Lilibet as she unveils renamed lifestyle brand As Ever",
        "description": "The Duchess of Sussex has relaunched her lifestyle brand under a new name - and shared a rare picture of her daughter Lilibet.",
        "url": "https://news.sky.com/story/meghan-shares-rare-picture-of-lilibet-as-she-unveils-renamed-lifestyle-brand-as-ever-13311902",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-meghan-markle-duchess-of-sussex_6789696.jpg?20250218152258",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-18 13:15:00",
        "Headline": "The Duchess of Sussex posts a video of herself on Instagram to announce the renaming of her lifestyle brand from American Riviera Orchard to As Ever. It comes as her Netflix show is set for release in two weeks.",
        "Content": "The Duchess of Sussex has relaunched her lifestyle brand under a new name - and shared a rare picture of her daughter Lilibet. Posting to her recently-created Instagram account, Meghan said she was \"thrilled\" to be changing the name of her American Riviera Orchard lifestyle brand to As Ever - a project which she \"poured my heart into\". As Ever's website features an image of Lilibet running outside with her mother, surrounded by nature. In the Instagram video post, Meghan, who married Prince Harry in 2018, says in the caption that As Ever \"means 'as it's always been' or some even say 'in the same way as always'. \"If you've followed along since my days of creating The Tig, you'll know this couldn't be truer for me. \"This new chapter is an extension of what has always been my love language, beautifully weaving together everything I cherish - food, gardening, entertaining, thoughtful living, and finding joy in the everyday.\" Her Netflix show With Love, Meghan - which the streamer says \"reimagines the genre of lifestyle\" - launches in two weeks. \n                  Meghan's Valentine's Day message to Harry after William and Kate share romantic photo\n                 \n                  Harry and Meghan make surprise visit to hand out food to LA fires evacuees in Pasadena\n                 \n                  Mindy Kaling spills the beans on Meghan's cooking skills\n                 Read more: Mindy Kaling spills the beans on Meghan's cooking skillsSussexes make surprise visit to hand out food to LA fires evacuees The former Suits star returned to Instagram after four years on 1 January, when she appeared in a black and white video as she ran along a beach and wrote \"2025\" in the sand. She followed it up the next day with the trailer for the upcoming Netflix show, with the message: \"I have been so excited to share this with you! I hope you love the show as much as I loved making it.\" The launch of the show was delayed due to the devastating LA wildfires in January. \"I'm thankful to my partners at Netflix for supporting me in delaying the launch, as we focus on the needs of those impacted by the wildfires in my home state of California,\" Meghan said at the time in a statement to Tudum, the official companion site to Netflix. Meghan's latest post before her video announcing As Ever was on Valentine's Day, when she posted a picture of her and Harry kissing and said: \"My love, I will eat burgers & fries and fish & chips with you forever. Thank you for you.\""
    },
    {
        "title": "Reeves' hunt for growth sparks summit with top investment bankers",
        "description": "Rachel Reeves' quest to kickstart growth in Britain's economy will see her holding talks with leading investment bankers and asset managers this week, the latest in a series of summits with senior financiers.",
        "url": "https://news.sky.com/story/reeves-hunt-for-growth-sparks-summit-with-top-investment-bankers-13311858",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-reuters-rachel-reeves_6827945.jpg?20250213174845",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-18 11:53:00",
        "Headline": "Executives from companies including BlackRock, Goldman Sachs and Schroders will meet the chancellor on Wednesday as she seeks industry ideas to kickstart growth in Britain's economy, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Rachel Reeves' quest to kickstart growth in Britain's economy will see her holding talks with leading investment bankers and asset managers this week, the latest in a series of summits with senior financiers. Sky News has learnt that the chancellor has called in executives from companies including Abrdn, BlackRock, Citi, Goldman Sachs, JP Morgan, Morgan Stanley and Schroders on Wednesday morning. Sources said the meeting was intended to feed ideas into the forthcoming Financial Services Growth and Competitiveness Strategy. Money blog: The UK's favourite supermarket revealed One insider said that among the topics to be discussed on Wednesday would include ways in which industry and government could work together to drive UK growth by assessing Britain's international competitiveness. Identifying regulatory barriers, with economic watchdogs firmly in the government's firing line, and encouraging institutional and retail investment into the UK economy, would also be on the agenda, they added. The roundtable discussion will take place days after the bosses of Britain's big retail banks were called in to provide their input amid growing signs that further tax rises might be unveiled by the chancellor this year. \n                  'No one raised concerns with me': Chancellor Rachel Reeves responds to expenses allegations\n                 \n                  Chancellor in danger of squandering new year fightback and becoming 'reshuffle Rachel' after latest claims about her past\n                 \n                  PM backs Rachel Reeves after she was 'investigated over expenses' at banking job\n                 Further meetings with industry figures are anticipated in the coming weeks, according to insiders. The disastrous reaction to Ms Reeves's inaugural budget - delivered last October - has raised questions about the government's economic competence, amid signs that substantial numbers of wealthy individuals have quit Britain over the chancellor's tax reforms. A Treasury source said: \"The Chancellor is determined to go further and faster to deliver growth and put more money into people's pockets. \"She's listening to ideas on how to drive this work forward - that's why she launched the Financial Services Growth and Competitiveness Strategy, and that is why she is working in partnership with industry to achieve these goals.\""
    },
    {
        "title": "Hipgnosis duet tune up for tilt at investment trusts",
        "description": "The City duo who orchestrated last year's sale of Hipgnosis Songs after a bitter governance battle are raising tens of millions of pounds to target undervalued alternative asset managers listed on the London stock market.",
        "url": "https://news.sky.com/story/hipgnosis-duet-tune-up-for-tilt-at-investment-trusts-13311848",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-houses-city-gherkin_6726890.jpg?20241024224252",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-18 11:35:00",
        "Headline": "Christopher Mills and Robert Naylor are to list Achilles Investment Company on the London stock market in a bid to force boards to address steep discounts at alternative asset managers, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The City duo who orchestrated last year's sale of Hipgnosis Songs after a bitter governance battle are raising tens of millions of pounds to target undervalued alternative asset managers listed on the London stock market. Sky News has learnt that Christopher Mills, the veteran fund manager, and Robert Naylor, a serial company chair, are to float Achilles Investment Company in the coming days. The pair, who have appointed Singer Capital Markets to handle the listing, plan to raise around £50m to invest in between two and five investment companies. Money blog: The UK's favourite supermarket revealed City sources said on Tuesday that they wanted to help address the valuation discount which plagues many listed investment trusts and other asset managers because of concerns about corporate governance. Since forcing the sale of Hipgnosis, the music rights group, Mr Mills and Mr Naylor have joined the board of PRS REIT, an investment trust focused on the home rental market. According to an investor presentation seen by Sky News, the pair cite their \"proven track record unlocking c.$950m of shareholder value following activism and/or board appointment of the management team in the last 18 months\". \n                  Thames Water multi-billion pound debt lifeline approved by High Court\n                 \n                  Surprise rise in wages - as unemployment unexpectedly stays the same\n                 \n                  What's happening with Thames Water, why's it in court and could it be nationalised?\n                 \"There has been little activism in alternatives to date, even though some boards have been slow to sell assets to fund share buybacks,\" said one insider. It comes after the investor Saba Capital lost seven successive votes to force through governance changes at London-listed investment trusts. A source close to Achilles pointed out that its aim was to improve governance rather than use an activist approach to aggregate assets, as Saba had sought to do. Achilles could not be reached for comment."
    },
    {
        "title": "Fire damage caused by air fryers typically around £30k, warns insurer",
        "description": "Insurance claims following fires caused by air fryers are running into tens of thousands of pounds, an insurer has warned.",
        "url": "https://news.sky.com/story/fire-damage-caused-by-air-fryers-typically-around-16330k-warns-insurer-13311723",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kitchen-airfryer_6832239.jpg?20250218091926",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-18 08:04:00",
        "Headline": "Air fryers have \"become a staple part of our kitchen set-up\" but hazards include over-filling, grease build-up and putting them on hot surfaces.",
        "Content": "Insurance claims following fires caused by air fryers are running into tens of thousands of pounds, an insurer has warned. The typical claim for 2024 was £29,555, according to Aviva, but in one case it was as high as £80,000. It has reported incidents where fire and smoke damage has spread to the entire kitchen destroying the ceiling, walls, cupboards and their contents. It said there have been some significant home insurance claims over the past four years, after air fryers saw a surge in popularity because of potential energy savings compared with conventional ovens. Follow the latest: Money blog Aviva said it had been contacted about air fryers bursting into flames and melting, destroying kitchen surfaces, and speculated on the reasons. Based on a survey by Censuswide, commissioned by the insurer, around two-thirds (68%) of people said they own an air fryer. \n                  Thames Water multi-billion pound debt lifeline approved by High Court\n                 \n                  Surprise rise in wages - as unemployment unexpectedly stays the same\n                 \n                  What's happening with Thames Water, why's it in court and could it be nationalised?\n                 According to the poll of 2,000 people in December, nearly a fifth (19%) had suffered a potential or actual fire hazard like smoke, overheating or scorching. Potential reasons included: not following instructions in the manual, over-filling the air fryer and using it in a non-ventilated area such as a cupboard. Read more from Sky News:Gangs making millions from illegal tippingSurprise rise in official wage figuresIs your air fryer listening to your conversations? The insurer also reported several claims where air fryers had been placed on hobs, which had been accidentally switched on, setting the air fryer alight. In one case, a hungry dog had managed to turn on the cooker. Luke Osborne, deputy technical director at charity Electrical Safety First, warned about the safety risks associated with air fryers which have \"become a staple part of our kitchen set-up\". Here's some advice from Electrical Safety First to avoid air fryer misfortunes: • Always register the product in the event a fault is detected by the manufacturer • To avoid potential overheating, never overfill your air fryer and never plug the appliance into an extension lead • Make sure you keep your power cords away from hot surfaces to avoid damaging cables • Always refer to the manufacturer's cleaning instructions to remove grease build-up which can cause a fire"
    },
    {
        "title": "Australia 'should be prepared to contribute' to securing Ukraine's freedom, former PM says",
        "description": "A former Australian prime minister has said his country should be \"prepared to make a contribution\" to protect the freedom of Ukraine.",
        "url": "https://news.sky.com/story/australia-should-be-prepared-to-contribute-to-securing-ukraines-freedom-former-pm-says-13312025",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-tony-abbott-australia_6832748.png?20250218182218",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-02-18 16:25:00",
        "Headline": "Tony Abbott, who led the conservative Liberal Party, also tells Sky News Donald Trump will \"blight\" his second presidency if he does not help Ukraine, and Britain should lead the way. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  A former Australian prime minister has said his country should be \"prepared to make a contribution\" to protect the freedom of Ukraine. Tony Abbott told Sky News' Politics Hub With Sophy Ridge that no country \"will be safe against a bully\" if Vladimir Putin wins the war. He called on Britain to take the lead in protecting Ukraine even without a US backstop - but said all the free countries of the world should be \"prepared to make a stand\". Politics Live: Tump warned against 'blight' on his presidency with Russia deal  Mr Abbott, who led the conservative Liberal Party, said: \"I personally think that Australia should be prepared to make a contribution to the long term freedom and security of Ukraine. \"The Ukrainians have been fighting for the freedom of everyone. And if Putin is able to snuff out the freedom and the independence of Ukraine, what smaller country anywhere is safe against a bully? \"Is Taiwan safe? Is Australia, for that matter, safe? Is Japan safe? \"This is why it's important that whatever the Americans ultimately do, the free countries of the world are prepared to make a stand in support of the freedom of Ukraine.\" It comes after Sir Keir Starmer urged America to provide a \"security guarantee\" to deter Putin and said he is prepared to send British troops to Ukraine if a peace deal is made. The UK prime minister was speaking following a summit of continental leaders that was arranged by French President Emmanuel Macron, after Donald Trump shocked the world by arranging bilateral talks between the US and Russia - excluding Europe and Ukraine.  Mr Abbott said Mr Trump \"will blight his second presidency\" if he hands a victory to Putin. \"If the result of anything the American president does is to leave Ukraine broken, defenceless, and ultimately a colony of imperial Russia, I think that would be a tragedy,\" he said. He said Sir Keir was \"sensible and brave\" to consider sending peace keeping troops, but he should be prepared to do this without America's help, and on its own if necessary. He said: \"Britain is a substantial power. After the United States, it's the second most powerful country, notwithstanding the current weakness of the British Army. And it should be prepared to take a stand for freedom by protecting Ukraine. \"Britain should be prepared to lead here and it should not expect yet again to ride on America's coat tails.\" Mr Trump has said the US no longer sees the defence of Europe as its primary concern in a major change of policy since the Second World War. It has prompted calls for the UK and other NATO countries to increase defence spending. Read More:Labour needs to 'rearm Britain' with 'more muscular defence'Analysis: Sombre Starmer confronts emerging new world order Speaking after the Paris summit on Monday night, Sir Keir said a \"US security guarantee\" is the only path to peace in Ukraine. But he also insisted \"Europe must play its role\", adding: \"I'm prepared to consider committing British forces on the ground alongside others if there is a lasting peace agreement. \"So I will go to Washington next week to meet President Trump and discuss what we see as the key elements of a lasting peace.\" 👉 Listen to Sky News Daily on your podcast app 👈 However, despite three hours of emergency talks, European leaders left the meeting without a common view. German Chancellor Olaf Scholz described the idea of deploying European peacekeepers as \"completely premature\" and said it was \"completely the wrong time to have this discussion\". And Denmark's Mette Frederiksen said her country was \"open to discussing many things\" but stressed her nation was still very far off deploying its own soldiers to Ukraine. Watch the full interview on the Politics Hub with Sophy Ridge from 6.30pm"
    },
    {
        "title": "Public services prepare for up to 11% cuts - as defence secretary says 'we must rearm'",
        "description": "Some government departments have been asked to make savings which would amount to a 11% cut in spending - as the prime minister faces calls to raise defence spending.",
        "url": "https://news.sky.com/story/public-services-prepare-for-up-to-11-cuts-as-defence-secretary-says-we-must-rearm-13312077",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-british-army-apache_6832873.jpg?20250218192756",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-02-18 17:39:00",
        "Headline": "Unprotected departments have been asked to model two options, ahead of the Treasury's spending review.",
        "Content": "\n          Political correspondent\n              @tamcohen\n  Some government departments have been asked to make savings which would amount to a 11% cut in spending - as the prime minister faces calls to raise defence spending. Sky News has been told that departments which do not have their spending protected have been asked to model two options - \"flat\" spending, which, adjusted for inflation, amounts to a cut; and a deeper reduction amounting to 11% in real terms. No final decisions on departmental spending will be taken until the Treasury's spending review, which sets departmental budgets for three years, and will be completed in June. Decisions on possible spending cuts by departments have been described by sources as \"incredibly difficult\". Politics latest: Trump warned against 'blight' on his presidency with Russia deal It comes amid calls to increase defence spending, in the light of the Trump administration's warning to European nations to shoulder their own security - and send peacekeeping troops to Ukraine. Sir Keir Starmer has promised to increase defence spending to 2.5% of GDP but has not set out when this will be achieved. Ministers say a defence review to be published this spring will set out a \"roadmap\" to it. Those departments with their budgets protected include the NHS, childcare and schools, defence and overseas aid at 0.5%. \n                  Nothing quite makes the point about military irrelevance than being left out of the room\n                 \n                  'Whole cabinet' recognises need to spend more on defence, minister says\n                 \n                  Sir Keir Starmer to urge EU nations to 'shoulder more of the burden' on defence spending\n                 What could be hit? This raises the prospect of more severe cuts for unprotected departments including local government - which is responsible for social care - justice, including courts and prisons; the environment, Home Office and culture. John Healey the defence secretary, announced a shake-up of defence spending at a speech in Westminster, to focus on \"war readiness and deterrence\". He said: \"At this time, we must rearm Britain.\" He said: \"The decisions that we make right now over the coming weeks will not only define the outcome of the conflict in Ukraine, but the security of our world for a generation to come. And the nature of government means dealing with these challenges\". Mr Healey would not say how quickly defence spending would rise but said conversations over the past week with the US defence secretary Pete Hegseth were about the need to go further. He said the message was \"not new\", adding: \"We know as European nations we need to step up on European security, on defence spending and on Ukraine, especially over the last year we've been doing just that. What Pete Hegseth accelerated was that recognition that we're stepping up, but we must go further.\" Raising defence spending to 2.5% of GDP would cost '£6bn a year' Paul Johnson, director of the Institute for Fiscal Studies, said that increasing defence spending from its current level of 2.3% to 2.5% would mean finding approximately an extra £6bn a year by the end of the parliament. He said: \"Six billion in our overall budget is not enormous. The problem facing the government is that the fiscal situation is so tight, even finding that kind of money is going to be difficult. \"The last government and this one have increased spending quite a bit across quite a range of public services since 2020. So it's not that we're coming right off the back of austerity, but we are still in a position where a lot of government departments, the Ministry of Justice, for example, have got less money now than I had all the way back in 2010. \"So it's still going to be hard for a lot of these areas to swallow any further cuts or even to cope with flat spending.\" Read more:Starmer confronts reality of Trump and Putin's emerging new world orderUnclear whether Ukraine-US rare earth saga is a masterstroke or colonial appropriation A Treasury spokesperson said: \"The chancellor has asked all departments to deliver savings and efficiencies of 5% of their current budget as part of the first zero-based spending review in seventeen years and every pound of government spending is being interrogated, to root out waste and get the best value for taxpayers. \"National security is a foundation of this government's plan for change, which is why we have increased defence spending by almost £3bn while delivering the highest pay rise for our armed forces in over 20 years. \"We will set out a path to 2.5% once the strategic defence review has concluded. We will not give a running commentary while the review is undertaken.\""
    },
    {
        "title": "Sadiq Khan: London mayor says President Trump 'absolutely' welcome to visit UK in major U-turn",
        "description": "London's mayor Sir Sadiq Khan has defended his past attacks on Donald Trump, telling Sky News that standing up for the city \"does mean sometimes saying boo to a goose\".",
        "url": "https://news.sky.com/story/sadiq-khan-london-mayor-says-president-trump-absolutely-welcome-to-visit-uk-in-major-u-turn-13312116",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sadiq-khan-labour-heathrow_6832846.jpg?20250218185814",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-02-18 18:36:00",
        "Headline": "Sadiq Khan also appeared to strike a less hostile tone in his opposition to Heathrow expansion, after previously threatening a legal challenge against a third runway.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  London's mayor Sir Sadiq Khan has defended his past attacks on Donald Trump, telling Sky News that standing up for the city \"does mean sometimes saying boo to a goose\". But in a major U-turn since calling on the government to ban the US president's 2019 UK state visit, when he was asked if Mr Trump would be welcome this time, he declared: \"Absolutely!\" Sir Sadiq, who was knighted in the King's New Year Honours, was interviewed by Sky News as he hosted talks with the ambassadors of the European Union's 27 member states at a top London hotel. In the past, the mayor has denounced the president as \"ignorant\" on Islam, \"racist\", \"sexist\", \"a homophobe\" and likened his tactics to \"the fascists of the 20th century\". Asked if he still held those views, he said: \"President Trump has fairly and squarely won a second term. Let's judge President Trump on what he does to his second term rather than what he did in his first term. \"My job as the mayor of this great city is to stand up for our values, stand up for our businesses, stand up for our people. And that does mean sometimes saying boo to a goose.\" And Sir Sadiq did criticise new US vice president JD Vance for claiming in a Valentine's Day speech at the Munich Security Conference that free speech was in retreat in the UK and Europe. \n                  Australia 'should be prepared to contribute' to securing Ukraine's freedom, former PM says\n                 \n                  Politics latest: Trump's approach to Russia 'looks like appeasement'\n                 \n                  Public services prepare for up to 11% cuts - as defence secretary says 'we must rearm'\n                 \"We had a situation a couple of days ago where it was said in words to the effect that the biggest threat facing our country and our continent is a lack of freedom of speech,\" said the mayor. \"Woe betide me being criticised for exercising my freedom of speech. Contrary to what JD Vance might think, we have freedom of speech in this country.\"  Sir Sadiq was also critical of the president's threat of \"trade wars and tariffs\", suggesting they could damage American companies doing business in London and the UK. Read more from Sky News:Starmer wants US 'backstop' to deter RussiaWho attended Russia and US peace talks? \"London is the number one city of choice for foreign direct investment for many businesses across the globe,\" he said. \"We've got many great American companies invested in London, whether it's in culture - Netflix and many other studios have opened recently in this great city of ours - financial institutions, legal and others currently invested in London. \"We do great business with the USA in terms of services and goods. I want it to carry on. An issue with tariffs and trade wars is that there are more people who lose out from those than win from those.\" On another Trump state visit, which the president is known to want, the mayor said: \"I'd like President Trump to come to London so he can see some of the misunderstandings he has of our city. \"So he can see there is no threat to freedom of speech in this great city of ours. So he can see that actually Muslims, Jews, Christians, Hindus and Sikhs don't just tolerate each other, we respect, celebrate and embrace each other. \"So he can see for himself the fact that diversity is a strength, not a weakness. He can see for himself that many people in this great city of ours and country of ours love America, love American culture, indeed in the past have loved American politics and are looking forward to working closely with him going forward.\"  Sir Sadiq also appeared to strike a less hostile tone in his opposition to Heathrow expansion, after previously threatening a legal challenge against a third runway. \"I'm a pro-growth mayor,\" he said. \"I'm a pro-business mayor, as evidenced by the policies of the last eight years. I want a better Heathrow, not a bigger Heathrow. \"If Heathrow can come up with plans that address issues around noise, around air, around climate change, that pays for the underground M25, re-routing the A4, improvements to Southern Rail, improvements on the Piccadilly line, improvements on the Elizabeth line, we'll look at them. \"Let's see what Heathrow's plans are. What the Climate Change Committee - well respected - has said [is] that any expansion of aviation must abide with our climate change commitments. Let's wait and see what Heathrow come up with.\"  Denying this was a change in his position, he added: \"Not at all. I'm quite clear in relation to standing up for London, but also standing up for our environment, for air quality, for noise pollution and for Londoners. \"And it's really important to wait for Heathrow to have their plans before I launch a legal challenge against hypotheticals.\""
    },
    {
        "title": "England's top judge condemns Starmer and Badenoch comments on Gaza family coming to UK on Ukraine scheme",
        "description": "England's most senior judge says she is \"deeply troubled\" by Sir Keir Starmer and Kemi Badenoch's exchange about a Gazan family coming to the UK under the Ukraine scheme.",
        "url": "https://news.sky.com/story/englands-top-judge-condemns-starmer-and-badenoch-comments-on-gaza-family-coming-to-uk-on-ukraine-scheme-13311847",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-dame-sue-car-lady-chief-justice_6832410.jpg?20250218115532",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-02-18 11:27:00",
        "Headline": "The Labour and Conservative leaders spoke out in PMQs against an immigration tribunal allowing a Gazan family to come to the UK under the Ukraine scheme.",
        "Content": "\n          Political reporter\n              @alixculbertson\n England's most senior judge says she is \"deeply troubled\" by Sir Keir Starmer and Kemi Badenoch's exchange about a Gazan family coming to the UK under the Ukraine scheme. The Lady Chief Justice voiced her concern after the prime minister said a judge had made the \"wrong decision\" by letting a family of six from Gaza settle in the UK under a Ukrainian refugee scheme. Sir Keir made the comments during last Wednesday's Prime Minister's Questions after Conservative leader Ms Badenoch raised the case. Politics latest: Defence secretary says government must 'rearm Britain' Ms Badenoch said the decision, made following two appeals, was \"completely wrong\" and it \"cannot be allowed to stand\". The prime minister pledged to close the \"loophole\" in answer to her question.  Baroness Carr said on Tuesday: \"Both question and the answer were unacceptable. \n                  'We could not make it work': Kemi Badenoch admits Tories couldn't find money for major defence boost\n                 \n                  Kemi Badenoch says failing to spend more on defence 'is not peacekeeping, it is weakness'\n                 \n                  Lawyer Keir becomes macho Keir\n                 \"It is for the government visibly to respect and protect the independence of the judiciary. \"Where parties, including the government, disagree with their findings, they should do so through the appellate process.\" Ms Badenoch reacted by saying parliament is \"sovereign\" and politicians \"must be able to discuss matters of crucial public importance in parliament\". \"This doesn't compromise the independence of the judiciary,\" she wrote on X. \"The decision to allow a family from Gaza to come to the UK was outrageous for many reasons.\" The Tory leader said Sir Keir could not tell her if the government would appeal the decision and accused him of having \"pretended\" to look at closing a legal loophole. She added: \"This is not just some legal loophole that can be closed, but requires a fundamental overhaul of our flawed human rights.\" How did the family receive the right to remain in the UK? The Palestinian family's application under the Ukrainian resettlement scheme was initially rejected by the Home Office, who said they were not satisfied there were \"compelling, compassionate circumstances\" to justify a request outside the rules. They also noted the lack of a resettlement scheme for Palestinians. However, the family appealed on human rights grounds - but that was dismissed by a first-tier immigration tribunal judge in September due to the lack of a Palestinian resettlement scheme. They then appealed again and were allowed to remain in the UK by upper tribunal judge Hugo Norton-Taylor, who said it was \"wrong to have taken the absence of a resettlement scheme into account at all\". He also backed the claim from the family based on the European Convention on Human Rights (ECHR) and the right to a family life between them and a relative in the UK. Read more:What is the loophole that allowed a family in Gaza to come to UK on Ukraine scheme? A government spokesperson said: \"The prime minister has made clear that it is for parliament to make the laws and for the government to decide policy. \"Where the law is not working as we think it should be, the government will take action to tighten up the rules - and that is what we are doing. \"As a former chief prosecutor, the prime minister's respect for the judiciary, the role they play in our democracy and the rule of law is beyond question.\" After the PMQs exchange last week, a Home Office spokesperson said: \"The Ukraine Family scheme was clearly set out for Ukrainians. We have been clear that we do not agree with this judgment and we twice vigorously contested this case. \"As the prime minister made clear, article 8, the right to a family life, should be interpreted much more narrowly. It is for the government and Parliament to decide who should be covered by the UK's safe and legal routes. \"We are pursuing all legal avenues to address the legal loophole which has been exploited in this case. The home secretary is urgently reviewing this case to ensure the correct processes are always followed and existing laws correctly interpreted.\""
    },
    {
        "title": "Man jailed for sending 'utterly deplorable' email to Jess Phillips",
        "description": "A 38-year-old man has been jailed for sending an \"utterly deplorable\" email to safeguarding minister Jess Phillips. ",
        "url": "https://news.sky.com/story/man-jailed-for-sending-utterly-deplorable-email-to-jess-phillips-13311990",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-jess-phillips-rudakubana_6812068.png?20250127132752",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-18 15:34:00",
        "Headline": "Jack Bennett also sent racist and offensive emails to London mayor Sir Sadiq Khan and Matt Twist, the assistant commissioner at the Met Police. ",
        "Content": "A 38-year-old man has been jailed for sending an \"utterly deplorable\" email to safeguarding minister Jess Phillips.  Jack Bennett, from Seaton, Devon, today pleaded guilty to sending malicious communications to three people - including the Birmingham Yardley MP - at Exeter Magistrates' Court. Bennett sent the email to Ms Phillips on 2 January - one day after Elon Musk called the MP a \"rape genocide apologist\" and said she \"deserves to be in prison\" for denying requests for a public inquiry into child sexual exploitation in Oldham. He also sent racist and offensive emails to London mayor Sir Sadiq Khan in February 2024, and to Matt Twist, the assistant commissioner at the Met Police, in April 2024. Bennett has been sentenced to 28 weeks in prison. District Judge Stuart Smith said the email to Ms Phillips had caused the MP \"great distress\". \"[She] was concerned for your potential to escalate or to encourage others for violence against her, having in her mind the murder of her colleague Jo Cox,\" he said.  Bennett's messages began after he was \"caught up\" in online right-wing propaganda during the Covid-19 pandemic, the court heard. Appearing for the defence, Caroline Salvatore said Bennett had no previous convictions, presented as being neurodivergent and was \"largely socially isolated\". \"He was encouraged to become incensed at various issues and he found their phrases became part of his vocabulary,\" she said. Ms Salvatore said Bennett did not act until after his father died in 2023, which was a \"triggering event\". He was \"genuinely motivated by the perceived incompetence of the people he sent emails\" but he accepted he was trying to be offensive and does \"realise how he was wrong,\" she added. The judge said the 38-year-old's email to Sir Sadiq \"purposely sought to disparage, insult and offend him based on his ethnicity and Asian heritage\". \"The contents of your communications to all three was utterly deplorable, foul and abusive,\" Judge Smith said. \"Saturated in hate and intolerance and shamelessly racist and offensive. \"Your angry, poisonous and hateful rhetoric discloses the real disdain you held for ethnic minorities, targeting especially Muslims and immigrants in your abusive tirades.\" Read more:Why Musk took interest in grooming scandalStarmer comments on X owner's accusation Bennett pleaded guilty to four counts of sending malicious communications and one of using a public communication network to send offensive emails. A prosecution request for restraining orders to be put in place for five years was granted by the judge."
    },
    {
        "title": "Farmers react with 'fury' and 'anger' after Treasury meeting over inheritance tax",
        "description": "The president of the National Farmers Union says there is \"fury\" and \"anger\" among farmers - after the government refused to change its controversial inheritance tax plans.",
        "url": "https://news.sky.com/story/farmers-react-with-fury-and-anger-after-treasury-meeting-over-inheritance-tax-13311872",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-inheritance-farmers_6824908.jpg?20250210160709",
        "type": "Politics",
        "Author": "Dan Whitehead",
        "Date Published": "2025-02-18 12:22:00",
        "Headline": "Farming representatives met with the government to discuss the proposed changes to inheritance tax relief on agricultural properties. It appears the talks were not viewed as constructive by the farmers.",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n The president of the National Farmers Union says there is \"fury\" and \"anger\" among farmers - after the government refused to change its controversial inheritance tax plans. NFU President Tom Bradshaw met with the Treasury on Tuesday morning and said the union was offering them alternative solutions that raise funds. \"The government believes they are correct in the decisions they've made. Disappointment doesn't describe how I feel,\" he said. Politics latest: UK must re-arm, minster says The union chief added: \"The message was clear to them today - go away.\" He said the union was \"really cross\" about the government's lack of movement. \"They don't care about the human impact…intergenerational impact. They don't care about food production.\" Read more:What's the beef with farmers' taxEx-govt adviser warns of 'chilling effect'Row over how many will be affected by tax policy In last October's budget, the government announced plans to introduce a 20% inheritance tax on farms worth more than £1m from April 2026. It claims only the wealthiest of farms will be impacted, but farming groups say it will in fact make thousands of small and medium-sized farms financially unviable. The NFU has proposed a clawback scheme which would see tax only charged once a farm is sold, rather than on inheritance. There have been numerous protests against the change, with hundreds of tractors blocking Whitehall and Downing Street last week. On questions about whether farmers should blockade food depots and disrupt production, Mr Bradshaw said: \"Public support is absolutely fundamental to pressurising the government. \"We must keep public support at all costs as that will drive political support. I get the genuine anger and frustration that farmers are feeling today, but public support will get us through this.\"  A government spokesperson said: \"Our commitment to farmers and rural communities remains steadfast. \"This government will invest £5bn into farming over the next two years, the largest budget for sustainable food production in our country's history. \"Our reform to agricultural and business property reliefs will mean farmers will pay a reduced inheritance tax rate of 20%, rather than the standard 40% for other businesses, and payments can be spread over 10 years, interest-free. \"This is a fair and balanced approach, which fixes the public services we all rely on, affecting around 500 estates a year.\" Shadow environment, food and rural affairs secretary Victoria Atkins said of the meeting: \"Calling farmers in for a meeting to patronise and ignore them shows Labour are driven only by metropolitan arrogance.\" Liberal Democrat environment and rural affairs spokesperson Tim Farron MP said: \"This government is throwing farmers to the wolves.\""
    },
    {
        "title": "London mayor Sadiq Khan to tell EU diplomats 'Brexit was a mistake' and argue for stronger EU ties to fight Trump tariffs",
        "description": "London mayor Sir Sadiq Khan is to tell EU diplomats \"Brexit was a mistake\" and argue stronger ties with the bloc would help fight Donald Trump's tariff threats.",
        "url": "https://news.sky.com/story/london-mayor-sadiq-khan-to-tell-eu-diplomats-brexit-was-a-mistake-and-argue-for-stronger-eu-ties-to-fight-trump-tariffs-13311760",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/image_6676865.jpg?20240904195130",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-18 09:24:00",
        "Headline": "The Labour mayor has previously been told a \"period of silence\" would be welcomed by the government.",
        "Content": "London mayor Sir Sadiq Khan is to tell EU diplomats \"Brexit was a mistake\" and argue stronger ties with the bloc would help fight Donald Trump's tariff threats. He will say the UK's withdrawal from the EU \"continues to have a negative impact\" and will promise to make the case for \"being bold\" to seek closer alignment. The recently knighted mayor is hosting a meeting of the EU heads of mission, including the EU ambassador and UK ambassadors of all 27 EU member states. The Labour mayor will be speaking out despite a minister saying a \"period of silence would be most welcome\" after Sir Sadiq warned of \"resurgent fascism\" under Mr Trump's leadership. He will use the meeting to urge the government to back a youth mobility scheme with the EU, saying allowing under-30s from the bloc to live, work and study in the UK and vice versa would \"help to aid economic growth\" and give them \"important life experiences\". Politics latest: Defence secretary says government must 're-arm Britain' Speaking to Sky News' chief political correspondent Jon Craig, Sir Sadiq said he was not contradicting Sir Keir Starmer, with the prime minister saying he does not want a youth movement scheme or a return to the common market. The mayor said there was an opportunity to be had under the Labour government for a \"relationship reset\", and to have a \"closer alignment\" with the bloc rather than \"divergence\" from the UK's nearest trading partners. \"It's also the case that we want to be a city that is global, and that means continuing to attract investment tourism students and EU citizens to London,\" Sir Sadiq added. The government has said resetting relations with the EU is a priority but has ruled out returning to the single market, customs union or freedom of movement. It has resisted proposals from Brussels for a youth mobility scheme over concerns it could be seen to cross those red lines and be accused of going back on the Brexit vote.  However, Sir Sadiq will push ahead with calls for the scheme and will also say he is \"keen for us to look at how we can make it easier for schoolchildren\" from the EU to visit the UK. \"I'm a proud European and of the view that Brexit was a mistake that continues to have a negative impact - not just on my city and country, but on the European community as a whole,\" Sir Sadiq will say. \"I remain passionate about growing and improving our relationship across every area possible, and I believe this is essential if we're to effectively tackle a host of shared challenges - relating to trade, our economies, security, the environment and the rise of an intolerant and anti-democratic populism.\" Read more:PM joins Europe in confronting reality of Trump and Putin's new world orderThe partnerships Europe could forget in response to Trump's tariffs  And, without naming Mr Trump, he is expected to reference \"trade wars and tariffs posing a real threat to international affairs\" to say he is \"convinced\" the UK should be doing more to \"strengthen our relationship as a counterweight to those trends\". A government spokesman said: \"We are committed to resetting the relationship with the EU to improve the British people's security, safety and prosperity. \"But we have been clear there will be no return to freedom of movement, the customs union or the single market.\""
    },
    {
        "title": "Welsh government sets out plans to ban greyhound racing",
        "description": "The Welsh government has set out plans to ban greyhound racing.",
        "url": "https://news.sky.com/story/welsh-government-sets-out-plans-to-ban-greyhound-racing-13312002",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-greyhound-racing-wales_6832680.jpg?20250218155519",
        "type": "Politics",
        "Author": "Tomos Evans",
        "Date Published": "2025-02-18 15:49:00",
        "Headline": "A call to introduce a ban in Wales was one of the most popular petitions on the Senedd's website, with more than 35,000 signatures.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n The Welsh government has set out plans to ban greyhound racing. Deputy first minister Huw Irranca-Davies told the Senedd on Tuesday that now was \"the right time to ban greyhound racing\" in the nation. Mr Irranca-Davies, who is also the climate change and rural affairs secretary, said the government was proud that Wales was \"the first nation in the UK\" to introduce such a ban. A call to end greyhound racing was one of the most popular petitions on the Senedd's website, having garnered more than 35,000 signatures. The government said almost two thirds of respondents to its consultation on a national model for animal welfare were in favour of a ban on greyhound racing. Since 2018, more than 2,700 greyhounds have died or were put to sleep after taking part in a race, according to the Greyhound Board of Great Britain. Mr Irranca-Davies said he had \"listened\" to the \"strength of feeling\" on the subject and that he wanted the ban to come into force \"as soon as practicably possible\". \n                  Tata Steel's new electric arc furnace in Port Talbot given green light\n                 \n                  Louis Rees-Zammit: Former Wales rugby star's NFL future confirmed\n                 \n                  Teacher fired over comments on abortion and Sharia law not unfairly dismissed, tribunal finds\n                 \"There will be work to do in ensuring the dogs, their owners, and those involved in the industry around the racetrack, can wind down from this activity while still protecting the welfare of dogs currently within the industry, the local community and the local economy,\" he added. The government will now look to set up an implementation group to engage with stakeholders and learn from countries such as New Zealand, where the government has already started the process of introducing a ban. Only the UK, US, Australia and Ireland still allow commercial greyhound racing. Read more from Sky News:Carry On star dies after brief illnessWoman, 66, charged with 1978 death of five-year-old The announcement has been welcomed by members of the Cut the Chase Coalition, which comprises of charities Blue Cross, Dogs Trust, Hope Rescue, the RSPCA and Greyhound Rescue Wales. Dr Samantha Gaines, head of companion animals at the RSPCA, said the campaign to introduce a ban had been \"a monumental team effort\". \"We now stand ready to work closely with the Welsh government, the racing industry and racing greyhound owners to protect the dogs who will now exit competitive racing; and help find them a loving home,\" she added. Chief executive of Greyhound Racing Wales, Tim Doyle, said it hoped other UK governments would now \"take notice of Wales leading the way in putting greyhound welfare above entertainment\"."
    },
    {
        "title": "East Lothian first local authority in Scotland to confirm 10% council tax increase",
        "description": "East Lothian Council is the first local authority in Scotland to approve a double-digit council tax increase.",
        "url": "https://news.sky.com/story/east-lothian-first-local-authority-in-scotland-to-confirm-10-council-tax-increase-13311977",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-east-lothian-north-berwick_6832652.jpg?20250218151824",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-02-18 15:10:00",
        "Headline": "The Scottish government’s flagship council tax freeze was dropped for the nation's draft 2025-26 budget.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n East Lothian Council is the first local authority in Scotland to approve a double-digit council tax increase. The SNP government's flagship freeze on the levy comes to an end in April. East Lothian Council leader Norman Hampshire said the 10% rise was necessary to maintain essential services to protect vulnerable residents and to give children the best start in life. The Labour-led administration received cross-party support - 17 votes in favour and four against - to pass its 2025-26 budget on Tuesday. The local authority said it was developed in light of financial pressures it is facing amid the region's growing population, wider economic challenges, and \"increasing national policy expectations\". Councillor Hampshire said: \"Our financial situation means it has been necessary to set a council tax increase of 10%. \"East Lothian's growth continues to put pressure on all parts of the council. \n                  Police hunting man and woman after daylight sex attack and robbery in Nairn\n                 \n                  Early release of hundreds of prisoners in Scotland begins\n                 \n                  Scottish SPCA 'devastated' over sentence of Crieff man who goaded dog into killing domestic rat\n                 \"It is vital that we can sustain essential services to protect our most vulnerable residents and invest in education to give all children the best start in life.\" East Lothian council tax increases: • Band A (£957.08 2024-25 rate): £1.84 weekly increase, £7.98 monthly• Band B (£1,116.59 2024-25 rate): £2.15 weekly increase, £9.31 monthly• Band C (£1,276.10 2024-25 rate): £2.45 weekly increase, £10.63 monthly• Band D (£1,435.62 2024-25 rate): £2.76 weekly increase, £11.96 monthly• Band E (£1,886.24 2024-25 rate): £3.63 weekly increase, £15.72 monthly• Band F (£2,332.88 2024-25 rate): £4.49 weekly increase, £19.44 monthly• Band G (£2,811.42 2024-25 rate): £5.41 weekly increase, £23.43 monthly• Band H (£3,517.26 2024-25 rate): £6.76 weekly increase, £29.31 monthly Read more from Sky News:Pay rises despite job market worries'Staff earn £45k, don't have bosses and barely get a day off in December': Life as a butcher Rent will also increase by 6.5%, with councillors additionally approving plans to invest more than £211m in infrastructure over the next five years. The roads department will receive an uplift of £1m, while an additional £1m will be funnelled into modernising council houses. The Scottish government's flagship council tax freeze was dropped for the nation's draft 2025-26 budget. Finance secretary Shona Robison instead pledged to increase local authority funding by more than £1bn, taking the total amount to more than £15bn. While accepting it is up to the 32 local authorities to make their own decisions what to do with the money, she said there should be \"no reason for big increases\" in council tax rates."
    },
    {
        "title": "DeepSeek founder Liang Wengfeng spotted in public for first time since company upended AI in the West",
        "description": "The elusive founder of disruptive Chinese AI company DeepSeek has been spotted attending a Beijing conference, one week after snubbing a global AI summit in Paris.",
        "url": "https://news.sky.com/story/deepseek-founder-liang-wengfeng-spotted-in-public-for-first-time-since-company-upended-ai-in-the-west-13311805",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-wenfeng-deepseek_6832351.png?20250218110846",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-02-18 11:00:00",
        "Headline": "Up until DeepSeek's unveiling, the US was thought to hold the global monopoly on artificial intelligence, with every top 10 AI company in the world being based in the States.",
        "Content": "\n          Science and Technology reporter\n        The elusive founder of disruptive Chinese AI company DeepSeek has been spotted attending a Beijing conference, one week after snubbing a global AI summit in Paris. Liang Wenfeng was seen publicly for the first time since the company's AI model upended the tech industry. Up until DeepSeek's unveiling, the US was thought to hold the global monopoly on artificial intelligence, with every top 10 AI company in the world being based in the States.  But when DeepSeek revealed a powerful model that was significantly cheaper to run than OpenAI's ChatGPT, it threw that monopoly into question. Read more:Inside China's Silicon Valley, where founder of DeepSeek Liang keeps a low profileMusk v Altman: The battle to become king of AI The share prices of leading AI chipmaker Nvidia plummeted, as did those of Meta Platforms, Microsoft, and Alphabet. Despite causing chaos in the West, however, Mr Wengfeng didn't attend a global summit on AI in Paris last week.  OpenAI chief executive Sam Altman was in the French capital for the conference and told Sky News he would like to \"work with China\" - although he doesn't know if the US government would let him do that. \"Should we try as hard as we absolutely can [to work with them]? Yes,\" he said. Mr Wengfeng was seen at a rare meeting held by President Xi Jinping on Monday with some of the biggest names in China's technology sector. During the meeting, the president urged Chinese tech leaders to \"show their talent\" and be confident in the power of China's model and market. One analyst said the meeting was a reflection of the Chinese government's concern that it is lagging behind the US when it comes to technology. \"It's a tacit acknowledgement that the Chinese government needs private-sector firms for its tech rivalry with the United States,\" said Christopher Beddor, deputy China research director at Gavekal Dragonomics in Hong Kong. \"The government has no choice but to support them if it wants to compete with the United States.\""
    },
    {
        "title": "Bring back wolves to Scotland to reach net zero, says controversial research",
        "description": "Reintroducing wolves in the Scottish Highlands could allow native forests to bloom and help reach climate targets, researchers have suggested.",
        "url": "https://news.sky.com/story/bring-back-wolves-to-scotland-to-reach-net-zero-says-controversial-research-13311753",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-wolves-scotland_6832419.jpg?20250218115923",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-18 09:02:00",
        "Headline": "The scientists acknowledged a return of the wolf would worry farmers, but said the benefits would be great enough that the idea should be given more thought.",
        "Content": "Reintroducing wolves in the Scottish Highlands could allow native forests to bloom and help reach climate targets, researchers have suggested. Grey wolves would prey on red deer, which hamper forest growth by eating tree saplings. The large carnivores were eradicated from Scotland about 250 years ago, leaving deer with no natural predators. Leeds University scientists said bringing wolves back to the Cairngorms, southwest, northwest and central Highlands could curb deer numbers and allow native woodland to thrive. This would store an extra one million tonnes of greenhouse gases per year - 5% of the target for carbon removals from UK woodlands.  They think a population of about 160 wolves would be realistic, which would be enough to make a sufficient dent in deer numbers. The research, published in the peer-reviewed journal Ecological Solutions and Evidence journal, acknowledged the idea is controversial, not least with farmers worried about livestock.  Lee Schofield, a co-author of the study, said they \"recognise that substantial and wide-ranging stakeholder and public engagement would clearly be essential before any wolf reintroduction could be considered\". He added the aim was to \"provide new information to inform ongoing and future discussions about the possibility of wolf reintroductions both in the UK and elsewhere\". The scheme could even be monetised by farmers or landowners if they were paid for removing carbon dioxide, such as via an offsetting scheme, they said. Backlash to growing wolf numbers in Europe led to a downgrade to their protected status last year, appeasing aggrieved farmers but alarming environmentalists. The wolf population in western Europe currently sits at around 12,000, occupying 67% of their former territory. British deer numbers have ballooned in recent decades, from about 450,000 in the 1970s to two million today - the highest level for 1,000 years. The increase has prompted calls to the public to eat more wild venison, which Forestry England describes as \"extraordinarily ethical and sustainable\". The animals have been chomping their way through the country's target to plant more trees to help reach net zero climate targets. The study said only 4% of Scotland remains blanketed by woodland today, making it one of the least forested places in Europe."
    },
    {
        "title": "Lorries dumped waste on beach - as Sky News told gangs can 'make millions' from illegal tipping",
        "description": "On a bright but chilly February morning, around a dozen volunteers gather by the beachfront at Minster, on the Isle of Sheppey in Kent. ",
        "url": "https://news.sky.com/story/lorries-dumped-waste-on-beach-as-sky-news-told-gangs-can-make-millions-from-illegal-tipping-13311352",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-waste-eastchurch-gap_6831454.jpg?20250217112143",
        "type": "Technology",
        "Author": "Rachael Venables",
        "Date Published": "2025-02-18 01:00:00",
        "Headline": "Gangs will charge hundreds to take away waste and claim it will be processed properly - but then just dispose of it where they can. Experts say they're undeterred by fines and regard them as a \"legitimate business expense\".",
        "Content": "\n          News correspondent\n              @rachaelvenables\n  On a bright but chilly February morning, around a dozen volunteers gather by the beachfront at Minster, on the Isle of Sheppey in Kent.  In bobble hats and walking boots, they carry blue plastic bags and litter pickers. They wander slowly past the dog walkers and brightly painted beach huts, combing the pebbles for waste. But the rubbish they're looking for isn't normal litter; it's builders' rubble and shredded household waste. It was dumped en masse by the lorry load, at an illegal dump site further up the coast by Eastchurch Gap, between 2020 and 2023. \"It's lots of guttering that washes up, whole pipes, tiny rawlplugs, decorators' caulk, bits of plastic and cable ties - it's disgusting,\" says Chris, as he pulls out items from his bin bag - filled in just 20 minutes. Belinda Lamb, who organises the clean-ups, describes seeing \"shredded Christmas trees, bits of carpet, even the spongy material from playgrounds\". \"It's really sad,\" she says. \"It's having a huge impact on marine life - and probably our lives - because if fish are eating this plastic, then so are we.\" They tell me that five years ago, lorries started turning up to tip waste over the cliffs at an illegal dump site a few miles away at Eastchurch Gap. Day after day the vehicles arrived, leaving behind mounds of rotting rubbish and plastic that fills the shoreline, gets picked up by the sea and flung out by the waves further down the beach. Locals are angry, and feel let down. Volunteers repeat their clean-up work monthly - but the sea keeps washing it in. They fear the area, a site of scientific special interest, will be like this for decades. \"It should have been stopped immediately,\" Elliott Jayes, the chair of Minster on Sea Parish Council, says. \"The Environment Agency should have been able to slap a stop notice on it, and it should then immediately stop and prosecutions start straight away.\" Investigations are ongoing at the site. In 2023, magistrates first granted the Environment Agency a six-month restriction order to close it down, which has since been extended. The gate has been locked ever since, with concrete blocks installed to stop vehicles. 'The new narcotics’  We don't know who's behind the Eastchurch Gap site, nor why they dumped the rubbish, but illegal tips are a huge problem across the country and one that's increasingly being exploited by criminal gangs. \"What we're seeing is actually more and more evidence of really serious organised criminal gangs operating in the waste sector, because it's such a low risk, high reward activity,\" explains Sam Corp from the Environmental Services Association. It's something the previous head of the Environment Agency called \"the new narcotics\", and Sam says waste criminals can be involved in multiple offences, from money laundering to human trafficking. It's thought one-fifth of all waste in England is being illegally managed. That's around 34 million tonnes a year, enough to fill about four million skips. It's understood to cost the economy around a billion pounds a year, with a further £3bn thought to hit legitimate operators from missed business. Forms of waste crime include fly-tipping to avoid paying tax or high processing costs, as well as illegal fires and exporting waste to other countries with looser regulations. But criminal gangs are also a sizable part of the problem. Chief innovation and technical development officer for Suez, Stuart Hayward-Higham, explains how the gangs operate. \"Imagine you're a business, so I come along and I say, 'I'll pick up your waste and deal with it'. \"You pay me as though I'm going to treat it properly. So maybe £50 to collect it, manage it, and £100 to treat it. I pick it up and instead of spending the money to treat it, or recycle it, I just throw it on the ground somewhere. \"Then I keep all the profit.\" He says criminals can set themselves up with a licence to manage waste for as little as £154, making hundreds of thousands - even millions of pounds - in this manner. 'Low fines not a deterrent' Despite the scale of the issue, Sam Corp doesn't believe the authorities have enough resources. \"A £1bn problem merits a lot more than the £10m that the Environment Agency gets to tackle this issue every year,\" he says. \"We need regulations to be much tougher and stronger and more strongly enforced. And even if you do get caught, the penalties are far too low and they're not enough of a deterrent.\" He says the criminals \"see fines as a legitimate business expense\". Of the 1,453 illegal dump sites recorded by the Environment Agency in the last decade, just 64 led to some form of enforcement. Thirteen were prosecutions, 14 saw warning letters sent and 26 were logged as leading to \"advice and guidance\". Some 319 of the sites were thought to be linked to organised crime, 130 were hazardous waste, and 261 were in rivers. Read more from Sky News:Landlady describes moments before fatal pub shootingTemperatures could hit 14C after 'anticyclonic gloom' In response, an Environment Agency spokesperson called waste crime \"toxic\". \"It causes widespread and significant harm to people, places, the environment, and the economy,\" they said. \"We are determined to make life harder for criminals by disrupting and stopping illegal activity through tough enforcement action and prosecutions. \"Last year we successfully shut down 462 illegal waste sites, bringing the total number in operation to the lowest on record.\""
    },
    {
        "title": "Meta to build world's longest undersea cable",
        "description": "Meta is planning to build the world's longest undersea cable, aiming to connect the US, India, South Africa, Brazil and other regions.",
        "url": "https://news.sky.com/story/meta-to-build-worlds-longest-undersea-cable-13311761",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-cables-meta_6832253.jpg?20250218093650",
        "type": "Technology",
        "Author": "Mickey Carroll, science and technology reporter",
        "Date Published": "2025-02-18 10:06:00",
        "Headline": "Subsea cables are described as the \"backbone of the internet\" by one group, who says around 95% of all internet traffic goes through these cables.",
        "Content": "By Mickey Carroll, science and technology reporter  Meta is planning to build the world's longest undersea cable, aiming to connect the US, India, South Africa, Brazil and other regions. The owner of Instagram, Facebook, and WhatsApp will build a 50,000km (31,000-mile) cable, which is longer than the Earth's circumference, to make sure artificial intelligence and other new technologies are accessible around the world, it said in a blog post. Project Waterworth will open \"three new oceanic corridors with the abundant, high-speed connectivity needed to drive AI innovation around the world,\" wrote Meta on its engineering blog. Subsea cables are described as the \"backbone of the internet\" by the Global Digital Inclusion Partnership, a group trying to get the world's population \"meaningfully connected\" to the internet by 2030. It reports around 95% of internet traffic travels through these cables, but access to the huge network is patchy, which impacts society's most marginalised groups. Read more from Sky News:Gangs are making 'millions' from illegal rubbish dumpsIs Germany turning to the far right? \"As subsea cables increase data traffic competition and bandwidth availability, the price for each gigabyte of data decreases,\" wrote the group in a report on the topic last year. \n                  DeepSeek founder Liang Wengfeng spotted in public for first time since company upended AI in the West\n                 \n                  Why the UK didn't sign up to global AI agreement\n                 \n                  Has Elon Musk just put OpenAI in a tricky situation?\n                 \"Addressing the affordability barrier may offer key benefits for individuals on lower incomes who are more price sensitive - most of whom are women, people living in rural areas, or other marginalized groups (e.g., people with disabilities).\" Meta has already developed more than 20 subsea cables, while rival tech billionaire Elon Musk is using parades of low-orbit satellites to increase internet connectivity. His Starlink satellites have a different purpose, however. They connect remote, hard-to-reach areas to the internet where cables would struggle to reach. Stargazers can sometimes spot his train of satellites making their way across the night sky after they have been launched, with some of the eerie light chains being spotted over the UK in recent years. Meta's new subsea cable project is predicted to cost billions of dollars and take years to complete. The company described it as its \"most ambitious subsea cable endeavor yet\"."
    },
    {
        "title": "'Loophole' in law on messaging apps leaves children vulnerable to sexual abuse, says NSPCC",
        "description": "Nearly 39,000 child sex abuse image crimes were recorded last year - with an \"unacceptable loophole\" in the law leaving children vulnerable on messaging services, says the NSPCC.",
        "url": "https://news.sky.com/story/loophole-in-law-on-messaging-apps-leaves-children-vulnerable-to-sexual-abuse-says-nspcc-13311489",
        "image_url": "https://e3.365dm.com/22/03/1920x1080/skynews-snap-snapchat_5691555.jpg?20220302112808",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-18 00:00:00",
        "Headline": "NSPCC chief executive Chris Sherwood says the number of crimes being recorded is \"deeply alarming\" and urges the government to toughen up incoming safeguards in the Online Safety Act.",
        "Content": "Nearly 39,000 child sex abuse image crimes were recorded last year - with an \"unacceptable loophole\" in the law leaving children vulnerable on messaging services, says the NSPCC. Snapchat was the app that came up most often in the 7,300 cases where a platform was recorded, according to the children's charity. The NSPCC says it believes the secrecy offered by one-to-one messaging services is being used \"to harm children and go undetected\". It says Home Office data shows more than 38,685 such crimes were logged in England and Wales in 2023/24 - equivalent to more than 100 a day. Police made a note of the service used in just over 7,300 of those cases. Of those, 50% took place on Snapchat, 11% on Instagram, 7% on Facebook and 6% on WhatsApp. The NSPCC is among several charities, including Barnardo's, who have written to the home secretary and technology secretary urging them to strengthen the implementation of the Online Safety Act. Ofcom is in charge of enforcing the new law, but charities say its recent code of practice contains a loophole as it only requires direct messaging services to remove content if it's \"technically feasible\". The NSPCC also wants the platforms themselves to ensure they aren't a \"safe haven\" for abusers. It says those that use end-to-end encryption - where the company is unable to view the messages - can be \"blinded to child sexual abuse material being shared\". An illustration of the type of crime taking place can be seen in the experience of one 13-year-old victim cited by the NSPCC. She said: \"I sent nude pics and videos to a stranger I met on Snapchat. I think he's in his thirties. I don't know what to do next. \"I told him I didn't want to send him any more pictures and he started threatening me, telling me that he'll post the pictures online.\"  NSPCC chief executive Chris Sherwood called the situation \"deeply alarming\" and called on the government to take urgent action. \"Having separate rules for private messaging services lets tech bosses off the hook from putting robust protections for children in place. This enables crimes to continue to flourish on their platforms even though we now have the Online Safety Act,\" he said. The act was passed in 2023 and requires social media firms to reduce illegal and harmful content, but its protections are only just taking effect through Ofcom codes of practice. Read more from Sky News:How a photo led 11-year-old to become sex abuse victimAge checks for porn site must be in place by JulyInstagram's new feature as govt tightens online safety rules Last month, the Internet Watch Foundation (IWF), a charity that helps remove child abuse material, also said the codes gave platforms a \"blatant get-out clause\". However, an Ofcom spokesperson said it anticipated most services would be able to remove harmful content. \"The law says that measures in our codes of practice must be technically feasible,\" said a statement. \"However, we expect the vast majority of platforms will be able to take content down and we will hold them to account if they don't. \"There'll be measures all platforms will need to take to protect children, such as reviewing child sexual abuse material when they become aware of it and reporting it to law enforcement.\" A government spokesperson said: \"Child sexual exploitation and abuse is despicable, and has a devastating impact on victims. UK law is clear: child sexual abuse is illegal and social media is no exception, so companies must ensure criminal activity cannot proliferate on their sites. \"The government is committed to the robust implementation of the Online Safety Act to ensure it delivers on its aim to make the UK the safest place online for children. \"We have already introduced four new laws to crack down on child sexual abuse online, but tech company design choices cannot be used as an excuse not to root out these heinous crimes - and we will not hesitate to go further to protect children from vile online predators.\" Snapchat told Sky News the report does not reflect the seriousness of its efforts to counter this kind of abuse and that when it is made aware of sexually exploitative content on its platforms, \"we remove it, lock the violating account, and report to authorities\". \"Snapchat is designed to make it difficult for predators to find and interact with young people and has extra safeguards in place to help prevent strangers from connecting with teens,\" a Snapchat spokesperson said. \"Our Family Centre also allows parents to see who their teens are friends with and talking to on Snapchat. \"We work with expert NGOs, and industry peers to jointly attack these problems and don't believe the methodology used in this report reflects the seriousness of our collective commitment and efforts,\" they said."
    },
    {
        "title": "MOBO award winners including Central Cee, Bashy and Darkoo revealed at ceremony in Newcastle",
        "description": "Central Cee, Darkoo and Bashy are among the big winners at this year's MOBO Awards.",
        "url": "https://news.sky.com/story/mobo-award-winners-including-central-cee-bashy-and-darkoo-revealed-at-ceremony-in-newcastle-13311994",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-central-cee-reading_6833108.jpg?20250218221609",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-18 22:00:00",
        "Headline": "The 2025 MOBO Awards were held in Newcastle, with performers including Krept & Konan, Bashy, Spice, and Nova Twins. Special gongs were also handed out to athlete Denise Lewis, who took home the \"paving the way\" prize, and Vybz Kartel, who was given the MOBOs impact award.",
        "Content": "Central Cee, Darkoo and Bashy are among the big winners at this year's MOBO Awards. The ceremony took place in Newcastle this evening, with Krept & Konan, Bashy, Spice, and Nova Twins among the performers. Central Cee was named best male act, while Darkoo was named best female and picked up the MOBOs' song of the year award for Favourite Girl, featuring Dess Dior. Central Cee - who wasn't at the ceremony to accept his accolade - is now the joint most-decorated rapper in MOBOs history, tied with Stormzy on seven awards. Bashy's Being Poor Is Expensive was crowned the best album winner, and the actor and rapper was also named best hip-hop act. A special gong was handed out to athlete Denise Lewis, who took home the \"paving the way\" prize, recognising trailblazers across different industries including sports, media and entertainment, as well as music. She follows previous winners such as Idris Elba, Sir Lenny Henry, Nicola Adams, and the late Jamal Edwards. \"King of dancehall\" Vybz Kartel was also honoured with the MOBOs impact award. \"The MOBO Awards have always been about recognising and celebrating cultural pioneers who have reshaped the landscape of music and beyond,\" said MOBOs founder Kanya King ahead of the ceremony. \"Denise Lewis is a true inspiration and it's an absolute pleasure to honour such a legendary figure. Few people have contributed more to their field in this country.\" She went on to say that Vybz Kartel's impact on music was \"immeasurable\", with an influence extending \"beyond the world of dancehall, in which he is a musical giant\". Odeal was named best newcomer and also took the best R&B/soul act prize, while Ayra Starr made history with her two gongs. The Nigerian singer became the first African woman to win best international act and the first female winner of best African music act in 16 years. Other genre category awards included best jazz act for 2023 Mercury Prize winners Ezra Collective, best grime act for Scorcher, best drill act for Pozer, best electronic/dance act for TSHA, best gospel for Annatoria, best Caribbean music act for Shenseea, and best alternative music act for ALT BLK ERA. Elsewhere, Juls was named best producer, 90s Baby Show won the media personality prize, video of the year went to Mnelia's My Man, and actor and musician Jacob Anderson was recognised in the best TV/film performance category, for his role in the series Interview With The Vampire. Central Cee, Raye, and Dave were among the big winners last year, with Soul II Soul, Sugababes and Ghetts receiving special achievement prizes. The MOBOs celebrate black music in the UK and internationally and will mark their 30th anniversary in 2026. In December, King revealed she had been diagnosed with stage four cancer but said she would continue to lead the organisation."
    },
    {
        "title": "The Jam drummer Rick Buckler dies aged 69",
        "description": "The Jam drummer Rick Buckler has died aged 69, his former bandmate Paul Weller has confirmed.",
        "url": "https://news.sky.com/story/the-jam-drummer-rick-buckler-dies-aged-69-13312161",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-rick-buckler-the-jam_6832913.jpg?20250218222435",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-18 19:55:00",
        "Headline": "Buckler played for the band from its formation in 1972 until they broke up a decade later. The group released six studio albums and had 18 consecutive UK top 40 singles, four of them reaching number one.",
        "Content": "The Jam drummer Rick Buckler has died aged 69, his former bandmate Paul Weller has confirmed. Buckler was in the mod punk band alongside bass player Bruce Foxton, 69, and lead singer, songwriter, and guitarist Weller, 66. The drummer was part of the group from their formation in 1972 until they broke up a decade later. They never fully reunited but Foxton and Buckler had played together on a number of occasions. Buckler died after a short illness. He \"passed away peacefully on Monday evening in Woking, after a short illness with family by his side\", his management company said in a statement. \"Rick was a loving husband, father and grandfather and was a devoted friend to many, who will be greatly missed.\" The Jam released six studio albums and Buckler played on them all, including the critically-acclaimed All Mod Cons (1978) and Sound Affects (1980). They had 18 consecutive UK top 40 singles, including four number ones, and also had a UK number one album - The Gift. The Jam are best remembered for tracks such as Town Called Malice, Going Underground, and Down In The Tube Station At Midnight. The band split in 1982 and never fully reunited, but Foxton and Buckler subsequently played together on a number of occasions as From The Jam. In a Facebook and Instagram post, Weller said: \"I'm shocked and saddened by Rick's passing. I'm thinking back to us all rehearsing in my bedroom in Stanley Road, Woking. To all the pubs and clubs we played at as kids, to eventually making a record. What a journey! \"We went far beyond our dreams and what we made stands the test of time. \"My deepest sympathy to all family and friends - P.W x\" Weller also shared a tribute from Foxton on the account, in which he said he \"was shocked and devastated to hear the sad news\". He said Buckler was \"a good guy and a great drummer whose innovative drum patterns helped shape our songs. \"I'm glad we had the chance to work together as much as we did. My thoughts are with Leslie and his family at this very difficult time.\" Early years Buckler was born in Woking in Surrey and attended Sheerwater Secondary School, where he met Weller and Foxton, according to multiple reports. The trio formed The Jam in 1972 when they were all still teenagers and released their first single, In The City, in 1977. By the time they split, they were one of the biggest bands in the UK and several of their hits re-entered the UK singles chart, reflecting their popularity at the time. Weller and Buckler reportedly never spoke again barring a brief interaction, with the singer going on to form The Style Council after the dissolution of The Jam. Post-Jam career Buckler formed a number of groups including Time UK, Sharp - which also featured Foxton, and The Gift, named after The Jam's last studio album and playing music from the band's back catalogue. He toured with From The Jam, a new band playing covers of his first group, from 2007 to 2009, where he was joined by Foxton, who is still touring with the group. Read more on Sky News:Blink 182 star selling Banksy artworkCarry On movie actor diesBig winners at the BAFTAs The drummer lived with his wife, with whom he had two children, Jason and Holly. He also wrote a number of books on the history of The Jam, along with his own autobiography That's Entertainment: My Life In The Jam, which was released in 2015."
    },
    {
        "title": "Strictly's Amy Dowden awarded MBE by King in 'really surreal' experience",
        "description": "Strictly Come Dancing star Amy Dowden has been awarded an MBE by the King at Buckingham Palace.",
        "url": "https://news.sky.com/story/strictlys-amy-dowden-awarded-mbe-by-king-in-really-surreal-experience-13311959",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-amy-dowden-mbe_6832447.jpg?20250218124409",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-18 14:25:00",
        "Headline": "The professional dancer was awarded the honour for fundraising and raising awareness of inflammatory bowel disease.",
        "Content": "Strictly Come Dancing star Amy Dowden has been awarded an MBE by the King at Buckingham Palace. The 34-year-old, who has Crohn's disease, was honoured for her services to fundraising and raising awareness of inflammatory bowel disease. The Welsh professional dancer, who joined the show in 2017, revealed in 2019 she was living with Crohn's and spoke about her struggles living with the condition in a BBC documentary. On Tuesday, Dowden said being honoured \"hasn't sunk in yet\" and that she was determined to continue her work raising awareness and funds for Crohn's and colitis. She also said being made a Member of the Order of the British Empire (MBE) was \"really surreal\" and \"like an out of body experience\". Last year, she was taken to hospital following a Crohn's flare-up while filming the dancing show. Dowden was diagnosed with breast cancer in 2023, shortly after returning from her honeymoon with husband Ben Jones. She said she had spoken to the King about her recovery from cancer as well as the \"impact of chemotherapy on my body\". The Royal Family has also publicly shared their cancer experiences, with Buckingham Palace announcing last year that Charles has been treated for cancer while the Princess of Wales revealed she was in remission from the disease in January after undergoing chemotherapy. Trademark sparkle Marianne Radcliffe, chief executive of Crohn's & Colitis UK, said: \"People never used to talk about Crohn's or Colitis, but Amy has really helped to normalise conversations about these conditions by being open and honest, and adding some of her trademark sparkle. \"Every year, 25,000 people in the UK are told they have inflammatory bowel disease, and there will be many who feel less afraid about what lies ahead because of her work.\" Meanwhile, composer John Rutter, 79, was awarded a knighthood for services to music. Sir John is best known for his choral compositions - including Christmas carols, anthems and extended works - including the Gloria, the Magnificat, and the Requiem. He has been commissioned for several major royal events, including Queen Elizabeth II's golden jubilee; Prince William and Kate's royal wedding in 2011 and King Charles' coronation. Read more on Sky News:Bridget Jones breaks UK box office recordBAFTA 2025 full winners listPlacebo frontman charged with defaming Italian PM Another recipient honoured on Tuesday was Jasvinder Sanghera, who was made a Dame Commander for services to the victims of child, forced marriage and honour-based abuse. Dame Jasvinder was 14-year-old when she was faced with the prospect of a forced marriage. After leaving home, she went on to establish the Karma Nirvana charity in 1993, described on its website as the \"first specialist charity for victims and survivors\"."
    },
    {
        "title": "Carry On actor Julian Holloway dies at 80 after brief illness",
        "description": "British actor Julian Holloway, best known for his appearance in eight Carry On films, has died at the age of 80.\n",
        "url": "https://news.sky.com/story/carry-on-actor-julian-holloway-dies-at-80-after-brief-illness-13311938",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-julian-holloway-carry-on-camping_6832556.jpg?20250218140827",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-18 15:37:00",
        "Headline": "Tributes have been pouring in for the TV and film star, the father of former supermodel  and author Sophie Dahl.",
        "Content": "British actor Julian Holloway, best known for his appearance in eight Carry On films, has died at the age of 80.\n Theatrical agency Sharkey and Co said he died on Sunday at the Royal Bournemouth Hospital in Dorset after \"a brief illness\". Another agency, Damn Good Voices, told the Press Association he will be missed. In the 60s and 70s, he played various characters in eight of the cult Carry On film series, including Carry On Doctor, Carry On Up The Khyber, and Carry On Camping. Holloway had a daughter, the supermodel turned author Sophie Dahl, who was born in 1976 to British actress Tessa Dahl, daughter of children's author Roald Dahl. In the 70s he also had parts on Whatever Happened To The Likely Lads?, The New Avengers and The Professionals and continued acting through the 80s and 90s appearing on shows like Doctor Who and Rumpole of the Bailey His film roles included The Rum Diary starring Johnny Depp and A Christmas Carol with Jim Carrey. \n                  MOBO award winners including Central Cee, Bashy and Darkoo revealed at ceremony in Newcastle\n                 \n                  A$AP Rocky found not guilty of firing gun at his former friend\n                 \n                  The Jam drummer Rick Buckler dies aged 69\n                 Heartfelt tributes have been posted online from the world of showbiz. Actress Sarah Douglas, who played Ursa in Superman, expressed her sadness in a post on Facebook describing her longtime friend as the \"wittiest of men\". Meanwhile, he was called \"an accomplished actor\" by the author Morris Bright who also shared pictures on X. He said Holloway \"could play comedy as deftly as serious roles\". In his later years, Holloway lived in California and performed voice work, mainly for cartoons. He featured in James Bond Jr, Where's Wally?, Star Wars: The Clone Wars and Captain Zed And The Zee Zone. Recent animation shows include the sitcom Regular Show, where he voiced the character of death. Holloway was born in Oxfordshire in 1944. His father was the comedian and film star Stanley Holloway, known for films including My Fair Lady and The Lavender Hill Mob. His mother was Violet Lane, a chorus girl who had a short acting career."
    },
    {
        "title": "Blink-182 star to auction rare Banksy worth millions",
        "description": "Blink-182 star Mark Hoppus is set to auction a rare Banksy painting that is estimated to be worth up to &#163;5m.",
        "url": "https://news.sky.com/story/blink-182s-mark-hoppus-to-auction-rare-banksy-estimated-at-up-to-1635m-13311958",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-mark-hoppus-blink-182_6832634.jpg?20250218145513",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-02-18 14:17:00",
        "Headline": "Mark Hoppus has owned the Banksy painting since 2011, but says he now wants to sell it to buy works by up-and-coming artists and also to donate to good causes - including a charity supporting victims of the recent LA fires.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Blink-182 star Mark Hoppus is set to auction a rare Banksy painting that is estimated to be worth up to £5m. The 52-year-old musician, singer and bassist in the punk-rock trio acquired the work with his wife Skye Everly in 2011. Crude Oil (Vettriano) was first exhibited by Banksy in 2005 and is the anonymous artist's reimagining of Jack Vettriano's career-defining The Singing Butler from 1992, which itself was auctioned by Sotheby's for £744,800 in 2004. Now, the hand-painted Banksy will be auctioned by Sotheby's in London, with some of the proceeds to be donated to causes including the California Fire Foundation, which helps people impacted by the LA wildfires, a children's hospital, and a cancer research centre. \"We loved this painting since the moment we saw it,\" Hoppus said. \"It's borne witness to our family over these past dozen years. It hung over the table in London where we ate breakfast and our son did his homework. It hung in our living room in Los Angeles... \"This painting has meant so much to us and been such an amazing part of our lives, and now I'm excited for it to be out there in the world, seen by as many as possible.\" The Blink-182 star said he would also use the proceeds to buy works by up-and-coming artists. The singer added: \"Coming back to punk rock, one aspect of the community I always hold dear is, if you get lucky enough to gain success, you bring your friends with you. \"Larger bands bring smaller bands on tour. We support one another from within. I want to take some of the money from the sale of this painting and use it to buy works from younger, upcoming artists.\" Read more:Tom DeLonge interview on UFO researchDoes Banksy's fame eclipse political value? Hoppus revealed he had been diagnosed with stage four diffuse large B-cell lymphoma in June 2021, but after chemotherapy he announced he was free from cancer just a few months later. He rose to fame after forming Blink-182 alongside guitarist and vocalist Tom DeLonge and drummer Travis Barker in 1992, and the trio went on to define the pop-punk genre with hits such as The Rock Show, All The Small Things, What's My Age Again?, and I Miss You. DeLonge left the group at the beginning of 2015, but returned in 2022 following his bandmate's diagnosis. Hoppus's memoir, Fahrenheit-182, is due to be released in April. Crude Oil (Vettriano) will be on display at Sotheby's in New York this week before being brought to the UK for a preview exhibition starting on 26 February. It will then headline Sotheby's Modern And Contemporary Evening Auction in London on 4 March. \"Street art and punk rock share the same vocabulary - they speak to the outsider, the rebel and the overlooked,\" said Oliver Barker, Sotheby's Europe chairman. \"Both movements were born from the margins. They challenge authority and re-write the rules, a fundamental trait shared by Mark and Banksy.\" Last year, Banksy made headlines by painting a series of animal works across London, one a day for nine days, including a rhino which appeared to be mounting a parked car, and a gorilla lifting a shutter at London Zoo. In February, London Museum announced it had acquired one of the works - piranhas painted on a police sentry box, resembling a fish tank."
    },
    {
        "title": "Placebo frontman Brian Molko charged with defamation of Italian PM Giorgia Meloni ",
        "description": "Placebo frontman Brian Molko is being charged with defamation after launching insults at Italy's Prime Minister Giorgia Meloni during a gig.",
        "url": "https://news.sky.com/story/placebo-frontman-brian-molko-charged-with-defamation-of-italian-pm-giorgia-meloni-13311874",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-placebo-giorgia-meloni_6239683.jpg?20230803175746",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-18 12:31:00",
        "Headline": "Speaking in front of around 5,000 fans, the frontman of the alternative rock band called the prime minister a \"piece of s***\" and described her as \"fascist\" and \"racist\".",
        "Content": "Placebo frontman Brian Molko is being charged with defamation after launching insults at Italy's Prime Minister Giorgia Meloni during a gig. Brian Molko launched into a rant in Italian about Ms Meloni, who leads the far-right Brothers of Italy party, on stage at the Sonic Park festival in Turin in July 2023. Speaking in front of around 5,000 fans, the frontman of the alternative rock band called the prime minister a \"piece of s***\" and described her as \"fascist\" and \"racist\". His remarks prompted cheers from the audience. Prosecutors in Turin officially opened an investigation into Molko for \"contempt of the institutions\" in August 2023. Reports in Italy say the justice ministry is now allowing prosecutors to move forward with legal proceedings. He could be fined up to €5,000 (£4,300) if convicted. \n                  Blow to Italy's PM Meloni as court blocks plan to detain migrants in Albania\n                 \n                  Italy bans couples travelling abroad for surrogacy - as activists hit out at 'monstrous law'\n                 \n                  Elon Musk denies 'romantic relationship' with Italian Prime Minister Giorgia Meloni\n                 Read more:Singer gives update after being rushed to hospitalPassengers describe miracle escape from plane crash Sky News has contacted the band's representatives for comment. Ms Meloni is no stranger to such court proceedings, having won a defamation lawsuit against journalist Roberto Saviano in 2023, who called her a \"bastard\" during a 2020 TV interview because of her anti-immigration policies. The far-right leader has been a divisive figure since gaining power in 2022, with one of her most recent controversial moves being the passing of a law making it illegal for couples to travel abroad to have a baby via surrogacy."
    },
    {
        "title": "Large sinkhole forces closure of Godstone High Street in Surrey following burst water pipe",
        "description": "A large sinkhole has opened up in a Surrey village - forcing the high street to be closed.",
        "url": "https://news.sky.com/story/large-sinkhole-forces-closure-of-godstone-high-street-in-surrey-following-burst-water-pipe-13312005",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-godstone-surrey-sinkhole_6832802.jpg?20250218205714",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-02-18 15:55:00",
        "Headline": "Part of Godstone High Street was closed, people were evacuated from buildings and a cordon was put in place after the sinkhole was reported on Monday night.",
        "Content": " A large sinkhole has opened up in a Surrey village - forcing the high street to be closed. It happened after a water pipe burst, with some supplies to homes being affected. Godstone High Street was shut between the Oxted Road and Bletchingley Road junctions, Surrey Police said after reports of the sinkhole emerged on Monday night. A small number of buildings were evacuated as a precaution and a 100m cordon was put in place. The sinkhole measured up to 62ft (19m), according to reports, but this has not been confirmed by authorities. Surrey County Council has declared a major incident and local residents have been urged to avoid the area while repair work is being carried out. Godstone resident Sarah Dennis told Sky News' Matt Barbet on The UK Tonight her home's water supply has been cut off even though she lives around half a mile away. \n                  Man with Down's syndrome died after carer 'landed on him' when jumping into pool, inquest told\n                 \n                  Men who described themselves as 'pedos' plotted to kidnap and abuse boys, trial hears\n                 \n                  Judges who oversaw family court proceedings related to care of Sara Sharif can be named\n                 She said the sinkhole is \"getting bigger and bigger and more homes are being evacuated\". Those forced to leave their homes have \"no idea when they will be able to go back or even when they can get their personal possessions\". 'A lot of large lorries' Back in 2019, there was a \"slight sinkhole\" in the same place, she said, and the village is \"right next to the M25\", meaning there are \"a lot of large lorries using the road regularly\". \"It's really scary to think that's the road all the schoolchildren go down during school time,\" she said. \"Thankfully, we're on half-term at the moment, but it doesn't even bear thinking of what could have happened.\" Nicola and Damian Styles, 46 and 44, live in Godstone High Street and said they were woken up by police knocking on their door at about half past midnight on Tuesday morning, who told them to evacuate their home because there was a risk of a gas explosion. \"It was a shock,\" Mrs Styles said. \"My sister lives in Purley so we just drove there in the middle of the night.\" Mr Styles said: \"We just sort of grabbed everything, the clothes on our back and our work laptops, and drove out quickly.\" An 'absolute nightmare' Alan and Tracey Jones, 75 and 61, who also live in the high street, took in their daughter, her husband, and their baby girl at midnight on Tuesday after police told them to evacuate their flat across the road, whose building now stands on the edge of the sinkhole. Mrs Jones said: \"It's an absolute nightmare. Dreadful.\" \"They [the family] arrived at midnight - the police started to evacuate because there was a fear of a gas explosion.\" Carl Bussey, from Surrey County Council, said around 30 properties are within the cordon affected by the hole and those living there \"are being supported by Tandridge District Council with advice around accommodation\". Teams 'working hard to fix this' SES Water said one of its main water pipes had burst in the high street and it apologised for the disruption. An SES spokesperson said: \"The road has been closed and our teams are on site, together with emergency services and other utility providers, working hard to fix this as quickly as possible. \"A diversion route is in place and we are required to redirect traffic onto a like-for-like A-road to ensure the safety of motorists during the repair process. \"Unfortunately, the burst has impacted water supplies to homes in the area and we're sorry for the disruption this is causing customers. \"We're working hard to reroute water from across our network to restore supply for those customers.\" Avoid the area In a post on Facebook, Surrey Police said: \"If you are in the area, please follow the directions of the emergency services. \"There is currently a large emergency services presence in the area. The road is likely to be closed for an extended period of time - please avoid the area if you can.\" Read more from Sky News:Judge condemns politicians over Gaza familyToronto plane crash: What we knowBritish couple charged with spying Last month, a sinkhole the size of a small swimming pool opened up in Japan, swallowing a truck and trapping its driver. In December, a sinkhole appeared on a housing estate near Merthyr Tydfil in South Wales, while in Pennsylvania the body of a woman who fell into a sinkhole was found."
    },
    {
        "title": "Snow village in China apologises for using fake snow during unusually warm weather",
        "description": "A tourist village in China known for its snowy landscapes has apologised for using cotton wool and soapy water to make fake snow during unexpected warmer weather.",
        "url": "https://news.sky.com/story/snow-village-in-china-apologises-for-using-fake-snow-during-unusually-warm-weather-13311766",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-snow-china-beijing_6832274.jpg?20250218100448",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-02-18 09:36:00",
        "Headline": "Misleading social media photos showed large cotton wool sheets strewn about the grounds and on top of houses to try and lure in tourists.",
        "Content": "A tourist village in China known for its snowy landscapes has apologised for using cotton wool and soapy water to make fake snow during unexpected warmer weather. Chengdu, the capital city of the Chinese province of Sichuan, experienced unusually warm weather during the Lunar New Year holiday at the end of January, meaning snow did not form as tourists may have hoped in its snow village. The Chengdu Snow Village project attempted to replicate its typical winters with the artificial snow, posting photos on social media which tourists called misleading. Photos online showed large cotton wool sheets strewn about the grounds and on top of houses, but the village did not disclose it wasn't real snow - though many on social media noticed it. \"A snow village without snow,\" said one user. Read more:Ice hockey game has three fights in first nine secondsKayaker swallowed by humpback whale In a statement on the Chinese social media app Wechat, the village said it \"deeply apologises\" and offered visitors a refund. \n                  DeepSeek founder Liang Wengfeng spotted in public for first time since company upended AI in the West\n                 \n                  China says US 'gravely backpedalled' over change to language around Taiwan\n                 \n                  Why case of jailed Briton Jimmy Lai is major sticking point for Keir Starmer's relations with China\n                 \"In order to create a 'snowy' atmosphere the tourist village purchased cotton for the snow...but it did not achieve the expected effect, leaving a very bad impression on tourists who came to visit,\" the Chengdu Snow Village project said in the statement. The tourist area is believed to have now been cleared of the synthetic snow. China is facing hotter and longer heat waves and more frequent and unpredictable heavy rain as a result of climate change, the country's weather bureau has warned."
    }
]