[
    {
        "title": "Dozens more images of Epstein's island released - showing 'disturbing look into his world'",
        "description": "Images and video of Jeffrey Epstein's private Caribbean island have been released by politicians in the US.",
        "url": "https://news.sky.com/story/never-before-seen-images-of-jeffrey-epsteins-island-released-showing-disturbing-look-into-his-world-13478795",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-oversight-democrats_7099839.jpg?20251203173907",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-03 14:22:00",
        "Headline": "The images of the island come ahead of the much-anticipated release of thousands of Department of Justice files on Epstein.",
        "Content": " Images and video of Jeffrey Epstein's private Caribbean island have been released by politicians in the US. Democrats on the House Oversight Committee said they were \"a harrowing look behind Epstein's closed doors\". \"We are releasing these photos and videos to ensure public transparency in our investigation and to help piece together the full picture of Epstein's horrific crimes,\" Representative Robert Garcia said.  The images are from Little Saint James, part of the US Virgin Islands, where Epstein is believed to have abused underage girls. Faces of men hang on the wall in one room - which also appears to be equipped with a dentist's chair, while the words \"deception\", \"power\" and \"truth\" are written in chalk in the study. Other images show a large shower room, a phone with some of the speed dial numbers redacted, and a photo of Epstein and Ghislaine Maxwell meeting Pope John Paul II. The US Department of Justice currently has until mid-December to release thousands of documents linked to civil and criminal cases involving Epstein. \n                  Epstein latest: Dozens more images released of Epstein island - including masks on wall\n                 \n                  Releasing the Epstein files: How we got here\n                 \n                  Prince Andrew Way to be renamed - but council warns it won't be straightforward\n                 Donald Trump previously opposed the move, but changed his mind last month after US Congress overwhelmingly voted in favour. It could shed more light on the paedophile financier, who at one point socialised with the US president, as well as Andrew Mountbatten-Windsor and Peter Mandelson. All three men have denied wrongdoing. Some details have already been revealed after more than 20,000 other files were disclosed last month - but much more seems set to follow. The Epstein Files Transparency Act demands the release of all files relating to Epstein, including investigations, prosecutions, immunity and plea deals. It also orders the publication of records connected to Ghislaine Maxwell, who is currently serving a 20-year prison sentence. Any flight logs and travel records for Epstein's vehicles must be disclosed, along with individuals named in relation to his criminal activities. Read more:Explainer - What will Epstein files show?What do documents say about Trump, Andrew and Mandelson? Politicians have said the release of the files is critical to uncovering whether powerful figures received special treatment or protection. It is also a response to criticism of a controversial 2008 plea deal in Florida, which allowed Epstein to avoid federal sex trafficking charges and plead guilty to lesser state charges. Epstein killed himself in a prison cell in New York in 2019 but conspiracy theories, once peddled by Mr Trump, remain. Documents related to his death, such as witness interviews and post-mortem reports, must also be released under the law passed last month."
    },
    {
        "title": "Four mayoral elections to be postponed - as Labour accused of 'scandalous attempt to subvert democracy'",
        "description": "Four mayoral elections due to take place in May 2026 are set to be postponed by two years, Sky News understands.",
        "url": "https://news.sky.com/story/labour-accused-of-scandalous-attempt-to-subvert-democracy-as-four-mayoral-elections-to-be-postponed-13479074",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-keir-starmer-frank-walter-steinmeier_7099752.jpg?20251203161303",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-03 22:14:00",
        "Headline": "Reform UK claims it is a \"blatant attempt to stop big wins\" for the party, with the elections due to take place in May now set to be postponed by two years.",
        "Content": "Four mayoral elections due to take place in May 2026 are set to be postponed by two years, Sky News understands. Elections for the new mayoralties of Essex, Hampshire and the Solent, Sussex and Brighton, and Norfolk and Suffolk will be pushed back until 2028. The decision, first revealed by The Sun, is due to be announced by ministers on Thursday. This is the second time elections are being delayed in these areas. Local elections due in May 2025 were delayed by then communities secretary Angela Rayner for a year in order to convert them into combined authorities led by mayors. However, it is understood that these councils need more time to complete their reorganisation.  The news has sparked accusations Labour are delaying the elections for political purposes. Reform UK's head of policy Zia Yusuf said: \"This is a blatant attempt to stop big Reform wins next May. \"It's an act of a desperate government who are clinging onto power by any means necessary. \"Labour has proven time and time again that they're not beyond denying democracy to millions of people in order to maintain their cosy status quo.\" The Tories' shadow housing secretary James Cleverly said it was a \"scandalous attempt to subvert democracy by a Labour government whose credibility and popularity are already in tatters\". \"The Conservatives firmly oppose this decision to delay the mayoral elections, especially when candidates have been selected and campaigning is well under way,\" he added. \"Democracy is being denied yet again after the council elections cancelled by Labour this year. \"There is no credible justification for this move. The Labour government must reverse it immediately.\"  The reorganisation is part of Labour's manifesto commitment to widen devolution, which it argues will improve local economies. The government wants to abolish the two-tier system of county and district councils and merge them together to create larger unitary authorities. It also wants more areas to have regional mayors, like Greater Manchester's Andy Burnham. Read more:Tory-Reform pact talks 'not happening at any level'Reeves hit by Labour rebellion Reform UK enjoyed success in the local elections in May, winning more than 600 seats and taking control of 10 councils stretching from Kent to County Durham. The party also toppled a 14,000-strong Labour majority in a parliamentary by-election. The Liberal Democrats' local government spokesperson Zoe Franklin called the postponed elections \"a disgrace\". \"Democracy delayed is democracy denied,\" she added. \"We are fighting to end this blatant stitch up between Labour and the Conservatives over local elections.\""
    },
    {
        "title": "Doctor who supplied ketamine to late Friends star Matthew Perry jailed",
        "description": "A doctor who pleaded guilty to illegally supplying ketamine to Matthew Perry in the weeks before the star's death has been jailed for two-and-a-half years.",
        "url": "https://news.sky.com/story/doctor-who-supplied-ketamine-to-late-friends-star-matthew-perry-jailed-13478863",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-salvador-plasencia_7099906.jpg?20251203182924",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2025-12-03 16:10:00",
        "Headline": "Salvador Plasencia is the first of five people to be sentenced in connection with the death of the Friends star, who was found drowned in the hot tub at his home in Los Angeles after taking ketamine in October 2023.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n A doctor who pleaded guilty to illegally supplying ketamine to Matthew Perry in the weeks before the star's death has been jailed for two-and-a-half years. Salvador Plasencia, who operated an urgent-care clinic outside Los Angeles, is the first of five people to be sentenced in connection with the death of the Friends actor. Perry was found drowned in the hot tub at his home after taking ketamine in October 2023. \"You and others helped Mr Perry on the road to such an ending by continuing to feed his ketamine addiction,\" Judge Sherilyn Peace Garnett told Plasencia as she handed down the sentence. \"You exploited Mr Perry's addiction for your own profit.\" During the hearing, Plasencia broke into tears as he spoke about the day he would have to tell his now two-year-old son \"about the time I didn't protect another mother's son\". Apologising directly to Perry's family, he said: \"I should have protected him.\" The doctor's mother cried loudly in the courtroom as he was led out in handcuffs. Ahead of the sentencing, Perry's mother Suzanne Perry and stepfather Keith Morrison described those involved in supplying ketamine to the star illegally as \"jackals\", and said they believed Plasencia to be \"among the most culpable of all\". The actor had been taking ketamine legally as a treatment for depression, but started seeking more of the drug and taking it unsupervised in the weeks before his death, acquiring it illegally from different sources. Plasencia, 44, did not supply the dose that killed the actor, but had been distributing the surgical anesthetic to him in the weeks beforehand. He initially denied the charges against him but changed his plea earlier this year, admitting four counts of distribution. He could have faced up to 40 years in prison had he been convicted at trial. Doctor 'fed on vulnerability' Court documents showed details of a text message Plasencia sent to another doctor, who is also due to be sentenced, saying: \"I wonder how much this moron will pay.\" \"Rather than do what was best for Mr Perry - someone who had struggled with addiction for most of his life - [Plasencia] sought to exploit Perry's medical vulnerability for profit,\" the prosecution said in its sentencing memo. Known as \"Dr P\", Plasencia was introduced to Perry by one of his own patients on 30 September 2023, prosecutors said. This patient said the actor was a \"high profile person\" who was willing to pay \"cash and lots of thousands\" for ketamine treatment, and the doctor was \"motivated by the promise of a payday\". Plasencia's lawyers admitted his behaviour was \"reckless\" and said it was \"the biggest mistake\" of his life. \"Remorse cannot begin to capture the pain, regret and shame that Mr Plasencia feels for the tragedy that unfolded and that he failed to prevent,\" they said. Star's family share emotional statements During the hearing, Perry's mother Suzanne addressed the court to talk about everything he had overcome in his life. \"I used to think he couldn't die,\" she said, supported by her husband. \"You called him a 'moron',\" she said to Plasencia. \"There is nothing moronic about that man.\" In victim impact statements submitted to court, she and her husband said Plasencia's actions were not the result of \"one very bad decision\" or done \"in the heat of passion\", and nor was he a \"bad to the bone\" drug dealer. They added: \"No one alive and in touch with the world at all could have been unaware of Matthew's struggles. But this doctor conspired to break his most important vows, repeatedly, sneaked through the night to meet his victim in secret. For what, a few thousand dollars? So he could feed on the vulnerability of our son.\" \"The world mourns my brother,\" Perry's half-sister Madeleine Morrison said. \"He was everyone's favourite friend.\" Perry's father John and stepmother Debbie had called for a lengthy sentence, and said Plasencia's actions had \"devastated\" their family. \"How long did you possibly see supplying Matthew countless doses without his death to eventually follow?\" they asked. \"Did you care? Did you think?\" Read more:The drug network exposed by Perry's deathObituary: The one who made everyone laughMatthew Perry: A life in pictures As well as the prison sentence, Judge Sherilyn Peace Garnett handed down two years of probation to Plasencia. The other four people charged in connection with Perry's death have also accepted plea deals and are due to be sentenced over the next few months. They are: dealer Jasveen Sangha, also known as \"the Ketamine Queen\", Perry's assistant Kenneth Iwamasa, another doctor, Mark Chavez, and Erik Fleming, an associate of the actor. Perry had struggled with addiction for years, dating back to his time on Friends, when he became one of the biggest stars of his generation playing Chandler Bing. He starred alongside Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc and David Schwimmer for 10 seasons, from 1994 to 2004, and appeared in the reunion show in 2021."
    },
    {
        "title": "King Charles welcomes German president Frank-Walter Steinmeier to Windsor Castle for historic state visit",
        "description": "The King has held a state banquet for German president Frank-Walter Steinmeier on the first day of a historic visit. ",
        "url": "https://news.sky.com/story/king-charles-welcomes-german-president-frank-walter-steinmeier-to-windsor-castle-for-historic-state-visit-13478698",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-princess-wales-catherine_7100074.jpg?20251203204303",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-03 10:34:00",
        "Headline": "It is the first state visit by a German leader in 27 years, and follows a pledge from Sir Keir Starmer over closer Anglo-German ties.",
        "Content": " The King has held a state banquet for German president Frank-Walter Steinmeier on the first day of a historic visit.  It is the first by a German leader in 27 years and the streets of Windsor have been adorned with German flags and Union flags. Mr Steinmeier and his wife, Elke Budenbender, were met outside Windsor and Eton Riverside train station by King Charles and Queen Camilla, with the famous castle as the backdrop.  King Charles opened his arms wide, and Mr Steinmeier said: \"It's so wonderful, Your Majesty, to see you again.\" They took a carriage ride to the castle, where they received a ceremonial welcome. Mr Steinmeier also joined Prime Minister Sir Keir Starmer at a roundtable of UK and German business leaders. A glittering state banquet took place on Wednesday evening as around 160 guests assembled at St George's Hall, where a Christmas tree, decked with 3,000 lights, took pride of place. \n                  Princess of Wales: Show people with addictions 'compassion and love' instead of 'judgement'\n                 \n                  King cuts his birthday cake with a little help from the Queen\n                 \n                  Princess Anne lays a wreath at memorial service in Singapore\n                 The King said the UK and Germany were ready to \"bolster Europe\" against further Russian aggression and that both countries \"stand\" with Ukraine. Mr Steinmeier echoed the sentiment, saying they were \"working together to promote security and defence, side by side for a free, peaceful Europe, side by side in support of Ukraine\". There was also a lighter moment when the King quipped about the countries' shared love of football, admitting there was some truth in the phrase that \"in the end, the Germans win\". Royal correspondent A black forest gateau-inspired cocktail, a supermodel and footballing stars, and the only state banquet in living memory to feature a Christmas tree, that's what the German president can expect this evening. It's the third state visit for the royals in a single year - the last time that happened was 1988.  The dinner will be laid on in St George's Hall in Windsor Castle. The 152 guests will be greeted by a 20-ft Christmas tree with thousands of lights and a garter star on top. Windsor is renowned as the historic home of the Order of the Garter.  The guests will be able to sample a chocolate and cherry brandy cocktail, evoking flavours of a black forest gateau. The red wine is from 1995, the year the president and his wife got married. Supermodel Claudia Schiffer is among those attending, sat next to Sir Keir Starmer. German football legend Thomas Hitzlsperger, who played for Everton and Aston Villa, has also been invited and will be sat next to Princess Anne. Composer Hans Zimmer, Strictly judge Motzi Mabuse,  Bayern Munich's Georgia Stanway and Gruffalo illustrator Axel Scheffler will also be there - alongside business leaders and political figures. The menu features open tartlet of Hot Smoked Trout with Langoustines, Quail Eggs and Shellfish Sauce for starter, Windsor Partridge Supreme wrapped in Puff Pastry with Confit Cabbage and Port Sauce for the main course, and for dessert, Baked Alaska with Blackberry, Vanilla and Raspberry Ice Creams.  The visit comes as a £20m electric vehicle (EV) project, led by German car manufacturer Mercedes, was unveiled. The initiative is set to create an initial 150 jobs in Northamptonshire and Oxfordshire. In July, a partnership known as the Kensington Treaty was signed by Germany and the UK, with Sir Keir saying the countries would \"work ever more closely\". 'Our two countries think alike' At his meeting with Mr Steinmeier today, the prime minister said the UK's relationship with Germany is in a \"very, very strong position\". He told the president at Downing Street: \"You and I sat down in Berlin last year, and I remember distinctly you saying to me that the relationship between our two countries was beginning a new chapter, a new opening. And I profoundly believe that that is right.\" Read more:NHS patients being 'set up to suffer' this winter, nurses warnNike, Superdry and Lacoste ads banned  Referencing the Kensington Treaty, Sir Keir added: \"We've also worked very, very closely on hugely important issues like Ukraine, where our two countries think alike and act alike, on issues of migration and on economic growth and trade, where we go from strength to strength.\" Mr Steinmeier will pay his respects and lay flowers at the tomb of the late Queen Elizabeth II in Windsor Castle's St George's Chapel on Thursday morning before addressing parliament later in the day."
    },
    {
        "title": "Reeves between a rook and a hard place after claims she 'made up' chess championship",
        "description": "As an opening gambit at PMQs, Kemi Badenoch attacked Labour's knight, the prime minister, over his Treasury queen, Rachel Reeves.",
        "url": "https://news.sky.com/story/reeves-between-a-rook-and-a-hard-place-after-claims-she-made-up-chess-championship-13479059",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rachel-reeves-wales_7097682.jpg?20251201151103",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-12-03 21:37:00",
        "Headline": "The chancellor's opponents say the Treasury queen has become a pawn - but it's too soon to tell if the chess attack is a checkmate or a stalemate. ",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  As an opening gambit at PMQs, Kemi Badenoch attacked Labour's knight, the prime minister, over his Treasury queen, Rachel Reeves. \"We now know the black hole was fake, the chancellor's book was fake, her CV was fake - even her chess claims are made up,\" said the Tory leader. Politics Live: Labour MP who voted against inheritance tax suspended  \"She doesn't belong in the Treasury; she belongs in la-la land.\" Chess claims made up? Where did that attacking move from Kemi come from? Hasn't the chancellor told us for years that she was a national chess champion in 1993? Indeed she has. \"I am - I was - a geek. I played chess. I was the British girls' under-14 champion,\" she declared proudly in a 2023 interview with The Guardian. She posted a video showing her playing chess in parliament and before last week's budget posed for photos with a chessboard. \n                  Rachel Reeves hit by Labour rural rebellion over inheritance tax on farmers\n                 \n                  Budget 2025: Over a third of Britons think Rachel Reeves exaggerated bad news\n                 \n                  Is Starmer continuing to mislead public over the budget?\n                 But her chess champion claim has been disputed by a former junior champion, Alex Edmans, who has accused her of misrepresenting her credentials. \"Her claim was quite specific,\" Edmans, now a professor of finance at the London Business School, told Ali Fortescue on the Politics Hub on Sky News. \"She said she was the British girls' under-14 champion. There was one event that can go on that title, which is the British Championship. And in the year that she claimed, it was Emily Howard who won that title instead. \"She did indeed win a quite different title. There was a British Women's Chess Association championship, but that's a more minor title. I've won titles like the British squad title, but that's not the same. \"Just like running a marathon in London is not the same as the London Marathon, there was one event which is very prestigious, which is the British Championship. \"So the dispute is not whether she was a good or bad chess player. That shouldn't be the criterion for a chancellor. But if you weren't the British champion, you shouldn't make that statement.\" Read more from Sky News:Mysterious tentacles wash up on Scottish beachAustralia's under-16s social media ban Oh dear! So now, along with allegations of plagiarism, a dodgy CV and \"lying\" - according to Ms Badenoch - about the nation's finances, the chancellor is between a rook and a hard place. Or is she? \"This story is absolute nonsense,\" a Treasury mate told Sky News. No word from the No.10 knight, Sir Keir Starmer, or his Downing Street ranks, however. Emily Howard, as it happens, is now an accomplished composer, having graduated from the chessboard to the keyboard. The chancellor's opponents, meanwhile, claim her budget blunders means the Treasury queen has now become a pawn, there for the taking. But since Rachel Reeves did indeed win a chess title, just not the one she claimed, her supporters insist she can justifiably claim to have been a champion. So it's too soon for Kemi Badenoch and the Conservatives to claim checkmate. The dispute remains a stalemate. For now."
    },
    {
        "title": "Trump 'never rules anything out' to ensure World Cup's safety, key aide tells Sky News",
        "description": "Donald Trump's World Cup supremo has told Sky News the US president \"never rules anything out\" to ensure next year's tournament is staged safely.",
        "url": "https://news.sky.com/story/trump-never-rules-anything-out-to-ensure-world-cups-safety-key-aide-tells-sky-news-13479013",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-world-cup_7100443.jpg?20251203235244",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-12-03 21:11:00",
        "Headline": "There are concerns about ICE agents targeting those at World Cup matches who are violating immigration laws, while Human Rights Watch suggests human and civil rights of fans are under threat at the tournament.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Donald Trump's World Cup supremo has told Sky News the US president \"never rules anything out\" to ensure next year's tournament is staged safely. But in an exclusive interview, Andrew Giuliani, who heads the White House World Cup task force, said it was \"absurd\" for the activists to complain about human rights being under threat at the tournament. Mr Giuliani was speaking as the football world starts to arrive in Washington DC for Friday's tournament draw, when fans can start planning their trips next summer to the US, Canada and Mexico. But Mr Trump has threatened to take matches away from places run by Democrats where he believes fans could be in danger. \"Safety is key and the president is focused not just on our World Cup, but the safety and security of Americans and those international visitors that are travelling here,\" Mr Giuliani said. \"He wants specifically the World Cup to be a welcoming event, but he also wants to make sure that it is safe and secure. He wants to make sure that each of these cities are doing everything they can to make sure it is a safe experience.\" The Boston, Seattle and San Francisco areas have been highlighted by Mr Trump as locations that could be stripped of hosting. \n                  FIFA backs away from dynamic pricing for all World Cup 2026 tickets\n                 \n                  Trump unveils FIFA PASS scheme to give priority visa appointment access to World Cup fans\n                 \n                  UEFA should decide if Israeli teams should be banned, FIFA VP tells Sky News\n                 \"The president urges every single governor and every single mayor to do the best they can, whatever their politics are,\" Mr Giuliani said. Mr Trump has made protecting the United States a key tenet of his agenda, with the prospect raised of Immigration and Customs Enforcement (ICE) agents targeting those at World Cup matches who are violating immigration laws. Mr Giuliani said: \"There were no raids at Club World Cup games. That was a big narrative going into that. \"But what I can also tell you is that the president never rules anything out when it comes to safely and securely protecting, whether it's stadiums, fan festivals, American citizens and those international visitors that are coming here for an event like the World Cup. \"So I know he's not going to rule anything [out] that can actually help make a stadium make an area safer.\"  Human Rights Watch staged a news conference in Washington earlier, where they suggested the tournament was being weaponised by Mr Trump and the human and civil rights of fans were in jeopardy. \"That sounds like an absurd allegation,\" Mr Giuliani responded, referencing the president's work ending wars. \"What he was able to achieve in the Middle East. Other presidents had tried and could not get over the finish line. He was able to do it. \"What he's trying to work on right now between Russia and Ukraine, no other president would be able to approach it the way that he's able to do it. So look, erroneous allegations like that, I don't think are worth a real response.\" It is inevitable the interview focuses so much on security when it is the first World Cup being staged across three countries and expansion to 48 teams, adding 16 more finalists. \"I don't want to talk about intelligence and what has or what will be done,\" Mr Giuliani said. \"But look, America and a World Cup, they're always a target. We know that. \"And we're very well aware of the potential vulnerabilities that could exist.\" Read more from Sky News:World Cup: All you need to knowFIFA backs off from dynamic pricingHow to get World Cup tickets There is $500m (£374.5m) being spent on countering unauthorised drones at major events, including the World Cup. \"We can look at vehicle ramming - that's something that's been a copycat,\" Mr Giuliani said, discussing World Cup risks. \"What I can tell you,\" he added, \"is that the overwhelming majority of my job and our work, from a federal perspective, is committing to making this a safe World Cup and eliminating those threats.\" But how will it work staging the tournament alongside Canada and Mexico when Mr Trump has talked tough against the countries, whether on trade or combating drugs? Mr Giuliani said: \"Even though we may have different political backgrounds, different beliefs still, our three countries are working together to make this World Cup a great success and something that hopefully will be a benchmark moving forward, not just for World Cups around the world, but also hopefully to get another World Cup in my lifetime back in the United States, in North America.\" There will be a fast-track visa process for fans to ensure they can fly into the United States. But there is a travel ban on anyone from Haiti and Iran, although exceptions have been granted for team delegations for the draw. \"Every single visa decision is a national security decision,\" Mr Giuliani said. And for a White House used to dominating the global agenda, there is a realisation that a World Cup puts the United States in the global spotlight like nothing else in sport for so long. \"It's a great opportunity over America's 250th birthday to really show off American exceptionalism,\" he said, adding: \"This is going to be the largest sporting event in American history and we're very excited to host.\""
    },
    {
        "title": "US defence secretary Pete Hegseth faces escalating scrutiny as report finds he put troops at risk",
        "description": "US defence secretary Pete Hegseth risked imperilling American troops by sharing information that could have been intercepted by a foreign adversary, according to a Pentagon watchdog.",
        "url": "https://news.sky.com/story/us-defence-secretary-pete-hegseth-faces-escalating-scrutiny-as-report-finds-he-put-troops-at-risk-13478994",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-hegseth-pete_7100264.jpg?20251203220733",
        "type": "Home",
        "Author": "David Blevins",
        "Date Published": "2025-12-03 20:52:00",
        "Headline": "Sky's US partner NBC is reporting that the Inspector General also found that Mr Hegseth violated military regulations by using his personal phone for official business.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  US defence secretary Pete Hegseth risked imperilling American troops by sharing information that could have been intercepted by a foreign adversary, according to a Pentagon watchdog. Sky's US partner NBC News is reporting that the Inspector General also found that Mr Hegseth violated military regulations by using his personal phone for official business. The detail circulated in a group chat on the Signal app in March this year related to an imminent strike on Houthi rebels in Yemen. Messages reportedly posted by Mr Hegseth included: \"1415: Strike drones on target (THIS IS WHEN THE FIRST BOMBS WILL DEFINITELY DROP).\" Another read: \"We are currently clean on OPSEC\" - that's operational security, suggesting the sender recognised the sensitivity of the information. Read more:Hegseth cites 'fog of war' in defence of second 'drug boat' strikeWhy Putin won't agree to latest Ukraine peace plan A journalist from The Atlantic had been inadvertently added to the group chat and reported how the top-secret military operation had been shared both in advance and in real time. The Pentagon has weathered many scandals but rarely has it faced a convergence of crises that point so clearly to the man at the top. Donald Trump’s pick for defence secretary – the former Fox News anchor Pete Hegseth – only got the job on the casting vote of Vice President JD Vance. Signal-gate was the first in a series of scandals that have blighted his first year in office. The Pentagon press corps walked out over draconian restrictions imposed by the Secretary of War. This week, he has been defending a second strike on a boat in the Caribbean, the vessel having already been incapacitated. Critics call his actions a \"war crime\".  It has been crisis after crisis and the Signal-gate report will bring more questions about his ability to not just lead the world’s most powerful army but also protect US troops. The 'Signal-gate' scandal led to bipartisan calls for Mr Hegseth's resignation, but it was Donald Trump's national security advisor Mike Waltz, who was also in the group, who lost his job. It later emerged that Mr Hegseth had created a second Signal group, including his wife, brother and personal lawyer, and shared much of the same detail there. The information came from an email labelled 'SECRET/NOFORN\", meaning it was classified and not to be shared with foreign nationals. Mr Hegseth, who has renamed his office The Department of War, declined to be interviewed by those investigating what became known as 'Signal-gate'. In a written submission, he said he only shared information that he thought would not risk the mission or troops carrying it out."
    },
    {
        "title": "Scientist hails 'incredible find' as mysterious tentacles wash up on Scottish beach",
        "description": "Mysterious tentacles washed up on a beach in Scotland belong to a rare deep-sea creature called the seven-arm octopus, a scientist has told Sky News.",
        "url": "https://news.sky.com/story/scientist-hails-incredible-find-as-mysterious-tentacles-wash-up-on-scottish-beach-13478918",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-dr-lauren-smith-octopus_7099787.jpg?20251203204830",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-03 17:52:00",
        "Headline": "A couple of local residents spotted the remains at Forvie National Nature Reserve in Aberdeenshire and contacted reserve staff. ",
        "Content": " Mysterious tentacles washed up on a beach in Scotland belong to a rare deep-sea creature called the seven-arm octopus, a scientist has told Sky News. The remains were found by a couple of local residents who spotted the arms at Forvie National Nature Reserve in Collieston, Aberdeenshire, and contacted reserve staff. Marine biologist Dr Lauren Smith, who rushed over the following day to investigate, told Sky News it was \"an incredible find\". The octopuses, which have the scientific name Haliphron atlanticus, usually glide through waters at a depth of 500m plus and can reach up to four metres in size - making them a highly unusual find in the shallow areas of the Scottish coast. The species actually have eight arms, despite the name, but males have one modified arm, a reproductive organ, that curls under itself. Dr Smith said when she saw the photographs \"of these arms with the suckers on like that\" it was the \"sheer size of them that I realised it was something pretty special\". Scientists have been scratching their heads over how the rare octopus species washed up in the shallow coastal waters. Read more from Sky News:Water restored to thousands of Kent homesKing Charles welcomes German president to Windsor Castle Dr Smith posed the theory that the octopus could have become \"disorientated\" before being partially consumed, noting that there are large whales in the area, with the remains then washing up onto the beach. The arms are now in her freezer, she added. \"I had to get them frozen down as soon as possible because they're obviously quite important finds.\" Dr Smith, of East Grampian Coastal Partnership, said they will now be taken to various laboratories, research areas, research groups, and potentially some museums, for analysis."
    },
    {
        "title": "Four mayoral elections to be postponed - as Labour accused of 'scandalous attempt to subvert democracy'",
        "description": "Four mayoral elections due to take place in May 2026 are set to be postponed by two years, Sky News understands.",
        "url": "https://news.sky.com/story/labour-accused-of-scandalous-attempt-to-subvert-democracy-as-four-mayoral-elections-to-be-postponed-13479074",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-keir-starmer-frank-walter-steinmeier_7099752.jpg?20251203161303",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-03 22:14:00",
        "Headline": "Reform UK claims it is a \"blatant attempt to stop big wins\" for the party, with the elections due to take place in May now set to be postponed by two years.",
        "Content": "Four mayoral elections due to take place in May 2026 are set to be postponed by two years, Sky News understands. Elections for the new mayoralties of Essex, Hampshire and the Solent, Sussex and Brighton, and Norfolk and Suffolk will be pushed back until 2028. The decision, first revealed by The Sun, is due to be announced by ministers on Thursday. This is the second time elections are being delayed in these areas. Local elections due in May 2025 were delayed by then communities secretary Angela Rayner for a year in order to convert them into combined authorities led by mayors. However, it is understood that these councils need more time to complete their reorganisation.  The news has sparked accusations Labour are delaying the elections for political purposes. Reform UK's head of policy Zia Yusuf said: \"This is a blatant attempt to stop big Reform wins next May. \"It's an act of a desperate government who are clinging onto power by any means necessary. \"Labour has proven time and time again that they're not beyond denying democracy to millions of people in order to maintain their cosy status quo.\" The Tories' shadow housing secretary James Cleverly said it was a \"scandalous attempt to subvert democracy by a Labour government whose credibility and popularity are already in tatters\". \"The Conservatives firmly oppose this decision to delay the mayoral elections, especially when candidates have been selected and campaigning is well under way,\" he added. \"Democracy is being denied yet again after the council elections cancelled by Labour this year. \"There is no credible justification for this move. The Labour government must reverse it immediately.\"  The reorganisation is part of Labour's manifesto commitment to widen devolution, which it argues will improve local economies. The government wants to abolish the two-tier system of county and district councils and merge them together to create larger unitary authorities. It also wants more areas to have regional mayors, like Greater Manchester's Andy Burnham. Read more:Tory-Reform pact talks 'not happening at any level'Reeves hit by Labour rebellion Reform UK enjoyed success in the local elections in May, winning more than 600 seats and taking control of 10 councils stretching from Kent to County Durham. The party also toppled a 14,000-strong Labour majority in a parliamentary by-election. The Liberal Democrats' local government spokesperson Zoe Franklin called the postponed elections \"a disgrace\". \"Democracy delayed is democracy denied,\" she added. \"We are fighting to end this blatant stitch up between Labour and the Conservatives over local elections.\""
    },
    {
        "title": "Nursery worker, 45, pleads guilty to 26 sexual offences against children",
        "description": "A nursery worker has pleaded guilty to 26 sexual offences against children following one of the Metropolitan Police's most harrowing and complex child sexual abuse investigations. ",
        "url": "https://news.sky.com/story/nursery-worker-45-pleads-guilty-to-26-sexual-offences-against-children-13478610",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-vincent-chan-nursery-worker_7099530.png?20251203120004",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-03 12:04:00",
        "Headline": "Vincent Chan, 45, of Finchley, worked at a now-closed nursery in north London between 2017 and 2024.",
        "Content": " A nursery worker has pleaded guilty to 26 sexual offences against children following one of the Metropolitan Police's most harrowing and complex child sexual abuse investigations.  Vincent Chan, 45, of Finchley, worked at a nursery in north London between 2017 and 2024. The offences include five counts of sexual assault of a child by penetration, four counts of sexual assault of a child by touching, 11 counts of taking indecent photographs or pseudo-photographs of a child, and six counts of making indecent photographs or pseudo-photographs of a child. The latter offences involved images across categories A, B, and C, with category A depicting the most severe abuse. Chan will be sentenced at Wood Green Crown Court on 23 January. The Met said this was one of its most harrowing and complex child sexual abuse investigations. Chan was unmasked as a paedophile after a nursery staff member reported that he had callously filmed a child falling asleep in their food with a nursery-issued device and set it to music for \"comedic purposes\" before sharing the video with his colleagues, the force said in a statement. He was subsequently arrested in June 2024 on suspicion of neglect and officers seized 25 digital devices from his home and three from the nursery. Chan was released on bail, but lost his job at the nursery. Three months later, his devices were submitted for analysis by police, which was completed in July 2025. Forensic teams found substantial amounts of indecent images and videos of children, including evidence of contact sexual offences against children, according to the police statement. Chan was arrested in September this year on suspicion of sexual offences. Officers seized another 26 devices from his home as well as 15 from the nursery, a since-closed branch of Bright Horizons in West Hampstead. Detective Superintendent Lewis Basford, who led the Met's investigation, said: \"Child sexual abuse is one of the most horrific crimes imaginable, and Chan’s offending spanned years, revealing a calculated and predatory pattern of abuse. \"He infiltrated environments that should have been safe havens for children, exploiting the trust of families and the wider community to conceal his actions and prey on the most vulnerable.\" DCI Basford added: \"We recognise the member of staff who raised their concerns, as without that first report of child cruelty, Chan's abuse could have continued unchecked, putting countless more children at risk.\" At this time, police identified four children as Chan's victims. The families of the victims have been contacted directly and are receiving specialist support, while the NSPCC is running a helpline for all 700 families of children who attended the nursery during the time Chan worked there between 2017 and 2024. In a statement issued through legal firm Leigh Day, some of the families affected said: \"As parents, we are still trying to process the sickening discovery that our children were subjected to despicable abuse by Vincent Chan at the nursery. \"We trust the judge to pass the strongest sentence to fit the crimes Vincent Chan has committed against young children, innocent victims who could not fight back.\" Read more from Sky News:Pictured: Girl killed in children's birthday party shootingDecade of county lines leaves its scars on children A spokesperson for the nursery said following Chan's guilty pleas: \"This individual's actions represent not only a violation of the victims, but also a profound betrayal of the trust placed in him by families and colleagues.\" They said the company has extensive safeguarding practices in place, including rigorous vetting and DBS criminal record checks. The company has commissioned an external expert in the field to undertake a full review of its safeguarding practices after Chan \"was able to commit these crimes despite our safeguarding measures\", the nursery spokesperson said. Anyone who wants to make a report to police about Chan can contact OpLanark@met.police.uk, or call 101 from within the UK, quoting the reference CAD3697/1DEC. "
    },
    {
        "title": "Harry Dunn: 'Useless' UK government failed teenager killed by US spy, family says",
        "description": "The family of teenager Harry Dunn, killed by a former US spy, said a damning report into the UK government's handling of their case was \"incredibly painful\" to read.&#160;",
        "url": "https://news.sky.com/story/harry-dunn-useless-uk-government-failed-teenager-killed-by-us-spy-family-says-13478700",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-harry-dunn-anne-sacoolas_6264477.jpg?20230827094558",
        "type": "UK",
        "Author": "Lisa Dowd",
        "Date Published": "2025-12-03 13:30:00",
        "Headline": "American driver Anne Sacoolas left Britain with diplomatic immunity 19 days after the head-on crash that killed motorbike rider Harry Dunn, 19, outside RAF Croughton in Northamptonshire in 2019.",
        "Content": "\n          Midlands correspondent\n              @LisaSkyNews\n  The family of teenager Harry Dunn, killed by a former US spy, said a damning report into the UK government's handling of their case was \"incredibly painful\" to read.  American driver Anne Sacoolas left Britain with diplomatic immunity 19 days after the head-on crash that killed motorbike rider Harry, 19, outside RAF Croughton in Northamptonshire in August 2019. The report into the government's handling of the case, chaired by Dame Anne Owers, marks the end of a six-year struggle for justice and accountability. It highlights the point at which Sky News first broke the story of Harry Dunn in October 2019 as a key moment when attention on the case escalated at the Foreign and Commonwealth Office (FCO). \"There was in fact no direct contact between the FCO and the family until 4 October, the day before the Sky News interview was due to go out, when the family was offered a meeting with the foreign secretary himself,\" Dame Anne said. \"The family drew the conclusion that this rapid escalation to a very senior level was a direct result of the spotlight of media coverage.\" The report lays bare layer upon layer of failings within the UK government that compounded Harry's parents' grief and anguish. \n                  Harry Dunn's family file complaint against former police chief after report\n                 \n                  Police admit failures in Harry Dunn case after report finds officers prioritised suspect's welfare\n                 \n                  Harry Dunn's remains 'kept by police for more than four years', mother says\n                 Former foreign secretary David Lammy officially launched the review into the case in July, with the report's author highlighting \"failings and omissions\" in the department when dealing with Harry's death. It is understood Dame Anne told the Dunn family it was her \"strong view\" the then foreign secretary Dominic Raab should have been involved \"far earlier in the process\", with his private office being copied into a note three days after the crash expressing concern over potentially \"unpalatable headlines\". Harry's mother Charlotte Charles, a campaigner for road safety, said it was \"incredibly painful\" to read.  \"The report confirms what we have lived with every day for more than six years, that our family was not treated with the honesty or urgency that any grieving parent deserves,\" she said, welcoming the findings. His father Tim Dunn said: \"We knew our own government would be useless to us and this report confirms what we knew in those early days. The UK was no match for the US.\" Dame Anne criticised the UK government's initial handling of the case and subsequent years. \"This issue was not recognised as a crisis and escalated to a sufficiently high level at an early stage, losing opportunities to influence, rather than respond to, events,\" she said in the report. Dame Anne said the US showed \"immediate high-level interest\" and took \"an inflexible approach\" after Sacoolas had flown back to America. \"On the UK side this was initially treated as business as usual,\" Dame Anne said in the report. In 2022, Sacoolas admitted causing death by careless driving, but she remained in the US and appeared in a UK court via video link, something the report described as \"unprecedented remote proceedings\". The former spy refused to return to the UK for sentencing. In her absence, she was given an eight-month suspended prison sentence and driving ban. The diplomatic loophole that Sacoolas and the US government exploited when she left, claiming immunity, has since been closed. Read more:Harry Dunn killer apologisesHis family's complaint against former police chiefCriticism over lack of driver training at US base Driver safety initiatives at US bases in the UK have also been improved. Dame Anne also made 12 recommendations to improve communications and support for families, as well as transparency around complex diplomatic arrangements at military bases like RAF Croughton."
    },
    {
        "title": "Engineer loses case against her employer over transgender toilet policy",
        "description": "An engineer who took aerospace giant Leonardo UK to an employment tribunal for having to share women's toilets with transgender colleagues has lost a discrimination claim.",
        "url": "https://news.sky.com/story/engineer-loses-case-against-her-employer-over-transgender-toilet-policy-13478877",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-maria-kelly-leonardo-uk_7099781.jpg?20251203164559",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-03 16:42:00",
        "Headline": "The case followed the UK Supreme Court judgment in April which ruled the terms \"woman\" and \"sex\" in the 2010 Equality Act refer to a biological woman and biological sex.",
        "Content": "An engineer who took aerospace giant Leonardo UK to an employment tribunal for having to share women's toilets with transgender colleagues has lost a discrimination claim. Maria Kelly alleged harassment related to sex, direct sex discrimination and indirect sex discrimination. Ms Kelly took action after lodging a formal grievance with the company. The tribunal was heard in Edinburgh in October, but all of her claims have now been dismissed by employment judge Michelle Sutherland. Ms Kelly said she believes the outcome \"fundamentally misunderstands both the law and my case\", as she announced plans to appeal. In a written judgment published on Wednesday, Ms Sutherland said Leonardo UK's position was that \"one out of 9,500 employees raised a concern about the impact of the policy despite multiple means to do so\". She found there was no \"disadvantage\" due to the policy. \n                  Scientist hails 'incredible find' as mysterious tentacles wash up on Scottish beach\n                 \n                  Scottish government orders review of grooming gangs evidence amid calls for a public inquiry\n                 \n                  Retired teacher spared jail for 'sadistic' abuse of young girls at Angus school\n                 Ms Sutherland added: \"Any fear or privacy impact could be addressed by affected female staff making recourse to the single occupancy facilities. \"Any effect on risk of assault arising from 0.5% of men using the women's toilets instead of the men's toilets would not have changed the overall risk profile across toilet facilities generally. \"In the circumstances of this case, the toilet access policy was in the alternative a proportionate means of achieving a legitimate aim.\" The case followed the UK Supreme Court judgment in April which ruled the terms \"woman\" and \"sex\" in the 2010 Equality Act refer to a biological woman and biological sex. Read more from Sky News:Women's Institute to ban transgender membersNHS chief announces early retirement plan Ms Kelly, people and capability lead for the firm, had told the tribunal she began using a \"secret\" toilet at her workplace after encountering a transgender colleague in a female bathroom in March 2023. She said she had first become aware of a transgender person using the female toilets in 2019 but did not raise the issue with the company at the time as she feared being labelled \"transphobic\" or being put on the \"naughty list\". Ms Kelly said: \"I am of course disappointed by the judgment, which I believe fundamentally misunderstands both the law and my case. \"I intend to appeal, and I will ask the EAT (Employment Appeal Tribunal) to consider expediting my appeal as the decision risks further confounding the already widespread misunderstanding and defiance of the Supreme Court's judgment in For Women Scotland.\" Maya Forstater, chief executive of charity Sex Matters, said: \"This judgment interprets the law as transactivists would wish it to be, and is incompatible with the Supreme Court ruling in For Women Scotland in several places. \"It is incredible that even after the highest court in the land has ruled that the law recognises men and women in terms of biological sex, there are lower courts still trying to see the world in terms of gender identity.\" Leonardo UK acknowledged the tribunal's judgment. A spokesperson for the firm added: \"We recognise that the process has been demanding for everyone involved and we appreciate the professionalism shown by colleagues who supported the proceedings. \"Our focus now is to ensure that workplace conduct remains respectful and that our facilities' policies continue to meet legal standards. \"We will review the forthcoming Equality and Human Rights Commission guidance when it is published and will make any adjustments that are required. \"Leonardo remains a supportive and inclusive environment for all employees.\""
    },
    {
        "title": "Reeves between a rook and a hard place after claims she 'made up' chess championship",
        "description": "As an opening gambit at PMQs, Kemi Badenoch attacked Labour's knight, the prime minister, over his Treasury queen, Rachel Reeves.",
        "url": "https://news.sky.com/story/reeves-between-a-rook-and-a-hard-place-after-claims-she-made-up-chess-championship-13479059",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rachel-reeves-wales_7097682.jpg?20251201151103",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-12-03 21:37:00",
        "Headline": "The chancellor's opponents say the Treasury queen has become a pawn - but it's too soon to tell if the chess attack is a checkmate or a stalemate. ",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  As an opening gambit at PMQs, Kemi Badenoch attacked Labour's knight, the prime minister, over his Treasury queen, Rachel Reeves. \"We now know the black hole was fake, the chancellor's book was fake, her CV was fake - even her chess claims are made up,\" said the Tory leader. Politics Live: Labour MP who voted against inheritance tax suspended  \"She doesn't belong in the Treasury; she belongs in la-la land.\" Chess claims made up? Where did that attacking move from Kemi come from? Hasn't the chancellor told us for years that she was a national chess champion in 1993? Indeed she has. \"I am - I was - a geek. I played chess. I was the British girls' under-14 champion,\" she declared proudly in a 2023 interview with The Guardian. She posted a video showing her playing chess in parliament and before last week's budget posed for photos with a chessboard. \n                  Rachel Reeves hit by Labour rural rebellion over inheritance tax on farmers\n                 \n                  Budget 2025: Over a third of Britons think Rachel Reeves exaggerated bad news\n                 \n                  Is Starmer continuing to mislead public over the budget?\n                 But her chess champion claim has been disputed by a former junior champion, Alex Edmans, who has accused her of misrepresenting her credentials. \"Her claim was quite specific,\" Edmans, now a professor of finance at the London Business School, told Ali Fortescue on the Politics Hub on Sky News. \"She said she was the British girls' under-14 champion. There was one event that can go on that title, which is the British Championship. And in the year that she claimed, it was Emily Howard who won that title instead. \"She did indeed win a quite different title. There was a British Women's Chess Association championship, but that's a more minor title. I've won titles like the British squad title, but that's not the same. \"Just like running a marathon in London is not the same as the London Marathon, there was one event which is very prestigious, which is the British Championship. \"So the dispute is not whether she was a good or bad chess player. That shouldn't be the criterion for a chancellor. But if you weren't the British champion, you shouldn't make that statement.\" Read more from Sky News:Mysterious tentacles wash up on Scottish beachAustralia's under-16s social media ban Oh dear! So now, along with allegations of plagiarism, a dodgy CV and \"lying\" - according to Ms Badenoch - about the nation's finances, the chancellor is between a rook and a hard place. Or is she? \"This story is absolute nonsense,\" a Treasury mate told Sky News. No word from the No.10 knight, Sir Keir Starmer, or his Downing Street ranks, however. Emily Howard, as it happens, is now an accomplished composer, having graduated from the chessboard to the keyboard. The chancellor's opponents, meanwhile, claim her budget blunders means the Treasury queen has now become a pawn, there for the taking. But since Rachel Reeves did indeed win a chess title, just not the one she claimed, her supporters insist she can justifiably claim to have been a champion. So it's too soon for Kemi Badenoch and the Conservatives to claim checkmate. The dispute remains a stalemate. For now."
    },
    {
        "title": "Stronger reforms called for over baby formula crisis",
        "description": "The UK government is being urged to take even stronger action to tackle the ongoing crisis of families unable to afford baby formula milk.&#160;",
        "url": "https://news.sky.com/story/campaigners-call-for-stronger-reforms-to-tackle-baby-formula-crisis-13478940",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-baby-newborn-hospital_6966692.jpg?20250717072938",
        "type": "UK",
        "Author": "Tom Parmenter",
        "Date Published": "2025-12-03 18:40:00",
        "Headline": "It comes two-and-a-half years after a Sky News investigation revealed the extreme measures families were taking to feed their babies.",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  The UK government is being urged to take even stronger action to tackle the ongoing crisis of families unable to afford baby formula milk.  The prime minister backed limited reforms to the market to help parents save money but will not yet support more radical changes. Sir Keir Starmer confirmed support for better public health messaging to inform parents that cheaper brands are nutritionally equivalent when compared with the most expensive. A ban on spending store loyalty points on baby formula will also be lifted. They were among recommendations made by the Competition and Markets Authority which investigated the baby formula industry and described the price rises in recent years as unjustifiable. In the House of Commons the prime minister said: \"For too long parents have been pushed into spending more on infant formula. \"They were told they're paying for better quality and left hundreds of pounds out of pocket. \n                  3.3-magnitude earthquake shakes part of northwest England\n                 \n                  Four mayoral elections to be postponed - as Labour accused of 'scandalous attempt to subvert democracy'\n                 \n                  Nursery worker, 45, pleads guilty to 26 sexual offences against children\n                 \"I can announce today that we're changing that. We will take action to give parents and carers the confidence to access infant formula at more affordable prices, with clearer guidance for retailers on helping new parents use loyalty points and vouchers together.\" It comes two-and-a-half years after a Sky News investigation revealed the extreme measures families were taking to feed their babies.  Read more:Affordability of formula milk a 'constant' pressureGenetics testing start-up offers to 'genetically optimise' would-be parents' babies Parents described how they had resorted to stealing to feed their infants, some were watering down formula milk or substituting it for condensed milk. The British Pregnancy Advisory Service described the situation in 2023 as a \"national scandal\". Campaigners told Sky News the UK government needed to go further to address the crisis. Co-founder of Feed UK Erin Williams told Sky News: \"It is progress, they promised to look at this enormous nationwide problem and they have. \"At the moment women are still not routinely getting important information before giving birth - this should be given proactively to everybody and that will be a big win. \"The prime minister though needs to be tougher on the baby formula companies. \"Their marketing claims, their unjustified pricing - it's stacked against families who just need to feed their babies safely.\" The UK government stopped short of accepting all of the recommendations made by the CMA. More radical ideas such as a price cap on baby formula are not being considered. Charities have also told Sky News the situations some families find themselves in have not eased. Founder of the Hartlepool Baby Bank, Emilie De Bruijn, told Sky News the demand they see from desperate families is \"constant and unmanageable\". She said: \"Parents are really feeling the pinch right now, and demands on baby banks are rising and it can feel quite relentless. \"We are pleased to see the extension of the National Breastfeeding Helpline alongside measures such as allowing parents to use points and vouchers. \"It is important that parents are supported to feed their children in whatever way they want and we hope that steps will continue to be taken to reduce the cost of formula and increase understanding that all brands are nutritionally the same.\""
    },
    {
        "title": "Tory-Reform pact talks 'not happening at any level', says Richard Tice",
        "description": "Reform UK's deputy leader Richard Tice has told Sky News that talks of an electoral pact with the Tories \"are not happening at any level\". ",
        "url": "https://news.sky.com/story/reform-and-tories-deny-they-could-unite-for-next-election-13478591",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nigel-farage-kemi-badenoch_7099198.jpg?20251203015154",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-03 01:52:00",
        "Headline": "Nigel Farage has done a deal with the Tories before, but insists those days are long behind him. It comes after a report said he's told Reform donors he believes the two parties will have to team up to win the next election.",
        "Content": " Reform UK's deputy leader Richard Tice has told Sky News that talks of an electoral pact with the Tories \"are not happening at any level\".  The Financial Times (FT) quoted unnamed sources who said Nigel Farage had told donors he believes an agreement between both parties is inevitable. The newspaper said this indicates \"he does not believe he can sweep to power alone\" - and illustrates the challenge of turning political momentum into high office. However, Mr Tice told Sky News' Politics Hub with Ali Fortescue that this was \"fake news\". Asked if he would be open to a pact, he said: \"No. The only thing that the Tories need to do is to recognise that they've had their time after a couple of hundred years - they've blown it, and they should step aside and let Reform take on and defeat the hard socialists and the communists that seem to be on the left side of politics now.\"  Some Reform supporters have expressed concern that both parties could end up fighting over the same seats, splitting the right-wing vote and benefitting Labour. Others are worried about the first past the post system, which means candidates with the most votes win a constituency - even if they fail to secure a majority. Reform UK received 4.1 million votes in 2024, making it the third-most popular party, but won just five seats out of 650. Mr Tice insisted that his party are now leading the polls by enough of a margin to secure a majority in the Commons. It was put to him that he should level with supporters that talks are happening at some level, but he said: \"We are [being honest], and they're not happening at any level, and they won't happen at any level.\" However, he refused to say if Reform would enter into a pact with the Tories if not doing so would leave Sir Keir Starmer as prime minister. Despite Reform welcoming some former Tory MPs into its fold, Mr Tice also insisted that \"most of the parliamentary Conservative Party are really sort of, they're more towards the Lib Dems - they don't agree with our policies\". He added that the story last night in the Financial Times was \"either made up in the imagination of the journalist or in the imagination of maybe a couple of donors who wanted to hear something different from what they actually heard\", branding it \"fake news\".  Farage: A deal would cost us votes The FT report suggested Mr Farage would only agree to a deal on his terms because he felt betrayed after a pact made with the Tories in 2019, when his Brexit Party helped hand Boris Johnson victory. But the Reform leader denied these rumours - and declared \"the Conservatives will no longer be a national party\" after the local elections in May 2026 anyway. He said: \"I would never do a deal with a party I don't trust. No deals, just a reverse takeover. \"A deal with them as they are would cost us votes.\" Deputy political editor One of the striking things that we've seen through the autumn, when you look at the polling - and I'm sure this most starkly in the YouGov MRP that we did just before the conference season - is that Reform doesn't get an overall majority broadly on the current numbers. The September poll had Reform winning 271 seats. Now, you need 324-plus to get an overall majority in the Commons. In order to have the certainty that Nigel Farage would go into Number 10 you would need backing at that moment, or before that moment probably, from Tory MPs. One of the conclusions of the FT piece, that they make very explicitly, is this is a reflection that at the moment, in private, Nigel Farage isn't quite sure he can do it on his own.  But then you have this question: just how receptive are Tories? You've got the Kemi Badenoch position, but I only have to point to a couple of things from earlier this year, and you can see just how possible this suddenly all looks. \n\n In April this year, I got hold of a recording of shadow justice secretary, one time Tory leadership contender Robert Jenrick. He was vowing to quote \"bring this coalition together\" to assure that Conservatives and Reform UK aren't fighting each other in the next election.  He was saying one way or another he was going to make sure that Reform and the Tories don't cost each other the votes and allow Labour to come up through the middle.  Fast-forward to Tory Conference and I got hold of Robert Jenrick. And again, his answer on pacts and mergers and all the rest of it was quite teasing. Asked if he would \"never\" support a pact, Jenrick said it was \"not our priority\". Jenrick would deny there was any difference between him and Badenoch. I think Jenrick reflects the wider Tory party. How do I know that? Well, let's look at the polling again. The YouGov Tory members poll found 64% supporting an electoral pact with Reform UK and 31% not, but 46% supporting a full-blown merger.\n\n The appetite's there. Farage may not want to admit to us in public that he isn't quite there, getting an overall majority. But if you pushed at the door, I think there are a lot in the Tory party who don't disagree with what the Reform UK leader is saying. A Tory spokesman also warned that no deals or pacts will be considered under Kemi Badenoch's leadership. He added: \"Reform want higher welfare spending and to cosy up to Putin. Only the Conservatives have the team, the plan, and the backbone to deliver.\" The latest YouGov opinion poll suggests support for Reform UK is at 26% - with Labour and the Tories deadlocked on 19% each. Reform's momentum has led about 20 former Tory MPs to defect, including Boris Johnson ally Nadine Dorries. However, figures suggest the Conservatives have the upper hand when it comes to donations - receiving three times more cash than Reform in the first half of 2025. Read more politics news:Reeves facing Labour rebellionPolling makes grim reading for PM  One Reform donor told the FT: \"They will have to come together. The Conservatives have been a successful political party forever because the left was always divided … If the right is divided, it can't win.\" A Labour Party spokesperson was equally scathing of both parties - claiming the Conservatives broke public services, and Reform would make \"savage\" spending cuts. \"This shady backroom plot will send a shiver down the spine of people up and down the country, and shows you simply can't trust Nigel Farage,\" they added."
    },
    {
        "title": "Scientist hails 'incredible find' as mysterious tentacles wash up on Scottish beach",
        "description": "Mysterious tentacles washed up on a beach in Scotland belong to a rare deep-sea creature called the seven-arm octopus, a scientist has told Sky News.",
        "url": "https://news.sky.com/story/scientist-hails-incredible-find-as-mysterious-tentacles-wash-up-on-scottish-beach-13478918",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-dr-lauren-smith-octopus_7099787.jpg?20251203204830",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-03 17:52:00",
        "Headline": "A couple of local residents spotted the remains at Forvie National Nature Reserve in Aberdeenshire and contacted reserve staff. ",
        "Content": " Mysterious tentacles washed up on a beach in Scotland belong to a rare deep-sea creature called the seven-arm octopus, a scientist has told Sky News. The remains were found by a couple of local residents who spotted the arms at Forvie National Nature Reserve in Collieston, Aberdeenshire, and contacted reserve staff. Marine biologist Dr Lauren Smith, who rushed over the following day to investigate, told Sky News it was \"an incredible find\". The octopuses, which have the scientific name Haliphron atlanticus, usually glide through waters at a depth of 500m plus and can reach up to four metres in size - making them a highly unusual find in the shallow areas of the Scottish coast. The species actually have eight arms, despite the name, but males have one modified arm, a reproductive organ, that curls under itself. Dr Smith said when she saw the photographs \"of these arms with the suckers on like that\" it was the \"sheer size of them that I realised it was something pretty special\". Scientists have been scratching their heads over how the rare octopus species washed up in the shallow coastal waters. Read more from Sky News:Water restored to thousands of Kent homesKing Charles welcomes German president to Windsor Castle Dr Smith posed the theory that the octopus could have become \"disorientated\" before being partially consumed, noting that there are large whales in the area, with the remains then washing up onto the beach. The arms are now in her freezer, she added. \"I had to get them frozen down as soon as possible because they're obviously quite important finds.\" Dr Smith, of East Grampian Coastal Partnership, said they will now be taken to various laboratories, research areas, research groups, and potentially some museums, for analysis."
    },
    {
        "title": "DNA identifies suspected killer 20 years after Jennifer Kiely found dead on Eastbourne seafront",
        "description": "A suspected murderer has been named 20 years after a woman was stabbed multiple times and her body set on fire.",
        "url": "https://news.sky.com/story/dna-identifies-suspected-killer-20-years-after-jennifer-kiely-found-dead-on-eastbourne-seafront-13478867",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jennifer-kiely-eastbourne_7099766.jpg?20251203163317",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-03 16:30:00",
        "Headline": "DNA obtained last year was the \"final piece of the puzzle\" and led to Keith Dowbekin officially being made a suspect. Police now say they're confident he was the killer.",
        "Content": "A suspected murderer has been named 20 years after a woman was stabbed multiple times and her body set on fire. Jennifer Kiely, 35, was found with a pushchair on top of her in a seafront shelter in Eastbourne, East Sussex, on 22 January 2005. The attack was thought to be sexually motivated but no one was ever charged with her murder. DNA recovered from a cigarette butt at the scene matched DNA on the victim's body, but at the time, no match was found. However, police now say the forensic evidence is \"overwhelming\" and have named Ms Kiely's killer as Keith Dowbekin. The 60-year-old died in 2014, aged 60, and was also known as Keith Black and Keith Broadbent. Dowbekin had been associated with members of Eastbourne's homeless community like Ms Kiely, said Sussex Police, and had been arrested over separate rape cases in Great Yarmouth in 2003 and 2004, before being released without charge. His DNA was not taken, in line with Norfolk Police's procedures at the time. Detective Chief Inspector Simon Dunn said a breakthrough in DNA technology in 2018 allowed police to trace and identify multiple people who shared similar parts of the DNA found at the crime scene. DNA from a man in the north of England last year was the \"final piece of the puzzle\" and led to Dowbekin officially being made a suspect. It was only then that police learned of his prior arrests for rape. DNA obtained from Norfolk Police in relation to those cases matched the Eastbourne murder scene. Police also said the suspected killer had given DNA as a witness to a separate murder in 2003 - but crucially, it wasn't added to the database as he wasn't a suspect. \"In 2003 and 2004, there was no provision to take DNA from people who were arrested, DNA was only taken from those who were charged with an offence - that is different now,\" said DCI Dunn. Read more from Sky News:Nursery worker pleads guilty to sexual offences against childrenChildren hurt after roof ripped off bus Jennifer's family said they were \"grateful for the resolution of her case and for the hard work of those who never gave up\". They described her as \"more than her struggles\" - a \"gentle, funny and creative soul who loved music and cared deeply for others\". \"While this brings a sense of closure, it does not erase the loss of a kind, loving and vibrant woman who meant so much to those who knew her, especially her children,\" they added. \"I hope her story encourages compassion for those experiencing homelessness and the stigma surrounding mental health.\""
    },
    {
        "title": "'No one helped us': The Sri Lanka community left in a mass of mud and loss after cyclone",
        "description": "This community in Sri Lanka's Kandy District is a mass of mud and loss.",
        "url": "https://news.sky.com/story/no-one-helped-us-the-sri-lankan-community-left-in-a-mass-of-mud-and-loss-after-cyclone-ditwah-13478889",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-katapita-watha-cordelia-lynch_7099910.jpg?20251203183021",
        "type": "World",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-12-03 16:59:00",
        "Headline": "The narrow, filthy streets in Gampola are filled with broken furniture, sodden toys and soiled mattresses. A torrent of floodwater ripped through this neighbourhood and many people had no time to escape.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  This community in Sri Lanka's Kandy District is a mass of mud and loss. The narrow, filthy streets in Gampola are filled with broken furniture, sodden toys and soiled mattresses. A torrent of floodwater ripped through this neighbourhood and many people had no time to escape. Trying to reach their now destroyed homes is like wading through treacle - the mud knee-deep. Many locals say they were not warned about the threat Cyclone Ditwah posed here before it struck last Friday, and weren't told to evacuate. They say they've received very little help since. Resourceful neighbours were left to try to help rescue survivors. But some had to carry the bodies of the dead, too. Mohamed Fairoos was one of them.  \"We took five bodies from here,\" he says, gesturing to a house full of debris, where mattresses hang drying over the balcony. \"We took nine bodies in total and handed them over to the hospital.\" He appears both shocked and exasperated at the lack of support this community received. \"When I took the bodies, the police, the navy, no one sent for us.\" He tells me he even posted a video online appealing for boats, hoping it might help. I ask him if he thinks the government has done enough. \"No,\" he says forcefully. \"No one called for us. No one helped us. No one gave us any boats.\" Read more: Families count the cost of devastating floods 'Five people were killed here' Just a few doors down, a group of volunteers have come to clear another home filled with floodwater. \"Five people were killed here,\" one of them tells me. Five of them came from one family: a mother, father, their two daughters and son. Kumudu Wijekon tells me she was friends with them and they'd fled here to a friend's house, hoping to escape the threat. \"There was heavy rain, but they didn't think there would be flooding. They left their own home to save themselves from landslides. If they had stayed, they would have survived.\" 'We don't have a single rupee' A short drive away, Chamilaka Dilrukshi is sobbing inside the photography studio she shares with her husband Ananda. They have two children aged four and 11. Chamilaka is clutching a bag of rice - she says it's been donated by a friend and it's all they have to eat. Everything in the shop is wrecked - expensive cameras and lighting equipment covered in thick layers of mud, and outside, rows of broken frames and ripped pictures. They think they've lost nearly £2,500 and their home is severely damaged. She weeps as she tells us: \"We don't have a single rupee to start our business again. We spent all of our savings on trying to build our house.\" Like Mohamed, she believed they should have been warned. \"We didn't know anything. If we did, we would have taken our cameras and our computers out. We just didn't know it was coming.\" Anger at government's perceived failings Sri Lankan president Anura Kumara Dissanayake has declared a state of emergency to deal with the aftermath of the cyclone, and international aid has arrived. But many people are angry at the government's perceived failings. It's been criticised for not taking the warnings from meteorologists seriously two weeks before the cyclone made landfall, as well as for not communicating enough messages in the Tamil language. It is going to take places like Gampola a long time to rebuild, repair and restore trust. And in a country still recovering from an economic collapse, nothing is guaranteed."
    },
    {
        "title": "Trump 'never rules anything out' to ensure World Cup's safety, key aide tells Sky News",
        "description": "Donald Trump's World Cup supremo has told Sky News the US president \"never rules anything out\" to ensure next year's tournament is staged safely.",
        "url": "https://news.sky.com/story/trump-never-rules-anything-out-to-ensure-world-cups-safety-key-aide-tells-sky-news-13479013",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-world-cup_7100443.jpg?20251203235244",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-12-03 21:11:00",
        "Headline": "There are concerns about ICE agents targeting those at World Cup matches who are violating immigration laws, while Human Rights Watch suggests human and civil rights of fans are under threat at the tournament.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Donald Trump's World Cup supremo has told Sky News the US president \"never rules anything out\" to ensure next year's tournament is staged safely. But in an exclusive interview, Andrew Giuliani, who heads the White House World Cup task force, said it was \"absurd\" for the activists to complain about human rights being under threat at the tournament. Mr Giuliani was speaking as the football world starts to arrive in Washington DC for Friday's tournament draw, when fans can start planning their trips next summer to the US, Canada and Mexico. But Mr Trump has threatened to take matches away from places run by Democrats where he believes fans could be in danger. \"Safety is key and the president is focused not just on our World Cup, but the safety and security of Americans and those international visitors that are travelling here,\" Mr Giuliani said. \"He wants specifically the World Cup to be a welcoming event, but he also wants to make sure that it is safe and secure. He wants to make sure that each of these cities are doing everything they can to make sure it is a safe experience.\" The Boston, Seattle and San Francisco areas have been highlighted by Mr Trump as locations that could be stripped of hosting. \n                  FIFA backs away from dynamic pricing for all World Cup 2026 tickets\n                 \n                  Trump unveils FIFA PASS scheme to give priority visa appointment access to World Cup fans\n                 \n                  UEFA should decide if Israeli teams should be banned, FIFA VP tells Sky News\n                 \"The president urges every single governor and every single mayor to do the best they can, whatever their politics are,\" Mr Giuliani said. Mr Trump has made protecting the United States a key tenet of his agenda, with the prospect raised of Immigration and Customs Enforcement (ICE) agents targeting those at World Cup matches who are violating immigration laws. Mr Giuliani said: \"There were no raids at Club World Cup games. That was a big narrative going into that. \"But what I can also tell you is that the president never rules anything out when it comes to safely and securely protecting, whether it's stadiums, fan festivals, American citizens and those international visitors that are coming here for an event like the World Cup. \"So I know he's not going to rule anything [out] that can actually help make a stadium make an area safer.\"  Human Rights Watch staged a news conference in Washington earlier, where they suggested the tournament was being weaponised by Mr Trump and the human and civil rights of fans were in jeopardy. \"That sounds like an absurd allegation,\" Mr Giuliani responded, referencing the president's work ending wars. \"What he was able to achieve in the Middle East. Other presidents had tried and could not get over the finish line. He was able to do it. \"What he's trying to work on right now between Russia and Ukraine, no other president would be able to approach it the way that he's able to do it. So look, erroneous allegations like that, I don't think are worth a real response.\" It is inevitable the interview focuses so much on security when it is the first World Cup being staged across three countries and expansion to 48 teams, adding 16 more finalists. \"I don't want to talk about intelligence and what has or what will be done,\" Mr Giuliani said. \"But look, America and a World Cup, they're always a target. We know that. \"And we're very well aware of the potential vulnerabilities that could exist.\" Read more from Sky News:World Cup: All you need to knowFIFA backs off from dynamic pricingHow to get World Cup tickets There is $500m (£374.5m) being spent on countering unauthorised drones at major events, including the World Cup. \"We can look at vehicle ramming - that's something that's been a copycat,\" Mr Giuliani said, discussing World Cup risks. \"What I can tell you,\" he added, \"is that the overwhelming majority of my job and our work, from a federal perspective, is committing to making this a safe World Cup and eliminating those threats.\" But how will it work staging the tournament alongside Canada and Mexico when Mr Trump has talked tough against the countries, whether on trade or combating drugs? Mr Giuliani said: \"Even though we may have different political backgrounds, different beliefs still, our three countries are working together to make this World Cup a great success and something that hopefully will be a benchmark moving forward, not just for World Cups around the world, but also hopefully to get another World Cup in my lifetime back in the United States, in North America.\" There will be a fast-track visa process for fans to ensure they can fly into the United States. But there is a travel ban on anyone from Haiti and Iran, although exceptions have been granted for team delegations for the draw. \"Every single visa decision is a national security decision,\" Mr Giuliani said. And for a White House used to dominating the global agenda, there is a realisation that a World Cup puts the United States in the global spotlight like nothing else in sport for so long. \"It's a great opportunity over America's 250th birthday to really show off American exceptionalism,\" he said, adding: \"This is going to be the largest sporting event in American history and we're very excited to host.\""
    },
    {
        "title": "Rafah crossing to open 'in coming days' to let Gazans cross into Egypt, Israel says",
        "description": "Israel is preparing to open the Rafah crossing \"in the coming days\" to let Gaza residents cross into Egypt &#8211; as it claimed that partial remains handed over this week do not match the hostages taken in 2023.",
        "url": "https://news.sky.com/story/rafah-crossing-to-open-in-coming-days-to-let-gazans-cross-into-egypt-israel-says-13478611",
        "image_url": "https://e3.365dm.com/23/10/1920x1080/skynews-palestinians-egypt_6322896.jpg?20231016094008",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-03 08:13:00",
        "Headline": "The missing remains of two hostages threaten to stall the ceasefire between Israel and Hamas, while a specific time for the opening of the Rafah crossing has not yet been made clear.",
        "Content": "Israel is preparing to open the Rafah crossing \"in the coming days\" to let Gaza residents cross into Egypt – as it claimed that partial remains handed over this week do not match the hostages taken in 2023. The missing remains of two hostages threaten to stall a ceasefire between Israel and Hamas as it gets close to the completion of its first phase. Later on Wednesday, Hamas said it had handed over the body of one of the last two deceased hostages in the Gaza Strip. Forensic tests are expected to be carried out on the remains. A specific time for the opening of the Rafah border has not been given, but it is hoped access will allow people to cross for medical and travel purposes - and will show Israel is still moving forward with the ceasefire agreement. The coordination of government activities in the territories (COGAT) said the arrangement, which has Israeli security clearance, will be coordinated with Egypt under the supervision of the European Union mission, similar to the mechanism that operated in January 2025. \"In accordance with the ceasefire agreement and a directive of the political echelon, the Rafah Crossing will open in the coming days exclusively for the exit of residents from the Gaza Strip to Egypt,\" a COGAT statement said. It did not say whether there would be restrictions on who was allowed to leave Gaza, although they would require \"Israeli security approval\". Despite Wednesday's developments, Egyptian state-affiliated al Qahera News said Egypt had denied it was coordinating with Israel to reopen the crossing in the coming days, reported the Reuters news agency. However, Israeli prime minister Benjamin Netanyahu's office said the crossing \"will be opened very, very soon\". The exit of Gazans will be \"facilitated through coordination with Egypt following security approval by Israel,\" a spokesperson said. \"The decision was made in full coordination with the mediators of this plan.\" When asked by Sky News how the crossing could open while Egypt has denied any coordination, the office was unable to give more details. \"The information I shared is what I can provide at this time,\" the spokesperson added.  An Israeli official, who spoke anonymously, said all Palestinians will be able to exit through Rafah as long as Egypt agrees to receive them, reported the Associated Press. The source said the European Union still had to make some adjustments to logistics before the crossing could open. An Israeli official said the Rafah crossing would be open only for Palestinians to exit Gaza, not enter, the Associated Press also reported. Egypt said the crossing would open only if movement goes both ways. The ceasefire deal between Israel and Hamas called for the crossing to be opened for medical evacuations and for travel to and from Gaza. More than 16,500 sick and wounded people need to leave Gaza for medical care, according to the World Health Organisation. Gaza businessman Tamer al Burai, who needs treatment abroad for a respiratory condition, told Reuters: \"We have been waiting for the Rafah opening for months. \"At last, I and thousands of other patients may have a chance to receive proper treatment.\" Middle East correspondent The US-led peace plan for Gaza does not actually mandate that the Rafah crossing is opened in both directions. It’s just that that’s how most people interpreted it. The exact passage says that the crossing \"should be open for the movement of goods and people in accordance with applicable security arrangements\".  In the eyes of the Egyptians, as well as much of the rest of the world, that sounds like it needs to work in both directions.  But Israel is now proposing a sort of one-way valve where people can leave Gaza, but they can't come back.  You might be able to go out to get medical treatment, but it's not clear how you'd ever return to your home. It adds to the idea that what Israel, and perhaps the United States, really want is to depopulate the half of the Strip that is not under Israeli control while building up the half that is.  That, certainly on the face of it, appears to breach international law. Israel's public stance is to claim credit for fulfilling an obligation of the plan before all the hostages have been returned.  But when asked by Sky News today who would actually be able to cross, bearing in mind that Egypt has said it will issue no permits until the crossing works in both directions, Israel's government spokesperson had no answer.\n The crossing was sealed off in May 2024 when Israel's military invaded the area. It was briefly opened in February this year for the evacuation of sick and wounded Palestinians for treatment, as part of the previous ceasefire deal. Israel has kept the Rafah crossing closed in both directions since the ceasefire in October, demanding Hamas must abide by the agreement to return all hostages still in Gaza, living and deceased. Read more:How two years of war have shattered the Gaza Strip Inside Gaza: 'It's impossible to imagine people still living here'   Rafah is Gaza's only gateway to the rest of the world which is not directly controlled by Israel. It is under the control of Egypt as part of an agreement with Israel and the European Union. Over the years, the crossing has been closed for long periods at a time. When people are allowed through, there is the possibility that the crossing will suddenly close without any significant notice. Hopes for the crossing's opening came as Israel said forensic tests showed that partial remains handed over on Tuesday do not match two of the hostages who remain in Gaza. The remains were found in Gaza's northern town of Beit Lahiya, according to Palestinian media. Then on Wednesday, Hamas said newly discovered remains were being returned to Israel. It was not immediately clear to whom they belonged. Read more:Two brothers killed in Israeli drone strikeControversial Gaza aid operation to close down Twenty living hostages and the remains of 26 others have been returned to Israel since the ceasefire began in early October. Israel has been releasing 15 Palestinian bodies for the remains of each hostage as part of the agreement. The health ministry in Gaza said the number of remains received so far is 330."
    },
    {
        "title": "Australia's under 16s social media ban: How will it work and could the UK bring in a similar law?",
        "description": "Australian teenagers under 16 are set to face a world-first social media ban from 10 December. ",
        "url": "https://news.sky.com/story/australias-under-16s-social-media-ban-how-will-it-work-and-could-the-uk-bring-in-a-similar-law-13478719",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-social-apps_7099757.jpg?20251203162209",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-03 11:31:00",
        "Headline": "Australia is leading the way as it prepares to ban children under the age of 16 from using social media. But the move hasn't come without controversy.",
        "Content": "Australian teenagers under 16 are set to face a world-first social media ban from 10 December.  The legislation has left tech platforms such as TikTok and Meta scrambling to figure out how to implement the ban to avoid fines of up to £25 million. The companies need to find ways to close existing accounts belonging to under-16s and stop new ones from being created as the legislation comes into effect. Australia's eSafety Commissioner says the restrictions \"aim to protect young Australians from pressures and risks that users can be exposed to while logged in to social media accounts\". \"These come from design features that encourage them to spend more time on screens, while also serving up content that can harm their health and wellbeing,\" the commissioner adds. The law is designed to protect children from potential mental health risks, cyber-bullying, and inappropriate content. Australia's 2021 census showed there are roughly 2.5 million eight to 15-year-olds in the country, and the government has estimated that 86 per cent of people in the age bracket use social media. Which platforms will be affected? The commissioner has determined that Facebook, Instagram, Snapchat, Threads, TikTok, Twitch, X, YouTube, Kick, and Reddit are age-restricted platforms. But more generally, age restrictions will apply to social media platforms that meet three specific conditions, unless the Australian government determines they should be excluded. The conditions are: Platforms are responsible for determining whether they fit the criteria and doing their own legal assessments. What apps will not be age-restricted? According to the commissioner, Discord, GitHub, Google Classroom, LEGO play, Messenger, Pinterest, Roblox, Steam and Steam Chat, WhatsApp, and YouTube Kids are among those that will not be age-restricted. ESafety determined the list on 21 November, and said \"there are no further assessments planned in the lead up\" to the ban on 10 December. However, the Australian government has indicated that it is a dynamic list and other platforms could be added at a later stage. Read more:New law targets AI-generated child sex abuse imagesWhat you can't say in online postsBacklash against internet safety rules What penalties could social media platforms face if they don't comply? Australia's Online Safety Amendment Act 2024 requires companies to take \"reasonable steps\" to stop underage users from signing up and using their platform; they could face fines of up to $49.5 million (£25 million) for failing to comply. How will age verification work? This is the responsibility of each platform. However, the Australian government has said that requesting ID cannot be the only way to determine someone's age. Meta has said it will comply with the ban; however, in submissions to the Australian government last year, it said the legislation was \"a missed opportunity and overlooks the practical reality of age assurance technology as well as the views of a majority of mental health and youth safety organisations in the country\". Meta has said it expects issues with its technology, which could result in accounts belonging to people who are actually over 16 accidentally being shut down. Meta previously confirmed that its users aged 13 to 15 would receive in-app messages or texts informing them their Facebook, Instagram and Threads accounts would be removed as early as 4 December. It said it would rely on age-estimation systems. TikTok said in a statement that it will have a \"multi-layered approach to age assurance,\" while Snapchat will use behavioural signals to estimate ages.  Is the move controversial?  As Meta did in its submissions to the Australian government, several other platforms have criticised the move. Google and YouTube Australia's public policy senior manager, Rachel Lord, said the site will automatically sign out users who are deemed to be under 16. But, she said, they can still watch some YouTube videos while signed out, and parents will \"lose their ability to supervise their teen or tween's account\" and use controls such as blocking channels. Australia's communications minister Anika Wells responded, saying it was \"outright weird that YouTube is always at pains to remind us all how unsafe their platform is in a logged out state\". There has been criticism of the government for excluding popular apps, particularly Yope and Lemon8, which are currently in the top 30 on the Australian iOS App Store, as kids look for alternatives. Ms Wells told Australian media that \"if we find that because they've been logged out of Snapchat, Instagram, TikTok [or] what have you, they end up on Lemon8, then we will look at whether the harm has transferred there and whether we need to add them to the list\". Opposition leader Sussan Ley said she has \"no confidence\" that the social media ban would work. Could the UK introduce a similar ban? While Australia is leading the way in legislating age-restriction rules on under-16s, the UK is also navigating this type of discussion. The government brought in the Online Safety Act in July, saying \"the way children experience the internet will fundamentally change\". It included age restrictions effectively banning under-18s from seeing \"the most harmful material on social media and other sites\". The law is aimed at stopping children from watching \"harmful content\" including pornography, self-harm, suicide, hate speech and violence."
    },
    {
        "title": "Search for Malaysia Airlines flight MH370 to resume 11 years after it went missing",
        "description": "The deep-sea hunt for missing Malaysia Airlines flight MH370, which vanished more than 11 years ago, will resume this month, Malaysia's transport ministry has said.",
        "url": "https://news.sky.com/story/search-for-malaysia-airlines-flight-mh370-to-resume-11-years-after-it-went-missing-13478684",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-world-malasyia_7099400.jpg?20251203095438",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-03 09:42:00",
        "Headline": "The Malaysian government approved a \"no-find, no-fee\" contract with Ocean Infinity earlier this year. The American company will be paid $70m (£53m) only if wreckage is discovered.",
        "Content": "The deep-sea hunt for missing Malaysia Airlines flight MH370, which vanished more than 11 years ago, will resume this month, Malaysia's transport ministry has said. Bound for Beijing, the Boeing 777 disappeared from radar shortly after departing Kuala Lumpur International Airport on 8 March, 2014. The plane was carrying 227 passengers and 12 crew when it vanished. Satellite data showed the aircraft deviated from its flight path and headed south into the far-southern Indian Ocean, where it is understood to have crashed. Malaysia's transport ministry said in a statement on Wednesday that American marine robotics firm Ocean Infinity will embark on an intermittent 55-day search from 30 December. It will target areas that are believed to have the highest likelihood of locating the missing plane. \"The latest development underscores the government of Malaysia's commitment in providing closure to the families affected by this tragedy,\" the ministry said.  Lin Jian, a spokesperson for the Chinese foreign ministry, said: \"We... appreciate the efforts made by the Malaysian side.\" The Malaysian government approved a \"no-find, no-fee\" contract with Ocean Infinity earlier this year. The company will be paid $70m (£53m) only if wreckage is discovered. Read more: Rafah crossing to open to let Gazans cross into EgyptTwo reasons why Putin won't agree to latest Ukraine peace planFIFA backs away from criticised World Cup ticket pricing The US-based company will resume the seabed search in a new 15,000 sq km (5,800 sq mile) area in the Indian Ocean after bad weather stopped it in April. A multinational search, spearheaded by Australia, failed to locate the wreckage. However, possible debris was found along the coastlines of East African and Indian Ocean countries, including Mozambique, Madagascar, and Reunion Island. Ocean Infinity conducted an unsuccessful private search in 2018."
    },
    {
        "title": "Dozens more images of Epstein's island released - showing 'disturbing look into his world'",
        "description": "Images and video of Jeffrey Epstein's private Caribbean island have been released by politicians in the US.",
        "url": "https://news.sky.com/story/never-before-seen-images-of-jeffrey-epsteins-island-released-showing-disturbing-look-into-his-world-13478795",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-oversight-democrats_7099839.jpg?20251203173907",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-03 14:22:00",
        "Headline": "The images of the island come ahead of the much-anticipated release of thousands of Department of Justice files on Epstein.",
        "Content": " Images and video of Jeffrey Epstein's private Caribbean island have been released by politicians in the US. Democrats on the House Oversight Committee said they were \"a harrowing look behind Epstein's closed doors\". \"We are releasing these photos and videos to ensure public transparency in our investigation and to help piece together the full picture of Epstein's horrific crimes,\" Representative Robert Garcia said.  The images are from Little Saint James, part of the US Virgin Islands, where Epstein is believed to have abused underage girls. Faces of men hang on the wall in one room - which also appears to be equipped with a dentist's chair, while the words \"deception\", \"power\" and \"truth\" are written in chalk in the study. Other images show a large shower room, a phone with some of the speed dial numbers redacted, and a photo of Epstein and Ghislaine Maxwell meeting Pope John Paul II. The US Department of Justice currently has until mid-December to release thousands of documents linked to civil and criminal cases involving Epstein. \n                  Epstein latest: Dozens more images released of Epstein island - including masks on wall\n                 \n                  Releasing the Epstein files: How we got here\n                 \n                  Prince Andrew Way to be renamed - but council warns it won't be straightforward\n                 Donald Trump previously opposed the move, but changed his mind last month after US Congress overwhelmingly voted in favour. It could shed more light on the paedophile financier, who at one point socialised with the US president, as well as Andrew Mountbatten-Windsor and Peter Mandelson. All three men have denied wrongdoing. Some details have already been revealed after more than 20,000 other files were disclosed last month - but much more seems set to follow. The Epstein Files Transparency Act demands the release of all files relating to Epstein, including investigations, prosecutions, immunity and plea deals. It also orders the publication of records connected to Ghislaine Maxwell, who is currently serving a 20-year prison sentence. Any flight logs and travel records for Epstein's vehicles must be disclosed, along with individuals named in relation to his criminal activities. Read more:Explainer - What will Epstein files show?What do documents say about Trump, Andrew and Mandelson? Politicians have said the release of the files is critical to uncovering whether powerful figures received special treatment or protection. It is also a response to criticism of a controversial 2008 plea deal in Florida, which allowed Epstein to avoid federal sex trafficking charges and plead guilty to lesser state charges. Epstein killed himself in a prison cell in New York in 2019 but conspiracy theories, once peddled by Mr Trump, remain. Documents related to his death, such as witness interviews and post-mortem reports, must also be released under the law passed last month."
    },
    {
        "title": "Doctor who supplied ketamine to late Friends star Matthew Perry jailed",
        "description": "A doctor who pleaded guilty to illegally supplying ketamine to Matthew Perry in the weeks before the star's death has been jailed for two-and-a-half years.",
        "url": "https://news.sky.com/story/doctor-who-supplied-ketamine-to-late-friends-star-matthew-perry-jailed-13478863",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-salvador-plasencia_7099906.jpg?20251203182924",
        "type": "US",
        "Author": "Gemma Peplow",
        "Date Published": "2025-12-03 16:10:00",
        "Headline": "Salvador Plasencia is the first of five people to be sentenced in connection with the death of the Friends star, who was found drowned in the hot tub at his home in Los Angeles after taking ketamine in October 2023.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n A doctor who pleaded guilty to illegally supplying ketamine to Matthew Perry in the weeks before the star's death has been jailed for two-and-a-half years. Salvador Plasencia, who operated an urgent-care clinic outside Los Angeles, is the first of five people to be sentenced in connection with the death of the Friends actor. Perry was found drowned in the hot tub at his home after taking ketamine in October 2023. \"You and others helped Mr Perry on the road to such an ending by continuing to feed his ketamine addiction,\" Judge Sherilyn Peace Garnett told Plasencia as she handed down the sentence. \"You exploited Mr Perry's addiction for your own profit.\" During the hearing, Plasencia broke into tears as he spoke about the day he would have to tell his now two-year-old son \"about the time I didn't protect another mother's son\". Apologising directly to Perry's family, he said: \"I should have protected him.\" The doctor's mother cried loudly in the courtroom as he was led out in handcuffs. Ahead of the sentencing, Perry's mother Suzanne Perry and stepfather Keith Morrison described those involved in supplying ketamine to the star illegally as \"jackals\", and said they believed Plasencia to be \"among the most culpable of all\". The actor had been taking ketamine legally as a treatment for depression, but started seeking more of the drug and taking it unsupervised in the weeks before his death, acquiring it illegally from different sources. Plasencia, 44, did not supply the dose that killed the actor, but had been distributing the surgical anesthetic to him in the weeks beforehand. He initially denied the charges against him but changed his plea earlier this year, admitting four counts of distribution. He could have faced up to 40 years in prison had he been convicted at trial. Doctor 'fed on vulnerability' Court documents showed details of a text message Plasencia sent to another doctor, who is also due to be sentenced, saying: \"I wonder how much this moron will pay.\" \"Rather than do what was best for Mr Perry - someone who had struggled with addiction for most of his life - [Plasencia] sought to exploit Perry's medical vulnerability for profit,\" the prosecution said in its sentencing memo. Known as \"Dr P\", Plasencia was introduced to Perry by one of his own patients on 30 September 2023, prosecutors said. This patient said the actor was a \"high profile person\" who was willing to pay \"cash and lots of thousands\" for ketamine treatment, and the doctor was \"motivated by the promise of a payday\". Plasencia's lawyers admitted his behaviour was \"reckless\" and said it was \"the biggest mistake\" of his life. \"Remorse cannot begin to capture the pain, regret and shame that Mr Plasencia feels for the tragedy that unfolded and that he failed to prevent,\" they said. Star's family share emotional statements During the hearing, Perry's mother Suzanne addressed the court to talk about everything he had overcome in his life. \"I used to think he couldn't die,\" she said, supported by her husband. \"You called him a 'moron',\" she said to Plasencia. \"There is nothing moronic about that man.\" In victim impact statements submitted to court, she and her husband said Plasencia's actions were not the result of \"one very bad decision\" or done \"in the heat of passion\", and nor was he a \"bad to the bone\" drug dealer. They added: \"No one alive and in touch with the world at all could have been unaware of Matthew's struggles. But this doctor conspired to break his most important vows, repeatedly, sneaked through the night to meet his victim in secret. For what, a few thousand dollars? So he could feed on the vulnerability of our son.\" \"The world mourns my brother,\" Perry's half-sister Madeleine Morrison said. \"He was everyone's favourite friend.\" Perry's father John and stepmother Debbie had called for a lengthy sentence, and said Plasencia's actions had \"devastated\" their family. \"How long did you possibly see supplying Matthew countless doses without his death to eventually follow?\" they asked. \"Did you care? Did you think?\" Read more:The drug network exposed by Perry's deathObituary: The one who made everyone laughMatthew Perry: A life in pictures As well as the prison sentence, Judge Sherilyn Peace Garnett handed down two years of probation to Plasencia. The other four people charged in connection with Perry's death have also accepted plea deals and are due to be sentenced over the next few months. They are: dealer Jasveen Sangha, also known as \"the Ketamine Queen\", Perry's assistant Kenneth Iwamasa, another doctor, Mark Chavez, and Erik Fleming, an associate of the actor. Perry had struggled with addiction for years, dating back to his time on Friends, when he became one of the biggest stars of his generation playing Chandler Bing. He starred alongside Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc and David Schwimmer for 10 seasons, from 1994 to 2004, and appeared in the reunion show in 2021."
    },
    {
        "title": "Trump 'never rules anything out' to ensure World Cup's safety, key aide tells Sky News",
        "description": "Donald Trump's World Cup supremo has told Sky News the US president \"never rules anything out\" to ensure next year's tournament is staged safely.",
        "url": "https://news.sky.com/story/trump-never-rules-anything-out-to-ensure-world-cups-safety-key-aide-tells-sky-news-13479013",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-world-cup_7100443.jpg?20251203235244",
        "type": "US",
        "Author": "Rob Harris",
        "Date Published": "2025-12-03 21:11:00",
        "Headline": "There are concerns about ICE agents targeting those at World Cup matches who are violating immigration laws, while Human Rights Watch suggests human and civil rights of fans are under threat at the tournament.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Donald Trump's World Cup supremo has told Sky News the US president \"never rules anything out\" to ensure next year's tournament is staged safely. But in an exclusive interview, Andrew Giuliani, who heads the White House World Cup task force, said it was \"absurd\" for the activists to complain about human rights being under threat at the tournament. Mr Giuliani was speaking as the football world starts to arrive in Washington DC for Friday's tournament draw, when fans can start planning their trips next summer to the US, Canada and Mexico. But Mr Trump has threatened to take matches away from places run by Democrats where he believes fans could be in danger. \"Safety is key and the president is focused not just on our World Cup, but the safety and security of Americans and those international visitors that are travelling here,\" Mr Giuliani said. \"He wants specifically the World Cup to be a welcoming event, but he also wants to make sure that it is safe and secure. He wants to make sure that each of these cities are doing everything they can to make sure it is a safe experience.\" The Boston, Seattle and San Francisco areas have been highlighted by Mr Trump as locations that could be stripped of hosting. \n                  FIFA backs away from dynamic pricing for all World Cup 2026 tickets\n                 \n                  Trump unveils FIFA PASS scheme to give priority visa appointment access to World Cup fans\n                 \n                  UEFA should decide if Israeli teams should be banned, FIFA VP tells Sky News\n                 \"The president urges every single governor and every single mayor to do the best they can, whatever their politics are,\" Mr Giuliani said. Mr Trump has made protecting the United States a key tenet of his agenda, with the prospect raised of Immigration and Customs Enforcement (ICE) agents targeting those at World Cup matches who are violating immigration laws. Mr Giuliani said: \"There were no raids at Club World Cup games. That was a big narrative going into that. \"But what I can also tell you is that the president never rules anything out when it comes to safely and securely protecting, whether it's stadiums, fan festivals, American citizens and those international visitors that are coming here for an event like the World Cup. \"So I know he's not going to rule anything [out] that can actually help make a stadium make an area safer.\"  Human Rights Watch staged a news conference in Washington earlier, where they suggested the tournament was being weaponised by Mr Trump and the human and civil rights of fans were in jeopardy. \"That sounds like an absurd allegation,\" Mr Giuliani responded, referencing the president's work ending wars. \"What he was able to achieve in the Middle East. Other presidents had tried and could not get over the finish line. He was able to do it. \"What he's trying to work on right now between Russia and Ukraine, no other president would be able to approach it the way that he's able to do it. So look, erroneous allegations like that, I don't think are worth a real response.\" It is inevitable the interview focuses so much on security when it is the first World Cup being staged across three countries and expansion to 48 teams, adding 16 more finalists. \"I don't want to talk about intelligence and what has or what will be done,\" Mr Giuliani said. \"But look, America and a World Cup, they're always a target. We know that. \"And we're very well aware of the potential vulnerabilities that could exist.\" Read more from Sky News:World Cup: All you need to knowFIFA backs off from dynamic pricingHow to get World Cup tickets There is $500m (£374.5m) being spent on countering unauthorised drones at major events, including the World Cup. \"We can look at vehicle ramming - that's something that's been a copycat,\" Mr Giuliani said, discussing World Cup risks. \"What I can tell you,\" he added, \"is that the overwhelming majority of my job and our work, from a federal perspective, is committing to making this a safe World Cup and eliminating those threats.\" But how will it work staging the tournament alongside Canada and Mexico when Mr Trump has talked tough against the countries, whether on trade or combating drugs? Mr Giuliani said: \"Even though we may have different political backgrounds, different beliefs still, our three countries are working together to make this World Cup a great success and something that hopefully will be a benchmark moving forward, not just for World Cups around the world, but also hopefully to get another World Cup in my lifetime back in the United States, in North America.\" There will be a fast-track visa process for fans to ensure they can fly into the United States. But there is a travel ban on anyone from Haiti and Iran, although exceptions have been granted for team delegations for the draw. \"Every single visa decision is a national security decision,\" Mr Giuliani said. And for a White House used to dominating the global agenda, there is a realisation that a World Cup puts the United States in the global spotlight like nothing else in sport for so long. \"It's a great opportunity over America's 250th birthday to really show off American exceptionalism,\" he said, adding: \"This is going to be the largest sporting event in American history and we're very excited to host.\""
    },
    {
        "title": "Donald Trump pardons Democrat congressman and his wife charged in bribery case ",
        "description": "US President Donald Trump has pardoned a moderate Democrat and his \"wonderful\" wife after they were charged with bribery.",
        "url": "https://news.sky.com/story/donald-trump-pardons-democrat-congressman-and-his-wife-charged-in-bribery-case-13478882",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-trump-donald_7099915.jpg?20251203183645",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-03 16:53:00",
        "Headline": "Henry Cuellar has served in Congress for more than two decades and has a history of breaking with the Democrats on issues including immigration and firearms.",
        "Content": "US President Donald Trump has pardoned a moderate Democrat and his \"wonderful\" wife after they were charged with bribery. Mr Trump said he was granting a \"full and unconditional pardon\" to the \"beloved\" 70-year-old Democratic House Representative Henry Cuellar of Texas, who has served in Congress for more than two decades, and his wife Imelda. Mr Cuellar, who represents an area on the Texas-Mexico border, has a history of breaking with his party on issues including immigration and firearms. The couple were last year indicted for allegedly accepting close to $600,000 (£449,600) in bribes in two schemes meant to benefit an Azerbaijani state-owned energy company and an unnamed bank based in Mexico. Posting on his social media platform Truth Social on Wednesday, Mr Trump said, without providing evidence, that Mr Cuellar and his wife had been prosecuted because the congressman had been critical of former US president Joe Biden's immigration policies. \"For years, the Biden Administration weaponized the Justice System against their Political Opponents, and anyone who disagreed with them,\" Mr Trump said. \"One of the clearest examples of this was when Crooked Joe used the FBI and DOJ to 'take out' a member of his own Party after Highly Respected Congressman Henry Cuellar bravely spoke out against Open Borders, and the Biden Border 'Catastrophe.' \n                  US defence secretary Pete Hegseth faces escalating scrutiny as report finds he put troops at risk\n                 \n                  Melania Trump unveils White House Christmas decorations\n                 \n                  Trump administration halts immigration applications from 19 'high-risk' countries after National Guard shooting\n                 \"Sleepy Joe went after the Congressman, and even the Congressman's wonderful wife, Imelda, simply for speaking the TRUTH,\" the US president wrote, adding: \"Henry, I don't know you, but you can sleep well tonight. \"Your nightmare is finally over!\" Mr Cuellar has said he and his wife are innocent. The couple's trial had been set to begin next April. Read more from Sky News: Reeves hit by Labour rebellionKing Charles welcomes German president to Windsor Castle Mr Cuellar reacted on X, saying: \"I want to thank President Trump for his tremendous leadership and for taking the time to look at the facts.\" He went on: \"This decision clears the air and lets us move forward for South Texas. \"This pardon gives us a clean slate. The noise is gone. The work remains. And I intend to meet it head on. \"Thank you Mr. President, God bless you, and God bless the United States of America.\""
    },
    {
        "title": "US defence secretary Pete Hegseth faces escalating scrutiny as report finds he put troops at risk",
        "description": "US defence secretary Pete Hegseth risked imperilling American troops by sharing information that could have been intercepted by a foreign adversary, according to a Pentagon watchdog.",
        "url": "https://news.sky.com/story/us-defence-secretary-pete-hegseth-faces-escalating-scrutiny-as-report-finds-he-put-troops-at-risk-13478994",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-hegseth-pete_7100264.jpg?20251203220733",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-12-03 20:52:00",
        "Headline": "Sky's US partner NBC is reporting that the Inspector General also found that Mr Hegseth violated military regulations by using his personal phone for official business.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  US defence secretary Pete Hegseth risked imperilling American troops by sharing information that could have been intercepted by a foreign adversary, according to a Pentagon watchdog. Sky's US partner NBC News is reporting that the Inspector General also found that Mr Hegseth violated military regulations by using his personal phone for official business. The detail circulated in a group chat on the Signal app in March this year related to an imminent strike on Houthi rebels in Yemen. Messages reportedly posted by Mr Hegseth included: \"1415: Strike drones on target (THIS IS WHEN THE FIRST BOMBS WILL DEFINITELY DROP).\" Another read: \"We are currently clean on OPSEC\" - that's operational security, suggesting the sender recognised the sensitivity of the information. Read more:Hegseth cites 'fog of war' in defence of second 'drug boat' strikeWhy Putin won't agree to latest Ukraine peace plan A journalist from The Atlantic had been inadvertently added to the group chat and reported how the top-secret military operation had been shared both in advance and in real time. The Pentagon has weathered many scandals but rarely has it faced a convergence of crises that point so clearly to the man at the top. Donald Trump’s pick for defence secretary – the former Fox News anchor Pete Hegseth – only got the job on the casting vote of Vice President JD Vance. Signal-gate was the first in a series of scandals that have blighted his first year in office. The Pentagon press corps walked out over draconian restrictions imposed by the Secretary of War. This week, he has been defending a second strike on a boat in the Caribbean, the vessel having already been incapacitated. Critics call his actions a \"war crime\".  It has been crisis after crisis and the Signal-gate report will bring more questions about his ability to not just lead the world’s most powerful army but also protect US troops. The 'Signal-gate' scandal led to bipartisan calls for Mr Hegseth's resignation, but it was Donald Trump's national security advisor Mike Waltz, who was also in the group, who lost his job. It later emerged that Mr Hegseth had created a second Signal group, including his wife, brother and personal lawyer, and shared much of the same detail there. The information came from an email labelled 'SECRET/NOFORN\", meaning it was classified and not to be shared with foreign nationals. Mr Hegseth, who has renamed his office The Department of War, declined to be interviewed by those investigating what became known as 'Signal-gate'. In a written submission, he said he only shared information that he thought would not risk the mission or troops carrying it out."
    },
    {
        "title": "Melania Trump unveils White House Christmas decorations",
        "description": "Melania Trump has unveiled a White House makeover for Christmas - and the theme is \"Home Is Where The Heart Is\".",
        "url": "https://news.sky.com/story/melania-trump-unveils-white-house-christmas-decorations-13478658",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-christmas-decorations_7097630.jpg?20251201141522",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-03 08:23:00",
        "Headline": "The White House has been decorated with 75 wreaths, 51 Christmas trees, about 200m of garland, over 2,000 strands of lights, more than 7,600m of ribbon, and almost 55kg of gingerbread.",
        "Content": "Melania Trump has unveiled a White House makeover for Christmas - and the theme is \"Home Is Where The Heart Is\". Dozens of volunteer decorators helped make the building festive with 75 wreaths, 51 Christmas trees, about 200m of garland, over 2,000 strands of lights, more than 7,600m of ribbon, and almost 55kg of gingerbread. Mrs Trump said the theme for this year's decorations also nods to next year's 250th anniversary of the founding of the US. In a statement, the first lady said: \"The constant movement has taught me that home is not merely a physical space; rather, it is the warmth and comfort I carry within, regardless of my surroundings. \"This Christmas, let's celebrate the love we hold within ourselves, and share it with the world around us. After all, wherever we are, we can create a home filled with grace, radiance, and endless possibilities.\" Decorations this year include Lego portraits of US President Donald Trump and George Washington, a founding father of the United States, in the Green Room. A painting of Mr Trump after an assassination attempt in Butler, Pennsylvania, is also in the Grand Foyer. In a nod to Mrs Trump's charity work, the Red Room features thousands of blue butterflies in tribute to her Fostering The Future initiative, which supports people who have been in foster care as part of her Be Best child-focused programme.  A gingerbread White House, an annual highlight dating to the Nixon administration, has gone on display in the State Dining Room. It showcases the South Portico and provides a glimpse into the Yellow Oval room as decorated by the Trumps. The Yellow Oval is a sitting room in the president's private living quarters on the second floor of the White House. Alongside the long-standing tradition to deck the White House halls during the festive season, works to tear down the East Wing continue after Mr Trump ordered the construction of a ballroom.   It means a couple of things are different this year. The official White House tree which is always on display in the Blue Room is now also honouring families that lost a relative during active military service, decorated with gold stars. That tree was an East Wing fixture and the first one visitors encountered after they entered through those doors, but the building and a walkway connecting it to the White House were demolished in October as part of Mr Trump's ballroom plans. Read more from Sky News:Sabrina Carpenter calls White House video 'disgusting'Putin rejects peace deal after meeting Trump's teamFIFA backs away from criticised World Cup ticket pricing The 90,000 sq ft ballroom will dwarf the White House itself - and be able to accommodate almost five times more guests than the East Room, the current largest space in the mansion. The East Wing was built at the beginning of the last century and was last modified in 1942."
    },
    {
        "title": "Girl, 8, killed in California shooting was 'the light in everyone's life', devastated family says",
        "description": "An eight-year-old girl described as \"the light in everyone's life\" has been identified as one of four people killed in a mass shooting at a child's party in California, her devastated family said.",
        "url": "https://news.sky.com/story/girl-8-killed-in-california-shooting-was-the-light-in-everyones-life-devastated-family-says-13478664",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-maya-lupian-stockton_7099369.jpg?20251203094110",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-03 10:45:00",
        "Headline": "Maya Lupian was shot dead at a banquet hall in the city of Stockton, about 60 miles east of San Francisco, on Saturday evening. Two children, aged 9 and 14, and a 21-year-old were also killed in the attack.",
        "Content": "An eight-year-old girl described as \"the light in everyone's life\" has been identified as one of four people killed in a mass shooting at a child's party in California, her devastated family said. Maya Lupian was shot dead at a banquet hall in the city of Stockton, about 60 miles east of San Francisco, on Saturday evening. Two children, aged nine and 14, and a 21-year-old were also killed in the attack. Eleven people were wounded, and at least one is in critical condition, according to San Joaquin county sheriff Patrick Withrow. Police asked the public for help tracking down the perpetrators, saying there may have been \"multiple shooters\" who \"targeted\" the party. No arrests have been made.  Maya's older sister, Yesenia Lupian, said in a tribute that the third grader was \"the most outgoing 8-year-old you'd ever meet\". \n                  Police vow to 'hunt down animals' behind mass shooting at children's birthday party in California\n                 \n                  Three children among four killed in mass shooting at kids' birthday party in Stockton, California\n                 \n                  Girl, 13, arrested after teenager shot dead in Los Angeles\n                 \"Maya was the light in everyone's life, the sweetest soul,\" Ms Lupian wrote on a GoFundMe page. \"She deserved a childhood full of laughter, school days, karate, family time and dreams... not this. \"We would have been celebrating her 9th birthday in just 2 weeks on December 13th. We are devastated, heartbroken and trying to navigate the impossible.\" Ms Lupian said Maya, who \"excelled\" at school and her extracurricular activities, loved to dance, sing, and draw. She was a purple belt in karate, and she loved being active, her sister added. The family started the fundraiser as they are \"facing unexpected financial burdens, time away from work and want to secure ongoing support as we process this loss\". More than $60,000 was raised in about 16 hours. Meanwhile, the 14-year-old victim has been named as Amari Peterson by his aunt, Aresha Mosley. She said on a fundraising page that he was \"a bright, loved, and promising young soul whose life was taken far too soon by a senseless act of violence\". \"The only mistake this sweet boy made was being in the wrong place at the wrong time,\" Ms Mosley wrote. \"He was simply being a kid at a kids' party. \"No parent should ever have to bury their child. No family should ever go from planning birthdays to planning funerals.\" Ms Mosley said Amari loved playing football and basketball and was making college plans. Emmanuel Lopez told the Los Angeles Times his brother, 21-year-old Susano Archuleta, died at the party after being shot in the neck. Mr Lopez also said his nine-year-old daughter was shot in the head, but she survived. It comes as Patrice Williams, the mother of the two-year-old birthday girl, said she was \"shocked and lost\" after the shooting, which happened as party attendees were getting ready to cut the cake. \"I actually thought it was my balloons popping. It was gunshots,\" Ms Williams said. Her daughter was uninjured, but Ms Williams said that her sister, a cousin and three of her friends were shot. Read more from Sky News:Is Trump preparing to go to war with Venezuela?Sabrina Carpenter hits out at White House video She said that she did not get a look at the shooter, adding: \"They deserve to be in jail. They deserve to go to hell. I'm sorry, but I just ... it's not respectable. It's a kids' party.\""
    },
    {
        "title": "Thames Water debt pile rises further despite return to profit",
        "description": "Cash-strapped Thames Water has revealed a further rise in its debt pile while recording a return to profit on the back of inflation-busting hikes to bills.",
        "url": "https://news.sky.com/story/thames-water-debt-pile-rises-further-despite-return-to-profit-13478595",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-thames-water-van_6698514.jpg?20240927193829",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-12-03 05:24:00",
        "Headline": "The UK's largest supplier reveals a surge in complaints about rising bills but says its performance, such as in preventing sewage spills, has improved.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Cash-strapped Thames Water has revealed a further rise in its debt pile while recording a return to profit on the back of inflation-busting hikes to bills. The UK's largest supplier said the 31% rise to customer bills since April had allowed it to increase capital investment by 22% to £1.3bn amid demands it improve performance in preventing sewage spills and stopping leaks. Thames Water said it recorded a 20% drop in pollution incidents over the six months to the end of September, and leakage performance was holding steady despite the \"extremely dry summer\". Money latest: How much is a fair restaurant tip?  While waste complaints dipped by 11%, according to the company, there was a 42% surge in the number of customers complaining about the hike to bills. Thames Water revenue rose 42% on the same period last year to £1.9bn, helping a return to profit after tax of £328m on the back of a £190m loss during April-September 2024. \n                  Major lender 'lights mortgage price war fuse'; supermarket reclaims cheapest title | Money blog\n                 \n                  FIFA backs away from dynamic pricing for all World Cup 2026 tickets\n                 \n                  Premier Miton picks veteran banker Williams as next chair\n                 The company said profitability was damaged by higher debt serving costs. Its debt pile was recorded at £17.6bn - a rise of 5%. The results were released against the backdrop of continuing talks involving the government and regulators over a proposed rescue deal by major Thames Water creditors. Their consortium is known as London & Valley Water. It effectively already owns Thames Water under the terms of a financial restructuring agreed early in the summer but regulator Ofwat is yet to give its verdict on whether the consortium can run the company, averting the prospect of it being placed in a special administration regime. Without a deal the consortium, which includes investment heavyweights Elliott Management and BlackRock, would be wiped out.  Ofwat, which is to be scrapped under a shake-up of industry oversight, has been leading scrutiny of London & Valley's operational plan and proposed capital structure. The prospective deal would write off billions of pounds of the company's debt and inject billions in fresh equity, in return for an adjustment in the regulator's approach to future financial penalties. Thames sees the creditors' proposal as the only viable solution. Despite huge hikes to household bills - allowed across England and Wales to bolster aging infrastructure including storm overflows - the company says its financial turnaround has been hampered by record fines for things like sewage leaks and bonuses to retain key staff. Sky News revealed on Tuesday that its remuneration committee will meet next week to decide whether to proceed with nearly £2.5m in retention payments to 21 senior managers. Read more from Sky News:Reeves hit by Labour rebellionThe Bank of England's take on 'elevated' risks Thames Water chief executive Chris Weston said the company had made good progress on its operational and transformation targets. \"This progress has all been achieved as we also manage the recapitalisation of the business. We continue to work closely with stakeholders to secure a market-led solution that we believe is in the best interests of our customers and the environment. \"This in turn will allow the transformation of Thames to continue, a programme that will take at least a decade to complete and will restore the infrastructure and operations of the company.\" "
    },
    {
        "title": "Premier Miton picks veteran banker Williams as next chair",
        "description": "The London-listed asset management group Premier Miton is this week set to name one of the City's leading financial institutions bankers as its next chairman.",
        "url": "https://news.sky.com/story/premier-miton-picks-veteran-banker-williams-as-next-chair-13478682",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-city-of-london-walkie-talkie_6970595.jpg?20250722105518",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-03 09:38:00",
        "Headline": "Christopher Williams, who advised the government on the bailouts of Britain's biggest banks during the 2008 financial crisis, will be appointed as the fund manager's new chairman this week, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The London-listed asset management group Premier Miton is this week set to name one of the City's leading financial institutions bankers as its next chairman. Sky News has learnt that Christopher Williams, whose career as an adviser encompassed stints at Citigroup, Credit Suisse and Perella Weinberg Partners, is to succeed Robert Colthorpe as Premier Miton's chair. Sources said the appointment of Mr Williams was likely to be announced alongside the fund manager's full-year results on Thursday. Money latest: How much is a fair restaurant tip? Investors will be looking for evidence of further cost-saving opportunities as well as chief executive Mike O'Shea's efforts to stem recent outflows. Mr Williams acted as an adviser to the Treasury during the banking industry meltdown in 2008, which led to the bailout of Britain's biggest banks and the launch of a huge insurance operation called the Asset Protection Scheme. He also advised on some of Europe's biggest banking mergers prior to the financial crash. \n                  Thames Water debt pile rises further despite return to profit\n                 \n                  Major lender 'lights mortgage price war fuse'; supermarket reclaims cheapest title | Money blog\n                 \n                  FIFA backs away from dynamic pricing for all World Cup 2026 tickets\n                 At Premier Miton, he will oversee an asset management group with roughly £10bn of assets under management. The company was formed from the merger in 2019 of Premier Asset Management and Miton Group. Its shares have risen by about 7% over the last year, leaving it with a market capitalisation of roughly £95m. A spokesperson for Premier Miton declined to comment."
    },
    {
        "title": "Nike, Superdry and Lacoste ads banned over 'misleading' sustainability claims",
        "description": "Ads for Nike, Superdry and Lacoste have been banned in the UK after regulators ruled they exaggerated environmental benefits and misled consumers.",
        "url": "https://news.sky.com/story/nike-superdry-and-lacoste-ads-banned-over-misleading-sustainability-claims-13478650",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-istock-shopping-secret-shoppers_6990565.jpg?20250814122341",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-03 07:58:00",
        "Headline": "The Advertising Standards Authority (ASA) said the adverts risked misleading shoppers who wanted to make greener choices.",
        "Content": "Ads for Nike, Superdry and Lacoste have been banned in the UK after regulators ruled they exaggerated environmental benefits and misled consumers. The Advertising Standards Authority (ASA) said all three brands used terms such as \"sustainable\", \"sustainable materials\" and \"sustainable style\" without evidence to back up the claims. It said the adverts risked misleading shoppers who wanted to make greener choices. In a Google ad in June, Nike promoted tennis polo shirts with \"sustainable materials\". Nike argued the wording was general and referred to products made with recycled polyester. But the ASA said the claim was \"absolute\" and required strong proof. It found Nike had not made it clear that the shirts did not have a detrimental impact on the environment. Nike said it had engaged with the ASA and taken \"necessary required actions\", adding: \"We remain committed to providing consumers with clear information to help them make the choices that are right for them\". A Superdry advert in June declared \"Sustainable Style\" and promised a wardrobe combining fashion and \"sustainability\". Superdry said the claim referred to collections containing sustainably sourced materials. It said the ad did not make an absolute claim, nor did it suggest all its products were sustainable. \n                  Seven red flags your mechanic is ripping you off - and what you can do about it\n                 \n                  How hidden card service could save you hundreds\n                 \n                  Money Problem: 'I had a haircut so bad I need to shave it off - what are my rights?'\n                 The ASA noted 64% of Superdry products in 2024 used such materials, but ruled that, without qualification, the sustainable claim was \"ambiguous and unclear\". It said it welcomed Superdry's decision to remove the ad. Read more:Supermarket reclaims title as nation's cheapestThe victims scarred by 10 years of county lines A Google ad for Lacoste children's clothing used the term \"sustainable\". Lacoste admitted that such claims are difficult to substantiate and withdrew the advert immediately after the complaint. The brand pledged not to repeat the wording in future. Justine Grimley, operations manager for the ASA's green project team, said: \"We know that people are increasingly looking to make greener choices, so it's important that advertisers are clear and upfront when making environmental claims. \"Broad or unproven statements risk giving a misleading picture of how environmentally-friendly a product really is.\" She added the rulings send a \"clear message\" that brands must back up green claims with solid evidence."
    },
    {
        "title": "O2, Vodafone, EE and Three face £1.1bn lawsuit in UK",
        "description": "O2, Vodafone, EE and Three are facing a huge class action lawsuit in the UK over claims millions of loyal customers have been overcharged. ",
        "url": "https://news.sky.com/story/o2-vodafone-ee-and-three-face-16311bn-lawsuit-in-uk-13478736",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-mobile-phone-logos_7097472.jpg?20251201115631",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-03 12:43:00",
        "Headline": "If the lawsuit is successful, every person affected could be entitled to up to £104 for each contract they took out with the operators.",
        "Content": "O2, Vodafone, EE and Three are facing a huge class action lawsuit in the UK over claims millions of loyal customers have been overcharged.  Named the loyalty penalty claim, the case alleges that companies were charging long-standing customers for their handsets beyond their contractual term. It claims up to 10.9 million phone contracts were affected between 1 October 2015 and 31 March this year. The lawsuit seeks damages of at least £1.141bn. If it is successful, every person affected could be entitled to up to £104 for each contract they took out with the operators. Many customers are expected to have claims against more than one mobile operator. Follow the latest consumer news here All qualifying customers will be automatically included in the claim for free unless they follow specific steps to opt out. The legal challenge, brought by consumer rights expert Justin Gutmann, was approved to go to trial by the Competition Appeal Tribunal. It is being brought on behalf of consumers who purchased mobile contracts made up of a mobile phone and airtime services such as data, minutes and calls. When these contracts are agreed, the price during the minimum term of the contract includes both the mobile and the use of airtime services. The claim alleges that operators failed to reduce the amount charged once the minimum contractual term expired, despite the fact that customers had already paid for their handsets. This resulted in existing customers being charged more than a new customer would be if they were just paying for airtime services. \"For far too long the phone companies have been taking advantage of their loyal customers,\" Gutmann said. \"That's why it's time to stop the immoral practice of loyalty penalties.\" Originally, Gutmann wanted the claim to go back to contracts starting in 2007, but the Competition Appeal Tribunal reduced the scope to contracts taken out between October 2015 and 31 March 2025. Read more from Money:'This was final straw with Asda...''My husband died before getting his state pension. Am I entitled to any of it?'Top chef on how much you should tip An O2 spokesperson told Money: \"At this early point in the proceedings, we welcome the Competition Appeal Tribunal's ruling that the majority of the claim has no basis to be brought, significantly reducing its scope. \"We maintain that there is no merit to Mr Gutmann's case for the remaining period and will continue to robustly defend our position as it proceeds.\" An EE spokesperson said: \"We do not accept the substantive allegations of the claim. Our priority is, and always will be, to provide a great experience for our customers.\" VodafoneThree said: \"We are disappointed with the Tribunal's decision to certify the claim. We will review the judgment in detail before considering next steps. We will continue to robustly defend this claim.\" Money has contacted the other mobile network operators for comment."
    },
    {
        "title": "Four mayoral elections to be postponed - as Labour accused of 'scandalous attempt to subvert democracy'",
        "description": "Four mayoral elections due to take place in May 2026 are set to be postponed by two years, Sky News understands.",
        "url": "https://news.sky.com/story/labour-accused-of-scandalous-attempt-to-subvert-democracy-as-four-mayoral-elections-to-be-postponed-13479074",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-keir-starmer-frank-walter-steinmeier_7099752.jpg?20251203161303",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-03 22:14:00",
        "Headline": "Reform UK claims it is a \"blatant attempt to stop big wins\" for the party, with the elections due to take place in May now set to be postponed by two years.",
        "Content": "Four mayoral elections due to take place in May 2026 are set to be postponed by two years, Sky News understands. Elections for the new mayoralties of Essex, Hampshire and the Solent, Sussex and Brighton, and Norfolk and Suffolk will be pushed back until 2028. The decision, first revealed by The Sun, is due to be announced by ministers on Thursday. This is the second time elections are being delayed in these areas. Local elections due in May 2025 were delayed by then communities secretary Angela Rayner for a year in order to convert them into combined authorities led by mayors. However, it is understood that these councils need more time to complete their reorganisation.  The news has sparked accusations Labour are delaying the elections for political purposes. Reform UK's head of policy Zia Yusuf said: \"This is a blatant attempt to stop big Reform wins next May. \"It's an act of a desperate government who are clinging onto power by any means necessary. \"Labour has proven time and time again that they're not beyond denying democracy to millions of people in order to maintain their cosy status quo.\" The Tories' shadow housing secretary James Cleverly said it was a \"scandalous attempt to subvert democracy by a Labour government whose credibility and popularity are already in tatters\". \"The Conservatives firmly oppose this decision to delay the mayoral elections, especially when candidates have been selected and campaigning is well under way,\" he added. \"Democracy is being denied yet again after the council elections cancelled by Labour this year. \"There is no credible justification for this move. The Labour government must reverse it immediately.\"  The reorganisation is part of Labour's manifesto commitment to widen devolution, which it argues will improve local economies. The government wants to abolish the two-tier system of county and district councils and merge them together to create larger unitary authorities. It also wants more areas to have regional mayors, like Greater Manchester's Andy Burnham. Read more:Tory-Reform pact talks 'not happening at any level'Reeves hit by Labour rebellion Reform UK enjoyed success in the local elections in May, winning more than 600 seats and taking control of 10 councils stretching from Kent to County Durham. The party also toppled a 14,000-strong Labour majority in a parliamentary by-election. The Liberal Democrats' local government spokesperson Zoe Franklin called the postponed elections \"a disgrace\". \"Democracy delayed is democracy denied,\" she added. \"We are fighting to end this blatant stitch up between Labour and the Conservatives over local elections.\""
    },
    {
        "title": "Reeves between a rook and a hard place after claims she 'made up' chess championship",
        "description": "As an opening gambit at PMQs, Kemi Badenoch attacked Labour's knight, the prime minister, over his Treasury queen, Rachel Reeves.",
        "url": "https://news.sky.com/story/reeves-between-a-rook-and-a-hard-place-after-claims-she-made-up-chess-championship-13479059",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rachel-reeves-wales_7097682.jpg?20251201151103",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-12-03 21:37:00",
        "Headline": "The chancellor's opponents say the Treasury queen has become a pawn - but it's too soon to tell if the chess attack is a checkmate or a stalemate. ",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  As an opening gambit at PMQs, Kemi Badenoch attacked Labour's knight, the prime minister, over his Treasury queen, Rachel Reeves. \"We now know the black hole was fake, the chancellor's book was fake, her CV was fake - even her chess claims are made up,\" said the Tory leader. Politics Live: Labour MP who voted against inheritance tax suspended  \"She doesn't belong in the Treasury; she belongs in la-la land.\" Chess claims made up? Where did that attacking move from Kemi come from? Hasn't the chancellor told us for years that she was a national chess champion in 1993? Indeed she has. \"I am - I was - a geek. I played chess. I was the British girls' under-14 champion,\" she declared proudly in a 2023 interview with The Guardian. She posted a video showing her playing chess in parliament and before last week's budget posed for photos with a chessboard. \n                  Rachel Reeves hit by Labour rural rebellion over inheritance tax on farmers\n                 \n                  Budget 2025: Over a third of Britons think Rachel Reeves exaggerated bad news\n                 \n                  Is Starmer continuing to mislead public over the budget?\n                 But her chess champion claim has been disputed by a former junior champion, Alex Edmans, who has accused her of misrepresenting her credentials. \"Her claim was quite specific,\" Edmans, now a professor of finance at the London Business School, told Ali Fortescue on the Politics Hub on Sky News. \"She said she was the British girls' under-14 champion. There was one event that can go on that title, which is the British Championship. And in the year that she claimed, it was Emily Howard who won that title instead. \"She did indeed win a quite different title. There was a British Women's Chess Association championship, but that's a more minor title. I've won titles like the British squad title, but that's not the same. \"Just like running a marathon in London is not the same as the London Marathon, there was one event which is very prestigious, which is the British Championship. \"So the dispute is not whether she was a good or bad chess player. That shouldn't be the criterion for a chancellor. But if you weren't the British champion, you shouldn't make that statement.\" Read more from Sky News:Mysterious tentacles wash up on Scottish beachAustralia's under-16s social media ban Oh dear! So now, along with allegations of plagiarism, a dodgy CV and \"lying\" - according to Ms Badenoch - about the nation's finances, the chancellor is between a rook and a hard place. Or is she? \"This story is absolute nonsense,\" a Treasury mate told Sky News. No word from the No.10 knight, Sir Keir Starmer, or his Downing Street ranks, however. Emily Howard, as it happens, is now an accomplished composer, having graduated from the chessboard to the keyboard. The chancellor's opponents, meanwhile, claim her budget blunders means the Treasury queen has now become a pawn, there for the taking. But since Rachel Reeves did indeed win a chess title, just not the one she claimed, her supporters insist she can justifiably claim to have been a champion. So it's too soon for Kemi Badenoch and the Conservatives to claim checkmate. The dispute remains a stalemate. For now."
    },
    {
        "title": "Tory-Reform pact talks 'not happening at any level', says Richard Tice",
        "description": "Reform UK's deputy leader Richard Tice has told Sky News that talks of an electoral pact with the Tories \"are not happening at any level\". ",
        "url": "https://news.sky.com/story/reform-and-tories-deny-they-could-unite-for-next-election-13478591",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nigel-farage-kemi-badenoch_7099198.jpg?20251203015154",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-03 01:52:00",
        "Headline": "Nigel Farage has done a deal with the Tories before, but insists those days are long behind him. It comes after a report said he's told Reform donors he believes the two parties will have to team up to win the next election.",
        "Content": " Reform UK's deputy leader Richard Tice has told Sky News that talks of an electoral pact with the Tories \"are not happening at any level\".  The Financial Times (FT) quoted unnamed sources who said Nigel Farage had told donors he believes an agreement between both parties is inevitable. The newspaper said this indicates \"he does not believe he can sweep to power alone\" - and illustrates the challenge of turning political momentum into high office. However, Mr Tice told Sky News' Politics Hub with Ali Fortescue that this was \"fake news\". Asked if he would be open to a pact, he said: \"No. The only thing that the Tories need to do is to recognise that they've had their time after a couple of hundred years - they've blown it, and they should step aside and let Reform take on and defeat the hard socialists and the communists that seem to be on the left side of politics now.\"  Some Reform supporters have expressed concern that both parties could end up fighting over the same seats, splitting the right-wing vote and benefitting Labour. Others are worried about the first past the post system, which means candidates with the most votes win a constituency - even if they fail to secure a majority. Reform UK received 4.1 million votes in 2024, making it the third-most popular party, but won just five seats out of 650. Mr Tice insisted that his party are now leading the polls by enough of a margin to secure a majority in the Commons. It was put to him that he should level with supporters that talks are happening at some level, but he said: \"We are [being honest], and they're not happening at any level, and they won't happen at any level.\" However, he refused to say if Reform would enter into a pact with the Tories if not doing so would leave Sir Keir Starmer as prime minister. Despite Reform welcoming some former Tory MPs into its fold, Mr Tice also insisted that \"most of the parliamentary Conservative Party are really sort of, they're more towards the Lib Dems - they don't agree with our policies\". He added that the story last night in the Financial Times was \"either made up in the imagination of the journalist or in the imagination of maybe a couple of donors who wanted to hear something different from what they actually heard\", branding it \"fake news\".  Farage: A deal would cost us votes The FT report suggested Mr Farage would only agree to a deal on his terms because he felt betrayed after a pact made with the Tories in 2019, when his Brexit Party helped hand Boris Johnson victory. But the Reform leader denied these rumours - and declared \"the Conservatives will no longer be a national party\" after the local elections in May 2026 anyway. He said: \"I would never do a deal with a party I don't trust. No deals, just a reverse takeover. \"A deal with them as they are would cost us votes.\" Deputy political editor One of the striking things that we've seen through the autumn, when you look at the polling - and I'm sure this most starkly in the YouGov MRP that we did just before the conference season - is that Reform doesn't get an overall majority broadly on the current numbers. The September poll had Reform winning 271 seats. Now, you need 324-plus to get an overall majority in the Commons. In order to have the certainty that Nigel Farage would go into Number 10 you would need backing at that moment, or before that moment probably, from Tory MPs. One of the conclusions of the FT piece, that they make very explicitly, is this is a reflection that at the moment, in private, Nigel Farage isn't quite sure he can do it on his own.  But then you have this question: just how receptive are Tories? You've got the Kemi Badenoch position, but I only have to point to a couple of things from earlier this year, and you can see just how possible this suddenly all looks. \n\n In April this year, I got hold of a recording of shadow justice secretary, one time Tory leadership contender Robert Jenrick. He was vowing to quote \"bring this coalition together\" to assure that Conservatives and Reform UK aren't fighting each other in the next election.  He was saying one way or another he was going to make sure that Reform and the Tories don't cost each other the votes and allow Labour to come up through the middle.  Fast-forward to Tory Conference and I got hold of Robert Jenrick. And again, his answer on pacts and mergers and all the rest of it was quite teasing. Asked if he would \"never\" support a pact, Jenrick said it was \"not our priority\". Jenrick would deny there was any difference between him and Badenoch. I think Jenrick reflects the wider Tory party. How do I know that? Well, let's look at the polling again. The YouGov Tory members poll found 64% supporting an electoral pact with Reform UK and 31% not, but 46% supporting a full-blown merger.\n\n The appetite's there. Farage may not want to admit to us in public that he isn't quite there, getting an overall majority. But if you pushed at the door, I think there are a lot in the Tory party who don't disagree with what the Reform UK leader is saying. A Tory spokesman also warned that no deals or pacts will be considered under Kemi Badenoch's leadership. He added: \"Reform want higher welfare spending and to cosy up to Putin. Only the Conservatives have the team, the plan, and the backbone to deliver.\" The latest YouGov opinion poll suggests support for Reform UK is at 26% - with Labour and the Tories deadlocked on 19% each. Reform's momentum has led about 20 former Tory MPs to defect, including Boris Johnson ally Nadine Dorries. However, figures suggest the Conservatives have the upper hand when it comes to donations - receiving three times more cash than Reform in the first half of 2025. Read more politics news:Reeves facing Labour rebellionPolling makes grim reading for PM  One Reform donor told the FT: \"They will have to come together. The Conservatives have been a successful political party forever because the left was always divided … If the right is divided, it can't win.\" A Labour Party spokesperson was equally scathing of both parties - claiming the Conservatives broke public services, and Reform would make \"savage\" spending cuts. \"This shady backroom plot will send a shiver down the spine of people up and down the country, and shows you simply can't trust Nigel Farage,\" they added."
    },
    {
        "title": "Wes Streeting accuses BMA of behaving like 'moaning minnies'",
        "description": "The health secretary has accused the British Medical Association of \"juvenile delinquency\" and behaving like \"moaning minnies\" after the union announced that resident doctors will go on strike in the run-up to Christmas.",
        "url": "https://news.sky.com/story/wes-streeting-accuses-bma-of-behaving-like-moaning-minnies-13478661",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/2e7623cb1774bd55d5175f3082b5bfb9edfb8171a20725120838bbc3ca7bebae_7099296.jpg?20251203075243",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-03 08:27:00",
        "Headline": "Resident doctors have announced another strike for 17-25 December over pay and career progression.",
        "Content": " The health secretary has accused the British Medical Association of \"juvenile delinquency\" and behaving like \"moaning minnies\" after the union announced that resident doctors will go on strike in the run-up to Christmas. Wes Streeting told Mornings with Ridge and Frost he is fed up with the BMA after resident doctors - previously called junior doctors - will be taking industrial action from 17-25 December - their 14th strike since March 2023. He is pushing for more online GP appointments to stop the morning rush for one, and said the fact 98.7% of practices are now offering them should be a \"really great news story\". The BMA's GP committee is opposing the move as they said patients would be put at risk if they cannot get through on the phone or in person. Mr Streeting said the BMA signed up to the move then backtracked and said GPs \"deserve real credit\" for a big increase in satisfaction ratings over the past year. Politics latest: Who is behind Farage-Tory pact plot? He accused BMA leaders of \"sitting in the corner like moaning minnies, when actually their members are doing a really good job working with the government to improve patient care and experience\". He said: \"Whether it's the rhetoric and the behaviour of the BMA around general practice, whether it is yet another round of unnecessary strike action being proposed by resident doctors who have had a 28.9% pay rise, we've seen an outbreak in the British Medical Association of juvenile delinquency, and it is irresponsible because we know that the NHS is under real pressure.\" The cabinet minister added: \"The BMA is not only holding back the NHS's recovery and inflicting damage on patients, it's also self-defeating for their members who are having to work in these conditions.\" He urged the BMA to \"work with us\" as he said he and the government are in agreement with them over a \"whole bunch of things\", including pay, career progression, training places, bottlenecks and international medical recruitment. \"But change takes time and they've got a willing partner, and they need to work with us,\" he said. Mr Streeting said he is \"genuinely worried\" about the doctors' strike just before Christmas, which he called a \"different order of magnitude of risk\" compared with previous strikes, which he said have been very well managed by NHS leaders. He said Sir Jim Mackey, the chief executive of the NHS, and other clinical leaders are also fearful. \"It is not too late to avert that strike action,\" Mr Streeting added. Read more from Sky News:Reeves hit by Labour rebellionReform and Tories deny pact   The health secretary previously called the strike a \"cynical attempt to wreck Christmas\". Resident doctors say despite a nearly 30% pay rise over the past three years, including 22% under Labour, they need a further 26% increase over the next few years to make up for the erosion in their pay in real terms since 2008."
    },
    {
        "title": "Australia's under 16s social media ban: How will it work and could the UK bring in a similar law?",
        "description": "Australian teenagers under 16 are set to face a world-first social media ban from 10 December. ",
        "url": "https://news.sky.com/story/australias-under-16s-social-media-ban-how-will-it-work-and-could-the-uk-bring-in-a-similar-law-13478719",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-social-apps_7099757.jpg?20251203162209",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-03 11:31:00",
        "Headline": "Australia is leading the way as it prepares to ban children under the age of 16 from using social media. But the move hasn't come without controversy.",
        "Content": "Australian teenagers under 16 are set to face a world-first social media ban from 10 December.  The legislation has left tech platforms such as TikTok and Meta scrambling to figure out how to implement the ban to avoid fines of up to £25 million. The companies need to find ways to close existing accounts belonging to under-16s and stop new ones from being created as the legislation comes into effect. Australia's eSafety Commissioner says the restrictions \"aim to protect young Australians from pressures and risks that users can be exposed to while logged in to social media accounts\". \"These come from design features that encourage them to spend more time on screens, while also serving up content that can harm their health and wellbeing,\" the commissioner adds. The law is designed to protect children from potential mental health risks, cyber-bullying, and inappropriate content. Australia's 2021 census showed there are roughly 2.5 million eight to 15-year-olds in the country, and the government has estimated that 86 per cent of people in the age bracket use social media. Which platforms will be affected? The commissioner has determined that Facebook, Instagram, Snapchat, Threads, TikTok, Twitch, X, YouTube, Kick, and Reddit are age-restricted platforms. But more generally, age restrictions will apply to social media platforms that meet three specific conditions, unless the Australian government determines they should be excluded. The conditions are: Platforms are responsible for determining whether they fit the criteria and doing their own legal assessments. What apps will not be age-restricted? According to the commissioner, Discord, GitHub, Google Classroom, LEGO play, Messenger, Pinterest, Roblox, Steam and Steam Chat, WhatsApp, and YouTube Kids are among those that will not be age-restricted. ESafety determined the list on 21 November, and said \"there are no further assessments planned in the lead up\" to the ban on 10 December. However, the Australian government has indicated that it is a dynamic list and other platforms could be added at a later stage. Read more:New law targets AI-generated child sex abuse imagesWhat you can't say in online postsBacklash against internet safety rules What penalties could social media platforms face if they don't comply? Australia's Online Safety Amendment Act 2024 requires companies to take \"reasonable steps\" to stop underage users from signing up and using their platform; they could face fines of up to $49.5 million (£25 million) for failing to comply. How will age verification work? This is the responsibility of each platform. However, the Australian government has said that requesting ID cannot be the only way to determine someone's age. Meta has said it will comply with the ban; however, in submissions to the Australian government last year, it said the legislation was \"a missed opportunity and overlooks the practical reality of age assurance technology as well as the views of a majority of mental health and youth safety organisations in the country\". Meta has said it expects issues with its technology, which could result in accounts belonging to people who are actually over 16 accidentally being shut down. Meta previously confirmed that its users aged 13 to 15 would receive in-app messages or texts informing them their Facebook, Instagram and Threads accounts would be removed as early as 4 December. It said it would rely on age-estimation systems. TikTok said in a statement that it will have a \"multi-layered approach to age assurance,\" while Snapchat will use behavioural signals to estimate ages.  Is the move controversial?  As Meta did in its submissions to the Australian government, several other platforms have criticised the move. Google and YouTube Australia's public policy senior manager, Rachel Lord, said the site will automatically sign out users who are deemed to be under 16. But, she said, they can still watch some YouTube videos while signed out, and parents will \"lose their ability to supervise their teen or tween's account\" and use controls such as blocking channels. Australia's communications minister Anika Wells responded, saying it was \"outright weird that YouTube is always at pains to remind us all how unsafe their platform is in a logged out state\". There has been criticism of the government for excluding popular apps, particularly Yope and Lemon8, which are currently in the top 30 on the Australian iOS App Store, as kids look for alternatives. Ms Wells told Australian media that \"if we find that because they've been logged out of Snapchat, Instagram, TikTok [or] what have you, they end up on Lemon8, then we will look at whether the harm has transferred there and whether we need to add them to the list\". Opposition leader Sussan Ley said she has \"no confidence\" that the social media ban would work. Could the UK introduce a similar ban? While Australia is leading the way in legislating age-restriction rules on under-16s, the UK is also navigating this type of discussion. The government brought in the Online Safety Act in July, saying \"the way children experience the internet will fundamentally change\". It included age restrictions effectively banning under-18s from seeing \"the most harmful material on social media and other sites\". The law is aimed at stopping children from watching \"harmful content\" including pornography, self-harm, suicide, hate speech and violence."
    },
    {
        "title": "Doctor who supplied ketamine to late Friends star Matthew Perry jailed",
        "description": "A doctor who pleaded guilty to illegally supplying ketamine to Matthew Perry in the weeks before the star's death has been jailed for two-and-a-half years.",
        "url": "https://news.sky.com/story/doctor-who-supplied-ketamine-to-late-friends-star-matthew-perry-jailed-13478863",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-salvador-plasencia_7099906.jpg?20251203182924",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-12-03 16:10:00",
        "Headline": "Salvador Plasencia is the first of five people to be sentenced in connection with the death of the Friends star, who was found drowned in the hot tub at his home in Los Angeles after taking ketamine in October 2023.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n A doctor who pleaded guilty to illegally supplying ketamine to Matthew Perry in the weeks before the star's death has been jailed for two-and-a-half years. Salvador Plasencia, who operated an urgent-care clinic outside Los Angeles, is the first of five people to be sentenced in connection with the death of the Friends actor. Perry was found drowned in the hot tub at his home after taking ketamine in October 2023. \"You and others helped Mr Perry on the road to such an ending by continuing to feed his ketamine addiction,\" Judge Sherilyn Peace Garnett told Plasencia as she handed down the sentence. \"You exploited Mr Perry's addiction for your own profit.\" During the hearing, Plasencia broke into tears as he spoke about the day he would have to tell his now two-year-old son \"about the time I didn't protect another mother's son\". Apologising directly to Perry's family, he said: \"I should have protected him.\" The doctor's mother cried loudly in the courtroom as he was led out in handcuffs. Ahead of the sentencing, Perry's mother Suzanne Perry and stepfather Keith Morrison described those involved in supplying ketamine to the star illegally as \"jackals\", and said they believed Plasencia to be \"among the most culpable of all\". The actor had been taking ketamine legally as a treatment for depression, but started seeking more of the drug and taking it unsupervised in the weeks before his death, acquiring it illegally from different sources. Plasencia, 44, did not supply the dose that killed the actor, but had been distributing the surgical anesthetic to him in the weeks beforehand. He initially denied the charges against him but changed his plea earlier this year, admitting four counts of distribution. He could have faced up to 40 years in prison had he been convicted at trial. Doctor 'fed on vulnerability' Court documents showed details of a text message Plasencia sent to another doctor, who is also due to be sentenced, saying: \"I wonder how much this moron will pay.\" \"Rather than do what was best for Mr Perry - someone who had struggled with addiction for most of his life - [Plasencia] sought to exploit Perry's medical vulnerability for profit,\" the prosecution said in its sentencing memo. Known as \"Dr P\", Plasencia was introduced to Perry by one of his own patients on 30 September 2023, prosecutors said. This patient said the actor was a \"high profile person\" who was willing to pay \"cash and lots of thousands\" for ketamine treatment, and the doctor was \"motivated by the promise of a payday\". Plasencia's lawyers admitted his behaviour was \"reckless\" and said it was \"the biggest mistake\" of his life. \"Remorse cannot begin to capture the pain, regret and shame that Mr Plasencia feels for the tragedy that unfolded and that he failed to prevent,\" they said. Star's family share emotional statements During the hearing, Perry's mother Suzanne addressed the court to talk about everything he had overcome in his life. \"I used to think he couldn't die,\" she said, supported by her husband. \"You called him a 'moron',\" she said to Plasencia. \"There is nothing moronic about that man.\" In victim impact statements submitted to court, she and her husband said Plasencia's actions were not the result of \"one very bad decision\" or done \"in the heat of passion\", and nor was he a \"bad to the bone\" drug dealer. They added: \"No one alive and in touch with the world at all could have been unaware of Matthew's struggles. But this doctor conspired to break his most important vows, repeatedly, sneaked through the night to meet his victim in secret. For what, a few thousand dollars? So he could feed on the vulnerability of our son.\" \"The world mourns my brother,\" Perry's half-sister Madeleine Morrison said. \"He was everyone's favourite friend.\" Perry's father John and stepmother Debbie had called for a lengthy sentence, and said Plasencia's actions had \"devastated\" their family. \"How long did you possibly see supplying Matthew countless doses without his death to eventually follow?\" they asked. \"Did you care? Did you think?\" Read more:The drug network exposed by Perry's deathObituary: The one who made everyone laughMatthew Perry: A life in pictures As well as the prison sentence, Judge Sherilyn Peace Garnett handed down two years of probation to Plasencia. The other four people charged in connection with Perry's death have also accepted plea deals and are due to be sentenced over the next few months. They are: dealer Jasveen Sangha, also known as \"the Ketamine Queen\", Perry's assistant Kenneth Iwamasa, another doctor, Mark Chavez, and Erik Fleming, an associate of the actor. Perry had struggled with addiction for years, dating back to his time on Friends, when he became one of the biggest stars of his generation playing Chandler Bing. He starred alongside Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc and David Schwimmer for 10 seasons, from 1994 to 2004, and appeared in the reunion show in 2021."
    }
]