[
    {
        "title": "US and Ukraine sign deal to establish investment fund",
        "description": "The US Treasury has announced it has agreed to establish an American-Ukrainian reconstruction investment fund.",
        "url": "https://news.sky.com/story/us-and-ukraine-sign-deal-to-establish-investment-fund-13358985",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-scott-bessent-yulia-svyrydenko_6902241.jpg?20250430231717",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-30 21:42:00",
        "Headline": "A senior Ukrainian official said the US will make \"direct financial contributions\" to the fund and \"may also provide new assistance\" such as air defence systems.",
        "Content": "The US Treasury has announced it has agreed to establish an American-Ukrainian reconstruction investment fund. For Ukraine, the economic deal was seen as possibly key to ensuring its access to future US military aid in its war against Russia. President Trump had previously called for Kyiv to compensate Washington for billions of dollars in assistance to help repel the Kremlin's forces. A senior Ukrainian official said on Wednesday the US will make \"direct financial contributions\" to the fund and \"may also provide new assistance\" such as air defence systems for Ukraine. In return the US is set to get preferential access to any new deals concerning Ukraine's mineral resources. Trump latest: Deal shows Trump 'committed to free Ukraine' The US Treasury said \"in recognition of the significant financial and material support\" the US has provided to the \"defence of Ukraine... this economic partnership positions our two countries to work collaboratively and invest together to... accelerate Ukraine's economic recovery\". US treasury secretary Scott Bessent said: \"This agreement signals clearly to Russia that the Trump administration is committed to a peace process centered on a free, sovereign, and prosperous Ukraine over the long term.\" He also said \"this partnership allows the US to invest alongside Ukraine, to unlock Ukraine's growth assets, mobilise American talent, capital and governance standards that will improve Ukraine's investment climate and accelerate Ukraine's economic recovery\". Britain's Foreign Secretary Davis Lammy has welcomed the deal. Donald Trump indicated in February he wanted access to Ukraine's rare earth materials, describing it as reimbursement for the billions of dollars in aid the US has given to Kyiv. But talks stalled after a heated Oval Office meeting between him and Ukraine's President Volodymyr Zelenskyy, and reaching an agreement since then has proven difficult amid strained relations between Washington and Kyiv. News correspondent They are calling this a \"reconstruction investment fund\" but it gives the US access to things like graphite, aluminium, oil and gas. The White House has confirmed this is indeed the oft-referenced \"minerals deal\", and it will pay dividends in various ways. Economically it allows the US to say they are clawing back the billions of dollars it has offered in military aid to Ukraine. Politically, by having an investment on the ground, it allows Donald Trump to claim he's giving Volodymyr Zelenskyy the security guarantees he's sought for so long. It is the latest chapter in a remarkable story. The jaw-dropping showdown between Mr Trump and Mr Zelenskyy in the Oval Office at the end of February, when the US was seemingly suggesting Ukraine was somehow responsible for the Russian invasion, redefined old allegiances in real time before our very eyes, to the shock of other world leaders. Then last weekend, we saw the two men again seated together just feet apart at St Peter's Basilica in Rome at the funeral of Pope Francis, closing the gap both literally and politically. Mr Trump vowed to end the war in Ukraine on his first day in office. On his 101st day, he's closer to doing that than he ever has been before. Why is US interested in Ukraine's raw materials? The US is seeking access to over 20 raw materials seen as strategically critical to its interests, including some non-minerals such as oil and natural gas. Among them are Ukraine's deposits of titanium, which is used for making aircraft wings and other aerospace manufacturing, and uranium, that is used for nuclear power, medical equipment and weapons.  Ukraine also has lithium, graphite and manganese, which are used in electric vehicle batteries. On Wednesday, Ukraine's first deputy prime minister Yulia Svyrydenko said she had signed the agreement in Washington DC to create the investment fund. She wrote on X: \"Together with the United States, we are creating the fund that will attract global investment into our country. \"Its implementation allows both countries to expand their economic potential through equal cooperation and investment. \"The United States will contribute to the fund. In addition to direct financial contributions, it may also provide new assistance - for example air defence systems for Ukraine.\" The announcement comes as the Trump administration is pushing to stop the war, which erupted in February 2022 when Russia launched a full-scale invasion. Russian President Vladimir Putin backs calls for a ceasefire before peace negotiations, \"but before it's done, it's necessary to answer a few questions and sort out a few nuances\", Kremlin spokesman Dmitry Peskov has said. Mr Putin is also ready for direct talks with Ukraine without preconditions to seek a peace deal, he added. On Monday, the Russian leader declared there would be a three-day ceasefire from 8 May to 10 May. Mr Zelenskyy wants an immediate ceasefire lasting at least 30 days."
    },
    {
        "title": "Inside police efforts to crack down on violent and knife crime in Manchester",
        "description": "\"I'd say the last two years people are just - they just don't care anymore, they are using knives and doing all sorts.\"",
        "url": "https://news.sky.com/story/inside-police-efforts-to-crack-down-on-violent-and-knife-crime-in-manchester-13358702",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gmp-police-crime-manchester_6901945.jpg?20250430165723",
        "type": "Home",
        "Author": "Katerina Vittozzi",
        "Date Published": "2025-04-30 13:22:00",
        "Headline": "Sky News spent two months watching officers in Greater Manchester Police's  Operation Venture unit as they try to tackle knife and violent crime on the city's streets.",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n  \"I'd say the last two years people are just - they just don't care anymore, they are using knives and doing all sorts.\" PC Maguire, 28, speaks with the authority of experience: experience that comes from working in Greater Manchester's most high-crime areas. \"I remember when I was a teenager,\" she says, \"you'd never really hear of people carrying a knife or anything. But now it's the normal thing to do.\" \"It's mad,\" she adds. PC Maguire is part of Operation Venture, an elite policing unit within Greater Manchester Police set up to tackle serious violence and knife crime. Over the past two months, we've been given exclusive access to watch them work. Moped chase We're on a Friday afternoon vehicle patrol in south Manchester with another member of the Venture team, Sgt Mohammed Waqas, when his radio, and that of fellow officer PC Hodge, who's driving, starts pinging. Their plain clothes team has spotted two youths in balaclavas, on a moped, weaving in and out of traffic. \"We suspect they are involved in some sort of knife-point robberies,\" Sgt Waqas says. The moped has also had its registration plates pulled off - officers suspect it's been stolen. The team starts searching the streets and is flagged down by a passing driver who says he's just had to swerve to avoid hitting a moped. \"They're little idiots, up there!\" the driver says, visibly angry. \"There are kids around. \"I swear to god I felt like f*****g chasing them down, and kicking them up the arse.\" Meanwhile, the unit's covert officers are waiting where the moped has been previously spotted. When it returns, a short while later, there are three youths onboard. The team detain one, a 16-year-old who is known to them, but the two other youths get away. Sgt Waqas and PC Hodge take up the chase, following the moped at speed as it runs red lights. Incredibly, we see one of the moped riders filming it all on their mobile phone. Later, the officers tell us: \"They'll probably post it online.\" But right now, they are focused on trying to catch them, which, in rush hour traffic, proves impossible. They lose them - \"yeah, total loss\", Sgt Waqas reports via his radio to the comms operator. \"Just to log as well,\" he adds, \"two males, white males, both got balaclavas on.\" \"One of them has possibly got something in his jacket. Can't tell what it is, just the way that he was holding himself.\" It's extremely frustrating for the team. A baby buggy, a knife and £50,000 cash A few hours later, during a patrol in Salford, we see the sorts of weapons they are up against. We're with PC Maguire again, on vehicle patrol, when a police camera flags a car with links to suspected drug supply. Along with another of the unit's patrol cars, PC Maguire works to get into a formation to box in the suspect's vehicle. \"XR2, show me as Car two,\" PC Maguire tells a radio operator, having quickly made ground to get the vehicle in her sights. \"You want to get a stop on, before they have an opportunity to get away,\" she explains. But, after a brief pursuit through the dark streets, the car they are following pulls over of its own accord. The driver, who's in his 20s, is searched - as is his vehicle. Inside, along with baby buggies and car seats, officers find a knife in the glovebox and a shoebox full of cash. Read more from Sky News:Serial paedophile jailed for 46 yearsFootage of alleged Sycamore Gap tree fellingUK joins US in strike on Houthi target in Yemen Officers estimate there's about £50,000 in there. After brief questioning on site, the man tells officers that he's been staying at a house nearby and admits there's another weapon in there. A few minutes later, PC Ben Cartledge - another Operation Venture officer - comes out holding what looks like a huge knife. \"It's a machete,\" he says, \"it was in the bedroom.\" It's extremely heavy and looks terrifying. \"I'm not going to lie to you, mate, it's for protection only,\" the arrested man says, when PC Cartledge arrests him on a further offence of having an offensive weapon in a private place. It's a line officers have heard before. \"There's that social media side of it,\" a senior officers says. \"Sometimes they'll film themselves doing the robbery and sharing it around, and that becomes the normality. \"So then people will sometimes carry weapons to protect themselves.\" The unit uses a combination of proactive stop and search, intelligence-led policing and undercover tactics. It's why we can name officers but sometimes not show faces."
    },
    {
        "title": "Two children from Gaza enter UK for specialist medical care for first time after months of struggle",
        "description": "It was a welcome party of sorts, and it was assembled near arrivals at Heathrow's Terminal 5.",
        "url": "https://news.sky.com/story/two-children-from-gaza-enter-uk-for-specialist-medical-care-for-first-time-after-months-of-struggle-13359013",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-children_6902265.jpg?20250501013037",
        "type": "Home",
        "Author": "John Sparks",
        "Date Published": "2025-04-30 23:58:00",
        "Headline": "Until now, not a single child from Gaza has entered the UK for medical care, and the process has not been an easy one for the volunteers at Project Pure Hope. They told Sky News it has taken 17 months to arrange temporary visas for the two children.",
        "Content": "\n          International correspondent\n              @sparkomat\n It was a welcome party of sorts, and it was assembled near arrivals at Heathrow's Terminal 5. A few people clutched flowers, others brought presents, while everyone carried a sense of relief. Two children from Gaza had been given permission to enter Britain for specialist medical care and the pair would arrive on the evening flight from Cairo. It was a significant moment - the first time UK visas had been granted to children from this war-ravaged enclave - and the product of months of struggle by a small group of British volunteers. As those in attendance offered up a cheer, a five-year-old called Ghena Abed emerged shyly from behind the security gates. With fluid pressing on her optic nerve, she needs urgent treatment to save the vision in her left eye. Also in this party was a 12-year-old girl called Rama Qudiah. She is weak and malnourished and suffers from incontinence. Medics think she requires an operation on her bowel. Her mother, Rana, told us their arrival in Britian \"is just a like a dream\". Her daughter has certainly been fortunate. A small number of children from Gaza have benefited from medical evacuations, with the majority receiving care in countries in the Middle East, Europe, as well as the United States. In March, the Israelis signed a deal with Jordan which could allow 2,000 children to leave the enclave for treatment of war injuries and conditions like cancer. However, just 29 were allowed to go at first instance. The process has not been easy Until now, not a single child from Gaza has entered the UK for medical care since the start of the current conflict, and the process has not been an easy one for the volunteers at Project Pure Hope. They told Sky News it has taken 17 months to arrange temporary visas for Ghena and Rama. \"A lot of us are health care workers and I think it's in our DNA that when we see people who are suffering, particularly children, we want to try and do something and that's what motivated us,\" says Dr Farzana Rahman from Project Pure Hope. When asked why she thinks it has taken so much time to secure their visas, Dr Rahman said: \"I don't know.\" Group argues it has no time to lose to help other children But it is clear the arrival of children from Gaza is an issue of sensitivity. The British volunteers told us on a number of occasions that all costs would be met by private sources. The children will return to Gaza when the treatment is completed. Project Pure Hope is not finished, however - group members have drawn up a list of other children they can help, and argue they have no time to lose. \"One of the hardest parts of trying to make progress in this area is that delays cost lives. A number of children have died who we haven't been able to help and this is an urgent situation and I think for all of us that's the hardest part,\" says Dr Rahman."
    },
    {
        "title": "Capture: Victims of second Post Office scandal to receive 'recognition' payments before compensation",
        "description": "The government will give 'recognition' payments to Post Office Capture victims before they receive full compensation.",
        "url": "https://news.sky.com/story/capture-victims-of-second-post-office-scandal-to-receive-recognition-payments-before-compensation-13358940",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-post-office-sign_6839861.jpg?20250225230217",
        "type": "Home",
        "Author": "Adele Robinson",
        "Date Published": "2025-04-30 20:24:00",
        "Headline": "One Capture victim told Sky News there has been \"quite a lot of progress\" in talks with the government - but there are still concerns over how long it's going to take for the compensation scheme to start. ",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n The government will give 'recognition' payments to Post Office Capture victims before they receive full compensation. Former sub-postmasters and their families who are entitled to redress have been told the initial amount, which is yet to be finalised, could be £10,000. Capture was a faulty computer system used by sub postmasters in the 1990s - before the Horizon scandal. A report last year found the software is likely to have caused errors in accounting. A redress scheme is currently being set up for those affected and could possibly be introduced by the end of the summer. Steve Marston, a Capture user who was convicted of stealing from his Post Office in 1996, describes \"quite a lot of progress\" at a government meeting but raised concerns over pace. He told Sky News: \"I'm more than happy that the compensation scheme is going to be put in place as quickly as possible. \n                  Post Office to unveil £1.75bn banking deal with big British lenders\n                 \n                  Post Office auditor EY under investigation by accounting regulator FRC\n                 \n                  Sir Alan Bates urges victims of Post Office scandal to take govt to court over compensation delays\n                 \"None of us are guaranteed how long we're going to be here. We just want people to see recognition as soon as possible.\" Ken Tooby's late wife June was a Capture victim. Ken is seriously ill in hospital so his family has sent a plea to the government to \"sort this Capture business asap\". June Tooby represented herself in court in 2003 and challenged the Post Office over its \"faulty\" software system. The evidence she compiled led to the Kroll investigation into Capture concluding there was a \"reasonable likelihood\" the software caused accounting errors. Another victim, who wanted to remain anonymous, told Sky News he was \"frustrated\" at the slow progress of redress, describing it as \"like pulling teeth\". He also raised concerns over interim payments potentially being \"too low\", claiming the government may be trying to \"keep people sweet\".  The Criminal Cases Review Commission (CCRC), meanwhile, is currently investigating 28 convictions and it's hoped decisions will be made over whether to refer cases to the Court of Appeal by the end of the year. Neil Hudgell, lawyer for Capture victims, said there was a \"positive dialogue\" at the latest meeting between government officials and families. \"The real frustration is the time it takes because of the processes that are involved,\" he said. \"I can see why it would take as long as it has. \"But [victims] just want peace and to see the end of it… There's a real acute need to bring matters to a close.\" On timescales, he said there were \"no guarantees\" but a \"guesstimate\" was that redress will start \"to flow… in the second half of the year\". Mr Hudgell said he would be \"disappointed\" if conviction cases have not been progressed by the CCRC by this autumn. \"I don't under emphasise the amount of work they've got - it involves multiple cases… I think they've got enough evidence now to start to formulate a decision,\" he said. A Department for Business and Trade spokesperson said: \"Postmasters have already endured immeasurable suffering, and we continue to listen to those who have been sharing their stories on the Capture system. \"Ensuring postmasters are treated with dignity and respect is our absolute priority. \"Officials met with postmasters [on Wednesday] as part of our commitment to develop an effective and fair redress process for those affected by Capture. \"We will continue to update on the development of the redress mechanism as it progresses.\""
    },
    {
        "title": "Augmented reality brings to life the stories of Victory in Europe Day 80 years ago",
        "description": "As the UK gears up to celebrate 80 years since VE day, Sky News can showcase the latest immersive technology that brings the experience to life in your own home. ",
        "url": "https://news.sky.com/story/augmented-reality-brings-to-life-the-stories-of-victory-in-europe-day-80-years-ago-13358789",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ve-day-ww2_6901941.jpg?20250430165558",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-30 15:34:00",
        "Headline": "A new immersive augmented reality experience lets people step into the stories behind photos from VE Day.",
        "Content": "As the UK gears up to celebrate 80 years since VE day, Sky News can showcase the latest immersive technology that brings the experience to life in your own home.  The Augmented Reality (AR) software, developed by Atlantic Productions and the Imperial War Museum, lets you explore the stories and hear the voices of those who were there. It puts photos from the day into your own environment and within each one you can hear powerful testimony and see the day from several different perspectives. Click here for the augmented reality experience (only on your smartphone) and then point the camera at a nearby surface like a table. Victory in Europe Day marked the end of the fighting in Europe, and was met with celebrations across the UK and on the continent. This year will mark its 80th anniversary with a number of events planned over the first May bank holiday. The images the experience lets you explore include Through The Eyes Of A Child, a moving picture of children in Battersea, South London, clinging onto Union Jacks. \n                  VE Day 2025: What are the four-day celebrations to mark 80th anniversary?\n                 \n                  Pub hours extended for 80th VE Day celebrations in May\n                 \n                  VE Day: Britons urged to celebrate 80th anniversary with street parties as flypast, processions and concerts planned\n                 Another of the pictures is titled The Toll Of War, an image of a war cemetery in Minturno, Italy, where three people talk through the stories behind the image. \"Through historical audio recordings, audiences can step into these pivotal scenes, hearing firsthand the diverse experiences of a generation who witnessed both the joy of peace and the uncertainty of a world still in transition,\" Atlantic Productions, which developed the experience, said in a statement."
    },
    {
        "title": "'De minimis': The rarely-examined trade clause about to become a very big deal ",
        "description": "The thing about trade, and the economics of trade, is that it is simultaneously desperately boring and desperately important.",
        "url": "https://news.sky.com/story/de-minimis-the-rarely-examined-trade-clause-about-to-become-a-very-big-deal-13358896",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-shein-china_6902118.jpg?20250430204354",
        "type": "Home",
        "Author": "Ed Conway",
        "Date Published": "2025-04-30 19:11:00",
        "Headline": "There's a long and detailed set of discussions that have bored on for decades about the pros and cons of this scheme. Now, the US is set to scrap it altogether - and nobody knows what will happen next. ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  The thing about trade, and the economics of trade, is that it is simultaneously desperately boring and desperately important. For example, consider a little bit of legal small print no one spent all that much time thinking about until recently - a clause in most countries' customs arrangements known as \"de minimis\". The idea behind de minimis is quite simple. Collecting customs can be an expensive business. You need to employ lots of people to check goods, police the system and collect the relevant customs and tariffs. In theory, you could fund that via the customs you're charging people to import goods into the country. But what if the items you're imposing tariffs and charges on are so cheap that it makes no economic sense to actually impose those charges? Consider a £5 t-shirt of the kind you might order from an online retailer such as Shein. In theory, that garment should face a 20% tariff when it arrives from China into the UK. \n                  US and Ukraine sign deal to establish investment fund\n                 \n                  Donald Trump: Fact-checking the president's speech in Michigan\n                 \n                  Is Trump just winging his foreign policy?\n                 But since 20% of a small number is an even smaller number, most customs authorities, including those in the UK, have taken the stance of essentially excluding any cheap imports from paying customs. This is the 'de minimis' rule. There are similar rules in most countries, with the main difference being the threshold at which they kick in. Here in Britain, de minimis applies to anything worth less than £135. In the US the threshold at which you start paying customs charges is higher: $800. Now, there's a long and detailed set of discussions that have bored on for decades about the pros and cons of this scheme. The historic arguments against collecting those fees were that a) doing so probably cost more money than it would raise, b) scanning and checking every import would jam up ports and airports unnecessarily and c) it might have a bearing on the wider economy as it throws further sand in the wheels of commerce. But in recent years, a host of mostly Chinese retailers have exploited the de minimis rule to ship (actually, mostly to fly) cheap products to the US, UK, Europe and beyond. The most visible of these companies are Shein and Temu. By directly flying consignments of very cheap clothes and consumer goods to airports in the west, they have been able to undercut other companies without having to pay customs fees. All of which is why, alongside the host of other tariffs imposed in recent weeks, Donald Trump is also doing something else - eliminating America's de minimis rules altogether. At least, that's the plan. Having pledged to do so in February, the administration rapidly reversed the decision after consignments began to pile up at US airports. However, the impending rule, which is due to kick in this Friday, sounds like it might be more concrete than the last one. And, if it's actually imposed, tariffs of 145% will be imposed on goods that, once upon a time, didn't face any tariffs at all. Which is a very big deal indeed. Already, prices on websites including Shein have begun to increase. Consumers have begun to abandon the sites' apps. And consignments of goods bound for the US from China have begun to slow. The real question is what happens next. Does the White House U-turn again? Or does it stand firm? Even as American consumers see the cost of their hitherto cheap goods rise, and potentially even face empty supermarket shelves, the notion of which was summoned up by a delegation of retail chiefs who met with the president last week. The short answer, as with so much about the current US administration is: no one really knows, and if they say they do, don't believe them."
    },
    {
        "title": "Footage of alleged moment 'Sycamore Gap tree was felled' shown to jurors in trial of two men",
        "description": "Mobile phone footage allegedly showing the moment the famous Sycamore Gap tree crashed to the ground to the sound of a chainsaw has been played to jurors.",
        "url": "https://news.sky.com/story/footage-of-alleged-moment-sycamore-gap-tree-was-felled-shown-to-jurors-in-trial-of-two-men-13358658",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-sycamore-gap-tree-last_6901601.jpg?20250430130118",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-30 12:15:00",
        "Headline": "Daniel Graham, 39, and Adam Carruthers, 32, each deny two counts of criminal damage to the tree and to Hadrian's Wall.",
        "Content": " Mobile phone footage allegedly showing the moment the famous Sycamore Gap tree crashed to the ground to the sound of a chainsaw has been played to jurors. Groundworker Daniel Graham, 39, and mechanic Adam Carruthers, 32, each deny two counts of criminal damage to the tree and to Hadrian's Wall overnight on 28 September 2023. Jurors at Newcastle Crown Court heard the tree was a \"totemic\" feature of Northumberland and was part of a place \"much loved by many thousands of people\". The video clip lasting two minutes and 40 seconds was recovered from Graham's phone and played to the court twice - once showing the dark, raw footage, and a second time after it had been enhanced by a police specialist. Police analyst Amy Sutherland told the court the video was in the download section of Graham's phone, which was taken from his jacket pocket. In the enhanced black and white version, with audio of wind blowing and a chainsaw buzzing, a figure can be seen working at the trunk of the tree, before it finally crashes to the ground. Richard Wright KC, prosecuting, said the original video was enhanced by changing the contrast, putting a border around the frame and brightening the film \"so it could be seen more clearly\". The prosecution alleges that the two friends travelled to the location in the pitch black during Storm Agnes and used a chainsaw to fell the sycamore, which then crashed on to Hadrian's Wall. The damage caused was valued at £622,191 for the tree and £1,144 to the Roman wall, which is a Unesco World Heritage Site. Messages between the two defendants Graham, of Carlisle, and Adam Carruthers, of Wigton, Cumbria, swapped messages on the morning of 28 September 2023 after word spread of the tree being felled, the court has heard. Police analyst Ms Sutherland took jurors through the messages between the pair. Graham said to Carruthers in one message: \"Not a bad angle on that stump\", adding: \"That's clearly a professional.\" A screenshot sent by Carruthers to Graham showed Facebook comments with a circle around one saying: \"Judging by the quality of the cut and size of tree I would say whoever it was has knowledge of how to fell large trees.\" The court heard there was another comment saying: \"Some weak people that walk this earth, disgusting behaviour.\" Jurors were played a voicenote from Graham to Carruthers saying: \"That comment. Weak... f****** weak? Does he realise how heavy s*** is?\"  Carruthers replied with his own voicenote, saying: \"I'd like to see [him] launch an operation like we did last night... I don't think he's got the minerals.\" The court heard Graham sent a voicenote to Carruthers using his nickname, saying: \"Jeffrey, it's gone viral, it's gone worldwide, it will be on ITV News tonight.\" Later, Graham sent another message saying: \"Jeffrey, it's on f****** Sky News as we speak.\" Carruthers sent Graham a video of the Sky News channel's rolling news banner. A statement by Tony Wilmott, a senior archaeologist with Historic England, said he produced a seven-page report into the damage caused to Hadrian's Wall. He said the Sycamore Gap name was coined in the 1980s, and over the decades it has become one of Northumberland's most appreciated features. He said: \"Its unmistakable profile has been repeated in many media and because of this it has become totemic. \"It has become a place of marriage proposals, family visits and even the location of ashes to be spread. \"The place is much loved by many thousands of people.\" Read more from Sky News:Now Co-op hit by cyber attack - live updatesWales to introduce same-day mental health care  The court heard a statement from archaeologist and inspector for Historic England, Lee McFarlane, that some of the stones in Hadrian's Wall were damaged when the tree was felled. The wall and the tree belong to the National Trust. The trial continues."
    },
    {
        "title": "King says cancer diagnosis is 'daunting' and 'frightening' experience",
        "description": "The King has shared his thoughts on the \"frightening experience\" of being among the thousands of people diagnosed with cancer every year.",
        "url": "https://news.sky.com/story/king-tells-of-frightening-experience-being-among-thousands-diagnosed-with-cancer-every-year-13358819",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-the-king-the-queen_6902046.jpg?20250430190432",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-04-30 16:15:00",
        "Headline": "Reflecting on his own cancer journey, he said it has \"certainly given me an even deeper appreciation of the extraordinary work undertaken by... remarkable organisations and individuals\".",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n The King has shared his thoughts on the \"frightening experience\" of being among the thousands of people diagnosed with cancer every year. The 76-year-old monarch praised the organisations that mean that \"the darkest moments of illness can be illuminated by the greatest compassion\". Writing ahead of a Buckingham Palace reception to recognise and celebrate \"the remarkable organisations and individuals\" who do so much for cancer patients and their families, the King said: \"Each diagnosis, each new case, will be a daunting and at times frightening experience for those individuals and their loved ones. \"But as one among those statistics myself, I can vouch for the fact that it can also be an experience that brings into sharp focus the very best of humanity.\" Reflecting on his own cancer journey, he added: \"It has certainly given me an even deeper appreciation of the extraordinary work undertaken by the remarkable organisations and individuals gathered here this evening, many of whom I have known, visited and supported over the years. \"And it has reinforced what I have long observed during these visits - that the darkest moments of illness can be illuminated by the greatest compassion\". Ending his message, the King paid tribute to Dame Deborah James, by \"echoing her final words\" - \"Find a life worth enjoying; take risks; love deeply; have no regrets; and always, always have rebellious hope.\" The podcaster and campaigner, whose frank accounts of life with bowel cancer sparked an extraordinary deluge of charity donations, died at the age of 40 in June 2022. The message is written in a booklet that has been given to all those attending the Cancer Support reception. It is an event that both the King and Queen were keen to host, both as patrons of many cancer-related organisations, but also as part of their ongoing work to highlight the impact of cancer on people across the UK. The added emphasis on this side of the King's work has undoubtedly been spurred on by his own experience. Read more from Sky News:Trial shown footage of 'moment Sycamore Gap tree felled'Body found in Thames identified as missing 11-year-old girl In his annual Christmas message, the King specifically thanked the medical staff who supported him and the Princess of Wales last year. 'The most difficult of times' In his written message on Wednesday, he added to those sentiments, saying: \"What strikes us repeatedly is the profound impact of human connection - whether in the careful explanation from a specialist nurse, the hand held by a hospice volunteer, or the shared experience in a support group. \"These moments of kinship create what I might call a 'community of care', one that sustains patients through the most difficult of times.\"  Over 1,000 new cancer cases each day To highlight the scale of the need for help, the King also refers to the \"390,000 people who, sadly, receive a new cancer diagnosis across the UK each year. That is over 1,000 new cases every single day\". Since he was diagnosed last year, he has deliberately wanted to be open about his cancer journey, and we know that his treatment is still ongoing. However, he has avoided saying what kind of cancer he has, palace sources partly putting that down to the fact that he doesn't want one type of cancer to appear more significant or attract more attention than others. He has hoped to show that everyone's experiences can be different but no less challenging than others. Should King be even more open? Some have argued that as head of state, he should be even more open about his condition. Among the guests at the reception was the actor Richard E Grant, a friend of the King, who has spoken of the monarch's kindness towards his wife shortly before she died of cancer. Former footballer Ashley Cain, whose eight-month-old daughter lost her life to leukaemia, was also there along with the parents of Dame Deborah James, Alistair and Heather James, and TV presenter Lorraine Kelly and members of the Change + Check Choir."
    },
    {
        "title": "Harvey Weinstein accuser felt 'the unthinkable was happening' during alleged assault ",
        "description": "A former TV production assistant has told a court she felt \"the unthinkable was happening\" during an alleged assault by Harvey Weinstein.",
        "url": "https://news.sky.com/story/harvey-weinstein-accuser-felt-the-unthinkable-was-happening-during-alleged-assault-13358814",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-weinstein-new-york_6901988.jpg?20250430174203",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-30 16:19:00",
        "Headline": "Miriam Haley - who also testified at the former movie mogul's initial trial - has accused Harvey Weinstein of forcing himself on her in July 2006. ",
        "Content": "A former TV production assistant has told a court she felt \"the unthinkable was happening\" during an alleged assault by Harvey Weinstein. Warning: This article contains references to sexual assault Miriam Haley is the first of the former movie mogul's accusers to testify at his retrial, which is taking place as New York's highest court overturned Weinstein's 2020 conviction. The former studio boss, 73, has pleaded not guilty to one charge of rape and two of forcing oral sex. He denies sexually assaulting anyone. Ms Haley, who also goes by the name Mimi Haleyi, today told the court Weinstein held her down and forced oral sex on her after she told him: \"No, no - it's not going to happen.\" She dabbed her eyes as she recalled in court what went through her mind during the alleged July 2006 assault. \"The unthinkable was happening, I just thought any unthinkable thing could happen,\" she said. \"I just didn't know where it ended.\" Weinstein, sitting between his lawyers, shook his head as she spoke. Ms Haley also testified at Weinstein's initial trial. She began her testimony yesterday by describing how she got to know Weinstein, saying she had some inappropriate and suggestive interactions with him, while others were polite and professional. Ms Haley maintains she was always looking to forge a professional connection - not sex or romance - with the Miramax founder. Read more: What has happened to the #MeToo movement? Weinstein's lawyers are yet to question Ms Haley, but the defence has sought, often unsuccessfully, to object to prosecutors' questions, such as whether Ms Haley had any sexual interest in the then-powerful producer. She said she did not. The defence has argued that all of Weinstein's accusers consented to sexual activities with him in the hopes of getting work in show business. The 73-year-old's retrial includes charges based on allegations from Haley and Jessica Mann, an actress who alleges Weinstein raped her in 2013. For the first time, he is also being tried on an allegation of forcing oral sex on a former model, Kaja Sokola, in 2006."
    },
    {
        "title": "Serial paedophile Richard Burrows 'used every single quality for evil purposes', says abuse victim",
        "description": "A man abused by Richard Burrows as a child has told Sky News he is grateful that \"finally\" the serial paedophile \"can't escape from what he's done\" after being jailed for 46 years.",
        "url": "https://news.sky.com/story/serial-paedophile-richard-burrows-used-every-single-quality-for-evil-purposes-says-abuse-victim-13358777",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-james-harvey-child-abuse_6901893.jpg?20250430161342",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-30 15:02:00",
        "Headline": "Victim James Harvey told Sky News he was \"grateful to everybody who has been involved\" in getting Richard Burrows to court. The sex offender has now been jailed for 46 years.",
        "Content": " A man abused by Richard Burrows as a child has told Sky News he is grateful that \"finally\" the serial paedophile \"can't escape from what he's done\" after being jailed for 46 years. Burrows, an 81-year-old former boarding school housemaster and scout leader, spent 27 years on the run in Thailand before he was arrested at Heathrow Airport last year. Before his trial, he admitted 43 offences - including indecent assault of boys, making indecent images of children, possession of indecent images of children and four counts of possession of false identity documents with intent. Burrows denied 54 others, which jurors at Chester Crown Court convicted him of last month. Those offences include indecent assault of boys, buggery, attempted buggery and indecency with a child. James Harvey was befriended by Burrows through his involvement with the sea scouts. Burrows admitted indecently assaulting James in a caravan after visiting an RAF show. Mr Harvey has waived his right to anonymity as a victim of a sexual offence. He told Sky's chief North of England correspondent Greg Milam on Wednesday that he was \"grateful to everybody who has been involved in getting him [Burrows] to court. For all of the victims, many of whom have died since they knew him, some of whom were in court. The police, the court system, over 40 years\". \n                  Inside police efforts to crack down on violent and knife crime in Manchester\n                 \n                  Two children from Gaza enter UK for specialist medical care for first time after months of struggle\n                 \n                  Capture: Victims of second Post Office scandal to receive 'recognition' payments before compensation\n                 Mr Harvey said Burrows will be spending \"a very, very long time in prison\". Read more:Richard Burrows jailed for child sexual abuse offencesDecades on the beach - sex offender's life in hiding During the trial, Mr Harvey faced his perpetrator in court as he gave his statement, seeing him for the first time since the mid-1970s. He said he made eye contact with Burrows as he was leaving court during one of the breaks. 'I felt nothing' Mr Harvey told Greg Milam: \"He didn't recognise me and that was almost confirmation that all of us, all of the boys whose lives he's affected, meant nothing to him. \"They were just objects for him to use for his pleasure and that every single quality that he had in his life he used for evil purposes. So I felt nothing.\" Mr Harvey also said it was \"difficult to listen to the things that he's done to all of those children, many of them much, much worse than what I had done to me. Some of them my friends\". He said it had taken tens of thousands of hours to \"prove that this man is what he is. He's a paedophile\". \"And he spent his whole life trying to get access to young children.\" He added that everybody who knew him, from his family, his friends, his colleagues, \"when they think of his name will think paedophile and that's what he is\". \"I don't waste my energy thinking about what he is as a person, he's a paedophile and that defines him forever.\"  The trial heard that Burrows had obtained positions of authority and systematically abused 24 boys from the 1960s to the mid-1990s. He had worked as a housemaster at a school for vulnerable children and befriended other youngsters through amateur radio clubs. Burrows was initially charged in May 1997 but failed to attend a hearing later that year. He remained on the wanted list until police using facial recognition software matched him to a man using the name Peter Smith. He had stolen the identity of a terminally ill friend to obtain a passport. Burrows described \"living in paradise\" in emails found after his eventual arrest, written after he fled to Thailand."
    },
    {
        "title": "Inside police efforts to crack down on violent and knife crime in Manchester",
        "description": "\"I'd say the last two years people are just - they just don't care anymore, they are using knives and doing all sorts.\"",
        "url": "https://news.sky.com/story/inside-police-efforts-to-crack-down-on-violent-and-knife-crime-in-manchester-13358702",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gmp-police-crime-manchester_6901945.jpg?20250430165723",
        "type": "UK",
        "Author": "Katerina Vittozzi",
        "Date Published": "2025-04-30 13:22:00",
        "Headline": "Sky News spent two months watching officers in Greater Manchester Police's  Operation Venture unit as they try to tackle knife and violent crime on the city's streets.",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n  \"I'd say the last two years people are just - they just don't care anymore, they are using knives and doing all sorts.\" PC Maguire, 28, speaks with the authority of experience: experience that comes from working in Greater Manchester's most high-crime areas. \"I remember when I was a teenager,\" she says, \"you'd never really hear of people carrying a knife or anything. But now it's the normal thing to do.\" \"It's mad,\" she adds. PC Maguire is part of Operation Venture, an elite policing unit within Greater Manchester Police set up to tackle serious violence and knife crime. Over the past two months, we've been given exclusive access to watch them work. Moped chase We're on a Friday afternoon vehicle patrol in south Manchester with another member of the Venture team, Sgt Mohammed Waqas, when his radio, and that of fellow officer PC Hodge, who's driving, starts pinging. Their plain clothes team has spotted two youths in balaclavas, on a moped, weaving in and out of traffic. \"We suspect they are involved in some sort of knife-point robberies,\" Sgt Waqas says. The moped has also had its registration plates pulled off - officers suspect it's been stolen. The team starts searching the streets and is flagged down by a passing driver who says he's just had to swerve to avoid hitting a moped. \"They're little idiots, up there!\" the driver says, visibly angry. \"There are kids around. \"I swear to god I felt like f*****g chasing them down, and kicking them up the arse.\" Meanwhile, the unit's covert officers are waiting where the moped has been previously spotted. When it returns, a short while later, there are three youths onboard. The team detain one, a 16-year-old who is known to them, but the two other youths get away. Sgt Waqas and PC Hodge take up the chase, following the moped at speed as it runs red lights. Incredibly, we see one of the moped riders filming it all on their mobile phone. Later, the officers tell us: \"They'll probably post it online.\" But right now, they are focused on trying to catch them, which, in rush hour traffic, proves impossible. They lose them - \"yeah, total loss\", Sgt Waqas reports via his radio to the comms operator. \"Just to log as well,\" he adds, \"two males, white males, both got balaclavas on.\" \"One of them has possibly got something in his jacket. Can't tell what it is, just the way that he was holding himself.\" It's extremely frustrating for the team. A baby buggy, a knife and £50,000 cash A few hours later, during a patrol in Salford, we see the sorts of weapons they are up against. We're with PC Maguire again, on vehicle patrol, when a police camera flags a car with links to suspected drug supply. Along with another of the unit's patrol cars, PC Maguire works to get into a formation to box in the suspect's vehicle. \"XR2, show me as Car two,\" PC Maguire tells a radio operator, having quickly made ground to get the vehicle in her sights. \"You want to get a stop on, before they have an opportunity to get away,\" she explains. But, after a brief pursuit through the dark streets, the car they are following pulls over of its own accord. The driver, who's in his 20s, is searched - as is his vehicle. Inside, along with baby buggies and car seats, officers find a knife in the glovebox and a shoebox full of cash. Read more from Sky News:Serial paedophile jailed for 46 yearsFootage of alleged Sycamore Gap tree fellingUK joins US in strike on Houthi target in Yemen Officers estimate there's about £50,000 in there. After brief questioning on site, the man tells officers that he's been staying at a house nearby and admits there's another weapon in there. A few minutes later, PC Ben Cartledge - another Operation Venture officer - comes out holding what looks like a huge knife. \"It's a machete,\" he says, \"it was in the bedroom.\" It's extremely heavy and looks terrifying. \"I'm not going to lie to you, mate, it's for protection only,\" the arrested man says, when PC Cartledge arrests him on a further offence of having an offensive weapon in a private place. It's a line officers have heard before. \"There's that social media side of it,\" a senior officers says. \"Sometimes they'll film themselves doing the robbery and sharing it around, and that becomes the normality. \"So then people will sometimes carry weapons to protect themselves.\" The unit uses a combination of proactive stop and search, intelligence-led policing and undercover tactics. It's why we can name officers but sometimes not show faces."
    },
    {
        "title": "Two children from Gaza enter UK for specialist medical care for first time after months of struggle",
        "description": "It was a welcome party of sorts, and it was assembled near arrivals at Heathrow's Terminal 5.",
        "url": "https://news.sky.com/story/two-children-from-gaza-enter-uk-for-specialist-medical-care-for-first-time-after-months-of-struggle-13359013",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-children_6902265.jpg?20250501013037",
        "type": "UK",
        "Author": "John Sparks",
        "Date Published": "2025-04-30 23:58:00",
        "Headline": "Until now, not a single child from Gaza has entered the UK for medical care, and the process has not been an easy one for the volunteers at Project Pure Hope. They told Sky News it has taken 17 months to arrange temporary visas for the two children.",
        "Content": "\n          International correspondent\n              @sparkomat\n It was a welcome party of sorts, and it was assembled near arrivals at Heathrow's Terminal 5. A few people clutched flowers, others brought presents, while everyone carried a sense of relief. Two children from Gaza had been given permission to enter Britain for specialist medical care and the pair would arrive on the evening flight from Cairo. It was a significant moment - the first time UK visas had been granted to children from this war-ravaged enclave - and the product of months of struggle by a small group of British volunteers. As those in attendance offered up a cheer, a five-year-old called Ghena Abed emerged shyly from behind the security gates. With fluid pressing on her optic nerve, she needs urgent treatment to save the vision in her left eye. Also in this party was a 12-year-old girl called Rama Qudiah. She is weak and malnourished and suffers from incontinence. Medics think she requires an operation on her bowel. Her mother, Rana, told us their arrival in Britian \"is just a like a dream\". Her daughter has certainly been fortunate. A small number of children from Gaza have benefited from medical evacuations, with the majority receiving care in countries in the Middle East, Europe, as well as the United States. In March, the Israelis signed a deal with Jordan which could allow 2,000 children to leave the enclave for treatment of war injuries and conditions like cancer. However, just 29 were allowed to go at first instance. The process has not been easy Until now, not a single child from Gaza has entered the UK for medical care since the start of the current conflict, and the process has not been an easy one for the volunteers at Project Pure Hope. They told Sky News it has taken 17 months to arrange temporary visas for Ghena and Rama. \"A lot of us are health care workers and I think it's in our DNA that when we see people who are suffering, particularly children, we want to try and do something and that's what motivated us,\" says Dr Farzana Rahman from Project Pure Hope. When asked why she thinks it has taken so much time to secure their visas, Dr Rahman said: \"I don't know.\" Group argues it has no time to lose to help other children But it is clear the arrival of children from Gaza is an issue of sensitivity. The British volunteers told us on a number of occasions that all costs would be met by private sources. The children will return to Gaza when the treatment is completed. Project Pure Hope is not finished, however - group members have drawn up a list of other children they can help, and argue they have no time to lose. \"One of the hardest parts of trying to make progress in this area is that delays cost lives. A number of children have died who we haven't been able to help and this is an urgent situation and I think for all of us that's the hardest part,\" says Dr Rahman."
    },
    {
        "title": "Capture: Victims of second Post Office scandal to receive 'recognition' payments before compensation",
        "description": "The government will give 'recognition' payments to Post Office Capture victims before they receive full compensation.",
        "url": "https://news.sky.com/story/capture-victims-of-second-post-office-scandal-to-receive-recognition-payments-before-compensation-13358940",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-post-office-sign_6839861.jpg?20250225230217",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2025-04-30 20:24:00",
        "Headline": "One Capture victim told Sky News there has been \"quite a lot of progress\" in talks with the government - but there are still concerns over how long it's going to take for the compensation scheme to start. ",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n The government will give 'recognition' payments to Post Office Capture victims before they receive full compensation. Former sub-postmasters and their families who are entitled to redress have been told the initial amount, which is yet to be finalised, could be £10,000. Capture was a faulty computer system used by sub postmasters in the 1990s - before the Horizon scandal. A report last year found the software is likely to have caused errors in accounting. A redress scheme is currently being set up for those affected and could possibly be introduced by the end of the summer. Steve Marston, a Capture user who was convicted of stealing from his Post Office in 1996, describes \"quite a lot of progress\" at a government meeting but raised concerns over pace. He told Sky News: \"I'm more than happy that the compensation scheme is going to be put in place as quickly as possible. \n                  Post Office to unveil £1.75bn banking deal with big British lenders\n                 \n                  Post Office auditor EY under investigation by accounting regulator FRC\n                 \n                  Sir Alan Bates urges victims of Post Office scandal to take govt to court over compensation delays\n                 \"None of us are guaranteed how long we're going to be here. We just want people to see recognition as soon as possible.\" Ken Tooby's late wife June was a Capture victim. Ken is seriously ill in hospital so his family has sent a plea to the government to \"sort this Capture business asap\". June Tooby represented herself in court in 2003 and challenged the Post Office over its \"faulty\" software system. The evidence she compiled led to the Kroll investigation into Capture concluding there was a \"reasonable likelihood\" the software caused accounting errors. Another victim, who wanted to remain anonymous, told Sky News he was \"frustrated\" at the slow progress of redress, describing it as \"like pulling teeth\". He also raised concerns over interim payments potentially being \"too low\", claiming the government may be trying to \"keep people sweet\".  The Criminal Cases Review Commission (CCRC), meanwhile, is currently investigating 28 convictions and it's hoped decisions will be made over whether to refer cases to the Court of Appeal by the end of the year. Neil Hudgell, lawyer for Capture victims, said there was a \"positive dialogue\" at the latest meeting between government officials and families. \"The real frustration is the time it takes because of the processes that are involved,\" he said. \"I can see why it would take as long as it has. \"But [victims] just want peace and to see the end of it… There's a real acute need to bring matters to a close.\" On timescales, he said there were \"no guarantees\" but a \"guesstimate\" was that redress will start \"to flow… in the second half of the year\". Mr Hudgell said he would be \"disappointed\" if conviction cases have not been progressed by the CCRC by this autumn. \"I don't under emphasise the amount of work they've got - it involves multiple cases… I think they've got enough evidence now to start to formulate a decision,\" he said. A Department for Business and Trade spokesperson said: \"Postmasters have already endured immeasurable suffering, and we continue to listen to those who have been sharing their stories on the Capture system. \"Ensuring postmasters are treated with dignity and respect is our absolute priority. \"Officials met with postmasters [on Wednesday] as part of our commitment to develop an effective and fair redress process for those affected by Capture. \"We will continue to update on the development of the redress mechanism as it progresses.\""
    },
    {
        "title": "Footage of alleged moment 'Sycamore Gap tree was felled' shown to jurors in trial of two men",
        "description": "Mobile phone footage allegedly showing the moment the famous Sycamore Gap tree crashed to the ground to the sound of a chainsaw has been played to jurors.",
        "url": "https://news.sky.com/story/footage-of-alleged-moment-sycamore-gap-tree-was-felled-shown-to-jurors-in-trial-of-two-men-13358658",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-sycamore-gap-tree-last_6901601.jpg?20250430130118",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-30 12:15:00",
        "Headline": "Daniel Graham, 39, and Adam Carruthers, 32, each deny two counts of criminal damage to the tree and to Hadrian's Wall.",
        "Content": " Mobile phone footage allegedly showing the moment the famous Sycamore Gap tree crashed to the ground to the sound of a chainsaw has been played to jurors. Groundworker Daniel Graham, 39, and mechanic Adam Carruthers, 32, each deny two counts of criminal damage to the tree and to Hadrian's Wall overnight on 28 September 2023. Jurors at Newcastle Crown Court heard the tree was a \"totemic\" feature of Northumberland and was part of a place \"much loved by many thousands of people\". The video clip lasting two minutes and 40 seconds was recovered from Graham's phone and played to the court twice - once showing the dark, raw footage, and a second time after it had been enhanced by a police specialist. Police analyst Amy Sutherland told the court the video was in the download section of Graham's phone, which was taken from his jacket pocket. In the enhanced black and white version, with audio of wind blowing and a chainsaw buzzing, a figure can be seen working at the trunk of the tree, before it finally crashes to the ground. Richard Wright KC, prosecuting, said the original video was enhanced by changing the contrast, putting a border around the frame and brightening the film \"so it could be seen more clearly\". The prosecution alleges that the two friends travelled to the location in the pitch black during Storm Agnes and used a chainsaw to fell the sycamore, which then crashed on to Hadrian's Wall. The damage caused was valued at £622,191 for the tree and £1,144 to the Roman wall, which is a Unesco World Heritage Site. Messages between the two defendants Graham, of Carlisle, and Adam Carruthers, of Wigton, Cumbria, swapped messages on the morning of 28 September 2023 after word spread of the tree being felled, the court has heard. Police analyst Ms Sutherland took jurors through the messages between the pair. Graham said to Carruthers in one message: \"Not a bad angle on that stump\", adding: \"That's clearly a professional.\" A screenshot sent by Carruthers to Graham showed Facebook comments with a circle around one saying: \"Judging by the quality of the cut and size of tree I would say whoever it was has knowledge of how to fell large trees.\" The court heard there was another comment saying: \"Some weak people that walk this earth, disgusting behaviour.\" Jurors were played a voicenote from Graham to Carruthers saying: \"That comment. Weak... f****** weak? Does he realise how heavy s*** is?\"  Carruthers replied with his own voicenote, saying: \"I'd like to see [him] launch an operation like we did last night... I don't think he's got the minerals.\" The court heard Graham sent a voicenote to Carruthers using his nickname, saying: \"Jeffrey, it's gone viral, it's gone worldwide, it will be on ITV News tonight.\" Later, Graham sent another message saying: \"Jeffrey, it's on f****** Sky News as we speak.\" Carruthers sent Graham a video of the Sky News channel's rolling news banner. A statement by Tony Wilmott, a senior archaeologist with Historic England, said he produced a seven-page report into the damage caused to Hadrian's Wall. He said the Sycamore Gap name was coined in the 1980s, and over the decades it has become one of Northumberland's most appreciated features. He said: \"Its unmistakable profile has been repeated in many media and because of this it has become totemic. \"It has become a place of marriage proposals, family visits and even the location of ashes to be spread. \"The place is much loved by many thousands of people.\" Read more from Sky News:Now Co-op hit by cyber attack - live updatesWales to introduce same-day mental health care  The court heard a statement from archaeologist and inspector for Historic England, Lee McFarlane, that some of the stones in Hadrian's Wall were damaged when the tree was felled. The wall and the tree belong to the National Trust. The trial continues."
    },
    {
        "title": "Augmented reality brings to life the stories of Victory in Europe Day 80 years ago",
        "description": "As the UK gears up to celebrate 80 years since VE day, Sky News can showcase the latest immersive technology that brings the experience to life in your own home. ",
        "url": "https://news.sky.com/story/augmented-reality-brings-to-life-the-stories-of-victory-in-europe-day-80-years-ago-13358789",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ve-day-ww2_6901941.jpg?20250430165558",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-30 15:34:00",
        "Headline": "A new immersive augmented reality experience lets people step into the stories behind photos from VE Day.",
        "Content": "As the UK gears up to celebrate 80 years since VE day, Sky News can showcase the latest immersive technology that brings the experience to life in your own home.  The Augmented Reality (AR) software, developed by Atlantic Productions and the Imperial War Museum, lets you explore the stories and hear the voices of those who were there. It puts photos from the day into your own environment and within each one you can hear powerful testimony and see the day from several different perspectives. Click here for the augmented reality experience (only on your smartphone) and then point the camera at a nearby surface like a table. Victory in Europe Day marked the end of the fighting in Europe, and was met with celebrations across the UK and on the continent. This year will mark its 80th anniversary with a number of events planned over the first May bank holiday. The images the experience lets you explore include Through The Eyes Of A Child, a moving picture of children in Battersea, South London, clinging onto Union Jacks. \n                  VE Day 2025: What are the four-day celebrations to mark 80th anniversary?\n                 \n                  Pub hours extended for 80th VE Day celebrations in May\n                 \n                  VE Day: Britons urged to celebrate 80th anniversary with street parties as flypast, processions and concerts planned\n                 Another of the pictures is titled The Toll Of War, an image of a war cemetery in Minturno, Italy, where three people talk through the stories behind the image. \"Through historical audio recordings, audiences can step into these pivotal scenes, hearing firsthand the diverse experiences of a generation who witnessed both the joy of peace and the uncertainty of a world still in transition,\" Atlantic Productions, which developed the experience, said in a statement."
    },
    {
        "title": "Serial paedophile Richard Burrows 'used every single quality for evil purposes', says abuse victim",
        "description": "A man abused by Richard Burrows as a child has told Sky News he is grateful that \"finally\" the serial paedophile \"can't escape from what he's done\" after being jailed for 46 years.",
        "url": "https://news.sky.com/story/serial-paedophile-richard-burrows-used-every-single-quality-for-evil-purposes-says-abuse-victim-13358777",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-james-harvey-child-abuse_6901893.jpg?20250430161342",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-30 15:02:00",
        "Headline": "Victim James Harvey told Sky News he was \"grateful to everybody who has been involved\" in getting Richard Burrows to court. The sex offender has now been jailed for 46 years.",
        "Content": " A man abused by Richard Burrows as a child has told Sky News he is grateful that \"finally\" the serial paedophile \"can't escape from what he's done\" after being jailed for 46 years. Burrows, an 81-year-old former boarding school housemaster and scout leader, spent 27 years on the run in Thailand before he was arrested at Heathrow Airport last year. Before his trial, he admitted 43 offences - including indecent assault of boys, making indecent images of children, possession of indecent images of children and four counts of possession of false identity documents with intent. Burrows denied 54 others, which jurors at Chester Crown Court convicted him of last month. Those offences include indecent assault of boys, buggery, attempted buggery and indecency with a child. James Harvey was befriended by Burrows through his involvement with the sea scouts. Burrows admitted indecently assaulting James in a caravan after visiting an RAF show. Mr Harvey has waived his right to anonymity as a victim of a sexual offence. He told Sky's chief North of England correspondent Greg Milam on Wednesday that he was \"grateful to everybody who has been involved in getting him [Burrows] to court. For all of the victims, many of whom have died since they knew him, some of whom were in court. The police, the court system, over 40 years\". \n                  Inside police efforts to crack down on violent and knife crime in Manchester\n                 \n                  Two children from Gaza enter UK for specialist medical care for first time after months of struggle\n                 \n                  Capture: Victims of second Post Office scandal to receive 'recognition' payments before compensation\n                 Mr Harvey said Burrows will be spending \"a very, very long time in prison\". Read more:Richard Burrows jailed for child sexual abuse offencesDecades on the beach - sex offender's life in hiding During the trial, Mr Harvey faced his perpetrator in court as he gave his statement, seeing him for the first time since the mid-1970s. He said he made eye contact with Burrows as he was leaving court during one of the breaks. 'I felt nothing' Mr Harvey told Greg Milam: \"He didn't recognise me and that was almost confirmation that all of us, all of the boys whose lives he's affected, meant nothing to him. \"They were just objects for him to use for his pleasure and that every single quality that he had in his life he used for evil purposes. So I felt nothing.\" Mr Harvey also said it was \"difficult to listen to the things that he's done to all of those children, many of them much, much worse than what I had done to me. Some of them my friends\". He said it had taken tens of thousands of hours to \"prove that this man is what he is. He's a paedophile\". \"And he spent his whole life trying to get access to young children.\" He added that everybody who knew him, from his family, his friends, his colleagues, \"when they think of his name will think paedophile and that's what he is\". \"I don't waste my energy thinking about what he is as a person, he's a paedophile and that defines him forever.\"  The trial heard that Burrows had obtained positions of authority and systematically abused 24 boys from the 1960s to the mid-1990s. He had worked as a housemaster at a school for vulnerable children and befriended other youngsters through amateur radio clubs. Burrows was initially charged in May 1997 but failed to attend a hearing later that year. He remained on the wanted list until police using facial recognition software matched him to a man using the name Peter Smith. He had stolen the identity of a terminally ill friend to obtain a passport. Burrows described \"living in paradise\" in emails found after his eventual arrest, written after he fled to Thailand."
    },
    {
        "title": "King says cancer diagnosis is 'daunting' and 'frightening' experience",
        "description": "The King has shared his thoughts on the \"frightening experience\" of being among the thousands of people diagnosed with cancer every year.",
        "url": "https://news.sky.com/story/king-tells-of-frightening-experience-being-among-thousands-diagnosed-with-cancer-every-year-13358819",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-the-king-the-queen_6902046.jpg?20250430190432",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-04-30 16:15:00",
        "Headline": "Reflecting on his own cancer journey, he said it has \"certainly given me an even deeper appreciation of the extraordinary work undertaken by... remarkable organisations and individuals\".",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n The King has shared his thoughts on the \"frightening experience\" of being among the thousands of people diagnosed with cancer every year. The 76-year-old monarch praised the organisations that mean that \"the darkest moments of illness can be illuminated by the greatest compassion\". Writing ahead of a Buckingham Palace reception to recognise and celebrate \"the remarkable organisations and individuals\" who do so much for cancer patients and their families, the King said: \"Each diagnosis, each new case, will be a daunting and at times frightening experience for those individuals and their loved ones. \"But as one among those statistics myself, I can vouch for the fact that it can also be an experience that brings into sharp focus the very best of humanity.\" Reflecting on his own cancer journey, he added: \"It has certainly given me an even deeper appreciation of the extraordinary work undertaken by the remarkable organisations and individuals gathered here this evening, many of whom I have known, visited and supported over the years. \"And it has reinforced what I have long observed during these visits - that the darkest moments of illness can be illuminated by the greatest compassion\". Ending his message, the King paid tribute to Dame Deborah James, by \"echoing her final words\" - \"Find a life worth enjoying; take risks; love deeply; have no regrets; and always, always have rebellious hope.\" The podcaster and campaigner, whose frank accounts of life with bowel cancer sparked an extraordinary deluge of charity donations, died at the age of 40 in June 2022. The message is written in a booklet that has been given to all those attending the Cancer Support reception. It is an event that both the King and Queen were keen to host, both as patrons of many cancer-related organisations, but also as part of their ongoing work to highlight the impact of cancer on people across the UK. The added emphasis on this side of the King's work has undoubtedly been spurred on by his own experience. Read more from Sky News:Trial shown footage of 'moment Sycamore Gap tree felled'Body found in Thames identified as missing 11-year-old girl In his annual Christmas message, the King specifically thanked the medical staff who supported him and the Princess of Wales last year. 'The most difficult of times' In his written message on Wednesday, he added to those sentiments, saying: \"What strikes us repeatedly is the profound impact of human connection - whether in the careful explanation from a specialist nurse, the hand held by a hospice volunteer, or the shared experience in a support group. \"These moments of kinship create what I might call a 'community of care', one that sustains patients through the most difficult of times.\"  Over 1,000 new cancer cases each day To highlight the scale of the need for help, the King also refers to the \"390,000 people who, sadly, receive a new cancer diagnosis across the UK each year. That is over 1,000 new cases every single day\". Since he was diagnosed last year, he has deliberately wanted to be open about his cancer journey, and we know that his treatment is still ongoing. However, he has avoided saying what kind of cancer he has, palace sources partly putting that down to the fact that he doesn't want one type of cancer to appear more significant or attract more attention than others. He has hoped to show that everyone's experiences can be different but no less challenging than others. Should King be even more open? Some have argued that as head of state, he should be even more open about his condition. Among the guests at the reception was the actor Richard E Grant, a friend of the King, who has spoken of the monarch's kindness towards his wife shortly before she died of cancer. Former footballer Ashley Cain, whose eight-month-old daughter lost her life to leukaemia, was also there along with the parents of Dame Deborah James, Alistair and Heather James, and TV presenter Lorraine Kelly and members of the Change + Check Choir."
    },
    {
        "title": "On a dawn police raid, the case of Chris Kaba's shooting still lingers over armed officers",
        "description": "At a midnight briefing in Kentish Town police station in north London, officers are shown a photograph of Danny Downes, a large white man with a wispy beard, who has been linked to a shooting in the area.",
        "url": "https://news.sky.com/story/on-a-dawn-police-raid-the-case-of-chris-kabas-shooting-still-lingers-over-armed-officers-13358633",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-chris-kaba-met-police_6901640.png?20250430133433",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-04-30 14:20:00",
        "Headline": "Firearms officer Martyn Blake was charged with murdering Chris Kaba after he shot him during an attempt to stop a car in Brixton, in September 2022. He was acquitted, and now the police watchdog has said he should face a misconduct hearing.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n At a midnight briefing in Kentish Town police station in north London, officers are shown a photograph of Danny Downes, a large white man with a wispy beard, who has been linked to a shooting in the area. Swabs on a bullet casing found at the scene have come back with a match to his DNA. Intelligence suggests he keeps the gun at home. In the room are MO19 officers, colleagues of Martyn Blake, the firearms officer who was charged with murder after opening fire on the job. Blake was acquitted of murdering Chris Kaba last October, but with Wednesday's police watchdog decision to launch a gross misconduct hearing against Blake, the case still lingers over his unit. Police officers don't get paid anything extra for carrying a gun - what they get is the dangerous callouts, and a huge responsibility strapped to their shoulders. The Kentish town operation, like any shift, is another chance when shots could be fired and split-second risk assessments made in the moment could be scrutinised for months, even years, careers could go on hold with suspended officers publicly named as they go on trial. \n                  London 'is a safer place' without Chris Kaba, says Tory leadership hopeful Robert Jenrick\n                 \n                  Firearms officers accused of shooting someone dead will remain anonymous during trial, home secretary announces\n                 \n                  Colleague of Martyn Blake who shot Chris Kaba says public is less safe after officer's prosecution\n                 They could end up in prison for the most serious of crimes. \"Why risk it?\" many asked themselves during the Blake trial, and at one point, it was reported that up to 300 officers had turned in their firearms permits, allowing them to carry weapons. The burden of high accountability is what a firearms officer carries with them in their holster, and many would argue, not least the victims' families of police shootings, that is how it should be; the power to kill in the name of the state must be accompanied by the highest scrutiny. 'Crush the spirit of good officers' Some campaigners feel they are under-scrutinised and have a habit of being acquitted for their actions, but, after the Martyn Blake verdict the Met Commissioner, Mark Rowley, said the system for holding police to account was \"broken,\" adding \"the more we crush the spirit of good officers - the less they can fight crime\". In a statement on Wednesday, Assistant Commissioner Lawrence Taylor said: \"We know another lengthy process will fall heavily on the shoulders of NX121 (Blake's code name) and more widely our firearms officers who continue to bravely and tirelessly police the streets of London every day to protect the public.\" Chris Kaba's family said they welcomed the IOPC's decision, adding: \"We hope this leads to him being removed from the Met Police. What Martyn Blake did was deeply wrong.\" In the Kentish Town briefing room, plans for the operation are set out: room layouts, entry points, cordons, risk assessments. Then Derek Caroll, a specialist tactical firearms commander, tells the room why it is proportional that the planned dawn raid to arrest Downes should involve officers who carry guns. Caroll said: \"Clearly, he has used the firearm in a public place, so that's the reason armed officers have been deployed… the subject these officers are going to go up against has either immediate possession of a firearm or access to a firearm. \"Because there is a gun outstanding there is a potential risk - he has a propensity to fire the weapon.\" The point seems obvious and laboured, but the case of Martyn Blake and other shootings has made it clear that this stuff needs to be spelled out as often as possible. Sergeant Blake had been on a similar mission to these officers when he shot 23-year-old Chris Kaba. The death of Kaba in September 2022 He and other officers were involved in stopping an Audi Q8 used in a shooting in Brixton. Arguably, there are more variables trying to stop a car than in a dawn house raid where suspects are usually asleep. With car stops, they can see you coming, it's not always clear who is driving, and the vehicle itself can be used as a weapon. All of this played out in the attempted hard stop of the Audi Q8 in September 2022. An unmarked police car was following the vehicle when it turned a corner and Blake's marked vehicle blocked its path. Officers didn't know Kaba was driving the car, and with armed officers now on foot, Kaba tried to ram his way out. Seconds later, he was shot by a single round through the windscreen. The police watchdog referred Sergeant Blake to the CPS, and he was charged with murder. In court, he argued that he had opened fire because it was his genuinely held belief that the driver posed an imminent threat to life and in October last year, the jury found him not guilty. After the verdict, it emerged that days before he was shot, Chris Kaba himself was alleged to have shot someone in a nightclub, chasing his victim outside, shooting him again. 'Gung-ho' behaviour Equality activist Stafford Scott believes the killing of Chris Kaba is part of a pattern of what he called \"gung-ho\" behaviour from Metropolitan Police officers against black men. He feels the hard stop was an unnecessarily \"reckless\" tactic. He lists other shooting victims such as Jermaine Baker and Mark Duggan and blames \"institutional racism\" within the force - pointing to the matching findings of the McPherson report of 1999 and the more recent Lousie Casey Inquiry in 2023, which both made damning conclusions about police racism. The prosecution in Blake's case didn't argue that racism played a part in the shooting, but having watched the trial, Scott says it left many questions. \"What we have again is this notion of 'honestly held belief' and that's why we are going to the European courts because we won't get justice in this system - 'honestly held belief' must be rational,\" he says. \"And let's remember there was all this stuff in the media afterwards about what Chris Kaba did before he was shot, but at the time Martyn Blake shot Chris Kaba he didn't even know it was Chris Kaba behind the wheel. He didn't know who it was.\" These arguments, and what happened at the scene, will again be played out in a misconduct hearing, which requires a lower threshold of proof than criminal proceedings and could lead to Blake being sacked from the force. Like tiptoeing armadillos In the operation in Kentish Town, for the officers strapping on their Sig MCXs and holstering their Glocks, the last thing they want is to have to use them. They are trained to only open fire if they believe there is a risk to life, and a large part of their training is also in first aid, be that on victims they find at the scene - or on someone who they have felt compelled to shoot themselves. It is a surreal scene as these heavily tooled-up officers in helmets and body armour stalk through the everyday scene of a dark council estate then, like tiptoeing armadillos, they quietly shuffle up the stairwell with their forcible entry tool kit. The door is busted down in seconds to the shouts of \"armed police!\" and after loud negotiations at gunpoint, the highly overweight figure of Downes is brought out and cuffed in his boxer shorts. The man is so large, it leads to serious debriefing questions afterwards about what to do if a subject is too big to get out of the door and even taking him downstairs is done by bum shuffle. \"There was a knife in a sheet under one of the beds,\" says one of the arresting officers to his commander, \"and then the firearm found down the side of the sofa, which is quite readily available to the subject.\" \"We got him, no shots fired, and we can be nothing but happy with that,\" responds the Commander. Success is 'where shots aren't fired' Afterwards, Commander Caroll tells Sky News: \"It's a satisfaction getting the gun back - but unfortunately, there's guns out there and we are doing these jobs very regularly. \"We get a gun off the street. We get the person arrested and as with every firearms operation - every successful firearms operation, for the Met and for the country - is one where shots aren't fired.\" Out of 4,000 operations a year, shots are only fired once or twice, but whenever they are, questions will always be asked. There is a balance between rigorous accountability for the officer, a process of justice for bereaved families and the impact it may have on policing if officers fear their names could become known in criminal networks after they shot a gang member or if someone's \"honestly held belief\" is not enough to keep them from jail. Campaigners and members of Chris Kaba's family say the Blake verdict shows that officers can kill without consequence - his colleagues say he has already paid a heavy price for doing what he is trained to do. When they are not on operations to seize guns, MO19 officers patrol London poised to deal with stabbings, shootings and terrorist attacks - there's little doubt the public wants them to keep doing that. Read more from Sky News:Footage of alleged felling of Sycamore Gap treeSerial paedophile jailed for 46 yearsMan charged over incident at Israeli embassy Downes, 23, has since pleaded guilty to possession of a firearm with intent to cause fear of harm and possession of a Class B substance. He is due to be sentenced in June."
    },
    {
        "title": "Firearms officer cleared of murdering Chris Kaba to face gross misconduct hearing, after watchdog review",
        "description": "The officer cleared of murder after shooting dead Chris Kaba will face a gross misconduct hearing, following a review by the police watchdog.",
        "url": "https://news.sky.com/story/firearms-officer-cleared-of-murdering-chris-kaba-to-face-gross-misconduct-hearing-after-watchdog-review-13358495",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-chris-kaba-trial_6704485.jpg?20241002204928",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-30 07:15:00",
        "Headline": "Sergeant Martyn Blake shot Mr Kaba through the windscreen of his Audi as he tried to escape from police. ",
        "Content": " The officer cleared of murder after shooting dead Chris Kaba will face a gross misconduct hearing, following a review by the police watchdog. The 24-year-old's family welcomed the decision, saying they hope it leads to sergeant Martyn Blake, 41, being sacked from the Metropolitan Police. Mr Kaba, who was not armed, had both hands on the steering wheel of his vehicle when he was shot in the head by the firearms officer in Streatham, south London, on 5 September 2022. A helicopter and six police cars were involved in stopping Mr Kaba after the Audi Q8 he was driving had been linked to a shooting outside a school in nearby Brixton the previous evening. Mr Kaba had turned into Kirkstall Gardens, where Mr Blake was inside a marked police BMW, before trying to make his escape. The murder trial hinged on the following 17 seconds, when Mr Kaba reversed a short distance, hitting an unmarked police car behind, then accelerated forward, reaching an estimated 12mph before colliding with the BMW and a parked Tesla. Armed officers were heard shouting \"go, go, go\" and \"armed police, get out of the f***ing car,\" as they surrounded Mr Kaba's vehicle in footage played in court. \n                  Inside police efforts to crack down on violent and knife crime in Manchester\n                 \n                  Two children from Gaza enter UK for specialist medical care for first time after months of struggle\n                 \n                  Capture: Victims of second Post Office scandal to receive 'recognition' payments before compensation\n                 Mr Kaba then reversed at 8mph, hitting the unmarked Volvo behind, and was stationary as Mr Blake pulled the trigger of his gun less than a second later, followed by shouts of \"shots fired\" and \"where from?\" He died in hospital in the early hours of the next day after the bullet travelled through the windscreen and struck him in the head. Speaking after Mr Blake was cleared of murder in October, Met Police Commissioner Sir Mark Rowley said the officer made a split-second decision on what he thought was necessary \"to protect his colleagues and to protect London\". Prosecutors had argued Mr Blake may have \"become angry, frustrated and annoyed\" and Mr Kaba had done nothing in the seconds before he was shot to justify his decision to pull the trigger. The officer said he didn't intend to kill Mr Kaba, adding: \"I had a genuine belief that there was an imminent threat to life, I thought one or more of my colleagues was about to die.\"  The jury - which was not told Mr Kaba was a core member of a notorious south London gang who was suspected of carrying out a nightclub shooting - deliberated for about three hours before finding Mr Blake not guilty of murder. But the Independent Office for Police Conduct (IOPC) said he will face a gross misconduct hearing after a \"thorough review\" of all the evidence in the case. The threshold is a lower test than for criminal proceedings and a police disciplinary panel will decide whether misconduct is proven or not. IOPC director Amanda Rowe said: \"We understand the impact this decision will have on Chris Kaba's family and Sergeant Blake and acknowledge the significant public interest in this case, particularly among our black communities, firearms officers and the wider policing community. \"This is a decision we have taken based on examining all the evidence, views of all parties and by applying the thresholds set out in legislation and guidance which govern our work. \"The legal test for deciding whether there is a case to answer is low - is there sufficient evidence upon which, on the balance of probabilities, a disciplinary panel could make a finding of misconduct. This has been met and therefore we need to follow the legal process.  \"We appreciate that the Home Office is carrying out a review of the legal test for the use of force in misconduct cases, however, we must apply the law as it currently stands.\" Mr Kaba's family vowed they \"won't be silenced\" and would continue fighting for \"justice and for real change\" following the verdict. In a statement issued through the charity Inquest after the IOPC's decision, they said: \"We hope this leads to him being removed from the Met Police. \"What Martyn Blake did was deeply wrong. We are still so devastated to have lost Chris - this should never have happened. \"The fact that the Met promoted Martyn Blake after the verdict only deepened our pain and showed a complete disregard for our loss. \"Martyn Blake should not be allowed to remain a police officer. He should lose his job.\" The Met said the force made \"strong representations\" that Mr Blake, who they referred to by the cypher NX121 used before a judge lifted an anonymity order, should not face any further action. Assistant Commissioner Laurence Taylor said: \"We know any fatal use of force by police understandably prompts concern among communities. \"NX121 made a split-second decision on what he believed was necessary to protect his colleagues and London and a jury unanimously decided that was an honestly-held belief and the force used was reasonable. \"However, the IOPC has now determined that NX121 has a case to answer for his use of force and has directed us to hold a gross misconduct hearing. \"We know another lengthy process will fall heavily on the shoulders of NX121 and more widely our firearms officers, who continue to bravely and tirelessly police the streets of London every day to protect the public.\" Mr Taylor said the Met will ask a chief officer from another force to chair the hearing to ensure independence. Home Secretary Yvette Cooper has ordered a review into the accountability of firearms officers. Some of the force's firearms officers turned in their weapons in protest after Mr Blake was charged with murder and the IOPC's decision caused more anger among the rank and file. Matt Cane, general secretary of the Metropolitan Police Federation that represents them, said: \"This is frankly a nonsensical ruling by the IOPC that will shock police officers across London and indeed the country. \"Police officers should not have their livelihoods or liberty put at risk for performing what unequivocally, as has been found in a court of law, is their lawful and appropriate function. \"And yet putting this brave officer on trial for murder - as astonishing as that was - was not enough for the IOPC.\" Mr Blake is only the fourth police officer to be charged with murder or manslaughter over a fatal police shooting in England and Wales since 1990, while a total of 83 people have died in such incidents, according to the Inquest charity. In that time, only one on-duty officer, Benjamin Monk, has been found guilty of manslaughter - over the death of former Aston Villa striker Dalian Atkinson, 48 - while none have been convicted of murder."
    },
    {
        "title": "Body found in River Thames identified as missing 11-year-old Kaliyah Coa, police say",
        "description": "A body found in the River Thames is that of an 11-year-old girl who went missing while playing near a causeway in east London, police have said.",
        "url": "https://news.sky.com/story/body-found-in-river-thames-identified-as-missing-11-year-old-kaliyah-coa-police-say-13358812",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kaliyah-coa-met-police_6873822.jpg?20250402125249",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-30 16:14:00",
        "Headline": "In a statement, Kaliyah's family said: \"Our hearts are broken and our lives will never be the same.\"",
        "Content": "A body found in the River Thames is that of an 11-year-old girl who went missing while playing near a causeway in east London, police have said. Officers launched a search after Kaliyah Coa went missing near Barge House Causeway in Woolwich during a school inset day on 31 March. The Metropolitan Police said they received a report of a body in the water in Maritime Quay on The Isle of Dogs, in east London, on 13 April. Formal identification was conducted on Tuesday, and confirmed to be Kaliyah. In a statement, Kaliyah's family said: \"Our hearts are broken and our lives will never be the same. We were blessed to have Kaliyah, even if it was for such a short time. She will be missed so much. Kaliyah went to a birthday party and never returned home to her family. \"The family would like to thank all those who were involved in the search and recovery of Kaliyah. \"We sincerely hope that everyone will respect our wishes to be given the space and time to grieve as a family.\" Detective Superintendent Scott Ware, who led the Met's investigation, added: \"This tragic accident took away a little girl who was loved by many. Our specialist officers will continue to support Kaliyah’s family as they process this heartbreaking news. \"I echo her family’s request for privacy while they navigate the difficult road ahead, and urge the public to refrain from wholly inaccurate speculation both on and offline.\" Barge House Causeway, near where the 11-year-old girl went missing, is a concrete slope that goes directly into the River Thames and is used to transport boats into the water. An inquest into Kaliyah’s death is set to open on Friday 2 May."
    },
    {
        "title": "Two children from Gaza enter UK for specialist medical care for first time after months of struggle",
        "description": "It was a welcome party of sorts, and it was assembled near arrivals at Heathrow's Terminal 5.",
        "url": "https://news.sky.com/story/two-children-from-gaza-enter-uk-for-specialist-medical-care-for-first-time-after-months-of-struggle-13359013",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-children_6902265.jpg?20250501013037",
        "type": "World",
        "Author": "John Sparks",
        "Date Published": "2025-04-30 23:58:00",
        "Headline": "Until now, not a single child from Gaza has entered the UK for medical care, and the process has not been an easy one for the volunteers at Project Pure Hope. They told Sky News it has taken 17 months to arrange temporary visas for the two children.",
        "Content": "\n          International correspondent\n              @sparkomat\n It was a welcome party of sorts, and it was assembled near arrivals at Heathrow's Terminal 5. A few people clutched flowers, others brought presents, while everyone carried a sense of relief. Two children from Gaza had been given permission to enter Britain for specialist medical care and the pair would arrive on the evening flight from Cairo. It was a significant moment - the first time UK visas had been granted to children from this war-ravaged enclave - and the product of months of struggle by a small group of British volunteers. As those in attendance offered up a cheer, a five-year-old called Ghena Abed emerged shyly from behind the security gates. With fluid pressing on her optic nerve, she needs urgent treatment to save the vision in her left eye. Also in this party was a 12-year-old girl called Rama Qudiah. She is weak and malnourished and suffers from incontinence. Medics think she requires an operation on her bowel. Her mother, Rana, told us their arrival in Britian \"is just a like a dream\". Her daughter has certainly been fortunate. A small number of children from Gaza have benefited from medical evacuations, with the majority receiving care in countries in the Middle East, Europe, as well as the United States. In March, the Israelis signed a deal with Jordan which could allow 2,000 children to leave the enclave for treatment of war injuries and conditions like cancer. However, just 29 were allowed to go at first instance. The process has not been easy Until now, not a single child from Gaza has entered the UK for medical care since the start of the current conflict, and the process has not been an easy one for the volunteers at Project Pure Hope. They told Sky News it has taken 17 months to arrange temporary visas for Ghena and Rama. \"A lot of us are health care workers and I think it's in our DNA that when we see people who are suffering, particularly children, we want to try and do something and that's what motivated us,\" says Dr Farzana Rahman from Project Pure Hope. When asked why she thinks it has taken so much time to secure their visas, Dr Rahman said: \"I don't know.\" Group argues it has no time to lose to help other children But it is clear the arrival of children from Gaza is an issue of sensitivity. The British volunteers told us on a number of occasions that all costs would be met by private sources. The children will return to Gaza when the treatment is completed. Project Pure Hope is not finished, however - group members have drawn up a list of other children they can help, and argue they have no time to lose. \"One of the hardest parts of trying to make progress in this area is that delays cost lives. A number of children have died who we haven't been able to help and this is an urgent situation and I think for all of us that's the hardest part,\" says Dr Rahman."
    },
    {
        "title": "Ransacked and looted: Sky reporter returns to family home left in ruins after war in Sudan",
        "description": "The biggest city in the Sahel has been ransacked and left in ruins.",
        "url": "https://news.sky.com/story/ransacked-and-looted-sky-reporter-returns-to-family-home-left-in-ruins-after-civil-war-in-sudan-13358232",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-sudan-khartoum_6901007.jpg?20250429181535",
        "type": "World",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-04-30 02:30:00",
        "Headline": "Sky's Africa correspondent Yousra Elbagir picks through the remains of her Khartoum family home that was taken by RSF troops who seized Sudan's capital in 2023.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  The biggest city in the Sahel has been ransacked and left in ruins. War erupted in Sudan's capital Khartoum in April 2023 and sent millions searching for safety. The city was quickly captured by the paramilitary Rapid Support Forces (RSF) after a power struggle with the Sudanese Armed Forces (SAF) for total control. At least 61,000 people were killed from the fighting and siege conditions in Khartoum state alone. Thousands more were maimed and many remain missing. The RSF fled Khartoum's neighbourhoods in caravans carrying the city's looted treasures as the army closed in and recaptured it after two years of occupation. 👉 Listen to Sky News Daily on your podcast app 👈 \n                  'Defiled and looted': Returning home during Sudan's civil war\n                 \n                  Sudan's paramilitary chief announces rival government of 'peace and unity'\n                 \n                  What does Sudan execution video tell us?\n                 The empty streets they left behind are lined with charred, bullet-ridden buildings and robbed store fronts. The once shiny skyscrapers built along the confluence of the River Nile are now husks of blackened steel. The neighbourhoods are skeletal. Generational homes are deserted and hollow. Trenches snake the streets where copper electric cables were ripped out of the ground and pulled out of lampposts now overridden with weeds. The majority of the 13 million people displaced by this war fled Khartoum. Many left in a rush, assuming it would only take a few weeks for peace to be restored. My parents were among those millions and in the midst of the abandoned, looted homes is the house where I grew up. A shell of a home I have to strain my eyes to see the turn to my house. All the usual markers are gone. There are no gatherings of young people drinking coffee with tea ladies in the leafy shade - just gaping billboard frames that once held up advertisements behind cars of courting couples parked by the Nile. Our garden is both overgrown and dried to death. The mango, lemon and jasmine trees carefully planted by my mother and brother have withered. The Bougainvillea has reached over the pathway and blocked off the main entrance. We go through the small black side door. Our family car is no longer in the garage, forcing us to walk around it. It was stolen shortly after my parents evacuated. The two chairs my mum and dad would sit at the centre of the front lawn are still there, but surrounded by thorny weeds and twisted, bleached vines. The neighbour's once lush garden is barren too. Their tall palm trees at the front of the house have been beheaded - rounding off into a greyish stump instead of lush fronds. Read more:How recaptured palace is a significant sign of return to orderSudan's paramilitary chief announces rival government Everyone in Khartoum is coming back to a game of Russian roulette. Searching out their houses to confirm suspicions of whether it was blasted, burned or punctured with bullets. Many homes were looted and bruised by nearby combat but some are still standing. Others have been completely destroyed. The outside of our house looks smooth from the street but has a crack in the base of the front wall visible from up close. It is likely a bomb fell nearby and shook the house at its base - a reminder of the airstrikes and shelling that my parents and their neighbours fled. Inside, the damage is choking. Most of the furniture has been taken except a few lone couches. The carpets and curtains have been stripped. The electrical panels and wiring pulled out. The appliances, dishes, glasses and spices snatched from the kitchens. The walls are bare apart from the few items they decided to spare. Ceilings have been punctured and cushions torn open in their hunt for hidden gold. The walls are marked with the names of RSF troops that came in and out of this house like it was their own. The home that has been the centre of our life in Sudan is a shell. Glimmers of hope The picture of sheer wreckage settles and signs of familiarity come into focus. A family photo album that is 20 years old. The rocking chair my mother cradled me and my sister in. My university certificate. Celebratory snaps of my siblings' weddings. Books my brother has had since the early nineties. The painting above my bed that I have pined over during the two years - custom-made and gifted to me for my 24th birthday and signed by my family on the back. There are signs of dirt and damage on all these items our looters discarded but it is enough. Evidence of material destruction but a reminder of what we can hope will endure. The spirit of the people that gathered to laugh, cry and break bread in these rooms. The hospitality and warmth of a Sudanese home with an open door. The community and sense of togetherness that can never truly be robbed. What remains in our hearts and our city is a sign of what will get us through."
    },
    {
        "title": "Half-tonne piece of Soviet rocket to crash back down to Earth in coming days",
        "description": "A car-sized piece of Soviet rocket is expected to come crashing back down to Earth in the coming days, after 53 years in orbit.&#160;",
        "url": "https://news.sky.com/story/half-tonne-piece-of-soviet-rocket-to-crash-back-down-to-earth-in-coming-days-13358613",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-venera-4-space-probe_6900958.jpg?20250429170851",
        "type": "World",
        "Author": "Mickey Carroll",
        "Date Published": "2025-04-30 11:03:00",
        "Headline": "A heat-protected capsule that the USSR had intended to reach Venus is on a collision path with Earth, with astronomer Marco Langbroek predicting it will hit around 10 May.",
        "Content": "\n          Science and Technology reporter\n       A car-sized piece of Soviet rocket is expected to come crashing back down to Earth in the coming days, after 53 years in orbit.  \"It's a half-tonne thing falling out of the sky at a couple of hundred miles an hour. That's going to hurt if it hits you,\" said one astronomer to Sky News. Cosmos 482 was destined to land on Venus after being launched from the USSR's spaceport in what is now Kazakhstan in 1972. Instead, the upper stage of the rocket, which was responsible for powering it out of orbit, failed. \"The upper stage didn't work right and it left just the probe in orbit around the Earth,\" said Smithsonian astronomer Jonathan McDowell. Parts of the rocket re-entered the Earth's atmosphere in the 1980s but one chunk remained in orbit, which was thought to be debris left from the spacecraft.  \"Years later, I went and looked at the data and went, 'This debris [...] stayed up a lot longer than the other stuff. It seems to be denser. It's not behaving like debris,\" said Mr McDowell. \n                  The evidence from planet K2-18b suggesting it may be teeming with microbial life is tantalising\n                 \n                  Katy Perry floats in space as part of star-studded all-female Blue Origin mission\n                 \n                  Blue Origin rocket launch - as it happened: What Katy Perry sang in space and how all-female crew reacted to flight\n                 \"I realised that it was the Venus entry capsule from Cosmos 482, which has got a heat shield on it [strong enough] to survive the crushing force of Venus's atmosphere.\" Now, the heat-protected capsule is on a collision path with Earth, with astronomer Marco Langbroek predicting it will hit around 10 May.  \"It's half a tonne. It's about three feet across,\" said Mr McDowell. \"As it smashes into the atmosphere, going at this enormous speed, the energy gets converted into heat [and] you get this fireball.\" By the time it hits the Earth, Mr McDowell says Cosmos 482 will be \"going only a couple of hundred miles an hour\". \"But it's still a half-tonne thing falling out of the sky at a couple of hundred miles an hour. That's going to hurt if it hits you,\" he said. Read more from Sky News:Ransacked and looted: Sky reporter returns to family homeTrump celebrates 100 days in officeSixteen-year-old detained after three people killed in Sweden Scientists can't predict where it will hit, although they have narrowed it down to between 51 degrees north and 51 degrees south. \"If you're a penguin, you're probably fine,\" said Mr McDowell. \"But if you live anywhere from Chile to Scotland, you're in the zone.\"  Much of the surface is covered in ocean, however, and the lander is around the size of a car, so the chances of it hurting someone are low. For Mr McDowell, Cosmos 482 is just an illustration of a bigger problem. \"It's getting really crowded out there and we're getting more and more dependent on satellites for our everyday lives,\" he said. \"I think the time is coming when we're really going to have to get more serious about cleaning up space junk.\""
    },
    {
        "title": "Why many people in Vietnam now have a positive view of Americans 50 years after the war",
        "description": "On the streets of Ho Chi Minh City, it's a sea of red.",
        "url": "https://news.sky.com/story/why-many-people-in-vietnam-now-have-a-positive-view-of-americans-50-years-after-the-war-13358530",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-boy-vietnam_6901447.jpg?20250430112107",
        "type": "World",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-04-30 08:33:00",
        "Headline": "Half a century after the end of America's attempt to stop South Vietnam falling to the communist regime in the north, there are celebrations of national pride and victory against the odds - but many in the country will be hoping its now good relationship with the US can endure.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  On the streets of Ho Chi Minh City, it's a sea of red. The streets are filled with national flags and thousands of troops and civilians smiling widely in patriotic dress. Some people have camped out overnight to make sure they get the early morning display of military might-fighter jets and helicopters decorating the skies above. 50 years after the unification of Vietnam, this is a celebration of national pride, revolutionary heroism and victory against the odds. At the statue of former North Vietnam president Ho Chi Minh, we meet Nguyen Ngoc Xuan Mai. She's beaming. \"We have so much joy,\" she tells me. \"We celebrate it together. I feel so grateful because [of] what my ancestors did in the past. So that we can have today.\" The legacy of the Vietnam war - a bloody battle between communist North and US-backed South Vietnam - is a complex one. \n                  US trade deal 'possible' but not 'certain', says senior minister\n                 \n                  Rachel Reeves to head to Washington amid hopes of US trade deal\n                 \n                  Anti-Trump protests sweep America for the second time in weeks\n                 Around three million Vietnamese lost their lives and about 58,000 Americans. It exposed the limits of American military power and in the US there was huge backlash. The psychological scars on both sides were profound and it altered the political landscape. The impact of Agent Orange, a notorious chemical defoliant used by US forces over Vietnam to destroy jungles is still being deeply felt. It was a hugely toxic defoliant and from the 1960s onwards, doctors saw a sharp rise in birth defects and cancers. Decades later, those victims are still suffering and now they have the added worry of a possible cut in US funding to help with their medical needs. And yet, on the streets of the city that was renamed from Saigon after the US departed, it is not an anti-American feeling you sense. Far from it in fact. Despite their history, many Vietnamese have a positive view of Americans - they see them as forward-looking. Part of that is the cultural exchange and economic benefits they have felt from normalised relationships and the high number of products Vietnam exports to America. A defining and iconic image of the Vietnam War was taken by Pulitzer Prize winning photographer Nick Ut. It shows a nine-year-old girl running naked on a road after being severely burned in a napalm attack by the South Vietnamese Air Force. Mr Ut has returned to Ho Chi Minh City. He tells me he stills speaks to that girl, now a woman, every week. 👉 Listen to Sky News Daily on your podcast app 👈 She's called Kim and she lives in Toronto. \"I feel like I took that picture yesterday,\" he tells me. \"I always think about that day in the village and the victim, the little girl. She's like a daughter to me.\" In his first term, Donald Trump invited Mr Ut to the White House. He tells me the president held up a framed copy of the photograph to a packed room and said: \"This man's image stopped the war.\" It certainly became a powerful symbol of the war, influencing global public opinion and anti-war movements. Now in his second term, Mr Trump is threatening Vietnam with 46% tariffs - which would be ruinous to the Vietnamese economy. But Mr Ut says he's hopeful the relationship will endure. He believes the US remains a \"good friend\"."
    },
    {
        "title": "Mum suspected of killing three people with toxic mushrooms 'faked cancer diagnosis to lure them to meal'",
        "description": "A mother accused of murdering her estranged husband's parents and aunt by feeding them poisonous mushrooms lured them to the meal by faking a cancer diagnosis, prosecutors claim.",
        "url": "https://news.sky.com/story/mum-suspected-of-killing-three-people-with-toxic-mushrooms-faked-cancer-diagnosis-to-lure-them-to-meal-13358625",
        "image_url": "https://e3.365dm.com/23/11/1920x1080/skynews-erin-patterson-australia_6346181.jpg?20231103075841",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-30 11:11:00",
        "Headline": "Erin Patterson is accused of fabricating the diagnosis so she could host the lunch on the pretence of discussing the best way to tell her two children about the illness.",
        "Content": "A mother accused of murdering her estranged husband's parents and aunt by feeding them poisonous mushrooms lured them to the meal by faking a cancer diagnosis, prosecutors claim. Erin Patterson is on trial over the deaths of her parents-in-law, Don and Gail Patterson, both 70, and Gail Patterson's sister, Heather Wilkinson, 66, in July 2023. The 50-year-old, from the state of Victoria in southern Australia, has also been charged with the attempted murder of Mrs Wilkinson's husband Reverend Ian Wilkinson. All four fell ill after eating a lunch of beef Wellington, mashed potatoes and green beans at Patterson's home in the town of Leongatha, the court has been told. Prosecutors said Patterson knowingly laced the beef pastry dish with deadly death cap mushrooms, also known as Amanita phalloides, at her home. Patterson denies the charges. Her husband Simon Patterson, with whom she has two children, was also invited to the lunch and initially accepted but later declined. \n                  Trump latest: Natural resources deal shows Trump 'committed to free Ukraine' - US Treasury\n                 \n                  Two children from Gaza enter UK for specialist medical care for first time after months of struggle\n                 \n                  Ransacked and looted: Sky reporter returns to family home left in ruins after war in Sudan\n                 The jury was told on Tuesday that prosecutors had dropped three charges that Patterson had attempted to murder her husband, who she has been separated from since 2015. In the trial's opening arguments that began on Wednesday, prosecutor Nanette Rogers said Patterson fabricated a cancer diagnosis and hosted the lunch on the pretence of discussing the best way to tell her two children about the illness. \"The accused said that it was important that the children were not present for the lunch,\" Ms Rogers said. She also told the court: \"It is the prosecution case that the accused deliberately poisoned (the victims) with murderous intent. \"The prosecution will not be suggesting that there was a particular motive to do what she did.\" Defending Patterson, barrister Colin Mandy told the court the deaths were a \"terrible accident\", and the accused had no intention of killing her lunch guests. \"The defence case is that Erin Patterson did not deliberately serve poisoned food to her guests,\" he said. Separate plates The guests ate individual portions of beef Wellington off four large grey dinner plates, while Patterson ate from a smaller, tan-coloured plate, the court heard. The guests fell ill later that day and were taken to hospital the day after. Mr and Mrs Patterson and Mrs Wilkinson later died, while Reverend Wilkinson spent weeks in hospital and survived. Patterson went to hospital two days later, where she initially discharged herself against medical advice, the court was told. She had mild symptoms of illness, but further tests revealed no evidence of toxins consistent with death cap mushroom poisoning, the prosecution said. Patterson resisted attempts by doctors to have her two children tested, who she claimed had eaten leftovers of the lunch, saying she did not want to frighten them, Ms Rogers said. \"She was reluctant to have the children medically assessed, because she knew that, like her, they had not eaten any poisoned food,\" the prosecution lawyer said. The defendant denied ever owning a food dehydrator, but police traced one owned by her to a nearby garbage dump, that was later found to contain death cap mushrooms, Ms Rogers said. Mr Mandy said his client had lied repeatedly during the investigation because she \"panicked\" due to the intense scrutiny surrounding the case which has gripped Australia. Read more from Sky News:Serial paedophile jailed for 46 yearsWho are Scattered Spider? The death cap is one of the most toxic mushrooms on the planet and is involved in the majority of fatal mushroom poisonings worldwide.  The species contains three main groups of toxins: amatoxins, phallotoxins, and virotoxins.  From these, amatoxins are primarily responsible for the toxic effects in humans.  The alpha-amanitin amatoxin has been found to cause protein deficit and ultimately cell death, although other mechanisms are thought to be involved.  The liver is the main organ that fails due to the poison, but other organs are also affected, most notably the kidneys.  The effects usually begin after a short latent period and can include gastrointestinal disorders followed by jaundice, seizures, coma, and eventually, death.  How couple's relationship fell apart Patterson married Simon in 2007 and had two children together, the court heard. They separated temporarily several times, before splitting permanently in 2015. They remained amicable, sharing custody of the children and going on family holidays together. That changed in 2022 when Simon listed himself as separated on a tax return, Ms Rogers said, with communication deteriorating and the pair disagreeing over child support. The trial has seen intense interest from local and international media, with podcasters, journalists and documentary-makers descending on the town of Morwell, around two hours east of Melbourne, where the trial is being heard. The court is expected to hear the first of dozens of witnesses and scientific experts on Thursday. The trial, scheduled to run until early June, continues."
    },
    {
        "title": "Indian military action against Pakistan could happen in 'next 24-36 hours', Islamabad says",
        "description": "Pakistan has said it has \"credible intelligence\" India intends to launch military action, as tensions between the two countries continue to escalate.&#160;",
        "url": "https://news.sky.com/story/indian-military-action-against-pakistan-could-happen-in-next-24-36-hours-islamabad-says-13358463",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-india-pakistan-attack_6901241.jpg?20250430071711",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-30 07:09:00",
        "Headline": "Tensions between the neighbouring countries have escalated after 26 people were killed in an attack near the resort town of Pahalgam in India-controlled Kashmir.",
        "Content": "Pakistan has said it has \"credible intelligence\" India intends to launch military action, as tensions between the two countries continue to escalate.  The neighbouring countries introduced extensive measures against each other after 26 people were killed in an attack near the resort town of Pahalgam in India-controlled Kashmir on 22 April. India claims it has identified the three attackers involved, which includes two Pakistan nationals. It says they are \"terrorists\" who are waging a violent revolt on the Muslim-majority in Kashmir. Islamabad has repeatedly denied it had any involvement in the attack, which a group known as The Kashmir Resistance has claimed responsibility for, and called for a neutral investigation. Kashmir attack: What happened?  But relations between the two countries - which both claim Kashmir as their own territory - have continued to dwindle. In a statement early on Wednesday, Pakistan said it had \"credible intelligence\" that India intends to carry out military action against it in the \"next 24-36 hours on the pretext of baseless and concocted allegations of involvement in the Pahalgam incident\". India's foreign and defence ministries have not commented on the claims. It comes after Indian army officials said it had responded to \"unprovoked\" small arms fire from Pakistan army posts on multiple occasions. No casualties have been reported, and the Pakistan military has not responded to the claims. Pakistan's defence minister Khawaja Asif also told Sky News' The World With Yalda Hakim that the world should be \"worried\" about the prospect of a full-scale conflict involving the two nations, which both have nuclear weapons.Prime Minister Narendra Modi has vowed to pursue and punish those responsible for the incident. Indian Prime Minister Narendra Modi vowed to pursue and punish those behind the attack. It is believed he will host a cabinet committee on security (CCS), consisting of his interior, defence, home and finance minister, later on Wednesday, according to Reuters. In the days after the attack, India suspended the critical Indus Waters Treaty that regulates water-sharing from the Indus River and its tributaries, while Pakistan closed airspace to Indian airlines.  Around 48 of the 87 tourist destinations in Indian-controlled Kashmir have also been closed and enhanced security at the remaining ones have been introduced by the governments in Jammu and Kashmir, according to Reuters. Read more from Sky News:Donald Trump celebrates 100 days in officeUK joins US in strike on Houthi target in Yemen The US and UK have urged the two nations not to escalate tensions, with US secretary of State Marco Rubio expected to speak with his counterparts in India and Pakistan soon. Hindu-majority India accuses Islamic Pakistan of funding and encouraging militancy in Kashmir. Islamabad says it only provides moral and diplomatic support to a Kashmiri demand for self-determination."
    },
    {
        "title": "Is Trump just winging his foreign policy?",
        "description": "So, after 100 days of Donald Trump the big question for me remains - does the US president have a coherent foreign policy or is he just winging it?",
        "url": "https://news.sky.com/story/unpredictable-and-disruptive-or-canny-and-persistent-what-exactly-is-donald-trumps-foreign-policy-13358374",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-100_6901282.jpg?20250430080611",
        "type": "World",
        "Author": "Yalda Hakim",
        "Date Published": "2025-04-30 05:17:00",
        "Headline": "Lead world news presenter Yalda Hakim tries to make sense of Donald Trump's foreign policy, which has been as fast-paced and unpredictable as the rest of his first 100 days in office.",
        "Content": "\n          Lead world news presenter\n              @SkyYaldaHakim\n  So, after 100 days of Donald Trump the big question for me remains - does the US president have a coherent foreign policy or is he just winging it? Let's take his attitude to the war in Ukraine - here \"inconsistent\" is perhaps the best description. Back in February, he and vice president JD Vance humiliated Ukrainian President Volodymyr Zelenskyy by shouting at him in the Oval Office. A few days later, I spoke to Mr Zelenskyy in person when he confided to me that maybe he would have to step down if NATO could guarantee Ukraine membership - a man who perhaps sensed he could never win against a hostile Mr Trump.  Yet, fast-forward to last weekend in Rome, and an iconic picture of the two men in close conversation at the Pope's funeral. This time round, it is Russian President Vladimir Putin on the receiving end of the presidential anger, blaming him for the fact that \"too many people are dying!\" To Trump's supporters, this is the smart negotiator, constantly repositioning himself as new information comes in, prior to pulling off a spectacular deal. To his many detractors, it indicates a dangerous incoherence that is replicated in other key areas, including tariffs as well as his relationship with his allies in Europe and his foes in Beijing. Flexible or fallible; in control or all at sea? In the fast and furious world of Donald Trump, it's almost impossible to call. Trump 100: Read moreTrump's awkward reckoningHow immigration crackdown changed lives The only constants are his unwavering self-belief, or as the man himself says: \"I aim very high, and then I just keep pushing and pushing and pushing to get what I'm after.\" We shall see."
    },
    {
        "title": "India shuts airspace to Pakistani airlines as US urges nuclear-armed neighbours to 'de-escalate'",
        "description": "India and Pakistan have been urged by America's top diplomat to work together to \"de-escalate\" rising tensions over Kashmir.",
        "url": "https://news.sky.com/story/india-shuts-airspace-to-pakistani-airlines-as-us-urges-nuclear-armed-neighbours-to-de-escalate-13358934",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-india-soldier-kashmir_6902178.jpg?20250430220313",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-30 20:12:00",
        "Headline": "New Delhi has blamed Pakistan for the attack near the resort town of Pahalgam on 22 April. Islamabad has denied any role and called for a neutral investigation.",
        "Content": "India and Pakistan have been urged by America's top diplomat to work together to \"de-escalate\" rising tensions over Kashmir. It comes just days after 26 men, mostly tourists, were shot dead by gunmen in the India-controlled part of the disputed region, which the nuclear-armed neighbours both claim as their own. New Delhi has blamed Pakistan for the suspected militant attack near the resort town of Pahalgam on 22 April. India claims it has identified the three attackers involved, including two Pakistan nationals. It says they are \"terrorists\" who are waging a violent revolt on the Muslim-majority in Kashmir. Islamabad has denied any role and called for a neutral investigation. US secretary of state Marco Rubio has spoken separately to Indian foreign minister Subrahmanyam Jaishankar and Pakistani Prime Minister Shehbaz Sharif. The US state department said Mr Rubio expressed support to India in combating extremism and also urged Pakistan to cooperate in investigating the attack. Bilawal Bhutto Zardari, chairman of the Pakistan Peoples Party (PPP), which is part of the ruling coalition, told Sky News' The World with Yalda Hakim: \"As far as India's accusations are concerned, it would be helpful if India was to provide specific, concrete evidence with Pakistan and with the international community.\" Mr Bhutto Zardari, a former foreign minister, warned the current situation could \"turn into anything from a limited skirmish and attack between our air forces or any other wings of our armed forces, or it could turn into a full-scale war\". Early on Wednesday, Pakistan said it had \"credible intelligence\" that India intends to carry out military action against it in the \"next 24-36 hours on the pretext of baseless and concocted allegations of involvement in the Pahalgam incident\". Also on Wednesday, the Indian government said it closed its airspace to Pakistani airlines - days after Pakistan banned Indian airlines from flying over its territory. Kashmir attack: What happened? Indian and Pakistani troops have exchanged small-arms fire over the past six nights, which New Delhi says was initiated by the Pakistani side across their 460-mile de facto border running through Kashmir. No casualties were reported, and the Pakistan military has not responded to the claims. Pakistan 'well capable of responding to any Indian aggression' Mr Bhutto Zardari, whose mother, former Pakistan prime minister Benazir Bhutto was assassinated in 2007, said his country was \"bracing for any such action where Pakistan is at the ready to respond\". He told Yalda Hakim: \"I don't want to go into theoreticals other than to say from our air force to our armed forces to our navy, Pakistan is well capable of responding to any and all forms of Indian aggression.\" He also said that \"our two countries have gone to war before. It is our hope that this does not happen, that better sense prevails, that the international community is engaging with both sides, but forcefully engages with both sides to ensure that there's no escalation\".  Of the Rubio talks, Mr Sharif's office said in a statement he told the US secretary of state he \"categorically rejected Indian attempts to link Pakistan to the incident\". The PM called for a transparent, credible and neutral investigation and urged the US to press India to \"dial down the rhetoric and act responsibly\". Since the attack, the neighbours have announced a number of measures against each other, including India suspending the Indus Water Treaty. It is an agreement for the distribution and use of waters from the Indus River and its tributaries, which feed 80% of Pakistan's irrigated agriculture and its hydropower. Until the attack, the treaty had been in operation despite two wars and other times of hostility between the nations."
    },
    {
        "title": "US economy shrinks - as Trump blames Biden",
        "description": "The US economy shrank between January and March in its worst performance for three years - with Donald Trump blaming former president Joe Biden.",
        "url": "https://news.sky.com/story/us-economy-shrinks-as-trump-blames-biden-13358719",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-donald-trump-joe-biden_6747613.jpg?20241113162322",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-30 13:42:00",
        "Headline": "Donald Trump has blamed his predecessor, despite data showing the contraction was caused by a surge in imports due to the huge tariffs he imposed.",
        "Content": "The US economy shrank between January and March in its worst performance for three years - with Donald Trump blaming former president Joe Biden. The first US economic growth figures since Mr Trump returned to the White House on 20 January show the world's largest economy contracted at an annualised rate of 0.3% during the first three months of the year. An annualised rate is a calculation of economic performance over 12 months, as opposed to just one quarter. Data shows the contraction is due to a surge in imports, as US companies tried to bring in foreign goods before Mr Trump announced import tariffs in order to beat price increases, worsening the trade deficit he hates. However, after the figures were released, Mr Trump blamed his predecessor for the slowdown in growth. He wrote on his Truth Social platform: \"This is Biden's Stock Market, not Trump's. I didn't take over until January 20th. \"Tariffs will soon start kicking in, and companies are starting to move into the USA in record numbers. \"Our Country will boom, but we have to get rid of the Biden 'Overhang'. \"This will take a while, has nothing to do with tariffs, only that he left us with bad numbers, but when the boom begins, it will be like no other. Be patient!\" Trump latest: Follow live updates Economists and financial markets had largely expected growth of 0.3% before today's figures were released by the Commerce Department. The 0.3% contraction is sharply down on the solid 2.4% rate of growth measured over the previous three months when Mr Biden was president. Meanwhile, imports grew at a 41% pace during the first three months of this year, the fastest since 2020, due to companies seeking to stockpile goods before higher tariffs came into effect. The US trade deficit has widened sharply since December - despite Mr Trump's aim of using tariffs to cut the gap between the value of America's exports and imports.  There are fears that inflation in America will rise sharply due to higher import costs being passed on, limiting the US central bank's ability to cut interest rates for consumers and businesses alike. It comes as consumer spending slowed sharply between January and March - 1.8% growth from 4% in October to December last year. Federal government spending plunged 5.1% in the first quarter. Many economists say that Mr Trump's massive import taxes - and the erratic way he has rolled them out - will hurt growth in the second half of the year and that recession risks are rising. Read more from Sky News:Trump celebrates 100 days in officeIs Trump just winging foreign policy? Mr Trump inherited a solid economy that had grown steadily despite high interest rates imposed by the Federal Reserve to fight inflation. His trade policies - including 145% tariffs on China - have reportedly paralysed businesses and threatened to raise prices and hurt consumers. There is potential evidence emerging that the country's strong job market, a pillar of the US economy during the pandemic recession, may be weakening. On Wednesday, payroll provider ADP showed that companies added just 62,000 jobs in April, about half of what was expected, and down from 147,000 in March. That could be a signal that businesses may be taking a more cautious approach to hiring amid uncertainty over tariffs.  Employers in the education and health, information technology, and business and professional services industries all cut jobs. \"Unease is the word of the day,\" said Nela Richardson, chief economist at ADP. \"It can be difficult to make hiring decisions in such an environment.\" However, ADP figures often diverge from the government's jobs reports. Will there be a recession? The International Monetary Fund recently forecast annual growth of 1.8% for the US this year. But some economists see a 50/50 chance of a recession ahead. US futures showed further falls for stock markets on Wall Street at the open. How Trump responds will be the most eagerly anticipated information for investors moving forward."
    },
    {
        "title": "Sixteen-year-old detained after three people killed in Sweden shooting",
        "description": "A 16-year-old has been detained on suspicion of shooting and killing three people in Sweden, prosecutors have said. ",
        "url": "https://news.sky.com/story/police-detain-16-year-old-after-three-people-killed-in-shooting-in-sweden-13358482",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-uppsala-sweden-shooting_6901303.jpg?20250430083342",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-30 06:17:00",
        "Headline": "Swedish police have said the shooting took place at a hair salon and that it is believed to have been an \"isolated event\".",
        "Content": "A 16-year-old has been detained on suspicion of shooting and killing three people in Sweden, prosecutors have said.  A murder investigation was launched following the incident in the city of Uppsala on Tuesday. The teenager is one of several people being interrogated as part of the investigation, Swedish police said. The force added that the shooting took place at a hair salon and they believe it to have been an \"isolated event\". Court documents, heavily redacted due to the suspect's young age, showed a person had been arrested on Wednesday, just after midnight. The Swedish Prosecution Authority said the 16-year old is being held on the highest level of suspicion in the country's legal system. \"An intensive investigation is under way. We are now gathering information and the police are conducting door-to-door inquiries and interviewing witnesses,\" the authority said in a statement. \"In addition, mobile phones and other material that has been seized are being analysed.\" Police told a news conference that it was too early to say if the shooting was gang related, but it was one of the theories they were pursuing \"particularly intensively\". The force also said they do not believe the shooting was linked to the extensive celebrations for Walpurgis night, a pagan festival marking the arrival of spring. Witnesses earlier told local media they heard five shots and saw people in the area running to take cover. Police said on Tuesday it was investigating the shooting as a homicide and that it had no information about whether it was a terror or hate crime-related incident at that point. A spokesperson for the force said it had information someone had left the scene on an electric scooter - it was unclear whether they were a suspect, witness or otherwise. Electric scooters have been used several times as a mode of transport after gang shootings in the country. Uppsala, a city around 70km (43 miles) north of the capital Stockholm, has seen a number of gang-related shootings in the past decade, but usually outside the city centre. Read more from Sky News:Sky reporter returns to family home left in ruinsUK joins US in strike on Houthi targetWhy are Kneecap controversial? In a statement on Tuesday, Swedish justice minister Gunnar Strommer said: \"A brutal act of violence has occurred in central Uppsala... this is at the same time as the whole of Uppsala has begun Walpurgis Night. \"What has happened is extremely serious.\" In February, 10 people were killed in the city of Orebro in the country's deadliest ever mass shooting after a 35-year-old opened fire in an adult learning centre. Sweden's right-wing government came to power in 2022, promising to tackle gang-related violence. It has tightened laws and given more powers to police, and after the Orebro shooting, it vowed to tighten gun laws as well."
    },
    {
        "title": "US and Ukraine sign deal to establish investment fund",
        "description": "The US Treasury has announced it has agreed to establish an American-Ukrainian reconstruction investment fund.",
        "url": "https://news.sky.com/story/us-and-ukraine-sign-deal-to-establish-investment-fund-13358985",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-scott-bessent-yulia-svyrydenko_6902241.jpg?20250430231717",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-30 21:42:00",
        "Headline": "A senior Ukrainian official said the US will make \"direct financial contributions\" to the fund and \"may also provide new assistance\" such as air defence systems.",
        "Content": "The US Treasury has announced it has agreed to establish an American-Ukrainian reconstruction investment fund. For Ukraine, the economic deal was seen as possibly key to ensuring its access to future US military aid in its war against Russia. President Trump had previously called for Kyiv to compensate Washington for billions of dollars in assistance to help repel the Kremlin's forces. A senior Ukrainian official said on Wednesday the US will make \"direct financial contributions\" to the fund and \"may also provide new assistance\" such as air defence systems for Ukraine. In return the US is set to get preferential access to any new deals concerning Ukraine's mineral resources. Trump latest: Deal shows Trump 'committed to free Ukraine' The US Treasury said \"in recognition of the significant financial and material support\" the US has provided to the \"defence of Ukraine... this economic partnership positions our two countries to work collaboratively and invest together to... accelerate Ukraine's economic recovery\". US treasury secretary Scott Bessent said: \"This agreement signals clearly to Russia that the Trump administration is committed to a peace process centered on a free, sovereign, and prosperous Ukraine over the long term.\" He also said \"this partnership allows the US to invest alongside Ukraine, to unlock Ukraine's growth assets, mobilise American talent, capital and governance standards that will improve Ukraine's investment climate and accelerate Ukraine's economic recovery\". Britain's Foreign Secretary Davis Lammy has welcomed the deal. Donald Trump indicated in February he wanted access to Ukraine's rare earth materials, describing it as reimbursement for the billions of dollars in aid the US has given to Kyiv. But talks stalled after a heated Oval Office meeting between him and Ukraine's President Volodymyr Zelenskyy, and reaching an agreement since then has proven difficult amid strained relations between Washington and Kyiv. News correspondent They are calling this a \"reconstruction investment fund\" but it gives the US access to things like graphite, aluminium, oil and gas. The White House has confirmed this is indeed the oft-referenced \"minerals deal\", and it will pay dividends in various ways. Economically it allows the US to say they are clawing back the billions of dollars it has offered in military aid to Ukraine. Politically, by having an investment on the ground, it allows Donald Trump to claim he's giving Volodymyr Zelenskyy the security guarantees he's sought for so long. It is the latest chapter in a remarkable story. The jaw-dropping showdown between Mr Trump and Mr Zelenskyy in the Oval Office at the end of February, when the US was seemingly suggesting Ukraine was somehow responsible for the Russian invasion, redefined old allegiances in real time before our very eyes, to the shock of other world leaders. Then last weekend, we saw the two men again seated together just feet apart at St Peter's Basilica in Rome at the funeral of Pope Francis, closing the gap both literally and politically. Mr Trump vowed to end the war in Ukraine on his first day in office. On his 101st day, he's closer to doing that than he ever has been before. Why is US interested in Ukraine's raw materials? The US is seeking access to over 20 raw materials seen as strategically critical to its interests, including some non-minerals such as oil and natural gas. Among them are Ukraine's deposits of titanium, which is used for making aircraft wings and other aerospace manufacturing, and uranium, that is used for nuclear power, medical equipment and weapons.  Ukraine also has lithium, graphite and manganese, which are used in electric vehicle batteries. On Wednesday, Ukraine's first deputy prime minister Yulia Svyrydenko said she had signed the agreement in Washington DC to create the investment fund. She wrote on X: \"Together with the United States, we are creating the fund that will attract global investment into our country. \"Its implementation allows both countries to expand their economic potential through equal cooperation and investment. \"The United States will contribute to the fund. In addition to direct financial contributions, it may also provide new assistance - for example air defence systems for Ukraine.\" The announcement comes as the Trump administration is pushing to stop the war, which erupted in February 2022 when Russia launched a full-scale invasion. Russian President Vladimir Putin backs calls for a ceasefire before peace negotiations, \"but before it's done, it's necessary to answer a few questions and sort out a few nuances\", Kremlin spokesman Dmitry Peskov has said. Mr Putin is also ready for direct talks with Ukraine without preconditions to seek a peace deal, he added. On Monday, the Russian leader declared there would be a three-day ceasefire from 8 May to 10 May. Mr Zelenskyy wants an immediate ceasefire lasting at least 30 days."
    },
    {
        "title": "'De minimis': The rarely-examined trade clause about to become a very big deal ",
        "description": "The thing about trade, and the economics of trade, is that it is simultaneously desperately boring and desperately important.",
        "url": "https://news.sky.com/story/de-minimis-the-rarely-examined-trade-clause-about-to-become-a-very-big-deal-13358896",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-shein-china_6902118.jpg?20250430204354",
        "type": "US",
        "Author": "Ed Conway",
        "Date Published": "2025-04-30 19:11:00",
        "Headline": "There's a long and detailed set of discussions that have bored on for decades about the pros and cons of this scheme. Now, the US is set to scrap it altogether - and nobody knows what will happen next. ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  The thing about trade, and the economics of trade, is that it is simultaneously desperately boring and desperately important. For example, consider a little bit of legal small print no one spent all that much time thinking about until recently - a clause in most countries' customs arrangements known as \"de minimis\". The idea behind de minimis is quite simple. Collecting customs can be an expensive business. You need to employ lots of people to check goods, police the system and collect the relevant customs and tariffs. In theory, you could fund that via the customs you're charging people to import goods into the country. But what if the items you're imposing tariffs and charges on are so cheap that it makes no economic sense to actually impose those charges? Consider a £5 t-shirt of the kind you might order from an online retailer such as Shein. In theory, that garment should face a 20% tariff when it arrives from China into the UK. \n                  US and Ukraine sign deal to establish investment fund\n                 \n                  Donald Trump: Fact-checking the president's speech in Michigan\n                 \n                  Is Trump just winging his foreign policy?\n                 But since 20% of a small number is an even smaller number, most customs authorities, including those in the UK, have taken the stance of essentially excluding any cheap imports from paying customs. This is the 'de minimis' rule. There are similar rules in most countries, with the main difference being the threshold at which they kick in. Here in Britain, de minimis applies to anything worth less than £135. In the US the threshold at which you start paying customs charges is higher: $800. Now, there's a long and detailed set of discussions that have bored on for decades about the pros and cons of this scheme. The historic arguments against collecting those fees were that a) doing so probably cost more money than it would raise, b) scanning and checking every import would jam up ports and airports unnecessarily and c) it might have a bearing on the wider economy as it throws further sand in the wheels of commerce. But in recent years, a host of mostly Chinese retailers have exploited the de minimis rule to ship (actually, mostly to fly) cheap products to the US, UK, Europe and beyond. The most visible of these companies are Shein and Temu. By directly flying consignments of very cheap clothes and consumer goods to airports in the west, they have been able to undercut other companies without having to pay customs fees. All of which is why, alongside the host of other tariffs imposed in recent weeks, Donald Trump is also doing something else - eliminating America's de minimis rules altogether. At least, that's the plan. Having pledged to do so in February, the administration rapidly reversed the decision after consignments began to pile up at US airports. However, the impending rule, which is due to kick in this Friday, sounds like it might be more concrete than the last one. And, if it's actually imposed, tariffs of 145% will be imposed on goods that, once upon a time, didn't face any tariffs at all. Which is a very big deal indeed. Already, prices on websites including Shein have begun to increase. Consumers have begun to abandon the sites' apps. And consignments of goods bound for the US from China have begun to slow. The real question is what happens next. Does the White House U-turn again? Or does it stand firm? Even as American consumers see the cost of their hitherto cheap goods rise, and potentially even face empty supermarket shelves, the notion of which was summoned up by a delegation of retail chiefs who met with the president last week. The short answer, as with so much about the current US administration is: no one really knows, and if they say they do, don't believe them."
    },
    {
        "title": "Trump boasts of achievements and attacks enemies as he celebrates 100 days in office",
        "description": "Donald Trump has celebrated the 100th day of his second term with a campaign-style rally in Michigan.",
        "url": "https://news.sky.com/story/donald-trump-celebrates-100-days-in-office-with-campaign-style-rally-13358441",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-michigan_6901214.jpg?20250430034413",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-30 01:28:00",
        "Headline": "The US president mocked Joe Biden, falsely claimed he won the 2020 presidential election and defended his decision to impose tariffs on countries around the world.",
        "Content": " Donald Trump has celebrated the 100th day of his second term with a campaign-style rally in Michigan. During his 90-minute speech the US president mocked Joe Biden, falsely claimed he won the 2020 presidential election and defended his decision to impose tariffs on countries around the world. Speaking in front of electronic screens reading \"100 days of greatness\", Mr Trump attacked \"radical left lunatics\", briefly took on a heckler and boasted about his administration's \"mass deportation\" efforts. \"Removing the invaders is not just a campaign pledge,\" he said. \"It's my solemn duty as commander-in-chief. I have an obligation to save our country.\" 👉 Follow Trump100 on your podcast app 👈 He played a video of migrants his administration claims are gang members arriving at a notorious prison in El Salvador, with those in the crowd cheering the images of deportees having their heads shaved. During his speech, during which he called up several of his top team to the stage, Mr Trump claimed his administration has delivered \"most profound change in Washington in nearly 100 years\". Mr Trump also briefly touched on tariffs, saying China, which is facing tariffs of 145%, \"has taken more jobs from us than any country has ever taken from another country\".  But he said his tariffs did not mean Beijing and Washington cannot \"get along\" and said he thought a trade deal with China was near, adding: \"But it's going to be a fair deal.\" \"I think it's going to work out,\" he says. \"They want to make a deal. We're going to make a deal. But it's going to be a fair deal.\" He claimed his administration had \"already ended inflation\", but last month the Bureau of Labor Statistics said while inflation slowed in March over the past year, it had in fact risen 2.4%. Read more:US voters divided over first 100 daysTrump's first 100 days in 100 words US correspondent He came onto the stage bang on time. No need to keep the faithful in suspense anymore. They know what they are getting now and they are delighted. A hundred days in, President Trump was back, for the first time since the inauguration, at a rally; back with the grass roots of this MAGA movement. This is the place where he feels most at home.   The entry music was the unlikely theme tune to his revolution - the YMCA. He danced on stage. He's enjoying this second term: unhindered by the critics, unburdened by the constitution, unopposed by Congress.  \"It feels a little bit like he's a king, not a president?” I asked one woman in the crowd.  \"Maybe, but that's OK,” she said. Another chimed in: “He is a king!” To all of them he is.  It was a speech of course full of superlatives. It was his scorecard of his first three months.  It was the speech they’ve all heard before. We all have. But now it comes with a confidence, a swagger, the power of his presidency, and a gleeful aggression too.   \"Thousands of corrupt, incompetent and unnecessary deep state bureaucrats, you're fired. Get the hell out of here. You're fired. Get out of here.\"\n On immigration he can point to a clear policy achievement these past 100 days. The crossings on the southern border have dropped to a fraction, but it’s his court-defying methods which have troubled many. The deportations to foreign jails with no due process were celebrated here.  As footage played of men deported with no convictions, no court appearances and in defiance of an American federal court order, I asked one supporter if it made him feel at all uncomfortable. \n \"No it does not. That's what should happen to anybody that comes into the United States illegally, or pushing drugs from another country. That's what is going to happen and we've got a lot of bad actors in this country.\" \"They’ve not been through any judicial process…” I said.  “There doesn’t need to be any,” he shot back.  In the crowd, a sea of three-fingered gestures. Three fingers for three terms. They want him to run again in 2028.  Beyond the venue, the other side of all this.   On a windy cross-roads, a crowd which grew over the day to about one thousand, painted a bleak picture of the path ahead.  \"It's unnerving. There is a lot of unrest in our country right now and I only see it going one of a few ways and I hope I am wrong,\" one man said. He wouldn't reveal his face or his name for fear of repercussions. \"They are going after the colleges, they are going after the poor people, they are going after the disabled - the people who can least defend themselves…\" There were signs comparing Trump to Hitler. They’re common these days. I put it to one elderly protester that the Hitler comparison risks weakening their argument. Trump is not doing what Hitler did.  \"You mean by sending six million people to the gas chambers? Neither did Hitler to begin with. He wasn't saying that. He first made people the enemy and right now Trump is making the immigrants the enemy… It is so frightening what we see happening in our country. I know this scenario all too well and I can't believe this is happening in my country.\" 'You haven't seen anything yet' Mr Trump, who has frequently criticised Federal Reserve chair Jay Powell in recent weeks, said: \"Interest rates came down, despite the fact that I have a Fed person who's not really doing a good job, but I won't say that. I want to be very nice. I want to be very nice and respectful to the Fed. \"You're not supposed to criticise the Fed. You're supposed to let him do his own thing. But I know much more than he does about interest rates, believe me.\" Mr Trump also defended his administration's steep tariffs on cars and car parts, hours after he signed an executive order aimed at easing the impact of his tariffs on US carmakers. \"We're here tonight in the heartland of our nation to celebrate the most successful first 100 days of any administration in the history of our country,\" Mr Trump said. He later added: \"We've just gotten started. You haven't even seen anything yet.\""
    },
    {
        "title": "Is Trump just winging his foreign policy?",
        "description": "So, after 100 days of Donald Trump the big question for me remains - does the US president have a coherent foreign policy or is he just winging it?",
        "url": "https://news.sky.com/story/unpredictable-and-disruptive-or-canny-and-persistent-what-exactly-is-donald-trumps-foreign-policy-13358374",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-100_6901282.jpg?20250430080611",
        "type": "US",
        "Author": "Yalda Hakim",
        "Date Published": "2025-04-30 05:17:00",
        "Headline": "Lead world news presenter Yalda Hakim tries to make sense of Donald Trump's foreign policy, which has been as fast-paced and unpredictable as the rest of his first 100 days in office.",
        "Content": "\n          Lead world news presenter\n              @SkyYaldaHakim\n  So, after 100 days of Donald Trump the big question for me remains - does the US president have a coherent foreign policy or is he just winging it? Let's take his attitude to the war in Ukraine - here \"inconsistent\" is perhaps the best description. Back in February, he and vice president JD Vance humiliated Ukrainian President Volodymyr Zelenskyy by shouting at him in the Oval Office. A few days later, I spoke to Mr Zelenskyy in person when he confided to me that maybe he would have to step down if NATO could guarantee Ukraine membership - a man who perhaps sensed he could never win against a hostile Mr Trump.  Yet, fast-forward to last weekend in Rome, and an iconic picture of the two men in close conversation at the Pope's funeral. This time round, it is Russian President Vladimir Putin on the receiving end of the presidential anger, blaming him for the fact that \"too many people are dying!\" To Trump's supporters, this is the smart negotiator, constantly repositioning himself as new information comes in, prior to pulling off a spectacular deal. To his many detractors, it indicates a dangerous incoherence that is replicated in other key areas, including tariffs as well as his relationship with his allies in Europe and his foes in Beijing. Flexible or fallible; in control or all at sea? In the fast and furious world of Donald Trump, it's almost impossible to call. Trump 100: Read moreTrump's awkward reckoningHow immigration crackdown changed lives The only constants are his unwavering self-belief, or as the man himself says: \"I aim very high, and then I just keep pushing and pushing and pushing to get what I'm after.\" We shall see."
    },
    {
        "title": "Why many people in Vietnam now have a positive view of Americans 50 years after the war",
        "description": "On the streets of Ho Chi Minh City, it's a sea of red.",
        "url": "https://news.sky.com/story/why-many-people-in-vietnam-now-have-a-positive-view-of-americans-50-years-after-the-war-13358530",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-boy-vietnam_6901447.jpg?20250430112107",
        "type": "US",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-04-30 08:33:00",
        "Headline": "Half a century after the end of America's attempt to stop South Vietnam falling to the communist regime in the north, there are celebrations of national pride and victory against the odds - but many in the country will be hoping its now good relationship with the US can endure.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  On the streets of Ho Chi Minh City, it's a sea of red. The streets are filled with national flags and thousands of troops and civilians smiling widely in patriotic dress. Some people have camped out overnight to make sure they get the early morning display of military might-fighter jets and helicopters decorating the skies above. 50 years after the unification of Vietnam, this is a celebration of national pride, revolutionary heroism and victory against the odds. At the statue of former North Vietnam president Ho Chi Minh, we meet Nguyen Ngoc Xuan Mai. She's beaming. \"We have so much joy,\" she tells me. \"We celebrate it together. I feel so grateful because [of] what my ancestors did in the past. So that we can have today.\" The legacy of the Vietnam war - a bloody battle between communist North and US-backed South Vietnam - is a complex one. \n                  US trade deal 'possible' but not 'certain', says senior minister\n                 \n                  Rachel Reeves to head to Washington amid hopes of US trade deal\n                 \n                  Anti-Trump protests sweep America for the second time in weeks\n                 Around three million Vietnamese lost their lives and about 58,000 Americans. It exposed the limits of American military power and in the US there was huge backlash. The psychological scars on both sides were profound and it altered the political landscape. The impact of Agent Orange, a notorious chemical defoliant used by US forces over Vietnam to destroy jungles is still being deeply felt. It was a hugely toxic defoliant and from the 1960s onwards, doctors saw a sharp rise in birth defects and cancers. Decades later, those victims are still suffering and now they have the added worry of a possible cut in US funding to help with their medical needs. And yet, on the streets of the city that was renamed from Saigon after the US departed, it is not an anti-American feeling you sense. Far from it in fact. Despite their history, many Vietnamese have a positive view of Americans - they see them as forward-looking. Part of that is the cultural exchange and economic benefits they have felt from normalised relationships and the high number of products Vietnam exports to America. A defining and iconic image of the Vietnam War was taken by Pulitzer Prize winning photographer Nick Ut. It shows a nine-year-old girl running naked on a road after being severely burned in a napalm attack by the South Vietnamese Air Force. Mr Ut has returned to Ho Chi Minh City. He tells me he stills speaks to that girl, now a woman, every week. 👉 Listen to Sky News Daily on your podcast app 👈 She's called Kim and she lives in Toronto. \"I feel like I took that picture yesterday,\" he tells me. \"I always think about that day in the village and the victim, the little girl. She's like a daughter to me.\" In his first term, Donald Trump invited Mr Ut to the White House. He tells me the president held up a framed copy of the photograph to a packed room and said: \"This man's image stopped the war.\" It certainly became a powerful symbol of the war, influencing global public opinion and anti-war movements. Now in his second term, Mr Trump is threatening Vietnam with 46% tariffs - which would be ruinous to the Vietnamese economy. But Mr Ut says he's hopeful the relationship will endure. He believes the US remains a \"good friend\"."
    },
    {
        "title": "Donald Trump: Fact-checking the president's speech in Michigan",
        "description": "Donald Trump has marked the 100th day of his second term with a campaign-style rally in Michigan - but his speech included exaggerated and misleading information.",
        "url": "https://news.sky.com/story/donald-trump-fact-checking-the-presidents-speech-in-michigan-13358564",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-us-president_6901406.jpg?20250430104213",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-30 09:33:00",
        "Headline": "US President Donald Trump made claims about inflation, tariffs and prices of eggs during a speech in Michigan to celebrate the first 100 days of his second term.",
        "Content": " Donald Trump has marked the 100th day of his second term with a campaign-style rally in Michigan - but his speech included exaggerated and misleading information. Fact-checkers have been analysing his statements and matching it up with official data and trends. Inflation The president claimed his administration had \"already ended inflation\", but last month the Bureau of Labor Statistics said while the rate slowed in March, it had in fact risen over the past year to 2.4%. A bureau report said inflation was subsiding before Mr Trump's tariffs were introduced. The tariffs plunged financial markets into turmoil and have stoked fears of high inflation and even a recession. Inflation started falling long before Mr Trump started his second term. It peaked at 9.1% in June 2022 after rising steadily in the first 17 months of Joe Biden's presidency from a low of 0.1% in May 2020 as the world went through the COVID pandemic. And as of last December, it had fallen to 2.9%. Torsten Slok, chief economist at Apollo Global Management, said he sees a 90% chance of a recession by this summer if Mr Trump's tariffs remain in place.  Tariffs Mr Trump again celebrated his controversial move on world tariffs, saying \"I think it's going to work out\" - but that still does not appear to be the verdict of economists and market experts. On Wednesday, data showed the US economy shrank 0.3% from January to March - representing the first drop in three years. The latest figures are despite Mr Trump inheriting a solid economy that had been growing steadily. American businesses are cancelling orders from China and postponing expansion plans - and experts believe the taxes could bring emptier shelves and higher prices for US shoppers within weeks. And while he's placed a 10% levy on products from almost every country in the world, Mr Trump hit China with a staggering 145% tariff. China, which responded with 125% tariffs on US products, is America's third-biggest trading partner and second-biggest source of imported goods. Gene Seroka, executive director of the Port of Los Angeles, has said that within two weeks, arrivals to the port \"will drop by 35% as essentially all shipments out of China for major retailers and manufacturers has ceased\". Ocean container bookings from China to the US have also dropped 60%, say cargo companies, who said they have been forced to cancel 25% of sailings with orders down. Petrol prices Mr Trump wrongly claimed there had been a huge fall in petrol prices. He said: \"Gasoline was almost $4 not so long ago. And now … we just hit $1.98 in a lot of states.\" But latest figures, released on Wednesday by the American Automobile Association, show the average price across the US stands at $3.18. As of this week, no state has recently had an average gas price of $1.98. Mississippi currently has the lowest average price at $2.669 per gallon of regular gas - far higher than Mr Trump's claim. Cost of eggs Another product Mr Trump claimed had become cheaper was eggs. \"Since I took office, the cost of eggs is down 87% now,\" he told the crowd. Wholesale egg prices fell significantly in March, but not by 87%. They were at a high of $8.17 for a dozen large eggs on 3 March and had dropped to $2.92 by 26 March - a decrease of approximately 64%. However, the retail price of a dozen large eggs has been on the rise since October 2024. Economists said that because wholesale prices did not start dropping until mid-March, grocery stores may not have immediately passed on the lower prices. Coal production The 78-year-old American leader said: \"We stopped their crusade on coal. Did you see what I did the other day? Clean, beautiful coal.\" Although the production of coal is cleaner than it has been historically, it does not mean it can be described as \"clean\". Planet-warming carbon dioxide emissions from the coal industry have decreased over the past 30 years, according to the US Energy Information Administration. It is true that coal-fired electricity is cleaner than ever - but experts agree worldwide coal production needs to be significantly reduced to address climate change and its growing impact. Read more:Is Trump just winging his foreign policy? Fact-checking Trump's address to Congress  Border crossings Mr Trump said \"we have set all-time records for the lowest number of illegal border crossings\". According to US Customs and Border Protection, figures for March were the \"lowest southwest border crossings in history\". The government-run agency, which directly praised Mr Trump during the release of the figures, claims data shows there were 7,180 crossings - down from what it says was a monthly average of 155,000 over the previous four years."
    },
    {
        "title": "US economy shrinks - as Trump blames Biden",
        "description": "The US economy shrank between January and March in its worst performance for three years - with Donald Trump blaming former president Joe Biden.",
        "url": "https://news.sky.com/story/us-economy-shrinks-as-trump-blames-biden-13358719",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-donald-trump-joe-biden_6747613.jpg?20241113162322",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-30 13:42:00",
        "Headline": "Donald Trump has blamed his predecessor, despite data showing the contraction was caused by a surge in imports due to the huge tariffs he imposed.",
        "Content": "The US economy shrank between January and March in its worst performance for three years - with Donald Trump blaming former president Joe Biden. The first US economic growth figures since Mr Trump returned to the White House on 20 January show the world's largest economy contracted at an annualised rate of 0.3% during the first three months of the year. An annualised rate is a calculation of economic performance over 12 months, as opposed to just one quarter. Data shows the contraction is due to a surge in imports, as US companies tried to bring in foreign goods before Mr Trump announced import tariffs in order to beat price increases, worsening the trade deficit he hates. However, after the figures were released, Mr Trump blamed his predecessor for the slowdown in growth. He wrote on his Truth Social platform: \"This is Biden's Stock Market, not Trump's. I didn't take over until January 20th. \"Tariffs will soon start kicking in, and companies are starting to move into the USA in record numbers. \"Our Country will boom, but we have to get rid of the Biden 'Overhang'. \"This will take a while, has nothing to do with tariffs, only that he left us with bad numbers, but when the boom begins, it will be like no other. Be patient!\" Trump latest: Follow live updates Economists and financial markets had largely expected growth of 0.3% before today's figures were released by the Commerce Department. The 0.3% contraction is sharply down on the solid 2.4% rate of growth measured over the previous three months when Mr Biden was president. Meanwhile, imports grew at a 41% pace during the first three months of this year, the fastest since 2020, due to companies seeking to stockpile goods before higher tariffs came into effect. The US trade deficit has widened sharply since December - despite Mr Trump's aim of using tariffs to cut the gap between the value of America's exports and imports.  There are fears that inflation in America will rise sharply due to higher import costs being passed on, limiting the US central bank's ability to cut interest rates for consumers and businesses alike. It comes as consumer spending slowed sharply between January and March - 1.8% growth from 4% in October to December last year. Federal government spending plunged 5.1% in the first quarter. Many economists say that Mr Trump's massive import taxes - and the erratic way he has rolled them out - will hurt growth in the second half of the year and that recession risks are rising. Read more from Sky News:Trump celebrates 100 days in officeIs Trump just winging foreign policy? Mr Trump inherited a solid economy that had grown steadily despite high interest rates imposed by the Federal Reserve to fight inflation. His trade policies - including 145% tariffs on China - have reportedly paralysed businesses and threatened to raise prices and hurt consumers. There is potential evidence emerging that the country's strong job market, a pillar of the US economy during the pandemic recession, may be weakening. On Wednesday, payroll provider ADP showed that companies added just 62,000 jobs in April, about half of what was expected, and down from 147,000 in March. That could be a signal that businesses may be taking a more cautious approach to hiring amid uncertainty over tariffs.  Employers in the education and health, information technology, and business and professional services industries all cut jobs. \"Unease is the word of the day,\" said Nela Richardson, chief economist at ADP. \"It can be difficult to make hiring decisions in such an environment.\" However, ADP figures often diverge from the government's jobs reports. Will there be a recession? The International Monetary Fund recently forecast annual growth of 1.8% for the US this year. But some economists see a 50/50 chance of a recession ahead. US futures showed further falls for stock markets on Wall Street at the open. How Trump responds will be the most eagerly anticipated information for investors moving forward."
    },
    {
        "title": "'De minimis': The rarely-examined trade clause about to become a very big deal ",
        "description": "The thing about trade, and the economics of trade, is that it is simultaneously desperately boring and desperately important.",
        "url": "https://news.sky.com/story/de-minimis-the-rarely-examined-trade-clause-about-to-become-a-very-big-deal-13358896",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-shein-china_6902118.jpg?20250430204354",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-04-30 19:11:00",
        "Headline": "There's a long and detailed set of discussions that have bored on for decades about the pros and cons of this scheme. Now, the US is set to scrap it altogether - and nobody knows what will happen next. ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  The thing about trade, and the economics of trade, is that it is simultaneously desperately boring and desperately important. For example, consider a little bit of legal small print no one spent all that much time thinking about until recently - a clause in most countries' customs arrangements known as \"de minimis\". The idea behind de minimis is quite simple. Collecting customs can be an expensive business. You need to employ lots of people to check goods, police the system and collect the relevant customs and tariffs. In theory, you could fund that via the customs you're charging people to import goods into the country. But what if the items you're imposing tariffs and charges on are so cheap that it makes no economic sense to actually impose those charges? Consider a £5 t-shirt of the kind you might order from an online retailer such as Shein. In theory, that garment should face a 20% tariff when it arrives from China into the UK. \n                  US and Ukraine sign deal to establish investment fund\n                 \n                  Donald Trump: Fact-checking the president's speech in Michigan\n                 \n                  Is Trump just winging his foreign policy?\n                 But since 20% of a small number is an even smaller number, most customs authorities, including those in the UK, have taken the stance of essentially excluding any cheap imports from paying customs. This is the 'de minimis' rule. There are similar rules in most countries, with the main difference being the threshold at which they kick in. Here in Britain, de minimis applies to anything worth less than £135. In the US the threshold at which you start paying customs charges is higher: $800. Now, there's a long and detailed set of discussions that have bored on for decades about the pros and cons of this scheme. The historic arguments against collecting those fees were that a) doing so probably cost more money than it would raise, b) scanning and checking every import would jam up ports and airports unnecessarily and c) it might have a bearing on the wider economy as it throws further sand in the wheels of commerce. But in recent years, a host of mostly Chinese retailers have exploited the de minimis rule to ship (actually, mostly to fly) cheap products to the US, UK, Europe and beyond. The most visible of these companies are Shein and Temu. By directly flying consignments of very cheap clothes and consumer goods to airports in the west, they have been able to undercut other companies without having to pay customs fees. All of which is why, alongside the host of other tariffs imposed in recent weeks, Donald Trump is also doing something else - eliminating America's de minimis rules altogether. At least, that's the plan. Having pledged to do so in February, the administration rapidly reversed the decision after consignments began to pile up at US airports. However, the impending rule, which is due to kick in this Friday, sounds like it might be more concrete than the last one. And, if it's actually imposed, tariffs of 145% will be imposed on goods that, once upon a time, didn't face any tariffs at all. Which is a very big deal indeed. Already, prices on websites including Shein have begun to increase. Consumers have begun to abandon the sites' apps. And consignments of goods bound for the US from China have begun to slow. The real question is what happens next. Does the White House U-turn again? Or does it stand firm? Even as American consumers see the cost of their hitherto cheap goods rise, and potentially even face empty supermarket shelves, the notion of which was summoned up by a delegation of retail chiefs who met with the president last week. The short answer, as with so much about the current US administration is: no one really knows, and if they say they do, don't believe them."
    },
    {
        "title": "Stamp duty changes knock house prices, lender says",
        "description": "Lower stamp duty thresholds introduced at the start of the month are being widely blamed for the biggest monthly decline in UK house price growth since August 2023, according to a major lender's measure.",
        "url": "https://news.sky.com/story/stamp-duty-changes-knock-house-prices-lender-says-13358503",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-for-sale-house-houses_6823857.jpg?20250209124915",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-04-30 07:04:00",
        "Headline": "Lower stamp duty thresholds introduced at the start of the month are being widely blamed for the biggest monthly decline in UK house price growth since August 2023.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Lower stamp duty thresholds introduced at the start of the month are being widely blamed for the biggest monthly decline in UK house price growth since August 2023, according to a major lender's measure. Nationwide's latest report on the housing market showed a 0.6% decline in April, taking the rolling annual rate of growth down to 3.4% from the 3.9% determined in March. The bigger than expected decline has been widely explained by a slowdown in activity prompted by the stamp duty changes, which affected buyers in England and Northern Ireland at the beginning of the month. Money latest: Boost for 1.2 million families on Universal Credit They had the greatest effect in England, where the changes included first-time buyers paying stamp duty on property costing £300,000 - up from £450,000 - while the surcharge for second homes also increased, by two percentage points, to 5%. There was a rush to complete sales in March ahead of the deadline, which is also likely to have influenced prices. But Nationwide said that April marked the first decline, in its measure, since August last year. \n                  'De minimis': The rarely-examined trade clause about to become a very big deal \n                 \n                  Trump latest: Natural resources deal shows Trump 'committed to free Ukraine' - US Treasury\n                 \n                  Money blog: Lender launches sub-3% buy-to-let mortgage (with one big bit of small print)\n                 The lender's chief economist, Robert Gardner, said: \"The softening in house price growth was to be expected, given the changes to stamp duty at the start of the month. Early indications suggest there was a significant jump in transactions in March, with buyers bringing forward their purchases to avoid additional tax obligations. \"The market is likely to remain a little soft in the coming months, following the pattern typically observed following the end of stamp duty holidays. Nevertheless, activity is likely to pick up steadily as summer progresses, despite wider economic uncertainties in the global economy, since underlying conditions for potential home buyers in the UK remain supportive.\" Read more from Sky News:The people and events that defined my 11 years at Sky News - Ian King Trump declares he is 'just getting started' after 100 day milestoneBurberry checks out contenders for new chairman He pointed to the pace of wage growth continuing to outstrip inflation, coupled with low unemployment and retreating mortgage rates. Rising expectations for a Bank of England interest rate cut next week, with a growing potential for more in the months ahead, are also forecast to bolster activity. Prices have historically been supported by weak availability but estate agents have reported growth in seller listings as spring has got under way."
    },
    {
        "title": "Ian King: The people and events that defined my 11 years at Sky News",
        "description": "It's 6.25pm on Monday 2 June 2014 and my heart is racing.",
        "url": "https://news.sky.com/story/ian-king-the-people-and-events-that-defined-my-11-years-at-sky-news-13358077",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ian-king-sky-news_6900644.jpg?20250429132628",
        "type": "Business",
        "Author": "Ian King",
        "Date Published": "2025-04-30 01:15:00",
        "Headline": "In his final article for Sky News, Ian reflects on the big stories and changes he has seen and reveals what depressed and surprised him the most while covering some of the century's biggest economic shocks on camera.",
        "Content": "\n          Business presenter\n              @iankingsky\n It's 6.25pm on Monday 2 June 2014 and my heart is racing. After 20 years as a national newspaper journalist, plus a few years of working in the City before that, I am about to learn whether I can cut it as a television presenter. I'd done plenty of broadcast journalism over the years - for BBC Radio Five Live's Weekend Business and Wake Up To Money, BBC Radio Four's Today programme and regular appearances on Sky News - but these were as a guest pundit or, in media jargon, what is known as the \"presenter's friend\". This was different. Sky News had entrusted me to step into the sizeable shoes of Jeff Randall, its influential business presenter from September 2007 to March 2014. After four or five rehearsals using Jeff's old scripts, under the tutelage of experienced director Neil Hunter and with colleagues Dafydd Rees, Katie Mandel and Hannah Capella acting as guests, I was deemed ready. Broadcasting from Sky's original City Studio, on the 15th floor of the iconic Gherkin building on St Mary Axe, I awaited Neil's cue before uttering the introductory words: \"From the heart of the City, this is Ian King Live.\" \n                  'De minimis': The rarely-examined trade clause about to become a very big deal \n                 \n                  Trump latest: Natural resources deal shows Trump 'committed to free Ukraine' - US Treasury\n                 \n                  Money blog: Lender launches sub-3% buy-to-let mortgage (with one big bit of small print)\n                 That first half hour show whizzed by: our guests were Dorothy Thompson, chief executive of power generator Drax; Clive Efford, the shadow minister for sport; and Lily Cole, the model and actress. Not bad on a slow news day although during the programme, overseen by my first producer Peter Hoskins, we also broke news that Frank Lampard would be leaving Chelsea. The adrenalin was still pumping after the show but abated somewhat after John McAndrew, then executive editor and director of content at Sky News, called to declare it \"a bloody brilliant start\". Other guests that week included Andy Griffiths, UK chief executive of Samsung; Ed Balls, the shadow chancellor; Sir Tom Hunter, the billionaire entrepreneur and Tom Crotty, director at the chemicals giant Ineos. The following week our guests included Sir Terry Leahy, the former Tesco chief executive, giving his first public comments on the accounting black hole recently disclosed by the supermarket; Paul Pester, the TSB chief executive, giving his first broadcast interview ahead of the bank's stock market flotation; Keith Cochrane, chief executive of the FTSE 100 engineer Weir Group; Justin King, in his final broadcast interview as chief executive of Sainsbury's and James Quincey, then head of Coca-Cola's European business but now its global chairman and chief executive. We were up and running. Now, some 11 years on and after more than 2,000 editions of Ian King Live (the show was rechristened Business Live with Ian King at the end of June 2023), Sky News and I are parting company. The worlds of business, markets and economics have changed immeasurably in that time. In April 2014, when I joined Sky News, Walmart was the world's biggest company. It is now only the 15th largest in the S&P 500 - dwarfed by tech giants Apple, Microsoft, Alphabet, Amazon and Nvidia. Reflecting that increase in importance, US companies now make up around 65% of global stock market capitalisation, compared with just 52% then. Mark Carney was governor of the Bank of England, David Cameron was prime minister and George Osborne was chancellor; in the US, Barack Obama was president; Jack Lew was US Treasury secretary and Janet Yellen was chair of the Federal Reserve. It all seems such a long time ago now. The central bank chief with the hardest role back in April 2014, though, was Mario Draghi at the European Central Bank. Although Ireland and Portugal were about to exit the bailout packages they received at the height of the eurozone sovereign debt crisis, there was still a sense that the fire had not quite been extinguished, which was why the ECB's main policy rate was still zero. The Bank of England and the Fed still had interest rates at close to zero, too, with the latter becoming the first major global central bank to tighten monetary policy in December 2015. So there was a real sense of crisis still in the air and, over the subsequent decade and a bit, very little has changed. The 2016 Brexit referendum led to some spectacular gyrations in the value of UK equities, bonds and the pound: the day after I did my first live broadcast - from the trading floor at Monex, a stone's throw from the Bank of England - at 5.30am and was still broadcasting 11 hours later. A few months later, Donald Trump was elected for the first time, with markets rattled by his instigation of a trade war with China soon afterwards. Then, in 2020, came COVID and, for a few months, it felt as if I was never off the air, bringing news first of the market turmoil that accompanied the lockdowns and then, later, the financial responses to the pandemic from governments, central banks and businesses alike. By then, having relocated initially to the 'Baby Shard' in 2017, Sky's City Studio had moved again, this time to Fleet Place, close to the Old Bailey. Everyone will have their own memories of lockdown, suffice it to say, going into a deserted City every day was a weird and depressing experience. Not as depressing, though, as interviewing distraught business owners weeping at what the lockdowns were doing to their livelihoods and those of their employees. Some people, even some in the media industry, disparage business news as being somehow distanced from the human condition. They do not know what they are talking about. The post-COVID bounce back in late 2021 and early 2022 was great fun to report on. Animal spirits, especially in the US, were back. But then, in September 2022, came Kwasi Kwarteng's mini budget and the eventual departure of both him and Liz Truss. The latter, incidentally, was one of the more surprising interviews I did at Sky News. While in the post of justice secretary, she appeared on the programme on the evening of Philip Hammond's autumn statement in November 2016 and, in response to one particularly tricky question on the public finances, replied: \"I don't know.\" That episode serves to remind just how many changes of personnel we have had during the last 11 years. Past and present chancellors I interviewed at Sky News included Nigel Lawson, Norman Lamont, Ken Clarke, Philip Hammond and Rachel Reeves. The Bank of England has proved rather more stable although I still interviewed three governors past and present: Lord King, Mark Carney and Andrew Bailey. Companies too have undergone frequent changes of leadership. During the last 11 years I have interviewed three different chief executives of Tesco, Sainsbury's and BP, two each from - to name a few - Rio Tinto, Centrica, Land Securities, Lloyds Banking Group, Marks & Spencer, GlaxoSmithKline, BAE Systems, National Grid, British Airways, John Lewis Partnership, Prudential, easyJet, Greggs and RBS/NatWest. Few have had the same chief executive for the entire period but two CEOs who have remained in place throughout are easily among the most outstanding of their generation. One is Sir Pascal Soriot, the French genius who helped AstraZeneca stave off an unwanted takeover bid from Pfizer, before building the drugmaker into the UK's most valuable company. The other is Michael O'Leary of Ryanair, a man with a rare talent for judging customer demand and for ruthlessly exploiting gaps in the market, even though some may cavil at his communications style. And now, sadly, it is over. Thank you to the thousands of guests who submitted themselves to interview over the years and to colleagues past and present. While the presenter is the only person the viewers see on air, TV is a huge team effort, with producers, directors, runners, lighting and sound technicians and make-up artists all contributing. Above all, thank you to Sky News viewers from around the world and especially those who would get in touch with feedback. It has been a pleasure and a privilege appearing on screens on your laptops, mobile devices, trading floors, gyms, hotels and, even now, living rooms."
    },
    {
        "title": "Barclays chief mounts defence of ring-fencing as rivals push for abolition",
        "description": "The chief executive of Barclays has launched a staunch defence of Britain's bank ring-fencing regime even as his main rivals lobby the government to abolish it less than a decade after its introduction.",
        "url": "https://news.sky.com/story/barclays-chief-mounts-defence-of-ring-fencing-as-rivals-push-for-abolition-13358468",
        "image_url": "https://e3.365dm.com/23/04/1920x1080/skynews-barclays-bank-uk_6119204.jpg?20230416184715",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-30 05:43:00",
        "Headline": "Speaking exclusively to Sky News, CS Venkatakrishnan said the protection ring-fencing afforded to depositors outweighed the frictional and administrative costs triggered by the regime.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The chief executive of Barclays has launched a staunch defence of Britain's bank ring-fencing regime even as his main rivals lobby the government to abolish it less than a decade after its introduction. Speaking exclusively to Sky News, CS Venkatakrishnan said the protection that ring-fencing provided to bank depositors outweighed the costs of implementing and administering the system. His defence of ring-fencing - introduced as part of Britain's response to the 2008 financial crisis - pits Mr Venkatakrishnan firmly against the bosses of HSBC Holdings, Lloyds Banking Group, NatWest Group and Santander UK, who wrote to Rachel Reeves, the chancellor, last week to warn that the regulatory framework was inhibiting lenders' ability to help drive UK economic growth. Money latest: Boost for 1.2 million families on Universal Credit \"The point that the other banks make about a bit of friction, trapped capital and administrative costs are correct,\" Mr Venkatakrishnan said. \"However, there are two counterpoints: we have spent the money on the set-up and we make it work; but the more important fact is that you have to weigh against this the immense amount of depositor protection that the ring-fencing regime gives the country. \"The ring-fencing regime is a very good one and a very strong one. \n                  'De minimis': The rarely-examined trade clause about to become a very big deal \n                 \n                  Trump latest: Natural resources deal shows Trump 'committed to free Ukraine' - US Treasury\n                 \n                  Money blog: Lender launches sub-3% buy-to-let mortgage (with one big bit of small print)\n                 \"Depositor protection is the single-most important element of the banking system and the single-most important part of banks' engagement with society. \"I don't think ring-fencing should be relaxed or scrapped.\" The ring-fencing regime establishes a 'firewall' between banking groups' retail arms and their investment banking operations, protecting either if the other were to run into serious financial difficulties. Barclays' decision not to sign the joint letter from the CEOs of the biggest UK banks surprised some of his peers at a time when the chancellor is spearheading a push to slash red tape across the economy. On Wednesday, Barclays unveiled first-quarter results showing a better-than-expected revenue performance in its investment banking division. The bank said group profit before tax rose 19% year-on-year to £2.7bn. Earlier this week, the HSBC chief executive Georges Elhedery confirmed that he was backing the push to scrap ring-fencing. In their joint letter, the quartet of bank chiefs told Ms Reeves that: \"With global economic headwinds, it is crucial that, in support of its Industrial Strategy, the government's Financial Services Growth and Competitiveness Strategy removes unnecessary constraints on the ability of UK banks to support businesses across the economy and sends the clearest possible signal to investors in the UK of your commitment to reform. \"While we welcomed the recent technical adjustments to the ring-fencing regime, we believe it is now imperative to go further. \"Removing the ring-fencing regime is, we believe, among the most significant steps the government could take to ensure the prudential framework maximises the banking sector's ability to support UK businesses and promote economic growth.\" Banks spent billions of pounds designing and setting up their ring-fenced entities, with separate boards of directors appointed to each division. More recently, the Treasury has moved to increase the deposit threshold from £25bn to £35bn, amid pressure from a number of faster-growing banks. Read more from Sky News:The people and events that defined my 11 years at Sky News - Ian King Trump declares he is 'just getting started' after 100 day milestoneBurberry checks out contenders for new chairman Sam Woods, the current chief executive of the main banking regulator, the Prudential Regulation Authority, was involved in formulating proposals published by the Sir John Vickers-led Independent Commission on Banking in 2011. Legislation to establish ring-fencing was passed in the Financial Services Reform (Banking) Act 2013, and the regime came into effect in 2019. In addition to ring-fencing, banks were forced to substantially increase the amount and quality of capital they held as a risk buffer, while they were also instructed to create so-called 'living wills' in the event that they ran into financial trouble. The chancellor has repeatedly spoken of the need to regulate for growth rather than risk - a phrase the four banks hope will now persuade her to abandon ring-fencing. Britain is the only major economy to have adopted such an approach to regulating its banking industry - a fact which the bank chiefs say is now undermining UK competitiveness. \"Ring-fencing imposes significant and often overlooked costs on businesses, including SMEs, by exposing them to banking constraints not experienced by their international competitors, making it harder for them to scale and compete,\" the letter said. The four bosses called on Ms Reeves to use this summer's Mansion House dinner - the City's annual set-piece event - to deliver \"a clear statement of intent…to abolish ring-fencing during this Parliament\". Doing so, they argued, would \"demonstrate the government's determination to do what it takes to promote growth and send the strongest possible signal to investors of your commitment to the City and to strengthen the UK's position as a leading international financial centre\"."
    },
    {
        "title": "Savings Guide: The current best rates to make the most of your cash ",
        "description": "As we approach another Bank of England base rate decision next Thursday, the markets are expecting to see a cut from the Monetary Policy Committee, writes Anna Bowes, savings expert from The Private Office.",
        "url": "https://news.sky.com/story/savings-guide-the-current-best-rates-to-make-the-most-of-your-cash-13358583",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-money-blog_6879919.jpg?20250408154535",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-30 10:12:00",
        "Headline": "Anna Bowes, savings expert from The Private Office, looks at what's happening across the savings estate to help you decide where is best to put your money right now. All data accurate as of 30 April 2025.",
        "Content": "As we approach another Bank of England base rate decision next Thursday, the markets are expecting to see a cut from the Monetary Policy Committee, writes Anna Bowes, savings expert from The Private Office. So, ahead of that meeting, I thought I'd round up some of the most popular accounts and see how the top rates have fared recently. Easy access There is now more than £900bn in easy access savings accounts, according to the latest figures from the Bank of England. Much of this is likely to be earning a poor rate of interest, especially if it is languishing with the high street banks. There is also a staggering £301bn sitting in current accounts earning no interest at all. There are plenty of competitive rates available, paying more than inflation and even a few paying more than the base rate of 4.5%. \n                  100% chance that Bank of England will cut interest rates next month, markets predict\n                 \n                  Bank of England cautious as inflationary tiger stalks weak economy\n                 \n                  Bank of England holds interest rate at 4.5% amid trade war uncertainty\n                 But it's important to look beyond the headline rates as many of the top accounts have restricted access and/or short-term bonus rates. There have been small positive changes to leading accounts over the past month. At the beginning of April, the top rate available was 4.75% and the average across the top five accounts was 4.67%. Last week, the financial app Chip launched the Chip Easy Access Saver, which has gone to the top of the table, offering 4.76% AER. However, this account allows only three penalty-free withdrawals a year - any more and the rate drops to 2.1% for the rest of the year. In addition, it includes a 12-month bonus rate of 1.20%. There are plenty of straightforward accounts available too. The latest issue of Charter Savings Banks Easy Access Account (Issue 58) is paying 4.59% AER, with no bonus or restricted access. Easy access cash ISAs It's another positive story in the easy access best buy table, with two more accounts paying more than 5% AER. This means the top rates on offer are paying more than the non-ISA equivalents - even more of an incentive to make sure you use your cash ISA allowance - which remains at £20,000 this tax year, although this is under review. These two new accounts are available via financial app companies Plum and MoneyBox, paying 5.06% and 5.05% respectively. They are not banks in their own right, so your money is deposited with their partners CitiBank, in the case of Plum, and a split between Santander and HSBC if you opt for MoneyBox. Your cash is protected by the Financial Services Compensation Scheme, assuming you don't hold £85,000 with these banks already. If you'd rather not use a financial app, Vida Savings has a Defined Access ISA Issue 1 paying 4.63% AER. This account can be opened online with a minimum of £100 but, as the name suggests, you are restricted on the amount of penalty-free withdrawals that can be made each year. Charter Savings Bank, which is also an online account, is paying 4.59% on its Easy Access Cash ISA Issue 57, but this allows you to make as many withdrawals as you like. Fixed-rate bonds Although some of the best buy fixed-term bond rates available have fallen a little in the past month, there are still plenty of inflation-busting accounts available. Now could be the time to fix given the base rate is expected to fall next month. Read more: Biggest monthly decline in house prices since August 2023, lender saysBarclays chief mounts defence of ring-fencing as rivals push for abolition At the beginning of April, you could have fixed for one year at 4.70% - today it's a little less at 4.65% AER. That's still higher than inflation, 2.6%, even if tax is deducted. The top rates for longer fixes have fallen but, again, only by a very small amount. You can still lock in for two years at 4.53%, three years at 4.55% and five years at 4.56%. Fixed-rate ISAs The drops have been a little harsher for fixed-rate ISAs. That said, you can still find accounts paying more than 4.20%. Two-year and five-year terms are both paying 4.30%, the top one-year cash ISA is paying 4.26%, and the top three-year ISA pays 4.20%. Although the top ISA rates look lower than the bond rates, if you pay tax on your savings, the net rate is likely to be lower. Example  If you were to deduct the basic rate tax, 20%, from the LHV Bank one-year bond paying 4.65%, the post-tax rate is 3.72%. On a balance of £20,000, you would take home £744 from the bond, whereas you would take home £852 from the top one-year tax free ISA. If you are not a taxpayer or you are not yet fully using your personal savings allowance, then the ISA might not be the best choice."
    },
    {
        "title": "Channel 4 chief Mahon to run live entertainment group Superstruct",
        "description": "Alex Mahon, the Channel 4 chief executive, is to become the new boss of the live entertainment group behind Cornwall&#8217;s Boardmasters festival.",
        "url": "https://news.sky.com/story/channel-4-chief-mahon-to-run-live-entertainment-group-superstruct-13358471",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-alex-mahon-channel-4_6291720.jpg?20230920145027",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-30 05:48:00",
        "Headline": "Alex Mahon, whose exit as CEO of the state-owned broadcaster was announced this week, is to run the company behind the Boardmasters and Sonar music festivals, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Alex Mahon, the Channel 4 chief executive, is to become the new boss of the live entertainment group behind Cornwall’s Boardmasters festival. Sky News has learnt that Ms Mahon, whose departure after eight years at the state-owned broadcaster was announced earlier this week, is to take the helm at Superstruct Entertainment. Superstruct, which is owned by the buyout firms KKR and CVC Capital Partners, is expected to announce the appointment this week, according to private equity insiders. It is understood to have been briefing festival management teams on Ms Mahon's move on Wednesday morning. Money latest: Boost for 1.2 million families on Universal Credit Her arrival will give Ms Mahon the opportunity to earn a more lucrative remuneration package than the one on offer to her at Channel 4. Superstruct owns and operates more than 80 music festivals across 10 countries in Europe and Australia. \n                  'De minimis': The rarely-examined trade clause about to become a very big deal \n                 \n                  Trump latest: Natural resources deal shows Trump 'committed to free Ukraine' - US Treasury\n                 \n                  Money blog: Lender launches sub-3% buy-to-let mortgage (with one big bit of small print)\n                 Since the company was established in 2017 by Providence Equity Partners, its former owner, Superstruct has expanded both organically and through acquisitions into a major live entertainment group. Its portfolio includes some of Europe's most popular festivals, including Wacken Open Air, Defqon.1, Tinderbox, Boardmasters and Sónar, which is held annually in Barcelona. KKR and CVC both declined to comment on Wednesday. Ms Mahon's arrival at the company comes nearly a year after it was bought by KKR in a deal worth about £1bn. CVC took a minority stake in the business several months later. Her exit from Channel 4 came as little surprise given the length of her tenure, and leaves the television group hunting a new boss. \"I feel lucky beyond belief to have had the chance to lead Channel 4 for nearly eight years - through calm seas (very few) and stormy waters (more than our fair share),\" Ms Mahon said on Monday. \"From navigating the threat of privatisation (twice), to shifting out of London, to digital transformation, lockdowns, political upheaval, advertising chaos - there has never been a dull moment.\" Channel 4 was in line to be privatised under the last Conservative government, with a number of bidders weighing offers for it before the process was pulled."
    },
    {
        "title": "Lavazza and Dualit adverts banned after making 'misleading' compostable claim",
        "description": "Two coffee companies have had adverts banned for making the \"misleading\" suggestion that their coffee pods and bags could be composted at home.",
        "url": "https://news.sky.com/story/lavazza-and-dualit-adverts-banned-after-making-misleading-compostable-claim-13358504",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-lavazza-coffee_6901325.jpg?20250430091817",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-30 09:09:00",
        "Headline": "Adverts showcasing Lavazza's Eco Caps coffee pods and Dualit's compostable coffee bags have been banned after the Advertising Standards Authority ruled they were likely to mislead consumers.",
        "Content": "Two coffee companies have had adverts banned for making the \"misleading\" suggestion that their coffee pods and bags could be composted at home. The Advertising Standards Authority (ASA) said the ad for Lavazza's Eco Caps coffee pods, which stated that customers could achieve a \"coffee shop taste in compostable capsules for your home\", gave the misleading impression that the pods could be composted at home, when in fact they could only be composted in an industrial setting. Similarly, the ad for \"Dualit's compostable coffee bags\" implied that the pouches could be composted domestically when this was not the case. Money blog: Follow latest updates The ASA said the products had been certified to the European Standard EN13432, meaning they were designed to break down within an industrial compost and would not necessarily break down within a domestic compost. If the product did break down in a domestic compost, it has the potential to leave toxic matter, while compostable plastics placed into recycling collections could contaminate them, the ASA added. Responding to the ASA, Lavazza said consumers would understand the word \"compostable\" means that a product was made of compostable material, and not necessarily that it was able to be used in compost systems at home. The coffee giant said it was not its intention for consumers to understand the ad as suggesting the capsules were home compostable, adding that its website stated that they were certified for industrial composting. Dualit said similar, adding its coffee bags had been certified as industrially compostable and were made from polylactic acid, a material derived from sugars extracted from plants and ground coffee. Read more from Sky News:Stamp duty changes knock house pricesBA opens routes to 'little Naples' Despite disagreeing with the ASA's decision, Lavazza said it amended its advert and took it offline around 10 months ago. The ASA said: \"We know that when it comes to making purchasing decisions, the public are keen to make choices with the environment in mind. \"It's important that brands are clear about how easy it is to dispose of products in an environmentally friendly way, so people aren't misled.\""
    },
    {
        "title": "Labour promised MPs a vote on Trump trade deal - now Starmer doesn't seem so sure",
        "description": "Will MPs get a vote on a trade deal with Donald Trump?",
        "url": "https://news.sky.com/story/labour-promised-mps-a-vote-on-trump-trade-deal-now-starmer-doesnt-seem-so-sure-13358816",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-trump-starmer-jon-craig_6764696.jpg?20241202195020",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-04-30 16:15:00",
        "Headline": "After being pushed repeatedly by MPs on whether they would be getting a vote on a US trade deal, Sir Keir Starmer appears to have shifted course from a promise made when he was leader of the opposition.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Will MPs get a vote on a trade deal with Donald Trump? It used to be Labour policy, though Sir Keir Starmer didn't sound keen on the idea at Prime Minister's Questions. The PM was challenged, first by Lib Dem MP Clive Jones, who wants a guarantee that parliament has the final say on any trade deal, including one with the US. \"This idea is not new,\" said Clive, who used to be a director of various toy companies, and was president, chairman and director of the British Toy and Hobby Association, no less. \"It's exactly what Labour promised to do in an official policy paper put forward in 2021, so I am asking this government to keep their promise,\" he continued. And, toying with the PM, he complained: \"Currently, members of parliament have no vote or voice on trade deals.\" In reply, Sir Keir gave one of those non-answers we're becoming used to at PMQs, saying rather tetchily: \"As he knows, parliament has a well-established role in scrutinising and ratifying trade deals.\" \n                  Blair's net zero comments less an 'attack' and more a highlighting of a policy paradox that's been clear for some time\n                 \n                  Tory-Reform coalition would be 'disaster for Britain', says Sir Keir Starmer as he defends immigration record\n                 \n                  Day 96: 'Vladimir STOP!' Will Trump's plea to Putin make a difference?\n                 Later, Sir Ed Davey had a go. \"Will the government give MPs a vote on the floor of the House on any deal he agrees with President Trump? Yes or no?\" he asked. He fared no better. Sir Keir said again: \"If it is secured, it will go through the known procedures for this House.\" Read more on the trade deal:US 'positive' on talksDeal 'possible' but not 'certain'  So what are parliament's \"well-established role\" and \"the known procedures\"? And what exactly did Labour promise in opposition back in 2021? The 2021 promise was, in fact, one of those worthy pledges parties make in opposition and then either conveniently forget about or water down when they're in government. U-turn if you want to. The policy paper referred to by Mr Jones was: \"Labour's trade policy: putting workers first\" - published in September 2021 by Emily Thornberry when she was shadow international trade secretary. The secretary of state at the time was none other than Liz Truss. Whatever happened to her? Come to think of it, whatever happened to Emily Thornberry? Back then idealistic Emily declared in her policy paper: \"We will reform the parliamentary scrutiny of trade agreements… \"So that MPs have a guaranteed right to debate the proposed negotiating objectives for future trade deals, and a guaranteed vote on the resulting agreements…\" A guaranteed vote. Couldn't be clearer. And there was more from Emily. \"…with sufficient time set aside for detailed scrutiny both of the draft treaty texts and of accompanying expert analysis on the full range of implications, including for workers' rights.\" Sufficient time for detailed scrutiny. Again, couldn't be clearer. Then came a section headed: Parliamentary Scrutiny of Trade Deals. \"The Constitutional Reform and Governance Act 2010 (CRAG) dictates that international treaties (including trade agreements) must be laid before parliament for a period of 21 sitting days before they can become law,\" we were told back then. \"At present, a treaty can only be challenged and (temporarily) rejected by means of an opposition day debate, if one is granted by the government within that time. \"The CRAG legislation was agreed by parliament before Brexit was on the horizon. Its procedures for the ratification of trade treaties, which were then negotiated and agreed at EU level, were given no consideration during the passage of the Act, and no one envisaged that they would become the mechanism for parliamentary scrutiny of the government's post-Brexit trade deals… \"Despite the flagrant evidence of the inadequacy of the CRAG Act to allow proper oversight of trade deals, the government repeatedly blocked numerous cross-party proposals to improve the processes for parliamentary scrutiny and approval during passage of the 2021 Trade Act. \"A future Labour government will return to those proposals, and learn from best practice in other legislatures, to ensure that elected MPs have all the time, information and opportunity they need to debate and vote on the UK's trade deals, both before negotiations begin and after they conclude.\" So what's changed from the heady days of Liz Truss as trade secretary and Labour's bold pledges in opposition? Labour's in government now, that's what. Hence the U-turn, it seems. Parliament's role may be, as Sir Keir told MPs, \"well-established\". But that, according to opponents, is the problem. It's contrary to what Labour promised in opposition. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Sir Ed hit back at the PM: \"I'm very disappointed in that reply. There was no 'yes' or 'no' response. We do want a vote, and we will keep pressing him and his government on that.\" And true to their word, Mr Jones and another Lib Dem MP, Richard Foord, have already tabled private member's bills demanding a final say on any trade deal with President Trump. Watch this space. And also watch out for Labour MPs also backing demands for a Commons vote on a Trump trade deal before long."
    },
    {
        "title": "Farage hoping to win three mayoralties and another MP - but says biggest risk is not delivering on promises",
        "description": "Nigel Farage is hoping to win two or three mayoralties in this week local elections - and perhaps even the Runcorn and Helsby by-election.",
        "url": "https://news.sky.com/story/farage-hoping-to-win-three-mayoralties-and-another-mp-but-says-biggest-risk-is-not-delivering-13358865",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-nigel-farage-reform_6902067.jpg?20250430193656",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-30 18:19:00",
        "Headline": "The Reform UK leader has high hopes for the elections taking place next week. However, he is cautious about the impact it would have on his reputation if his outfit wins councils but does not deliver.",
        "Content": "Nigel Farage is hoping to win two or three mayoralties in this week local elections - and perhaps even the Runcorn and Helsby by-election. But the Reform UK leader revealed to Sky News political editor Beth Rigby his biggest fear is \"winning but not delivering\". Councillors across England are facing election on Thursday, as well as six mayoralties being up for grabs. Politics latest: Why PM looks set to U-turn And the Runcorn and Helsby by-election is taking place after Labour's Mike Amesbury resigned, having punched a constituent. Mr Farage is hoping to build on the momentum he built last year at the general election - and says he wants to replace the Conservatives as the main opposition party. Asked what his goals were, the Reform leader said he was feeling more and more \"optimistic\" about winning in the by-election. As for the rest of the votes, Mr Farage said: \"I think national vote share, we're going to do very, very well. I think mayoralties, I think we'll win two, maybe three.\" He highlighted Hull, Lincolnshire and perhaps Doncaster as his party's best hopes. Mr Farage was also asked about whether his party would - at a local level - do deals with the likes of Labour and Tory councillors in order to control local authorities. He said that any agreement would have to be done on the grounds that all parties agree to council finances being audited, and also that local authorities \"stop fighting climate change - things like that\".  Read more:Starmer warns against Tory-Reform pactBadenoch warns of 'long road ahead' for Tories But Mr Farage said he did not want to be making deals with Labour or the Conservatives. Asked what the biggest risk to his party was, Mr Farage said: \"The biggest risk is succeeding, winning mayoralties, perhaps winning control of county councils, and not delivering.\" He said if Reform doesn't deliver, then voters will say the party is \"just like\" the others. Mr Farage said his party is doing well because it is trusted, and voters have lost faith in others. The Reform UK leader was also asked about his stance on the NHS. Mr Farage stated that he wants to see the way the health service is funded changed. He said that he wants it to be \"free at the point of delivery\", but not \"funded through general taxation\". He claimed the UK gets \"worse bang for buck\" than any other country when it comes to health spending. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Mr Farage said it would be \"odd\" for Labour to be in the position where it is upset at the suggestion that rich people might have to pay for healthcare. The interview with Nigel Farage is part of a series of election previews with all major parties invited."
    },
    {
        "title": "Half-tonne piece of Soviet rocket to crash back down to Earth in coming days",
        "description": "A car-sized piece of Soviet rocket is expected to come crashing back down to Earth in the coming days, after 53 years in orbit.&#160;",
        "url": "https://news.sky.com/story/half-tonne-piece-of-soviet-rocket-to-crash-back-down-to-earth-in-coming-days-13358613",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-venera-4-space-probe_6900958.jpg?20250429170851",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-04-30 11:03:00",
        "Headline": "A heat-protected capsule that the USSR had intended to reach Venus is on a collision path with Earth, with astronomer Marco Langbroek predicting it will hit around 10 May.",
        "Content": "\n          Science and Technology reporter\n       A car-sized piece of Soviet rocket is expected to come crashing back down to Earth in the coming days, after 53 years in orbit.  \"It's a half-tonne thing falling out of the sky at a couple of hundred miles an hour. That's going to hurt if it hits you,\" said one astronomer to Sky News. Cosmos 482 was destined to land on Venus after being launched from the USSR's spaceport in what is now Kazakhstan in 1972. Instead, the upper stage of the rocket, which was responsible for powering it out of orbit, failed. \"The upper stage didn't work right and it left just the probe in orbit around the Earth,\" said Smithsonian astronomer Jonathan McDowell. Parts of the rocket re-entered the Earth's atmosphere in the 1980s but one chunk remained in orbit, which was thought to be debris left from the spacecraft.  \"Years later, I went and looked at the data and went, 'This debris [...] stayed up a lot longer than the other stuff. It seems to be denser. It's not behaving like debris,\" said Mr McDowell. \n                  The evidence from planet K2-18b suggesting it may be teeming with microbial life is tantalising\n                 \n                  Katy Perry floats in space as part of star-studded all-female Blue Origin mission\n                 \n                  Blue Origin rocket launch - as it happened: What Katy Perry sang in space and how all-female crew reacted to flight\n                 \"I realised that it was the Venus entry capsule from Cosmos 482, which has got a heat shield on it [strong enough] to survive the crushing force of Venus's atmosphere.\" Now, the heat-protected capsule is on a collision path with Earth, with astronomer Marco Langbroek predicting it will hit around 10 May.  \"It's half a tonne. It's about three feet across,\" said Mr McDowell. \"As it smashes into the atmosphere, going at this enormous speed, the energy gets converted into heat [and] you get this fireball.\" By the time it hits the Earth, Mr McDowell says Cosmos 482 will be \"going only a couple of hundred miles an hour\". \"But it's still a half-tonne thing falling out of the sky at a couple of hundred miles an hour. That's going to hurt if it hits you,\" he said. Read more from Sky News:Ransacked and looted: Sky reporter returns to family homeTrump celebrates 100 days in officeSixteen-year-old detained after three people killed in Sweden Scientists can't predict where it will hit, although they have narrowed it down to between 51 degrees north and 51 degrees south. \"If you're a penguin, you're probably fine,\" said Mr McDowell. \"But if you live anywhere from Chile to Scotland, you're in the zone.\"  Much of the surface is covered in ocean, however, and the lander is around the size of a car, so the chances of it hurting someone are low. For Mr McDowell, Cosmos 482 is just an illustration of a bigger problem. \"It's getting really crowded out there and we're getting more and more dependent on satellites for our everyday lives,\" he said. \"I think the time is coming when we're really going to have to get more serious about cleaning up space junk.\""
    },
    {
        "title": "Who are Scattered Spider? How the notorious hackers linked to M&S cyber attack work",
        "description": "M&S may have been hacked by a group of notorious cyber-criminals known as Scattered Spider, some of whom are believed to be English-speaking teenagers.",
        "url": "https://news.sky.com/story/who-are-scattered-spider-the-infamous-young-hacking-group-linked-to-ms-cyber-attack-13358559",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-m-and-s-marks-and-spencer_6893936.jpg?20250422165451",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-04-30 09:09:00",
        "Headline": "\"Scattered Spider is one of the most dangerous and active hacking groups we are monitoring,\" said one cyber security expert to Sky News.",
        "Content": "\n          Science and Technology reporter\n       M&S may have been hacked by a group of notorious cyber-criminals known as Scattered Spider, some of whom are believed to be English-speaking teenagers. For more than a week, the British retailer has been unable to accept contactless payments and customers are also unable to shop online. On Monday, Sky News reported that hundreds of agency workers at its main distribution centre were told to stay at home as M&S grappled with the attack. Shoppers also complained of empty shelves around the country, as M&S confirmed there were \"pockets of limited availability in some stores\" as a result of measures to manage the cyber incident. Who are Scattered Spider, the infamous group being linked to the attack? \"Scattered Spider is one of the most dangerous and active hacking groups we are monitoring,\" said Graeme Stewart, the head of public sector at security company Check Point. \"Since they first appeared in 2022, they have been linked to more than 100 targeted attacks across industries such as telecoms, finance, retail and gaming,\" he said. \n                  The UK is 'widely' underestimating online threats from hostile states and criminals, cyber security chief warns\n                 \n                  UK in AI arms race with Russia as Putin 'wants destruction', minister to warn\n                 \n                  Scottish man linked to hacking group 'Scattered Spider' among five charged in US\n                 In one of their most infamous hacks, members of the group locked up the networks of casino operators Caesars Entertainment and MGM Resorts International, and demanded hefty ransoms. Caesars paid the hackers about $15m (£11.2m) to restore its network.  Who are the members of Scattered Spider? \"The group is made up of young, English-speaking individuals, mainly based in the UK and the US,\" said Mr Stewart. Some members are believed to be as young as 16, with the group meeting up on hacker forums online. The authorities have a hard time catching Scattered Spider members because they are just that: scattered. \"This is not a loose group of opportunistic hackers. They operate more like an organised criminal network, decentralised and adaptive. \"Even with several arrests made in the US and Europe, their structure allows them to regroup quickly.\" Last month, an alleged Scattered Spider member was extradited to the US from Spain and charged with offences including wire fraud and aggravated identity theft. How do they work? The group often targets human vulnerabilities, according to Mr Stewart, rather than system flaws. They use tactics like social engineering, where hackers trick people into letting them into systems, impersonating IT staff or SIM swapping. SIM swapping attacks are where hackers trick phone providers into transferring a victim's phone service to a SIM card under the hacker's control. Read more from Sky News:Ransacked and looted: Sky reporter returns to family home in SudanTrump celebrates 100 days in officeSixteen-year-old detained after three people killed in Sweden This means the hacker can approve two-factor authentication and access the victim's private accounts as well as installing malware on certain devices. \"The attack on M&S appears to be heavily financially motivated and focused on making as much money as possible,\" said Jake Moore, global cybersecurity adviser at cybersecurity firm ESET. \"The gained notoriety focused on the brand - which is so entrenched in British culture and history - just places even more pressure on M&S to pay the growing demands.\"  What does M&S say? Sky News contacted M&S which referred us to its previous statement. \"As part of our proactive management of a cyber incident, we have made the decision to pause taking orders via our M&S.com websites and apps. \"Our product range remains available to browse online. We are truly sorry for this inconvenience. Our stores are open to welcome customers. \"We informed customers that there was no need for them to take any action. That remains the case, and if the situation changes we will let them know.\""
    },
    {
        "title": "Blair's net zero comments less an 'attack' and more a highlighting of a policy paradox that's been clear for some time",
        "description": "Judging by the headlines, Sir Keir Starmer&#8217;s predecessor has gone for the jugular.",
        "url": "https://news.sky.com/story/blairs-net-zero-comments-less-an-attack-and-more-a-highlighting-of-a-policy-paradox-thats-been-clear-for-some-time-13358839",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-blair-tony_6902018.jpg?20250430182824",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-04-30 17:17:00",
        "Headline": "Newspapers today claimed Tony Blair had launched an attack on Labour's net zero plans - but this isn't quite the case.  And the former prime minister made a strong point.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n Judging by the headlines, Sir Keir Starmer’s predecessor has gone for the jugular. \"Net zero is doomed to fail, warns Tony Blair,\" wrote The Times; \"Blair blows hole in Labour's net zero plans,\" said The Independent; \"Net zero is doomed, Blair tells Starmer,\" cheered The Daily Telegraph. Clearly a direct attack on one of Sir Keir's central missions for government, and on the eve of local elections, no less. Yet at the despatch box later - \"in full head teacher mode,\" according to our politics team - Mr Starmer scolded the house. \"If you look at the details of what Tony Blair said, he's absolutely aligned with what we're doing here.\" Just the sort of thing a wounded prime minister might say after being so publicly skewered. Being the good pupil that I am, I'd read what Tony Blair actually wrote, and Sir Keir kind of has a point. Nowhere in his so-called \"attack\" does Blair directly criticise UK policy. His foreword, and the report itself, are focused instead on the wider, global contradiction around net zero. Namely, how, despite all the climate summits, the expansion of renewable energy and roll-out of electric cars, fossil fuel consumption is still going up. The paradox identified in the report - and plain to many of us who've been following net zero for a while - is that just as the world finally accepts the danger of climate change, there's growing resistance to do anything about it. The problem, rightly identified by the report, isn't with the net zero goal - but the narrative. To net zero sceptics, the goal is a virtue-signalling act of national self-harm that will hobble the UK while the rest of the world pollutes its way to economic superiority. To net zero adherents, including many in government, it means an opportunity to replace fossil fuels with something better that will also secure our economic future. Read more:Environment secretary defends green policiesDrivers 'confused' by electric vehicle transition Following the headlines this morning, the Tony Blair Institute for Global Change (TBI) put out a clarification. It stated its report was clear in its support for the government's 2050 net zero targets and that by supporting technologies to replace fossil fuels, the government's approach \"is the right one\".  Today's media reaction to the report effectively proves how correct its analysis is. The policy details around replacing fossil fuels with cheaper and cleaner alternatives don't sell papers or win votes. Nor does persuading people that eating slightly less meat might be better for them too, not just animals and the planet. But presenting net zero as a morally-charged culture war - a binary choice between fossil-fuelled doom or solar-powered salvation - does. And that, in a nutshell, is the problem."
    },
    {
        "title": "Kneecap row: Paul Weller and Primal Scream lead musicians in signing open letter in support of rap trio",
        "description": "Paul Weller, Primal Scream and DJ Annie Mac are among the music stars who have signed a letter in support of rap group Kneecap.",
        "url": "https://news.sky.com/story/kneecap-row-paul-weller-and-primal-scream-lead-musicians-in-signing-open-letter-in-support-of-rap-trio-13358969",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kneecap-rap-trio-ifta_6899609.jpg?20250428104545",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-30 21:14:00",
        "Headline": "The letter said there had been a \"clear, concerted attempt to censor and ultimately deplatform\" the Belfast trio amid controversy surrounding their comments. ",
        "Content": "Paul Weller, Primal Scream and DJ Annie Mac are among the music stars who have signed a letter in support of rap group Kneecap. The politically-charged Belfast trio, who are no strangers to controversy, have faced criticism in recent weeks following a performance at US festival Coachella in which they displayed the message \"F*** Israel. Free Palestine\". Then came the emergence of footage, taken from a gig at London's Kentish Town Forum last November, which appeared to show one member of the group shouting \"up Hamas, up Hezbollah\". Video also emerged from a November 2023 gig, appearing to show one member of the group saying: \"The only good Tory is a dead Tory. Kill your local MP.\" Conservative leader Kemi Badenoch called for Kneecap to face prosecution over the two videos, while Glastonbury Festival is now facing pressure to drop them from this year's line-up. A handful of the group's gigs have been cancelled, including one that was set to take place at Cornwall's Eden Project. In an open letter, the group's record label, Heavenly Recordings, said there had been a \"clear, concerted attempt to censor and ultimately deplatform\" the group. More than 40 music acts have now signed the letter. It reads: \"As artists, we feel the need to register our opposition to any political repression of artistic freedom. \"In a democracy, no political figures or political parties should have the right to dictate who does and does not play at music festivals or gigs that will be enjoyed by thousands of people.\" It also accuses politicians of \"strategically concocting moral outrage over the stage utterings of a young punk band\" while ignoring a \"genocide\" in Gaza. \"Kneecap are not the story. Gaza is the story. Genocide is the story,\" it says. \"And the silence, acquiescence and support of those crimes against humanity by the elected British Government is the real story. \"Solidarity with all artists with the moral courage to speak out against Israeli war crimes, and the ongoing persecution and slaughter of the Palestinian people.\" Annie Mac, Beoga, Bicep, Biig Piig, Blindboy Boatclub, Bob Vylan, Christy Moore, Damien Dempsey, Delivery, Dexys, English Teacher, Enter Shikari, Fontaines D.C., Gemma Dunleavy, Gurriers, Idles, Iona Zajac, Jelani Blackman and John Francis Flynn. Joshua Idehen, Katy J Pearson, Kojaque, Lankum, Lisa O’Neill, Lowkey, Massive Attack, Martyn Ware, Paul Weller, Peter Perrett, Poor Creature, Primal Scream and Pulp. Roisin El Cherif, Shirley Manson, Sleaford Mods, Soft Play, The Mary Wallopers, The Pogues, Thin Lizzy and Toddla T. Instagram accounts belonging to other acts, including Mercury Prize nominees Yard Act, have commented on post featuring the statement, asking to be added. Elsewhere, trip hop collective Massive Attack put out their own statement supporting Kneecap.  It comes as the Metropolitan Police is assessing the \"kill MPs\" video clip, along with the 2024 video in which a band member appeared to say \"up Hamas, up Hezbollah\". In a statement posted on Instagram, the group - made up of Liam Og O Hannaidh, Naoise O Caireallain and JJ O Dochartaigh - addressed the families of murdered MPs Sir David Amess and Jo Cox, saying: \"We never intended to cause you hurt.\" Read more:Why are Kneecap controversial?Kneecap remarks 'dangerous' says Sir David Amess's daughter Kneecap said they \"reject any suggestion that we would seek to incite violence against any MP or individual\". \"Kneecap's message has always been - and remains - one of love, inclusion, and hope,\" the post added."
    },
    {
        "title": "Harvey Weinstein accuser felt 'the unthinkable was happening' during alleged assault ",
        "description": "A former TV production assistant has told a court she felt \"the unthinkable was happening\" during an alleged assault by Harvey Weinstein.",
        "url": "https://news.sky.com/story/harvey-weinstein-accuser-felt-the-unthinkable-was-happening-during-alleged-assault-13358814",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-weinstein-new-york_6901988.jpg?20250430174203",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-30 16:19:00",
        "Headline": "Miriam Haley - who also testified at the former movie mogul's initial trial - has accused Harvey Weinstein of forcing himself on her in July 2006. ",
        "Content": "A former TV production assistant has told a court she felt \"the unthinkable was happening\" during an alleged assault by Harvey Weinstein. Warning: This article contains references to sexual assault Miriam Haley is the first of the former movie mogul's accusers to testify at his retrial, which is taking place as New York's highest court overturned Weinstein's 2020 conviction. The former studio boss, 73, has pleaded not guilty to one charge of rape and two of forcing oral sex. He denies sexually assaulting anyone. Ms Haley, who also goes by the name Mimi Haleyi, today told the court Weinstein held her down and forced oral sex on her after she told him: \"No, no - it's not going to happen.\" She dabbed her eyes as she recalled in court what went through her mind during the alleged July 2006 assault. \"The unthinkable was happening, I just thought any unthinkable thing could happen,\" she said. \"I just didn't know where it ended.\" Weinstein, sitting between his lawyers, shook his head as she spoke. Ms Haley also testified at Weinstein's initial trial. She began her testimony yesterday by describing how she got to know Weinstein, saying she had some inappropriate and suggestive interactions with him, while others were polite and professional. Ms Haley maintains she was always looking to forge a professional connection - not sex or romance - with the Miramax founder. Read more: What has happened to the #MeToo movement? Weinstein's lawyers are yet to question Ms Haley, but the defence has sought, often unsuccessfully, to object to prosecutors' questions, such as whether Ms Haley had any sexual interest in the then-powerful producer. She said she did not. The defence has argued that all of Weinstein's accusers consented to sexual activities with him in the hopes of getting work in show business. The 73-year-old's retrial includes charges based on allegations from Haley and Jessica Mann, an actress who alleges Weinstein raped her in 2013. For the first time, he is also being tried on an allegation of forcing oral sex on a former model, Kaja Sokola, in 2006."
    }
]