[
    {
        "title": "Israel says body returned by Hamas is not that of hostage Shiri Bibas",
        "description": "Israel says Hamas has not handed over the body of hostage Shiri Bibas - saying they had instead received the remains of an \"anonymous body without identification\".",
        "url": "https://news.sky.com/story/israel-says-it-has-not-received-hostages-remains-and-hamas-handed-over-unidentified-body-13313681",
        "image_url": "https://e3.365dm.com/23/11/1920x1080/skynews-shiri-bibas-ariel-kfir_6376697.jpg?20231129151946",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-20 23:19:00",
        "Headline": "The Israeli military, which confirmed it had received the bodies of Ms Bibas' two young sons, has accused Hamas of a \"serious violation\" of the ceasefire agreement.",
        "Content": "Israel says Hamas has not handed over the body of hostage Shiri Bibas - saying they had instead received the remains of an \"anonymous body without identification\". Ms Bibas was kidnapped with her sons - four-year-old Ariel, and nine-month-old Kfir - from the Niz Or kibbutz during the Palestinian militant group's incursion into Israel in October 2023. The Israel Defense Forces (IDF) confirmed they received the bodies of Ariel and Kfir on Thursday. However, they said the body that Hamas had claimed was their mother was not her and the group had therefore violated the ceasefire agreement. In a statement, the IDF said: \"During the identification process, it was found that the additional body received was not that of Shiri Bibas, and no match was found for any other abductee. It is an anonymous body without identification. \"This is a very serious violation by the Hamas terrorist organisation, which is required by the agreement to return four dead abductees. We demand that Hamas return Shiri home along with all of our abductees.\" The IDF added: \"We share the deep sorrow of the Bibas family at this difficult time and will continue to make every effort to return Shiri and all the kidnapped as soon as possible.\" \n                  German election: From AI influencers to Russian disinformation, the far-right is getting a leg up online \n                 \n                  Buses explode in Israel - as military blocks entry to some areas of West Bank\n                 \n                  Ukraine war latest: Washington 'cancels' news conference after Zelenskyy meets US official\n                 The body of journalist and peace activist Oded Lifshitz, who was 83 when he was abducted, was also handed over on Thursday. Hamas has said they were all killed in Israeli airstrikes near the start of the war. The group has never provided evidence to back this up, while Israel has not confirmed the claims.  Hamas handed over the remains as part of the Gaza ceasefire agreement which was reached with Israel last month. The bodies were transferred in four black coffins in a carefully orchestrated public display as a crowd of Palestinians and dozens of armed Hamas militants watched. Israelis lined the road in the rain near the Gaza border to pay their respects as the convoy carrying the coffins drove by. In Tel Aviv, people gathered, some weeping, in a public square opposite Israel's defence headquarters that has come to be known as Hostages Square. Meanwhile, Israeli Prime Minister Benjamin Netanyahu vowed to eliminate Hamas and said the four coffins meant \"more than ever\" that Israel had to ensure there was no repeat of the 7 October attack. Mr Netanyahu said: \"Our loved ones' blood is shouting at us from the soil and is obliging us to settle the score with the despicable murderers, and we will.\" Read more:Trump 'very frustrated' with ZelenskyyBuses explode in Israel in 'terror incident'Trump's direction of travel doesn't look good for Kyiv Israel's President Isaac Herzog said: \"Agony. Pain. There are no words. Our hearts - the hearts of an entire nation - lie in tatters.\" United Nations human rights chief, Volker Turk, called the parading of the four bodies \"cruel\" and \"inhumane\" in a statement on Thursday. He said: \"Under international law, any handover of the remains of deceased must comply with the prohibition of cruel, inhuman or degrading treatment, ensuring respect for the dignity of the deceased and their families.\" The Bibas family has become a powerful symbol of the 251 Israelis kidnapped on 7 October - not least because Kfir was the youngest taken. The children's father, Yarden Bibas, was released on 1 February as part of the ceasefire deal between Hamas and Israel. International correspondent The return of the bodies of four Israeli hostages is a \"sombre moment\" for everybody in Israel and Jews across the world, our international correspondent Diana Magnay says. She says the two young boys, Ariel and Kfir, \"really became a symbol of the tremendous suffering 7 October caused\". \"Now, to have them returned back in this way is tragic.\" Referring to the scenes of coffins being transferred to the Red Cross, Magnay says Hamas has chosen to use this \"as a propaganda opportunity\". \"They have missiles on the stage where the four coffins were, saying they were killed by US bombs,\" she explains. She says Hamas's main message is \"this was caused by you, you should take responsibility for it\". She adds that 7 October was caused by Hamas, and has brought \"untold suffering to both Israel and Palestinians\". Meanwhile, six living hostages, the final due to be freed under the first phase of the Gaza truce deal, will be released on Saturday, according to Hamas. Israelis who survived being held prisoner in Gaza have been released in small groups since the first six-week phase began last month. The deal has provided a vital pause in the fighting that's devastated Gaza and left tens of thousands dead. At least 1,200 people were killed in the attack that started the war. Since then, the Hamas-run Gaza health ministry says more than 48,000 Palestinians have been killed in Israeli attacks. Its figures do not differentiate between civilians and fighters."
    },
    {
        "title": "Buses explode in Israel - as military blocks entry to some areas of West Bank",
        "description": "Three buses have exploded near Tel Aviv in what Israeli police called a \"terror incident\", as they search for suspects.",
        "url": "https://news.sky.com/story/israeli-police-investigating-reports-of-explosions-involving-several-buses-13313540",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bat-yam-israel-bus-explosion_6835085.jpg?20250220212151",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-20 20:16:00",
        "Headline": "Defence minister Israel Katz says he instructed the IDF to \"intensify counter-terrorism operations in the Tulkarem refugee camp and throughout refugee camps in the West Bank\".",
        "Content": " Three buses have exploded near Tel Aviv in what Israeli police called a \"terror incident\", as they search for suspects. Two of the blasts were in the city of Bat Yam, south of Tel Aviv, and a third was reported in the nearby town of Holon, a police spokesperson said on Thursday. Officers said they also found at least one unexploded device in Holon. They added: \"Several suspicious objects were also examined by police bomb disposal units, but suspicion was ruled out in those cases.\" Police earlier said that \"no injuries have been reported at this stage\", and that the Shin Bet internal security agency was taking over the investigation. The explosions happened on the same day that four bodies were returned by Hamas as part of a ceasefire deal with Israel. In response to the bus blasts, Israeli defence minister Israel Katz instructed the Israel Defence Forces (IDF) to intensify operations in the West Bank as the military blocked entry points to certain areas of the occupied Palestinian territory. Timer bombs \n                  Bodies of four Israeli hostages handed over by Hamas - as parading of coffins labelled 'inhumane'\n                 \n                  Hamas says bodies of Bibas family to be handed over - with six more Israelis to walk free on Saturday\n                 \n                  Israel-Hamas ceasefire thrown into further doubt as Marco Rubio backs Benjamin Netanyahu's war aims\n                 Speaking to local broadcaster Channel 12, an Israeli police official said the bombs used were with a timer and were non-standard explosives. They added that investigators believe the bombs looked similar to those made in the West Bank, but it was not confirmed where they were produced. A group identifying itself as a branch of Qassam Brigades - Hamas's military wing - from the northern West Bank city of Tulkarem later said on Telegram: \"We will never forget to take vengeance for our martyrs as long as the occupation is on our lands.\" It comes as Mr Katz said he told the IDF to \"intensify counter-terrorism operations in the Tulkarem refugee camp and throughout refugee camps in the West Bank\". The defence minister added: \"We will pursue the terrorists relentlessly and destroy the terror infrastructure in the camps, which serve as a forward base for the Iranian axis of evil. \"Residents who provide shelter and protection to terrorists will pay a heavy price.\" The IDF also said in a statement that it has \"intensified counter-terrorism operations in Judea and Samaria continue\" and will focus on \"intelligence findings\". Israel has repeatedly carried out military raids on suspected Palestinian militants in the West Bank since Hamas's October 7 2023 attack sparked the war in Gaza. Since the Gaza ceasefire took effect on 19 January this year, Tulkarem and two refugee camps in the city have been the focus of Israel's offensive. Read more from Sky News:Ceasefire in further doubt as US backs Netanyahu's aims Prime Minister Benjamin Netanyahu's office said in a statement that he was being updated by his military secretary on the situation, and would soon hold a security assessment. Tzvika Brot, mayor of Bat Yam, also called it a miracle that no one was hurt, and said the buses had finished their routes and were in a car park."
    },
    {
        "title": "German election: From AI influencers to Russian disinformation, the far-right is getting a leg up online ",
        "description": "Voters in Germany are being exposed to copious pro-AfD narratives online from AI-generated content and Russian disinformation campaigns.",
        "url": "https://news.sky.com/story/german-election-from-ai-influencers-to-russian-disinformation-the-far-right-is-getting-a-leg-up-online-13313167",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ai-germany-larissa-wagner_6835222.jpg?20250221015347",
        "type": "Home",
        "Author": "Kaitlin Tosh, Sophia Massam and Tom Cheshire, Data and Forensics team",
        "Date Published": "2025-02-20 11:40:00",
        "Headline": "Germany's far-right party Alternative for Deutschland (AfD) has been more active on social media than other parties during the campaign and is in second place in opinion polls ahead of the country's election on Sunday.",
        "Content": "By Kaitlin Tosh, Sophia Massam and Tom Cheshire, Data and Forensics team   Voters in Germany are being exposed to copious pro-AfD narratives online from AI-generated content and Russian disinformation campaigns. Experts monitoring social media say Russian-based groups are involved, including \"Doppelganger\" and \"Storm-1516\", which US officials found to be active in America's election last year. Some of these campaigns are using artificial intelligence to spread their messaging ahead of Sunday's vote, which will see Germany elect a new Bundestag. Methods are said to include creating fake TV news stories or deep-fake videos of apparent \"witnesses\" or \"whistle blowers\" fabricating stories about prominent politicians. For example, in November 2024, shortly before the snap election was called, a video was published that claimed one parliamentary member who is an outspoken supporter of Ukraine was a Russian spy. Dr Marcus Faber, a member of the Free Democratic Party and head of the government's defence committee, was targeted in a video which used AI to suggest a former adviser was making the claim. We asked Dr Faber for his reaction to the video but he was unable to comment at this time. In another video an 18-year-old woman accused a German minister of child abuse - the accusation was false, and the video was made using AI. A recent report from the Center for Monitoring, Analysis and Strategy, or CeMAS, a non-profit thinktank specialising in the analysis of disinformation and right-wing extremism, and Alliance 4 Europe which aims to combat digital disinformation, has linked both stories to the Russian disinformation campaign Storm-1516. The researchers have also been tracking the Doppelganger campaign, run by a Russian PR company Social Design Agency, widely reported to have links to the Kremlin. They have found the group's main tactic is to create fake news articles, which often resemble well-known publications. A network of social media accounts then share and spread those articles across different platforms. Posts will often appear to be from a worried citizen, like the one below that reads: \"I am concerned that aid to Ukraine will impact our ability to invest in our own infrastructure and social security systems.\" The post links to a fake news article criticising Germany's funding for the war in Ukraine, on a fake website resembling the German newspaper Der Spiegel. \"Different Russian campaigns are trying, on the one hand, to discredit established parties,\" says Julia Smirnova, a senior researcher for CeMAS. \"They're also trying to boost the far-right AfD.\" \"It's not about just one fake video or one fake article. There's a systematic effort to constantly create this flood of false stories, flood of propaganda stories, and continue spreading them,\" she says. From mid-December 2024 to mid-January 2025, CeMAS found a total of 630 German-language posts with typical Doppelgänger patterns on X alone. For Ferdinand Gehringer, a cybersecurity policy adviser, Russian interference online isn't a surprise. \"There are clear objectives for Russia to interfere and to also manipulate our public opinion,\" he says. From the party's plan to stop sending arms to Ukraine to their calls to ramp up imports of Russian gas, he says \"Russia sees within the AfD's program and ideas the best options for future cooperation\". CeMAS has found at least one case where a fake story that originated from a Russian campaign was spread by an AfD politician. Stephan Protschka, a parliamentary member, posted on his social media channels that the Green Party was working with Ukraine to recruit people to commit crimes and blame them on the AfD, a narrative researchers say originated from a Russian disinformation campaign. Sky News asked Mr Protschka for comment, but he did not respond. We also reached out to Social Design Agency to respond to the allegations against the Doppelganger group. They did not respond. We were unable to contact anyone behind the Storm-1516 campaign for comment. Inside Germany  Beyond the extremes of Russian-led disinformation campaigns, far-right groups within Germany are also ramping up their online presence. Take Larissa Wagner, an AI-generated social media influencer. \"Hey guys, I'm just on my way to the polling station. I'm daring this time. I'm voting for AfD,\" she said in a video posted to her X account on 22 September 2024, the day of the Brandenburg state election. Her accounts on Twitter and Instagram were both created in the last year and her regular videos espouse far-right narratives, like telling Syrian immigrants to \"pack your bags and go back home\". She even says she interned with the right-wing magazine Compact, which was banned by the German government last year. It's unclear who created Larissa. When Sky News messaged to ask her on Instagram she replied: \"I think it's completely irrelevant who controls me. Influencers like me are the future... \"Like anyone else, I want to share my perspective on things. Every influencer does that. But because I'm young, attractive, and right-wing, it's framed as 'influencing the political discourse'.\" Ferdinand Gehringer notes that her posts have become more radical over time. \"The potential for influence is significant-especially since the presence of a young, attractive woman increases audience engagement,\" he adds. The far-right's use of generative AI on social media goes beyond characters like Larissa. A report this week from the Institute for Strategic Dialogue assessed the scale of its use, identifying 883 posts since April 2023 that included images, memes and music videos made using generative AI. The posts came from far-right supporters as well as the AfD itself - party accounts published more than 50 posts that contained generative AI content in October alone. The AfD is using AI more than other parties, says Pablo Maristany de las Casas, an analyst at the Institute for Strategic Dialogue who co-authored the report. \"They're clearly the one actor that is exploiting this technology the most,\" he says. The messaging in the far-right content they sampled falls into two categories: attacking narratives, like AI-generated images of migrants portrayed as violent criminals, and narratives that glorify traditional German values. When these two narratives are combined, \"the far-right community feels more united in the so-called cultural fight against these groups that they're attacking,\" says Mr Maristany de las Casas. Take Remigration Song, a promotional song and music video commissioned by the now-disbanded youth wing of the AfD. It was produced using AI and advocates the mass deportation of immigrants - known as remigration. It's this home-grown content that some experts say could affect public opinions. A recent survey by the Bertelsmann Foundation, a thinktank which promotes social reform, showed that 80% of Germans consider disinformation on the internet to be a major problem for society and 88% agreed that disinformation is spread to influence political opinions. \"Just the foreign information itself is probably not going to shift attitudes\" says senior researcher Cathleen Berger. \"I think the impact only comes when it is being picked up by domestic actors\". Additional reporting from Olive Enokido-Lineham, OSINT producer; Mary Poynter, Data and Forensics producer. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open-source information. Through multimedia storytelling, we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Trump 'very frustrated' with Zelenskyy as Ukraine-US news conference cancelled",
        "description": "A planned news conference between Volodymyr Zelenskyy and Donald Trump's Ukraine envoy was cancelled, as political tensions deepened between the two countries.",
        "url": "https://news.sky.com/story/trump-very-frustrated-with-zelenskyy-as-ukraine-us-news-conference-cancelled-13313544",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-volodymyr-zelenskyy_6835134.jpg?20250220215006",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-20 20:20:00",
        "Headline": "The event between Volodymyr Zelenskyy and Keith Kellogg was originally supposed to include comments to the media, but it was changed at the last minute to a simple photo opportunity.",
        "Content": "A planned news conference between Volodymyr Zelenskyy and Donald Trump's Ukraine envoy was cancelled, as political tensions deepened between the two countries. The event was originally supposed to include comments to the media by Ukraine's President Zelenskyy and retired US Lieutenant General Keith Kellogg, but it was changed at the last minute to a simple photo opportunity. Neither side delivered statements or questions from the media. Ukraine war latest: Follow latest updates  The change was requested by the US side, Ukrainian presidential spokesman Serhii Nikiforov said. Mr Zelenskyy wrote on X that he had a detailed and productive conversation with Lt Gen Kellogg about prisoners of war, effective security guarantees that would be part of any peace agreement and the battlefield situation. He later said the meeting \"restores hope\" but there were few additional details from the US side. Lt Gen Kellogg's trip to Kyiv coincided with recent feuding between Mr Trump and Mr Zelenskyy that has cast further doubt on the future of US support for Ukraine's war effort. During a White House briefing on Thursday, national security adviser Mike Waltz said \"some of the rhetoric\" coming out of Kyiv and \"insults to US President Donald Trump were unacceptable\". His comments were in response to Mr Zelenskyy accusing his US counterpart of living in a \"disinformation bubble\" after Mr Trump blamed Ukraine for the war. The US leader responded furiously, labelling the Ukrainian president a \"dictator without elections\". When asked if Mr Trump blames Russia or Ukraine for the war - which was launched by Moscow in February 2022 - Mr Waltz would not give a direct answer. Instead, he said Mr Trump is \"obviously very frustrated\" with the Ukrainian leader. 👉 Follow Trump 100 on your podcast app 👈 \"Well, look, his goal here is to bring this war to an end, period,\" he said, referring to Mr Trump. \"And there has been ongoing fighting on both sides. It is World War One style trench warfare.\" He went on to insist Mr Trump is the best person to negotiate with Russia's Vladimir Putin, despite concerns the US will force Ukraine into concessions after kicking off talks this week without Europe or Kyiv. US vice president JD Vance added that he believed an end to the conflict was near and there was no stopping the war without speaking to Russia. The US government has previously floated a deal between Ukraine and Russia that would give America access to Ukraine's minerals resources, but Kyiv rejected the initial plan as it did not include security guarantees.  Has Russia got an 'appetite' for peace? European leaders, including the UK government, have reacted strongly to the way Mr Trump has begun talks. Foreign Secretary David Lammy said the UK will be a \"bridge\" between the US and Europe during Ukraine peace negotiations, adding he doubted whether Russia had \"an appetite to really get to that peace\". \"That peace could be achieved by leaving Ukraine tomorrow,\" he said after a meeting of G20 foreign ministers in South Africa.  French President Emmanuel Macron, who is due to meet with Mr Trump in Washington on Monday, said he would tellthe president not to be \"weak\" on Mr Putin. He also spoke with Mr Zelenskyy to discuss recent diplomatic efforts between European partners and allies, ahead of his visit to the US. Russian officials, meanwhile, are basking in Washington's attention and offering words of support in light of Mr Trump's stance. Read more:What could a UK-Europe force in Ukraine look like?Farage says Zelenskyy is not a dictatorWho said what? Kremlin spokesman Dmitry Peskov said \"the rhetoric of Zelenskyy and many representatives of the Kyiv regime in general leaves much to be desired\" - a veiled reference to Ukrainian criticism of Mr Putin. The divisions between Ukraine and the US come as it nears three years to the day that Russia launched its invasion. Moscow's army crossed the border on 24 February 2022, in an all-out invasion that Mr Putin sought to justify by saying it was needed to protect Russian-speaking civilians in eastern Ukraine and prevent the country from joining NATO."
    },
    {
        "title": "Doctor leading new screening trial warns of 'sharp rise' in prostate cancer if disease not detected earlier",
        "description": "Thousands of men are to be checked for prostate cancer in one of the first large-scale European trials of smart screening.",
        "url": "https://news.sky.com/story/doctor-leading-new-screening-trial-warns-of-sharp-rise-in-prostate-cancer-if-disease-not-detected-earlier-13313156",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-thomas-moore-cancer_6834536.jpg?20250220122333",
        "type": "Home",
        "Author": "Thomas Moore",
        "Date Published": "2025-02-20 11:19:00",
        "Headline": "Sky News was granted access to a pilot study in Ireland which aims to save thousands of lives - amid fears many men in the UK are getting treatment too late.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Thousands of men are to be checked for prostate cancer in one of the first large-scale European trials of smart screening. The pilot study, starting next week in Ireland, will combine a blood test with personal risk factors and an MRI scan to increase the accuracy of screening men in their 50s and 60s. Up to now health experts have rejected population screening in the belief that the benefits of earlier cancer detection were outweighed by the risks that some men could have unnecessary biopsies and risky treatment they don't need. But the PRAISE-U study is an attempt to save lives in a more targeted way, filtering out men who don't have cancer at an early stage, so they don't come to any harm. David Galvin, the head of the study and a surgeon at the Mater Hospital in Dublin, told Sky News that a safe, effective screening strategy was urgently needed. \"There is a tsunami of elderly patients coming towards us,\" he said. \"There's going to be a sharp rise in prostate cancer unless we have a way to detect the disease early and not burden our health care services with vast numbers of scans and biopsies.\" Thousands diagnosed too late Prostate cancer is the most common cancer in men in Ireland. In the UK it is now the most common of all cancers, causing more deaths than breast cancer. There are no symptoms in the early stages. Around 12,000 men a year in the UK alone are diagnosed too late to cure. Studies have shown that a blood test for a prostate protein called PSA can diagnose cases at an earlier stage, reducing deaths by 40%. But not all men with cancer have high levels of the PSA protein. And conversely, high levels can also be caused by other prostate conditions, infections, exercise and sexual activity. The unreliability of the test has held back its use for screening. But in the Irish pilot study, men will be scored by their PSA level and whether they have other risk factors such as black ethnicity or a family history. Those at low risk will be retested in future. Around half of the men will undergo a detailed MRI scan of their prostate to check for tumours - and only half those will then need a biopsy, in which a needle is inserted to extract cells for a precise diagnosis. Mr Galvin said the multi-stage screening meant only those who really need a biopsy will have one. \"I worked out that if you have the PSA test, there's about a 1 in 40 chance that you will ultimately need a biopsy. \"The other 39 men are reassured that testing is all normal and they don't have any clinically significant disease.\" Read more:Simple test could revolutionise dementia diagnosisAcid attack victim on how donated placenta saved eyeOdds of asteroid hitting Earth rise again 'I got away with it by the skin of my teeth' The PRAISE-U study is backed by the European Association of Urology and funded by the EU. Around 8,000 men in Waterford and two areas of Dublin will be randomly invited for screening over the next year. Tony Ward, a rugby legend and one of the best number 10s to play for Ireland, was diagnosed with an aggressive prostate cancer just over a decade ago. Even now he needs daily treatment and regular scans. He told Sky News screening to detect cancer at an earlier stage is desperately needed. \"It's everything, it's massive,\" he said. \"I did not have the early diagnosis, but I got away with it by the skin of my teeth.\" 'Very curable cancer kills 12,000 men every year' The UK's National Screening Committee, which advises the Department of Health, is reviewing the evidence on prostate cancer screening. But it's already taken two years, and a decision still isn't due until the end of 2025. Chiara De Biase, director of health services, equity and improvement from Prostate Cancer UK, said men were dying unnecessarily as a result. She said: \"12,000 men die every year from what is - when caught in its earliest stages - a very, very curable cancer. \"We think the evidence [for screening] is there and we can't see why this has taken so long.\" A spokesperson for the UK government's Department of Health and Social Care said: \"Prostate cancer patients are waiting too long for diagnosis and treatment, and we are determined to change that. \"Our National Cancer Plan will transform the way we treat cancer, making the UK a world leader in cancer survival by fighting the disease on all fronts, through improving research, diagnosis, screening, treatment and prevention. \"The UK National Screening Committee is reviewing the evidence for prostate cancer screening programmes, including targeted approaches for men at higher risk.\""
    },
    {
        "title": "Domestic abuse specialists placed in 999 control rooms after women's murders",
        "description": "The first domestic violence specialists have been placed in 999 control rooms in memory of a woman who was murdered by her ex-husband despite ringing police on the night she died.",
        "url": "https://news.sky.com/story/domestic-abuse-specialists-placed-in-999-control-rooms-after-womens-murders-13313360",
        "image_url": "https://e3.365dm.com/22/11/1920x1080/474b1acdc0c3b1e24c1977cdd015068feffc0a470b432de8144990f6e364d11f_5970675.jpg?20250220164139",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2025-02-20 15:46:00",
        "Headline": "Raneem's Law has been launched in five pilot areas to improve police responses to domestic violence calls after the murders of Raneem Oudeh and her mother Khaola Saleem by Ms Oudeh's ex-husband.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  The first domestic violence specialists have been placed in 999 control rooms in memory of a woman who was murdered by her ex-husband despite ringing police on the night she died. Raneem's Law has been launched in five pilot areas - West Midlands, Northumbria, Northamptonshire, Bedfordshire and Humberside. The legislation - promised in Labour's manifesto - is named after 22-year-old Raneem Oudeh and her mother Khaola Saleem, 49, who were murdered by Ms Oudeh's ex-husband in August 2018. Ms Oudeh had called 999 more than a dozen times in the months leading up to her death, including to report threats to kill her, but police did not log the reports correctly, did not follow up and did not assess them correctly. On the night she was killed, she rang 999 four times but the police did not respond in time. The new domestic abuse specialists will ensure that calls for help are properly assessed, managed and responded to, the government said. Their duties will include advising on risk assessments, making referrals to specialist services and identifying missed opportunities to safeguard victims. \n                  Parents must not pay mandatory extra charges to access free childcare, government says\n                 \n                  Politics latest: Russia doesn't look like it wants peace, warns foreign secretary\n                 \n                  Sir Keir Starmer held calls with European leaders to ensure Western alliance 'does not fracture'\n                 The first phase will inform plans for a national rollout across 43 police forces in England and Wales and will be underpinned by £2.2m funding over the next financial year. Home Secretary Yvette Cooper said: \"Every 30 seconds, someone calls the police about domestic abuse - over 100 people every hour seeking urgent help. \"That's why we are determined to overhaul the police emergency response to domestic abuse, making sure that victims get the specialist support and protection they need. That must be Raneem and Khaola's legacy.\"  Read More:Violence against women and girls is growingDomestic abuse victim speaks out On the night she died, Ms Oudeh was told to go to her mother's house and officers would visit her the next day. She was on the phone to West Midlands Police when she was stabbed by Janbaz Tarin, her estranged husband, one of the many calls she had made about him that night. Ms Oudeh had broken up with her husband in the weeks before the attack after discovering he had three children and a secret wife who was pregnant with a fourth child in Afghanistan. Tarin admitted the murders and was jailed for life with a minimum of 32 years in December 2018. An inquest found the police force \"materially contributed\" to their deaths. Five officers were disciplined over the failures. Nour Norris, Ms Oudeh's aunt and Mrs Saleem's sister who has been campaigning to improve outcomes for domestic abuse victims, said today's announcement would help save lives. \"Raneem called for help, and today, the system finally answered,\" she said. \"I can't express enough how deeply emotional and significant this moment is.\""
    },
    {
        "title": "Trump envoy Steve Witkoff says he has developed a 'friendship' with Putin",
        "description": "The man who has emerged as Donald Trump's geopolitical dealmaker-in-chief has said that he's developed a \"friendship\" with Russian President Vladimir Putin.",
        "url": "https://news.sky.com/story/trump-envoy-steve-witkoff-says-he-has-developed-a-friendship-with-putin-13313676",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-steve-witkoff_6835207.jpg?20250220232608",
        "type": "Home",
        "Author": "Mark Stone",
        "Date Published": "2025-02-20 22:53:00",
        "Headline": "Steve Witkoff made the remark as he discussed a remarkable overnight trip to Moscow last week to secure the release of US citizen Marc Fogel.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  The man who has emerged as Donald Trump's geopolitical dealmaker-in-chief has said that he's developed a \"friendship\" with Russian President Vladimir Putin. Steve Witkoff was named as Mr Trump's Middle East envoy shortly after the US election but he has since been involved in negotiations with Russia about ending the war in Ukraine. Mr Witkoff made the comments about his relationship with Mr Putin at a Saudi-run investment forum in Miami, where he discussed his remarkable overnight trip to Moscow last week to secure the release of US citizen Marc Fogel. \"I spent a lot of time with Putin. Talking and developing a friendship and relationship with him…\" Mr Witkoff said. The secret overnight trip to bring the Pennsylvania teacher home seems to be emerging as a key moment in the dramatically shifting dynamics between the Trump administration and the Kremlin. The details of the release and what was discussed have never been released. Follow latest: Ukraine war live updates \n                  Ukraine war latest: Washington 'cancels' news conference after Zelenskyy meets US official\n                 \n                  Donald Trump hits back at 'terrible' Volodymyr Zelenskyy and calls him a 'dictator' amid US-Russia talks\n                 \n                  Ukraine's president is fighting a war on two fronts - against Russian forces on the ground and against American assaults over the airwaves\n                 In describing the success of the deal, Mr Witkoff said: \"First I had the support of President Trump which is a really big deal. Secondly we have a really good relationship with the Saudis…. They assured us that this was real... and so to me it became worth the trip. And so we went. And it was a great trip. I spent a lot of time with President Putin, talking, developing a friendship, a relationship with him and that led to Mark getting on the plane…\" The role of the Saudi government is a reflection of Riyadh's remarkable and emerging geopolitical clout. After Mr Witkoff's Moscow trip, the Riyadh talks between the US and Russia were secured. Read analysis:Zelenskyy fighting a war on two frontsTrump's direction of travel does not look good for Kyiv  Speaking to Sky News on the sidelines of the investment conference and addressing President Trump's \"dictator\" comments about President Zelenskyy, Mr Witkoff said: \"I think I agree with President Trump, he has a very keen sense of what has to be done to create a lasting peace between Russia and Ukraine. \"And I follow his lead, and I believe in what he's got to say.\" He added: \"I think it brings… the president has an uncanny ability of knowing how to bring people together and this is the beginning.\""
    },
    {
        "title": "Parents must not pay mandatory extra charges to access free childcare, government says",
        "description": "Parents who are entitled to hours of free childcare should not have to pay mandatory extra charges to secure their nursery place, the government has said.",
        "url": "https://news.sky.com/story/parents-must-not-pay-mandatory-extra-charges-to-access-free-childcare-government-says-13313166",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-childcare-free-childcare_6441519.jpg?20240202094158",
        "type": "Home",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-02-20 11:37:00",
        "Headline": "Updated guidance says local councils should intervene if a childcare provider seeks to make additional charges a condition for parents accessing their hours.  ",
        "Content": "\n          Political reporter\n              @alexrogerssky\n Parents who are entitled to hours of free childcare should not have to pay mandatory extra charges to secure their nursery place, the government has said. Updated guidance from the Department for Education states that while nurseries are entitled to ask parents to pay for extras - including meals, snacks, nappies or sun cream - these charges must be voluntary rather than mandatory. The guidance, which comes amid concerns that parents have faced high additional charges on top of the funded hours, also states that local councils should intervene if a childcare provider seeks to make additional charges a condition for parents accessing their hours. Since September last year, parents and carers with children aged nine months and older have been entitled to 15 hours of government-funded childcare a week, rising to 30 hours for three to four year-olds. Politics latest: Farage under fire for 'deeply disappointing' response to Trump's Zelenskyy attacks From this September, the 30 hours of care will be made available to all families - a rollout that was first introduced under the previous Conservative government. However, there have been concerns that in order to subsidise shortfalls in funding, nurseries have charged parents extra for essentials that would normally have been included in fees. \n                  'I gave birth to triplets and it pushed me to the brink of bankruptcy'\n                 \n                  Free childcare for nine-month-olds available from next week - but rollout comes with 'challenges'\n                 \n                  Parents may miss out on first choice free childcare places, education secretary warns\n                 Under the new guidance, nurseries will be now obliged to clearly set out any additional costs parents will have to pay, including on their websites. It says invoices should be itemised so parents can see a breakdown of the free entitlement hours, additional private paid hours and all the additional charges. 'Fundamental financial challenges facing the sector' Representatives of childcare providers welcomed the announcement but pointed out the financial stress that many nurseries were under. Neil Leitch, chief executive of the Early Years Alliance, said: \"While we fully agree that families should be able to access early entitlement hours without incurring additional costs, in reality, years of underfunding have made it impossible for the vast majority of settings to keep their doors open without relying on some form of additional fees or charges.  \"As such, while it is absolutely right that providers should be transparent with parents on any optional additional fees, today's guidance does absolutely nothing to address - or even acknowledge - the fundamental financial challenges facing the sector.\" He added: \"Given that from September, government will control the price of around 80% of early years provision, it has never been more important for that funding to genuinely reflect the true cost of delivering places. \"And yet we know in many areas, this year's rate increases won't come close to mitigating the impact April's National Insurance and wage rises, meaning that costs for both providers and families are likely to spiral.\" In last year's budget, Chancellor Rachel Reeves announced that the amount businesses will pay on their employees' national insurance contributions will increase from 13.8% to 15% from April this year. She also lowered the current £9,100 threshold employers start paying national insurance on employees' earnings to £5,000, in what she called a \"difficult choice\" to make. Last month a survey from the National Day Nurseries Association (NDNA) found that cost increases from April will force nurseries to raise fees by an average of 10%. This could be welcome news for working parents as they approach the end of another half term break during which they will have incurred childcare costs.\n\n But this money would not affect school age children.\n\nIt is dedicated to very young children, aged two or below and is targeting parents, predominantly mothers, that want to return to work.\n\n Previously after doing the sums and factoring in childcare costs, many mums would have felt that it wasn’t worth it.\n\n And so, if these funds are easily accessible on a local level it could make a real difference to those wanting to get back to work.\n\n The survey, covering nurseries in England, revealed that staffing costs will increase by an average of 15%, with respondents saying that more than half of the increase was due to the national insurance decision in the budget. Purnima Tanuku CBE, chief executive of the NDNA, said \"taking away the flexibility for providers around charges could seriously threaten sustainability\". \"The funding government pays to providers has never been about paying for meals, snacks or consumables, it is to provide early education and care,\" she said. \"Childcare places have historically been underfunded with the gap widening year on year.  \"From April, the operating costs for the average nursery will go up by around £47,000 once statutory minimum wages and changes to national insurance contributions are implemented. NIC changes have not been factored into the latest funding rates, further widening the underfunding gap.\" Read more:Free childcare plan risks lowering standards, report findsReport finds up to 300,000 children missing from school last year The Department for Education said its offer to parents meant they could save up to £7,500 on average when using the full 30 hours a week of government-funded childcare support, compared to if they were paying for it themselves. In December, the government also announced that a £75m expansion grant would be distributed to nurseries and childminders to help increase places ahead of the full rollout of funded childcare.  Local authority allocations for the expansion grant will be confirmed before the end of February. Some of the largest areas could be provided with funding of up to £2.1m."
    },
    {
        "title": "Jaysley Beck: Army's handling of sexual assault complaint 'played part in death', coroner says",
        "description": "The British Army's failure to properly deal with a soldier's sexual assault complaint played \"more than a minimal\" role in her death, a coroner has said.",
        "url": "https://news.sky.com/story/jaysley160beck-armys-handling-of-teen-soldiers-sexual-assault-complaint-played-part-in-her-death-coroner-says-13312552",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gunner-jaysley-beck_6824926.jpg?20250210162238",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-20 13:30:00",
        "Headline": "Jaysley Beck, 19, was found dead in her room at Larkhill Camp in Wiltshire on 15 December 2021.",
        "Content": " The British Army's failure to properly deal with a soldier's sexual assault complaint played \"more than a minimal\" role in her death, a coroner has said. Royal Artillery Gunner Jaysley Beck, 19, was found dead in her room at Larkhill Camp in Wiltshire on 15 December 2021. An inquest on Thursday recorded a conclusion of suicide \"after a prolonged period of stress after harassment by her line management and problems with a relationship\".   Gunner Beck complained to her family about thousands of unwanted messages from her line manager, Ryan Mason, in the months leading up to her death. He also wrote a 14-page document detailing his \"feelings towards Jaysley\" and paid for rooms next to each other during a work trip before she died, the inquest heard. \n                  Two serving British Armed Forces members admit trying to sell cannabis\n                 \n                  Teenage soldier Jaysley Beck found dead on military base had complained of 'psychotic' boss, inquest hears\n                 \n                  Ex-police chief condemns investigation into alleged Afghanistan war crimes by UK Special Forces\n                 Wiltshire Police told the inquest evidence did not support a harassment case against Mr Mason, who is now a driving instructor. Gunner Beck also formally complained to the army about the behaviour of former battery sergeant Major Michael Webber, then 39. She said he had pinned her down and tried to kiss her after a drinking game during a team-building event in July 2021. Gunner Beck, who joined the army at 16, ended up sleeping in her car as she was so scared, the hearing in Salisbury was told. Mr Webber was given a \"minor sanction\" and wrote an apology letter - but was later promoted to Warrant Officer 2 rank. Coroner Nicholas Rheinberg said on Thursday the army should have reported the alleged incident to police instead of treating it with a \"minor administrative action\". He said this failure was \"more than a minimal contributory factor\" in Gunner Beck's death. An army report in October 2023 described \"an intense period of unwelcome behaviour\" and said it was \"almost certain this was a causal factor\" in her death. Staff Sergeant Cory Budd, who said he had been in a relationship with Gunner Beck at the time of her death - while he was still married - found her body. Police concluded there was no third-party involvement. The coroner said that despite Jaysley being three times over the drink-drive limit when she died, he was satisfied she had still intended to take her own life. 'She should still be here' Gunner Beck's mother, Leighann McCready, attended the inquest with her partner and daughter. Speaking outside court, she paid tribute to her daughter, calling her \"kind, caring, and truly loved by everyone who knew her\". Ms McCready added: \"She was full of life, bright and absolutely fantastic at her job - the army itself has said exactly the kind of person they wanted to join. She should still be here.\" She called for the army to be stripped of the power to conduct its own investigations into harassment and bullying cases - and that \"no one should have to suffer in silence\". Describing how she felt, she added: \"Disgusted, absolutely disgusted, on how the army have failed our daughter. \"I believe it was a cover-up and it's been made clear through the findings that the army have failed our daughter Jaysley.\" She claimed that since the start of the inquest, 700 male and female soldiers had made contact with her to share their own experiences. 'It's weighing me down' Ms McCready had told the court how her daughter \"did not feel safe\" as the situation with her line manager intensified, with Ryan Mason sending 3,600 messages in November 2021. In one reply, she wrote: \"This whole falling in love with me... it's becoming a bit too much, I have just come out of a relationship and I'm just not wanting to be involved in anything like this. \"It's weighing me down a little bit, I'll be totally honest with you.\" The inquest also heard how Gunner Beck had been too afraid to return to her room after the alleged assault by WO Webber, locking herself in her car and making a complaint in the morning. A colleague said she had been \"frightened and in tears\" and described her superior allegedly \"waiting for a moment for them to be alone\" before pinning her down and trying to kiss her. Ms McCready said her daughter had been angered by the apology letter - which ended by saying his \"door was open\" for her. The army report said this was \"possibly a factor that may have influenced her failure to report other events that happened subsequently\". It also highlighted family issues, including bereavement, as playing a part in Gunner Beck's death - but her family rejects this. The army report outlined three \"contributory factors\", including: • The \"significant strain\" of a sexual relationship with a married colleague in the last few weeks of her life • A relationship which ended in November 2021 which involved \"repeated allegations of unfaithfulness on the part of the boyfriend\" • An \"unhealthy approach to alcohol, with episodes of binge drinking\" At the inquest, Mr Mason denied trying to \"manipulate\" Gunner Beck by pressuring her by talking about his own mental health and suicide concerns, while WO2 Webber, who is married, declined to answer questions. Army: 'We should have done more' Brigadier Melissa Emmett, head of the army personnel services group, said it accepts failures were made. \"We let her down in so many ways for which we have already apologised, and if I can apologise again, for what it's worth, I would do,\" she said. \"On a personal level, listening to the doubt and the fear that she had, the good encouragement of her friends to report, but the lack of confidence that they had in reporting, and the well-meaning but erroneous actions of the chain of command, I have found personally very grieving. \"We could have, and we should have, done more.\" Alistair Carns, the veterans minister, said Gunner Beck's death \"was and still is a tragedy, and we are deeply sorry for the failure to protect her\". He added: \"There is no place for any abuse or unacceptable behaviours within the military. This government has stepped up efforts to bring about crucial reform and provide a place where people are proud to work and have faith in the service justice system.\" Former female soldier: 'It's a lad's culture' Tamzin Hort, a former soldier who was friends with Gunner Beck, bonded over struggles with their former partners and the army. Ms Hort, who joined the army when she was 17, told Sky News she was in disbelief when she heard Gunner Beck had died on the night of her battery's Christmas party. She said she was unaware of what was going on before Gunner Beck's death, but is not surprised by it. \"It's a man's world. It's a lad's culture. You're a lad if you say things like that, or you do things, or you're inappropriate,\" she said. \"However, if the roles were reversed and females were doing what the men were doing, we'd be disgusting. \"You get scrutinised for the way you look or the way you dress or the way you speak, where you're from, anything. They pick up on it and some people make your life a living hell, and that is the reason why I left, because my mental health - it was at a low.\" Ms Hort said she thinks the army is not safe for young women and that there needs to be \"big changes\".\"In the civilian world, if you wish to harass someone, if you make stupid comments to anyone, you'd be getting arrested straight away,\" she said. \"None of this, 'we're now going to set policies' - they should have set already. Jaysley should still be here.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Man who 'exhibited fixated behaviour' towards Emma Raducanu given restraining order",
        "description": "A man who \"exhibited fixated behaviour\" towards British tennis player Emma Raducanu has been given a restraining order, Dubai Police have said.",
        "url": "https://news.sky.com/story/man-who-exhibited-fixated-behaviour-towards-emma-raducanu-given-restraining-order-13313208",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-emma-raducanu-raducanu_6833374.jpg?20250219090124",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-20 12:41:00",
        "Headline": "Raducanu chose to drop charges against the man in question. The 22-year-old British player appeared visibly upset during a match at the Dubai Tennis Championships.",
        "Content": " A man who \"exhibited fixated behaviour\" towards British tennis player Emma Raducanu has been given a restraining order, Dubai Police have said. Raducanu, 22, was visibly upset during a match at the Dubai Tennis Championships on Tuesday after the man was seated in the first few rows of the crowd. He was subsequently removed from the tennis court by security. Raducanu went on to lose the second round clash 7-6 (8-6) 6-4 to 14th seed Karolina Muchova. A day earlier, the man had reportedly handed the star a letter. Police said in a statement shared on social media on Thursday that the man was detained and Raducanu decided not to press charges. Dubai Police said they have taken \"swift action\" in relation to the incident and have not named the man. \n                  Emma Raducanu out of Australian Open: Brit needs intensity boost to challenge top players, says Laura Robson\n                 \n                  Emma Raducanu: Brit relishing Iga Swiatek clash at Australian Open\n                 \n                  Emma Raducanu refuses to treat insect bites at Australian Open over doping test fears\n                 \"Following Raducanu's complaint, Dubai Police detained a tourist who approached her, left her a note, took her photograph, and engaged in behaviour that caused her distress,\" it said. \"While Raducanu later chose to drop the charges, the individual signed a formal undertaking to maintain distance from her and has been banned from future tournaments. \"Dubai remains committed to ensuring the safety and security of all residents and visitors to the emirate.\" The statement was posted on the Dubai Media Office's X account. Raducanu said in an Instagram story after the match that it was a \"difficult experience\". She wrote: \"Thank you for the messages of support. Difficult experience yesterday but I'll be okay and proud of how I came back and competed despite what happened at the start of the match. \"Thank you to Karolina [Muchova] for being a great sport and best of luck to her for the rest of the tournament.\" Read more from Sky News:'Comedy on prescription' trials startQR code stickers appear on thousands of gravesMan who killed Ronan Keating's brother avoids prison Along with her message she posted an image of the Jane Austen novel Emma and a cup of coffee. The Women's Tennis Association (WTA) previously said in a statement that the man in question, who it said had displayed \"fixated behaviour\", will be \"banned from all WTA events pending a threat assessment\". \"Player safety is our top priority, and tournaments are advised on security best practices for international sporting events,\" the organisation said. In 2022, a 35-year-old man was handed a five-year restraining order - after a court heard Raducanu was \"constantly looking over her shoulder\" and no longer felt \"safe in her own home\". Amrit Magar had walked 23 miles to Raducanu's home and had stolen her father's shoe as a souvenir. Bromley Magistrates' Court heard how Magar went to the player's home on three separate occasions, loitered outside, left unwanted gifts and cards, and stole property from their porch. The court also heard from Raducanu through a victim impact statement read by prosecutors - which said that her parents were \"reluctant\" to let her go out on her own."
    },
    {
        "title": "Jaysley Beck: Army's handling of sexual assault complaint 'played part in death', coroner says",
        "description": "The British Army's failure to properly deal with a soldier's sexual assault complaint played \"more than a minimal\" role in her death, a coroner has said.",
        "url": "https://news.sky.com/story/jaysley160beck-armys-handling-of-teen-soldiers-sexual-assault-complaint-played-part-in-her-death-coroner-says-13312552",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gunner-jaysley-beck_6824926.jpg?20250210162238",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-20 13:30:00",
        "Headline": "Jaysley Beck, 19, was found dead in her room at Larkhill Camp in Wiltshire on 15 December 2021.",
        "Content": " The British Army's failure to properly deal with a soldier's sexual assault complaint played \"more than a minimal\" role in her death, a coroner has said. Royal Artillery Gunner Jaysley Beck, 19, was found dead in her room at Larkhill Camp in Wiltshire on 15 December 2021. An inquest on Thursday recorded a conclusion of suicide \"after a prolonged period of stress after harassment by her line management and problems with a relationship\".   Gunner Beck complained to her family about thousands of unwanted messages from her line manager, Ryan Mason, in the months leading up to her death. He also wrote a 14-page document detailing his \"feelings towards Jaysley\" and paid for rooms next to each other during a work trip before she died, the inquest heard. \n                  Two serving British Armed Forces members admit trying to sell cannabis\n                 \n                  Teenage soldier Jaysley Beck found dead on military base had complained of 'psychotic' boss, inquest hears\n                 \n                  Ex-police chief condemns investigation into alleged Afghanistan war crimes by UK Special Forces\n                 Wiltshire Police told the inquest evidence did not support a harassment case against Mr Mason, who is now a driving instructor. Gunner Beck also formally complained to the army about the behaviour of former battery sergeant Major Michael Webber, then 39. She said he had pinned her down and tried to kiss her after a drinking game during a team-building event in July 2021. Gunner Beck, who joined the army at 16, ended up sleeping in her car as she was so scared, the hearing in Salisbury was told. Mr Webber was given a \"minor sanction\" and wrote an apology letter - but was later promoted to Warrant Officer 2 rank. Coroner Nicholas Rheinberg said on Thursday the army should have reported the alleged incident to police instead of treating it with a \"minor administrative action\". He said this failure was \"more than a minimal contributory factor\" in Gunner Beck's death. An army report in October 2023 described \"an intense period of unwelcome behaviour\" and said it was \"almost certain this was a causal factor\" in her death. Staff Sergeant Cory Budd, who said he had been in a relationship with Gunner Beck at the time of her death - while he was still married - found her body. Police concluded there was no third-party involvement. The coroner said that despite Jaysley being three times over the drink-drive limit when she died, he was satisfied she had still intended to take her own life. 'She should still be here' Gunner Beck's mother, Leighann McCready, attended the inquest with her partner and daughter. Speaking outside court, she paid tribute to her daughter, calling her \"kind, caring, and truly loved by everyone who knew her\". Ms McCready added: \"She was full of life, bright and absolutely fantastic at her job - the army itself has said exactly the kind of person they wanted to join. She should still be here.\" She called for the army to be stripped of the power to conduct its own investigations into harassment and bullying cases - and that \"no one should have to suffer in silence\". Describing how she felt, she added: \"Disgusted, absolutely disgusted, on how the army have failed our daughter. \"I believe it was a cover-up and it's been made clear through the findings that the army have failed our daughter Jaysley.\" She claimed that since the start of the inquest, 700 male and female soldiers had made contact with her to share their own experiences. 'It's weighing me down' Ms McCready had told the court how her daughter \"did not feel safe\" as the situation with her line manager intensified, with Ryan Mason sending 3,600 messages in November 2021. In one reply, she wrote: \"This whole falling in love with me... it's becoming a bit too much, I have just come out of a relationship and I'm just not wanting to be involved in anything like this. \"It's weighing me down a little bit, I'll be totally honest with you.\" The inquest also heard how Gunner Beck had been too afraid to return to her room after the alleged assault by WO Webber, locking herself in her car and making a complaint in the morning. A colleague said she had been \"frightened and in tears\" and described her superior allegedly \"waiting for a moment for them to be alone\" before pinning her down and trying to kiss her. Ms McCready said her daughter had been angered by the apology letter - which ended by saying his \"door was open\" for her. The army report said this was \"possibly a factor that may have influenced her failure to report other events that happened subsequently\". It also highlighted family issues, including bereavement, as playing a part in Gunner Beck's death - but her family rejects this. The army report outlined three \"contributory factors\", including: • The \"significant strain\" of a sexual relationship with a married colleague in the last few weeks of her life • A relationship which ended in November 2021 which involved \"repeated allegations of unfaithfulness on the part of the boyfriend\" • An \"unhealthy approach to alcohol, with episodes of binge drinking\" At the inquest, Mr Mason denied trying to \"manipulate\" Gunner Beck by pressuring her by talking about his own mental health and suicide concerns, while WO2 Webber, who is married, declined to answer questions. Army: 'We should have done more' Brigadier Melissa Emmett, head of the army personnel services group, said it accepts failures were made. \"We let her down in so many ways for which we have already apologised, and if I can apologise again, for what it's worth, I would do,\" she said. \"On a personal level, listening to the doubt and the fear that she had, the good encouragement of her friends to report, but the lack of confidence that they had in reporting, and the well-meaning but erroneous actions of the chain of command, I have found personally very grieving. \"We could have, and we should have, done more.\" Alistair Carns, the veterans minister, said Gunner Beck's death \"was and still is a tragedy, and we are deeply sorry for the failure to protect her\". He added: \"There is no place for any abuse or unacceptable behaviours within the military. This government has stepped up efforts to bring about crucial reform and provide a place where people are proud to work and have faith in the service justice system.\" Former female soldier: 'It's a lad's culture' Tamzin Hort, a former soldier who was friends with Gunner Beck, bonded over struggles with their former partners and the army. Ms Hort, who joined the army when she was 17, told Sky News she was in disbelief when she heard Gunner Beck had died on the night of her battery's Christmas party. She said she was unaware of what was going on before Gunner Beck's death, but is not surprised by it. \"It's a man's world. It's a lad's culture. You're a lad if you say things like that, or you do things, or you're inappropriate,\" she said. \"However, if the roles were reversed and females were doing what the men were doing, we'd be disgusting. \"You get scrutinised for the way you look or the way you dress or the way you speak, where you're from, anything. They pick up on it and some people make your life a living hell, and that is the reason why I left, because my mental health - it was at a low.\" Ms Hort said she thinks the army is not safe for young women and that there needs to be \"big changes\".\"In the civilian world, if you wish to harass someone, if you make stupid comments to anyone, you'd be getting arrested straight away,\" she said. \"None of this, 'we're now going to set policies' - they should have set already. Jaysley should still be here.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Prison officer who kissed inmate and sent 'sexualised' messages jailed",
        "description": "A prison officer who kissed and sat on the lap of an inmate she was in a relationship with has been jailed for a year.&#160;",
        "url": "https://news.sky.com/story/prison-officer-who-kissed-inmate-and-sent-sexualised-messages-jailed-13313247",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-toni-cole-hmp-five-wells_6834629.jpg?20250220135807",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-20 13:42:00",
        "Headline": "Toni Cole, 29, shared 4,431 texts and calls with a 28-year prisoner at HMP Five Wells in Northamptonshire. The communication, over a five-month period, was \"sexualised or flirtatious\", police said.",
        "Content": "A prison officer who kissed and sat on the lap of an inmate she was in a relationship with has been jailed for a year.  Toni Cole, 29, shared 4,431 texts and calls with a 28-year prisoner at HMP Five Wells in Northamptonshire. The texts and calls, which took place over five months, were \"sexualised or flirtatious\" in nature and included a photograph of underwear, Northamptonshire Police said. Cole pleaded guilty to misconduct in a public office and was sentenced to 12 months' imprisonment and ordered to pay a £187 surcharge at Northampton Crown Court last week. Police said Cole spent \"considerable time\" with the prisoner, whom she admitted she had kissed on at least one occasion, at the prison in Wellingborough. Police said the relationship came to light during a meeting on 25 January 2023, which had been arranged to discuss an unauthorised overtime shift she had worked two days earlier. The force said CCTV footage of that shift showed the prisoner with his arm around Cole. The prison officer, of Gordon Road, Wellingborough, had her Samsung S22 mobile phone seized from her locker when she was arrested. Read more from Sky News:'Comedy on prescription' trials startQR code stickers appear on thousands of gravesMan who killed Ronan Keating's brother avoids prison Police found there had been at least 18 video calls between the pair and they had shared messages between September 2022 and January 2023. The investigation also found Cole had sat on the inmate's lap and \"promised to tip him off\" if she found out his cell was going to be \"spun\" by her colleagues. Detective Inspector Richard Cornell, from the East Midlands Special Operations Unit, said: \"Toni Cole knew what she was doing was totally inappropriate, and that her behaviour was not only putting her at risk, but also the safety of her colleagues and inmates. \"The majority of prison staff carry out their duties to the highest standards, and I hope this sentence sends a clear message to those who seek to undermine public trust while holding positions of authority that inappropriate relationships will be robustly dealt with using the full force of the law.\""
    },
    {
        "title": "Man who 'exhibited fixated behaviour' towards Emma Raducanu given restraining order",
        "description": "A man who \"exhibited fixated behaviour\" towards British tennis player Emma Raducanu has been given a restraining order, Dubai Police have said.",
        "url": "https://news.sky.com/story/man-who-exhibited-fixated-behaviour-towards-emma-raducanu-given-restraining-order-13313208",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-emma-raducanu-raducanu_6833374.jpg?20250219090124",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-20 12:41:00",
        "Headline": "Raducanu chose to drop charges against the man in question. The 22-year-old British player appeared visibly upset during a match at the Dubai Tennis Championships.",
        "Content": " A man who \"exhibited fixated behaviour\" towards British tennis player Emma Raducanu has been given a restraining order, Dubai Police have said. Raducanu, 22, was visibly upset during a match at the Dubai Tennis Championships on Tuesday after the man was seated in the first few rows of the crowd. He was subsequently removed from the tennis court by security. Raducanu went on to lose the second round clash 7-6 (8-6) 6-4 to 14th seed Karolina Muchova. A day earlier, the man had reportedly handed the star a letter. Police said in a statement shared on social media on Thursday that the man was detained and Raducanu decided not to press charges. Dubai Police said they have taken \"swift action\" in relation to the incident and have not named the man. \n                  Emma Raducanu out of Australian Open: Brit needs intensity boost to challenge top players, says Laura Robson\n                 \n                  Emma Raducanu: Brit relishing Iga Swiatek clash at Australian Open\n                 \n                  Emma Raducanu refuses to treat insect bites at Australian Open over doping test fears\n                 \"Following Raducanu's complaint, Dubai Police detained a tourist who approached her, left her a note, took her photograph, and engaged in behaviour that caused her distress,\" it said. \"While Raducanu later chose to drop the charges, the individual signed a formal undertaking to maintain distance from her and has been banned from future tournaments. \"Dubai remains committed to ensuring the safety and security of all residents and visitors to the emirate.\" The statement was posted on the Dubai Media Office's X account. Raducanu said in an Instagram story after the match that it was a \"difficult experience\". She wrote: \"Thank you for the messages of support. Difficult experience yesterday but I'll be okay and proud of how I came back and competed despite what happened at the start of the match. \"Thank you to Karolina [Muchova] for being a great sport and best of luck to her for the rest of the tournament.\" Read more from Sky News:'Comedy on prescription' trials startQR code stickers appear on thousands of gravesMan who killed Ronan Keating's brother avoids prison Along with her message she posted an image of the Jane Austen novel Emma and a cup of coffee. The Women's Tennis Association (WTA) previously said in a statement that the man in question, who it said had displayed \"fixated behaviour\", will be \"banned from all WTA events pending a threat assessment\". \"Player safety is our top priority, and tournaments are advised on security best practices for international sporting events,\" the organisation said. In 2022, a 35-year-old man was handed a five-year restraining order - after a court heard Raducanu was \"constantly looking over her shoulder\" and no longer felt \"safe in her own home\". Amrit Magar had walked 23 miles to Raducanu's home and had stolen her father's shoe as a souvenir. Bromley Magistrates' Court heard how Magar went to the player's home on three separate occasions, loitered outside, left unwanted gifts and cards, and stole property from their porch. The court also heard from Raducanu through a victim impact statement read by prosecutors - which said that her parents were \"reluctant\" to let her go out on her own."
    },
    {
        "title": "'Monster' Omar Wilson found guilty of beating top chef to death near Notting Hill Carnival",
        "description": "A self-described \"monster\" has been found guilty of beating a top chef to death near Notting Hill Carnival - before going clubbing.",
        "url": "https://news.sky.com/story/monster-omar-wilson-found-guilty-of-beating-chef-to-death-near-notting-hill-carnival-13313355",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-omar-wilson-carnival_6834725.jpg?20250220154256",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-20 15:37:00",
        "Headline": "Omar Wilson has been convicted of the murder of Mussie Imnetu outside a restaurant near the Notting Hill Carnival last August. Wilson claimed he acted in self-defence.",
        "Content": "A self-described \"monster\" has been found guilty of beating a top chef to death near Notting Hill Carnival - before going clubbing. Omar Wilson, 32, was convicted of the murder of Mussie Imnetu at the Old Bailey after punching and kicking him during an altercation. Wilson claimed he acted in self-defence. CCTV showed him approach the 41-year-old chef and headbutt him outside the Dr Power restaurant in Queensway, near west London's Notting Hill Carnival on 26 August last year, the court heard. Around a minute later, Wilson punched Mr Imnetu five times in the head, continued to repeatedly punch him while he was on his hands and knees, and then kicked him in the head. Mr Imnetu, who worked under star chefs Gordon Ramsay and Marcus Wareing, was said to have been \"heavily intoxicated\" at the time and died from his injuries four days later in hospital. 'Victim was hit in head over dozen times' Prosecutor Jacob Hallam KC had said: \"The defendant had, by that point, struck him to his head more than a dozen times. Mr Imnetu had struck the defendant not once. \n                  Oliver White: Man convicted over £1.38m robbery that 'led to store manager ending his own life'\n                 \n                  Woman, 66, charged over 1978 death of five-year-old girl in south London\n                 \n                  Chiltern Firehouse: Fire at luxury London hotel 'started from pizza oven'\n                 \"At the end of that altercation, Mr Imnetu was dying on the ground and the defendant left and went clubbing in the Ministry of Sound.\" As nearby officers went to help the chef, Wilson walked away from the scene. He dropped his sunglasses and keys as he left. 'There's a monster in me' The court heard that after the assault, Wilson told an associate he \"crossed the line\" and said in a message: \"There's a monster in me, man, and it's just like sometimes it comes out. \"And I think I've messed up now, I've messed up, everything's finished.\" When asked how Notting Hill Carnival was in another message, the court heard that he replied: \"Can't lie. I did the hands ting [sic] and I think it's a manslaughter,\" jurors heard. Wilson's defence After his arrest on 28 August 2024, Wilson told police officers that he had struck Mr Imnetu in \"self-defence\". He also claimed that the chef was behaving erratically, harassing girls, and had a bottle. Speaking in court, Wilson said he felt \"trapped\" and \"scared\" at the time because he believed Mr Imnetu was holding a broken bottle - which turned out not to be the case. A jury found Wilson, of Leytonstone, guilty of murder on Thursday. He was remanded into custody and will be sentenced on Friday. Detective Chief Inspector Brian Howie said Mr Imnetu \"was in London for a few days to help train his colleagues and went out that evening to enjoy the post-Notting Hill Carnival atmosphere, where tragically he was violently assaulted\". Samantha Yelland, of the CPS, also said: \"Omar Wilson's savage violence ultimately took the life of a much-loved man, and the Crown Prosecution Service was determined that he should face justice.\""
    },
    {
        "title": "Fresh weather warnings as parts of UK brace for 70mph winds and heavy rain this weekend",
        "description": "New weather warnings of 70mph wind gusts and up to 90mm of rain have been issued for the weekend.",
        "url": "https://news.sky.com/story/fresh-weather-warnings-as-parts-of-uk-brace-for-70mph-winds-and-heavy-rain-this-weekend-13313459",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-london-westminster_6834925.jpg?20250220185807",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-20 18:27:00",
        "Headline": "Five yellow weather warnings - three for rain and two for wind - have been issued by the Met Office for Sunday.",
        "Content": "New weather warnings of 70mph wind gusts and up to 90mm of rain have been issued for the weekend. The Met Office issued five yellow weather warnings - three for rain and two for wind - throughout Sunday as the weekend is expected to end in a washout for large parts of the country. It comes after the weather agency issued rain and wind warnings for parts of Scotland, the east coast of Northern Ireland and west Wales for Friday. From 6am to 6pm on Sunday, southerly to southwesterly winds are expected to build along much of the UK, with all of Scotland, Wales and northern England, as well as parts of the Midlands and the South West under a yellow alert.  Find out the forecast for your area The Met Office said winds are to peak between the late morning and early afternoon, with gusts between 50mph and 60mph possible and \"perhaps as much as 70mph in exposed spots along Irish Sea coastlines, Scottish Islands, and other areas of high ground further inland\". It added: \"Rain will accompany strong winds, which will make for very poor weather conditions, especially on roads. \"Winds will then ease from southwest to northeast of the warning area through the afternoon and early evening.\" Under a separate alert from 3am to 3pm on Sunday, Northern Ireland is also set to see similar conditions, with winds \"expected to ease slowly through the afternoon\". A yellow warning for heavy rain is also in effect in southwest Scotland, with Dumfries under the alert from 7am to 3pm. Between 20mm to 30mm is expected to fall, but the Met Office added that \"in some places such as exposed south or southwest-facing hills nearer 40-50mm is likely\". Read more from Sky News:Bodies of Israeli hostages handed over by HamasFarage relinquishes majority control of Reform UK Large parts of South Wales are also under a heavy rain warning from 9am to 9pm on Sunday, with conditions \"bringing a spell of around 9-12 hours of rain\". The Met Office said that in this area, \"widely 30-50mm of rain is expected, but 60-90mm is possible in the wettest, most exposed places\". Another yellow rain warning is in effect from 9am to 9pm in parts of Cornwall, Devon and Plymouth, with between 30 to 40mm of rain widely expected \"but in a few places nearer 50-70 mm is possible\". In its weekend forecast, the Met Office added that for those away from the warnings, \"conditions over the next few days will still be blustery and wet at times, although some parts in the east may remain largely dry until Sunday\"."
    },
    {
        "title": "Surrey sinkhole: Residents who fled sinkhole may be out of their homes 'for months'",
        "description": "Residents who fled after a large sinkhole opened up in a Surrey village may not be able to return to their homes for \"several weeks, if not months\".",
        "url": "https://news.sky.com/story/surrey-sinkhole-residents-who-fled-sinkhole-may-be-out-of-their-homes-for-months-13313427",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-godstone-sinkhole-residents_6834914.jpg?20250220184239",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-20 17:37:00",
        "Headline": "Godstone resident Sarah Lewis describes her \"incredibly stressful\" situation after a large sinkhole opened up near her home and forced dozens of properties to be evacuated.",
        "Content": " Residents who fled after a large sinkhole opened up in a Surrey village may not be able to return to their homes for \"several weeks, if not months\". Carl Bussey, Surrey County Council's chair of the Strategic Coordination Group for the incident, said assessments on properties could continue but that residents would only be able to return home when buildings were \"deemed structurally safe\". Speaking to Sky News correspondent Shamaan Freeman-Powell, Godstone resident Sarah Lewis, said she and her family may have to live in alternative accommodation for months while repair work is carried out on the 62ft hole that appeared on Monday night.   \"We are being told it could be anything from two to four months before we could return to our homes,\" she said. \"I don't know what we are going to do.\" The 36-year-old IT worker said she is mainly disappointed for her children - two girls aged four and six - as she is currently unable to give them the \"security or stability\" they need. She said: \"Until we know how long we are going to be out of a home, we can’t really give them that. We don't know where we are going to be able to live, so we don't know what to tell them.\" Ms Lewis's property in William Way was one of 30 that were evacuated after Surrey County Council declared a major incident and put in place a 100m cordon near Godstone High Street due to the sinkhole. A second sinkhole then appeared in a property's front garden, which is thought to be linked to the first. What caused the two holes remains unknown and is still being investigated. Tandridge District Council said on Thursday that the sinkhole remains a \"significant incident\" and the council is working alongside Surrey County Council and other agencies to \"resolve the situation as quickly as possible\". It said work is ongoing to assess whether any properties are safe for residents to return to, and those still affected will be allowed back to the site to collect \"essential belongings\". Read more:What causes sinkholes and why are they popping up in the UK? It did not provide an estimate on how long residents would be out of their homes for. \"The full-scale repair of the site will likely take several weeks, if not months,\" Mr Bussey said. Matt Furniss, the cabinet member for highways, transport and economic growth at the county council, added that properties surrounding the sinkhole have been declared stable for now, but admitted this \"may not remain the case\".  'Who knows where we will go' Ms Lewis acknowledged the council is looking for proper long-term housing for affected residents, but it has not offered any financial support. \"It is frustrating,\" she said. \"This is going to cost us a lot of money, and it is unlikely we are going to be able to go back into our house to get larger items. We are going to have to buy to replace, even if we have to go and live in an Airbnb for the next few months.\" She added that until 9pm on Wednesday night, her family were \"homeless\" and claimed the Airbnb she had been put in by her home insurance company has black mould in. \"We have to stay there for the next week, but we don't know where we are going to live in a week's time,\" she added. \"We have worked really hard to buy the house we have brought, and who knows where we will go for the next few months.\" She said the whole ordeal has been \"incredibly stressful\". Businesses 'losing customers daily' Other residents, including garage owner Shane Fry, told Sky News his business was \"losing customers daily\" as people presume his garage is closed. \"I am trying to get them [local authorities] to put up at least some signage to say the business is still open,\" he said. \"My main priority is that the businesses can remain open and functional, otherwise it is going to cost us dearly. \"We are losing customers on a daily basis, they are going elsewhere and the moment they do, the chances of them coming back are going to be slim.\" Read more from Sky News:Prison officer jailed for kissing inmateAmazon takes creative control of James Bond In a separate statement, a spokesperson for Surrey County Council said: \"Residents who have been displaced are being supported by Tandridge District Council through their housing teams, and are being (and will be) contacted proactively throughout the incident. \"Both councils' contact centres have been receiving calls throughout the past three days, have dedicated webpages live and have been issuing updates via their news pages and social media.\" Local MP Claire Coutinho also said local businesses may be able to apply for a reduced council tax rate while the issue is ongoing."
    },
    {
        "title": "Doctor leading new screening trial warns of 'sharp rise' in prostate cancer if disease not detected earlier",
        "description": "Thousands of men are to be checked for prostate cancer in one of the first large-scale European trials of smart screening.",
        "url": "https://news.sky.com/story/doctor-leading-new-screening-trial-warns-of-sharp-rise-in-prostate-cancer-if-disease-not-detected-earlier-13313156",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-thomas-moore-cancer_6834536.jpg?20250220122333",
        "type": "UK",
        "Author": "Thomas Moore",
        "Date Published": "2025-02-20 11:19:00",
        "Headline": "Sky News was granted access to a pilot study in Ireland which aims to save thousands of lives - amid fears many men in the UK are getting treatment too late.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Thousands of men are to be checked for prostate cancer in one of the first large-scale European trials of smart screening. The pilot study, starting next week in Ireland, will combine a blood test with personal risk factors and an MRI scan to increase the accuracy of screening men in their 50s and 60s. Up to now health experts have rejected population screening in the belief that the benefits of earlier cancer detection were outweighed by the risks that some men could have unnecessary biopsies and risky treatment they don't need. But the PRAISE-U study is an attempt to save lives in a more targeted way, filtering out men who don't have cancer at an early stage, so they don't come to any harm. David Galvin, the head of the study and a surgeon at the Mater Hospital in Dublin, told Sky News that a safe, effective screening strategy was urgently needed. \"There is a tsunami of elderly patients coming towards us,\" he said. \"There's going to be a sharp rise in prostate cancer unless we have a way to detect the disease early and not burden our health care services with vast numbers of scans and biopsies.\" Thousands diagnosed too late Prostate cancer is the most common cancer in men in Ireland. In the UK it is now the most common of all cancers, causing more deaths than breast cancer. There are no symptoms in the early stages. Around 12,000 men a year in the UK alone are diagnosed too late to cure. Studies have shown that a blood test for a prostate protein called PSA can diagnose cases at an earlier stage, reducing deaths by 40%. But not all men with cancer have high levels of the PSA protein. And conversely, high levels can also be caused by other prostate conditions, infections, exercise and sexual activity. The unreliability of the test has held back its use for screening. But in the Irish pilot study, men will be scored by their PSA level and whether they have other risk factors such as black ethnicity or a family history. Those at low risk will be retested in future. Around half of the men will undergo a detailed MRI scan of their prostate to check for tumours - and only half those will then need a biopsy, in which a needle is inserted to extract cells for a precise diagnosis. Mr Galvin said the multi-stage screening meant only those who really need a biopsy will have one. \"I worked out that if you have the PSA test, there's about a 1 in 40 chance that you will ultimately need a biopsy. \"The other 39 men are reassured that testing is all normal and they don't have any clinically significant disease.\" Read more:Simple test could revolutionise dementia diagnosisAcid attack victim on how donated placenta saved eyeOdds of asteroid hitting Earth rise again 'I got away with it by the skin of my teeth' The PRAISE-U study is backed by the European Association of Urology and funded by the EU. Around 8,000 men in Waterford and two areas of Dublin will be randomly invited for screening over the next year. Tony Ward, a rugby legend and one of the best number 10s to play for Ireland, was diagnosed with an aggressive prostate cancer just over a decade ago. Even now he needs daily treatment and regular scans. He told Sky News screening to detect cancer at an earlier stage is desperately needed. \"It's everything, it's massive,\" he said. \"I did not have the early diagnosis, but I got away with it by the skin of my teeth.\" 'Very curable cancer kills 12,000 men every year' The UK's National Screening Committee, which advises the Department of Health, is reviewing the evidence on prostate cancer screening. But it's already taken two years, and a decision still isn't due until the end of 2025. Chiara De Biase, director of health services, equity and improvement from Prostate Cancer UK, said men were dying unnecessarily as a result. She said: \"12,000 men die every year from what is - when caught in its earliest stages - a very, very curable cancer. \"We think the evidence [for screening] is there and we can't see why this has taken so long.\" A spokesperson for the UK government's Department of Health and Social Care said: \"Prostate cancer patients are waiting too long for diagnosis and treatment, and we are determined to change that. \"Our National Cancer Plan will transform the way we treat cancer, making the UK a world leader in cancer survival by fighting the disease on all fronts, through improving research, diagnosis, screening, treatment and prevention. \"The UK National Screening Committee is reviewing the evidence for prostate cancer screening programmes, including targeted approaches for men at higher risk.\""
    },
    {
        "title": "Parents must not pay mandatory extra charges to access free childcare, government says",
        "description": "Parents who are entitled to hours of free childcare should not have to pay mandatory extra charges to secure their nursery place, the government has said.",
        "url": "https://news.sky.com/story/parents-must-not-pay-mandatory-extra-charges-to-access-free-childcare-government-says-13313166",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-childcare-free-childcare_6441519.jpg?20240202094158",
        "type": "UK",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-02-20 11:37:00",
        "Headline": "Updated guidance says local councils should intervene if a childcare provider seeks to make additional charges a condition for parents accessing their hours.  ",
        "Content": "\n          Political reporter\n              @alexrogerssky\n Parents who are entitled to hours of free childcare should not have to pay mandatory extra charges to secure their nursery place, the government has said. Updated guidance from the Department for Education states that while nurseries are entitled to ask parents to pay for extras - including meals, snacks, nappies or sun cream - these charges must be voluntary rather than mandatory. The guidance, which comes amid concerns that parents have faced high additional charges on top of the funded hours, also states that local councils should intervene if a childcare provider seeks to make additional charges a condition for parents accessing their hours. Since September last year, parents and carers with children aged nine months and older have been entitled to 15 hours of government-funded childcare a week, rising to 30 hours for three to four year-olds. Politics latest: Farage under fire for 'deeply disappointing' response to Trump's Zelenskyy attacks From this September, the 30 hours of care will be made available to all families - a rollout that was first introduced under the previous Conservative government. However, there have been concerns that in order to subsidise shortfalls in funding, nurseries have charged parents extra for essentials that would normally have been included in fees. \n                  'I gave birth to triplets and it pushed me to the brink of bankruptcy'\n                 \n                  Free childcare for nine-month-olds available from next week - but rollout comes with 'challenges'\n                 \n                  Parents may miss out on first choice free childcare places, education secretary warns\n                 Under the new guidance, nurseries will be now obliged to clearly set out any additional costs parents will have to pay, including on their websites. It says invoices should be itemised so parents can see a breakdown of the free entitlement hours, additional private paid hours and all the additional charges. 'Fundamental financial challenges facing the sector' Representatives of childcare providers welcomed the announcement but pointed out the financial stress that many nurseries were under. Neil Leitch, chief executive of the Early Years Alliance, said: \"While we fully agree that families should be able to access early entitlement hours without incurring additional costs, in reality, years of underfunding have made it impossible for the vast majority of settings to keep their doors open without relying on some form of additional fees or charges.  \"As such, while it is absolutely right that providers should be transparent with parents on any optional additional fees, today's guidance does absolutely nothing to address - or even acknowledge - the fundamental financial challenges facing the sector.\" He added: \"Given that from September, government will control the price of around 80% of early years provision, it has never been more important for that funding to genuinely reflect the true cost of delivering places. \"And yet we know in many areas, this year's rate increases won't come close to mitigating the impact April's National Insurance and wage rises, meaning that costs for both providers and families are likely to spiral.\" In last year's budget, Chancellor Rachel Reeves announced that the amount businesses will pay on their employees' national insurance contributions will increase from 13.8% to 15% from April this year. She also lowered the current £9,100 threshold employers start paying national insurance on employees' earnings to £5,000, in what she called a \"difficult choice\" to make. Last month a survey from the National Day Nurseries Association (NDNA) found that cost increases from April will force nurseries to raise fees by an average of 10%. This could be welcome news for working parents as they approach the end of another half term break during which they will have incurred childcare costs.\n\n But this money would not affect school age children.\n\nIt is dedicated to very young children, aged two or below and is targeting parents, predominantly mothers, that want to return to work.\n\n Previously after doing the sums and factoring in childcare costs, many mums would have felt that it wasn’t worth it.\n\n And so, if these funds are easily accessible on a local level it could make a real difference to those wanting to get back to work.\n\n The survey, covering nurseries in England, revealed that staffing costs will increase by an average of 15%, with respondents saying that more than half of the increase was due to the national insurance decision in the budget. Purnima Tanuku CBE, chief executive of the NDNA, said \"taking away the flexibility for providers around charges could seriously threaten sustainability\". \"The funding government pays to providers has never been about paying for meals, snacks or consumables, it is to provide early education and care,\" she said. \"Childcare places have historically been underfunded with the gap widening year on year.  \"From April, the operating costs for the average nursery will go up by around £47,000 once statutory minimum wages and changes to national insurance contributions are implemented. NIC changes have not been factored into the latest funding rates, further widening the underfunding gap.\" Read more:Free childcare plan risks lowering standards, report findsReport finds up to 300,000 children missing from school last year The Department for Education said its offer to parents meant they could save up to £7,500 on average when using the full 30 hours a week of government-funded childcare support, compared to if they were paying for it themselves. In December, the government also announced that a £75m expansion grant would be distributed to nurseries and childminders to help increase places ahead of the full rollout of funded childcare.  Local authority allocations for the expansion grant will be confirmed before the end of February. Some of the largest areas could be provided with funding of up to £2.1m."
    },
    {
        "title": "Domestic abuse specialists placed in 999 control rooms after women's murders",
        "description": "The first domestic violence specialists have been placed in 999 control rooms in memory of a woman who was murdered by her ex-husband despite ringing police on the night she died.",
        "url": "https://news.sky.com/story/domestic-abuse-specialists-placed-in-999-control-rooms-after-womens-murders-13313360",
        "image_url": "https://e3.365dm.com/22/11/1920x1080/474b1acdc0c3b1e24c1977cdd015068feffc0a470b432de8144990f6e364d11f_5970675.jpg?20250220164139",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-02-20 15:46:00",
        "Headline": "Raneem's Law has been launched in five pilot areas to improve police responses to domestic violence calls after the murders of Raneem Oudeh and her mother Khaola Saleem by Ms Oudeh's ex-husband.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  The first domestic violence specialists have been placed in 999 control rooms in memory of a woman who was murdered by her ex-husband despite ringing police on the night she died. Raneem's Law has been launched in five pilot areas - West Midlands, Northumbria, Northamptonshire, Bedfordshire and Humberside. The legislation - promised in Labour's manifesto - is named after 22-year-old Raneem Oudeh and her mother Khaola Saleem, 49, who were murdered by Ms Oudeh's ex-husband in August 2018. Ms Oudeh had called 999 more than a dozen times in the months leading up to her death, including to report threats to kill her, but police did not log the reports correctly, did not follow up and did not assess them correctly. On the night she was killed, she rang 999 four times but the police did not respond in time. The new domestic abuse specialists will ensure that calls for help are properly assessed, managed and responded to, the government said. Their duties will include advising on risk assessments, making referrals to specialist services and identifying missed opportunities to safeguard victims. \n                  Parents must not pay mandatory extra charges to access free childcare, government says\n                 \n                  Politics latest: Russia doesn't look like it wants peace, warns foreign secretary\n                 \n                  Sir Keir Starmer held calls with European leaders to ensure Western alliance 'does not fracture'\n                 The first phase will inform plans for a national rollout across 43 police forces in England and Wales and will be underpinned by £2.2m funding over the next financial year. Home Secretary Yvette Cooper said: \"Every 30 seconds, someone calls the police about domestic abuse - over 100 people every hour seeking urgent help. \"That's why we are determined to overhaul the police emergency response to domestic abuse, making sure that victims get the specialist support and protection they need. That must be Raneem and Khaola's legacy.\"  Read More:Violence against women and girls is growingDomestic abuse victim speaks out On the night she died, Ms Oudeh was told to go to her mother's house and officers would visit her the next day. She was on the phone to West Midlands Police when she was stabbed by Janbaz Tarin, her estranged husband, one of the many calls she had made about him that night. Ms Oudeh had broken up with her husband in the weeks before the attack after discovering he had three children and a secret wife who was pregnant with a fourth child in Afghanistan. Tarin admitted the murders and was jailed for life with a minimum of 32 years in December 2018. An inquest found the police force \"materially contributed\" to their deaths. Five officers were disciplined over the failures. Nour Norris, Ms Oudeh's aunt and Mrs Saleem's sister who has been campaigning to improve outcomes for domestic abuse victims, said today's announcement would help save lives. \"Raneem called for help, and today, the system finally answered,\" she said. \"I can't express enough how deeply emotional and significant this moment is.\""
    },
    {
        "title": "Man dies after being arrested by Border Force officers at Manchester Airport",
        "description": "An investigation has been launched after a man died following his arrest by Border Force officers at Manchester Airport.",
        "url": "https://news.sky.com/story/man-dies-after-being-arrested-by-border-force-officers-at-manchester-airport-13313661",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-manchester-airport_6781185.jpg?20241220113728",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-20 22:39:00",
        "Headline": "The Independent Office for Police Conduct says the man, 27, was arrested after \"displaying unusual behaviour\" at Manchester Airport where he was set to travel on Wednesday.",
        "Content": "An investigation has been launched after a man died following his arrest by Border Force officers at Manchester Airport. The man, 27, was detained after \"displaying unusual behaviour\" at the airport where he was set to travel on Wednesday, according to the Independent Office for Police Conduct (IOPC). In a statement, the watchdog said: \"He was subsequently arrested by officers and taken to a holding area where he became unwell and paramedics were called. \"Sadly, he was pronounced dead at 1.53pm. After being notified of the man's death, we declared an independent investigation into the circumstances at 4.29pm on Wednesday.\" The investigation started the same afternoon after the Home Office referred the case to the IOPC, which added investigators have been sent to the scene to begin gathering evidence. Read more from Sky News:Liam Payne death charges droppedPrison officer jailed over relationship with inmate IOPC director Amanda Rowe added in the statement: \"First and foremost, our thoughts are with the man's family and loved ones, as well as all those affected by his death. \"When someone dies after being taken into custody, it is important for there to be a thorough investigation to understand what has happened. \"We have been in touch with the man's family to explain our role and will keep them updated as the investigation progresses. \"Our investigation is in its very early stages and no further information is available at this time.\""
    },
    {
        "title": "Israel says body returned by Hamas is not that of hostage Shiri Bibas",
        "description": "Israel says Hamas has not handed over the body of hostage Shiri Bibas - saying they had instead received the remains of an \"anonymous body without identification\".",
        "url": "https://news.sky.com/story/israel-says-it-has-not-received-hostages-remains-and-hamas-handed-over-unidentified-body-13313681",
        "image_url": "https://e3.365dm.com/23/11/1920x1080/skynews-shiri-bibas-ariel-kfir_6376697.jpg?20231129151946",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-20 23:19:00",
        "Headline": "The Israeli military, which confirmed it had received the bodies of Ms Bibas' two young sons, has accused Hamas of a \"serious violation\" of the ceasefire agreement.",
        "Content": "Israel says Hamas has not handed over the body of hostage Shiri Bibas - saying they had instead received the remains of an \"anonymous body without identification\". Ms Bibas was kidnapped with her sons - four-year-old Ariel, and nine-month-old Kfir - from the Niz Or kibbutz during the Palestinian militant group's incursion into Israel in October 2023. The Israel Defense Forces (IDF) confirmed they received the bodies of Ariel and Kfir on Thursday. However, they said the body that Hamas had claimed was their mother was not her and the group had therefore violated the ceasefire agreement. In a statement, the IDF said: \"During the identification process, it was found that the additional body received was not that of Shiri Bibas, and no match was found for any other abductee. It is an anonymous body without identification. \"This is a very serious violation by the Hamas terrorist organisation, which is required by the agreement to return four dead abductees. We demand that Hamas return Shiri home along with all of our abductees.\" The IDF added: \"We share the deep sorrow of the Bibas family at this difficult time and will continue to make every effort to return Shiri and all the kidnapped as soon as possible.\" \n                  German election: From AI influencers to Russian disinformation, the far-right is getting a leg up online \n                 \n                  Buses explode in Israel - as military blocks entry to some areas of West Bank\n                 \n                  Ukraine war latest: Washington 'cancels' news conference after Zelenskyy meets US official\n                 The body of journalist and peace activist Oded Lifshitz, who was 83 when he was abducted, was also handed over on Thursday. Hamas has said they were all killed in Israeli airstrikes near the start of the war. The group has never provided evidence to back this up, while Israel has not confirmed the claims.  Hamas handed over the remains as part of the Gaza ceasefire agreement which was reached with Israel last month. The bodies were transferred in four black coffins in a carefully orchestrated public display as a crowd of Palestinians and dozens of armed Hamas militants watched. Israelis lined the road in the rain near the Gaza border to pay their respects as the convoy carrying the coffins drove by. In Tel Aviv, people gathered, some weeping, in a public square opposite Israel's defence headquarters that has come to be known as Hostages Square. Meanwhile, Israeli Prime Minister Benjamin Netanyahu vowed to eliminate Hamas and said the four coffins meant \"more than ever\" that Israel had to ensure there was no repeat of the 7 October attack. Mr Netanyahu said: \"Our loved ones' blood is shouting at us from the soil and is obliging us to settle the score with the despicable murderers, and we will.\" Read more:Trump 'very frustrated' with ZelenskyyBuses explode in Israel in 'terror incident'Trump's direction of travel doesn't look good for Kyiv Israel's President Isaac Herzog said: \"Agony. Pain. There are no words. Our hearts - the hearts of an entire nation - lie in tatters.\" United Nations human rights chief, Volker Turk, called the parading of the four bodies \"cruel\" and \"inhumane\" in a statement on Thursday. He said: \"Under international law, any handover of the remains of deceased must comply with the prohibition of cruel, inhuman or degrading treatment, ensuring respect for the dignity of the deceased and their families.\" The Bibas family has become a powerful symbol of the 251 Israelis kidnapped on 7 October - not least because Kfir was the youngest taken. The children's father, Yarden Bibas, was released on 1 February as part of the ceasefire deal between Hamas and Israel. International correspondent The return of the bodies of four Israeli hostages is a \"sombre moment\" for everybody in Israel and Jews across the world, our international correspondent Diana Magnay says. She says the two young boys, Ariel and Kfir, \"really became a symbol of the tremendous suffering 7 October caused\". \"Now, to have them returned back in this way is tragic.\" Referring to the scenes of coffins being transferred to the Red Cross, Magnay says Hamas has chosen to use this \"as a propaganda opportunity\". \"They have missiles on the stage where the four coffins were, saying they were killed by US bombs,\" she explains. She says Hamas's main message is \"this was caused by you, you should take responsibility for it\". She adds that 7 October was caused by Hamas, and has brought \"untold suffering to both Israel and Palestinians\". Meanwhile, six living hostages, the final due to be freed under the first phase of the Gaza truce deal, will be released on Saturday, according to Hamas. Israelis who survived being held prisoner in Gaza have been released in small groups since the first six-week phase began last month. The deal has provided a vital pause in the fighting that's devastated Gaza and left tens of thousands dead. At least 1,200 people were killed in the attack that started the war. Since then, the Hamas-run Gaza health ministry says more than 48,000 Palestinians have been killed in Israeli attacks. Its figures do not differentiate between civilians and fighters."
    },
    {
        "title": "German election: From AI influencers to Russian disinformation, the far-right is getting a leg up online ",
        "description": "Voters in Germany are being exposed to copious pro-AfD narratives online from AI-generated content and Russian disinformation campaigns.",
        "url": "https://news.sky.com/story/german-election-from-ai-influencers-to-russian-disinformation-the-far-right-is-getting-a-leg-up-online-13313167",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ai-germany-larissa-wagner_6835222.jpg?20250221015347",
        "type": "World",
        "Author": "Kaitlin Tosh, Sophia Massam and Tom Cheshire, Data and Forensics team",
        "Date Published": "2025-02-20 11:40:00",
        "Headline": "Germany's far-right party Alternative for Deutschland (AfD) has been more active on social media than other parties during the campaign and is in second place in opinion polls ahead of the country's election on Sunday.",
        "Content": "By Kaitlin Tosh, Sophia Massam and Tom Cheshire, Data and Forensics team   Voters in Germany are being exposed to copious pro-AfD narratives online from AI-generated content and Russian disinformation campaigns. Experts monitoring social media say Russian-based groups are involved, including \"Doppelganger\" and \"Storm-1516\", which US officials found to be active in America's election last year. Some of these campaigns are using artificial intelligence to spread their messaging ahead of Sunday's vote, which will see Germany elect a new Bundestag. Methods are said to include creating fake TV news stories or deep-fake videos of apparent \"witnesses\" or \"whistle blowers\" fabricating stories about prominent politicians. For example, in November 2024, shortly before the snap election was called, a video was published that claimed one parliamentary member who is an outspoken supporter of Ukraine was a Russian spy. Dr Marcus Faber, a member of the Free Democratic Party and head of the government's defence committee, was targeted in a video which used AI to suggest a former adviser was making the claim. We asked Dr Faber for his reaction to the video but he was unable to comment at this time. In another video an 18-year-old woman accused a German minister of child abuse - the accusation was false, and the video was made using AI. A recent report from the Center for Monitoring, Analysis and Strategy, or CeMAS, a non-profit thinktank specialising in the analysis of disinformation and right-wing extremism, and Alliance 4 Europe which aims to combat digital disinformation, has linked both stories to the Russian disinformation campaign Storm-1516. The researchers have also been tracking the Doppelganger campaign, run by a Russian PR company Social Design Agency, widely reported to have links to the Kremlin. They have found the group's main tactic is to create fake news articles, which often resemble well-known publications. A network of social media accounts then share and spread those articles across different platforms. Posts will often appear to be from a worried citizen, like the one below that reads: \"I am concerned that aid to Ukraine will impact our ability to invest in our own infrastructure and social security systems.\" The post links to a fake news article criticising Germany's funding for the war in Ukraine, on a fake website resembling the German newspaper Der Spiegel. \"Different Russian campaigns are trying, on the one hand, to discredit established parties,\" says Julia Smirnova, a senior researcher for CeMAS. \"They're also trying to boost the far-right AfD.\" \"It's not about just one fake video or one fake article. There's a systematic effort to constantly create this flood of false stories, flood of propaganda stories, and continue spreading them,\" she says. From mid-December 2024 to mid-January 2025, CeMAS found a total of 630 German-language posts with typical Doppelgänger patterns on X alone. For Ferdinand Gehringer, a cybersecurity policy adviser, Russian interference online isn't a surprise. \"There are clear objectives for Russia to interfere and to also manipulate our public opinion,\" he says. From the party's plan to stop sending arms to Ukraine to their calls to ramp up imports of Russian gas, he says \"Russia sees within the AfD's program and ideas the best options for future cooperation\". CeMAS has found at least one case where a fake story that originated from a Russian campaign was spread by an AfD politician. Stephan Protschka, a parliamentary member, posted on his social media channels that the Green Party was working with Ukraine to recruit people to commit crimes and blame them on the AfD, a narrative researchers say originated from a Russian disinformation campaign. Sky News asked Mr Protschka for comment, but he did not respond. We also reached out to Social Design Agency to respond to the allegations against the Doppelganger group. They did not respond. We were unable to contact anyone behind the Storm-1516 campaign for comment. Inside Germany  Beyond the extremes of Russian-led disinformation campaigns, far-right groups within Germany are also ramping up their online presence. Take Larissa Wagner, an AI-generated social media influencer. \"Hey guys, I'm just on my way to the polling station. I'm daring this time. I'm voting for AfD,\" she said in a video posted to her X account on 22 September 2024, the day of the Brandenburg state election. Her accounts on Twitter and Instagram were both created in the last year and her regular videos espouse far-right narratives, like telling Syrian immigrants to \"pack your bags and go back home\". She even says she interned with the right-wing magazine Compact, which was banned by the German government last year. It's unclear who created Larissa. When Sky News messaged to ask her on Instagram she replied: \"I think it's completely irrelevant who controls me. Influencers like me are the future... \"Like anyone else, I want to share my perspective on things. Every influencer does that. But because I'm young, attractive, and right-wing, it's framed as 'influencing the political discourse'.\" Ferdinand Gehringer notes that her posts have become more radical over time. \"The potential for influence is significant-especially since the presence of a young, attractive woman increases audience engagement,\" he adds. The far-right's use of generative AI on social media goes beyond characters like Larissa. A report this week from the Institute for Strategic Dialogue assessed the scale of its use, identifying 883 posts since April 2023 that included images, memes and music videos made using generative AI. The posts came from far-right supporters as well as the AfD itself - party accounts published more than 50 posts that contained generative AI content in October alone. The AfD is using AI more than other parties, says Pablo Maristany de las Casas, an analyst at the Institute for Strategic Dialogue who co-authored the report. \"They're clearly the one actor that is exploiting this technology the most,\" he says. The messaging in the far-right content they sampled falls into two categories: attacking narratives, like AI-generated images of migrants portrayed as violent criminals, and narratives that glorify traditional German values. When these two narratives are combined, \"the far-right community feels more united in the so-called cultural fight against these groups that they're attacking,\" says Mr Maristany de las Casas. Take Remigration Song, a promotional song and music video commissioned by the now-disbanded youth wing of the AfD. It was produced using AI and advocates the mass deportation of immigrants - known as remigration. It's this home-grown content that some experts say could affect public opinions. A recent survey by the Bertelsmann Foundation, a thinktank which promotes social reform, showed that 80% of Germans consider disinformation on the internet to be a major problem for society and 88% agreed that disinformation is spread to influence political opinions. \"Just the foreign information itself is probably not going to shift attitudes\" says senior researcher Cathleen Berger. \"I think the impact only comes when it is being picked up by domestic actors\". Additional reporting from Olive Enokido-Lineham, OSINT producer; Mary Poynter, Data and Forensics producer. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open-source information. Through multimedia storytelling, we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Buses explode in Israel - as military blocks entry to some areas of West Bank",
        "description": "Three buses have exploded near Tel Aviv in what Israeli police called a \"terror incident\", as they search for suspects.",
        "url": "https://news.sky.com/story/israeli-police-investigating-reports-of-explosions-involving-several-buses-13313540",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bat-yam-israel-bus-explosion_6835085.jpg?20250220212151",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-20 20:16:00",
        "Headline": "Defence minister Israel Katz says he instructed the IDF to \"intensify counter-terrorism operations in the Tulkarem refugee camp and throughout refugee camps in the West Bank\".",
        "Content": " Three buses have exploded near Tel Aviv in what Israeli police called a \"terror incident\", as they search for suspects. Two of the blasts were in the city of Bat Yam, south of Tel Aviv, and a third was reported in the nearby town of Holon, a police spokesperson said on Thursday. Officers said they also found at least one unexploded device in Holon. They added: \"Several suspicious objects were also examined by police bomb disposal units, but suspicion was ruled out in those cases.\" Police earlier said that \"no injuries have been reported at this stage\", and that the Shin Bet internal security agency was taking over the investigation. The explosions happened on the same day that four bodies were returned by Hamas as part of a ceasefire deal with Israel. In response to the bus blasts, Israeli defence minister Israel Katz instructed the Israel Defence Forces (IDF) to intensify operations in the West Bank as the military blocked entry points to certain areas of the occupied Palestinian territory. Timer bombs \n                  Bodies of four Israeli hostages handed over by Hamas - as parading of coffins labelled 'inhumane'\n                 \n                  Hamas says bodies of Bibas family to be handed over - with six more Israelis to walk free on Saturday\n                 \n                  Israel-Hamas ceasefire thrown into further doubt as Marco Rubio backs Benjamin Netanyahu's war aims\n                 Speaking to local broadcaster Channel 12, an Israeli police official said the bombs used were with a timer and were non-standard explosives. They added that investigators believe the bombs looked similar to those made in the West Bank, but it was not confirmed where they were produced. A group identifying itself as a branch of Qassam Brigades - Hamas's military wing - from the northern West Bank city of Tulkarem later said on Telegram: \"We will never forget to take vengeance for our martyrs as long as the occupation is on our lands.\" It comes as Mr Katz said he told the IDF to \"intensify counter-terrorism operations in the Tulkarem refugee camp and throughout refugee camps in the West Bank\". The defence minister added: \"We will pursue the terrorists relentlessly and destroy the terror infrastructure in the camps, which serve as a forward base for the Iranian axis of evil. \"Residents who provide shelter and protection to terrorists will pay a heavy price.\" The IDF also said in a statement that it has \"intensified counter-terrorism operations in Judea and Samaria continue\" and will focus on \"intelligence findings\". Israel has repeatedly carried out military raids on suspected Palestinian militants in the West Bank since Hamas's October 7 2023 attack sparked the war in Gaza. Since the Gaza ceasefire took effect on 19 January this year, Tulkarem and two refugee camps in the city have been the focus of Israel's offensive. Read more from Sky News:Ceasefire in further doubt as US backs Netanyahu's aims Prime Minister Benjamin Netanyahu's office said in a statement that he was being updated by his military secretary on the situation, and would soon hold a security assessment. Tzvika Brot, mayor of Bat Yam, also called it a miracle that no one was hurt, and said the buses had finished their routes and were in a car park."
    },
    {
        "title": "Trump envoy Steve Witkoff says he has developed a 'friendship' with Putin",
        "description": "The man who has emerged as Donald Trump's geopolitical dealmaker-in-chief has said that he's developed a \"friendship\" with Russian President Vladimir Putin.",
        "url": "https://news.sky.com/story/trump-envoy-steve-witkoff-says-he-has-developed-a-friendship-with-putin-13313676",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-steve-witkoff_6835207.jpg?20250220232608",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-02-20 22:53:00",
        "Headline": "Steve Witkoff made the remark as he discussed a remarkable overnight trip to Moscow last week to secure the release of US citizen Marc Fogel.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  The man who has emerged as Donald Trump's geopolitical dealmaker-in-chief has said that he's developed a \"friendship\" with Russian President Vladimir Putin. Steve Witkoff was named as Mr Trump's Middle East envoy shortly after the US election but he has since been involved in negotiations with Russia about ending the war in Ukraine. Mr Witkoff made the comments about his relationship with Mr Putin at a Saudi-run investment forum in Miami, where he discussed his remarkable overnight trip to Moscow last week to secure the release of US citizen Marc Fogel. \"I spent a lot of time with Putin. Talking and developing a friendship and relationship with him…\" Mr Witkoff said. The secret overnight trip to bring the Pennsylvania teacher home seems to be emerging as a key moment in the dramatically shifting dynamics between the Trump administration and the Kremlin. The details of the release and what was discussed have never been released. Follow latest: Ukraine war live updates \n                  Ukraine war latest: Washington 'cancels' news conference after Zelenskyy meets US official\n                 \n                  Donald Trump hits back at 'terrible' Volodymyr Zelenskyy and calls him a 'dictator' amid US-Russia talks\n                 \n                  Ukraine's president is fighting a war on two fronts - against Russian forces on the ground and against American assaults over the airwaves\n                 In describing the success of the deal, Mr Witkoff said: \"First I had the support of President Trump which is a really big deal. Secondly we have a really good relationship with the Saudis…. They assured us that this was real... and so to me it became worth the trip. And so we went. And it was a great trip. I spent a lot of time with President Putin, talking, developing a friendship, a relationship with him and that led to Mark getting on the plane…\" The role of the Saudi government is a reflection of Riyadh's remarkable and emerging geopolitical clout. After Mr Witkoff's Moscow trip, the Riyadh talks between the US and Russia were secured. Read analysis:Zelenskyy fighting a war on two frontsTrump's direction of travel does not look good for Kyiv  Speaking to Sky News on the sidelines of the investment conference and addressing President Trump's \"dictator\" comments about President Zelenskyy, Mr Witkoff said: \"I think I agree with President Trump, he has a very keen sense of what has to be done to create a lasting peace between Russia and Ukraine. \"And I follow his lead, and I believe in what he's got to say.\" He added: \"I think it brings… the president has an uncanny ability of knowing how to bring people together and this is the beginning.\""
    },
    {
        "title": "Doctor leading new screening trial warns of 'sharp rise' in prostate cancer if disease not detected earlier",
        "description": "Thousands of men are to be checked for prostate cancer in one of the first large-scale European trials of smart screening.",
        "url": "https://news.sky.com/story/doctor-leading-new-screening-trial-warns-of-sharp-rise-in-prostate-cancer-if-disease-not-detected-earlier-13313156",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-thomas-moore-cancer_6834536.jpg?20250220122333",
        "type": "World",
        "Author": "Thomas Moore",
        "Date Published": "2025-02-20 11:19:00",
        "Headline": "Sky News was granted access to a pilot study in Ireland which aims to save thousands of lives - amid fears many men in the UK are getting treatment too late.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Thousands of men are to be checked for prostate cancer in one of the first large-scale European trials of smart screening. The pilot study, starting next week in Ireland, will combine a blood test with personal risk factors and an MRI scan to increase the accuracy of screening men in their 50s and 60s. Up to now health experts have rejected population screening in the belief that the benefits of earlier cancer detection were outweighed by the risks that some men could have unnecessary biopsies and risky treatment they don't need. But the PRAISE-U study is an attempt to save lives in a more targeted way, filtering out men who don't have cancer at an early stage, so they don't come to any harm. David Galvin, the head of the study and a surgeon at the Mater Hospital in Dublin, told Sky News that a safe, effective screening strategy was urgently needed. \"There is a tsunami of elderly patients coming towards us,\" he said. \"There's going to be a sharp rise in prostate cancer unless we have a way to detect the disease early and not burden our health care services with vast numbers of scans and biopsies.\" Thousands diagnosed too late Prostate cancer is the most common cancer in men in Ireland. In the UK it is now the most common of all cancers, causing more deaths than breast cancer. There are no symptoms in the early stages. Around 12,000 men a year in the UK alone are diagnosed too late to cure. Studies have shown that a blood test for a prostate protein called PSA can diagnose cases at an earlier stage, reducing deaths by 40%. But not all men with cancer have high levels of the PSA protein. And conversely, high levels can also be caused by other prostate conditions, infections, exercise and sexual activity. The unreliability of the test has held back its use for screening. But in the Irish pilot study, men will be scored by their PSA level and whether they have other risk factors such as black ethnicity or a family history. Those at low risk will be retested in future. Around half of the men will undergo a detailed MRI scan of their prostate to check for tumours - and only half those will then need a biopsy, in which a needle is inserted to extract cells for a precise diagnosis. Mr Galvin said the multi-stage screening meant only those who really need a biopsy will have one. \"I worked out that if you have the PSA test, there's about a 1 in 40 chance that you will ultimately need a biopsy. \"The other 39 men are reassured that testing is all normal and they don't have any clinically significant disease.\" Read more:Simple test could revolutionise dementia diagnosisAcid attack victim on how donated placenta saved eyeOdds of asteroid hitting Earth rise again 'I got away with it by the skin of my teeth' The PRAISE-U study is backed by the European Association of Urology and funded by the EU. Around 8,000 men in Waterford and two areas of Dublin will be randomly invited for screening over the next year. Tony Ward, a rugby legend and one of the best number 10s to play for Ireland, was diagnosed with an aggressive prostate cancer just over a decade ago. Even now he needs daily treatment and regular scans. He told Sky News screening to detect cancer at an earlier stage is desperately needed. \"It's everything, it's massive,\" he said. \"I did not have the early diagnosis, but I got away with it by the skin of my teeth.\" 'Very curable cancer kills 12,000 men every year' The UK's National Screening Committee, which advises the Department of Health, is reviewing the evidence on prostate cancer screening. But it's already taken two years, and a decision still isn't due until the end of 2025. Chiara De Biase, director of health services, equity and improvement from Prostate Cancer UK, said men were dying unnecessarily as a result. She said: \"12,000 men die every year from what is - when caught in its earliest stages - a very, very curable cancer. \"We think the evidence [for screening] is there and we can't see why this has taken so long.\" A spokesperson for the UK government's Department of Health and Social Care said: \"Prostate cancer patients are waiting too long for diagnosis and treatment, and we are determined to change that. \"Our National Cancer Plan will transform the way we treat cancer, making the UK a world leader in cancer survival by fighting the disease on all fronts, through improving research, diagnosis, screening, treatment and prevention. \"The UK National Screening Committee is reviewing the evidence for prostate cancer screening programmes, including targeted approaches for men at higher risk.\""
    },
    {
        "title": "Luis Rubiales found guilty of sexual assault after kissing Jenni Hermoso without consent after World Cup final",
        "description": "Former Spanish football chief Luis Rubiales has been found guilty of sexual assault for kissing player Jenni Hermoso without her consent after the Women's World Cup final in 2023.",
        "url": "https://news.sky.com/story/luis-rubiales-found-guilty-over-kissing-jenni-hermoso-after-womens-world-cup-final-13313194",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-luis-rubiales-court_6826350.jpg?20250212094207",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-20 05:59:00",
        "Headline": "Luis Rubiales, 47, stood accused of sexual assault and of then attempting to coerce Jenni Hermoso, 34, into declaring the kiss had been consensual. He denied the charges as he stood trial at the High Court in Madrid.",
        "Content": "Former Spanish football chief Luis Rubiales has been found guilty of sexual assault for kissing player Jenni Hermoso without her consent after the Women's World Cup final in 2023. Spain's High Court has ordered Rubiales to pay a fine of more than €10,000 (£8,274) but has acquitted him of coercion. Prosecutors had demanded a prison sentence for Rubiales, who is to appeal the ruling, saying: \"I am going to keep fighting.\" World Cup winner Hermoso, 34, previously told Rubiales's trial in Madrid she \"never\" agreed to him kissing her on the lips - and the moment \"tainted one of the happiest days\" of her life. Rubiales, 47, was accused of sexual assault and of then attempting to coerce Hermoso, who is Spain's all-time top goalscorer, into declaring the kiss had been consensual. He denied the charges, claiming the kiss on the lips was consensual and happened in a \"moment of jubilation\". Hermoso repeatedly claimed the kiss with Rubiales, a controversy which ended up overshadowing Spain's 1-0 victory over England in August 2023, was not consensual. \n                  Spanish police arrest crew of migrant boat over eight deaths - including toddler\n                 \n                  Luis Rubiales 'absolutely sure' kiss with Jenni Hermoso after Spain World Cup victory was consensual\n                 \n                  Trump-style victory the aim for Europe's far-right as leaders praise US president at Madrid conference\n                  Scandal was a tipping point The ensuing scandal eclipsed Spain's first Women's World Cup victory and proved a tipping point for efforts by Spain's female players to expose sexism and achieve parity with male counterparts. Hermoso told the High Court earlier this month she \"felt disrespected\" and had \"never\" agreed to the kiss. \"I didn't hear or understand anything,\" she said. \"The next thing he did was to grab me by the ears and kiss me on the mouth.\" \"I knew I was being kissed by my boss and that should not happen in any social or work environment,\" she added. \"I think it was a moment that tainted one of the happiest days of my life. \"All this meant I couldn't enjoy at all being a world champion after I landed back in Madrid.\" Sports correspondent This was a sexual assault by one of the most powerful men in football broadcast live around the world.\n English FA chair Debbie Hewitt - on the podium in Sydney - expressed shock at the aggression. And still Luis Rubiales believed there would be no consequence for forcing a kiss on Spain star Jenni Hermoso, defiant even as outrage grew in the days and weeks after the World Cup final. Perhaps emboldened by the silence of the men who run football, Rubiales - rather than resigning - denigrated Hermoso. He was eventually forced to quit as Spanish federation president and ousted as president of UEFA. And once Hermoso filed a criminal complaint, prosecutors took up her fight for justice. The guilty verdict has, as Spain's equality minister Ana Redondo said on Thursday, certified that \"when there is no consent, there is aggression\".\n Hermoso has been believed. But there are concerns about why Rubiales and three co-defendants were acquitted of attempting to coerce Hermoso into defending him in public. Yet the world was able to see and hear how Rubiales used his powerful platform in the days after the World Cup final to attempt to undermine Hermoso and her credibility. The judge found a lack of violent intimidation. And with Rubiales appealing the verdict - having avoided jail for the sexual assault - it delays Hermoso's ability to reclaim 20 August 2023 as purely a day of glory - the team's greatest sporting achievement. Irene Paredes, the captain of Spain's women's team, said she respected the court's decision but was surprised Rubiales was acquitted of the coercion charge. \"I think the conviction for sexual assault is correct. What I find somehow striking and strange is that there is no conviction for coercion,\" she told a pre-match news conference on Friday. Ruairidh Barlow, the editor of Football Espana magazine, told Sky News that in the future \"it [the verdict] may be something that people study and say 'this was a moment when change came'\". But some say the verdict was too lenient, and Mr Barlow said many were hoping an example would be made of Rubiales by giving him a punishment that \"mattered a little bit more, because he earns this [his fine] in four days. A lot of people think this was a missed opportunity to go a little bit further.\" Campaigner Jane Kenyon, from Girls Out Loud, said a jail term wouldn't make much difference and Rubiales was guilty of \"invading somebody's space and a power-play\". \"It's about saying this is not acceptable and from this point on, we learn and behave differently in public towards women,\" she said. Read more from Sky News: Mysterious QR code stickers appear on more than 1,000 gravesAlice Weidel: The woman at the top of Germany's far-right AfD party Following the scandal, Rubiales eventually resigned and in October 2023 was banned from all football-related activities for three years by world governing body FIFA. Rubiales claimed he was the victim of a \"witch hunt\" by \"false feminists\". The fallout from the incident led to a boycott by Spanish players of both the women's and men's national teams, while the case sparked protests in Spain and beyond demanding \"a sport free of sexist violence\"."
    },
    {
        "title": "Man who 'exhibited fixated behaviour' towards Emma Raducanu given restraining order",
        "description": "A man who \"exhibited fixated behaviour\" towards British tennis player Emma Raducanu has been given a restraining order, Dubai Police have said.",
        "url": "https://news.sky.com/story/man-who-exhibited-fixated-behaviour-towards-emma-raducanu-given-restraining-order-13313208",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-emma-raducanu-raducanu_6833374.jpg?20250219090124",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-20 12:41:00",
        "Headline": "Raducanu chose to drop charges against the man in question. The 22-year-old British player appeared visibly upset during a match at the Dubai Tennis Championships.",
        "Content": " A man who \"exhibited fixated behaviour\" towards British tennis player Emma Raducanu has been given a restraining order, Dubai Police have said. Raducanu, 22, was visibly upset during a match at the Dubai Tennis Championships on Tuesday after the man was seated in the first few rows of the crowd. He was subsequently removed from the tennis court by security. Raducanu went on to lose the second round clash 7-6 (8-6) 6-4 to 14th seed Karolina Muchova. A day earlier, the man had reportedly handed the star a letter. Police said in a statement shared on social media on Thursday that the man was detained and Raducanu decided not to press charges. Dubai Police said they have taken \"swift action\" in relation to the incident and have not named the man. \n                  Emma Raducanu out of Australian Open: Brit needs intensity boost to challenge top players, says Laura Robson\n                 \n                  Emma Raducanu: Brit relishing Iga Swiatek clash at Australian Open\n                 \n                  Emma Raducanu refuses to treat insect bites at Australian Open over doping test fears\n                 \"Following Raducanu's complaint, Dubai Police detained a tourist who approached her, left her a note, took her photograph, and engaged in behaviour that caused her distress,\" it said. \"While Raducanu later chose to drop the charges, the individual signed a formal undertaking to maintain distance from her and has been banned from future tournaments. \"Dubai remains committed to ensuring the safety and security of all residents and visitors to the emirate.\" The statement was posted on the Dubai Media Office's X account. Raducanu said in an Instagram story after the match that it was a \"difficult experience\". She wrote: \"Thank you for the messages of support. Difficult experience yesterday but I'll be okay and proud of how I came back and competed despite what happened at the start of the match. \"Thank you to Karolina [Muchova] for being a great sport and best of luck to her for the rest of the tournament.\" Read more from Sky News:'Comedy on prescription' trials startQR code stickers appear on thousands of gravesMan who killed Ronan Keating's brother avoids prison Along with her message she posted an image of the Jane Austen novel Emma and a cup of coffee. The Women's Tennis Association (WTA) previously said in a statement that the man in question, who it said had displayed \"fixated behaviour\", will be \"banned from all WTA events pending a threat assessment\". \"Player safety is our top priority, and tournaments are advised on security best practices for international sporting events,\" the organisation said. In 2022, a 35-year-old man was handed a five-year restraining order - after a court heard Raducanu was \"constantly looking over her shoulder\" and no longer felt \"safe in her own home\". Amrit Magar had walked 23 miles to Raducanu's home and had stolen her father's shoe as a souvenir. Bromley Magistrates' Court heard how Magar went to the player's home on three separate occasions, loitered outside, left unwanted gifts and cards, and stole property from their porch. The court also heard from Raducanu through a victim impact statement read by prosecutors - which said that her parents were \"reluctant\" to let her go out on her own."
    },
    {
        "title": "Pope Francis 'improving slightly and working from hospital' amid talk of him quitting",
        "description": "The Pope's overall condition is \"improving slightly\" and his heart is working well, as he continues hospital treatment for double pneumonia, the Vatican has said.",
        "url": "https://news.sky.com/story/popes-condition-improving-slightly-amid-talk-of-francis-quitting-13313439",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-the-pope-catholicism_6684520.jpg?20240914032748",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-20 17:55:00",
        "Headline": "The pontiff had breakfast in an armchair before working with aides, according to officials, as a cardinal said \"everything is possible\" when discussing what might happen if Francis doesn't recover fully.",
        "Content": "The Pope's overall condition is \"improving slightly\" and his heart is working well, as he continues hospital treatment for double pneumonia, the Vatican has said. Francis, 88, does not have a fever and his \"hemodynamic parameters\" are \"stable\", according to spokesman Matteo Bruni. Hemodynamic parameters refer to the body's ability to regulate the flow of blood through its organs and tissues. The pontiff was admitted to Rome's Gemelli Hospital last Friday after struggling with breathing difficulties as a bout of bronchitis had worsened. The Pope has been diagnosed with pneumonia in both lungs, on top of a polymicrobial infection in his respiratory tract, meaning a combination of bacteria, viral and other organisms. Mr Bruni said that after waking on Thursday, Francis got out of bed and had breakfast in an armchair, before working from his hospital room with his aides. Blood tests have showed a \"slight improvement\" in some inflammation readings but it will still be some time before doctors will know if the various therapies are working. \n                  'Historic blow' to Sicilian mafia after more than 180 arrests by Italian police\n                 \n                  Italian court deals controversial Albania migrant scheme another blow\n                 \n                  Italian PM Giorgia Meloni investigated for repatriating Libyan warlord wanted on international arrest warrant\n                 He is taking a combination of antibiotics and cortisone for what doctors also diagnosed as asthmatic bronchitis. On the same day as the positive update, leading figures in the Catholic Church have openly discussed the possibility of Francis stepping down.  'Everything is possible' Cardinal Jean-Marc Aveline, the archbishop of Marseille, told a Vatican news conference that \"everything is possible\". He was speaking at a briefing on a youth initiative, which was instead dominated by questions over the Pope's health and whether he might decide to resign if he does not recover fully. Cardinal Juan Jose Omella Omella, his counterpart from Barcelona, emphasised that church life continued even with Francis in the hospital. \"Popes change, we bishops change, priests in parishes change, communities change. But the train continues being on the move,\" he said. Could Francis follow in Benedict's footsteps? Another cardinal, Gianfranco Ravasi, was asked earlier on Thursday if Francis might decide to follow in the footsteps of Pope Benedict XVI and step down if he becomes too ill. Benedict became the first pope in 600 years to retire when he decided in 2013 that he wasn't strong enough to carry on. Cardinal Ravasi was quoted as telling RTL 102.5 radio: \"There is no question that if he [Francis] was in a situation where his ability to have direct contact (with people) as he likes to do... was compromised, then I think he might decide to resign.\" Read more on Sky News:Ex-football chief guilty of sex assaultStickers appear on 1,000+ gravesProfile: Germany's far-right leader Pope Francis has a history of respiratory illness, having lost part of one of his lungs to pleurisy as a young man. He had an acute case of pneumonia in 2023 and is prone to respiratory infections in winter. The illness has not affected his appetite for work, though, Cardinal Aveline said, as \"If you really want him to rest, you have to hospitalise him.\" Francis has already confirmed that shortly after being elected pontiff he wrote a resignation letter in case medical problems prevented him from carrying out his duties. Another senior cleric, Archbishop Giuseppe Satriano of Bari, said he was confident Francis would recover as \"he's a fighter, so I think he'll win this battle\"."
    },
    {
        "title": "Liam Payne death charges against friend and two hotel workers dropped in Argentina",
        "description": "Manslaughter charges over the death of Liam Payne have been dropped for his friend Roger Nores and two hotel workers.",
        "url": "https://news.sky.com/story/liam-payne-death-charges-against-friend-and-two-hotel-workers-dropped-in-argentina-13313212",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-liam-payne-one-direction_6740978.jpg?20241106203038",
        "type": "World",
        "Author": "Gemma Peplow",
        "Date Published": "2025-02-20 12:43:00",
        "Headline": "Rogelio \"Roger\" Nores has said he is happy to now be able to travel to the UK to \"say goodbye to my friend\" following the ruling. Charges of supplying drugs to Liam Payne before his death in Argentina still stand against two other men.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Manslaughter charges over the death of Liam Payne have been dropped for his friend Roger Nores and two hotel workers. Rogelio \"Roger\" Nores, hotel operator Gilda Martin, and head of reception Esteban Grassi were charged in December, two months after the One Direction star's death at the Casa Sur Hotel in Buenos Aires, Argentina. At the same time, hotel employee Ezequiel Pereyra and waiter Braian Paiz were charged with supplying cocaine to Payne. Following an appeal, the manslaughter charges against Nores, Martin and Grassi have now been dropped, court documents show. The charges against Pereyra and Paiz still stand and they remain in prison awaiting a trial. Speaking after the ruling, Nores told Rolling Stone: \"Glad this is finally over. I'm happy I'm now going to be able to travel to the UK and say goodbye to my friend.\" Nores, Martin and Grassi would have faced up to five years in prison had they been convicted. Supplying drugs in Argentina carries a sentence of up to 15 years. The latest court document states that Payne fell from the balcony of his room on the third floor of the hotel at about 5.10pm on 16 October. In the hours beforehand, the singer had been involved in an argument with two women in the hotel lobby, the court document states, and cleaning staff later reported the television in his hotel room was broken. Toxicology tests revealed that before his death, he had traces of alcohol, cocaine, and a prescription antidepressant in his body. His cause of death was \"polytrauma\" from multiple injuries and internal and external bleeding, a postmortem found."
    },
    {
        "title": "Trump envoy Steve Witkoff says he has developed a 'friendship' with Putin",
        "description": "The man who has emerged as Donald Trump's geopolitical dealmaker-in-chief has said that he's developed a \"friendship\" with Russian President Vladimir Putin.",
        "url": "https://news.sky.com/story/trump-envoy-steve-witkoff-says-he-has-developed-a-friendship-with-putin-13313676",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-steve-witkoff_6835207.jpg?20250220232608",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-02-20 22:53:00",
        "Headline": "Steve Witkoff made the remark as he discussed a remarkable overnight trip to Moscow last week to secure the release of US citizen Marc Fogel.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  The man who has emerged as Donald Trump's geopolitical dealmaker-in-chief has said that he's developed a \"friendship\" with Russian President Vladimir Putin. Steve Witkoff was named as Mr Trump's Middle East envoy shortly after the US election but he has since been involved in negotiations with Russia about ending the war in Ukraine. Mr Witkoff made the comments about his relationship with Mr Putin at a Saudi-run investment forum in Miami, where he discussed his remarkable overnight trip to Moscow last week to secure the release of US citizen Marc Fogel. \"I spent a lot of time with Putin. Talking and developing a friendship and relationship with him…\" Mr Witkoff said. The secret overnight trip to bring the Pennsylvania teacher home seems to be emerging as a key moment in the dramatically shifting dynamics between the Trump administration and the Kremlin. The details of the release and what was discussed have never been released. Follow latest: Ukraine war live updates \n                  Ukraine war latest: Washington 'cancels' news conference after Zelenskyy meets US official\n                 \n                  Donald Trump hits back at 'terrible' Volodymyr Zelenskyy and calls him a 'dictator' amid US-Russia talks\n                 \n                  Ukraine's president is fighting a war on two fronts - against Russian forces on the ground and against American assaults over the airwaves\n                 In describing the success of the deal, Mr Witkoff said: \"First I had the support of President Trump which is a really big deal. Secondly we have a really good relationship with the Saudis…. They assured us that this was real... and so to me it became worth the trip. And so we went. And it was a great trip. I spent a lot of time with President Putin, talking, developing a friendship, a relationship with him and that led to Mark getting on the plane…\" The role of the Saudi government is a reflection of Riyadh's remarkable and emerging geopolitical clout. After Mr Witkoff's Moscow trip, the Riyadh talks between the US and Russia were secured. Read analysis:Zelenskyy fighting a war on two frontsTrump's direction of travel does not look good for Kyiv  Speaking to Sky News on the sidelines of the investment conference and addressing President Trump's \"dictator\" comments about President Zelenskyy, Mr Witkoff said: \"I think I agree with President Trump, he has a very keen sense of what has to be done to create a lasting peace between Russia and Ukraine. \"And I follow his lead, and I believe in what he's got to say.\" He added: \"I think it brings… the president has an uncanny ability of knowing how to bring people together and this is the beginning.\""
    },
    {
        "title": "Alleged Chilean crime gang charged after string of star US athletes burgled",
        "description": "Seven Chilean men have been charged with burgling the homes of a number of US sports stars.",
        "url": "https://news.sky.com/story/alleged-chilean-crime-gang-charged-after-string-of-star-us-athletes-burgled-13312994",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-patrick-mahomes-american-footbal_6834240.jpg?20250220065415",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-20 00:40:00",
        "Headline": "A number of top American football and basketball players saw their homes targeted while they were away playing, the FBI said previously.",
        "Content": "Seven Chilean men have been charged with burgling the homes of a number of US sports stars. While the FBI complaint doesn't name the athletes, it previously listed a number of burglaries involving the Kansas City Chiefs' Patrick Mahomes and Travis Kelce, Joe Burrow of the Cincinnati Bengals, as well as players for the Tampa Bay Buccaneers and the NBA's Milwaukee Bucks and Memphis Grizzlies. According to the criminal complaint, lodged in a federal court in Florida, the defendants are part of a burglary ring that \"is known to target high-profile professional athletes when they are known to be away from home\". Among the goods they stole, were $2m (£1.58m) in watches, jewellery, cash and other valuables, including a safe they later cracked. The defendants are named as Pablo Zuniga Cartes, 24; Ignacio Zuniga Cartes, 20; Bastian Jimenez Freraut, 27; Jordan Quiroga Sanchez, 22; Bastian Orellano Morales, 23; Alexander Huiaguil Chavez, 24; and Sergio Ortega Cabello, 38. Some of the men were arrested in January, during a traffic stop in Ohio, on state charges for allegedly breaking into the home of Burrow - the Bengals' quarterback. Four of the men were found to be in the country illegally according to a court filing in Clark County, Ohio. \n                  Ukraine war latest: Washington 'cancels' news conference after Zelenskyy meets US official\n                 \n                  Trump envoy Steve Witkoff says he has developed a 'friendship' with Putin\n                 \n                  Donald Trump hits back at 'terrible' Volodymyr Zelenskyy and calls him a 'dictator' amid US-Russia talks\n                 The group was alleged to have taken photos of themselves with some of the stolen goods. In one case, a suspect is allegedly seen wearing a Kansas City Chiefs shirt. One sports star whose home was robbed, Bobby Portis of the Milwaukee Bucks, said on Wednesday that it was good to know some arrests had been made. \"With that being said, you put all you can into the game, and then you come home and all your belongings are gone - things that you worked hard for. It's kind of gratifying that these guys have been caught, obviously, because you work so hard for your things,\" Portis said. Read more from Sky News:KFC leaves KentuckyMan convicted over £1.38m watch robberyTomb of Egyptian pharaoh found The FBI added the defendants would often split into smaller groups to commit multiple burglaries at the same time. \"However, though burglary groups may consist of four or five members, these separate groups often work in concert with one another, communicate with one another and (use) the same buyers of stolen merchandise,\" the law enforcement agency said. Much of the evidence outlined by the FBI is mobile phone data, CCTV footage and licence plate readers that, it claims, place the group in the area of the burglaries. The defendants allegedly used crude methods such as breaking windows or prying open sliding glass doors with crowbars, to get in."
    },
    {
        "title": "Passengers onboard Delta jet that crashed and flipped over in Toronto offered $30,000 each",
        "description": "Passengers onboard the Delta jet that crashed on a runway in Toronto, flipping over and leaving them dangling upside down, have been offered $30,000 (&#163;23,800) each by the airline.",
        "url": "https://news.sky.com/story/passengers-onboard-delta-jet-that-crashed-and-flipped-over-in-toronto-offered-30000-each-13312997",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-toronto-delta-crash_6834254.jpg?20250220022204",
        "type": "US",
        "Author": "Kieren Williams",
        "Date Published": "2025-02-20 01:34:00",
        "Headline": "On Monday, a flight from Minneapolis-St. Paul to Pearson Airport in Toronto crashed in dramatic fashion. But all 80 people onboard survived.",
        "Content": "\n          News Reporter\n              @kjjjwilliams\n  Passengers onboard the Delta jet that crashed on a runway in Toronto, flipping over and leaving them dangling upside down, have been offered $30,000 (£23,800) each by the airline. On Monday, a flight, operated by Delta subsidiary Endeavor Air, from Minneapolis-St. Paul to Pearson Airport in Toronto crashed, skidding in flames and rolling over after it touched down. All 80 people onboard were evacuated with no deaths and many were able to walk off unaided.  While a number of people ended up in hospital, the crash could have been much worse. It came after 67 people were killed on 29 January when a passenger jet in Washington DC collided mid-air with an army helicopter. With investigations into the Toronto crash ongoing, Delta airlines confirmed to Sky News that passengers were being offered a cash lump sum. This, a spokesperson said, had \"no strings attached\" and did not affect their rights. \n                  Why did the plane crash in Toronto - and how did everyone escape?\n                 \n                  Passengers describe escape from upside-down Delta jet at Toronto's Pearson Airport\n                 \n                  Ice hockey game between USA and Canada has three fights in first nine seconds\n                  'We hit the ground and we were sideways' The cause of the crash is still unknown, but passengers onboard recounted how it happened in seconds. Pete Koukov told Sky's US partner network NBC News: \"The wheels touched down... I was in the window seat on the lookers left side, and then all of a sudden, I just remember being fully sideways. \"I was looking down and just seeing like sparks and flames and whatever was grinding against the ground. \"It happened pretty dang quick and we were just upside down, hanging from our seat belts.\"  Mr Koukov praised the flight attendants for a \"pretty organised\" evacuation and said \"everyone got off in a pretty orderly fashion\". Video footage of the crash quickly circulated online. Read more from Sky News:KFC leaves KentuckyTomb of Egyptian pharaoh foundOdds of asteroid hitting Earth rise again Another passenger, John Nelson, told CNN some people needed help freeing themselves from their seats. \"We hit the ground, and we were sideways, and then we were upside down,\" he said. He added: \"I was able to just unbuckle and sort of fall and push myself to the ground. And then some people were kind of hanging and needed some help being helped down, and others were able to get down on their own.\" Speaking to CBS News, Peter Carlson said he was worried a fire could engulf the jet. \"All the sudden everything just kind of went sideways and then next thing I know it's kind of a blink and I'm upside down still strapped in,\" he said. Mr Carlson said he smelled aviation fuel and saw it streaming down the windows. He said he knew he needed to get out quickly in case a fire started, but that he and another man first helped free a mother and her young son. Delta chief executive Ed Bastian previously said \"the hearts of the entire global Delta family are with those affected.\""
    },
    {
        "title": "Nigel Farage relinquishes majority control of Reform UK",
        "description": "Nigel Farage has given up sole control of Reform UK, with the party's members now being \"handed over ownership\" following a vote last year, according to its chairman.",
        "url": "https://news.sky.com/story/nigel-farage-relinquishes-majority-control-of-reform-uk-13313227",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-nigel-farage-reform-uk_6824054.jpg?20250209170359",
        "type": "Business",
        "Author": "Tim Baker",
        "Date Published": "2025-02-20 13:12:00",
        "Headline": "A board will be put in place to set the direction for the party, with Reform's more than 200,000 members to vote on decisions at the annual conference in an advisory manner according to a new constitution.",
        "Content": "\n          Political reporter\n       Nigel Farage has given up sole control of Reform UK, with the party's members now being \"handed over ownership\" following a vote last year, according to its chairman. The party, led by Mr Farage, was previously controlled by the Clacton MP as he held a majority of shares in the company. According to the party's new constitution, a board will instead be set up that will lead and direct the party, with members voting in an advisory manner on policies at the annual conference. Politics latest: Farage says Zelenskyy 'not a dictator' Members also have the power to call an \"extraordinary general meeting\", and launch no-confidence motions in the party leader. In a statement, Reform chairman Zia Yusuf said: \"We are pleased to announce that, as promised, Nigel Farage has handed over ownership of Reform UK to its members. \"Reform UK is now a non-profit, with no shareholders, limited by guarantee. \"We are assembling the governing board, in line with the constitution. \"This was an important step in professionalising the party. \"We will soon have more exciting announcements about Reform UK as we prepare for government.\"  Documents filed with Companies House show that all shareholders in Reform UK Party Limited have given up their shares and control of the organisation. Instead, a limited company called Reform 2025 Ltd is listed as being in control of the party. Reform 2025 Ltd has two directors - Mr Farage and Mr Yusuf - but no shareholders or persons with significant control. It is understood this is because the membership is said to be in control. This appears to put it in a similar structure to the Labour Party, while the Conservatives and Liberal Democrats appear to have controlling leaders or chairs. Read more:Reform seen as stronger than ToriesParty tops poll for first timeFarage compares Reform polling to Trump According to the party's website, Reform UK have more than 211,000 members - close to double the Conservative membership. Mr Farage says he wants to overtake Labour, which has around 309,000 members. The party won five seats at the last general election off the back of 4.1 million votes. For comparison, the Liberal Democrats won 72 seats off the back of 3.5 million votes. This discrepancy is largely down to seats votes are concentrated in. 👉 Listen to Sky News Daily on your podcast app 👈 Recent polling has shown that Reform are seen as stronger than Labour on a range of topics among voters, including trustworthiness, strength, and \"clear sense of purpose\". Earlier in February, the party also topped a voter intention poll for the first time."
    },
    {
        "title": "James Bond: Amazon takes creative control of 007 franchise",
        "description": "Creative control of the long-running James Bond franchise has been handed to Amazon MGM Studios, in a joint venture with the current owners.",
        "url": "https://news.sky.com/story/james-bond-amazon-takes-creative-control-of-007-franchise-13313350",
        "image_url": "https://e3.365dm.com/19/12/1920x1080/skynews-james-bond-daniel-craig_4856376.jpg?20191204135823",
        "type": "Business",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-20 15:30:00",
        "Headline": "The James Bond joint deal between Barbara Broccoli, Michael G Wilson and Amazon follows speculation over when the next Bond movie will be made, and who the new 007 will be.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Creative control of the long-running James Bond franchise has been handed to Amazon MGM Studios, in a joint venture with the current owners. Barbara Broccoli and Michael G Wilson - who are the daughter and stepson of film producer Albert \"Cubby\" Broccoli, the man responsible for developing the Bond franchise into the success it is today - will remain co-owners of 007 intellectual property rights. The pair own EON Productions, the company behind Bond films including Skyfall and Spectre. It has produced 25 films since 1962.   The deal follows speculation over when the next Bond movie - and indeed the next Bond - will be announced. The last film, No Time To Die, was delivered four years ago to rave reviews and box office success. It was the swansong for Daniel Craig in his performance of the lady-loving spy. \n                  James Bond spin-offs, origin stories, reality shows? After Amazon takeover, what happens to 007?\n                 \n                  George Lazenby: Former James Bond star retires from acting – and signing autographs\n                 \n                  Diamonds Are Not Forever? Shirley Bassey auctions jewellery\n                 Details of the 26th official Bond film - and its new star - are yet to be revealed. In a statement on EON Productions website, Mike Hopkins, head of Prime Video and Amazon MGM Studios said they were \"honoured to continue this treasured heritage\" and looked forward to \"ushering in the next phase of the legendary 007 for audiences around the world\". Wilson said that after 60 years spent working across the franchise, he would now be focusing on \"art and charitable projects\". Barbara Broccoli said: \"My life has been dedicated to maintaining and building upon the extraordinary legacy that was handed to Michael and me by our father, producer Cubby Broccoli. \"I have had the honour of working closely with four of the tremendously talented actors who have played 007 and thousands of wonderful artists within the industry. With the conclusion of No Time To Die and Michael retiring from the films, I feel it is time to focus on my other projects.\" In 2022, Amazon bought MGM Studios, which distributes Bond, for $8.45bn (£6.79bn). Since the acquisition, the streamer has held the rights to distribute all the Bond movies. In the spring of 2023, Amazon Prime Video launched Bond-themed reality show, 007 Road To A Million. Hosted by Succession star Brian Cox, it offered nine pairs of contestants the chance to win £1m as they travelled through global locations associated with the franchise. While no one took home the full £1m jackpot, brothers James and Joey did take £150,000. The show was met with a mixed critical reception but was given the green light for a second season."
    },
    {
        "title": "Domestic abuse specialists placed in 999 control rooms after women's murders",
        "description": "The first domestic violence specialists have been placed in 999 control rooms in memory of a woman who was murdered by her ex-husband despite ringing police on the night she died.",
        "url": "https://news.sky.com/story/domestic-abuse-specialists-placed-in-999-control-rooms-after-womens-murders-13313360",
        "image_url": "https://e3.365dm.com/22/11/1920x1080/474b1acdc0c3b1e24c1977cdd015068feffc0a470b432de8144990f6e364d11f_5970675.jpg?20250220164139",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-02-20 15:46:00",
        "Headline": "Raneem's Law has been launched in five pilot areas to improve police responses to domestic violence calls after the murders of Raneem Oudeh and her mother Khaola Saleem by Ms Oudeh's ex-husband.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  The first domestic violence specialists have been placed in 999 control rooms in memory of a woman who was murdered by her ex-husband despite ringing police on the night she died. Raneem's Law has been launched in five pilot areas - West Midlands, Northumbria, Northamptonshire, Bedfordshire and Humberside. The legislation - promised in Labour's manifesto - is named after 22-year-old Raneem Oudeh and her mother Khaola Saleem, 49, who were murdered by Ms Oudeh's ex-husband in August 2018. Ms Oudeh had called 999 more than a dozen times in the months leading up to her death, including to report threats to kill her, but police did not log the reports correctly, did not follow up and did not assess them correctly. On the night she was killed, she rang 999 four times but the police did not respond in time. The new domestic abuse specialists will ensure that calls for help are properly assessed, managed and responded to, the government said. Their duties will include advising on risk assessments, making referrals to specialist services and identifying missed opportunities to safeguard victims. \n                  Parents must not pay mandatory extra charges to access free childcare, government says\n                 \n                  Politics latest: Russia doesn't look like it wants peace, warns foreign secretary\n                 \n                  Sir Keir Starmer held calls with European leaders to ensure Western alliance 'does not fracture'\n                 The first phase will inform plans for a national rollout across 43 police forces in England and Wales and will be underpinned by £2.2m funding over the next financial year. Home Secretary Yvette Cooper said: \"Every 30 seconds, someone calls the police about domestic abuse - over 100 people every hour seeking urgent help. \"That's why we are determined to overhaul the police emergency response to domestic abuse, making sure that victims get the specialist support and protection they need. That must be Raneem and Khaola's legacy.\"  Read More:Violence against women and girls is growingDomestic abuse victim speaks out On the night she died, Ms Oudeh was told to go to her mother's house and officers would visit her the next day. She was on the phone to West Midlands Police when she was stabbed by Janbaz Tarin, her estranged husband, one of the many calls she had made about him that night. Ms Oudeh had broken up with her husband in the weeks before the attack after discovering he had three children and a secret wife who was pregnant with a fourth child in Afghanistan. Tarin admitted the murders and was jailed for life with a minimum of 32 years in December 2018. An inquest found the police force \"materially contributed\" to their deaths. Five officers were disciplined over the failures. Nour Norris, Ms Oudeh's aunt and Mrs Saleem's sister who has been campaigning to improve outcomes for domestic abuse victims, said today's announcement would help save lives. \"Raneem called for help, and today, the system finally answered,\" she said. \"I can't express enough how deeply emotional and significant this moment is.\""
    },
    {
        "title": "Parents must not pay mandatory extra charges to access free childcare, government says",
        "description": "Parents who are entitled to hours of free childcare should not have to pay mandatory extra charges to secure their nursery place, the government has said.",
        "url": "https://news.sky.com/story/parents-must-not-pay-mandatory-extra-charges-to-access-free-childcare-government-says-13313166",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-childcare-free-childcare_6441519.jpg?20240202094158",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-02-20 11:37:00",
        "Headline": "Updated guidance says local councils should intervene if a childcare provider seeks to make additional charges a condition for parents accessing their hours.  ",
        "Content": "\n          Political reporter\n              @alexrogerssky\n Parents who are entitled to hours of free childcare should not have to pay mandatory extra charges to secure their nursery place, the government has said. Updated guidance from the Department for Education states that while nurseries are entitled to ask parents to pay for extras - including meals, snacks, nappies or sun cream - these charges must be voluntary rather than mandatory. The guidance, which comes amid concerns that parents have faced high additional charges on top of the funded hours, also states that local councils should intervene if a childcare provider seeks to make additional charges a condition for parents accessing their hours. Since September last year, parents and carers with children aged nine months and older have been entitled to 15 hours of government-funded childcare a week, rising to 30 hours for three to four year-olds. Politics latest: Farage under fire for 'deeply disappointing' response to Trump's Zelenskyy attacks From this September, the 30 hours of care will be made available to all families - a rollout that was first introduced under the previous Conservative government. However, there have been concerns that in order to subsidise shortfalls in funding, nurseries have charged parents extra for essentials that would normally have been included in fees. \n                  'I gave birth to triplets and it pushed me to the brink of bankruptcy'\n                 \n                  Free childcare for nine-month-olds available from next week - but rollout comes with 'challenges'\n                 \n                  Parents may miss out on first choice free childcare places, education secretary warns\n                 Under the new guidance, nurseries will be now obliged to clearly set out any additional costs parents will have to pay, including on their websites. It says invoices should be itemised so parents can see a breakdown of the free entitlement hours, additional private paid hours and all the additional charges. 'Fundamental financial challenges facing the sector' Representatives of childcare providers welcomed the announcement but pointed out the financial stress that many nurseries were under. Neil Leitch, chief executive of the Early Years Alliance, said: \"While we fully agree that families should be able to access early entitlement hours without incurring additional costs, in reality, years of underfunding have made it impossible for the vast majority of settings to keep their doors open without relying on some form of additional fees or charges.  \"As such, while it is absolutely right that providers should be transparent with parents on any optional additional fees, today's guidance does absolutely nothing to address - or even acknowledge - the fundamental financial challenges facing the sector.\" He added: \"Given that from September, government will control the price of around 80% of early years provision, it has never been more important for that funding to genuinely reflect the true cost of delivering places. \"And yet we know in many areas, this year's rate increases won't come close to mitigating the impact April's National Insurance and wage rises, meaning that costs for both providers and families are likely to spiral.\" In last year's budget, Chancellor Rachel Reeves announced that the amount businesses will pay on their employees' national insurance contributions will increase from 13.8% to 15% from April this year. She also lowered the current £9,100 threshold employers start paying national insurance on employees' earnings to £5,000, in what she called a \"difficult choice\" to make. Last month a survey from the National Day Nurseries Association (NDNA) found that cost increases from April will force nurseries to raise fees by an average of 10%. This could be welcome news for working parents as they approach the end of another half term break during which they will have incurred childcare costs.\n\n But this money would not affect school age children.\n\nIt is dedicated to very young children, aged two or below and is targeting parents, predominantly mothers, that want to return to work.\n\n Previously after doing the sums and factoring in childcare costs, many mums would have felt that it wasn’t worth it.\n\n And so, if these funds are easily accessible on a local level it could make a real difference to those wanting to get back to work.\n\n The survey, covering nurseries in England, revealed that staffing costs will increase by an average of 15%, with respondents saying that more than half of the increase was due to the national insurance decision in the budget. Purnima Tanuku CBE, chief executive of the NDNA, said \"taking away the flexibility for providers around charges could seriously threaten sustainability\". \"The funding government pays to providers has never been about paying for meals, snacks or consumables, it is to provide early education and care,\" she said. \"Childcare places have historically been underfunded with the gap widening year on year.  \"From April, the operating costs for the average nursery will go up by around £47,000 once statutory minimum wages and changes to national insurance contributions are implemented. NIC changes have not been factored into the latest funding rates, further widening the underfunding gap.\" Read more:Free childcare plan risks lowering standards, report findsReport finds up to 300,000 children missing from school last year The Department for Education said its offer to parents meant they could save up to £7,500 on average when using the full 30 hours a week of government-funded childcare support, compared to if they were paying for it themselves. In December, the government also announced that a £75m expansion grant would be distributed to nurseries and childminders to help increase places ahead of the full rollout of funded childcare.  Local authority allocations for the expansion grant will be confirmed before the end of February. Some of the largest areas could be provided with funding of up to £2.1m."
    },
    {
        "title": "Sir Keir Starmer held calls with European leaders to ensure Western alliance 'does not fracture'",
        "description": "Sir Keir Starmer has held private calls with European leaders to ensure the Western alliance does not fracture, a minister has said, after Donald Trump claimed Volodymyr Zelenskyy was a \"dictator\".",
        "url": "https://news.sky.com/story/sir-keir-starmer-held-calls-with-european-leaders-to-ensure-western-alliance-does-not-fracture-13313088",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-volodymyr-zelenskyy_6801270.jpg?20250116132622",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-20 09:23:00",
        "Headline": "Donald Trump accused Ukraine's president of being a dictator and told him he'd \"better move fast or he is not going to have a country left\".",
        "Content": "Sir Keir Starmer has held private calls with European leaders to ensure the Western alliance does not fracture, a minister has said, after Donald Trump claimed Volodymyr Zelenskyy was a \"dictator\". Culture Secretary Lisa Nandy told Wilfred Frost on Sky News Breakfast the prime minister has spent a \"quite considerable amount of time\" over the past few days talking privately to European leaders \"to make sure that the alliance doesn't fracture\". The conversations come ahead of a meeting with Mr Trump in Washington DC next week after the president said Ukrainian leader Mr Zelenskyy was a dictator. Politics latest: US ambassador dodges Sky News questions on Trump's 'very interesting speech' He also said Mr Zelenskyy \"better move fast or he is not going to have a country left\" as peace talks between the US and Russia - without Ukraine - took place in Saudi Arabia. The decision for the talks to take place without Kyiv or Europe has caused concern and sparked an emergency meeting of European leaders in France earlier this week. Sir Keir backed the Ukrainian president in a phone call with him and said he was \"Ukraine's democratically elected leader\".  Ms Nandy said Sir Keir has been very clear Mr Zelenskyy is not a dictator and added: \"As always, we stand with Ukraine.\" She said the UK government was \"very encouraged\" by the US saying no options are off the table when it comes to Ukraine peace talks. Ms Nandy added: \"We want to, bring partners together around the table and it looks increasingly likely that will be possible - both Ukraine, Russia, the Europeans ourselves and the United States. \"We can't do this without any of those partners and that's why the prime minister has spent quite considerable amount of time in the last few days having those private conversations with our allies to make sure that alliance doesn't fracture, that we stand as one and we find the right solution for Ukraine, which in the end will be in the interests of the British people.\" Read more:Things Donald Trump says that aren't true should be called outKemi Badenoch breaks her silence on Ukraine - finally  In an X post about Sir Keir's call to Mr Zelenskyy, the Ukrainian leader said: \"The United Kingdom's role in fortifying Europe's defence and security is important for us.\" The \"UK's support matters indeed, and we will never forget the respect the British people have shown for Ukraine and our citizens\", he added. Western officials have signalled the UK and other European countries could deploy under 30,000 personnel to Ukrainian cities, ports and nuclear power plants as part of a peacekeeping deal. Former head of the British Army, Lord Dannatt, has said about 100,000 troops would be needed. Shadow foreign secretary Dame Priti Patel also told Sky News Mr Trump was \"wrong\" about calling Mr Zelenskyy a dictator. But she said he had made \"some very significant points consistently\" about Europe \"stepping up when it comes to defence spending\". Dame Priti added: \"We should now look to show some leadership when it comes to defence spending, corralling our European allies, NATO, leading NATO to basically say to our NATO allies as well in Europe, this is our moment again, yes, to continue the support towards the people of Ukraine, President Zelenskyy, in this conflict, but also step up on that entire agenda of military security and defence.\""
    },
    {
        "title": "Farage says Zelenskyy is not a dictator and Trump 'should not be taken literally'",
        "description": "Nigel Farage has said Volodymyr Zelenskyy is not a dictator and everything Donald Trump says should be taken \"truthfully not literally\".",
        "url": "https://news.sky.com/story/farage-says-zelenskyy-is-not-a-dictator-and-calls-uk-and-europe-irrelevant-in-ukraine-peace-talks-13313289",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-donald-trump-farage_6744358.jpg?20241110100509",
        "type": "Politics",
        "Author": "Alix Culbertson and Faye Brown, political reporters",
        "Date Published": "2025-02-20 14:41:00",
        "Headline": "Donald Trump has called the Ukrainian president a \"dictator\", and the US leader's ally Nigel Farage has remained silent on the controversial remarks until now.",
        "Content": "By Alix Culbertson and Faye Brown, political reporters   Nigel Farage has said Volodymyr Zelenskyy is not a dictator and everything Donald Trump says should be taken \"truthfully not literally\". Speaking to Sky News' US correspondent James Matthews, the Reform UK leader also said he did not think Ukraine started the war with Russia and claimed Mr Trump was talking about \"causal factors\" when he suggested as such. Mr Trump has called Mr Zelenskyy a \"dictator without elections\" and told him \"you should have never started it [the conflict]\", after the Ukrainian president complained of being left out of peace talks between Washington and Moscow. Mr Farage, who counts the US president as a close friend, was asked whether he thinks Mr Zelenskyy is a dictator. \"No don't be ridiculous,\" he replied. \"If that's what he [Donald Trump] thinks, that's what he thinks. Take everything Trump says truthfully, but not literally.\" The Clacton MP went on to claim Mr Trump \"doesn't literally say Ukraine started the war\" and is focused on bringing peace. It was put to him that he did say that, and Mr Farage said: \"Okay, he did. If you're happy.\" He added: \"Putin started the war. We all know that. What he's talking about are the causal factors that go back for years.\" Asked why we should not take Mr Trump at his word, given he has done everything he said he would upon taking office, Mr Farage said: \"Look, he promised a negotiation. He promised he'd talk to Putin. And he is. This is progress. \"We may not at the moment like how it looks, but we haven't seen the final shape of the deal.\" Mr Farage was speaking at the Conservative Political Action Conference (CPAC) in Maryland, after being criticised for being silent on Mr Trump's attacks on the Ukrainian president over the past two days. Politics latest: UK seeks new deal with NATO ally Other party leaders have strongly backed the Mr Zelenskyy, with Sir Keir Starmer phoning him to voice his support, telling him it was \"perfectly reasonable\" for Ukraine to \"suspend elections during wartime as the UK did during World War Two\".  Mr Farage also called on President Zelenskyy to set out a timeline for an election. The Reform leader argued the UK had an election during the Second World War, in 1945, so Ukraine could also do so. The war had come to an end in Europe in May 1945 and Winston Churchill reluctantly called an election two weeks later - after 10 years without a vote - due to pressure from his Labour coalition partners. Read more:Starmer backs Zelenskyy after Trump 'dictator' jibeFarage relinquishes majority control of Reform UK However, Allied troops were still fighting in the Pacific, with VJ Day (Victory over Japan Day) not taking place until August that year. Shadow defence secretary James Cartlidge told Sky News' Politics Hub programme it was \"incredibly trite\" of the Reform UK leader to call for President Zelenskyy to hold elections.  Speaking to Sophy Ridge, he added: \"Winston Churchill was not a dictator, but he didn't hold elections during the war because we had a war on. \"The idea the priority for Zelenskyy should be elections is crazy. \"He is under existential attack day and night - we have to stand by them.\"  Liberal Democrat leader Sir Ed Davey accused Mr Farage of sounding \"like a spokesman for Trump\". He posted on X: \"So Nigel Farage has chosen to explain away Trump's outrageous remarks about President Zelensky instead of doing the right thing and condemning them. Deeply disappointing but not at all surprising. \"He sounds like a spokesman for Trump. He certainly doesn't speak for Britain.\""
    },
    {
        "title": "Defence secretary John Healey says a 'unified NATO' in America's 'best interests'",
        "description": "The defence secretary has said it is in America's \"interest\" that NATO remains strong and unified.",
        "url": "https://news.sky.com/story/defence-secretary-john-healey-says-a-unified-nato-in-americas-best-interests-13313249",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump_6834127.jpg?20250219213618",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-02-20 13:52:00",
        "Headline": "Asked if the UK could still \"trust\" the US president, John Healey did not answer directly, but said it was in Mr Trump's interest for a strong and unified NATO.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n The defence secretary has said it is in America's \"interest\" that NATO remains strong and unified. John Healey was responding to a question about whether the US president can be trusted to deliver durable peace in Ukraine - given his recent attacks on Volodymyr Zelenskyy.  Politics Live: Farage breaks silence over Trump's Ukraine attacks He did not answer directly but said: \"Europe's best security interests and America's best security interests are satisfied by an end to this war in Ukraine and by a strong, unified NATO. \"That's an argument that we are having and have discussed with the Americans and will continue to make.\" Mr Healey refuted some of Mr Trump's recent remarks, including that Vladimir Putin \"holds all the cards\" when it comes to peace talks because he has already taken \"a lot of territory\", and that President Zelenskyy is a \"dictator\". The cabinet minister said Mr Putin \"holds the cards in the sense that he could end the war if he withdrew his troops\". On Mr Zelenskyy, he said: \"He was elected. He's the elected leader of Ukraine, and he's done what Winston Churchill did in Britain in the Second World War; suspended elections while at war.\"  Mr Healey was speaking at a press conference in Norway, where negotiations have started on a new defence pact aimed at combatting the threat from Russia in the Arctic. The move towards the defence agreement comes as European countries continue to reel from the sharp shift in US foreign policy. Mr Trump has urged European nations to spend more on their own money on defence and has locked NATO allies out of initial peace talks over the future of Ukraine with Russia. He has made clear the security of Europe is no longer the US's defence priority and has this week attacked Ukraine's president Mr Zelenskyy, suggesting he is to blame for the Russian invasion, calling him a \"dictator\" and saying he \"better move fast or he is not going to have a country left\". UK politicians have jumped to Mr Zelenskyy's defence but most have stopped short of outwardly criticising Mr Trump. Sir Keir Starmer spoke with Mr Zelenskyy on the phone last night calling him \"Ukraine's democratically elected leader\". Similar words were used by Conservative leader Kemi Badenoch, through Liberal Democrat leader Sir Ed Davey went further and accused Mr Trump of \"lies\". On Thursday, Reform UK leader Nigel Farage also broke his silence - saying Mr Zelenskyy is \"not a dictator\" and people should take what Mr Trump says \"seriously, not literally\". The row between Mr Trump and Mr Zelenskyy comes ahead of a meeting between Sir Keir and the US president in Washington DC next week The meeting will be Sir Keir's first with Mr Trump since his inauguration as US president in January, and will see Britain attempt to balance its support for Ukraine with the need to keep the White House onside as it presses on with trade tariffs. Earlier on Wednesday, Culture Secretary Lisa Nandy said that a \"role for Europe\" in the end to the war in Ukraine is likely to be among the topics the prime minister will bring up for discussion in the US. Speaking to Sky News, she also revealed Sir Keir has held private calls with European leaders to ensure the Western alliance does not fracture while finding a solution to Ukraine."
    },
    {
        "title": "Nathan Gill: Former Reform UK leader in Wales charged with bribery after counter terror probe",
        "description": "The former leader of Reform UK in Wales has been charged with bribery after an investigation by counter terrorism police.",
        "url": "https://news.sky.com/story/nathan-gill-former-reform-uk-leader-in-wales-charged-with-bribery-after-counter-terror-probe-13313420",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-nathan-gill-reform_6834824.jpg?20250220173755",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-02-20 17:16:00",
        "Headline": "Reform UK Wales has confirmed that Nathan Gill is no longer a member of the party, with reports suggesting he left the group in 2021. He was previously a Brexit Party MEP and UKIP Wales leader.",
        "Content": "\n          Political reporter\n       The former leader of Reform UK in Wales has been charged with bribery after an investigation by counter terrorism police. Nathan Gill, 51, was charged with one count of conspiracy to commit bribery, under the Criminal Law Act 1977, and with eight counts of bribery, under the Bribery Act, 2010, said the Metropolitan Police. Gill is due to appear at Westminster Magistrates' Court on Monday. The Met Police said: \"The investigation has been led by detectives from the Met's Counter-Terrorism Command and a man was previously interviewed under caution on 3 March 2022 in connection with bribery allegations. \"Further enquiries were carried out by officers and after authorisation by the Crown Prosecution Service Counter-Terrorism Division, the man was subsequently charged as above.\" He was previously a member of the UK Independence Party (UKIP), leading the Welsh wing of the party between 2014 and 2016. Gill was a member of the Senedd between 2016 and 2017, and a member of the European Parliament between 2014 and 2020. \n                  Nigel Farage relinquishes majority control of Reform UK\n                 \n                  'Categorically wrong': Scientists condemn comments by Reform's Richard Tice that man-made climate change is 'garbage'\n                 \n                  Reform UK seen as stronger and more trustworthy than Tories, Sky News poll suggests\n                 He left UKIP in 2019, and the same year he joined Nigel Farage's Brexit Party - later Reform UK - and was elected as a Brexit Party MEP. Gill was confirmed as leader of Reform UK Wales in 2021 ahead of Senedd elections, but reports suggest he left the party months later when he failed to win a seat. A spokesperson for Reform UK Wales confirmed Gill was no longer a member, and said the party would not be commenting."
    },
    {
        "title": "Nigel Farage relinquishes majority control of Reform UK",
        "description": "Nigel Farage has given up sole control of Reform UK, with the party's members now being \"handed over ownership\" following a vote last year, according to its chairman.",
        "url": "https://news.sky.com/story/nigel-farage-relinquishes-majority-control-of-reform-uk-13313227",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-nigel-farage-reform-uk_6824054.jpg?20250209170359",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-02-20 13:12:00",
        "Headline": "A board will be put in place to set the direction for the party, with Reform's more than 200,000 members to vote on decisions at the annual conference in an advisory manner according to a new constitution.",
        "Content": "\n          Political reporter\n       Nigel Farage has given up sole control of Reform UK, with the party's members now being \"handed over ownership\" following a vote last year, according to its chairman. The party, led by Mr Farage, was previously controlled by the Clacton MP as he held a majority of shares in the company. According to the party's new constitution, a board will instead be set up that will lead and direct the party, with members voting in an advisory manner on policies at the annual conference. Politics latest: Farage says Zelenskyy 'not a dictator' Members also have the power to call an \"extraordinary general meeting\", and launch no-confidence motions in the party leader. In a statement, Reform chairman Zia Yusuf said: \"We are pleased to announce that, as promised, Nigel Farage has handed over ownership of Reform UK to its members. \"Reform UK is now a non-profit, with no shareholders, limited by guarantee. \"We are assembling the governing board, in line with the constitution. \"This was an important step in professionalising the party. \"We will soon have more exciting announcements about Reform UK as we prepare for government.\"  Documents filed with Companies House show that all shareholders in Reform UK Party Limited have given up their shares and control of the organisation. Instead, a limited company called Reform 2025 Ltd is listed as being in control of the party. Reform 2025 Ltd has two directors - Mr Farage and Mr Yusuf - but no shareholders or persons with significant control. It is understood this is because the membership is said to be in control. This appears to put it in a similar structure to the Labour Party, while the Conservatives and Liberal Democrats appear to have controlling leaders or chairs. Read more:Reform seen as stronger than ToriesParty tops poll for first timeFarage compares Reform polling to Trump According to the party's website, Reform UK have more than 211,000 members - close to double the Conservative membership. Mr Farage says he wants to overtake Labour, which has around 309,000 members. The party won five seats at the last general election off the back of 4.1 million votes. For comparison, the Liberal Democrats won 72 seats off the back of 3.5 million votes. This discrepancy is largely down to seats votes are concentrated in. 👉 Listen to Sky News Daily on your podcast app 👈 Recent polling has shown that Reform are seen as stronger than Labour on a range of topics among voters, including trustworthiness, strength, and \"clear sense of purpose\". Earlier in February, the party also topped a voter intention poll for the first time."
    },
    {
        "title": "German election: From AI influencers to Russian disinformation, the far-right is getting a leg up online ",
        "description": "Voters in Germany are being exposed to copious pro-AfD narratives online from AI-generated content and Russian disinformation campaigns.",
        "url": "https://news.sky.com/story/german-election-from-ai-influencers-to-russian-disinformation-the-far-right-is-getting-a-leg-up-online-13313167",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ai-germany-larissa-wagner_6835222.jpg?20250221015347",
        "type": "Technology",
        "Author": "Kaitlin Tosh, Sophia Massam and Tom Cheshire, Data and Forensics team",
        "Date Published": "2025-02-20 11:40:00",
        "Headline": "Germany's far-right party Alternative for Deutschland (AfD) has been more active on social media than other parties during the campaign and is in second place in opinion polls ahead of the country's election on Sunday.",
        "Content": "By Kaitlin Tosh, Sophia Massam and Tom Cheshire, Data and Forensics team   Voters in Germany are being exposed to copious pro-AfD narratives online from AI-generated content and Russian disinformation campaigns. Experts monitoring social media say Russian-based groups are involved, including \"Doppelganger\" and \"Storm-1516\", which US officials found to be active in America's election last year. Some of these campaigns are using artificial intelligence to spread their messaging ahead of Sunday's vote, which will see Germany elect a new Bundestag. Methods are said to include creating fake TV news stories or deep-fake videos of apparent \"witnesses\" or \"whistle blowers\" fabricating stories about prominent politicians. For example, in November 2024, shortly before the snap election was called, a video was published that claimed one parliamentary member who is an outspoken supporter of Ukraine was a Russian spy. Dr Marcus Faber, a member of the Free Democratic Party and head of the government's defence committee, was targeted in a video which used AI to suggest a former adviser was making the claim. We asked Dr Faber for his reaction to the video but he was unable to comment at this time. In another video an 18-year-old woman accused a German minister of child abuse - the accusation was false, and the video was made using AI. A recent report from the Center for Monitoring, Analysis and Strategy, or CeMAS, a non-profit thinktank specialising in the analysis of disinformation and right-wing extremism, and Alliance 4 Europe which aims to combat digital disinformation, has linked both stories to the Russian disinformation campaign Storm-1516. The researchers have also been tracking the Doppelganger campaign, run by a Russian PR company Social Design Agency, widely reported to have links to the Kremlin. They have found the group's main tactic is to create fake news articles, which often resemble well-known publications. A network of social media accounts then share and spread those articles across different platforms. Posts will often appear to be from a worried citizen, like the one below that reads: \"I am concerned that aid to Ukraine will impact our ability to invest in our own infrastructure and social security systems.\" The post links to a fake news article criticising Germany's funding for the war in Ukraine, on a fake website resembling the German newspaper Der Spiegel. \"Different Russian campaigns are trying, on the one hand, to discredit established parties,\" says Julia Smirnova, a senior researcher for CeMAS. \"They're also trying to boost the far-right AfD.\" \"It's not about just one fake video or one fake article. There's a systematic effort to constantly create this flood of false stories, flood of propaganda stories, and continue spreading them,\" she says. From mid-December 2024 to mid-January 2025, CeMAS found a total of 630 German-language posts with typical Doppelgänger patterns on X alone. For Ferdinand Gehringer, a cybersecurity policy adviser, Russian interference online isn't a surprise. \"There are clear objectives for Russia to interfere and to also manipulate our public opinion,\" he says. From the party's plan to stop sending arms to Ukraine to their calls to ramp up imports of Russian gas, he says \"Russia sees within the AfD's program and ideas the best options for future cooperation\". CeMAS has found at least one case where a fake story that originated from a Russian campaign was spread by an AfD politician. Stephan Protschka, a parliamentary member, posted on his social media channels that the Green Party was working with Ukraine to recruit people to commit crimes and blame them on the AfD, a narrative researchers say originated from a Russian disinformation campaign. Sky News asked Mr Protschka for comment, but he did not respond. We also reached out to Social Design Agency to respond to the allegations against the Doppelganger group. They did not respond. We were unable to contact anyone behind the Storm-1516 campaign for comment. Inside Germany  Beyond the extremes of Russian-led disinformation campaigns, far-right groups within Germany are also ramping up their online presence. Take Larissa Wagner, an AI-generated social media influencer. \"Hey guys, I'm just on my way to the polling station. I'm daring this time. I'm voting for AfD,\" she said in a video posted to her X account on 22 September 2024, the day of the Brandenburg state election. Her accounts on Twitter and Instagram were both created in the last year and her regular videos espouse far-right narratives, like telling Syrian immigrants to \"pack your bags and go back home\". She even says she interned with the right-wing magazine Compact, which was banned by the German government last year. It's unclear who created Larissa. When Sky News messaged to ask her on Instagram she replied: \"I think it's completely irrelevant who controls me. Influencers like me are the future... \"Like anyone else, I want to share my perspective on things. Every influencer does that. But because I'm young, attractive, and right-wing, it's framed as 'influencing the political discourse'.\" Ferdinand Gehringer notes that her posts have become more radical over time. \"The potential for influence is significant-especially since the presence of a young, attractive woman increases audience engagement,\" he adds. The far-right's use of generative AI on social media goes beyond characters like Larissa. A report this week from the Institute for Strategic Dialogue assessed the scale of its use, identifying 883 posts since April 2023 that included images, memes and music videos made using generative AI. The posts came from far-right supporters as well as the AfD itself - party accounts published more than 50 posts that contained generative AI content in October alone. The AfD is using AI more than other parties, says Pablo Maristany de las Casas, an analyst at the Institute for Strategic Dialogue who co-authored the report. \"They're clearly the one actor that is exploiting this technology the most,\" he says. The messaging in the far-right content they sampled falls into two categories: attacking narratives, like AI-generated images of migrants portrayed as violent criminals, and narratives that glorify traditional German values. When these two narratives are combined, \"the far-right community feels more united in the so-called cultural fight against these groups that they're attacking,\" says Mr Maristany de las Casas. Take Remigration Song, a promotional song and music video commissioned by the now-disbanded youth wing of the AfD. It was produced using AI and advocates the mass deportation of immigrants - known as remigration. It's this home-grown content that some experts say could affect public opinions. A recent survey by the Bertelsmann Foundation, a thinktank which promotes social reform, showed that 80% of Germans consider disinformation on the internet to be a major problem for society and 88% agreed that disinformation is spread to influence political opinions. \"Just the foreign information itself is probably not going to shift attitudes\" says senior researcher Cathleen Berger. \"I think the impact only comes when it is being picked up by domestic actors\". Additional reporting from Olive Enokido-Lineham, OSINT producer; Mary Poynter, Data and Forensics producer. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open-source information. Through multimedia storytelling, we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Doctor leading new screening trial warns of 'sharp rise' in prostate cancer if disease not detected earlier",
        "description": "Thousands of men are to be checked for prostate cancer in one of the first large-scale European trials of smart screening.",
        "url": "https://news.sky.com/story/doctor-leading-new-screening-trial-warns-of-sharp-rise-in-prostate-cancer-if-disease-not-detected-earlier-13313156",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-thomas-moore-cancer_6834536.jpg?20250220122333",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-02-20 11:19:00",
        "Headline": "Sky News was granted access to a pilot study in Ireland which aims to save thousands of lives - amid fears many men in the UK are getting treatment too late.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Thousands of men are to be checked for prostate cancer in one of the first large-scale European trials of smart screening. The pilot study, starting next week in Ireland, will combine a blood test with personal risk factors and an MRI scan to increase the accuracy of screening men in their 50s and 60s. Up to now health experts have rejected population screening in the belief that the benefits of earlier cancer detection were outweighed by the risks that some men could have unnecessary biopsies and risky treatment they don't need. But the PRAISE-U study is an attempt to save lives in a more targeted way, filtering out men who don't have cancer at an early stage, so they don't come to any harm. David Galvin, the head of the study and a surgeon at the Mater Hospital in Dublin, told Sky News that a safe, effective screening strategy was urgently needed. \"There is a tsunami of elderly patients coming towards us,\" he said. \"There's going to be a sharp rise in prostate cancer unless we have a way to detect the disease early and not burden our health care services with vast numbers of scans and biopsies.\" Thousands diagnosed too late Prostate cancer is the most common cancer in men in Ireland. In the UK it is now the most common of all cancers, causing more deaths than breast cancer. There are no symptoms in the early stages. Around 12,000 men a year in the UK alone are diagnosed too late to cure. Studies have shown that a blood test for a prostate protein called PSA can diagnose cases at an earlier stage, reducing deaths by 40%. But not all men with cancer have high levels of the PSA protein. And conversely, high levels can also be caused by other prostate conditions, infections, exercise and sexual activity. The unreliability of the test has held back its use for screening. But in the Irish pilot study, men will be scored by their PSA level and whether they have other risk factors such as black ethnicity or a family history. Those at low risk will be retested in future. Around half of the men will undergo a detailed MRI scan of their prostate to check for tumours - and only half those will then need a biopsy, in which a needle is inserted to extract cells for a precise diagnosis. Mr Galvin said the multi-stage screening meant only those who really need a biopsy will have one. \"I worked out that if you have the PSA test, there's about a 1 in 40 chance that you will ultimately need a biopsy. \"The other 39 men are reassured that testing is all normal and they don't have any clinically significant disease.\" Read more:Simple test could revolutionise dementia diagnosisAcid attack victim on how donated placenta saved eyeOdds of asteroid hitting Earth rise again 'I got away with it by the skin of my teeth' The PRAISE-U study is backed by the European Association of Urology and funded by the EU. Around 8,000 men in Waterford and two areas of Dublin will be randomly invited for screening over the next year. Tony Ward, a rugby legend and one of the best number 10s to play for Ireland, was diagnosed with an aggressive prostate cancer just over a decade ago. Even now he needs daily treatment and regular scans. He told Sky News screening to detect cancer at an earlier stage is desperately needed. \"It's everything, it's massive,\" he said. \"I did not have the early diagnosis, but I got away with it by the skin of my teeth.\" 'Very curable cancer kills 12,000 men every year' The UK's National Screening Committee, which advises the Department of Health, is reviewing the evidence on prostate cancer screening. But it's already taken two years, and a decision still isn't due until the end of 2025. Chiara De Biase, director of health services, equity and improvement from Prostate Cancer UK, said men were dying unnecessarily as a result. She said: \"12,000 men die every year from what is - when caught in its earliest stages - a very, very curable cancer. \"We think the evidence [for screening] is there and we can't see why this has taken so long.\" A spokesperson for the UK government's Department of Health and Social Care said: \"Prostate cancer patients are waiting too long for diagnosis and treatment, and we are determined to change that. \"Our National Cancer Plan will transform the way we treat cancer, making the UK a world leader in cancer survival by fighting the disease on all fronts, through improving research, diagnosis, screening, treatment and prevention. \"The UK National Screening Committee is reviewing the evidence for prostate cancer screening programmes, including targeted approaches for men at higher risk.\""
    },
    {
        "title": "Battery acid attack victim reveals how donated placenta treatment saved his eye",
        "description": "After he was squirted in the eye with battery acid, Paul Laskey thought he would lose his eye entirely, until a donated placenta helped save some of his sight. ",
        "url": "https://news.sky.com/story/battery-acid-attack-victim-reveals-how-donated-placenta-treatment-saved-his-eye-13312465",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-placenta-transplant_6833450.jpg?20250219102143",
        "type": "Technology",
        "Author": "Megan Harwood-Baynes",
        "Date Published": "2025-02-20 00:00:00",
        "Headline": "Paul Laskey \"couldn't breathe\" and \"knew instantly\" how seriously he'd been hurt when he confronted his son's attacker. Now, \"special\" surgery has given him a \"chance to heal\".",
        "Content": "\n          Social affairs and health reporter\n              @megbaynes\n  After he was squirted in the eye with battery acid, Paul Laskey thought he would lose his eye entirely, until a donated placenta helped save some of his sight.  Paul, 43, was attacked after he confronted 21-year-old Robbie Scott, who had mugged his son in Newcastle just minutes earlier. \"[My son] phoned us, hysterical, saying he had been robbed,\" the father-of-three told Sky News. Scott had \"pulled a knife on him and ripped a gold chain off his neck\". When Paul went to confront Scott, he squirted him with battery acid from a drinks bottle. \"I knew instantly. I couldn't see anything, I couldn't breathe, it was in my nose and mouth. I thought I was fighting for my life.\" Paul was rushed to hospital where he was told the burn had caused limbal stem cell failure and severe neurotrophic keratopathy in one of his eyes - this meant the cells within the eye couldn't properly repair or regenerate the surface of the cornea and the nerves within the eye were failing to function properly. The inner and outer layers of the cornea had effectively \"melted\". While one eye was unharmed, there was a fear he may lose his left eye entirely. What followed over the next eight months was extensive surgery, including two cornea transplants. But then came hope in the form of a donated placenta. 'This saved my eye' Paul was given three amnion grafts, where tissue is taken from the inner lining of a donated placenta and made into small patches. These grafts stabilised his eye, avoiding further melting and saving the limited vision he did have. \"I don't think it initially registered what it was, but I think it's just unbelievable,\" he said. \"It's like a skin over the top of my eye, giving it a chance to heal.\" Paul spent six months off work, struggling to leave the house as he couldn't cope with the light sensitivity. Before he had the procedure, Paul said he was \"really low\". \"I didn't think it was going to save me,\" he said. \"But now it feels like a light at the end of the tunnel.\" Paul is now back at work, and back coaching his son's football team. He still struggles with his depth perception - he can only see shadows from his left eye. \"But this saved my eye and hopefully future procedures will give me some sort of sight.\" Scott was sentenced to ten years in prison for the attack on Paul - he pleaded guilty but gave no account of what happened on that day. Even though it meant losing his sight, Paul said he has no regrets about confronting his son's attacker. He said it could have been his 16-year-old son who was burned instead of him. \"I would do it again - I would rather it be me than [my son],\" Paul said. \"He was just 16 at the time and it would have been absolutely devastating if this had happened to him.\" 'Very special surgery' In 2024 NHS Blood and Transplant provided 882 amniotic membrane grafts for transplantation, all of which were provided for eye surgery. Paul's eye injury was one of the most severe his consultant has treated. Each donated placenta can be used to make up to one hundred amnion grafts, treating patients for anything from eye injuries to burns and diseases. Claire Price, national retrieval manager at NHS Blood and Transplant's Tissue and Eye Services, said this type of surgery is \"very special\". \"The placenta is a vital organ whilst growing a child but immediately after birth, is usually discarded,\" she said. \"Donating is easy and does not affect the baby.\" She thanked all the mothers who donate their placentas. \"While we can currently collect all the placentas we need, Paul's story is a reminder of just how important donation of all types is, including blood, plasma, organ and stem cells,\" she added. Professor Francisco Figueiredo, consultant ophthalmologist at Newcastle Eye Centre, who treated Paul for his injuries, said chemical eye burns are a \"true emergency\". \"They can cause significant sight loss that will substantially impact the quality of the patient's life and rapid treatment is crucial,\" he said. \"It is safe to say that these grafts have helped to save the vision Paul still has - and allowed us to move towards further treatment to restore his lost sight.\""
    },
    {
        "title": "High visibility clothing may be invisible to modern car technology, study says",
        "description": "High-visibility clothing may make pedestrians and cyclists invisible to modern braking technology, a study has suggested.",
        "url": "https://news.sky.com/story/high-visibility-clothing-may-be-invisible-to-modern-car-technology-study-says-13313184",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-hivis-high-visibility-clothing_6834541.jpg?20250220122736",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-20 12:05:00",
        "Headline": "Automatic emergency braking systems, which are fitted to all new cars, automatically apply the brakes if the potential for a collision is detected but a study indicated the systems may have a \"blind spot\" for reflective items.",
        "Content": "High-visibility clothing may make pedestrians and cyclists invisible to modern braking technology, a study has suggested. Automatic emergency braking (AEB) systems, which are fitted to all new cars, automatically apply the brakes if the potential for a collision is detected and the driver fails to respond quickly enough. But a study by the US-based Insurance Institute for Highway Safety (IIHS) indicated the systems may have a \"blind spot\" for reflective items. Researchers conducted trials involving a crash test dummy and three cars travelling at 25mph: a Honda CR-V, Mazda CX-5 and Subaru Forester. The Honda and Mazda hit the dummy while it was wearing reflective strips, while the Honda also failed to slow down when a high-visibility jacket was put on the mannequin. The Subaru slowed down in all tests except when the dummy wore reflective strips in very low light. Read more from Sky News:'Comedy on prescription' trials startQR code stickers appear on thousands of gravesMan who killed Ronan Keating's brother avoids prison \n                  German election: From AI influencers to Russian disinformation, the far-right is getting a leg up online \n                 \n                  Doctor leading new screening trial warns of 'sharp rise' in prostate cancer if disease not detected earlier\n                 \n                  Battery acid attack victim reveals how donated placenta treatment saved his eye\n                 IIHS president David Harkey said the results suggest car manufacturers \"need to tweak their pedestrian automatic emergency braking systems\". He said: \"It's untenable that the clothes that pedestrians, cyclists and roadway workers wear to be safe may make them harder for crash avoidance technology to recognise.\" \"This is a worrisome blind spot,\" he added. Mazda said in a statement: \"Road safety for everyone, including those in and around our vehicles, is a top priority for Mazda. \"Our engineers are continuously working to improve Mazda's crash avoidance systems and are already using these latest IIHS results to further assist us in this work, with special consideration for nighttime pedestrian scenarios.\" Honda and Subaru were approached for a comment."
    },
    {
        "title": "'Sleepmaxxing': What is the viral trend, and will it improve your sleep?",
        "description": "As a journalist who does shift work - I'm obsessed with sleep.",
        "url": "https://news.sky.com/story/sleepmaxxing-what-is-the-viral-trend-and-will-it-improve-your-sleep-13313041",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-mocktail-sleep-girl-mocktail_6834388.jpg?20250220093010",
        "type": "Technology",
        "Author": "Sabah Choudhry",
        "Date Published": "2025-02-20 07:11:00",
        "Headline": "A \"cornerstone of wellness\" or an unhealthy \"obsession\"? We put it to the experts... ",
        "Content": "\n          News correspondent\n       As a journalist who does shift work - I'm obsessed with sleep. I don't get enough of it, and it's pretty irregular when I do. And so, when my Apple Watch informs me I've had more than 8 hours - with solid REM metrics - everyone will know about it. 'Sleepmaxxing' is a concept I came across on TikTok - it describes viral hacks to optimise your sleep, from drinking magnesium-laced 'Sleepy Girl' mocktails to sleeping with your mouth taped. It's a trending topic - with millions of videos on it and search interest hit an all-time high earlier this year. But what is 'sleepmaxxing', and does it work? 'A cornerstone of wellness' The catch-all term is a wellness trend popular with Gen-Z and millennials - a perceived blueprint to help you catch a deeper, longer slumber. It's a nod to 'looksmaxxing' - another TikTok trend popularised on the app, focused on enhancing physical attractiveness. Sleep specialist Sammy Margo told Sky News it's a fad among those \"who are increasingly prioritising sleep as a cornerstone of wellness\". Ms Margo said: \"It typically involves creating elaborate bedtime routines, investing in sleep accessories, and tracking sleep metrics.\" However, sleep expert Dr Neil Stanley is unimpressed - and says the practice is an unhealthy \"obsession\" that can often be counter-productive. He told Sky News: \"The worry about getting good sleep actually makes sleep worse. \"It is being done by people who sadly believe that things on TikTok have any resemblance to actual science.\" What are the sleep trends? According to the NHS, better sleep can be obtained through better diet and exercise, meditation and mindfulness. However, for Gen-Z et al, it's a slightly more complicated - and creative - picture. Trends include tech-free winddown-down periods an hour before bedtime; sleeping in cooler temperatures; blackout curtains and sleep masks; sleep tracking via smartwatches and sleeping with weighted blankets or cooling pillows. And then… there are the viral trends. The 'Sleepy Girl' mocktail  This viral drink has been made by thousands of TikTok users to help them sleep. The mocktail combines magnesium power, tart cherry juice and lemonade - and has been popularised by the likes of viral bloggers including model Nara Smith, who in one TikTok video told her 11 million followers that her midwife recommended it to help her overcome sleepless nights. However, according to sleep expert Dr Lindsay Browning at Trouble Sleeping, the evidence to suggest that the drink can result in better sleep is \"generally weak\" and from limited studies. She told Sky News: \"Magnesium has been associated with improved sleep but improvements are generally only seen when someone has a magnesium deficiency to start with.\" Dr Browning has warned that excessive magnesium from the mocktail can also lead to diarrhoea - and may be problematic for those with kidney issues. Mouth taping What it says on the tin - and the goal is to prevent snoring and a dry mouth. It can also help humidify the air through nasal passages. However, Dr Browning warns that using tape to keep the mouth shut and to force nasal breathing \"can be risky\" - and can potentially lead to skin irritation and anxiety, particularly if the person doing it wakes up stressed and confused. She told Sky News: \"If you restrict breathing through the mouth, if the airway through the nose becomes blocked such as because of nasal congestion, the person will be unable to breathe properly. \"Stopping mouth breathing therefore does not solve problems caused by nasal congestion or undiagnosed sleep apnoea and can lead to difficulty breathing in the night, potentially worsening the problems, and means that the underlying cause is not resolved.\" Kiwis before bed Another trend is eating kiwi fruits before bed. A study of 24 people found that eating two kiwis before sleeping could improve sleep. Read more on Sky News:'Comedy on prescription' trials underway Ronan Keating criticises 'broken' justice systemEastEnders best bits on 40th anniversary However, this was a small-scale study and requires greater research before any conclusions about the efficacy of kiwis before bedtime can be reached. Music playlists Creating an atmosphere conducive to sleep is key - and music helps. Freddie Moross, founder of Myndstream - a company specialising in music for health and wellbeing - told Sky News that the \"surge in popularity of sleep music is undeniable\". \"Sleep music is one of the fastest-growing genres of music. \"This trend is reflected in the consistent high ranking of editorial sleep playlists, like Apple Music's Sleep Sounds, which often sits at the top of the charts of their 200 programmed playlists and Spotify's top 3 sleep playlists accumulating over 9.5M monthly listeners. Mr Moross adds: \"Sleep music can be a valuable tool in signaling to the body that it's time to rest - instrumental music with a slower tempo, typically 60-80 beats per minute, is often most effective\". Looking beyond the trends, Dr Neil Stanley says the answer to better sleep is simple. \"You need just three things to help you sleep, a bedroom conducive to sleep, a relaxed body, and a quiet mind. \"Unfortunately, there is no money or clicks in common sense.\""
    },
    {
        "title": "James Bond: Amazon takes creative control of 007 franchise",
        "description": "Creative control of the long-running James Bond franchise has been handed to Amazon MGM Studios, in a joint venture with the current owners.",
        "url": "https://news.sky.com/story/james-bond-amazon-takes-creative-control-of-007-franchise-13313350",
        "image_url": "https://e3.365dm.com/19/12/1920x1080/skynews-james-bond-daniel-craig_4856376.jpg?20191204135823",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-20 15:30:00",
        "Headline": "The James Bond joint deal between Barbara Broccoli, Michael G Wilson and Amazon follows speculation over when the next Bond movie will be made, and who the new 007 will be.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Creative control of the long-running James Bond franchise has been handed to Amazon MGM Studios, in a joint venture with the current owners. Barbara Broccoli and Michael G Wilson - who are the daughter and stepson of film producer Albert \"Cubby\" Broccoli, the man responsible for developing the Bond franchise into the success it is today - will remain co-owners of 007 intellectual property rights. The pair own EON Productions, the company behind Bond films including Skyfall and Spectre. It has produced 25 films since 1962.   The deal follows speculation over when the next Bond movie - and indeed the next Bond - will be announced. The last film, No Time To Die, was delivered four years ago to rave reviews and box office success. It was the swansong for Daniel Craig in his performance of the lady-loving spy. \n                  James Bond spin-offs, origin stories, reality shows? After Amazon takeover, what happens to 007?\n                 \n                  George Lazenby: Former James Bond star retires from acting – and signing autographs\n                 \n                  Diamonds Are Not Forever? Shirley Bassey auctions jewellery\n                 Details of the 26th official Bond film - and its new star - are yet to be revealed. In a statement on EON Productions website, Mike Hopkins, head of Prime Video and Amazon MGM Studios said they were \"honoured to continue this treasured heritage\" and looked forward to \"ushering in the next phase of the legendary 007 for audiences around the world\". Wilson said that after 60 years spent working across the franchise, he would now be focusing on \"art and charitable projects\". Barbara Broccoli said: \"My life has been dedicated to maintaining and building upon the extraordinary legacy that was handed to Michael and me by our father, producer Cubby Broccoli. \"I have had the honour of working closely with four of the tremendously talented actors who have played 007 and thousands of wonderful artists within the industry. With the conclusion of No Time To Die and Michael retiring from the films, I feel it is time to focus on my other projects.\" In 2022, Amazon bought MGM Studios, which distributes Bond, for $8.45bn (£6.79bn). Since the acquisition, the streamer has held the rights to distribute all the Bond movies. In the spring of 2023, Amazon Prime Video launched Bond-themed reality show, 007 Road To A Million. Hosted by Succession star Brian Cox, it offered nine pairs of contestants the chance to win £1m as they travelled through global locations associated with the franchise. While no one took home the full £1m jackpot, brothers James and Joey did take £150,000. The show was met with a mixed critical reception but was given the green light for a second season."
    },
    {
        "title": "James Bond spin-offs, origin stories, reality shows? After Amazon takeover, what happens to 007?",
        "description": "Speculation about the next James Bond was rife even before Daniel Craig confirmed once and for all that he was stepping down.",
        "url": "https://news.sky.com/story/james-bond-spin-offs-origin-stories-reality-shows-after-amazon-takeover-what-happens-to-007-13313433",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sean-connery-james-bond_6834859.jpg?20250220180016",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-02-20 17:36:00",
        "Headline": "With Amazon now at the helm, could we see origin stories for Miss Moneypenny or Q? Or villains Jaws or Blofeld or Goldfinger? The future of James Bond could now be very different.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Speculation about the next James Bond was rife even before Daniel Craig confirmed once and for all that he was stepping down. Aaron Taylor-Johnson? Idris Elba? Henry Cavill? James Norton? A female 007? Three-and-a-half years on from No Time To Die, already delayed due to COVID and other problems, there has not been a scrap of confirmation. But now - plot twist - comes the announcement that Bond's long-time producers and custodians Barbara Broccoli and Michael G Wilson are handing creative control to Amazon MGM Studios.  It's likely that all the behind the scenes wrangling to get to this deal announcement is why a new 007, whoever that may be, is yet to be named. And speculation now shifts from the next Bond to the entire future of Bond. Broccoli and Wilson are the daughter and stepson of Albert \"Cubby\" Broccoli, the man responsible for the start of the franchise's success, and have always been fiercely protective of the world's most famous secret agent. During Craig's tenure there have been just five films since his first, Casino Royale, was released almost 20 years ago in 2006. Pierce Brosnan starred in four between 1995 and 2002. Broccoli and Wilson did not want to give the world too much Bond. Fans have been kept waiting, and always wanting more. Now, with Amazon at the helm, will we see origin stories for Miss Moneypenny or Q? Or what about the baddies? A sensitive deep dive into the early years of Jaws or Blofeld or Goldfinger - maybe even all three and more - to discover how they turned to the dark side? Will Jeff Bezos get involved? He certainly didn't waste time in posting on X to ask fans for their thoughts. Perhaps we could see a cameo in the future? Amazon acquired MGM, including the rights to distribute James Bond films, in 2022. Back then, the streaming service said it was \"honoured… to usher in the next phase\". And in 2023, it released a Bond reality show. Asked for her thoughts on potential spin-offs by Sky News after that announcement, Broccoli said: \"Well, I don't think so… we've focused on making the films for theatrical release and we have not wanted to do spin-offs. \"So I think that's our position. They certainly have told us that that the films will be theatrical films in the future and we'll see what happens.\" Could that be about to change? 'Don't cinematic universe Bond' In December, the Wall Street Journal published an article headed \"Where Is James Bond? Trapped in an Ugly Stalemate With Amazon\", featuring interviews with more than 20 people familiar with the \"feud\". When one executive referred to Bond as \"content\", one friend reportedly told the newspaper, it was like a \"death knell\" to Broccoli. \"It's kinda sad to see the last family-owned movie franchise handed over to the suits, and I'm sure Amazon MGM is salivating,\" posted filmmaker Joe Russo (not the Russo who has worked on some Marvel films, we should point out) on X. \"BUT... DON'T cinematic universe James Bond. It is one of our last, great theatrical events. Don't dilute that with a plethora of streaming spin-offs.\" Another X user wasn't as polite: \"RIP James Bond.\" Read more:Brian Cox on Bond realityA look back at 007 in pictures You only need to look at what has happened to the Marvel Cinematic Universe in the last few years to see why there would be concerns. While there are still plenty of fans, there has been obvious disenchantment - reflected at the box office - as more and more spin-offs and origin stories have been churned out in recent years. Beetlejuice star Jenna Ortega is one actress who doesn't want a spin-off - or a female Bond, at least. \"I love that there's a lot more female leads nowadays, I think that's so special,\" she said in an interview with MTV last year. \"But we should have our own. I don't like it when it's like a spin-off - I don't want to see like 'Jamie Bond'. You know? I want to see another badass.\" Responding to a post shared by the British James Bond Fan Club, one fan replied: \"End of an era! Just have to hope that in future the Bond output is still all about quality rather than quantity.\" There is also the issue of copyright, which has made headlines recently. Austrian property developer Josef Kleindienst is challenging the trademark ownership of the James Bond name in the UK and the EU, The Guardian revealed earlier in February. This is possible after five years of \"non use\" under trademark law. \"James Bond will not die on our watch,\" he reportedly said. The previous longest gap between Bond outings is six years and four months; the way things are looking, this next one could be longer. These are uncertain times for Bond. Which is enough to leave fans more than a little shaken and stirred."
    },
    {
        "title": "Liam Payne death charges against friend and two hotel workers dropped in Argentina",
        "description": "Manslaughter charges over the death of Liam Payne have been dropped for his friend Roger Nores and two hotel workers.",
        "url": "https://news.sky.com/story/liam-payne-death-charges-against-friend-and-two-hotel-workers-dropped-in-argentina-13313212",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-liam-payne-one-direction_6740978.jpg?20241106203038",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-02-20 12:43:00",
        "Headline": "Rogelio \"Roger\" Nores has said he is happy to now be able to travel to the UK to \"say goodbye to my friend\" following the ruling. Charges of supplying drugs to Liam Payne before his death in Argentina still stand against two other men.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Manslaughter charges over the death of Liam Payne have been dropped for his friend Roger Nores and two hotel workers. Rogelio \"Roger\" Nores, hotel operator Gilda Martin, and head of reception Esteban Grassi were charged in December, two months after the One Direction star's death at the Casa Sur Hotel in Buenos Aires, Argentina. At the same time, hotel employee Ezequiel Pereyra and waiter Braian Paiz were charged with supplying cocaine to Payne. Following an appeal, the manslaughter charges against Nores, Martin and Grassi have now been dropped, court documents show. The charges against Pereyra and Paiz still stand and they remain in prison awaiting a trial. Speaking after the ruling, Nores told Rolling Stone: \"Glad this is finally over. I'm happy I'm now going to be able to travel to the UK and say goodbye to my friend.\" Nores, Martin and Grassi would have faced up to five years in prison had they been convicted. Supplying drugs in Argentina carries a sentence of up to 15 years. The latest court document states that Payne fell from the balcony of his room on the third floor of the hotel at about 5.10pm on 16 October. In the hours beforehand, the singer had been involved in an argument with two women in the hotel lobby, the court document states, and cleaning staff later reported the television in his hotel room was broken. Toxicology tests revealed that before his death, he had traces of alcohol, cocaine, and a prescription antidepressant in his body. His cause of death was \"polytrauma\" from multiple injuries and internal and external bleeding, a postmortem found."
    },
    {
        "title": "Michelle Keegan and Mark Wright 'locked themselves in bedroom' during break-in at Essex home",
        "description": "Pregnant actress Michelle Keegan and her husband Mark Wright reportedly hid from burglars in a locked bedroom during a home invasion at their mansion.",
        "url": "https://news.sky.com/story/michelle-keegan-and-mark-wright-locked-themselves-in-bedroom-during-break-in-at-essex-home-13313129",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-mark-wright-michelle-keegan_6787668.jpg?20250220105206",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-20 10:44:00",
        "Headline": "Essex Police was alerted to the break-in at around 6.20pm on Tuesday and arrived at the Ongar property within eight minutes.",
        "Content": "Pregnant actress Michelle Keegan and her husband Mark Wright reportedly hid from burglars in a locked bedroom during a home invasion at their mansion. Essex Police said it was alerted to the break-in at about 6.20pm on Tuesday, with four suspects reported to have forced entry and searched the address before fleeing. The force said officers arrived at the scene in Ongar within eight minutes. As first reported in The Sun, Wright, 38, was said to have heard a patio window smash and then hid in a locked bedroom together with his 37-year-old wife until police arrived. The intruders reportedly fled empty-handed after hearing Wright, who rose to fame on The Only Way Is Essex (TOWIE), shouting. Police were said to have been alerted via a state-of-the-art security system at the couple's home, with the intruders also described as wearing balaclavas and dressed in black. An Essex Police spokesperson said: \"We are continuing to support and safeguard the victims and are conducting high-visibility patrols in the area. \"We are exploring a number of lines of inquiry including but not limited to forensic opportunities, CCTV and witness statements. \"Anyone with information should contact us as soon as possible.\" The couple have been documenting the creation of their \"dream home\" on their \"wrightyhome\" Instagram page, which has 664,000 followers. Read more from Sky News:Ronan Keating criticises 'broken' justice system as brother's killer avoids prisonKevin Spacey tells Guy Pearce to 'grow up' Keegan played Tina McIntyre on Coronation Street, and has also starred in the BBC military drama Our Girl and the Sky comedy Brassic. More recently she has appeared in Ten Pound Poms, about a group of Brits leaving post-war Britain for Australia. Heart FM presenter Wright was a semi-professional footballer who spent time at the youth academies of West Ham, Arsenal and Tottenham before he starred in TOWIE. He appeared on I'm A Celebrity... Get Me Out Of Here! in 2011 and has also worked as a TV presenter. Representatives for the couple declined to comment."
    },
    {
        "title": "Ronan Keating criticises 'broken' justice system as brother's killer avoids prison",
        "description": "Ronan Keating has criticised the \"broken justice system\" in Ireland on Instagram &#8211; after the person responsible for his brother's death walked free.",
        "url": "https://news.sky.com/story/ronan-keating-criticises-broken-justice-system-as-brothers-killer-avoids-prison-13313056",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ciaran-keating-ronan-keating_6834340.jpg?20250220081947",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-20 08:01:00",
        "Headline": "\"It's a joke and it's morally corrupt that rather than trying to fix our broken system, they all turn a blind eye\", the Boyzone star wrote on Instagram.",
        "Content": "Ronan Keating has criticised the \"broken justice system\" in Ireland on Instagram – after the person responsible for his brother's death walked free. The Boyzone singer's brother, Ciaran Keating, was in his 50s when he died in a car crash in County Mayo, in the West of Ireland. He was on his way to his son's football match before the accident in July 2023 - and suffered fatal injuries. The man involved in the collision, Dean Harte, had pleaded guilty - and was handed a 17-month sentence suspended for two years.  Ronan Keating shared a post on Instagram - highlighting his dismay at the decision. He said that it was a \"devastating example of just how broken our justice system is\". The singer wrote: \"You can kill a man... and you can walk free. \"Not even a single night in prison. Just a slap on the wrist and a ticket to carry on your life, like nothing ever happened. \"And then we wonder why we keep seeing this kind of behaviour on our roads, why people keep dying in road accidents across Ireland every week? It's a joke and it's morally corrupt that rather than trying to fix our broken system, they all turn a blind eye.\" Read more on Sky News:Hamas release bodies of four hostagesStarmer backs Zelenskyy after Trump commentsNew drug offers children with rare epilepsy hope Criticising the legal system, Keating wrote: \"…shame on everyone involved in this process that contributed to the heartbreaking outcome for my family today. \"The Keating family will never find peace. We will continue to fight for Ciaran's justice.\""
    },
    {
        "title": "Mysterious QR code stickers appear on more than 1,000 graves in Munich",
        "description": "More than 1,000 stickers were put on gravestones and wooden crosses at three cemeteries in the southern German city of Munich.",
        "url": "https://news.sky.com/story/mysterious-qr-code-stickers-appear-on-more-than-1000-graves-in-munich-13313046",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-munich-qr_6834312.jpg?20250220074525",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-02-20 07:29:00",
        "Headline": "The stickers have appeared at the Waldfriedhof, Sendlinger Friedhof and Friedhof Solln cemeteries in the southern German city. Police are investigating the incident.",
        "Content": "More than 1,000 stickers were put on gravestones and wooden crosses at three cemeteries in the southern German city of Munich. The stickers, which have been put on both old and recent graves, have a QR code that when scanned shows the name of the person buried and the location of their grave in the cemetery. The 5x3.5-centimeter (1.95x1.2-inch) stickers surfaced in recent days at the Waldfriedhof, Sendlinger Friedhof and Friedhof Solln cemeteries. Police are investigating the incident. Read more from Sky News:Starmer backs Zelenskyy after Trump 'dictator' jibeMoney blog: Chef reveals the one thing you should never buy \"We haven't found any pattern behind this yet. The stickers were put both on decades-old gravestones and very new graves that so far only have a wooden cross,\" police spokesperson Christian Drexler said. \"People who have witnessed anybody putting the stickers on the graves are asked to reach out to the respective cemetery's administration,\" Mr Drexler said."
    }
]