[
    {
        "title": "Kentucky plane crash leaves at least four dead - with number expected to rise",
        "description": "At least four people have died after a cargo plane crashed near an airport in Kentucky.",
        "url": "https://news.sky.com/story/cargo-plane-crashes-at-airport-in-kentucky-13464102",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-kentucky-louisville_7072353.jpg?20251105011347",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-04 22:50:00",
        "Headline": "The accident involving a UPS cargo plane led to all flights in and out of the airport, Louisville International, being suspended.",
        "Content": " At least four people have died after a cargo plane crashed near an airport in Kentucky. Police are attending the scene of the accident near Louisville Muhammad Ali International Airport, with images from the scene showing large fires burning and smoke billowing into the air. Speaking at a news conference, Kentucky governor Andy Beshear described the incident as \"catastrophic\" and urged local residents to obey any shelter-in-place orders. \"We believe we have at least three fatalities - and I believe that number is going to get larger,\" he said. \"We have at least 11 injuries, some of which are very significant.\" Those injured were said to be on the ground. At a later press conference, local police confirmed that four people had died and 11 had been taken to hospital. Mr Beshear added earlier that two employees on the ground are missing after the incident, and that two buildings on the ground were affected. Other authorities said that the plane was carrying 38,000 gallons of fuel at the time of the crash. The US Federal Aviation Authority (FAA) said the crash happened around 5.15pm local time (10.15pm UK time) as the plane left the airport, bound for Honolulu in Hawaii. It added that the aircraft was a McDonnell Douglas MD-11 plane, primarily used by cargo airlines. In a statement on its website, CPS said three people were on board the plane at the time of the crash. Louisville International Airport is also home to UPS Worldport, the delivery firm's largest package handling facility in the world. The airport said all arriving and departing flights are temporarily suspended, that the airfield is closed, and warned passengers should closely monitor their flights. Read more from Sky News:Could this be New York City's next mayor?Analysis: Dick Cheney believed history would vindicate him Sky's US correspondent David Blevins noted that the incident occurred during the US government shutdown, meaning the budget for paying air traffic controllers has not been finalised. The failure to reopen the federal government after 35 days has, he said, resulted \"in a shortage of staff\" and added: \"There will be many questions asked in the coming days by the National Transportation Safety Authority about what exactly has gone wrong.\""
    },
    {
        "title": "Biggest schools shake-up in a decade to cut GCSE exam time - and add AI and fake news lessons",
        "description": "The government has announced it will cut GCSE exam time by up to three hours per student.",
        "url": "https://news.sky.com/story/biggest-schools-shake-up-in-a-decade-to-cut-gcse-exam-time-and-add-ai-and-fake-news-lessons-13463831",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-classroom-students_7071944.jpg?20251104165915",
        "type": "Home",
        "Author": "Anjum Peerbacos",
        "Date Published": "2025-11-04 15:45:00",
        "Headline": "The government will reduce GCSE exam time by up to three hours per student, introduce new Year 8 tests, and teach primary pupils how to identify misinformation under sweeping curriculum reforms.",
        "Content": "\n          Education reporter\n       The government has announced it will cut GCSE exam time by up to three hours per student. The final report from a curriculum and assessment review - commissioned by Labour last year, and the biggest of its kind for a decade - recommends cutting the overall volume of exams at Key Stage 4 by 10%, ruling the current amount as \"excessive\". It also calls for the introduction of new maths and English tests in Year 8 to help teachers identify learning gaps sooner, the addition of mandatory citizenship lessons in primary schools, and a major overhaul of the Key Stage 2 grammar, punctuation, and spelling test. AI among new subjects The reforms to the national curriculum will also include a focus on AI and data science for post-16 students. For the first time, primary-aged children will be taught how to spot fake news and identify misinformation and disinformation. This will help them develop their critical thinking skills and protect them when online. Primary pupils will also learn more about the fundamentals of money. The review recognises that children are now consumers often before they reach secondary school. A new compulsory reading test in Year 8 will be introduced. This will be in addition to a writing assessment in Year 6, as well as SATs, to identify pupils who need extra support. Education reporter Are more exams the only way standards can be improved? Primary colleagues have said SATs are not the best way to assess children. Previously, primary teachers have taken industrial action over this issue. There is a danger this additional exam will exacerbate an exam factory culture which already exists in many schools. As a former secondary school teacher and parent I have seen first-hand how many hours of exams the system expects fifteen and sixteen-year-olds to do for their GCSEs.  There has been a huge rise in issues in young people's mental health and the topic of exams is one of huge stress for young people. To introduce another compulsory exam seems rather short-sighted. Exams are not the only way to drive up standards for young people and improve their life chances. Is the new system setting up another opportunity to fail? Schools will also be expected to work towards offering triple science GCSE as standard. This comes alongside the government exploring a new qualification for 16-18 year olds in data science and AI, with a view to encourage more young people into science and tech careers. Education Secretary Bridget Phillipson said the changes \"will help young people step boldly into the future, with the knowledge to achieve and the skills to thrive as the world around us continues to rapidly evolve\". Read more from Sky News:The 100-year trend that may be about to break Additionally, the government will publish an oracy framework to help ensure more young people become confident and effective speakers, building on the success of existing reading and writing frameworks. It is also committed to ensuring all pupils retain access to sport and the arts."
    },
    {
        "title": "Number of female MPs could plummet for first time if no action taken",
        "description": "The number of female MPs could plummet for the first time in more than a century if action is not taken now, campaigners have warned.",
        "url": "https://news.sky.com/story/number-of-female-mps-could-plummet-for-first-time-if-no-action-taken-13463877",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nancy-astor-politics_7072178.jpg?20251104213056",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2025-11-04 17:22:00",
        "Headline": "The 2024 election returned the highest proportion of female MPs, but it could drop dramatically should Reform or the Tories win in 2029. Campaigners have said the prospect must serve as a \"wake-up call\".",
        "Content": "\n          Political reporter\n              @alixculbertson\n The number of female MPs could plummet for the first time in more than a century if action is not taken now, campaigners have warned. If Reform UK, which has led voting intention polls since April, or the Conservatives, win the next general election, women's representation would fall drastically. Politics Hub: Latest updates and analysis A Labour win would stall the current percentage of female MPs, which stands at its highest ever at 41% (264 out of 650) - but is still lower than the UK population, of which 51% are women. If Reform win the next election, set for 2029, women's representation could fall to 26%, analysis of Electoral Calculus polling data by 50:50 Parliament found. If the Tories win, 33% of MPs would be women, while Labour would remain the same. What does history tell us? Every parliament since women were allowed to be MPs in 1918 has seen an increase, apart from small drops in 1950, 1979 and 2001. Nancy Astor was the first woman to take her seat in the Commons and served from 1919 to 1945. The 80s saw a substantial increase in female MPs before a large jump in 1997, and there has been a big rise from 128 women MPs in 2005 to the current 264. Despite this, no major party reached gender parity in its selection of candidates for last year's election. Labour selected 47% women, Greens were at 44%, Conservatives 34%, Lib Dems 28% and Reform 16%. 50:50 Parliament, which campaigns for gender equality in politics, is calling for people to \"Ask Her to Stand\" to encourage more women to get involved with politics to help balance the scales. It has installed a \"push for equality\" panic button outside parliament to raise awareness of the gender disparity. Stella Creasy, Labour MP for Walthamstow since 2010, has campaigned for abortion rights, childcare reform, and became the first MP to appoint a locum MP to manage constituency work during her maternity leave, after campaigning for better maternity rights for MPs. She told Sky News gender parity in parliament is important, as a broad range of views and experiences is needed \"to shape good quality policymaking\". Read more:Parliament to review baby rules after MP reprimanded \"For me, this is not about electing women for the sake of it, or because they champion women's rights per se; it is because gender balance will lead to better outcomes for all and the furthering of all of our rights,\" she said. \"There is strength in diversity, and we cannot hope to make decent policy, or pass good legislation, if half of the population are not adequately represented in the House. \"Childcare is a perfect example - it isn't just good for mums, it is essential infrastructure for society and therefore the economy to get it right.\" 'Why would you think men are better at politics?' Harriet Harman, a Labour peer and co-host of Sky News' Electoral Dysfunction podcast, is a former minister who put forward the Equality Bill, now the Equality Act 2010, which protects people from discrimination in the workplace and in wider society. She told Sky News: \"The time is long past that women could be expected to put up with men making all the decisions. \"Male-dominated parliaments are evidence of discrimination. Unless you think men are just better at politics than women. And why would you think that? \"A team of men and women with a breadth of experience is what works best. Who wants to go back to the old boys' network running the country? Not me.\" 'Different voices make better decisions' Former leader of the Scottish Conservatives Baroness Ruth Davidson, also a co-host of Electoral Dysfunction, said parliament \"works better when it looks and feels closer to the country it seeks to represent\". \"Women politicians often have different experiences before entering parliament, including in their prior interactions with public services,\" she added. \"It is important that laws and funding decided in the Commons and elsewhere are informed by the widest experience of how such decisions impact in practice. \"Having different voices round the table, offering challenge from a variety of perspectives, is how you make better laws, better decisions and a better Britain.\"  Lyanne Nicholl, CEO of 50:50 Parliament, said the impact of their prediction playing out will be \"devastating\", as she pointed out gender parity \"isn't about party politics - it's about democracy\". She said \"we risk turning back the clock\" and policymaking \"ignoring half the population\", as she called the data a \"wake-up call\" for everyone."
    },
    {
        "title": "'Human error' may have led to grooming gangs investigations being dropped, review says",
        "description": "A major review to unearth failures to tackle grooming gangs has found that potential human error led to some police investigations being dropped.",
        "url": "https://news.sky.com/story/human-error-may-have-led-to-grooming-gangs-investigations-being-dropped-review-says-13463819",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-national-crime-agency_7071947.jpg?20251104170141",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-04 15:28:00",
        "Headline": "Operation Beaconport is looking into cases spanning more than 15 years, and has reported some of its early findings.",
        "Content": "A major review to unearth failures to tackle grooming gangs has found that potential human error led to some police investigations being dropped. The review - named Operation Beaconport - is looking into cases between 1 January 2010 and 31 March this year. Thousands of cases are expected to come under scrutiny. So far, 1,273 files from 23 police forces have been referred to the review, led by the National Crime Agency (NCA), of which 236 are being examined as a priority because they involve allegations of rape. NCA deputy director Nigel Leary said initial reviews suggest there were mistakes in some investigations. He said: \"Initial reviews have identified that in some cases where there has been a decision to take no further action (NFA), there were available lines of inquiry that could have been pursued. \"We've seen in those cases what appears to be potentially human error.\" Mr Leary said that in some cases the inquiries haven't followed what the NCA would characterise as \"proper investigative practice\". \"That includes, for example, lines of inquiry being identified but not being followed, victim accounts not being taken in a way that we would recognise as best practice, and suspects not being pursued or interviewed in the ways that we would anticipate,\" he said. Read more from Sky News:Hull grooming gangs investigation reopenedOfficers taken off Hull grooming gangs investigation  Last month, the Metropolitan Police announced officers were reviewing 9,000 cases of child sexual exploitation. It is expected that some of these will be referred to Operation Beaconport, which is looking at cases involving two or more suspects, more than one victim, contact offences, where the suspects are still alive, and that have not already been independently reviewed. The investigation into grooming gangs and other non-familial sexual abuse in Rotherham between 1997 and 2013, Operation Stovewood, has cost £89m over 11 years. It is not clear how much the latest investigation will cost. However, Mr Leary said it would be the \"most comprehensive investigation of its type in UK history\", with the NCA estimating thousands of officers will be involved in the overall operation. Home editor There is already a system in place for what are known as \"non-recent\" sexual abuse cases to be reviewed called Operation Hydrant. But the NCA is looking to identify cases in the last five years, which could show that women and girls are still being failed by police forces.  Worryingly, the NCA says it has \"already identified investigations that were incorrectly closed with no further action taken\" as police chiefs are ordered to hand over their files in hundreds of closed cases under powers unique to the NCA. This often comes with mixed feelings for the survivors. When Sky News investigated a closed case called Operation Marksman into an alleged grooming gang in Hull in 2021 – the case was reopened. A review team found the initial investigation was \"flawed\" and a new team in Humberside was ordered to re-investigate.  But, two years on, the young women involved told Sky News they were angry and frustrated to discover the new team had only just finished going through the original files. What is more, evidence gets old – phones and laptops get swapped and deleted, DNA evidence has long disappeared. This will run alongside the government's national public inquiry, which has faltered after two potential chairs pulled out due to pressure from victims on the inquiry panel.  With police resources stretched in many directions, what may happen is wrongs are discovered but not righted.  However, encouragingly, this isn't just a review exercise by the NCA but also an effort to learn from mistakes, improve methodology, share more data which, if done well, could build a better success rate. Officials are recording the ethnicity of suspects and victims as part of the review, and have found gaps in the existing data that they are trying to fill. As they examine cases, they aim to flag any dangerous suspects, and any that are at risk of fleeing the UK. Investigators have vowed to be \"honest and transparent\" with victims from the start, to avoid giving them unrealistic expectations. Richard Fewkes, from the National Police Chiefs' Council, said while going after perpetrators is important, some victims will just want to feel they are being listened to. He said: \"Justice means different things for different victims and survivors, and no one victim and survivor is the same. \"For some, justice is just being believed, perhaps for the first time, by someone in authority - being listened to. \"Or it might even be understanding that the review has taken place, a reinvestigation has taken place in an appropriate, focused, robust way, but nothing more can be done. \"For some that is justice in their mind.\""
    },
    {
        "title": "Southport inquiry: Axel Rudakubana’s brother feared he would kill their father before attack",
        "description": "Axel Rudakubana&#8217;s brother feared he would kill a family member two years before the Southport attack, an inquiry has heard. ",
        "url": "https://news.sky.com/story/southport-inquiry-axel-rudakubana8217s-brother-feared-he-would-kill-their-father-before-attack-13463872",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-southport-crime_7031430.jpg?20250925150335",
        "type": "Home",
        "Author": "Henry Vaughan",
        "Date Published": "2025-11-04 17:07:00",
        "Headline": "Dion Rudakubana compared his younger brother with the 'sociopath' killer in the film No Country For Old Men. ",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n Axel Rudakubana’s brother feared he would kill a family member two years before the Southport attack, an inquiry has heard.  Dion Rudakubana, who is two years older than his brother, said Axel has a \"short temper\" and was prone to \"violent outbursts\", hitting him regularly when they were children. He said Axel's behaviour escalated after he was expelled from the Range High School in Formby, Merseyside, in 2019 and their parents had \"lost control\". The public inquiry into the Southport attack heard by the time he left for university in 2022, Dion feared his brother would kill a family member. In messages sent to a friend when he returned to the family home for Christmas, Dion said: \"My brother doesn't show mercy, my dad just has to try not to die... We hide knives to mitigate that factor.\" He told the inquiry there were times the police would be called out and recalled one incident when \"my father was holding my brother off\". \"I remember being scared somebody was going to die… my dad,\" he says. \n                  More capacity for mental health referrals needed, warns senior counter-terrorism officer\n                 \n                  Southport inquiry latest: Axel Rudakubana's brother says 'I feared he would kill our dad'\n                 \n                  Axel Rudakubana: Attempts to get Southport killer back to school ended less than a year before attack, inquiry told\n                 Rudakubana was 17 when he murdered Elsie Dot Stancombe, seven, Bebe King, six, and Alice da Silva Aguiar, nine, in a knife attack on a Taylor Swift-themed dance class on July 29 last year. Eight other children, who cannot be identified because of their age, were also injured, along with yoga instructor Leanne Lucas, who was leading the dance class, and businessman John Hayes, who was one of the first people on the scene and tackled the killer. Giving evidence from a remote location by video-link, Dion's voice could be heard but he could not be seen at Liverpool Town Hall. After swearing on the Bible, he told how he and his brother grew up in Cardiff after their parents Laetitia Muzayire and Alphonse Rudakubana came to the UK from Rwanda and were granted asylum. Dion says the genocide had a \"very heavy influence on them\" but he doesn't feel he was \"traumatised\" by his parents' experiences. His mother and father studied for degrees and moved to Southport in 2013 because his mother got a job, while his father started working as taxi driver because \"he was not finding work in the area he studied in\", Dion said. Read more:More capacity for mental health referrals needed, warns senior counter-terrorism officerHead of former school says Rudakubana was 'building up to something' He told how Axel was resentful of him after they had to move schools because of his health issues. Dion said Axel was physically bigger, and he felt \"increasingly wary\" of his younger brother who would regularly hit him and smash plates and glasses in their home. Dion said the last interaction he had with his brother was in the summer of 2023, when Axel threw a metal bottle at him, but luckily he had already closed the door. In his witness statement, Dion compared his brother with the \"sociopath\" played by Javier Bardem in No Country For Old Men, who kills ten people over the course of the film. \"I watched it recently and it concerned me,\" he told the inquiry, which continues on Wednesday."
    },
    {
        "title": "Chancellor Rachel Reeves blames other people's mistakes for her predicament but she bears some responsibility",
        "description": "To say this wasn't the plan is an understatement.",
        "url": "https://news.sky.com/story/chancellor-rachel-reeves-blames-other-peoples-mistakes-for-her-predicament-but-she-bears-some-responsibility-13463846",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-reeves-chancellor-budget_7072075.jpg?20251104201305",
        "type": "Home",
        "Author": "Ed Conway",
        "Date Published": "2025-11-04 16:34:00",
        "Headline": "The rigid fiscal rules that Ms Reeves herself established are a key component.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  To say this wasn't the plan is an understatement. When Rachel Reeves said last year (and many times since) that she had no intention of coming back to the British people with yet more tax rises, she meant it. Money blog: Infamous trader bets millions on AI bubble bursting But now the question ahead of the budget later this month is not so much whether taxes will rise, but which taxes, and by how much? Indeed, there's growing speculation that the chancellor will be forced to break her manifesto pledge not to raise the rates of income tax, national insurance or VAT.  Her argument, made in her news conference on Tuesday morning, is that she is in this position in large part because of other people's mistakes, primarily those of the Conservative Party. But while it's certainly true that a significant chunk of the likely downgrade to her fiscal position reflects the fact that the \"trend growth rate\" - the average speed of productivity growth - has dropped in recent years due to all sorts of issues, including Brexit, COVID-19 and the state of the labour market, she certainly bears some responsibility. A problem that is some of her own making \n                  Why Chancellor Rachel Reeves chose 'shock and awe' 8am news conference\n                 \n                  Chancellor Rachel Reeves refuses to rule out manifesto-breaking tax hikes\n                 \n                  Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today\n                 First off, she established the fiscal rules against which she is being marked by the Office for Budget Responsibility. Second, she decided to leave herself only a wafer-thin margin against those rules. Third, even if it weren't for the OBR's productivity downgrade, it's quite likely the chancellor would have broken those fiscal rules, due to the various U-turns by the government on welfare reforms, winter fuel, and extra giveaways they haven't yet provided the funding for, such as reversing the two-child benefit cap.   Now, at this stage, no one, save for the Treasury and the Office for Budget Responsibility, really knows the scale of the task facing the chancellor. And in the coming weeks, those numbers could change significantly. But it's becoming increasingly clear, from the political signalling if nothing else, that the government is rolling the pitch for bad news later this month. Indeed, for all that this government pledged to bring an end to austerity, a combination of higher taxes and lower spending will be highly unpopular, not to mention deeply controversial. And while the chancellor will seek to blame her predecessors, it remains to be seen whether the public will be entirely convinced. "
    },
    {
        "title": "Train company LNER 'extremely proud' of rail worker in critical condition after mass stabbing as family call him 'hero'",
        "description": "The \"extraordinary bravery\" of the LNER worker who intervened during a mass stabbing on a train on Saturday has been hailed by his company.",
        "url": "https://news.sky.com/story/train-company-lner-extremely-proud-of-rail-worker-in-critical-condition-after-mass-stabbing-as-family-call-him-hero-13463705",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-samir-zitouni-huntingdon_7071532.jpg?20251104105600",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-04 10:35:00",
        "Headline": "Samir Zitouni, 48, was left fighting for his life after trying to protect passengers during the knife attack on Saturday's 6.25pm LNER service from Doncaster to London King's Cross.",
        "Content": "The \"extraordinary bravery\" of the LNER worker who intervened during a mass stabbing on a train on Saturday has been hailed by his company. Samir Zitouni, 48, also known as Sam, was last night fighting for his life after trying to stop a knife attacker who targeted passengers on a busy train. He was injured while trying to protect passengers during the mass stabbing on Saturday's 6.25pm LNER service from Doncaster to London King's Cross. Deputy Chief Constable of British Transport Police (BTP), Stuart Cundy, said CCTV from the train showed the man's actions \"were nothing short of heroic and undoubtedly saved people's lives\". The train operator said he has been a \"valued member\" of staff for over 20 years, working on board as a customer experience host. David Horne, managing director at LNER, said: \"In a moment of crisis, Sam did not hesitate as he stepped forward to protect those around him. \"His actions were incredibly brave, and we are so proud of him, and of all our colleagues who acted with such courage that evening. Our thoughts and prayers remain with Sam and his family. We will continue to support them and wish him a full and speedy recovery.\" \n                  Biggest schools shake-up in a decade to cut GCSE exam time - and add AI and fake news lessons\n                 \n                  'Human error' may have led to grooming gangs investigations being dropped, review says\n                 \n                  Number of female MPs could plummet for first time if no action taken\n                 His family also shared a message, thanking those who had shown the \"overwhelming support\" they have received and calling him a \"hero\". They said: \"We have been deeply touched by the outpouring of love and kindness shown to Sam, and by the many well wishes for his recovery. \"The care provided by the hospital and the support from his colleagues at LNER has been incredible. We are immensely proud of Sam and his courage. The police called him a hero on Saturday evening, but to us - he's always been a hero.\" Police investigation A man, Anthony Williams, 32, of no fixed abode, has been charged with 11 counts of attempted murder over the mass stabbing and another attack earlier at an east London station. British Transport Police (BTP) said Williams had been charged with attempted murder and possession of a bladed article in connection with an incident on a Docklands Light Railway train in the early hours of 1 November. A victim suffered facial injuries after being attacked with a knife on a train at Pontoon Dock station, the force added. Read more:Train stabbing victim 'didn't have much choice' but to fight backPolice reviewing three further incidents after train knife attack The suspect left the location before police arrived. Home Secretary, Shabana Mahmood, said police in Cambridgeshire were investigating whether the same man committed \"further offences\" before. British Transport Police are also investigating three other incidents which they believe are linked to the train attack and London stabbing. Those incidents, which took place on Friday and Saturday, are: • 7.10pm, Friday: The stabbing of a 14-year-old boy in Peterborough city centre. The teenager was taken to hospital with minor injuries and has since been discharged • Around 7.10pm, Friday: A man with a knife entered a barbers in the Fletton area of Peterborough. This was not reported to the police until two hours later • 9.25am, Saturday: A man was seen with a knife again at the Fletton barbers. The police were called while the man was at the scene and officers arrived within 18 minutes but were unable to find the man. Williams was remanded in custody on Monday when he appeared at Peterborough Magistrates' Court."
    },
    {
        "title": "Reflecting sunlight into space could 'buy time' against global warming - but experts warn of 'rogue nations' risk",
        "description": "Reducing the amount of sunlight reaching the Earth could take the edge off global warming and limit the damage caused by climate change, according to Britain's leading scientific body.",
        "url": "https://news.sky.com/story/reflecting-sunlight-into-space-could-buy-time-against-global-warming-but-experts-warn-of-rogue-nations-risk-13463849",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sea-clouds_7071989.jpg?20251104180119",
        "type": "Home",
        "Author": "Thomas Moore",
        "Date Published": "2025-11-04 16:38:00",
        "Headline": "A nation going alone and attempting to dim sunlight in one region could cause extreme droughts and other weather disturbances elsewhere in the world, the report warns. ",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n Reducing the amount of sunlight reaching the Earth could take the edge off global warming and limit the damage caused by climate change, according to Britain's leading scientific body. But the Royal Society has warned that strategies aimed at bringing about these changes are not without risk. The society, which sparked the scientific revolution in the 17th century, said in a new report that bold new technology for reflecting sunlight back into space could \"buy time\" for cuts in fossil fuel emissions to take effect. It said two strategies - pumping reflective particles high in the atmosphere and spraying salt into clouds over the sea to make them whiter - are likely to be effective, as well as technically feasible. But the report's authors warn a rogue nation going alone, and attempting to dim sunlight in one region, could cause extreme droughts and other weather disturbances elsewhere in the world. Professor Keith Shine, chair of the report's working group, said there could nevertheless be a time when world leaders agree that solar radiation modification (SRM) is the least worst option. \"This is not a question of whether SRM is safe, as it is clearly not without risks,\" he said. \"However, there may come a point where those risks are seen to be less severe than the risks of insufficiently mitigated climate change.\" The report said global efforts to reduce greenhouse gas emissions look increasingly unlikely to stop global temperatures rising above 1.5C, considered by many scientists to be a \"safe\" limit.  A new round of UN climate talks will start later this week in Brazil, but under current policies, temperatures are likely to be at least 3C warmer than pre-industrial times by 2100. The working group ranked stratospheric aerosol injection as the most promising option for dimming the amount of sunlight reaching the Earth's surface. Planes would fly at high altitude, releasing sulphur dioxide gas, which would form particles that reflect a small amount of sunlight. There is real-world evidence that this could work. The 1991 eruption of Mount Pinatubo, a volcano in the Philippines, pumped 15 million tonnes of sulphur dioxide into the stratosphere, reducing the temperature by 0.5C for one to two years. Computer models suggest that releasing eight to 16 million tonnes of the gas from planes each year across both the northern and southern hemispheres could reduce the global temperature by 1C. Read more from Sky News:Brightest ever flare from supermassive black hole spottedWhy is COP30 so controversial? The likely cost would be \"in the low 10s of billions of dollars a year\", said Prof Shine. That's far less than the global cost of more extreme weather, wildfires, and other climate impacts. Hurricane Melissa, which was made more intense by global warming, cost up to $52bn (£39.9bn) in damage and economic losses across the western Caribbean, according to AccuWeather.  The Royal Society's report warns that SRM would not tackle the root cause of climate change, and is not an alternative to reducing emissions. But it could reduce temperatures while carbon dioxide levels in the atmosphere peak and begin to fall. It could mean SRM would need to be deployed for 100 years or more."
    },
    {
        "title": "Prince William wins hearts as he cuddles baby handed to him on Brazilian island",
        "description": "Prince William has issued a call to action to \"governments, businesses and civil society\" to be \"united in purpose, bold in ambition, and unwavering in our commitment to a safer and healthier world\" ahead of COP30.",
        "url": "https://news.sky.com/story/prince-william-wins-hearts-as-he-cuddles-baby-handed-to-him-on-brazilian-island-13463964",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-brazil-william-baby_7071982.jpg?20251104174848",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-11-04 20:04:00",
        "Headline": "The future king charmed residents of Paqueta Island, cuddling 10-month-old Joaquim and meeting children while learning about mangrove conservation ahead of COP 30. ",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  Prince William has issued a call to action to \"governments, businesses and civil society\" to be \"united in purpose, bold in ambition, and unwavering in our commitment to a safer and healthier world\" ahead of COP30. In his first speech of his trip to Brazil this week, ahead of the UN's climate conference, he said: \"We must act together. Governments, businesses and civil society - each must now step up and play their role in developing solutions, scaling support, and shifting resources to where they are needed most.\" Addressing the audience at a United for Wildlife event in Rio de Janiero he added: \"Let us carry our determination forward - united in purpose, bold in ambition, and unwavering in our commitment to a safer and healthier world.\" The summit was put on by his royal foundation United for Wildlife, a global alliance focused on tackling wildlife crime. Featuring a surprise video from Leonardo DiCaprio, the key themes of the event were spotlighting the impact of environmental crime and amplifying the voices of indigenous people and local communities. William also travelled to the Brazilian island of Paqueta on Tuesday, a 50-minute ferry ride from Rio de Janeiro, to learn about its mangrove habitat and sample the slower pace of life on an island, where there are no private cars and bicycles are the main form of transport. But as dozens of well-wishers excitedly said hello to the future king, 10-month-old Joaquim Monteiro was handed to him for a hug. Joking with his family, William said \"mustn't drop him!\" before giving the little boy a cuddle. \n                  The underground squad with the lives of countless Ukrainian civilians in their hands\n                 \n                  Russian 'suicide drone' launches quadruple this year\n                 \n                  Genocide is unfolding in Darfur, warns Sudanese government - as it calls for the world to act\n                 Holding him with the confidence of a father of three young children, William said \"bless him\" before handing him back to his grandmother Christina. Andre Luis Junior, the baby's cousin and a teacher, said: \"Nobody asked him - he just picked him up. It's probably because he has three kids. He loves kids.\" He added: \"It's amazing. We are so happy, so happy he chose this very small island. We're very unique in the heart of Rio. Very quiet. We love that he chose to come here. The kids in school were so excited today.\" The prince helped several young children come to the front of the meet and greet in the main square by the waterfront, bending down to be in photographs with them and taking the occasional selfie. Read more from Sky News:Sir David Beckham receives knighthood from the KingSudan's government warns of genocide in Darfur The island, which only has around 5,000 residents, had declared the visit The Day Of The Prince, and children were given time off school to see him. William wanted to meet those involved in protecting the island's mangrove forests, a crucial ecosystem for preventing flooding, coastal erosion, providing a habitat for wildlife, and supporting the fishing community. He travelled on a boat into the Guapimirim mangrove to learn about the restoration work taking place there and helped with a planting activity as part of their reforestation scheme. The pictures will be particularly important to the prince and his team, emphasising why the world needs to focus minds on the climate crisis, ahead of his appearance at COP 30, the UN's climate conference in Belem, on Thursday."
    },
    {
        "title": "Biggest schools shake-up in a decade to cut GCSE exam time - and add AI and fake news lessons",
        "description": "The government has announced it will cut GCSE exam time by up to three hours per student.",
        "url": "https://news.sky.com/story/biggest-schools-shake-up-in-a-decade-to-cut-gcse-exam-time-and-add-ai-and-fake-news-lessons-13463831",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-classroom-students_7071944.jpg?20251104165915",
        "type": "UK",
        "Author": "Anjum Peerbacos",
        "Date Published": "2025-11-04 15:45:00",
        "Headline": "The government will reduce GCSE exam time by up to three hours per student, introduce new Year 8 tests, and teach primary pupils how to identify misinformation under sweeping curriculum reforms.",
        "Content": "\n          Education reporter\n       The government has announced it will cut GCSE exam time by up to three hours per student. The final report from a curriculum and assessment review - commissioned by Labour last year, and the biggest of its kind for a decade - recommends cutting the overall volume of exams at Key Stage 4 by 10%, ruling the current amount as \"excessive\". It also calls for the introduction of new maths and English tests in Year 8 to help teachers identify learning gaps sooner, the addition of mandatory citizenship lessons in primary schools, and a major overhaul of the Key Stage 2 grammar, punctuation, and spelling test. AI among new subjects The reforms to the national curriculum will also include a focus on AI and data science for post-16 students. For the first time, primary-aged children will be taught how to spot fake news and identify misinformation and disinformation. This will help them develop their critical thinking skills and protect them when online. Primary pupils will also learn more about the fundamentals of money. The review recognises that children are now consumers often before they reach secondary school. A new compulsory reading test in Year 8 will be introduced. This will be in addition to a writing assessment in Year 6, as well as SATs, to identify pupils who need extra support. Education reporter Are more exams the only way standards can be improved? Primary colleagues have said SATs are not the best way to assess children. Previously, primary teachers have taken industrial action over this issue. There is a danger this additional exam will exacerbate an exam factory culture which already exists in many schools. As a former secondary school teacher and parent I have seen first-hand how many hours of exams the system expects fifteen and sixteen-year-olds to do for their GCSEs.  There has been a huge rise in issues in young people's mental health and the topic of exams is one of huge stress for young people. To introduce another compulsory exam seems rather short-sighted. Exams are not the only way to drive up standards for young people and improve their life chances. Is the new system setting up another opportunity to fail? Schools will also be expected to work towards offering triple science GCSE as standard. This comes alongside the government exploring a new qualification for 16-18 year olds in data science and AI, with a view to encourage more young people into science and tech careers. Education Secretary Bridget Phillipson said the changes \"will help young people step boldly into the future, with the knowledge to achieve and the skills to thrive as the world around us continues to rapidly evolve\". Read more from Sky News:The 100-year trend that may be about to break Additionally, the government will publish an oracy framework to help ensure more young people become confident and effective speakers, building on the success of existing reading and writing frameworks. It is also committed to ensuring all pupils retain access to sport and the arts."
    },
    {
        "title": "'Human error' may have led to grooming gangs investigations being dropped, review says",
        "description": "A major review to unearth failures to tackle grooming gangs has found that potential human error led to some police investigations being dropped.",
        "url": "https://news.sky.com/story/human-error-may-have-led-to-grooming-gangs-investigations-being-dropped-review-says-13463819",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-national-crime-agency_7071947.jpg?20251104170141",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-04 15:28:00",
        "Headline": "Operation Beaconport is looking into cases spanning more than 15 years, and has reported some of its early findings.",
        "Content": "A major review to unearth failures to tackle grooming gangs has found that potential human error led to some police investigations being dropped. The review - named Operation Beaconport - is looking into cases between 1 January 2010 and 31 March this year. Thousands of cases are expected to come under scrutiny. So far, 1,273 files from 23 police forces have been referred to the review, led by the National Crime Agency (NCA), of which 236 are being examined as a priority because they involve allegations of rape. NCA deputy director Nigel Leary said initial reviews suggest there were mistakes in some investigations. He said: \"Initial reviews have identified that in some cases where there has been a decision to take no further action (NFA), there were available lines of inquiry that could have been pursued. \"We've seen in those cases what appears to be potentially human error.\" Mr Leary said that in some cases the inquiries haven't followed what the NCA would characterise as \"proper investigative practice\". \"That includes, for example, lines of inquiry being identified but not being followed, victim accounts not being taken in a way that we would recognise as best practice, and suspects not being pursued or interviewed in the ways that we would anticipate,\" he said. Read more from Sky News:Hull grooming gangs investigation reopenedOfficers taken off Hull grooming gangs investigation  Last month, the Metropolitan Police announced officers were reviewing 9,000 cases of child sexual exploitation. It is expected that some of these will be referred to Operation Beaconport, which is looking at cases involving two or more suspects, more than one victim, contact offences, where the suspects are still alive, and that have not already been independently reviewed. The investigation into grooming gangs and other non-familial sexual abuse in Rotherham between 1997 and 2013, Operation Stovewood, has cost £89m over 11 years. It is not clear how much the latest investigation will cost. However, Mr Leary said it would be the \"most comprehensive investigation of its type in UK history\", with the NCA estimating thousands of officers will be involved in the overall operation. Home editor There is already a system in place for what are known as \"non-recent\" sexual abuse cases to be reviewed called Operation Hydrant. But the NCA is looking to identify cases in the last five years, which could show that women and girls are still being failed by police forces.  Worryingly, the NCA says it has \"already identified investigations that were incorrectly closed with no further action taken\" as police chiefs are ordered to hand over their files in hundreds of closed cases under powers unique to the NCA. This often comes with mixed feelings for the survivors. When Sky News investigated a closed case called Operation Marksman into an alleged grooming gang in Hull in 2021 – the case was reopened. A review team found the initial investigation was \"flawed\" and a new team in Humberside was ordered to re-investigate.  But, two years on, the young women involved told Sky News they were angry and frustrated to discover the new team had only just finished going through the original files. What is more, evidence gets old – phones and laptops get swapped and deleted, DNA evidence has long disappeared. This will run alongside the government's national public inquiry, which has faltered after two potential chairs pulled out due to pressure from victims on the inquiry panel.  With police resources stretched in many directions, what may happen is wrongs are discovered but not righted.  However, encouragingly, this isn't just a review exercise by the NCA but also an effort to learn from mistakes, improve methodology, share more data which, if done well, could build a better success rate. Officials are recording the ethnicity of suspects and victims as part of the review, and have found gaps in the existing data that they are trying to fill. As they examine cases, they aim to flag any dangerous suspects, and any that are at risk of fleeing the UK. Investigators have vowed to be \"honest and transparent\" with victims from the start, to avoid giving them unrealistic expectations. Richard Fewkes, from the National Police Chiefs' Council, said while going after perpetrators is important, some victims will just want to feel they are being listened to. He said: \"Justice means different things for different victims and survivors, and no one victim and survivor is the same. \"For some, justice is just being believed, perhaps for the first time, by someone in authority - being listened to. \"Or it might even be understanding that the review has taken place, a reinvestigation has taken place in an appropriate, focused, robust way, but nothing more can be done. \"For some that is justice in their mind.\""
    },
    {
        "title": "Number of female MPs could plummet for first time if no action taken",
        "description": "The number of female MPs could plummet for the first time in more than a century if action is not taken now, campaigners have warned.",
        "url": "https://news.sky.com/story/number-of-female-mps-could-plummet-for-first-time-if-no-action-taken-13463877",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nancy-astor-politics_7072178.jpg?20251104213056",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-11-04 17:22:00",
        "Headline": "The 2024 election returned the highest proportion of female MPs, but it could drop dramatically should Reform or the Tories win in 2029. Campaigners have said the prospect must serve as a \"wake-up call\".",
        "Content": "\n          Political reporter\n              @alixculbertson\n The number of female MPs could plummet for the first time in more than a century if action is not taken now, campaigners have warned. If Reform UK, which has led voting intention polls since April, or the Conservatives, win the next general election, women's representation would fall drastically. Politics Hub: Latest updates and analysis A Labour win would stall the current percentage of female MPs, which stands at its highest ever at 41% (264 out of 650) - but is still lower than the UK population, of which 51% are women. If Reform win the next election, set for 2029, women's representation could fall to 26%, analysis of Electoral Calculus polling data by 50:50 Parliament found. If the Tories win, 33% of MPs would be women, while Labour would remain the same. What does history tell us? Every parliament since women were allowed to be MPs in 1918 has seen an increase, apart from small drops in 1950, 1979 and 2001. Nancy Astor was the first woman to take her seat in the Commons and served from 1919 to 1945. The 80s saw a substantial increase in female MPs before a large jump in 1997, and there has been a big rise from 128 women MPs in 2005 to the current 264. Despite this, no major party reached gender parity in its selection of candidates for last year's election. Labour selected 47% women, Greens were at 44%, Conservatives 34%, Lib Dems 28% and Reform 16%. 50:50 Parliament, which campaigns for gender equality in politics, is calling for people to \"Ask Her to Stand\" to encourage more women to get involved with politics to help balance the scales. It has installed a \"push for equality\" panic button outside parliament to raise awareness of the gender disparity. Stella Creasy, Labour MP for Walthamstow since 2010, has campaigned for abortion rights, childcare reform, and became the first MP to appoint a locum MP to manage constituency work during her maternity leave, after campaigning for better maternity rights for MPs. She told Sky News gender parity in parliament is important, as a broad range of views and experiences is needed \"to shape good quality policymaking\". Read more:Parliament to review baby rules after MP reprimanded \"For me, this is not about electing women for the sake of it, or because they champion women's rights per se; it is because gender balance will lead to better outcomes for all and the furthering of all of our rights,\" she said. \"There is strength in diversity, and we cannot hope to make decent policy, or pass good legislation, if half of the population are not adequately represented in the House. \"Childcare is a perfect example - it isn't just good for mums, it is essential infrastructure for society and therefore the economy to get it right.\" 'Why would you think men are better at politics?' Harriet Harman, a Labour peer and co-host of Sky News' Electoral Dysfunction podcast, is a former minister who put forward the Equality Bill, now the Equality Act 2010, which protects people from discrimination in the workplace and in wider society. She told Sky News: \"The time is long past that women could be expected to put up with men making all the decisions. \"Male-dominated parliaments are evidence of discrimination. Unless you think men are just better at politics than women. And why would you think that? \"A team of men and women with a breadth of experience is what works best. Who wants to go back to the old boys' network running the country? Not me.\" 'Different voices make better decisions' Former leader of the Scottish Conservatives Baroness Ruth Davidson, also a co-host of Electoral Dysfunction, said parliament \"works better when it looks and feels closer to the country it seeks to represent\". \"Women politicians often have different experiences before entering parliament, including in their prior interactions with public services,\" she added. \"It is important that laws and funding decided in the Commons and elsewhere are informed by the widest experience of how such decisions impact in practice. \"Having different voices round the table, offering challenge from a variety of perspectives, is how you make better laws, better decisions and a better Britain.\"  Lyanne Nicholl, CEO of 50:50 Parliament, said the impact of their prediction playing out will be \"devastating\", as she pointed out gender parity \"isn't about party politics - it's about democracy\". She said \"we risk turning back the clock\" and policymaking \"ignoring half the population\", as she called the data a \"wake-up call\" for everyone."
    },
    {
        "title": "Reflecting sunlight into space could 'buy time' against global warming - but experts warn of 'rogue nations' risk",
        "description": "Reducing the amount of sunlight reaching the Earth could take the edge off global warming and limit the damage caused by climate change, according to Britain's leading scientific body.",
        "url": "https://news.sky.com/story/reflecting-sunlight-into-space-could-buy-time-against-global-warming-but-experts-warn-of-rogue-nations-risk-13463849",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sea-clouds_7071989.jpg?20251104180119",
        "type": "UK",
        "Author": "Thomas Moore",
        "Date Published": "2025-11-04 16:38:00",
        "Headline": "A nation going alone and attempting to dim sunlight in one region could cause extreme droughts and other weather disturbances elsewhere in the world, the report warns. ",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n Reducing the amount of sunlight reaching the Earth could take the edge off global warming and limit the damage caused by climate change, according to Britain's leading scientific body. But the Royal Society has warned that strategies aimed at bringing about these changes are not without risk. The society, which sparked the scientific revolution in the 17th century, said in a new report that bold new technology for reflecting sunlight back into space could \"buy time\" for cuts in fossil fuel emissions to take effect. It said two strategies - pumping reflective particles high in the atmosphere and spraying salt into clouds over the sea to make them whiter - are likely to be effective, as well as technically feasible. But the report's authors warn a rogue nation going alone, and attempting to dim sunlight in one region, could cause extreme droughts and other weather disturbances elsewhere in the world. Professor Keith Shine, chair of the report's working group, said there could nevertheless be a time when world leaders agree that solar radiation modification (SRM) is the least worst option. \"This is not a question of whether SRM is safe, as it is clearly not without risks,\" he said. \"However, there may come a point where those risks are seen to be less severe than the risks of insufficiently mitigated climate change.\" The report said global efforts to reduce greenhouse gas emissions look increasingly unlikely to stop global temperatures rising above 1.5C, considered by many scientists to be a \"safe\" limit.  A new round of UN climate talks will start later this week in Brazil, but under current policies, temperatures are likely to be at least 3C warmer than pre-industrial times by 2100. The working group ranked stratospheric aerosol injection as the most promising option for dimming the amount of sunlight reaching the Earth's surface. Planes would fly at high altitude, releasing sulphur dioxide gas, which would form particles that reflect a small amount of sunlight. There is real-world evidence that this could work. The 1991 eruption of Mount Pinatubo, a volcano in the Philippines, pumped 15 million tonnes of sulphur dioxide into the stratosphere, reducing the temperature by 0.5C for one to two years. Computer models suggest that releasing eight to 16 million tonnes of the gas from planes each year across both the northern and southern hemispheres could reduce the global temperature by 1C. Read more from Sky News:Brightest ever flare from supermassive black hole spottedWhy is COP30 so controversial? The likely cost would be \"in the low 10s of billions of dollars a year\", said Prof Shine. That's far less than the global cost of more extreme weather, wildfires, and other climate impacts. Hurricane Melissa, which was made more intense by global warming, cost up to $52bn (£39.9bn) in damage and economic losses across the western Caribbean, according to AccuWeather.  The Royal Society's report warns that SRM would not tackle the root cause of climate change, and is not an alternative to reducing emissions. But it could reduce temperatures while carbon dioxide levels in the atmosphere peak and begin to fall. It could mean SRM would need to be deployed for 100 years or more."
    },
    {
        "title": "Southport inquiry: Axel Rudakubana’s brother feared he would kill their father before attack",
        "description": "Axel Rudakubana&#8217;s brother feared he would kill a family member two years before the Southport attack, an inquiry has heard. ",
        "url": "https://news.sky.com/story/southport-inquiry-axel-rudakubana8217s-brother-feared-he-would-kill-their-father-before-attack-13463872",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-southport-crime_7031430.jpg?20250925150335",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-11-04 17:07:00",
        "Headline": "Dion Rudakubana compared his younger brother with the 'sociopath' killer in the film No Country For Old Men. ",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n Axel Rudakubana’s brother feared he would kill a family member two years before the Southport attack, an inquiry has heard.  Dion Rudakubana, who is two years older than his brother, said Axel has a \"short temper\" and was prone to \"violent outbursts\", hitting him regularly when they were children. He said Axel's behaviour escalated after he was expelled from the Range High School in Formby, Merseyside, in 2019 and their parents had \"lost control\". The public inquiry into the Southport attack heard by the time he left for university in 2022, Dion feared his brother would kill a family member. In messages sent to a friend when he returned to the family home for Christmas, Dion said: \"My brother doesn't show mercy, my dad just has to try not to die... We hide knives to mitigate that factor.\" He told the inquiry there were times the police would be called out and recalled one incident when \"my father was holding my brother off\". \"I remember being scared somebody was going to die… my dad,\" he says. \n                  More capacity for mental health referrals needed, warns senior counter-terrorism officer\n                 \n                  Southport inquiry latest: Axel Rudakubana's brother says 'I feared he would kill our dad'\n                 \n                  Axel Rudakubana: Attempts to get Southport killer back to school ended less than a year before attack, inquiry told\n                 Rudakubana was 17 when he murdered Elsie Dot Stancombe, seven, Bebe King, six, and Alice da Silva Aguiar, nine, in a knife attack on a Taylor Swift-themed dance class on July 29 last year. Eight other children, who cannot be identified because of their age, were also injured, along with yoga instructor Leanne Lucas, who was leading the dance class, and businessman John Hayes, who was one of the first people on the scene and tackled the killer. Giving evidence from a remote location by video-link, Dion's voice could be heard but he could not be seen at Liverpool Town Hall. After swearing on the Bible, he told how he and his brother grew up in Cardiff after their parents Laetitia Muzayire and Alphonse Rudakubana came to the UK from Rwanda and were granted asylum. Dion says the genocide had a \"very heavy influence on them\" but he doesn't feel he was \"traumatised\" by his parents' experiences. His mother and father studied for degrees and moved to Southport in 2013 because his mother got a job, while his father started working as taxi driver because \"he was not finding work in the area he studied in\", Dion said. Read more:More capacity for mental health referrals needed, warns senior counter-terrorism officerHead of former school says Rudakubana was 'building up to something' He told how Axel was resentful of him after they had to move schools because of his health issues. Dion said Axel was physically bigger, and he felt \"increasingly wary\" of his younger brother who would regularly hit him and smash plates and glasses in their home. Dion said the last interaction he had with his brother was in the summer of 2023, when Axel threw a metal bottle at him, but luckily he had already closed the door. In his witness statement, Dion compared his brother with the \"sociopath\" played by Javier Bardem in No Country For Old Men, who kills ten people over the course of the film. \"I watched it recently and it concerned me,\" he told the inquiry, which continues on Wednesday."
    },
    {
        "title": "Prince William wins hearts as he cuddles baby handed to him on Brazilian island",
        "description": "Prince William has issued a call to action to \"governments, businesses and civil society\" to be \"united in purpose, bold in ambition, and unwavering in our commitment to a safer and healthier world\" ahead of COP30.",
        "url": "https://news.sky.com/story/prince-william-wins-hearts-as-he-cuddles-baby-handed-to-him-on-brazilian-island-13463964",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-brazil-william-baby_7071982.jpg?20251104174848",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-11-04 20:04:00",
        "Headline": "The future king charmed residents of Paqueta Island, cuddling 10-month-old Joaquim and meeting children while learning about mangrove conservation ahead of COP 30. ",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  Prince William has issued a call to action to \"governments, businesses and civil society\" to be \"united in purpose, bold in ambition, and unwavering in our commitment to a safer and healthier world\" ahead of COP30. In his first speech of his trip to Brazil this week, ahead of the UN's climate conference, he said: \"We must act together. Governments, businesses and civil society - each must now step up and play their role in developing solutions, scaling support, and shifting resources to where they are needed most.\" Addressing the audience at a United for Wildlife event in Rio de Janiero he added: \"Let us carry our determination forward - united in purpose, bold in ambition, and unwavering in our commitment to a safer and healthier world.\" The summit was put on by his royal foundation United for Wildlife, a global alliance focused on tackling wildlife crime. Featuring a surprise video from Leonardo DiCaprio, the key themes of the event were spotlighting the impact of environmental crime and amplifying the voices of indigenous people and local communities. William also travelled to the Brazilian island of Paqueta on Tuesday, a 50-minute ferry ride from Rio de Janeiro, to learn about its mangrove habitat and sample the slower pace of life on an island, where there are no private cars and bicycles are the main form of transport. But as dozens of well-wishers excitedly said hello to the future king, 10-month-old Joaquim Monteiro was handed to him for a hug. Joking with his family, William said \"mustn't drop him!\" before giving the little boy a cuddle. \n                  The underground squad with the lives of countless Ukrainian civilians in their hands\n                 \n                  Russian 'suicide drone' launches quadruple this year\n                 \n                  Genocide is unfolding in Darfur, warns Sudanese government - as it calls for the world to act\n                 Holding him with the confidence of a father of three young children, William said \"bless him\" before handing him back to his grandmother Christina. Andre Luis Junior, the baby's cousin and a teacher, said: \"Nobody asked him - he just picked him up. It's probably because he has three kids. He loves kids.\" He added: \"It's amazing. We are so happy, so happy he chose this very small island. We're very unique in the heart of Rio. Very quiet. We love that he chose to come here. The kids in school were so excited today.\" The prince helped several young children come to the front of the meet and greet in the main square by the waterfront, bending down to be in photographs with them and taking the occasional selfie. Read more from Sky News:Sir David Beckham receives knighthood from the KingSudan's government warns of genocide in Darfur The island, which only has around 5,000 residents, had declared the visit The Day Of The Prince, and children were given time off school to see him. William wanted to meet those involved in protecting the island's mangrove forests, a crucial ecosystem for preventing flooding, coastal erosion, providing a habitat for wildlife, and supporting the fishing community. He travelled on a boat into the Guapimirim mangrove to learn about the restoration work taking place there and helped with a planting activity as part of their reforestation scheme. The pictures will be particularly important to the prince and his team, emphasising why the world needs to focus minds on the climate crisis, ahead of his appearance at COP 30, the UN's climate conference in Belem, on Thursday."
    },
    {
        "title": "Train company LNER 'extremely proud' of rail worker in critical condition after mass stabbing as family call him 'hero'",
        "description": "The \"extraordinary bravery\" of the LNER worker who intervened during a mass stabbing on a train on Saturday has been hailed by his company.",
        "url": "https://news.sky.com/story/train-company-lner-extremely-proud-of-rail-worker-in-critical-condition-after-mass-stabbing-as-family-call-him-hero-13463705",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-samir-zitouni-huntingdon_7071532.jpg?20251104105600",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-04 10:35:00",
        "Headline": "Samir Zitouni, 48, was left fighting for his life after trying to protect passengers during the knife attack on Saturday's 6.25pm LNER service from Doncaster to London King's Cross.",
        "Content": "The \"extraordinary bravery\" of the LNER worker who intervened during a mass stabbing on a train on Saturday has been hailed by his company. Samir Zitouni, 48, also known as Sam, was last night fighting for his life after trying to stop a knife attacker who targeted passengers on a busy train. He was injured while trying to protect passengers during the mass stabbing on Saturday's 6.25pm LNER service from Doncaster to London King's Cross. Deputy Chief Constable of British Transport Police (BTP), Stuart Cundy, said CCTV from the train showed the man's actions \"were nothing short of heroic and undoubtedly saved people's lives\". The train operator said he has been a \"valued member\" of staff for over 20 years, working on board as a customer experience host. David Horne, managing director at LNER, said: \"In a moment of crisis, Sam did not hesitate as he stepped forward to protect those around him. \"His actions were incredibly brave, and we are so proud of him, and of all our colleagues who acted with such courage that evening. Our thoughts and prayers remain with Sam and his family. We will continue to support them and wish him a full and speedy recovery.\" \n                  Biggest schools shake-up in a decade to cut GCSE exam time - and add AI and fake news lessons\n                 \n                  'Human error' may have led to grooming gangs investigations being dropped, review says\n                 \n                  Number of female MPs could plummet for first time if no action taken\n                 His family also shared a message, thanking those who had shown the \"overwhelming support\" they have received and calling him a \"hero\". They said: \"We have been deeply touched by the outpouring of love and kindness shown to Sam, and by the many well wishes for his recovery. \"The care provided by the hospital and the support from his colleagues at LNER has been incredible. We are immensely proud of Sam and his courage. The police called him a hero on Saturday evening, but to us - he's always been a hero.\" Police investigation A man, Anthony Williams, 32, of no fixed abode, has been charged with 11 counts of attempted murder over the mass stabbing and another attack earlier at an east London station. British Transport Police (BTP) said Williams had been charged with attempted murder and possession of a bladed article in connection with an incident on a Docklands Light Railway train in the early hours of 1 November. A victim suffered facial injuries after being attacked with a knife on a train at Pontoon Dock station, the force added. Read more:Train stabbing victim 'didn't have much choice' but to fight backPolice reviewing three further incidents after train knife attack The suspect left the location before police arrived. Home Secretary, Shabana Mahmood, said police in Cambridgeshire were investigating whether the same man committed \"further offences\" before. British Transport Police are also investigating three other incidents which they believe are linked to the train attack and London stabbing. Those incidents, which took place on Friday and Saturday, are: • 7.10pm, Friday: The stabbing of a 14-year-old boy in Peterborough city centre. The teenager was taken to hospital with minor injuries and has since been discharged • Around 7.10pm, Friday: A man with a knife entered a barbers in the Fletton area of Peterborough. This was not reported to the police until two hours later • 9.25am, Saturday: A man was seen with a knife again at the Fletton barbers. The police were called while the man was at the scene and officers arrived within 18 minutes but were unable to find the man. Williams was remanded in custody on Monday when he appeared at Peterborough Magistrates' Court."
    },
    {
        "title": "Jaiden Shehata: Schoolboy, 11, 'was on phone' when fatally hit by train at level crossing, report says",
        "description": "An 11-year-old boy who died after being hit by a train at a level crossing was probably looking at a video on his phone at the time of the accident, investigators have said.",
        "url": "https://news.sky.com/story/jaiden-shehata-schoolboy-11-was-on-phone-when-fatally-hit-by-train-at-level-crossing-report-says-13463772",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-bourneview-jaiden-shehata_7071556.jpg?20251104111427",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-04 13:00:00",
        "Headline": "The child's coat hood was pulled over his head and he was looking ahead and down at a \"glowing object\" in his hands before the accident, investigators find.",
        "Content": "An 11-year-old boy who died after being hit by a train at a level crossing was probably looking at a video on his phone at the time of the accident, investigators have said. Jaiden Shehata was walking to school when he was fatally struck at the Bourneview footpath crossing near Kenley, south London, in January, the Rail Accident Investigation Branch (RAIB) said. Jaiden, who was a pupil at the nearby Riddlesdown Collegiate secondary school, was hit by a Southern train travelling at about 50mph. The train driver sounded the horn and applied the emergency brake when he saw the boy start to cross the railway but, though he looked up, he did not have time to move clear before the train reached the crossing. Jaiden, who had used the crossing regularly since starting at Riddlesdown Collegiate the previous September, suffered fatal injuries after being hit by the train, which stopped about 200m further along the line. The child did not realise the danger he was in, probably because he was \"distracted\" by his phone, the board concluded. CCTV showed Jaiden's coat hood was pulled over his head and, as he walked towards the crossing, he was looking ahead and down at a \"glowing object,\" almost certain to be the illuminated screen of a phone in his hands. \n                  Men who ordered pints minutes after stabbing 22-year-old found guilty of murder\n                 \n                  Five injured in knife attack at Argos warehouse in Croydon\n                 \n                  Elianne Andam: Teenager Hassan Sentamu who stabbed 15-year-old to death in Croydon guilty of murder\n                 Analysis of the device suggested a video clip was playing at the time. The site does not have warning lights or barriers, which the RAIB said is \"in common with many footpath crossings\". Six near misses Users are expected to stop, look and listen for approaching trains, and \"make their own decision about whether or not it is safe to cross\", investigators said. There were six near misses at the crossing between November 2018 and February 2023, according to a Network Rail risk assessment in May 2023. A single fatality in March 2020 was thought to be a deliberate act. Giving rail safety lessons to schoolchildren and making dangerous areas at level crossings more noticeable, particularly to people who may be distracted, were among the recommendations in the RAIB's report. Read more on Sky News:Mr Bates' huge govt payout'Hero' rail worker fighting for life'Arise, Sir David' It also suggested different ways of lowering the risk were needed for younger users. A Rail Safety and Standards Board (RSSB) spokesperson said: \"Ensuring safety at level crossings remains a key priority for RSSB and the rail industry, and we will be working collaboratively to consider and implement the RAIB's recommendations.\" Lucy McAuliffe, Sussex route director for Network Rail, said the crossing was temporarily closed in August and miniature stop lights will be installed next month. These will \"improve safety by providing a clear signal and warning sound to let people know when it is safe to cross,\" she said."
    },
    {
        "title": "Why Chancellor Rachel Reeves chose 'shock and awe' 8am news conference",
        "description": "To understand why Rachel Reeves stood up at 8am in Downing Street in an unprecedented news conference to foreshadow the budget, you need to understand the depth of the problems facing the chancellor.",
        "url": "https://news.sky.com/story/why-chancellor-rachel-reeves-chose-shock-and-awe-8am-news-conference-13463679",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves_7071771.jpg?20251104165428",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-11-04 10:12:00",
        "Headline": "Rachel Reeves is battling for her own credibility - and ultimately, the survival of Sir Keir Starmer's government.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  To understand why Rachel Reeves stood up at 8am in Downing Street in an unprecedented news conference to foreshadow the budget, you need to understand the depth of the problems facing the chancellor. In 22 days, she must perform the biggest U-turn it is possible for a chancellor to make. She must hike taxes to the tune of tens of billions of pounds, having promised in the election manifesto that this would not be necessary, and reiterated this promise under a year ago after an initial £40bn of rises.  Not many inhabitants of Number 11 would stay in post if they had to make such a pivot. But Sir Keir Starmer cannot lose her and know for sure that he also stays in place. So Ms Reeves is battling for her credibility - and ultimately the survival of this government. The stakes are high. Politics latest: Reeves refuses to rule out manifesto-breaking tax rises \n                  Chancellor Rachel Reeves refuses to rule out manifesto-breaking tax hikes\n                 \n                  Budget 2025: Reeves vows to 'defy' gloomy forecasts - but faces income tax warning\n                 So back to this morning. Ever since the summer, those in Westminster have known tax rises are on the way in the autumn budget. A Treasury source told me that pitch-rolling for the budget began in July - yet their issue is that to date, almost no-one had noticed. The subject of the budget was an omerta as recently as the Labour conference a month ago - it simply wasn't on the agenda in Liverpool. The first public acknowledgement that she was looking at taxes was in an interview with me on Sky News three weeks ago. She has intermittently revisited the subject subsequently, but quite bluntly, the public haven't yet noticed. As recently as last week, people in the Treasury were acknowledging to me that the public are as yet unprepared for the tax shock expected on the scale on 26 November. So this morning's event was designed to be shock and awe - an 8am news conference is designed to jolt Westminster and the viewing public to attention, because inside the Treasury they are \"desperate\" - their words - to get the public watching.  The format allows her to look in control, like a stateswoman in Downing Street making arguments on her terms, even though these are arguments she has been forced into. So the job of this morning was to educate the public that tax rises are coming, but also put them on notice that this could involve a breach of manifesto promises by raising one of income tax, national insurance, corporation tax or VAT - and then to try and lay the blame anywhere but at the feet of this government. She also wants to give some hope - by giving a sense of what priorities she would protect. So what to make of the arguments she made? 'The impact of Tory austerity, their botched Brexit deal and the pandemic on Britain's productivity is worse than feared' Is it really all the Tories fault? Ms Reeves made an argument today about how lower growth is responsible for Britain's economic ills, and listed causes with a long tale going back many years for it. This is true, but isn't strictly the reason for her problems at this budget. On 26 November, she must fill a £20bn-£30bn \"black hole\" - that's the extent to which she is in on course to breach her own self-imposed borrowing limits, known as fiscal rules. Many of the components of the black hole cannot be put at the door of the Tories. Here's why: She must find £10bn to account for policy decisions the government has been pushed into - a failure to push through welfare reform, a U-turn on winter fuel payments, a likely rollover of fuel duty. She is likely to have to find a further £5bn for decisions she is likely to take - scrapping of the two-child benefit cap, help for energy bills and an emergency injection for redundancy bills and strike coverage costs. So £15bn of the black hole cannot be blamed on the Tories.  A further £2bn-£4bn for additional debt interest costs is a consequence of the higher borrowing just since the March spring statement - again not the Tories' fault - and also wants £10bn to give herself a bigger buffer to exit the doom loop. Ms Reeves has greater scope to argue that the productivity review has longer-term causes, but this is likely to be offset by better wage news, and there is an argument that Labour could have foreseen the productivity downgrade before the election because the Office for Budget Responsibility figures were out of line with other forecasters. So this is a tricky case to sustain, even though the government has no choice but to make it.  👉Listen to Politics At Sam And Anne's on your podcast app👈 'Protecting our NHS, reducing our national debt and improving the cost of living' The news is grim - but this is the chancellor's promise of what she is going to prioritise. But what does this amount to? NHS: I understand this is not a promise of new money for waiting lists in this budget. Ms Reeves is actually making a political argument about the need to not U-turn on last year's £22bn a year NHS investment - although the public may not hear it. Cost of living: Partly this is an argument about investment already made in things like breakfast clubs. But with CPI inflation at 4.1%, it's a major concern - but not one that can be tackled without government spending many billions. There will be some help for energy bills, but not the tens of billions that Liz Truss put towards such schemes. So this risks disappointment.  Reducing debt: It is not about to go down. Her fiscal rules mean she is going to be reducing debt as a percentage of GDP - and even then, only debt on some things, as the fiscal rules spell out some exemptions. So the actual amount we borrow from the markets will continue to grow. Does it work? Today is about saying with a louder megaphone things we already knew. She declined to say whether ultimately she will break the manifesto, or what will happen. She has, however, candidly started a conversation that needed to begin."
    },
    {
        "title": "Genocide is unfolding in Darfur, warns Sudanese government - as it calls for the world to act",
        "description": "A genocide is unfolding in Darfur and the world must act, the Sudanese government has said. ",
        "url": "https://news.sky.com/story/genocide-is-unfolding-in-darfur-warns-sudanese-government-as-it-calls-for-the-world-to-act-13463878",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-darfur-sudan_7071990.jpg?20251104180208",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-11-04 17:23:00",
        "Headline": "Thousands of people are thought to have been killed, with women raped and civilians kidnapped for ransom money. ",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  A genocide is unfolding in Darfur and the world must act, the Sudanese government has said.  Sudan's ambassador to the UK issued the stark warning at a news briefing in London after the fall of North Darfur capital Al Fashir to the paramilitary Rapid Support Forces (RSF). Multiple reports of atrocities are emerging from Darfur once again, 20 years after it first made headlines in a conflict the world said should never be repeated. Thousands are thought to have been killed, with women raped and civilians kidnapped for ransom. Ambassador Babikir Elamin said the world is just standing by. \"It certainly seems that the international community is either helpless or just not interested,\" he said. \"We need to stop this mayhem.\" He singled out the United Arab Emirates (UAE) for helping the RSF, labelling it the \"enabler of genocide\". \n                  Thousands targeted in 'killing fields' around Sudanese city in paramilitary group's hands\n                 \n                  Foreign secretary calls for immediate ceasefire in Sudan after reported massacre\n                 \n                  Tens of thousands killed in two days in Sudan city, analysts believe\n                 Britain has close ties to the UAE and British-supplied weapons are reported to have turned up on the battlefield in Sudan, allegedly supplied by the UAE.  \"The UK government must put pressure on the UAE,\" the ambassador said. \"It's well placed being a permanent member of the UN security council.\" A UAE official said it \"categorically rejects any claims of providing any form of support to either warring party since the onset of the civil war, and condemn atrocities committed by both Port Sudan Authority and RSF\". \"The latest UN Panel of Experts report makes clear that there is no substantiated evidence that the UAE has provided any support to RSF, or has any involvement in the conflict,\" a spokesperson said. \"Since the onset of the civil war, the UAE has consistently supported regional and international efforts to achieve an immediate ceasefire, protect civilians, and ensure accountability for violations committed by all warring parties. \"The UAE is part of the Quad which in September issued a joint statement calling for a three-month humanitarian truce to enable the swift entry of humanitarian aid to all parts of Sudan and to lead immediately to a permanent ceasefire. \"That statement also underlined that there is no military solution to the conflict in Sudan. Only a transition not controlled by the warring parties, leading to an independent civilian-led government, can secure Sudan's future.\" 'Ample time to act' Sudan has suffered a brutal civil war for more than two years. More than 150,000 people are thought to have died. And yet, other conflicts in Gaza and Ukraine have received far more attention. The RSF paramilitary rebel force besieged Al Fashir for 18 months, to the point of starvation, before capturing it. Residents resorted to eating animal feed and leather. An investigation by Sky News found the Sudanese forces made arrangements for their own safe passage from the city before it was captured. It is the conflict the world swore would never happen again, and yet it has. Twenty years ago, the Janjaweed militia committed a genocide killing 300,000 people. In their current iteration, the rebranded RSF are also running amok, once again. Ambassador Babikir told Sky News the world had \"ample time to act\" before history repeated itself. \"Janjaweed needs to be dealt with like we dealt with ISIS,\" he said. Read more:Inside the epicentre of Sudan's warThe men facing death to smuggle food to Sudan  The British government says events in Darfur are \"truly horrifying\" and threaten one of the worst humanitarian crises in the 21st century. Without more intervention from the international community, that crisis is only likely to deepen."
    },
    {
        "title": "Reflecting sunlight into space could 'buy time' against global warming - but experts warn of 'rogue nations' risk",
        "description": "Reducing the amount of sunlight reaching the Earth could take the edge off global warming and limit the damage caused by climate change, according to Britain's leading scientific body.",
        "url": "https://news.sky.com/story/reflecting-sunlight-into-space-could-buy-time-against-global-warming-but-experts-warn-of-rogue-nations-risk-13463849",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sea-clouds_7071989.jpg?20251104180119",
        "type": "World",
        "Author": "Thomas Moore",
        "Date Published": "2025-11-04 16:38:00",
        "Headline": "A nation going alone and attempting to dim sunlight in one region could cause extreme droughts and other weather disturbances elsewhere in the world, the report warns. ",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n Reducing the amount of sunlight reaching the Earth could take the edge off global warming and limit the damage caused by climate change, according to Britain's leading scientific body. But the Royal Society has warned that strategies aimed at bringing about these changes are not without risk. The society, which sparked the scientific revolution in the 17th century, said in a new report that bold new technology for reflecting sunlight back into space could \"buy time\" for cuts in fossil fuel emissions to take effect. It said two strategies - pumping reflective particles high in the atmosphere and spraying salt into clouds over the sea to make them whiter - are likely to be effective, as well as technically feasible. But the report's authors warn a rogue nation going alone, and attempting to dim sunlight in one region, could cause extreme droughts and other weather disturbances elsewhere in the world. Professor Keith Shine, chair of the report's working group, said there could nevertheless be a time when world leaders agree that solar radiation modification (SRM) is the least worst option. \"This is not a question of whether SRM is safe, as it is clearly not without risks,\" he said. \"However, there may come a point where those risks are seen to be less severe than the risks of insufficiently mitigated climate change.\" The report said global efforts to reduce greenhouse gas emissions look increasingly unlikely to stop global temperatures rising above 1.5C, considered by many scientists to be a \"safe\" limit.  A new round of UN climate talks will start later this week in Brazil, but under current policies, temperatures are likely to be at least 3C warmer than pre-industrial times by 2100. The working group ranked stratospheric aerosol injection as the most promising option for dimming the amount of sunlight reaching the Earth's surface. Planes would fly at high altitude, releasing sulphur dioxide gas, which would form particles that reflect a small amount of sunlight. There is real-world evidence that this could work. The 1991 eruption of Mount Pinatubo, a volcano in the Philippines, pumped 15 million tonnes of sulphur dioxide into the stratosphere, reducing the temperature by 0.5C for one to two years. Computer models suggest that releasing eight to 16 million tonnes of the gas from planes each year across both the northern and southern hemispheres could reduce the global temperature by 1C. Read more from Sky News:Brightest ever flare from supermassive black hole spottedWhy is COP30 so controversial? The likely cost would be \"in the low 10s of billions of dollars a year\", said Prof Shine. That's far less than the global cost of more extreme weather, wildfires, and other climate impacts. Hurricane Melissa, which was made more intense by global warming, cost up to $52bn (£39.9bn) in damage and economic losses across the western Caribbean, according to AccuWeather.  The Royal Society's report warns that SRM would not tackle the root cause of climate change, and is not an alternative to reducing emissions. But it could reduce temperatures while carbon dioxide levels in the atmosphere peak and begin to fall. It could mean SRM would need to be deployed for 100 years or more."
    },
    {
        "title": "Israel says it has received the body of another dead hostage from Gaza",
        "description": "Israel says it has received the body of a deceased hostage from Hamas. ",
        "url": "https://news.sky.com/story/israel-says-it-has-received-the-body-of-another-dead-hostage-from-gaza-13463928",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gaza-red-cross-hostage_7071910.jpg?20251104161440",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-04 19:27:00",
        "Headline": "If the latest remains are confirmed with genetic testing, it will mean the bodies of seven hostages remain in Gaza. ",
        "Content": "Israel says it has received the body of a deceased hostage from Hamas.  The Israeli Prime Minister's Office said it received the remains from the militant group via the Red Cross. A joint statement from the Israeli Defence Forces and the Israel Securities Authority said the coffin is being taken to the National Institute for Forensic Medicine, where identification procedures will be carried out. Hamas said earlier on Tuesday that it had found the body of an Israeli soldier in Shejaia, an eastern suburb of Gaza City, in an area still occupied by Israeli forces. Israel's statement did not indicate whether the remains were those of a soldier. Hamas said the body was found after Israel granted teams from the militant group and the International Committee of the Red Cross access to the location. Ahead of Tuesday's announcement, Hamas had returned the remains of 20 hostages since the current ceasefire deal began on 10 October. Under the deal, Hamas returned all 20 living hostages in exchange for nearly 2,000 Palestinians being held in Israel. The militant group also promised to give Israel the remains of the dead hostages but said it would be difficult to find the bodies under the rubble in Gaza. If genetic testing confirms the remains handed over on Tuesday, it would mean the bodies of seven other hostages are still in Gaza. For each Israeli hostage returned, Israel has released the remains of 15 Palestinians, handing over 270 bodies so far. Fewer than half have been identified. A lack of DNA testing kits in Gaza complicates forensic work and the enclave's health ministry posts photos of remains online in the hope families will recognise them.  The US-brokered ceasefire has largely held though the violence has not stopped completely. The Palestinian health authorities say Israeli strikes have killed 239 people since the truce took effect. Israel says three of its soldiers have been killed. Earlier on Tuesday, health authorities in Gaza said Israeli fire had killed a man in northern Gaza. Israel's military said it killed a \"terrorist\" who crossed into occupied areas and posed an imminent threat. Read more:Trump defends Israeli strikes in GazaIsraeli military's former top lawyer arrested The latest conflict began when Hamas-led militants killed around 1,200 people and took 251 hostages in their cross-border attack on Israel on October 7, 2023. Israel's retaliatory offensive in the Gaza Strip killed over 68,000 Palestinians, health officials in the enclave say. The figure does not break down the number of civilians and fighters."
    },
    {
        "title": "Prince William wins hearts as he cuddles baby handed to him on Brazilian island",
        "description": "Prince William has issued a call to action to \"governments, businesses and civil society\" to be \"united in purpose, bold in ambition, and unwavering in our commitment to a safer and healthier world\" ahead of COP30.",
        "url": "https://news.sky.com/story/prince-william-wins-hearts-as-he-cuddles-baby-handed-to-him-on-brazilian-island-13463964",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-brazil-william-baby_7071982.jpg?20251104174848",
        "type": "World",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-11-04 20:04:00",
        "Headline": "The future king charmed residents of Paqueta Island, cuddling 10-month-old Joaquim and meeting children while learning about mangrove conservation ahead of COP 30. ",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  Prince William has issued a call to action to \"governments, businesses and civil society\" to be \"united in purpose, bold in ambition, and unwavering in our commitment to a safer and healthier world\" ahead of COP30. In his first speech of his trip to Brazil this week, ahead of the UN's climate conference, he said: \"We must act together. Governments, businesses and civil society - each must now step up and play their role in developing solutions, scaling support, and shifting resources to where they are needed most.\" Addressing the audience at a United for Wildlife event in Rio de Janiero he added: \"Let us carry our determination forward - united in purpose, bold in ambition, and unwavering in our commitment to a safer and healthier world.\" The summit was put on by his royal foundation United for Wildlife, a global alliance focused on tackling wildlife crime. Featuring a surprise video from Leonardo DiCaprio, the key themes of the event were spotlighting the impact of environmental crime and amplifying the voices of indigenous people and local communities. William also travelled to the Brazilian island of Paqueta on Tuesday, a 50-minute ferry ride from Rio de Janeiro, to learn about its mangrove habitat and sample the slower pace of life on an island, where there are no private cars and bicycles are the main form of transport. But as dozens of well-wishers excitedly said hello to the future king, 10-month-old Joaquim Monteiro was handed to him for a hug. Joking with his family, William said \"mustn't drop him!\" before giving the little boy a cuddle. \n                  The underground squad with the lives of countless Ukrainian civilians in their hands\n                 \n                  Russian 'suicide drone' launches quadruple this year\n                 \n                  Genocide is unfolding in Darfur, warns Sudanese government - as it calls for the world to act\n                 Holding him with the confidence of a father of three young children, William said \"bless him\" before handing him back to his grandmother Christina. Andre Luis Junior, the baby's cousin and a teacher, said: \"Nobody asked him - he just picked him up. It's probably because he has three kids. He loves kids.\" He added: \"It's amazing. We are so happy, so happy he chose this very small island. We're very unique in the heart of Rio. Very quiet. We love that he chose to come here. The kids in school were so excited today.\" The prince helped several young children come to the front of the meet and greet in the main square by the waterfront, bending down to be in photographs with them and taking the occasional selfie. Read more from Sky News:Sir David Beckham receives knighthood from the KingSudan's government warns of genocide in Darfur The island, which only has around 5,000 residents, had declared the visit The Day Of The Prince, and children were given time off school to see him. William wanted to meet those involved in protecting the island's mangrove forests, a crucial ecosystem for preventing flooding, coastal erosion, providing a habitat for wildlife, and supporting the fishing community. He travelled on a boat into the Guapimirim mangrove to learn about the restoration work taking place there and helped with a planting activity as part of their reforestation scheme. The pictures will be particularly important to the prince and his team, emphasising why the world needs to focus minds on the climate crisis, ahead of his appearance at COP 30, the UN's climate conference in Belem, on Thursday."
    },
    {
        "title": "Rescuers in Nepal searching for bodies of seven climbers killed in Mount Yalung Ri avalanche",
        "description": "A French climber has said she was \"lucky\" to survive an avalanche in which her husband died, as rescue teams work to recover the bodies of seven people killed in the Himalayas on Monday morning.",
        "url": "https://news.sky.com/story/rescuers-in-nepal-searching-for-bodies-of-seven-climbers-killed-in-mount-yalung-ri-avalanche-13463648",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-kathmandu-nepal-avalanche_7071390.jpg?20251104091551",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-04 09:17:00",
        "Headline": "Workers began digging through ice and snow at the 16,000ft site on Tuesday to reach the remains of climbers and local guides.",
        "Content": "A French climber has said she was \"lucky\" to survive an avalanche in which her husband died, as rescue teams work to recover the bodies of seven people killed in the Himalayas on Monday morning. Isabelle Solange Thaon, one of two French climbers who survived the avalanche at the Mount Yalung Ri base camp, said she lost her husband, identified as Christian Manfred, on the mountain. Ms Thaon, 54, said she and Didier Armand, who were both flown by helicopter to the Era Hospital in Kathmandu, \"were lucky because we were on the left\". Speaking from her hospital bed, she said they climbed and swam until \"we were in the snow and after someone came immediately (to help). \"Unfortunately, Christian died... It was not possible because of rocks hit his head,\" she said, adding she was lucky because she was not covered by the snow piled up by the avalanche. \"The other people were under the snow, they said they think it was 6m (20ft) under snow, so it was completely dead in front. It was not possible to help them.\" Workers began digging through ice and snow on Tuesday to reach the remains of the group buried. \n                  Everest trekker Rob Mason describes lucky escape after hundreds stranded on mountain by blizzard\n                 \n                  Stranded Mount Everest hikers being evacuated\n                 \n                  Race to rescue hundreds stranded on Mount Everest\n                 The search area is located at a little over 4,900m (16,070ft), up the peak, which measures 5,600m (18,370ft) and is considered suitable for beginner climbers. Snowstorms prevented rescuers from reaching the site on the day of the avalanche, but in improving weather, a helicopter reached the base camp on Tuesday, allowing rescuers to begin digging through the snow and ice. Four climbers who were injured in the avalanche were rescued by the helicopter and flown to the capital Kathmandu for treatment, Dolkha district police chief Gyan Kumar Mahato said. Read more on Sky News:Air India crash survivor 'broken' by traumaSudan's 'killing fields'Russian 'suicide drone' launches quadruple this year Two Nepali mountain guides were among those killed, and, while the identity of the remaining four was still unclear, Mr Mahato said one of them is likely a French national. At least three bodies were pulled out of the snow by Tuesday afternoon, he said, but it was not clear when they would be brought down from the mountains."
    },
    {
        "title": "Former US vice president Dick Cheney dies",
        "description": "Former US vice president Dick Cheney, one of the leading advocates for the US waging the Iraq War, has died.",
        "url": "https://news.sky.com/story/former-us-vice-president-dick-cheney-dies-13463729",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-dick-cheney-george-bush_7071571.jpg?20251104112229",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-04 11:24:00",
        "Headline": "The Republican was one of the most polarising vice presidents in US history under George W Bush from 2001 to 2009, and was a leading advocate of the invasion of Iraq in 2003.",
        "Content": " Former US vice president Dick Cheney, one of the leading advocates for the US waging the Iraq War, has died. In a statement, his family said the 84-year-old was surrounded at the time of his death by his wife Lynne, daughters Liz and Mary, and other family members. He died from complications of pneumonia and cardiac and vascular disease, it said. The Republican was one of the most polarising vice presidents in US history under George W Bush from 2001 to 2009, and was one of the main foreign policy hawks ahead of the invasion of Iraq in 2003. With Mr Bush in the presidency, Mr Cheney was also one of the most powerful vice presidents in history, leading US policy after the 9/11 attacks, when America conducted the War on Terror, and shaping the administration's more assertive international approach. In later life, he became a target of Donald Trump, especially after his daughter, Liz Cheney, became the leading Republican critic and examiner of Mr Trump's actions surrounding the January 6, 2021, insurrection at the US Capitol. \"In our nation's 246-year history, there has never been an individual who was a greater threat to our republic than Donald Trump,\" Mr Cheney said in a TV advert for his daughter. \"He tried to steal the last election using lies and violence to keep himself in power after the voters had rejected him. He is a coward.\" Last year, he said he was voting for Kamala Harris, the Democratic candidate, to be president against Mr Trump. Mr Cheney survived five heart attacks and declared in 2013 he woke up each morning \"with a smile on my face, thankful for the gift of another day\". He previously served as defence secretary under Mr Bush's father, George HW Bush, directing the US-led military operation to expel Saddam Hussein's Iraqi occupying army from Kuwait in the first Gulf War. Before that, he had been Gerald Ford's chief of staff and served as a congressman for Wyoming in the House during the Reagan years. His family's statement said: \"For decades, Dick Cheney served our nation, including as White House Chief of Staff, Wyoming's Congressman, Secretary of Defense, and Vice President of the United States. \"Dick Cheney was a great and good man who taught his children and grandchildren to love our country, and to live lives of courage, honor, love, kindness, and fly fishing. \"We are grateful beyond measure for all Dick Cheney did for our country. \"And we are blessed beyond measure to have loved and been loved by this noble giant of a man.\" In a statement, Mr Bush described his former colleague as a \"decent, honourable man\" who would be remembered as \"among the finest public servants of his generation\". Mr Cheney was \"a patriot who brought integrity, high intelligence, and seriousness of purpose to every position he held\". As his vice-president, he was a \"calm and steady presence in the White House amid great national challenges. I counted on him for his honest, forthright counsel, and he never failed to give his best,\" he said. Former President Bill Clinton noted that while he \"often disagreed\" with Mr Cheney, he always \"respected his dedication to our country and his unwavering sense of duty\". He said: \"Throughout his long career in public service, Dick Cheney was guided by a deep belief that he was doing what was right for America.\" The Senate's Republican majority leader John Thune also paid tribute, saying: \"Dick Cheney was a lifelong public servant who believed very deeply in our country and brought his considerable knowledge and intelligence to its service.\" Senator John Barrasso of Wyoming wrote on X: \"Wyoming mourns the passing of Vice President Dick Cheney.\" He added: \"His unflinching leadership shaped many of the biggest moments in domestic and U.S. foreign policy for decades.\""
    },
    {
        "title": "Government shutdown: What impact is it having on everyday Americans?",
        "description": "The US government shutdown is approaching the record for the longest ever as the stand-off between the Democrats and Republicans on the Hill continues.",
        "url": "https://news.sky.com/story/government-shutdown-what-impact-is-it-having-on-everyday-americans-13463838",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-transportation-security_7071948.jpg?20251104170250",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-04 16:08:00",
        "Headline": "The shutdown, which started on 1 October, has affected millions of Americans who rely on support programmes normally funded by the federal government.",
        "Content": "The US government shutdown is approaching the record for the longest ever as the stand-off between the Democrats and Republicans on the Hill continues. The shutdown, triggered by lawmakers failing to pass new funding bills, began on 1 October, has affected millions of Americans who rely on support programmes normally funded by the federal government. By the end of 5 November, it will be the longest shutdown in US government history, beating the previous record of 35 days set during Donald Trump's first term in 2019, when he demanded Congress allocate money for his promised US-Mexico border wall. Healthcare is the principal sticking point for the two parties, but the ramifications of the shutdown go far beyond that, with critical federal services struggling to function. Here are some of the biggest impacts of the government shutdown so far. Flight delays piling up US airports are seeing a pile-up of flight delays due to staff shortages, as those who turn up are not being paid. \n                  Kentucky plane crash leaves at least four dead - with number expected to rise\n                 \n                  Former US vice president Dick Cheney dies\n                 \n                  Zohran Mamdani: Could 'Trump's worst nightmare' show how to take fight to president?\n                 More than 3.2 million passengers have had flights delayed or cancelled due to air traffic control staffing issues since the shutdown began, according to Airlines for America, which represents some of the biggest airlines in the country. Air traffic controllers, who coordinate aircraft within the airspace, and Transportation Security Administration (TSA) officers are classed as essential workers, meaning they must keep operating even though they don't get paid until after it resumes. It means nearly 13,000 air traffic controllers have been working without pay for weeks, according to the Federal Aviation Administration (FAA), along with 50,000 TSA officers. Transportation Secretary Sean Duffy told CNBC on 3 November: \"None of them can miss two paycheques. \"Their home finances fall apart, and they're all going to have to look at taking second jobs or quitting and getting into another line of work. And the consequence of that is very real for our air system.\" And the next day he blamed Democrats for the shutdown - Republicans currently have a majority in both houses - and told ABC: \"So if, if you bring us to a week from today, Democrats, you will see mass chaos. \"You will see mass flight delays. You'll see mass cancellations, and you may see us close certain parts of the airspace, because we just cannot manage it because we don't have the air traffic controllers.\" The FAA was already dealing with a long-standing shortage of about 3,000 air traffic controllers before the shutdown. Many have questioned the safety of air travel amid such shortages, but the flights are intentionally slowed down amid staff shortages to make them more manageable. Mr Duffy suggested the delays would become more extreme the longer the shutdown went on, with staff being \"confronted with a decision\" on whether they should stop turning up for work. Food stamps reduced for millions of Americans The shutdown is affecting the 42 million Americans who receive benefits from the Supplemental Nutrition Assistance Programme (SNAP). The federal programme provides food benefits, also known as food stamps, to low-income families to supplement their grocery budget so they can afford more nutritious food than they would otherwise be able to afford. The government planned to freeze payments to the programme, estimated to cost $8bn per month nationally, starting 1 November, saying it could no longer keep funding it due to the shutdown. Judges halted the move and said the Trump administration would need to at least partially fund it. The government has indicated it will use an emergency fund of $4.65bn to cover about half of the normal benefits. Payments for November had already been delayed for millions of people, and now they will only receive half of their usual benefits. Many Democrats suggest the government can afford to make the full payments during the shutdown but is choosing not to. House Democratic leader Hakeem Jeffries has accused Mr Trump and Republicans of attempting to \"weaponise hunger\" to pressure political rivals into accepting their funding proposals. Whatever the reasons, the impact on struggling families is already being felt. Senate Minority Leader Chuck Schumer said in a floor speech on Monday 3 November: \"The stories from this weekend were shameful, sickening. \"People overwhelming food banks, handing out groceries in lieu of Halloween candy, teachers paying out of pocket to give their students extra food. Across America, appalling scenes were seen of people worried they wouldn't be able to feed their families and even themselves.\" 👉 Follow Trump100 on your podcast app 👈  Corina Betancourt, from Arizona, a single mum with three children aged between eight and 11, says the SNAP benefits being reduced and delayed means she will need to rely more on her local food bank and find ways to stretch what she has further. She says she is worried that there won't be enough for her children to eat with about $400 this month instead of around $800. \"We always make things work somehow, some way,\" she adds. Federal workers missing paycheques Some federal employees have turned to food banks as they are going without pay until the shutdown ends. Roughly 750,000 of them have been furloughed, meaning they are on an unpaid leave of absence and can look for temporary jobs, but others, like aviation staff, are considered essential employees who are contracted to carry on working for the government even if they aren't being paid. Anthony Speight, who is furloughed for the first time in his 17 years as a federal employee, told Sky News' US partner NBC News that he \"never thought\" he would have to ask the community for help, but was going to a food bank at the end of October. \"Bills continue to pile up. I have car notes, I have children to feed, I have a family to take care of, I have a mortgage to pay, so it's a lot of uncertainty,\" he said. Read more:Who is the 34-year-old socialist tipped to be New York City's next mayor?'A noble giant of a man': Former US vice president Dick Cheney dies The Trump administration has taken steps to continue paying US troops, federal law enforcement agents and immigration officers. Members of Congress continue to receive pay during the shutdown under the Constitution's laws, though a handful of lawmakers have asked that their pay be withheld until the shutdown is resolved. Heating help for low-income homes at risk With temperatures beginning to drop across the US, some states are warning that funding for a programme which helps millions of low-income households pay to heat and cool their homes is also taking a hit. The $4.1bn Low-Income Home Energy Assistance Programme (LIHEAP) helps 5.9 million households across all states, but federal funding is now delayed at a concerning time for those who rely on it. \"The impact, even if it's temporary, on many of the nation's poor families is going to be profound if we don't solve this problem,\" said Mark Wolfe, executive director of the National Energy Assistance Directors Association, which represents state directors of the programme. Many of those who are supported by LIHEAP also rely on food stamps. Centres for preschool children lose funding Head Start centres, which serve tens of thousands of the nation's most in-need preschool children, have stopped receiving federal funding. The early education initiative provides centres as an alternative to preschool to children up to the age of five from low-income households, homeless or in foster care, where they are fed two meals a day and receive therapy vital to their development. But without federal funding, some have closed indefinitely, while others are staying afloat with emergency funding from local governments and school districts. Keiliana Porter, a mother of three from Ohio, had to break the news to her four-year-old twins, Kalani and Kanoelani, that they could not return to school Monday. \"It was like I was punishing them,\" she said. \"They just don't understand, and that's the hardest thing.\""
    },
    {
        "title": "Kentucky plane crash leaves at least four dead - with number expected to rise",
        "description": "At least four people have died after a cargo plane crashed near an airport in Kentucky.",
        "url": "https://news.sky.com/story/cargo-plane-crashes-at-airport-in-kentucky-13464102",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-kentucky-louisville_7072353.jpg?20251105011347",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-04 22:50:00",
        "Headline": "The accident involving a UPS cargo plane led to all flights in and out of the airport, Louisville International, being suspended.",
        "Content": " At least four people have died after a cargo plane crashed near an airport in Kentucky. Police are attending the scene of the accident near Louisville Muhammad Ali International Airport, with images from the scene showing large fires burning and smoke billowing into the air. Speaking at a news conference, Kentucky governor Andy Beshear described the incident as \"catastrophic\" and urged local residents to obey any shelter-in-place orders. \"We believe we have at least three fatalities - and I believe that number is going to get larger,\" he said. \"We have at least 11 injuries, some of which are very significant.\" Those injured were said to be on the ground. At a later press conference, local police confirmed that four people had died and 11 had been taken to hospital. Mr Beshear added earlier that two employees on the ground are missing after the incident, and that two buildings on the ground were affected. Other authorities said that the plane was carrying 38,000 gallons of fuel at the time of the crash. The US Federal Aviation Authority (FAA) said the crash happened around 5.15pm local time (10.15pm UK time) as the plane left the airport, bound for Honolulu in Hawaii. It added that the aircraft was a McDonnell Douglas MD-11 plane, primarily used by cargo airlines. In a statement on its website, CPS said three people were on board the plane at the time of the crash. Louisville International Airport is also home to UPS Worldport, the delivery firm's largest package handling facility in the world. The airport said all arriving and departing flights are temporarily suspended, that the airfield is closed, and warned passengers should closely monitor their flights. Read more from Sky News:Could this be New York City's next mayor?Analysis: Dick Cheney believed history would vindicate him Sky's US correspondent David Blevins noted that the incident occurred during the US government shutdown, meaning the budget for paying air traffic controllers has not been finalised. The failure to reopen the federal government after 35 days has, he said, resulted \"in a shortage of staff\" and added: \"There will be many questions asked in the coming days by the National Transportation Safety Authority about what exactly has gone wrong.\""
    },
    {
        "title": "Former US vice president Dick Cheney dies",
        "description": "Former US vice president Dick Cheney, one of the leading advocates for the US waging the Iraq War, has died.",
        "url": "https://news.sky.com/story/former-us-vice-president-dick-cheney-dies-13463729",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-dick-cheney-george-bush_7071571.jpg?20251104112229",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-04 11:24:00",
        "Headline": "The Republican was one of the most polarising vice presidents in US history under George W Bush from 2001 to 2009, and was a leading advocate of the invasion of Iraq in 2003.",
        "Content": " Former US vice president Dick Cheney, one of the leading advocates for the US waging the Iraq War, has died. In a statement, his family said the 84-year-old was surrounded at the time of his death by his wife Lynne, daughters Liz and Mary, and other family members. He died from complications of pneumonia and cardiac and vascular disease, it said. The Republican was one of the most polarising vice presidents in US history under George W Bush from 2001 to 2009, and was one of the main foreign policy hawks ahead of the invasion of Iraq in 2003. With Mr Bush in the presidency, Mr Cheney was also one of the most powerful vice presidents in history, leading US policy after the 9/11 attacks, when America conducted the War on Terror, and shaping the administration's more assertive international approach. In later life, he became a target of Donald Trump, especially after his daughter, Liz Cheney, became the leading Republican critic and examiner of Mr Trump's actions surrounding the January 6, 2021, insurrection at the US Capitol. \"In our nation's 246-year history, there has never been an individual who was a greater threat to our republic than Donald Trump,\" Mr Cheney said in a TV advert for his daughter. \"He tried to steal the last election using lies and violence to keep himself in power after the voters had rejected him. He is a coward.\" Last year, he said he was voting for Kamala Harris, the Democratic candidate, to be president against Mr Trump. Mr Cheney survived five heart attacks and declared in 2013 he woke up each morning \"with a smile on my face, thankful for the gift of another day\". He previously served as defence secretary under Mr Bush's father, George HW Bush, directing the US-led military operation to expel Saddam Hussein's Iraqi occupying army from Kuwait in the first Gulf War. Before that, he had been Gerald Ford's chief of staff and served as a congressman for Wyoming in the House during the Reagan years. His family's statement said: \"For decades, Dick Cheney served our nation, including as White House Chief of Staff, Wyoming's Congressman, Secretary of Defense, and Vice President of the United States. \"Dick Cheney was a great and good man who taught his children and grandchildren to love our country, and to live lives of courage, honor, love, kindness, and fly fishing. \"We are grateful beyond measure for all Dick Cheney did for our country. \"And we are blessed beyond measure to have loved and been loved by this noble giant of a man.\" In a statement, Mr Bush described his former colleague as a \"decent, honourable man\" who would be remembered as \"among the finest public servants of his generation\". Mr Cheney was \"a patriot who brought integrity, high intelligence, and seriousness of purpose to every position he held\". As his vice-president, he was a \"calm and steady presence in the White House amid great national challenges. I counted on him for his honest, forthright counsel, and he never failed to give his best,\" he said. Former President Bill Clinton noted that while he \"often disagreed\" with Mr Cheney, he always \"respected his dedication to our country and his unwavering sense of duty\". He said: \"Throughout his long career in public service, Dick Cheney was guided by a deep belief that he was doing what was right for America.\" The Senate's Republican majority leader John Thune also paid tribute, saying: \"Dick Cheney was a lifelong public servant who believed very deeply in our country and brought his considerable knowledge and intelligence to its service.\" Senator John Barrasso of Wyoming wrote on X: \"Wyoming mourns the passing of Vice President Dick Cheney.\" He added: \"His unflinching leadership shaped many of the biggest moments in domestic and U.S. foreign policy for decades.\""
    },
    {
        "title": "Government shutdown: What impact is it having on everyday Americans?",
        "description": "The US government shutdown is approaching the record for the longest ever as the stand-off between the Democrats and Republicans on the Hill continues.",
        "url": "https://news.sky.com/story/government-shutdown-what-impact-is-it-having-on-everyday-americans-13463838",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-transportation-security_7071948.jpg?20251104170250",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-04 16:08:00",
        "Headline": "The shutdown, which started on 1 October, has affected millions of Americans who rely on support programmes normally funded by the federal government.",
        "Content": "The US government shutdown is approaching the record for the longest ever as the stand-off between the Democrats and Republicans on the Hill continues. The shutdown, triggered by lawmakers failing to pass new funding bills, began on 1 October, has affected millions of Americans who rely on support programmes normally funded by the federal government. By the end of 5 November, it will be the longest shutdown in US government history, beating the previous record of 35 days set during Donald Trump's first term in 2019, when he demanded Congress allocate money for his promised US-Mexico border wall. Healthcare is the principal sticking point for the two parties, but the ramifications of the shutdown go far beyond that, with critical federal services struggling to function. Here are some of the biggest impacts of the government shutdown so far. Flight delays piling up US airports are seeing a pile-up of flight delays due to staff shortages, as those who turn up are not being paid. \n                  Kentucky plane crash leaves at least four dead - with number expected to rise\n                 \n                  Former US vice president Dick Cheney dies\n                 \n                  Zohran Mamdani: Could 'Trump's worst nightmare' show how to take fight to president?\n                 More than 3.2 million passengers have had flights delayed or cancelled due to air traffic control staffing issues since the shutdown began, according to Airlines for America, which represents some of the biggest airlines in the country. Air traffic controllers, who coordinate aircraft within the airspace, and Transportation Security Administration (TSA) officers are classed as essential workers, meaning they must keep operating even though they don't get paid until after it resumes. It means nearly 13,000 air traffic controllers have been working without pay for weeks, according to the Federal Aviation Administration (FAA), along with 50,000 TSA officers. Transportation Secretary Sean Duffy told CNBC on 3 November: \"None of them can miss two paycheques. \"Their home finances fall apart, and they're all going to have to look at taking second jobs or quitting and getting into another line of work. And the consequence of that is very real for our air system.\" And the next day he blamed Democrats for the shutdown - Republicans currently have a majority in both houses - and told ABC: \"So if, if you bring us to a week from today, Democrats, you will see mass chaos. \"You will see mass flight delays. You'll see mass cancellations, and you may see us close certain parts of the airspace, because we just cannot manage it because we don't have the air traffic controllers.\" The FAA was already dealing with a long-standing shortage of about 3,000 air traffic controllers before the shutdown. Many have questioned the safety of air travel amid such shortages, but the flights are intentionally slowed down amid staff shortages to make them more manageable. Mr Duffy suggested the delays would become more extreme the longer the shutdown went on, with staff being \"confronted with a decision\" on whether they should stop turning up for work. Food stamps reduced for millions of Americans The shutdown is affecting the 42 million Americans who receive benefits from the Supplemental Nutrition Assistance Programme (SNAP). The federal programme provides food benefits, also known as food stamps, to low-income families to supplement their grocery budget so they can afford more nutritious food than they would otherwise be able to afford. The government planned to freeze payments to the programme, estimated to cost $8bn per month nationally, starting 1 November, saying it could no longer keep funding it due to the shutdown. Judges halted the move and said the Trump administration would need to at least partially fund it. The government has indicated it will use an emergency fund of $4.65bn to cover about half of the normal benefits. Payments for November had already been delayed for millions of people, and now they will only receive half of their usual benefits. Many Democrats suggest the government can afford to make the full payments during the shutdown but is choosing not to. House Democratic leader Hakeem Jeffries has accused Mr Trump and Republicans of attempting to \"weaponise hunger\" to pressure political rivals into accepting their funding proposals. Whatever the reasons, the impact on struggling families is already being felt. Senate Minority Leader Chuck Schumer said in a floor speech on Monday 3 November: \"The stories from this weekend were shameful, sickening. \"People overwhelming food banks, handing out groceries in lieu of Halloween candy, teachers paying out of pocket to give their students extra food. Across America, appalling scenes were seen of people worried they wouldn't be able to feed their families and even themselves.\" 👉 Follow Trump100 on your podcast app 👈  Corina Betancourt, from Arizona, a single mum with three children aged between eight and 11, says the SNAP benefits being reduced and delayed means she will need to rely more on her local food bank and find ways to stretch what she has further. She says she is worried that there won't be enough for her children to eat with about $400 this month instead of around $800. \"We always make things work somehow, some way,\" she adds. Federal workers missing paycheques Some federal employees have turned to food banks as they are going without pay until the shutdown ends. Roughly 750,000 of them have been furloughed, meaning they are on an unpaid leave of absence and can look for temporary jobs, but others, like aviation staff, are considered essential employees who are contracted to carry on working for the government even if they aren't being paid. Anthony Speight, who is furloughed for the first time in his 17 years as a federal employee, told Sky News' US partner NBC News that he \"never thought\" he would have to ask the community for help, but was going to a food bank at the end of October. \"Bills continue to pile up. I have car notes, I have children to feed, I have a family to take care of, I have a mortgage to pay, so it's a lot of uncertainty,\" he said. Read more:Who is the 34-year-old socialist tipped to be New York City's next mayor?'A noble giant of a man': Former US vice president Dick Cheney dies The Trump administration has taken steps to continue paying US troops, federal law enforcement agents and immigration officers. Members of Congress continue to receive pay during the shutdown under the Constitution's laws, though a handful of lawmakers have asked that their pay be withheld until the shutdown is resolved. Heating help for low-income homes at risk With temperatures beginning to drop across the US, some states are warning that funding for a programme which helps millions of low-income households pay to heat and cool their homes is also taking a hit. The $4.1bn Low-Income Home Energy Assistance Programme (LIHEAP) helps 5.9 million households across all states, but federal funding is now delayed at a concerning time for those who rely on it. \"The impact, even if it's temporary, on many of the nation's poor families is going to be profound if we don't solve this problem,\" said Mark Wolfe, executive director of the National Energy Assistance Directors Association, which represents state directors of the programme. Many of those who are supported by LIHEAP also rely on food stamps. Centres for preschool children lose funding Head Start centres, which serve tens of thousands of the nation's most in-need preschool children, have stopped receiving federal funding. The early education initiative provides centres as an alternative to preschool to children up to the age of five from low-income households, homeless or in foster care, where they are fed two meals a day and receive therapy vital to their development. But without federal funding, some have closed indefinitely, while others are staying afloat with emergency funding from local governments and school districts. Keiliana Porter, a mother of three from Ohio, had to break the news to her four-year-old twins, Kalani and Kanoelani, that they could not return to school Monday. \"It was like I was punishing them,\" she said. \"They just don't understand, and that's the hardest thing.\""
    },
    {
        "title": "Iraq war and interrogations: Why Dick Cheney's legacy will be a divisive one",
        "description": "Dick Cheney's life reflected the paradox of power - how strength can protect a nation but also endanger its principles.",
        "url": "https://news.sky.com/story/skilled-but-divisive-dick-cheneys-life-reflected-the-paradox-of-power-13463830",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-dick-cheney-george_7072079.jpg?20251104200844",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-11-04 15:45:00",
        "Headline": "Despite enjoying a long and varied career of public service, Mr Cheney, a staunch defender of American values, may be remembered as someone seen as a threat to them while in the White House.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  Dick Cheney's life reflected the paradox of power - how strength can protect a nation but also endanger its principles. Over 50 years in public service, he became known as a skilled political strategist and one of the most divisive figures to hold office. His rise began back in 1975, when he served as the youngest-ever White House chief of staff under President Gerald Ford. Calm, organised and loyal, he was credited with helping to stabilise the White House after the Watergate scandal. Later, as a congressman from Wyoming, he built a reputation as a reliable conservative who believed in limited government, low taxes and strong defence. As Secretary of Defence, under George Bush Snr, Dick Cheney oversaw Operation Desert Storm, the first Gulf War. The swift victory of the US-led coalition, driving Iraqi forces from Kuwait, earned him respect in national security circles. He left government briefly, becoming CEO of the energy giant Halliburton, a move that would later fuel accusations of conflict of interest. When George W Bush chose him as his running mate in 2000, his influence expanded dramatically, especially after the 9/11 attacks. He re-shaped national security policy, creating the Department of Homeland Security and driving what became known as the \"war on terror\". He pushed for the invasion of Afghanistan and Iraq and the use of harsh interrogation methods, and expanded government surveillance. Read more from Sky News:Could 'Trump's worst nightmare' become New York's mayor?Wild At Heart star Diane Ladd dies aged 89 Deemed the chief architect of the invasion of Iraq, he insisted Saddam Hussein held weapons of mass destruction, a claim later proven to be false. Critics accused him of overstepping the law and misleading the country, and he became a symbol of unchecked executive power. Sound familiar? In recent years, he emerged as an unlikely critic of Donald Trump, condemning the US president's disregard of the constitution. It was, to many, a remarkable stance for a man long accused of overstepping constitutional boundaries himself. Some will remember him as a disciplined strategist who understood the levers of government more deeply than most of his peers. To others, he embodied a strain of American conservatism so focused on strength that it dismisses public transparency as weakness. Dick Cheney left office with historically low approval ratings but remained unrepentant, arguing history would vindicate him. He had certainly claimed his place in it, having risen from low-profile bureaucrat to the most influential of US vice presidents."
    },
    {
        "title": "Wild at Heart actress Diane Ladd dies aged 89",
        "description": "American actress and Wild at Heart star Diane Ladd has died aged 89.",
        "url": "https://news.sky.com/story/wild-at-heart-actress-diane-ladd-dies-aged-89-13463568",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-diane-ladd-wildatheart_7071280.jpg?20251104072403",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-04 07:14:00",
        "Headline": "Ladd, mother of Jurassic Park actress Laura Dern, was a triple Academy Award nominee for films including Rambling Rose.",
        "Content": "American actress and Wild at Heart star Diane Ladd has died aged 89. Laura Dern, Ladd's daughter who is also an actress, announced her mother's death on Monday. Ladd was a triple Academy Award nominee for her supporting roles in Alice Doesn't Live Here Anymore, Wild at Heart and Rambling Rose. She also starred in 1973 film White Lightning and HBO's Enlightened in 2011 with her daughter. Often, they played mother and daughter together. For the 1991 drama Rambling Rose they were the first, and only, mother and daughter duo to receive Oscar nominations for the same film in the same year. 'She doesn't care what anybody thinks' Ms Dern, who starred in Jurassic Park, said of her mother in 2019: \"She is just the greatest actress, ever. You don't even use the word brave because she just shows up like that in life. She doesn't care what anybody thinks. \"She leads with a boundarylessness.\" In 2023 they released a joint memoir together titled Honey, Baby, Mine: A Mother and Daughter Talk Life, Death, Love. Read more from Sky News:Diane Keaton's family issue statement as cause of death givenThieves steal more than 1,000 items from museum The book was based on their conversations together during daily walks after Ladd was given only months to live, after she was diagnosed with lung disease. Ms Dern said at the time: \"The more we talked and the deeper and more complicated subjects we shared, my mother got better and better and better. \"It's been a great gift.\" Ladd was married three times and worked into her 80s."
    },
    {
        "title": "Chancellor Rachel Reeves blames other people's mistakes for her predicament but she bears some responsibility",
        "description": "To say this wasn't the plan is an understatement.",
        "url": "https://news.sky.com/story/chancellor-rachel-reeves-blames-other-peoples-mistakes-for-her-predicament-but-she-bears-some-responsibility-13463846",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-reeves-chancellor-budget_7072075.jpg?20251104201305",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-11-04 16:34:00",
        "Headline": "The rigid fiscal rules that Ms Reeves herself established are a key component.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  To say this wasn't the plan is an understatement. When Rachel Reeves said last year (and many times since) that she had no intention of coming back to the British people with yet more tax rises, she meant it. Money blog: Infamous trader bets millions on AI bubble bursting But now the question ahead of the budget later this month is not so much whether taxes will rise, but which taxes, and by how much? Indeed, there's growing speculation that the chancellor will be forced to break her manifesto pledge not to raise the rates of income tax, national insurance or VAT.  Her argument, made in her news conference on Tuesday morning, is that she is in this position in large part because of other people's mistakes, primarily those of the Conservative Party. But while it's certainly true that a significant chunk of the likely downgrade to her fiscal position reflects the fact that the \"trend growth rate\" - the average speed of productivity growth - has dropped in recent years due to all sorts of issues, including Brexit, COVID-19 and the state of the labour market, she certainly bears some responsibility. A problem that is some of her own making \n                  Why Chancellor Rachel Reeves chose 'shock and awe' 8am news conference\n                 \n                  Chancellor Rachel Reeves refuses to rule out manifesto-breaking tax hikes\n                 \n                  Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today\n                 First off, she established the fiscal rules against which she is being marked by the Office for Budget Responsibility. Second, she decided to leave herself only a wafer-thin margin against those rules. Third, even if it weren't for the OBR's productivity downgrade, it's quite likely the chancellor would have broken those fiscal rules, due to the various U-turns by the government on welfare reforms, winter fuel, and extra giveaways they haven't yet provided the funding for, such as reversing the two-child benefit cap.   Now, at this stage, no one, save for the Treasury and the Office for Budget Responsibility, really knows the scale of the task facing the chancellor. And in the coming weeks, those numbers could change significantly. But it's becoming increasingly clear, from the political signalling if nothing else, that the government is rolling the pitch for bad news later this month. Indeed, for all that this government pledged to bring an end to austerity, a combination of higher taxes and lower spending will be highly unpopular, not to mention deeply controversial. And while the chancellor will seek to blame her predecessors, it remains to be seen whether the public will be entirely convinced. "
    },
    {
        "title": "Post Office hero Bates lands seven-figure Horizon payout",
        "description": "Sir Alan Bates has reached a seven-figure deal to settle his claim over the Post Office Horizon scandal, more than 20 years after he began campaigning over what turned into one of Britain's biggest miscarriages of justice.",
        "url": "https://news.sky.com/story/post-office-hero-bates-lands-seven-figure-horizon-payout-13463596",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sir-alan-bates-post-office_6946261.jpg?20250619204329",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-04 08:08:00",
        "Headline": "Sir Alan Bates, who led the fight for justice for victims of the Horizon IT scandal, has had his claim settled by the government more than 20 years after he began campaigning on the issue, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n  Sir Alan Bates has reached a seven-figure deal to settle his claim over the Post Office Horizon scandal, more than 20 years after he began campaigning over what turned into one of Britain's biggest miscarriages of justice. Sky News has learnt that the government has agreed a deal with the former sub-postmaster after handing him what he described as a \"take it or leave it\" offer during the spring. Sir Alan has previously said publicly that that proposal amounted to 49.2% of his original claim. One source suggested that his final settlement may have been worth between £4m and £5m, implying that Sir Alan's claim could have been in the region of £10m, although those figures could not be corroborated on Tuesday morning. A government spokesperson said: \"We pay tribute to Sir Alan Bates for his long record of campaigning on behalf of victims and have now paid out over £1.2bn to more than 9,000 victims. \"We can confirm that Sir Alan's claim has reached the end of the scheme process and been settled.\" Sky News has attempted to reach Sir Alan for comment about the settlement of his claim. Read more:Victims say they're treated like 'second class citizens' Who are the key figures in the scandal?Victim died days before compensation letter arrived Sir Alan led efforts over many years to prove that the Horizon software system supplied by Fujitsu, the Japanese technology company, was faulty. Hundreds of sub-postmasters were wrongly prosecuted between 1999 and 2015, with scores of people either ending their own lives or making attempts to do so. However, it was only after ITV turned their fight for justice into a drama, Mr Bates Vs The Post Office, that the government accelerated plans to deliver redress to victims. Even so, the compensation scheme set up to administer redress has been mired in controversy.  Writing in The Sunday Times in May, Sir Alan described the process as \"quasi-kangaroo courts in which the Department for Business and Trade sits in judgement of the claims and alters the goalposts as and when it chooses\". \"Claims are, and have been, knocked back on the basis that legally you would not be able to make them, or that the parameters of the scheme do not extend to certain items.\" Sir Alan had previously been made compensation offers worth just one-sixth of his claim - which he had labelled \"derisory\", with a second offer amounting to a third of the sum he was seeking. Sir Ross Cranston, a former High Court judge, adjudicates on cases where a claimant disputes a compensation offer from the government and then objects to the results of a review by an independent panel. In 2017, Sir Alan and a group of 555 sub-postmasters sued the Post Office in the High Court, ultimately winning a £58m settlement. However, swingeing legal fees left the group with just £12m of that sum, prompting ministers to establish a separate compensation scheme amid a growing outcry. A significant number of other sub-postmasters have also complained publicly about the pace, and outcome, of the compensation process.  The first volume of Sir Wyn Williams's public inquiry into the Horizon scandal was published in July, and concluded that at least 13 people may have taken their own lives after being accused of wrongdoing, even though the Post Office and Fujitsu knew the Horizon system was flawed. The miscarriage of justice left the Post Office's reputation, and that of former bosses including chief executive Paula Vennells, in tatters. A subsequent corporate governance mess under the last government further dragged the Post Office's name through the mud, with the then chief executive, Nick Read, accused of being absorbed by his own remuneration. In recent months, the government has outlined a further redress scheme aimed at compensating victims of the Capture accounting software which was in use at Post Offices between 1992 and 2000. Since then, a new management team has been appointed and has set the objective of boosting postmasters' pay and overhauling technology systems to enable Post Office branches to offer a broader range of services."
    },
    {
        "title": "Why Chancellor Rachel Reeves chose 'shock and awe' 8am news conference",
        "description": "To understand why Rachel Reeves stood up at 8am in Downing Street in an unprecedented news conference to foreshadow the budget, you need to understand the depth of the problems facing the chancellor.",
        "url": "https://news.sky.com/story/why-chancellor-rachel-reeves-chose-shock-and-awe-8am-news-conference-13463679",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves_7071771.jpg?20251104165428",
        "type": "Business",
        "Author": "Sam Coates",
        "Date Published": "2025-11-04 10:12:00",
        "Headline": "Rachel Reeves is battling for her own credibility - and ultimately, the survival of Sir Keir Starmer's government.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  To understand why Rachel Reeves stood up at 8am in Downing Street in an unprecedented news conference to foreshadow the budget, you need to understand the depth of the problems facing the chancellor. In 22 days, she must perform the biggest U-turn it is possible for a chancellor to make. She must hike taxes to the tune of tens of billions of pounds, having promised in the election manifesto that this would not be necessary, and reiterated this promise under a year ago after an initial £40bn of rises.  Not many inhabitants of Number 11 would stay in post if they had to make such a pivot. But Sir Keir Starmer cannot lose her and know for sure that he also stays in place. So Ms Reeves is battling for her credibility - and ultimately the survival of this government. The stakes are high. Politics latest: Reeves refuses to rule out manifesto-breaking tax rises \n                  Chancellor Rachel Reeves refuses to rule out manifesto-breaking tax hikes\n                 \n                  Budget 2025: Reeves vows to 'defy' gloomy forecasts - but faces income tax warning\n                 So back to this morning. Ever since the summer, those in Westminster have known tax rises are on the way in the autumn budget. A Treasury source told me that pitch-rolling for the budget began in July - yet their issue is that to date, almost no-one had noticed. The subject of the budget was an omerta as recently as the Labour conference a month ago - it simply wasn't on the agenda in Liverpool. The first public acknowledgement that she was looking at taxes was in an interview with me on Sky News three weeks ago. She has intermittently revisited the subject subsequently, but quite bluntly, the public haven't yet noticed. As recently as last week, people in the Treasury were acknowledging to me that the public are as yet unprepared for the tax shock expected on the scale on 26 November. So this morning's event was designed to be shock and awe - an 8am news conference is designed to jolt Westminster and the viewing public to attention, because inside the Treasury they are \"desperate\" - their words - to get the public watching.  The format allows her to look in control, like a stateswoman in Downing Street making arguments on her terms, even though these are arguments she has been forced into. So the job of this morning was to educate the public that tax rises are coming, but also put them on notice that this could involve a breach of manifesto promises by raising one of income tax, national insurance, corporation tax or VAT - and then to try and lay the blame anywhere but at the feet of this government. She also wants to give some hope - by giving a sense of what priorities she would protect. So what to make of the arguments she made? 'The impact of Tory austerity, their botched Brexit deal and the pandemic on Britain's productivity is worse than feared' Is it really all the Tories fault? Ms Reeves made an argument today about how lower growth is responsible for Britain's economic ills, and listed causes with a long tale going back many years for it. This is true, but isn't strictly the reason for her problems at this budget. On 26 November, she must fill a £20bn-£30bn \"black hole\" - that's the extent to which she is in on course to breach her own self-imposed borrowing limits, known as fiscal rules. Many of the components of the black hole cannot be put at the door of the Tories. Here's why: She must find £10bn to account for policy decisions the government has been pushed into - a failure to push through welfare reform, a U-turn on winter fuel payments, a likely rollover of fuel duty. She is likely to have to find a further £5bn for decisions she is likely to take - scrapping of the two-child benefit cap, help for energy bills and an emergency injection for redundancy bills and strike coverage costs. So £15bn of the black hole cannot be blamed on the Tories.  A further £2bn-£4bn for additional debt interest costs is a consequence of the higher borrowing just since the March spring statement - again not the Tories' fault - and also wants £10bn to give herself a bigger buffer to exit the doom loop. Ms Reeves has greater scope to argue that the productivity review has longer-term causes, but this is likely to be offset by better wage news, and there is an argument that Labour could have foreseen the productivity downgrade before the election because the Office for Budget Responsibility figures were out of line with other forecasters. So this is a tricky case to sustain, even though the government has no choice but to make it.  👉Listen to Politics At Sam And Anne's on your podcast app👈 'Protecting our NHS, reducing our national debt and improving the cost of living' The news is grim - but this is the chancellor's promise of what she is going to prioritise. But what does this amount to? NHS: I understand this is not a promise of new money for waiting lists in this budget. Ms Reeves is actually making a political argument about the need to not U-turn on last year's £22bn a year NHS investment - although the public may not hear it. Cost of living: Partly this is an argument about investment already made in things like breakfast clubs. But with CPI inflation at 4.1%, it's a major concern - but not one that can be tackled without government spending many billions. There will be some help for energy bills, but not the tens of billions that Liz Truss put towards such schemes. So this risks disappointment.  Reducing debt: It is not about to go down. Her fiscal rules mean she is going to be reducing debt as a percentage of GDP - and even then, only debt on some things, as the fiscal rules spell out some exemptions. So the actual amount we borrow from the markets will continue to grow. Does it work? Today is about saying with a louder megaphone things we already knew. She declined to say whether ultimately she will break the manifesto, or what will happen. She has, however, candidly started a conversation that needed to begin."
    },
    {
        "title": "Former cost of living tsar Buttress quits Ovo after 18 months",
        "description": "The chief executive of Ovo Energy, one of Britain's biggest energy suppliers, is to step down in the middle of a search for investors to pump hundreds of millions of pounds into the company.",
        "url": "https://news.sky.com/story/former-cost-of-living-tsar-buttress-quits-ovo-after-18-months-13463875",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ovo-energy-power_7032894.jpg?20250927100440",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-04 17:12:00",
        "Headline": "David Buttress, who joined Ovo Energy in May 2024, is to step down as the company continues a quest to raise hundreds of millions of pounds in fresh capital from investors, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The chief executive of Ovo Energy, one of Britain's biggest energy suppliers, is to step down in the middle of a search for investors to pump hundreds of millions of pounds into the company. Sky News has learnt that David Buttress, the former Just Eat chief who served a brief period as Boris Johnson's cost-of-living tsar, has told colleagues that he will be leaving the company following discussions with its board. Money blog: Infamous trader bets millions on AI bubble bursting Mr Buttress joined Ovo in May 2024, two months after his appointment was announced. Chris Houghton, a former Ovo chief executive under founder Stephen Fitzpatrick, is said to have been lined up to return as Mr Buttress's successor from Wednesday. Mr Houghton is said to have expressed confidence in Ovo's prospects before agreeing to return. On Tuesday evening, however, sources said it had also been agreed that the company's chief financial officer, James Davies, would leave the company. \n                  Energy regulator Ofgem to wipe millions of debt with slight increase to bills\n                 \n                  Chancellor looking at cutting energy bills in budget\n                 \n                  Britain's winter blackout risk the lowest in six years\n                 Mr Davies is expected to be replaced by Simon Todd, his deputy and a long-standing Ovo executive. Ovo has been contacted for comment. The latest leadership overhaul at the company will come just months after the former Virgin Money chief Dame Jayne-Anne Gadhia, was named chair of Ovo's retail energy arm. Ovo has about four million retail customers, placing it behind the likes of Octopus Energy and Centrica-owned British Gas in the household energy supply market. Its quest to raise roughly £300m of new equity at Ovo has been ongoing for months, with bankers at Rothschild engaging in talks with numerous financial investors. Last month, Sky News revealed that a Norwegian investment group had abandoned talks about an investment amid concern that the industry's regulatory regime is obstructing efforts to attract new capital. Verdane, which is based in Oslo, had been in detailed talks as recently as this month about injecting a substantial sum into Ovo in return for a large stake in the business. Investor uncertainty has been heightened by the energy regulator Ofgem's capital adequacy rules, with Ovo acknowledging recently that it - alongside larger rival Octopus Energy - had yet to fully comply with the regime, saying: \"We have taken proactive measures to align with Ofgem's new capital rules, working constructively to meet the requirements.\" A person close to the situation said that Ovo was not technically in breach of the capital adequacy regime because it had agreed a route with Ofgem to fulfilling its obligations. In June, Sky News revealed that Iberdrola, the owner of Scottish Power, had also held tentative discussions about a possible tie-up. Ovo, which is backed by investors including Japan's Mitsubishi and the London-based investor Mayfair Equity Partners, disclosed in accounts published recently that there was \"material uncertainty\" over its future. The company has separately engaged advisers at Arma Partners to explore the sale of a stake in Kaluza, its software arm, echoing a similar move by Octopus Energy's Kraken division. Founded by Stephen Fitzpatrick, the entrepreneur who now owns London's Kensington Roof Gardens, Ovo's other shareholders include Morgan Stanley Investment Management. Under Mr Fitzpatrick, who launched Ovo in 2009, the company positioned itself as a challenger brand offering superior service to the industry's established players. Ovo's transformational moment came in 2020, when it bought the retail supply arm of SSE, transforming it overnight into one of Britain's leading energy companies. Its growth has not been without difficulties, however, particularly in relation to its challenged relationship with Ofgem and a torrent of customer complaints about overcharging."
    },
    {
        "title": "Nvidia boss Jensen Huang to meet Technology Secretary Liz Kendall",
        "description": "Nvidia boss Jensen Huang is to meet Technology Secretary Liz Kendall on Wednesday, Sky News understands.",
        "url": "https://news.sky.com/story/nvidia-boss-jensen-huang-to-meet-technology-secretary-liz-kendall-13463807",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jensen-huang-nvidia_7022973.jpg?20250917135628",
        "type": "Business",
        "Author": "Tim Baker",
        "Date Published": "2025-11-04 14:50:00",
        "Headline": "The head of the world's most valuable company will be meeting the minister as the government bets big on the tech sector for growth.",
        "Content": "\n          Political reporter\n              @TimJ_B\n Nvidia boss Jensen Huang is to meet Technology Secretary Liz Kendall on Wednesday, Sky News understands. The US computer hardware company is the biggest supplier of AI chips in the world, and is targeting the UK as a key area for growth. Mr Huang is in Britain to speak to the Cambridge Union Society on Tuesday evening, and receive an award at the Queen Elizabeth Prize of Engineering on Wednesday. Politics latest: Reeves refuses to rule out tax rises Sir Keir Starmer and his government have also identified AI data centres - specifically in the so-called \"AI Growth Zones\" (AIGZ) as a potential area of growth for the UK economy. And any big announcement, including investment, could help the Treasury ahead of next month's budget. However, concerns about the impact of an increased adoption of AI - including around job losses - have been raised, especially as the government wants to find £45bn in the civil service using the technology. \n                  Trump to sign US-UK tech partnership in drive for AI\n                 \n                  US tech and finance giants to join Trump on second UK state visit\n                 \n                  Nvidia: Tech bubble seems safe so long as AI demand remains high\n                 Nvidia announced a £2bn investment in the UK in June at a meeting with the prime minister, and in September Mr Huang told Sky News the UK was on the cusp of a new industrial revolution. \"This is the home of the origins of artificial intelligence and some of the brightest minds in AI are here,\" he told Sky News business and economics correspondent Gurpreet Narwan earlier this year. Nvidia recently became the first company to be valued at $5trn (£3.8trn), more than the UK's annual GDP. Ms Kendall has only been technology secretary for around two months, following the cabinet reshuffle in the wake of Angela Rayner's resignation. She has met Mr Huang before, and will be looking to cement a relationship with a man worth more than £100bn. Sir Keir will not be present at the summit as he will be travelling to the COP summit in Brazil.  Read more:Which companies does the government pay for AI?Hopes £45bn can be saved from Civil Service Last week, Ms Kendall welcomed the £4bn investment in the UK by data centre company Equinix - although this was not for an AIGZ. So far, two sites for these growth zones have been announced - one in Culham, Oxfordshire, and one in Blyth, Northumberland. Details on more sites are expected soon, with zones expected to be confirmed in Scotland, Wales and potentially Northern Ireland as the government looks to spread investment around the UK. Ahead of the meeting, industry sources have said they want to know more from the government about the potential locations of the next wave of zones, and what benefits they will actually bring. 👉Listen to Politics At Sam And Anne's on your podcast app👈 One insider also called for the government to take more action on energy prices that they say are \"extremely prohibitive\" to Sir Keir's goal of becoming an AI \"superpower\". Nvidia declined to comment. The government has been approached for comment."
    },
    {
        "title": "Chancellor Rachel Reeves refuses to rule out manifesto-breaking tax hikes",
        "description": "Rachel Reeves has refused to rule out breaking her manifesto pledge not to raise certain taxes, as she lays the groundwork ahead of the budget later this month.",
        "url": "https://news.sky.com/story/chancellor-rachel-reeves-refuses-to-rule-out-manifesto-breaking-tax-hikes-13463620",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-politics_7071363.jpg?20251104113850",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-04 08:35:00",
        "Headline": "In a highly unusual pre-budget speech, the chancellor set out the \"challenges\" facing the government, and her key priorities for the budget later this month.",
        "Content": " Rachel Reeves has refused to rule out breaking her manifesto pledge not to raise certain taxes, as she lays the groundwork ahead of the budget later this month. Asked directly by our political editor Beth Rigby if she stands by her promises not to raise income tax, national insurance or VAT, the chancellor declined to do so. She told Rigby: \"Your viewers can see the challenges that we face, the challenges that are on [sic] a global nature. And they can also see the challenges in the long-term performance of our economy.\" Follow live updates from Westminster She went on: \"As chancellor, I have to face the world as it is, not the world as I want it to be. And when challenges come our way, the only question is how to respond to them, not whether to respond or not. \"As I respond at the budget on 26 November, my focus will be on getting NHS waiting lists down, getting the cost of living down and also getting the national debt down.\" 'Each of us must do our bit' \n                  Why Chancellor Rachel Reeves chose 'shock and awe' 8am news conference\n                 \n                  Budget 2025: Reeves vows to 'defy' gloomy forecasts - but faces income tax warning\n                 Ms Reeves's comments to Rigby came after a highly unusual pre-budget speech in Downing Street in which she set out the scale of the international and domestic \"challenges\" facing the government. Rachel Reeves has refused to say whether she will hike taxes, but what exactly was her manifesto commitment last year? She said: \"We will ensure taxes on working people are kept as low as possible. \"Labour will not increase taxes on working people, which is why we will not increase national insurance, the basic, higher, or additional rates of income tax, or VAT.\" She also hinted at tax rises, saying: \"If we are to build the future of Britain together, each of us must do our bit for the security of our country and the brightness of its future.\" Despite her promise that last year's budget - which was the biggest tax-raising fiscal event since 1993 - was a \"once in a parliament event,\" the chancellor said that in the past year, \"the world has thrown even more challenges our way,\" pointing to \"the continual threat of tariffs\" from the United States, inflation that has been \"too slow to come down,\" \"volatile\" supply chains leading to higher prices, and the high cost of government borrowing. She also put the blame squarely on previous Tory governments, accusing them of \"years of economic mismanagement\" that has \"limited our country's potential,\" and said past administrations prioritised \"political convenience\" over \"economic imperative\".  Ms Reeves painted a picture of devastation following the years of austerity in the wake of the financial crisis, \"instability and indecision\" after that, and then the consequences of what she called \"a rushed and ill-conceived Brexit\". \"This isn't about re-litigating old choices - it's about being honest with the people, about the consequences that those choices have had,\" she said. 'I don't expect anyone to be satisfied with growth so far' The chancellor defended her personal record in office so far, saying interest rates and NHS waiting lists have fallen, while investment in the UK is rising, and added: \"Our growth was the fastest in the G7 in the first half of this year. I don't expect anyone to be satisfied with growth of 1%. I am not, and I know that there is more to do.\" Amid that backdrop, Ms Reeves set out her three priorities for the budget: \"Protecting our NHS, reducing our national debt, and improving the cost of living.\" Cutting inflation will also be a key aim in her announcements later this month, and \"creating the conditions that [see] interest rate cuts to support economic growth and improve the cost of living\". She rejected calls from some Labour MPs to relax her fiscal rules, reiterating that they are \"ironclad,\" and arguing that the national debt - which stands at £2.6trn, or 94% of GDP - must come down in order to reduce the cost of government borrowing and spend less public money on interest payments to invest in \"the public services essential to both a decent society and a strong economy\". She also put them on notice that cuts to welfare remain on the government's agenda, despite its humiliating U-turn on cuts to personal independence payments for disabled people earlier this year, saying: \"There is nothing progressive about refusing to reform a system that is leaving one in eight young people out of education or employment.\" And the chancellor had a few words for her political opponents, saying the Tories' plan for £47bn in cuts would have \"devastating consequences for our public services,\" and mocked the Reform UK leadership of Kent County Council for exploring local tax rises instead of cuts, as promised. Concluding her speech, Ms Reeves vowed not to \"repeat those mistakes\" of the past by backtracking on investments, and said: \"We were elected to break with the cycle of decline, and this government is determined to see that through.\" 'Reeves made all the wrong choices' In response to her speech, Conservative shadow chancellor Sir Mel Stride wrote on X that \"all she's done is confirm the fears of households and businesses - that tax rises are coming\". He wrote: \"The chancellor claims she fixed the public finances last year. If that was true, she would not be rolling the pitch for more tax rises and broken promises. The reality is, she fiddled the fiscal rules so she could borrow hundreds of billions more. \"Every time the numbers don't add up, Reeves blames someone else. But this is about choices - and she made all the wrong ones. If Rachel Reeves had the backbone to get control of government spending - including the welfare bill - she wouldn't need to raise taxes.\" He called for her to resign if she raises taxes."
    },
    {
        "title": "Why Chancellor Rachel Reeves chose 'shock and awe' 8am news conference",
        "description": "To understand why Rachel Reeves stood up at 8am in Downing Street in an unprecedented news conference to foreshadow the budget, you need to understand the depth of the problems facing the chancellor.",
        "url": "https://news.sky.com/story/why-chancellor-rachel-reeves-chose-shock-and-awe-8am-news-conference-13463679",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves_7071771.jpg?20251104165428",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-11-04 10:12:00",
        "Headline": "Rachel Reeves is battling for her own credibility - and ultimately, the survival of Sir Keir Starmer's government.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  To understand why Rachel Reeves stood up at 8am in Downing Street in an unprecedented news conference to foreshadow the budget, you need to understand the depth of the problems facing the chancellor. In 22 days, she must perform the biggest U-turn it is possible for a chancellor to make. She must hike taxes to the tune of tens of billions of pounds, having promised in the election manifesto that this would not be necessary, and reiterated this promise under a year ago after an initial £40bn of rises.  Not many inhabitants of Number 11 would stay in post if they had to make such a pivot. But Sir Keir Starmer cannot lose her and know for sure that he also stays in place. So Ms Reeves is battling for her credibility - and ultimately the survival of this government. The stakes are high. Politics latest: Reeves refuses to rule out manifesto-breaking tax rises \n                  Chancellor Rachel Reeves refuses to rule out manifesto-breaking tax hikes\n                 \n                  Budget 2025: Reeves vows to 'defy' gloomy forecasts - but faces income tax warning\n                 So back to this morning. Ever since the summer, those in Westminster have known tax rises are on the way in the autumn budget. A Treasury source told me that pitch-rolling for the budget began in July - yet their issue is that to date, almost no-one had noticed. The subject of the budget was an omerta as recently as the Labour conference a month ago - it simply wasn't on the agenda in Liverpool. The first public acknowledgement that she was looking at taxes was in an interview with me on Sky News three weeks ago. She has intermittently revisited the subject subsequently, but quite bluntly, the public haven't yet noticed. As recently as last week, people in the Treasury were acknowledging to me that the public are as yet unprepared for the tax shock expected on the scale on 26 November. So this morning's event was designed to be shock and awe - an 8am news conference is designed to jolt Westminster and the viewing public to attention, because inside the Treasury they are \"desperate\" - their words - to get the public watching.  The format allows her to look in control, like a stateswoman in Downing Street making arguments on her terms, even though these are arguments she has been forced into. So the job of this morning was to educate the public that tax rises are coming, but also put them on notice that this could involve a breach of manifesto promises by raising one of income tax, national insurance, corporation tax or VAT - and then to try and lay the blame anywhere but at the feet of this government. She also wants to give some hope - by giving a sense of what priorities she would protect. So what to make of the arguments she made? 'The impact of Tory austerity, their botched Brexit deal and the pandemic on Britain's productivity is worse than feared' Is it really all the Tories fault? Ms Reeves made an argument today about how lower growth is responsible for Britain's economic ills, and listed causes with a long tale going back many years for it. This is true, but isn't strictly the reason for her problems at this budget. On 26 November, she must fill a £20bn-£30bn \"black hole\" - that's the extent to which she is in on course to breach her own self-imposed borrowing limits, known as fiscal rules. Many of the components of the black hole cannot be put at the door of the Tories. Here's why: She must find £10bn to account for policy decisions the government has been pushed into - a failure to push through welfare reform, a U-turn on winter fuel payments, a likely rollover of fuel duty. She is likely to have to find a further £5bn for decisions she is likely to take - scrapping of the two-child benefit cap, help for energy bills and an emergency injection for redundancy bills and strike coverage costs. So £15bn of the black hole cannot be blamed on the Tories.  A further £2bn-£4bn for additional debt interest costs is a consequence of the higher borrowing just since the March spring statement - again not the Tories' fault - and also wants £10bn to give herself a bigger buffer to exit the doom loop. Ms Reeves has greater scope to argue that the productivity review has longer-term causes, but this is likely to be offset by better wage news, and there is an argument that Labour could have foreseen the productivity downgrade before the election because the Office for Budget Responsibility figures were out of line with other forecasters. So this is a tricky case to sustain, even though the government has no choice but to make it.  👉Listen to Politics At Sam And Anne's on your podcast app👈 'Protecting our NHS, reducing our national debt and improving the cost of living' The news is grim - but this is the chancellor's promise of what she is going to prioritise. But what does this amount to? NHS: I understand this is not a promise of new money for waiting lists in this budget. Ms Reeves is actually making a political argument about the need to not U-turn on last year's £22bn a year NHS investment - although the public may not hear it. Cost of living: Partly this is an argument about investment already made in things like breakfast clubs. But with CPI inflation at 4.1%, it's a major concern - but not one that can be tackled without government spending many billions. There will be some help for energy bills, but not the tens of billions that Liz Truss put towards such schemes. So this risks disappointment.  Reducing debt: It is not about to go down. Her fiscal rules mean she is going to be reducing debt as a percentage of GDP - and even then, only debt on some things, as the fiscal rules spell out some exemptions. So the actual amount we borrow from the markets will continue to grow. Does it work? Today is about saying with a louder megaphone things we already knew. She declined to say whether ultimately she will break the manifesto, or what will happen. She has, however, candidly started a conversation that needed to begin."
    },
    {
        "title": "Chancellor Rachel Reeves blames other people's mistakes for her predicament but she bears some responsibility",
        "description": "To say this wasn't the plan is an understatement.",
        "url": "https://news.sky.com/story/chancellor-rachel-reeves-blames-other-peoples-mistakes-for-her-predicament-but-she-bears-some-responsibility-13463846",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-reeves-chancellor-budget_7072075.jpg?20251104201305",
        "type": "Politics",
        "Author": "Ed Conway",
        "Date Published": "2025-11-04 16:34:00",
        "Headline": "The rigid fiscal rules that Ms Reeves herself established are a key component.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  To say this wasn't the plan is an understatement. When Rachel Reeves said last year (and many times since) that she had no intention of coming back to the British people with yet more tax rises, she meant it. Money blog: Infamous trader bets millions on AI bubble bursting But now the question ahead of the budget later this month is not so much whether taxes will rise, but which taxes, and by how much? Indeed, there's growing speculation that the chancellor will be forced to break her manifesto pledge not to raise the rates of income tax, national insurance or VAT.  Her argument, made in her news conference on Tuesday morning, is that she is in this position in large part because of other people's mistakes, primarily those of the Conservative Party. But while it's certainly true that a significant chunk of the likely downgrade to her fiscal position reflects the fact that the \"trend growth rate\" - the average speed of productivity growth - has dropped in recent years due to all sorts of issues, including Brexit, COVID-19 and the state of the labour market, she certainly bears some responsibility. A problem that is some of her own making \n                  Why Chancellor Rachel Reeves chose 'shock and awe' 8am news conference\n                 \n                  Chancellor Rachel Reeves refuses to rule out manifesto-breaking tax hikes\n                 \n                  Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today\n                 First off, she established the fiscal rules against which she is being marked by the Office for Budget Responsibility. Second, she decided to leave herself only a wafer-thin margin against those rules. Third, even if it weren't for the OBR's productivity downgrade, it's quite likely the chancellor would have broken those fiscal rules, due to the various U-turns by the government on welfare reforms, winter fuel, and extra giveaways they haven't yet provided the funding for, such as reversing the two-child benefit cap.   Now, at this stage, no one, save for the Treasury and the Office for Budget Responsibility, really knows the scale of the task facing the chancellor. And in the coming weeks, those numbers could change significantly. But it's becoming increasingly clear, from the political signalling if nothing else, that the government is rolling the pitch for bad news later this month. Indeed, for all that this government pledged to bring an end to austerity, a combination of higher taxes and lower spending will be highly unpopular, not to mention deeply controversial. And while the chancellor will seek to blame her predecessors, it remains to be seen whether the public will be entirely convinced. "
    },
    {
        "title": "Number of female MPs could plummet for first time if no action taken",
        "description": "The number of female MPs could plummet for the first time in more than a century if action is not taken now, campaigners have warned.",
        "url": "https://news.sky.com/story/number-of-female-mps-could-plummet-for-first-time-if-no-action-taken-13463877",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nancy-astor-politics_7072178.jpg?20251104213056",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-11-04 17:22:00",
        "Headline": "The 2024 election returned the highest proportion of female MPs, but it could drop dramatically should Reform or the Tories win in 2029. Campaigners have said the prospect must serve as a \"wake-up call\".",
        "Content": "\n          Political reporter\n              @alixculbertson\n The number of female MPs could plummet for the first time in more than a century if action is not taken now, campaigners have warned. If Reform UK, which has led voting intention polls since April, or the Conservatives, win the next general election, women's representation would fall drastically. Politics Hub: Latest updates and analysis A Labour win would stall the current percentage of female MPs, which stands at its highest ever at 41% (264 out of 650) - but is still lower than the UK population, of which 51% are women. If Reform win the next election, set for 2029, women's representation could fall to 26%, analysis of Electoral Calculus polling data by 50:50 Parliament found. If the Tories win, 33% of MPs would be women, while Labour would remain the same. What does history tell us? Every parliament since women were allowed to be MPs in 1918 has seen an increase, apart from small drops in 1950, 1979 and 2001. Nancy Astor was the first woman to take her seat in the Commons and served from 1919 to 1945. The 80s saw a substantial increase in female MPs before a large jump in 1997, and there has been a big rise from 128 women MPs in 2005 to the current 264. Despite this, no major party reached gender parity in its selection of candidates for last year's election. Labour selected 47% women, Greens were at 44%, Conservatives 34%, Lib Dems 28% and Reform 16%. 50:50 Parliament, which campaigns for gender equality in politics, is calling for people to \"Ask Her to Stand\" to encourage more women to get involved with politics to help balance the scales. It has installed a \"push for equality\" panic button outside parliament to raise awareness of the gender disparity. Stella Creasy, Labour MP for Walthamstow since 2010, has campaigned for abortion rights, childcare reform, and became the first MP to appoint a locum MP to manage constituency work during her maternity leave, after campaigning for better maternity rights for MPs. She told Sky News gender parity in parliament is important, as a broad range of views and experiences is needed \"to shape good quality policymaking\". Read more:Parliament to review baby rules after MP reprimanded \"For me, this is not about electing women for the sake of it, or because they champion women's rights per se; it is because gender balance will lead to better outcomes for all and the furthering of all of our rights,\" she said. \"There is strength in diversity, and we cannot hope to make decent policy, or pass good legislation, if half of the population are not adequately represented in the House. \"Childcare is a perfect example - it isn't just good for mums, it is essential infrastructure for society and therefore the economy to get it right.\" 'Why would you think men are better at politics?' Harriet Harman, a Labour peer and co-host of Sky News' Electoral Dysfunction podcast, is a former minister who put forward the Equality Bill, now the Equality Act 2010, which protects people from discrimination in the workplace and in wider society. She told Sky News: \"The time is long past that women could be expected to put up with men making all the decisions. \"Male-dominated parliaments are evidence of discrimination. Unless you think men are just better at politics than women. And why would you think that? \"A team of men and women with a breadth of experience is what works best. Who wants to go back to the old boys' network running the country? Not me.\" 'Different voices make better decisions' Former leader of the Scottish Conservatives Baroness Ruth Davidson, also a co-host of Electoral Dysfunction, said parliament \"works better when it looks and feels closer to the country it seeks to represent\". \"Women politicians often have different experiences before entering parliament, including in their prior interactions with public services,\" she added. \"It is important that laws and funding decided in the Commons and elsewhere are informed by the widest experience of how such decisions impact in practice. \"Having different voices round the table, offering challenge from a variety of perspectives, is how you make better laws, better decisions and a better Britain.\"  Lyanne Nicholl, CEO of 50:50 Parliament, said the impact of their prediction playing out will be \"devastating\", as she pointed out gender parity \"isn't about party politics - it's about democracy\". She said \"we risk turning back the clock\" and policymaking \"ignoring half the population\", as she called the data a \"wake-up call\" for everyone."
    },
    {
        "title": "Nvidia boss Jensen Huang to meet Technology Secretary Liz Kendall",
        "description": "Nvidia boss Jensen Huang is to meet Technology Secretary Liz Kendall on Wednesday, Sky News understands.",
        "url": "https://news.sky.com/story/nvidia-boss-jensen-huang-to-meet-technology-secretary-liz-kendall-13463807",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jensen-huang-nvidia_7022973.jpg?20250917135628",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-11-04 14:50:00",
        "Headline": "The head of the world's most valuable company will be meeting the minister as the government bets big on the tech sector for growth.",
        "Content": "\n          Political reporter\n              @TimJ_B\n Nvidia boss Jensen Huang is to meet Technology Secretary Liz Kendall on Wednesday, Sky News understands. The US computer hardware company is the biggest supplier of AI chips in the world, and is targeting the UK as a key area for growth. Mr Huang is in Britain to speak to the Cambridge Union Society on Tuesday evening, and receive an award at the Queen Elizabeth Prize of Engineering on Wednesday. Politics latest: Reeves refuses to rule out tax rises Sir Keir Starmer and his government have also identified AI data centres - specifically in the so-called \"AI Growth Zones\" (AIGZ) as a potential area of growth for the UK economy. And any big announcement, including investment, could help the Treasury ahead of next month's budget. However, concerns about the impact of an increased adoption of AI - including around job losses - have been raised, especially as the government wants to find £45bn in the civil service using the technology. \n                  Trump to sign US-UK tech partnership in drive for AI\n                 \n                  US tech and finance giants to join Trump on second UK state visit\n                 \n                  Nvidia: Tech bubble seems safe so long as AI demand remains high\n                 Nvidia announced a £2bn investment in the UK in June at a meeting with the prime minister, and in September Mr Huang told Sky News the UK was on the cusp of a new industrial revolution. \"This is the home of the origins of artificial intelligence and some of the brightest minds in AI are here,\" he told Sky News business and economics correspondent Gurpreet Narwan earlier this year. Nvidia recently became the first company to be valued at $5trn (£3.8trn), more than the UK's annual GDP. Ms Kendall has only been technology secretary for around two months, following the cabinet reshuffle in the wake of Angela Rayner's resignation. She has met Mr Huang before, and will be looking to cement a relationship with a man worth more than £100bn. Sir Keir will not be present at the summit as he will be travelling to the COP summit in Brazil.  Read more:Which companies does the government pay for AI?Hopes £45bn can be saved from Civil Service Last week, Ms Kendall welcomed the £4bn investment in the UK by data centre company Equinix - although this was not for an AIGZ. So far, two sites for these growth zones have been announced - one in Culham, Oxfordshire, and one in Blyth, Northumberland. Details on more sites are expected soon, with zones expected to be confirmed in Scotland, Wales and potentially Northern Ireland as the government looks to spread investment around the UK. Ahead of the meeting, industry sources have said they want to know more from the government about the potential locations of the next wave of zones, and what benefits they will actually bring. 👉Listen to Politics At Sam And Anne's on your podcast app👈 One insider also called for the government to take more action on energy prices that they say are \"extremely prohibitive\" to Sir Keir's goal of becoming an AI \"superpower\". Nvidia declined to comment. The government has been approached for comment."
    },
    {
        "title": "Reflecting sunlight into space could 'buy time' against global warming - but experts warn of 'rogue nations' risk",
        "description": "Reducing the amount of sunlight reaching the Earth could take the edge off global warming and limit the damage caused by climate change, according to Britain's leading scientific body.",
        "url": "https://news.sky.com/story/reflecting-sunlight-into-space-could-buy-time-against-global-warming-but-experts-warn-of-rogue-nations-risk-13463849",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sea-clouds_7071989.jpg?20251104180119",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-11-04 16:38:00",
        "Headline": "A nation going alone and attempting to dim sunlight in one region could cause extreme droughts and other weather disturbances elsewhere in the world, the report warns. ",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n Reducing the amount of sunlight reaching the Earth could take the edge off global warming and limit the damage caused by climate change, according to Britain's leading scientific body. But the Royal Society has warned that strategies aimed at bringing about these changes are not without risk. The society, which sparked the scientific revolution in the 17th century, said in a new report that bold new technology for reflecting sunlight back into space could \"buy time\" for cuts in fossil fuel emissions to take effect. It said two strategies - pumping reflective particles high in the atmosphere and spraying salt into clouds over the sea to make them whiter - are likely to be effective, as well as technically feasible. But the report's authors warn a rogue nation going alone, and attempting to dim sunlight in one region, could cause extreme droughts and other weather disturbances elsewhere in the world. Professor Keith Shine, chair of the report's working group, said there could nevertheless be a time when world leaders agree that solar radiation modification (SRM) is the least worst option. \"This is not a question of whether SRM is safe, as it is clearly not without risks,\" he said. \"However, there may come a point where those risks are seen to be less severe than the risks of insufficiently mitigated climate change.\" The report said global efforts to reduce greenhouse gas emissions look increasingly unlikely to stop global temperatures rising above 1.5C, considered by many scientists to be a \"safe\" limit.  A new round of UN climate talks will start later this week in Brazil, but under current policies, temperatures are likely to be at least 3C warmer than pre-industrial times by 2100. The working group ranked stratospheric aerosol injection as the most promising option for dimming the amount of sunlight reaching the Earth's surface. Planes would fly at high altitude, releasing sulphur dioxide gas, which would form particles that reflect a small amount of sunlight. There is real-world evidence that this could work. The 1991 eruption of Mount Pinatubo, a volcano in the Philippines, pumped 15 million tonnes of sulphur dioxide into the stratosphere, reducing the temperature by 0.5C for one to two years. Computer models suggest that releasing eight to 16 million tonnes of the gas from planes each year across both the northern and southern hemispheres could reduce the global temperature by 1C. Read more from Sky News:Brightest ever flare from supermassive black hole spottedWhy is COP30 so controversial? The likely cost would be \"in the low 10s of billions of dollars a year\", said Prof Shine. That's far less than the global cost of more extreme weather, wildfires, and other climate impacts. Hurricane Melissa, which was made more intense by global warming, cost up to $52bn (£39.9bn) in damage and economic losses across the western Caribbean, according to AccuWeather.  The Royal Society's report warns that SRM would not tackle the root cause of climate change, and is not an alternative to reducing emissions. But it could reduce temperatures while carbon dioxide levels in the atmosphere peak and begin to fall. It could mean SRM would need to be deployed for 100 years or more."
    },
    {
        "title": "Brightest ever flare from supermassive black hole spotted by scientists in California",
        "description": "Scientists have spotted the brightest flare yet from a supermassive black hole that shines with the light of 10 trillion suns.\n",
        "url": "https://news.sky.com/story/brightest-ever-flare-from-supermassive-black-hole-spotted-by-scientists-in-california-13463681",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-supermassive-black_7071456.jpg?20251104100623",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-11-04 10:13:00",
        "Headline": "The flare came from a supermassive black hole 10 billion light years away - making it the most distant one observed so far.",
        "Content": "Scientists have spotted the brightest flare yet from a supermassive black hole that shines with the light of 10 trillion suns.\n The flare came from a supermassive black hole 10 billion light years away - making it the most distant one observed so far. The flash likely occurred because a large star wandered too close to the black hole and was shredded to pieces. These bursts of light and energy can emanate from tangled-up magnetic fields or hiccups in the heated gas disks surrounding black holes. Read more from Sky News:UK joins quantum partnership in bid to win race for national securityRevealed: How much the government is spending on AI \"At first, we didn't really believe the numbers about the energy,\" said study author Matthew Graham of the California Institute of Technology, which operates the Palomar Observatory, where the cosmic display was spotted in 2018. The flare took around three months to shine at peak brightness and has been decaying in the years since. The new findings were published on Tuesday in the journal Nature Astronomy. Almost every large galaxy, including our Milky Way, has a supermassive black hole at its centre - but scientists still aren't sure how they form. Studying such behemoths can help researchers better understand the stellar neighbourhood surrounding supermassive black holes. The findings also allow scientists \"to probe the interaction of supermassive black holes with their environments early in the universe,\" said Joseph Michail with Harvard-Smithsonian Center for Astrophysics, which was not involved in the study."
    },
    {
        "title": "Prince William plays volleyball and football ahead of Brazil climate events",
        "description": "Prince William has talked about the need for more good leaders, as well as putting on a display of his less serious side, on the first day of his tour to Brazil.",
        "url": "https://news.sky.com/story/prince-william-plays-volleyball-and-football-ahead-of-brazil-climate-conferences-13463538",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-prince-william-volleyball_7071634.jpg?20251104132253",
        "type": "Technology",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-11-04 03:23:00",
        "Headline": "The Prince of Wales is in Brazil all week for both his annual Earthshot Awards on Wednesday and COP30, the UN's climate conference.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  Prince William has talked about the need for more good leaders, as well as putting on a display of his less serious side, on the first day of his tour to Brazil. William, who is in the country all week for both his annual Earthshot Awards on Wednesday and COP30, the UN's climate conference, started his trip with a penalty shootout at the iconic Maracana Stadium in Rio, before heading to Copacabana Beach to kick off his shoes and take part in a volleyball game. On Tuesday, he will focus more heavily on his environmental work with a series of visits. On Monday morning, he was welcomed to Rio with an honour reserved for the carnival king - the keys to the city. Standing on top of Sugarloaf Mountain with a bird's eye view of the city and the iconic Christ the Redeemer statue, he was greeted by the mayor of Rio, Eduardo Paes. Read more: Why is COP30 so controversial, and who's attending? Speaking about the significance of the key ceremony, he joked, \"So he's got the keys, he can do whatever he wants in the next 72 hours. The city belongs to Prince William. I'm still the king, but it will belong to him!\" William's legacy goals Ticking off some of the city's most iconic locations, he met with Brazilian football legend Cafu at the Maracana. He enlisted his help to highlight his Earthshot Awards, as they joined an event for young environmental campaigners and entrepreneurs. Speaking to one group, William talked about the need for more good leaders, saying: \"I need to work out how do I speed that up, but you guys are my hope, you've got the passion, the ambition that's what this needs.\" He added: \"That's what I hope my legacy will be, in a few years time you're kind of household names.\" William then went pitch side and met children learning about the environment and climate change through the sport-based organisation Terra FC. Read more from Sky News:Farage says Reform could cut minimum wageRevealed: How much government's spending on AITrain attack victim 'didn't have choice' but to fight back The prince ended his football drills by taking a penalty against keeper Pedro Enrique, 14, and was mobbed by youngsters wanting a high-five after he scored. Pedro said afterwards: \"I was scared and nervous but very excited as he was most the famous person to take a penalty kick. I didn't let him score. It was a good penalty.\""
    },
    {
        "title": "Sir David Beckham receives knighthood from the King at Windsor Castle ceremony",
        "description": "Becks, Goldenballs and now officially Sir David, football star David Beckham has received his knighthood from the King - and told Sky News he cried when he found out about the honour.",
        "url": "https://news.sky.com/story/sir-david-beckham-receives-knighthood-from-the-king-at-windsor-castle-ceremony-13463703",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-investiture-david-beckham_7071649.jpg?20251104121402",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-04 10:42:00",
        "Headline": "Nobel Prize-winning novelist Sir Kazuo Ishiguro and West End performer Dame Elaine Paige were also among the stars set to be recognised at the investiture ceremony.",
        "Content": " Becks, Goldenballs and now officially Sir David, football star David Beckham has received his knighthood from the King - and told Sky News he cried when he found out about the honour. After years in the running following his OBE in 2003, the former England captain and Manchester United star has now been knighted for his services to sport and charity at an investiture ceremony at Windsor Castle. Sir David's wife Victoria, the Spice Girl turned fashion designer and now Lady Victoria, joined him at the event - and of course, designed his suit. The couple married in 1999 and have four children together, Brooklyn, Romeo, Cruz and Harper.  Speaking to Sky News after being knighted by the King, he said it was \"such a big moment\" for him and his family. \"I cried when I first found out, and possibly for a few months after it as well,\" he said. \"This week has been really emotional... I've not been nervous, I've just been emotional.\" Asked how he now likes to be referred to at home, Sir David joked: \"I'm not insisting, [but] if they would like to call me Sir Dad or Sir Son, they can. But no, it's going to take some getting used to people saying it. It's just a huge honour.\" A \"huge royalist\", Sir David, 50, was last year named an ambassador for the King's Foundation, an educational charity established by Charles in 1990. \"I'm very proud,\" he said of his knighthood. \"You know, I grew up in a very humble background in the East End of London, always wanting to be a professional footballer. And then I'm stood here at Windsor Castle with the most important monarchy in the world and, getting a knighthood, so it doesn't get much better.\" England caps and Man U trophies The football star, who grew up in northeast London, earned 115 caps playing for England, with 59 of those as captain, and scored 17 goals for his country. He played in three World Cups, in 1998, 2002 and 2006, and two Euros, in 2000 and 2004. His England career was marked by intense scrutiny with the player enduring harsh criticism at times - especially after his red card during the 1998 World Cup game versus Argentina - but also praise, like after his performance against Greece in 2001, enabling England to reach the finals in 2002. He made his Premier League debut for Manchester United in 1995 and was part of the team that earned a dramatic Champions League final victory in 1999 - when they beat Bayern Munich with two nail-biting late goals. It was the year they famously won the treble, also taking home the Premier League and FA Cup silverware. During his time with the club, Sir David scored 85 goals and collected honours including six Premier League titles and two FA Cups, before going on to play for clubs including Real Madrid, AC Milan, LA Galaxy, and Paris Saint-Germain. He retired from the sport in 2013. Arts and entertainment correspondent For Sir David, waiting for his knighthood has been more stressful than any England penalty shoot-out. Speaking to me in the grounds of Windsor Castle, he didn't mind admitting he'd cried several times since finding out. The emotions are understandably raw given his working class roots and how long it's taken him to get  here. Not only was Sir David scuppered by a run of bad luck, arguably he was also a victim of his own success. He has always been a more complicated candidate than most, with his football career intertwined with celebrity branding and tabloid culture - while the honours system has always been deeply rooted in the ideal of understatement, a belief that true merit should be quietly earned and modestly displayed. From fashion lines to brand deals, with his success unapologetically visible, for some traditionalists he's always been a little too self-publicising to fit comfortably into that knighthood mould. There was arguably some cultural lag in the honours system catching up with how modern celebrity works. But in reality, the committee probably would have honoured him sooner were it not for a series of missteps Sir David had to endure - from finding himself wrongly named (along with other celebrities) by HMRC in what it alleged was a tax avoidance scheme, which was later thrown out by the supreme court, to the embarrassment of private emails being widely reported in the press. These were apparently leaked and doctored by Russian hackers, in which he allegedly called the Honours Committee \"unappreciative\". Neither of these things helped.\n\n\n\n So it might have taken a little extra time for Sir David to get here, but few would question his suitability for the honour given his ongoing charitable work and his consistency in promoting Britain. Sir David might have had a nightmare wait on his way to knighthood - but now finally, that wait is over. Alongside his football career, he is also known for his charity work, including serving as a goodwill ambassador for humanitarian aid organisation UNICEF since 2005. Nobel Prize-winning novelist Sir Kazuo Ishiguro and West End performer Dame Elaine Paige were also among the stars recognised at the investiture ceremony. Read more:Brightest ever flare from supermassive black holeCultural workouts - the key to better health? Japanese-born author Sir Kazuo, who moved to the UK as a child and is known for 2005's Never Let Me Go and 1989's The Remains Of The Day, for which he won the Man Booker Prize, was made a Companion of Honour. Dame Elaine, who became an overnight star thanks to her portrayal of Eva Peron in Lord Andrew Lloyd Webber's hit musical Evita, and also starred in musicals including Cats and Sunset Boulevard, was given her damehood for services to music and charity."
    },
    {
        "title": "Wild at Heart actress Diane Ladd dies aged 89",
        "description": "American actress and Wild at Heart star Diane Ladd has died aged 89.",
        "url": "https://news.sky.com/story/wild-at-heart-actress-diane-ladd-dies-aged-89-13463568",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-diane-ladd-wildatheart_7071280.jpg?20251104072403",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-04 07:14:00",
        "Headline": "Ladd, mother of Jurassic Park actress Laura Dern, was a triple Academy Award nominee for films including Rambling Rose.",
        "Content": "American actress and Wild at Heart star Diane Ladd has died aged 89. Laura Dern, Ladd's daughter who is also an actress, announced her mother's death on Monday. Ladd was a triple Academy Award nominee for her supporting roles in Alice Doesn't Live Here Anymore, Wild at Heart and Rambling Rose. She also starred in 1973 film White Lightning and HBO's Enlightened in 2011 with her daughter. Often, they played mother and daughter together. For the 1991 drama Rambling Rose they were the first, and only, mother and daughter duo to receive Oscar nominations for the same film in the same year. 'She doesn't care what anybody thinks' Ms Dern, who starred in Jurassic Park, said of her mother in 2019: \"She is just the greatest actress, ever. You don't even use the word brave because she just shows up like that in life. She doesn't care what anybody thinks. \"She leads with a boundarylessness.\" In 2023 they released a joint memoir together titled Honey, Baby, Mine: A Mother and Daughter Talk Life, Death, Love. Read more from Sky News:Diane Keaton's family issue statement as cause of death givenThieves steal more than 1,000 items from museum The book was based on their conversations together during daily walks after Ladd was given only months to live, after she was diagnosed with lung disease. Ms Dern said at the time: \"The more we talked and the deeper and more complicated subjects we shared, my mother got better and better and better. \"It's been a great gift.\" Ladd was married three times and worked into her 80s."
    }
]