[
    {
        "title": "Jaguar Land Rover rescued with £1.5bn government-backed loan after crippling cyber attack",
        "description": "The government will underwrite a &#163;1.5bn loan guarantee to Jaguar Land Rover (JLR) after a mass cyber attack forced a shutdown.",
        "url": "https://news.sky.com/story/jaguar-land-rover-rescued-with-16315bn-government-backed-loan-after-crippling-cyber-attack-13439969",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jaguar-land-rover-cars_6877897.jpg?20250406135225",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-27 22:17:00",
        "Headline": "JLR suspended production at its UK factories following the cyber attack on 31 August. The shutdown is expected to last until 1 October, leaving the largest UK carmaker's suppliers in limbo.",
        "Content": "The government will underwrite a £1.5bn loan guarantee to Jaguar Land Rover (JLR) after a mass cyber attack forced a shutdown. JLR suspended production at its UK factories following the cyber attack on 31 August. The shutdown is expected to last until 1 October, leaving the largest UK carmaker's suppliers in limbo. The loan is expected to give suppliers some certainty amid the continued shutdown, as the £1.5bn will help bolster JLR's cash reserves as it pays back companies in its supply chain. The government will give its backing to the loan through the Export Development Guarantee (EDG), a financial support mechanism aimed at helping British companies that sell their goods overseas.  The £1.5bn loan, from a commercial bank, will be paid back over five years. \"Following our decisive action, this loan guarantee will help support the supply chain and protect skilled jobs in the West Midlands, Merseyside and throughout the UK,\" Business Secretary Peter Kyle said. Chancellor Rachel Reeves added: \"Jaguar Land Rover is an iconic British company which employs tens of thousands of people - a jewel in the crown of our economy. \n                  Harrods customers' details stolen in IT systems breach\n                 \n                  Hackers claim to have stolen pictures, names and addresses of children in nursery firm cyber attack\n                 \n                  Many small firms reliant on Jaguar Land Rover have 'weeks left' before damage 'untenable'\n                 \"Today we are protecting thousands of those jobs with up to £1.5bn in additional private finance, helping them support their supply chain and protect a vital part of the British car industry.\" As a result of the attack, production was halted across the car-making supply chain, with thousands of staff off work. More than 33,000 people work directly for JLR in the UK, many of them on assembly lines in the West Midlands, the largest of which is in Solihull, and a plant at Halewood on Merseyside. An estimated 200,000 more are employed by several hundred companies in the supply chain, who have faced business interruption with their largest client out of action.  Ministers have had daily contact with JLR and cyber experts following the attack as the company attempts to restart production at its UK factories. Unions and politicians have warned that small suppliers producing parts for JLR could collapse as a result of the shutdown unless they receive urgent financial support. This week, Mr Kyle met workers and bosses at Webasto, which makes sunroofs for JLR. Read more:Small firms reliant on JLR have 'weeks left' before damage 'untenable'Harrods customers' details stolen in IT systems breachHackers claim to have stolen pictures, names and addresses of children in nursery firm cyber attack The brand has the largest supply chain in the UK automotive sector, which employs around 120,000 people and is largely made up of small and medium-sized businesses. The government's promise of underwriting the JLR loan has been praised by the Unite union, whose general secretary Sharon Graham said the loan was \"an important first step and demonstrates that the government has listened to the concerns raised in meetings with Unite over recent days\".  She added: \"This is exactly what the government should be doing, taking action to protect jobs. \"The money provided must now be used to ensure job guarantees and to also protect skills and pay in JLR and its supply chain.\""
    },
    {
        "title": "Labour MPs gather in Liverpool as Starmer mounts fightback against Reform",
        "description": "Labour MPs are gathering in Liverpool for the annual party conference as Sir Keir Starmer attempts to mount a fightback against dire polling and threats to his leadership. ",
        "url": "https://news.sky.com/story/labour-mps-gather-in-liverpool-as-starmer-mounts-fightback-against-reform-13439788",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-starmer-labour_7033785.jpg?20250927173608",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2025-09-27 23:01:00",
        "Headline": "The conference is a chance for Sir Keir to draw a line under the chaos of recent weeks and convince his MPs he is the man who should lead the party into the next election. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Labour MPs are gathering in Liverpool for the annual party conference as Sir Keir Starmer attempts to mount a fightback against dire polling and threats to his leadership.  The prime minister said he will use the four-day event to show Labour can be an alternative to the \"toxic divide and decline\" offered by Reform UK, describing this as \"the fight of our times\". Sir Keir is under pressure after two separate polls predicted Nigel Farage's party will win the next general election as voters turn their backs on mainstream politics. It is the latest bit of bad news for the embattled prime minister, who has faced a month of scandals surrounding his top team alongside speculation Greater Manchester Mayor Andy Burnham could mount a leadership challenge. Speaking from the conference venue on Saturday night, Sir Keir said the next few days are a \"really big opportunity to make our case to the country, make it absolutely clear that patriotic national renewal is the way forward, not the toxic divide and decline that we get with Reform\". He later insisted he could \"pull things around\", telling The Sunday Times: \"It is the fight of our times and we've all got to be in it together. We don't have time for introspection, we don't have time for navel-gazing. \"You'll always get a bit of that at a Labour Party conference, but that is not going to solve the problems that face this country. \n                  Unite boss Sharon Graham threatens to break link with Labour on eve of conference\n                 \n                  Unite the union refuses to nominate either Labour deputy leadership contender\n                 \n                  Andy Burnham says Labour MPs want him to oust Starmer\n                 \"Once you appreciate the change - in the sense of the division that Reform would bring to our country and the shattering of what we are as a patriotic country - then you realise this is a fight which in the end is bigger than the Labour Party.\" Much of the next four days is likely to be dominated by discussions on how exactly Labour could beat Reform - and whether Sir Keir is the man for the job. PM's future in doubt There has been rampant speculation Mr Burnham could mount a leadership challenge after he made a series of high-profile interventions this week, criticising the direction of the government and claiming Labour MPs had asked him to stand.  The so-called \"King of the North\" has many hurdles to overcome before that could be a possibility - he would have to win a seat in Westminster through a by-election if one became available, then get 80 colleagues to back him. One MP told Sky News that lots of backbenchers are \"reluctantly coming to the conclusion\" that Sir Keir's downfall is a \"not a matter of if, but when\" - citing Mr Burnham or Health Secretary Wes Streeting as possible replacements However they stressed that they did not want to see the prime minister go and hope he can turn things around ahead of the local elections in May. Two-child benefit cap speculation Many MPs want the prime minister to use the conference to set out a positive vision that offers hope for the future - saying his rhetoric on \"tough choices\" during the first 12 months backfired with the public. The boss of Unite, Labour's biggest union funder, has threatened to break its link with the party unless it changes direction. In a signal the leadership is listening, there have been hints from senior ministers that the government could use the conference to scrap the controversial two-child benefit cap.  The limit is opposed by over 100 Labour MPs, both of Labour's deputy leadership candidates and other senior party figures such as Mr Burnham and former prime minister Gordon Brown. Two MPs who were suspended for rebelling over the measure last year - John McDonnell and Aspana Begum - had the whip reinstated on Friday. Mr McDonnell, the shadow chancellor under Jeremy Corbyn, said he hopes \"this is a signal the government has decided to scrap the cap\". Key announcements  Sir Keir's allies rallied round him ahead of the conference, with Business Secretary Peter Kyle claiming the prime minister received a \"rapturous reception\" at events he has been speaking at on Saturday. Sir Keir will address the conference on Tuesday but there will be speeches from cabinet ministers throughout the event, with Chancellor Rachel Reeves to speak on Monday.  The opening day will kick off with a pledge from Housing Secretary Steve Reed to construct three new towns before the next election, in Tempsford in Bedfordshire, Leeds South Bank, and Crews Hill, north London. In one of a number of announcements overnight, the government also said that it will underwrite a £1.5bn loan guarantee to Jaguar Land Rover as it continues to face a shutdown following a mass cyber attack. Meanwhile, Chancellor Rachel Reeves told The Times she is pushing for a new youth mobility scheme and an improved trading relationship with the European Union in a bid to reduce the need for tax rises in the forthcoming budget. And Home Secretary Shabana Mahmood signalled a major change in immigration policy, telling The Sun on Sunday she would \"reset\" immigration laws so foreigners must prove their social worth before being allowed to settle in Britain."
    },
    {
        "title": "Royals - and Russell Crowe - lead congratulations for England's Women's Rugby World Cup winners",
        "description": "The Prince and Princess of Wales and the prime minister are among those who have congratulated England on winning the Women's Rugby World Cup.",
        "url": "https://news.sky.com/story/royals-and-russell-crowe-lead-congratulations-for-englands-womens-rugby-world-cup-winners-13439733",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-england-zoe-aldcroft_7033952.jpg?20250927181921",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-27 17:28:00",
        "Headline": "Among the first to congratulate the Red Roses were the Prince and Princess of Wales, who also praised Canada and said they had \"an outstanding tournament\".",
        "Content": " The Prince and Princess of Wales and the prime minister are among those who have congratulated England on winning the Women's Rugby World Cup. The win, crushing Canada 33-13 at the Allianz Stadium in Twickenham, west London, marked England's third World Cup title, and their first since 2014. Two tries by Alex Matthews, plus one each from Ellie Kildunne, Amy Cokayne and Abbie Ward sealed it for the Red Roses. Among the first to congratulate the Red Roses were the Prince and Princess of Wales, who also praised Canada and said: \"You had an outstanding tournament. Both teams should be so proud!\"  Ahead of the final, the royals shared a photo of the princess with some of the Red Roses in cowboy hats. Prime Minister Sir Keir Starmer also praised the team and said: \"You have shown the very best of England and inspired a generation.\" Conservative leader Kemi Badenoch also called it an \"incredible performance\", and added: \"A proud moment for English rugby and for our country.\" Read more from Sky News:Prince of Wales says 2024 was 'hardest year' of his lifeUnite threatens to break link with LabourNuno Espirito Santo made new West Ham head coach After watching the game with Canadian Prime Minister Mark Carney, London's mayor Sir Sadiq Khan posted a photo of the pair while congratulating England. \"Huge congratulations to (the Red Roses) on their fantastic victory,\" he said. \"Another proud moment for women's rugby.\" In his own post on social media, Mr Carney said: \"On behalf of a proud nation, massive congratulations to Team Canada for an incredible run in the Rugby World Cup.\" Actor Russell Crowe - an avid rugby fan and, for this tournament, Canada supporter - also congratulated the Red Roses, saying on social media: \"Got to hand it to England Women's Rugby team. \"Solid, dominant and as it turns out, unbeatable on the day. Big game players every one of them. Bad luck Canada. You can hold your heads high. Remarkable run.\""
    },
    {
        "title": "Sergei Lavrov warns NATO and EU countries over 'aggression' towards Russia",
        "description": "Vladimir Putin's top diplomat says Russia has no intention of attacking any NATO or EU member state but warned of a \"decisive response\" if any \"aggression\" was directed towards Moscow.",
        "url": "https://news.sky.com/story/sergei-lavrov-warns-nato-and-eu-countries-over-aggression-towards-russia-13439812",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-russia-lavrov-putin_7034121.jpg?20250927195425",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-27 18:51:00",
        "Headline": "Vladimir Putin's top diplomat addressed world leaders in New York at the 80th UN General Assembly.",
        "Content": " Vladimir Putin's top diplomat says Russia has no intention of attacking any NATO or EU member state but warned of a \"decisive response\" if any \"aggression\" was directed towards Moscow. Sergei Lavrov, Russia's foreign minister of 21 years, was speaking in New York at the 80th UN General Assembly, where he said threats against his country by Western nations were becoming \"increasingly common\". He was expected to address allegations made against Moscow that it has violated the airspace of several of its neighbours in recent weeks, heightening tensions across Europe. Estonia said Russian fighter jets flew into its airspace last week and remained there for 12 minutes, while a NATO air defence mission was recently carried out over Poland in response to \"unprecedented\" Russian drone incursions above the country.  Romania and Latvia also reported that single Russian drones had violated their airspace this month. \"Threats of force against Russia, accused of practically planning an attack on the North Atlantic Alliance and the European Union, are becoming increasingly common,\" Mr Lavrov said in New York. \n                  'Great regret' some European nations buying Russian oil and gas, says top EU official\n                 \n                  NATO responds after Russian military jets 'violate' Estonian airspace\n                 \n                  British fighter jets to fly air defence missions over Poland after Russia's drone incursion\n                 \"President Putin has repeatedly debunked such provocations. Russia has never had and does not have such intentions, but any aggression against my country will be met with a decisive response.\" At the start of the week, US President Donald Trump told the UN that NATO nations should shoot down Russian planes in their airspace. 'They will regret it' After his UN address, Mr Lavrov held a news conference, where he insisted again that Moscow \"has nothing to hide\" over the allegations against it. He was then asked by US correspondent Mark Stone what the Kremlin's response would be if a nation shot down a Russian drone or plane in Russian airspace. \"Try to understand that a drone, when it is flying not over our territory, but if it crosses someone's border but has left our airspace, probably everyone has the right to do with that drone whatever they consider necessary to ensure their security. \"But if there are attempts to shoot down any flying object, or indeed any object at all, on our territory, in our airspace, then I think people will seriously regret it, undertaking such a gross violation of our territorial integrity, our sovereignty.\"  'Hypocrisy' over Gaza comments At the start of his UN speech, Mr Lavrov took time to criticise Israel's actions in the Middle East, accusing it of trying to \"blow up\" the region and saying it had \"no justification\" for the \"brutal killings\" of Palestinians in Gaza. \"The illegal use of force against the Palestinians and aggressive actions against Iran, Qatar, Yemen, Lebanon, Syria and Iraq today threaten to blow up the entire Middle East.\" He also hit out at Israeli plans to annex the West Bank: \"There is no justification for plans to annex the West Bank. This is essentially a coup d'etat in diplomatic terms.\" Israel has repeatedly claimed that it does not target civilians in Gaza and says its military actions across the Middle East are strategically vital for its self-defence.  Mark Stone said Mr Lavrov's comments on Israel's actions will be seen as highly hypocritical given Russia's war in Ukraine which began in February 2022. \"Lavrov said Israel is bombing schools, it is bombing hospitals in Gaza,\" Stone said. \"Well, remember Mariupol and the rest of those cities in Ukraine, where Russia has and continues to do just the same thing? There's a certain hypocrisy there, for sure.\""
    },
    {
        "title": "Donald Trump orders deployment of US troops to 'war-ravaged' Portland",
        "description": "Donald Trump has ordered the deployment of US troops to \"war-ravaged Portland\" in the state of Oregon, authorising the use of \"full force\" if needed.",
        "url": "https://news.sky.com/story/donald-trump-orders-deployment-of-us-troops-to-war-ravaged-portland-13439888",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-protest-in-portland_7034428.jpg?20250928025428",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-27 19:50:00",
        "Headline": "In a post on Truth Social, the US president said he was authorising the use of \"full force\" to protect ICE facilities in Portland, Oregon, if necessary.",
        "Content": "Donald Trump has ordered the deployment of US troops to \"war-ravaged Portland\" in the state of Oregon, authorising the use of \"full force\" if needed. The US president said he was directing US defence secretary Pete Hegseth to make the move in order to protect the city \"and any of our ICE facilities under siege from attack by Antifa and other domestic terrorists\". Mr Trump did not specify whether he would send in National Guard troops or the US military. The move comes after a gunman opened fire on an Immigration and Customs Enforcement (ICE) field office in Dallas on Wednesday, wounding two detainees and killing another.   The ICE facility in Portland has been targeted by protesters since June, sometimes leading to violent clashes. On Friday, the Department of Homeland Security (DHS) said demonstrators had \"repeatedly attacked and laid siege to an ICE processing centre\" there, adding that several arrests were made. \n                  'I'm not so careful with what I say' - is Trump feeling more invincible than ever?\n                 \n                  Destruction of Gaza's al-Quds hospital seen by nurse whose colleagues tell her 'they are going to die'\n                 \n                  Pokemon pushes back against ICE deportation video - joining list riled by Trump administration\n                 \"Rose City Antifa, a recently designated domestic terrorist organization, illegally doxed ICE officers. They published their home address online and on public flyers. Individuals associated with Antifa also sent death threats to DHS personnel,\" DHS wrote on X. Speaking in the Oval Office on Thursday, Mr Trump said \"anarchy\" was taking place in Portland. He said: \"You go out to Portland, people die out there. Many people have died over the years in Portland. Portland is, I don't know how anybody lives there. It's amazing, but it's, it's anarchy out there. That's what they want. They want anarchy.\" In separate comments, Mr Trump said people were \"out of control\" in Portland and pledged to \"stop that very soon\". After Mr Trump's announcement, Oregon's Democratic governor Tina Kotek said she was reaching out to the White House for more information. \"We have been provided no information on the reason or purpose of any military mission. There is no national security threat in Portland. Our communities are safe and calm,\" she said. Read more: Trump threatens to move World Cup games from 'unsafe' host cities Portland's mayor Keith Wilson said in a statement that the \"number of necessary troops is zero, in Portland and any other American city\". But Republicans supported the move. US labour secretary Lori Chavez-DeRemer, who previously served as a Republican house representative for an Oregon district, said she had seen how \"lawlessness\" had turned Portland into a \"crime-ridden war zone\". In a post on X, she thanked Mr Trump \"for taking action to keep our ICE facilities protected and Make America Great Again\". Trump has sent military troops to the Democratic-controlled cities of Los Angeles and Washington DC so far in his second presidency. He has also discussed doing the same in Memphis and New Orleans, which are also Democratic strongholds."
    },
    {
        "title": "'I'm not so careful with what I say' - is Trump feeling more invincible than ever?",
        "description": "It was one sentence among the many words Donald Trump spoke this week that caught my attention.",
        "url": "https://news.sky.com/story/im-not-so-careful-with-what-i-say-is-trump-feeling-more-invincible-than-ever-13438999",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-white-house_7028989.jpg?20250923061937",
        "type": "Home",
        "Author": "David Blevins",
        "Date Published": "2025-09-27 23:00:00",
        "Headline": "From funerals to world summits, world peace to public health, Donald Trump projects the same image: rules are for others.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n It was one sentence among the many words Donald Trump spoke this week that caught my attention. Midway through a jaw-dropping news conference where he sensationally claimed to have \"found an answer on autism\", he said: \"Bobby (Kennedy) wants to be very careful with what he says, but I'm not so careful with what I say.\" The US president has gone from pushing the envelope to completely unfiltered. Last Sunday, moments after Charlie Kirk's widow Erika had publicly forgiven her husband's killer, Mr Trump told the congregation at his memorial service that he \"hates his opponents\". Twenty-four hours later, he drew fierce rebuke from medical experts by linking the use of Tylenol (paracetamol) during pregnancy to increased risk of autism. The president treats professional disapproval not as a liability but as evidence of authenticity, fuelling the aura that he is a challenger of conventions.  On Tuesday, he went to the United Nations, where his frustrations over a stalled escalator and teleprompter failure were the prelude to the most combative address. \n                  Donald Trump orders deployment of US troops to 'war-ravaged' Portland\n                 \n                  Destruction of Gaza's al-Quds hospital seen by nurse whose colleagues tell her 'they are going to die'\n                 \n                  Pokemon pushes back against ICE deportation video - joining list riled by Trump administration\n                 \"I'm really good at this stuff. Your countries are going to hell,\" he told his audience, deriding Europe's approach to immigration as a \"failed experiment of open borders\". Then came a U-turn on Ukraine, suggesting the country could win back all the land it has lost to Russia. Most politicians would be punished for inconsistency, but Mr Trump recasts this as strategic genius - framing himself as dictating the terms. It is hard to keep track when his expressed hopes for peace in Ukraine and Gaza are peppered with social media posts condemning the return of Jimmy Kimmel to late-night television.  Perhaps most striking of all is his reaction to the indictment of James Comey, the FBI director he fired during his first term. In theory, this should raise questions about the president's past conflicts with law enforcement, but he frames it as vindication, proof that his enemies fall while he survives.  Mr Trump has spent much of his political career cultivating an image of a man above the normal consequences of politics, law or diplomacy, but he appears to feel more invincible than ever. Read more from Sky News:Musk and Prince Andrew named in latest Epstein filesTrump: 'Looks like we have a eal' to end war in Gaza From funerals to world summits, world peace to public health, he projects the same image: rules are for others. It is the politics of the untouchable."
    },
    {
        "title": "Vijay rally stampede: At least 36 people killed and dozens injured at campaign event for Indian actor-politician",
        "description": "At least 36 people have been killed and dozens injured during a stampede at a campaign rally for actor-turned-politician Vijay - a huge star in the southern Indian state of Tamil Nadu.",
        "url": "https://news.sky.com/story/vijay-rally-stampede-at-least-36-people-killed-and-dozens-injured-at-event-for-indian-actor-politician-13439774",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-india-stampede-tamil-nadu_7034204.png?20250927205402",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-27 18:01:00",
        "Headline": "Vijay, one of Tamil cinema's biggest actors for three decades, has drawn massive crowds to his public meetings since launching his political party in 2024.",
        "Content": "At least 36 people have been killed and dozens injured during a stampede at a campaign rally for actor-turned-politician Vijay - a huge star in the southern Indian state of Tamil Nadu. Ma Subramanian, the state's health minister, said at least 40 people were injured at the event and that eight children were among the dead. Vijay, one of Tamil cinema's biggest actors for three decades, has drawn massive crowds to his public meetings since launching his political party, Tamilaga Vettri Kazhagam in 2024. A video posted to his social media last month showed the scale of his rallies.  Indian media reports, quoting local officials, said Saturday's stampede was triggered when a group of Vijay's supporters and fans fell while trying to get close to his bus. Footage also showed Vijay throwing water bottles from the top of the vehicle to fainting supporters during the rally, and calling for police help when the crowd became uncontrollable. \n                  India's state of Kerala fighting rise in cases of rare 'brain-eating' disease\n                 \n                  Internet access in Middle East and Asia disrupted after 'undersea cables cut'\n                 \n                  Chinese, Russian and Indian leaders seek to show unity and push for new world order in Beijing meeting\n                 Indian Prime Minister Narendra Modi said in a post on X: \"The unfortunate incident during a political rally in Karur, Tamil Nadu, is deeply saddening.\" In a post on social media following the incident, Vijay said his \"heart is shattered\". \"I extend my deepest condolences and sympathies to the families of my dear brothers and sisters who lost their lives in Karur,\" he added. \"I pray for the swift recovery of those receiving treatment in the hospital.\" Stampedes are relatively common in India when large crowds gather. In June, at least 11 people died after a crush outside the M Chinnaswamy Stadium after a cricket team won their first Indian Premier League (IPL) title. It is also not the first time Vijay's rallies have faced safety concerns, with at least six deaths reported after the first meeting of his political party when it was launched in October last year."
    },
    {
        "title": "Man dies and seven treated after suspected gas leak at takeaway restaurant in Walsall",
        "description": "A man has died after a suspected carbon monoxide leak at a takeaway restaurant in Walsall, near Wolverhampton.",
        "url": "https://news.sky.com/story/man-dies-and-seven-treated-after-suspected-gas-leak-at-takeaway-restaurant-in-walsall-13439893",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-west-midlands-walsall_7034261.png?20250927215753",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-27 20:15:00",
        "Headline": "Seven other people were treated at the scene in Walsall, near Wolverhampton, with a number of them taken to hospital.",
        "Content": "A man has died after a suspected carbon monoxide leak at a takeaway restaurant in Walsall, near Wolverhampton. West Midlands Police said that seven others were treated by medics after emergency services were called to the burger shop on Cresswell Crescent in Bloxwich at around 9.40pm on Friday. The force said that the man who died at the scene was in his 50s. Officers added that emergency workers were among the seven treated, and that some of those were taken to hospital. Locals were also evacuated from nearby houses and shops, and were allowed to return in the early hours of Saturday following tests. Cara Jackson, 23, who was working at the neighbouring One Stop convenience store and who lives nearby, told the PA news agency: \"There were three ambulances, four cop cars, a fire engine and the forensics obviously came after. \"I did see them doing CPR... I did see everything that happened. I've scarred a little. I don't really feel the best today because obviously I breathed it all in.\" \n                  Jaguar Land Rover production shutdown after cyber attack extended to 1 October\n                 \n                  West Midlands MP 'worried' about increase in hate crimes after 'racially aggravated' rape\n                 \n                  Hundreds gather to show solidarity with Sikh woman raped 'in racially aggravated attack'\n                 Local ward councillor Michael Coulson wrote on Facebook that the fire service were unable to access the property because a generator was \"releasing a mixture of gases\". Read more from Sky News:England crowned Women's Rugby World Cup championsElon Musk and Prince Andrew named in latest Epstein files releaseHackers 'behind nursery cyber attack' make ransom demand In an update on Saturday, he said: \"After tests were completed residents were allowed back in their homes at roughly 3am, and the shops are back open this morning. There is now a very small police presence and I thanked them for their support. \"I had done two litter picks around the shops in the last few days, including one completed just after 7pm last night, and I briefly spoke to those setting up the takeaway on both occasions. \"It's so incredibly tragic what has happened.\""
    },
    {
        "title": "England crowned Women's Rugby World Cup champions after emphatic win over Canada",
        "description": "England have been crowned Women's Rugby World Cup champions for the third time after crushing Canada 33-13.",
        "url": "https://news.sky.com/story/england-crowned-womens-rugby-world-cup-champions-after-emphatic-win-over-canada-13439407",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-zoe-aldcroft-megan-jones_7033948.jpg?20250927181835",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-27 16:45:00",
        "Headline": "The Red Roses and Maple Leafs played in front of a record-breaking home crowd of 81,885 at the Allianz Stadium in Twickenham, west London.",
        "Content": " England have been crowned Women's Rugby World Cup champions for the third time after crushing Canada 33-13. Two tries by Alex Matthews, plus one each from Ellie Kildunne, Amy Cokayne and Abbie Ward sealed it for the Red Roses. England, ranked as the world number one going into the match, were ahead by 13 points by the end of the first half - as they played in front of a record-breaking home crowd of 81,885 at the Allianz Stadium in Twickenham, west London. Canada mounted a spirited effort in the second half, but a decent spell of pressure was cut off when Matthews scored her second try of the afternoon. A conversion took the Red Roses to 33 points, giving them a comfortable 20 point lead over the Maple Leafs. The win marks the first time England have won the Women's Rugby World Cup in 11 years, after losing finals in 2017 and 2022. Among the first to congratulate the Red Roses were the Prince and Princess of Wales, who also praised Canada and said: \"You had an outstanding tournament. Both teams should be so proud!\" Prime Minister Sir Keir Starmer also praised the team and said: \"You have shown the very best of England and inspired a generation.\" After watching the game with Canadian Prime Minister Mark Carney, London's mayor Sir Sadiq Khan posted a photo of the pair while congratulating England. \"Huge congratulations to (the Red Roses) on their fantastic victory,\" he said. \"Another proud moment for women's rugby.\" 'Pinch me moment' Speaking to the BBC after being named player of the match, England's 23-year-old flanker Sadia Kabeya said: \"It's a pinch me moment. It's been years and years in the making, I am so happy we could pull it off. \"All props to Canada they are a great side and they put up a great fight here today.\" Ward also told the broadcaster: \"Honestly as soon as the whistle went I just burst into tears. It's truly been such a special day. A sold-out crowd at Twickenham. It was electric, in front of friends, family, it's amazing. \"The last final loss, that was then. This is a new team, this is a new chapter of women's rugby.\" Read more from Sky News:Prince of Wales says 2024 was 'hardest year' of his lifeUnite threatens to break link with LabourNuno Espirito Santo made new West Ham head coach Headed into the final, the Red Roses were on a 32-game winning streak and won their seventh straight Six Nations title back in April. England also won every one of their matches in the World Cup group stages, then secured victories over Scotland and France in the quarter and semi-finals, respectively. It also marked the second-ever Rugby World Cup final for Canada, ranked second in the world behind England. But despite their world ranking, Canada's women's team had to partly fund their way to the tournament. A crowdfunding page under the name Mission: Win Rugby World Cup 2025 raised nearly $1m (£534,000) to help cover the costs of sending the team to England."
    },
    {
        "title": "England crowned Women's Rugby World Cup champions after emphatic win over Canada",
        "description": "England have been crowned Women's Rugby World Cup champions for the third time after crushing Canada 33-13.",
        "url": "https://news.sky.com/story/england-crowned-womens-rugby-world-cup-champions-after-emphatic-win-over-canada-13439407",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-zoe-aldcroft-megan-jones_7033948.jpg?20250927181835",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-27 16:45:00",
        "Headline": "The Red Roses and Maple Leafs played in front of a record-breaking home crowd of 81,885 at the Allianz Stadium in Twickenham, west London.",
        "Content": " England have been crowned Women's Rugby World Cup champions for the third time after crushing Canada 33-13. Two tries by Alex Matthews, plus one each from Ellie Kildunne, Amy Cokayne and Abbie Ward sealed it for the Red Roses. England, ranked as the world number one going into the match, were ahead by 13 points by the end of the first half - as they played in front of a record-breaking home crowd of 81,885 at the Allianz Stadium in Twickenham, west London. Canada mounted a spirited effort in the second half, but a decent spell of pressure was cut off when Matthews scored her second try of the afternoon. A conversion took the Red Roses to 33 points, giving them a comfortable 20 point lead over the Maple Leafs. The win marks the first time England have won the Women's Rugby World Cup in 11 years, after losing finals in 2017 and 2022. Among the first to congratulate the Red Roses were the Prince and Princess of Wales, who also praised Canada and said: \"You had an outstanding tournament. Both teams should be so proud!\" Prime Minister Sir Keir Starmer also praised the team and said: \"You have shown the very best of England and inspired a generation.\" After watching the game with Canadian Prime Minister Mark Carney, London's mayor Sir Sadiq Khan posted a photo of the pair while congratulating England. \"Huge congratulations to (the Red Roses) on their fantastic victory,\" he said. \"Another proud moment for women's rugby.\" 'Pinch me moment' Speaking to the BBC after being named player of the match, England's 23-year-old flanker Sadia Kabeya said: \"It's a pinch me moment. It's been years and years in the making, I am so happy we could pull it off. \"All props to Canada they are a great side and they put up a great fight here today.\" Ward also told the broadcaster: \"Honestly as soon as the whistle went I just burst into tears. It's truly been such a special day. A sold-out crowd at Twickenham. It was electric, in front of friends, family, it's amazing. \"The last final loss, that was then. This is a new team, this is a new chapter of women's rugby.\" Read more from Sky News:Prince of Wales says 2024 was 'hardest year' of his lifeUnite threatens to break link with LabourNuno Espirito Santo made new West Ham head coach Headed into the final, the Red Roses were on a 32-game winning streak and won their seventh straight Six Nations title back in April. England also won every one of their matches in the World Cup group stages, then secured victories over Scotland and France in the quarter and semi-finals, respectively. It also marked the second-ever Rugby World Cup final for Canada, ranked second in the world behind England. But despite their world ranking, Canada's women's team had to partly fund their way to the tournament. A crowdfunding page under the name Mission: Win Rugby World Cup 2025 raised nearly $1m (£534,000) to help cover the costs of sending the team to England."
    },
    {
        "title": "Royals - and Russell Crowe - lead congratulations for England's Women's Rugby World Cup winners",
        "description": "The Prince and Princess of Wales and the prime minister are among those who have congratulated England on winning the Women's Rugby World Cup.",
        "url": "https://news.sky.com/story/royals-and-russell-crowe-lead-congratulations-for-englands-womens-rugby-world-cup-winners-13439733",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-england-zoe-aldcroft_7033952.jpg?20250927181921",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-27 17:28:00",
        "Headline": "Among the first to congratulate the Red Roses were the Prince and Princess of Wales, who also praised Canada and said they had \"an outstanding tournament\".",
        "Content": " The Prince and Princess of Wales and the prime minister are among those who have congratulated England on winning the Women's Rugby World Cup. The win, crushing Canada 33-13 at the Allianz Stadium in Twickenham, west London, marked England's third World Cup title, and their first since 2014. Two tries by Alex Matthews, plus one each from Ellie Kildunne, Amy Cokayne and Abbie Ward sealed it for the Red Roses. Among the first to congratulate the Red Roses were the Prince and Princess of Wales, who also praised Canada and said: \"You had an outstanding tournament. Both teams should be so proud!\"  Ahead of the final, the royals shared a photo of the princess with some of the Red Roses in cowboy hats. Prime Minister Sir Keir Starmer also praised the team and said: \"You have shown the very best of England and inspired a generation.\" Conservative leader Kemi Badenoch also called it an \"incredible performance\", and added: \"A proud moment for English rugby and for our country.\" Read more from Sky News:Prince of Wales says 2024 was 'hardest year' of his lifeUnite threatens to break link with LabourNuno Espirito Santo made new West Ham head coach After watching the game with Canadian Prime Minister Mark Carney, London's mayor Sir Sadiq Khan posted a photo of the pair while congratulating England. \"Huge congratulations to (the Red Roses) on their fantastic victory,\" he said. \"Another proud moment for women's rugby.\" In his own post on social media, Mr Carney said: \"On behalf of a proud nation, massive congratulations to Team Canada for an incredible run in the Rugby World Cup.\" Actor Russell Crowe - an avid rugby fan and, for this tournament, Canada supporter - also congratulated the Red Roses, saying on social media: \"Got to hand it to England Women's Rugby team. \"Solid, dominant and as it turns out, unbeatable on the day. Big game players every one of them. Bad luck Canada. You can hold your heads high. Remarkable run.\""
    },
    {
        "title": "Labour MPs gather in Liverpool as Starmer mounts fightback against Reform",
        "description": "Labour MPs are gathering in Liverpool for the annual party conference as Sir Keir Starmer attempts to mount a fightback against dire polling and threats to his leadership. ",
        "url": "https://news.sky.com/story/labour-mps-gather-in-liverpool-as-starmer-mounts-fightback-against-reform-13439788",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-starmer-labour_7033785.jpg?20250927173608",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-09-27 23:01:00",
        "Headline": "The conference is a chance for Sir Keir to draw a line under the chaos of recent weeks and convince his MPs he is the man who should lead the party into the next election. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Labour MPs are gathering in Liverpool for the annual party conference as Sir Keir Starmer attempts to mount a fightback against dire polling and threats to his leadership.  The prime minister said he will use the four-day event to show Labour can be an alternative to the \"toxic divide and decline\" offered by Reform UK, describing this as \"the fight of our times\". Sir Keir is under pressure after two separate polls predicted Nigel Farage's party will win the next general election as voters turn their backs on mainstream politics. It is the latest bit of bad news for the embattled prime minister, who has faced a month of scandals surrounding his top team alongside speculation Greater Manchester Mayor Andy Burnham could mount a leadership challenge. Speaking from the conference venue on Saturday night, Sir Keir said the next few days are a \"really big opportunity to make our case to the country, make it absolutely clear that patriotic national renewal is the way forward, not the toxic divide and decline that we get with Reform\". He later insisted he could \"pull things around\", telling The Sunday Times: \"It is the fight of our times and we've all got to be in it together. We don't have time for introspection, we don't have time for navel-gazing. \"You'll always get a bit of that at a Labour Party conference, but that is not going to solve the problems that face this country. \n                  Unite boss Sharon Graham threatens to break link with Labour on eve of conference\n                 \n                  Unite the union refuses to nominate either Labour deputy leadership contender\n                 \n                  Andy Burnham says Labour MPs want him to oust Starmer\n                 \"Once you appreciate the change - in the sense of the division that Reform would bring to our country and the shattering of what we are as a patriotic country - then you realise this is a fight which in the end is bigger than the Labour Party.\" Much of the next four days is likely to be dominated by discussions on how exactly Labour could beat Reform - and whether Sir Keir is the man for the job. PM's future in doubt There has been rampant speculation Mr Burnham could mount a leadership challenge after he made a series of high-profile interventions this week, criticising the direction of the government and claiming Labour MPs had asked him to stand.  The so-called \"King of the North\" has many hurdles to overcome before that could be a possibility - he would have to win a seat in Westminster through a by-election if one became available, then get 80 colleagues to back him. One MP told Sky News that lots of backbenchers are \"reluctantly coming to the conclusion\" that Sir Keir's downfall is a \"not a matter of if, but when\" - citing Mr Burnham or Health Secretary Wes Streeting as possible replacements However they stressed that they did not want to see the prime minister go and hope he can turn things around ahead of the local elections in May. Two-child benefit cap speculation Many MPs want the prime minister to use the conference to set out a positive vision that offers hope for the future - saying his rhetoric on \"tough choices\" during the first 12 months backfired with the public. The boss of Unite, Labour's biggest union funder, has threatened to break its link with the party unless it changes direction. In a signal the leadership is listening, there have been hints from senior ministers that the government could use the conference to scrap the controversial two-child benefit cap.  The limit is opposed by over 100 Labour MPs, both of Labour's deputy leadership candidates and other senior party figures such as Mr Burnham and former prime minister Gordon Brown. Two MPs who were suspended for rebelling over the measure last year - John McDonnell and Aspana Begum - had the whip reinstated on Friday. Mr McDonnell, the shadow chancellor under Jeremy Corbyn, said he hopes \"this is a signal the government has decided to scrap the cap\". Key announcements  Sir Keir's allies rallied round him ahead of the conference, with Business Secretary Peter Kyle claiming the prime minister received a \"rapturous reception\" at events he has been speaking at on Saturday. Sir Keir will address the conference on Tuesday but there will be speeches from cabinet ministers throughout the event, with Chancellor Rachel Reeves to speak on Monday.  The opening day will kick off with a pledge from Housing Secretary Steve Reed to construct three new towns before the next election, in Tempsford in Bedfordshire, Leeds South Bank, and Crews Hill, north London. In one of a number of announcements overnight, the government also said that it will underwrite a £1.5bn loan guarantee to Jaguar Land Rover as it continues to face a shutdown following a mass cyber attack. Meanwhile, Chancellor Rachel Reeves told The Times she is pushing for a new youth mobility scheme and an improved trading relationship with the European Union in a bid to reduce the need for tax rises in the forthcoming budget. And Home Secretary Shabana Mahmood signalled a major change in immigration policy, telling The Sun on Sunday she would \"reset\" immigration laws so foreigners must prove their social worth before being allowed to settle in Britain."
    },
    {
        "title": "Jaguar Land Rover rescued with £1.5bn government-backed loan after crippling cyber attack",
        "description": "The government will underwrite a &#163;1.5bn loan guarantee to Jaguar Land Rover (JLR) after a mass cyber attack forced a shutdown.",
        "url": "https://news.sky.com/story/jaguar-land-rover-rescued-with-16315bn-government-backed-loan-after-crippling-cyber-attack-13439969",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jaguar-land-rover-cars_6877897.jpg?20250406135225",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-27 22:17:00",
        "Headline": "JLR suspended production at its UK factories following the cyber attack on 31 August. The shutdown is expected to last until 1 October, leaving the largest UK carmaker's suppliers in limbo.",
        "Content": "The government will underwrite a £1.5bn loan guarantee to Jaguar Land Rover (JLR) after a mass cyber attack forced a shutdown. JLR suspended production at its UK factories following the cyber attack on 31 August. The shutdown is expected to last until 1 October, leaving the largest UK carmaker's suppliers in limbo. The loan is expected to give suppliers some certainty amid the continued shutdown, as the £1.5bn will help bolster JLR's cash reserves as it pays back companies in its supply chain. The government will give its backing to the loan through the Export Development Guarantee (EDG), a financial support mechanism aimed at helping British companies that sell their goods overseas.  The £1.5bn loan, from a commercial bank, will be paid back over five years. \"Following our decisive action, this loan guarantee will help support the supply chain and protect skilled jobs in the West Midlands, Merseyside and throughout the UK,\" Business Secretary Peter Kyle said. Chancellor Rachel Reeves added: \"Jaguar Land Rover is an iconic British company which employs tens of thousands of people - a jewel in the crown of our economy. \n                  Harrods customers' details stolen in IT systems breach\n                 \n                  Hackers claim to have stolen pictures, names and addresses of children in nursery firm cyber attack\n                 \n                  Many small firms reliant on Jaguar Land Rover have 'weeks left' before damage 'untenable'\n                 \"Today we are protecting thousands of those jobs with up to £1.5bn in additional private finance, helping them support their supply chain and protect a vital part of the British car industry.\" As a result of the attack, production was halted across the car-making supply chain, with thousands of staff off work. More than 33,000 people work directly for JLR in the UK, many of them on assembly lines in the West Midlands, the largest of which is in Solihull, and a plant at Halewood on Merseyside. An estimated 200,000 more are employed by several hundred companies in the supply chain, who have faced business interruption with their largest client out of action.  Ministers have had daily contact with JLR and cyber experts following the attack as the company attempts to restart production at its UK factories. Unions and politicians have warned that small suppliers producing parts for JLR could collapse as a result of the shutdown unless they receive urgent financial support. This week, Mr Kyle met workers and bosses at Webasto, which makes sunroofs for JLR. Read more:Small firms reliant on JLR have 'weeks left' before damage 'untenable'Harrods customers' details stolen in IT systems breachHackers claim to have stolen pictures, names and addresses of children in nursery firm cyber attack The brand has the largest supply chain in the UK automotive sector, which employs around 120,000 people and is largely made up of small and medium-sized businesses. The government's promise of underwriting the JLR loan has been praised by the Unite union, whose general secretary Sharon Graham said the loan was \"an important first step and demonstrates that the government has listened to the concerns raised in meetings with Unite over recent days\".  She added: \"This is exactly what the government should be doing, taking action to protect jobs. \"The money provided must now be used to ensure job guarantees and to also protect skills and pay in JLR and its supply chain.\""
    },
    {
        "title": "Prince Harry hits back at claims he was surprised that meeting with King was 'formal'",
        "description": "Prince Harry has described claims that he was surprised his recent reunion with the King was \"distinctly formal\" as \"categorically false\".",
        "url": "https://news.sky.com/story/prince-harry-hits-back-at-categorically-false-claims-meeting-with-king-were-formal-13439174",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-the-duke-of-sussex_7033195.jpg?20250927134339",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-09-27 12:05:00",
        "Headline": "Reports claimed the Duke of Sussex had joked about feeling like an official visitor - but a spokesperson for Prince Harry described it as \"invention fed\". ",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n Prince Harry has described claims that he was surprised his recent reunion with the King was \"distinctly formal\" as \"categorically false\". Reports in The Sun newspaper claimed he even joked that he was made to feel more like an official visitor rather than a family member in his meeting with his father earlier this month. But a spokesperson for the Duke of Sussex hit back on Saturday, saying: \"Recent reporting of The Duke's view of the tone of the meeting, is categorically false. \"The quotes attributed to him are pure invention fed, one can only assume, by sources intent on sabotaging any reconciliation between father and son. \"Presumably, those same sources have also chosen to disclose that gifts were exchanged. \"While we would have preferred such details to remain private, for the sake of clarity we can confirm that a framed photograph was handed over, however the image did not contain the Duke and Duchess.\" Harry is reported to have handed his father a framed picture of his children, Archie and Lilibet. \n                  Prince Harry makes surprise visit to Ukraine\n                 \n                  Meeting between Duke of Sussex and the King feels like a positive step - even if full reconciliation is likely to take time\n                 \n                  Prince Harry says King is 'great' after they have private tea in first meeting for 19 months\n                 In a statement, a Sun spokesperson noted that Harry \"confirms the exchange of gifts, including a family photograph\". They said the paper's story was a \"carefully-sourced account of the meeting\", adding: \"We have today updated the online article to include his new statement.\" 'Emotionally-charged response from Harry' It is a particularly pointed and emotionally-charged response from Harry and his team, suggesting that a story about his meeting with the King shows sources \"are intent on sabotaging any reconciliation between father and son\". Yes - Harry, since leaving the royals, has been a lot more outspoken about how he feels he's been treated by the press and sources inside the palace. But this comment is particularly swift, and the fact it's a quote from his spokesperson shows he deliberately wants to get his side on this out there. It's also indicative of a new team he's now got in place. Read more on the Royal Family:King and Queen to meet PopePrince Andrew named in Epstein filesPrince of Wales's 'hardest' year  It also emphasises how important that meeting was to Harry. The week that he was over in the UK was seen as a big step forward in terms of a reset for Harry, his work and public perceptions about him, but the fact that he also saw his father meant that he and his team could go home happy. It was the one piece of the jigsaw that wasn't entirely in his control, but it fell into place with that 50-minute meeting at Clarence House. Obviously, a lot has been said over the past five years since he left the Royal Family, and no one thinks that can be erased, but Harry has made it clear he wants reconciliation. He also said to a reporter who followed him to Ukraine, at the end of his week in the UK, that his father is his priority. Sadly, we can see from the spokesperson's quote that this only reinforces Harry's belief that people within the palace were always briefing against him and his family. Trust is still, on all sides, the biggest barrier to rebuilding and reconciliation."
    },
    {
        "title": "Unite boss Sharon Graham threatens to break link with Labour on eve of conference",
        "description": "The boss of Unite, Labour's biggest union funder, has threatened to break its link with the party unless it changes direction.",
        "url": "https://news.sky.com/story/unite-boss-sharon-graham-threatens-to-break-link-with-labour-on-eve-of-conference-13439250",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sharon-graham-unite_7033611.jpg?20250927164941",
        "type": "UK",
        "Author": "Tamara Cohen",
        "Date Published": "2025-09-27 13:23:00",
        "Headline": "Ms Graham has been a long-time critic of Sir Keir Starmer's agenda, accusing him of lacking vision.",
        "Content": "\n          Political correspondent\n              @tamcohen\n  The boss of Unite, Labour's biggest union funder, has threatened to break its link with the party unless it changes direction. Sharon Graham, general secretary of the union, told Sky News that, on the eve of a crucial party conference for the prime minister, Unite's support for Labour was hanging in the balance. She told Sunday Morning With Trevor Phillips: \"My members, whether it's public sector workers all the way through to defence, are asking, 'What is happening here?'   \"Now when that question cannot be answered, when we're effectively saying, 'Look, actually we cannot answer why we're still affiliated', then absolutely I think our members will choose to disaffiliate and that time is getting close.\" Asked when that decision might be made, she cited the budget, on 26 November, as \"an absolutely critical point of us knowing whether direction is going to change\". \n                  Labour MPs gather in Liverpool as Starmer mounts fightback against Reform\n                 \n                  Unite the union refuses to nominate either Labour deputy leadership contender\n                 \n                  Andy Burnham says Labour MPs want him to oust Starmer\n                 Ms Graham, who became leader in 2021, has been a long-time critic of Sir Keir Starmer's agenda, accusing him of lacking vision. The union has campaigned against his decision to cut winter fuel allowance for pensioners - which was later reversed - and has called for more taxes on the wealthy. But the firm threat to disaffiliate, and a timetable, highlights the acute trouble Sir Keir faces on multiple fronts, after a rocky few months which have seen his popularity plummet in the polls and his administration hit by resignations and scandals. There is now open discussion about his leadership, with Andy Burnham, the mayor of Greater Manchester, claiming he's been urged by MPs to mount a challenge.  Unite has more than a million members, the second-largest union affiliated to Labour. It donates £1.5m a year from its membership fees to the party. The union did not make an additional donation to Labour at the last election - as it has done previously - but was the biggest donor to its individual MPs and candidates. It has donated millions to the party in the past. Any decision to disaffiliate would need to be made at a Unite rules conference; of which the next is scheduled for 2027, but there is the option to convene emergency conferences earlier. Just 15 months into Sir Keir's premiership, in which he has promised to champion workers' rights, Ms Graham's comments are likely to anger the Labour leadership. Read more: Now is moment of 'maximum danger' for Starmer, Harriet Harman warns Unite, earlier this year, voted to suspend former deputy prime minister Angela Rayner of her union membership because of the government's handling of a long-running bin strike in Birmingham. Ms Graham has described the left-wing party being launched by Jeremy Corbyn as a \"sideshow\" and has brushed off speculation of a leadership challenge by Mr Burnham. This summer, she said if Unite dropped support from Labour it would \"focus on building a strong, independent workers' union that was the true, authentic voice for workers\". The annual Labour Party conference kicks off in Liverpool from Sunday. As a union affiliated with Labour, Unite has seats on the party's ruling national executive committee and can send delegates to its annual conference. Watch the full interview with Sharon Graham on Sunday Morning With Trevor Phillips from 8.30am on Sky News"
    },
    {
        "title": "Man dies and seven treated after suspected gas leak at takeaway restaurant in Walsall",
        "description": "A man has died after a suspected carbon monoxide leak at a takeaway restaurant in Walsall, near Wolverhampton.",
        "url": "https://news.sky.com/story/man-dies-and-seven-treated-after-suspected-gas-leak-at-takeaway-restaurant-in-walsall-13439893",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-west-midlands-walsall_7034261.png?20250927215753",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-27 20:15:00",
        "Headline": "Seven other people were treated at the scene in Walsall, near Wolverhampton, with a number of them taken to hospital.",
        "Content": "A man has died after a suspected carbon monoxide leak at a takeaway restaurant in Walsall, near Wolverhampton. West Midlands Police said that seven others were treated by medics after emergency services were called to the burger shop on Cresswell Crescent in Bloxwich at around 9.40pm on Friday. The force said that the man who died at the scene was in his 50s. Officers added that emergency workers were among the seven treated, and that some of those were taken to hospital. Locals were also evacuated from nearby houses and shops, and were allowed to return in the early hours of Saturday following tests. Cara Jackson, 23, who was working at the neighbouring One Stop convenience store and who lives nearby, told the PA news agency: \"There were three ambulances, four cop cars, a fire engine and the forensics obviously came after. \"I did see them doing CPR... I did see everything that happened. I've scarred a little. I don't really feel the best today because obviously I breathed it all in.\" \n                  Jaguar Land Rover production shutdown after cyber attack extended to 1 October\n                 \n                  West Midlands MP 'worried' about increase in hate crimes after 'racially aggravated' rape\n                 \n                  Hundreds gather to show solidarity with Sikh woman raped 'in racially aggravated attack'\n                 Local ward councillor Michael Coulson wrote on Facebook that the fire service were unable to access the property because a generator was \"releasing a mixture of gases\". Read more from Sky News:England crowned Women's Rugby World Cup championsElon Musk and Prince Andrew named in latest Epstein files releaseHackers 'behind nursery cyber attack' make ransom demand In an update on Saturday, he said: \"After tests were completed residents were allowed back in their homes at roughly 3am, and the shops are back open this morning. There is now a very small police presence and I thanked them for their support. \"I had done two litter picks around the shops in the last few days, including one completed just after 7pm last night, and I briefly spoke to those setting up the takeaway on both occasions. \"It's so incredibly tragic what has happened.\""
    },
    {
        "title": "Son of British couple detained in Iran has 'grave concerns' about their health",
        "description": "The son of a British couple who have been detained in Iran since January has told Sky News he has \"grave concerns\" about their wellbeing.",
        "url": "https://news.sky.com/story/son-of-british-couple-detained-in-iran-has-grave-concerns-about-their-health-13439248",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-craig-foreman-lindsay-foreman_7017157.jpg?20250911143119",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-27 13:06:00",
        "Headline": "Lindsay and Craig Foreman were arrested in January during a round-the-world motorbike trip and were later charged with espionage - allegations the couple deny.",
        "Content": " The son of a British couple who have been detained in Iran since January has told Sky News he has \"grave concerns\" about their wellbeing. Lindsay and Craig Foreman were arrested in January during a round-the-world motorbike trip and were later charged with espionage - allegations the couple deny. Speaking to Sky's Samantha Washington on Saturday, the couple's son Joe Bennett said the family was \"anticipating to hear\" any news after a court appearance, adding that \"it might be seven to 10 days after today's hearing\" before they get any updates.   The family previously said they had \"no clear information\" about the court hearing on Saturday - and said UK officials were also \"in the dark\" about it. Since they were arrested, Mr and Mrs Foreman have been detained in a facility in the Iranian city of Kerman, and have since been moved to separate prisons in the capital, Tehran. In August, the couple spoke to their family for the first time in seven months, who later said they were \"seriously worried\" about them after they were moved to one of Iran's \"harshest prisons\". Mr Bennett said his parents were \"essentially passing through\" and added that they \"couldn't have been more complimentary of the country and the people\" in Iran. \"They were there for a very short amount of time,\" he added. \"Four days in total, it was supposed to be, and they would have continued on their journey.\" He said: \"There's concerns - I think mentally that they're coping and surviving, and using whatever techniques possible to get through this time. \"But it's more the body and healthwise that we're concerned. There's been reports that Craig is constantly ill with multiple rounds of stomach bugs and flu, dental problems. \"And a very concerning thing that we've read and been told is that my mum was on a drip last week, but we don't know what that was for or why, so it causes grave concern. \"You know, the mental fortitude sounds like it's there, but it's how much the body can endure in the conditions that they're in.\" Mr Bennett previously told Sky News the couple were crammed into cells with more than 50 other prisoners, while suffering constant back pain caused by metal bunk beds. He echoed this on Friday, saying \"they're in inhuman conditions\", before adding that consular visits are being arranged for October. Read more from Sky News:Destruction of Gaza City hospital witnessed by nurseWho is Erika Kirk, Turning Point USA's new CEO?Elon Musk named in latest Epstein files release He also said Foreign Secretary Yvette Cooper has agreed to meet the family next month, adding that the Foreign Office has been \"very responsive\". However, Mr Bennett said \"the communication is very fractured\", before adding that discussions around the United Nations reapplying sanctions on Iran \"does cause concern naturally, but hopefully we can keep the issue separate\"."
    },
    {
        "title": "Nuno Espirito Santo made new West Ham head coach after Graham Potter sacking",
        "description": "West Ham have appointed Nuno Espirito Santo as their new head coach hours after announcing the sacking of Graham Potter.",
        "url": "https://news.sky.com/story/west-ham-sack-manager-graham-potter-after-poor-run-of-results-13439096",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-graham-potter-nuno-espirito-santo_7033367.jpg?20250927150405",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-27 09:37:00",
        "Headline": "Former Chelsea manager Potter was only in charge of the Hammers for 23 Premier League games, losing four of his opening five this season.",
        "Content": "West Ham have appointed Nuno Espirito Santo as their new head coach hours after announcing the sacking of Graham Potter. Nuno returns to the Premier League just 18 days after being axed by Nottingham Forest and has signed a three-year deal at the London Stadium. \"I am very pleased to be here and very proud to be representing West Ham United,\" the former Tottenham, Wolves and Forest manager said. \"My objective is to work hard to get the very best from the team and ensure that we are as competitive as we possibly can be. The work has already started and I am looking forward to the challenge that is ahead.\" He replaces Potter, who was only appointed in January when he took over from Julen Lopetegui on a two-and-a-half-year contract. In a statement, the club said the decision to sack Potter came because results early this season had \"not matched expectations\" and that \"the Board of Directors believe that a change is necessary in order to help improve the team's position in the Premier League as soon as possible\". Nuno's first match will come against Everton away on Monday night, who are led by former Hammers manager David Moyes. \n                  England crowned Women's Rugby World Cup champions after emphatic win over Canada\n                 \n                  Royals - and Russell Crowe - lead congratulations for England's Women's Rugby World Cup winners\n                 \n                  Labour MPs gather in Liverpool as Starmer mounts fightback against Reform\n                 West Ham's tough start to the 2025/26 campaign has seen them pick up just three points in their opening five games, with their four losses and sole win against Nottingham Forest leaving the side 19th in the league, above only winless Wolves. Potter was sacked after winning just six of 23 Premier League games, with his side finishing 14th last season. His assistant coach Bruno Saltor, first team coaches Billy Reid and Narcis Pelach, and goalkeeper coaches Casper Ankergren and Linus Kandolin also left the club. The club thanked Potter and his outgoing staff in its statement, adding the board \"wish them every success for the future\". Nuno's sacking at Forest came after he signed a new contract there in the summer, with the 51-year-old appearing to fall out with the club's co-owner Evangelos Marinakis. He said in August his relationship with Mr Marinakis was \"not the same\" and \"not so good as it was [last season]\". He had also openly criticised the senior figures at Forest overseeing their transfer strategy, saying his squad was \"unbalanced\" and \"very, very far\" from being ready for the new season. Conversely, just a day before his own sacking, Potter had told Sky Sports News he felt he was on \"the same page\" with the club's hierarchy when it came to recent poor performances - particularly the most recent 2-1 loss at home to Crystal Palace. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the latest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Sergei Lavrov warns NATO and EU countries over 'aggression' towards Russia",
        "description": "Vladimir Putin's top diplomat says Russia has no intention of attacking any NATO or EU member state but warned of a \"decisive response\" if any \"aggression\" was directed towards Moscow.",
        "url": "https://news.sky.com/story/sergei-lavrov-warns-nato-and-eu-countries-over-aggression-towards-russia-13439812",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-russia-lavrov-putin_7034121.jpg?20250927195425",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-27 18:51:00",
        "Headline": "Vladimir Putin's top diplomat addressed world leaders in New York at the 80th UN General Assembly.",
        "Content": " Vladimir Putin's top diplomat says Russia has no intention of attacking any NATO or EU member state but warned of a \"decisive response\" if any \"aggression\" was directed towards Moscow. Sergei Lavrov, Russia's foreign minister of 21 years, was speaking in New York at the 80th UN General Assembly, where he said threats against his country by Western nations were becoming \"increasingly common\". He was expected to address allegations made against Moscow that it has violated the airspace of several of its neighbours in recent weeks, heightening tensions across Europe. Estonia said Russian fighter jets flew into its airspace last week and remained there for 12 minutes, while a NATO air defence mission was recently carried out over Poland in response to \"unprecedented\" Russian drone incursions above the country.  Romania and Latvia also reported that single Russian drones had violated their airspace this month. \"Threats of force against Russia, accused of practically planning an attack on the North Atlantic Alliance and the European Union, are becoming increasingly common,\" Mr Lavrov said in New York. \n                  'Great regret' some European nations buying Russian oil and gas, says top EU official\n                 \n                  NATO responds after Russian military jets 'violate' Estonian airspace\n                 \n                  British fighter jets to fly air defence missions over Poland after Russia's drone incursion\n                 \"President Putin has repeatedly debunked such provocations. Russia has never had and does not have such intentions, but any aggression against my country will be met with a decisive response.\" At the start of the week, US President Donald Trump told the UN that NATO nations should shoot down Russian planes in their airspace. 'They will regret it' After his UN address, Mr Lavrov held a news conference, where he insisted again that Moscow \"has nothing to hide\" over the allegations against it. He was then asked by US correspondent Mark Stone what the Kremlin's response would be if a nation shot down a Russian drone or plane in Russian airspace. \"Try to understand that a drone, when it is flying not over our territory, but if it crosses someone's border but has left our airspace, probably everyone has the right to do with that drone whatever they consider necessary to ensure their security. \"But if there are attempts to shoot down any flying object, or indeed any object at all, on our territory, in our airspace, then I think people will seriously regret it, undertaking such a gross violation of our territorial integrity, our sovereignty.\"  'Hypocrisy' over Gaza comments At the start of his UN speech, Mr Lavrov took time to criticise Israel's actions in the Middle East, accusing it of trying to \"blow up\" the region and saying it had \"no justification\" for the \"brutal killings\" of Palestinians in Gaza. \"The illegal use of force against the Palestinians and aggressive actions against Iran, Qatar, Yemen, Lebanon, Syria and Iraq today threaten to blow up the entire Middle East.\" He also hit out at Israeli plans to annex the West Bank: \"There is no justification for plans to annex the West Bank. This is essentially a coup d'etat in diplomatic terms.\" Israel has repeatedly claimed that it does not target civilians in Gaza and says its military actions across the Middle East are strategically vital for its self-defence.  Mark Stone said Mr Lavrov's comments on Israel's actions will be seen as highly hypocritical given Russia's war in Ukraine which began in February 2022. \"Lavrov said Israel is bombing schools, it is bombing hospitals in Gaza,\" Stone said. \"Well, remember Mariupol and the rest of those cities in Ukraine, where Russia has and continues to do just the same thing? There's a certain hypocrisy there, for sure.\""
    },
    {
        "title": "Vijay rally stampede: At least 36 people killed and dozens injured at campaign event for Indian actor-politician",
        "description": "At least 36 people have been killed and dozens injured during a stampede at a campaign rally for actor-turned-politician Vijay - a huge star in the southern Indian state of Tamil Nadu.",
        "url": "https://news.sky.com/story/vijay-rally-stampede-at-least-36-people-killed-and-dozens-injured-at-event-for-indian-actor-politician-13439774",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-india-stampede-tamil-nadu_7034204.png?20250927205402",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-27 18:01:00",
        "Headline": "Vijay, one of Tamil cinema's biggest actors for three decades, has drawn massive crowds to his public meetings since launching his political party in 2024.",
        "Content": "At least 36 people have been killed and dozens injured during a stampede at a campaign rally for actor-turned-politician Vijay - a huge star in the southern Indian state of Tamil Nadu. Ma Subramanian, the state's health minister, said at least 40 people were injured at the event and that eight children were among the dead. Vijay, one of Tamil cinema's biggest actors for three decades, has drawn massive crowds to his public meetings since launching his political party, Tamilaga Vettri Kazhagam in 2024. A video posted to his social media last month showed the scale of his rallies.  Indian media reports, quoting local officials, said Saturday's stampede was triggered when a group of Vijay's supporters and fans fell while trying to get close to his bus. Footage also showed Vijay throwing water bottles from the top of the vehicle to fainting supporters during the rally, and calling for police help when the crowd became uncontrollable. \n                  India's state of Kerala fighting rise in cases of rare 'brain-eating' disease\n                 \n                  Internet access in Middle East and Asia disrupted after 'undersea cables cut'\n                 \n                  Chinese, Russian and Indian leaders seek to show unity and push for new world order in Beijing meeting\n                 Indian Prime Minister Narendra Modi said in a post on X: \"The unfortunate incident during a political rally in Karur, Tamil Nadu, is deeply saddening.\" In a post on social media following the incident, Vijay said his \"heart is shattered\". \"I extend my deepest condolences and sympathies to the families of my dear brothers and sisters who lost their lives in Karur,\" he added. \"I pray for the swift recovery of those receiving treatment in the hospital.\" Stampedes are relatively common in India when large crowds gather. In June, at least 11 people died after a crush outside the M Chinnaswamy Stadium after a cricket team won their first Indian Premier League (IPL) title. It is also not the first time Vijay's rallies have faced safety concerns, with at least six deaths reported after the first meeting of his political party when it was launched in October last year."
    },
    {
        "title": "Destruction of Gaza's al-Quds hospital seen by nurse whose colleagues tell her 'they are going to die'",
        "description": "A US volunteer nurse who worked in a Gaza hospital has said Israel is destroying its healthcare system.",
        "url": "https://news.sky.com/story/destruction-of-gazas-al-quds-hospital-seen-by-nurse-whose-colleagues-tell-her-they-are-going-to-die-13439084",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nurse-andee-vaughan_7032996.jpg?20250927094407",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-27 08:48:00",
        "Headline": "As hospitals and medical facilities close and staff flee for safety amid supply shortages, the volunteer nurse describes the \"insanity\" in the enclave, whose health care system she said Israel is purposefully dismantling.",
        "Content": " A US volunteer nurse who worked in a Gaza hospital has said Israel is destroying its healthcare system. Andee Vaughan, who has now left the enclave, said former colleagues at al-Quds hospital in Gaza City have messaged her asking why she has left and added: \"They are telling me they are going to die\". Two clinics have been destroyed by airstrikes and two damaged hospitals have been shut down during Israel's latest two-week ground offensive on Gaza's largest city. Latest - Russia addresses UN  A children's hospital and a specialised eye centre are among the sites to have closed, the UN has said, and Jordan has evacuated a field hospital. More than two dozen other medical stations and primary healthcare centres in the city, many of them crucial in malnutrition treatment, were forced to be suspended or shut down in September. Other facilities are barely functioning, with medicine, equipment, food and fuel in short supply. Patients and staff have been forced to leave hospitals, leaving behind only a few doctors and nurses to tend to children in incubators or other patients too ill to move. Israel says Hamas fighters have been hiding in hospitals, which have been used to launch raids on Israeli assets. Ms Vaughan, from Seattle, who arrived in Gaza in July, kept a video diary of her time at al-Quds, sharing dozens of films with The Associated Press, which verified them. Describing the \"insanity\" of the situation, Ms Vaughan recalled how a patient with severe burns on 40% of his body was dropped off at a field of rubble and told by medics to find his way to a clinic for treatment. \"That is the state of the [Gaza] healthcare system,\" which she claims Israel is purposefully dismantling. Vaughan shot videos on her phone showing fighter jets attacking the city. In one, her room shakes, and huge plumes of smoke block the view from her window; in another, an explosion rocks the walls of one of the hospital's lower floors. Comforting a 13-day-old baby In the neo-natal unit, she held \"skin to skin\" one of the two remaining babies - just 13 days old - to try to soothe her. She said the baby's heart rate dropped dangerously low as explosions went off nearby. Hundreds of thousands of Palestinians remain in Gaza City, defying Israeli orders to leave, enduring what experts have assessed as famine conditions. 'No genocide in Gaza' - Netanyahu On Friday, Israeli Prime Minister Benjamin Netanyahu told the UN that claims Israel is committing genocide in Gaza are false, and said: \"If Hamas agrees to demands, war could end.\" Mr Netanyahu's forces have closed the border crossing into northern Gaza since 12 September, preventing direct aid shipments to the city, while aid groups have scrambled to deliver supplies from the south.  Read more:Microsoft blocks Israeli militaryWhy recognising Palestine mattersCan Netanyahu get out of this? The 'Middle East Houdini''s biggest test At least 32 people were killed by overnight Israeli airstrikes in Gaza, the Hamas-run Gaza Health Ministry said on Saturday. The UN said on Friday that Israel is striking Gaza every eight to nine minutes on average, with around 16,500 people fleeing Gaza City on Thursday alone. More than 65,000 people have died since Israel began its campaign in the enclave, with more than 167,000 others wounded, according to the ministry. Israel's military action was a response to the Hamas-led attack on southern Israel on 7 October 2023, which left around 1,200 people dead and 251 taken hostage, 48 of whom are still in Gaza."
    },
    {
        "title": "'I'm not so careful with what I say' - is Trump feeling more invincible than ever?",
        "description": "It was one sentence among the many words Donald Trump spoke this week that caught my attention.",
        "url": "https://news.sky.com/story/im-not-so-careful-with-what-i-say-is-trump-feeling-more-invincible-than-ever-13438999",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-white-house_7028989.jpg?20250923061937",
        "type": "World",
        "Author": "David Blevins",
        "Date Published": "2025-09-27 23:00:00",
        "Headline": "From funerals to world summits, world peace to public health, Donald Trump projects the same image: rules are for others.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n It was one sentence among the many words Donald Trump spoke this week that caught my attention. Midway through a jaw-dropping news conference where he sensationally claimed to have \"found an answer on autism\", he said: \"Bobby (Kennedy) wants to be very careful with what he says, but I'm not so careful with what I say.\" The US president has gone from pushing the envelope to completely unfiltered. Last Sunday, moments after Charlie Kirk's widow Erika had publicly forgiven her husband's killer, Mr Trump told the congregation at his memorial service that he \"hates his opponents\". Twenty-four hours later, he drew fierce rebuke from medical experts by linking the use of Tylenol (paracetamol) during pregnancy to increased risk of autism. The president treats professional disapproval not as a liability but as evidence of authenticity, fuelling the aura that he is a challenger of conventions.  On Tuesday, he went to the United Nations, where his frustrations over a stalled escalator and teleprompter failure were the prelude to the most combative address. \n                  Donald Trump orders deployment of US troops to 'war-ravaged' Portland\n                 \n                  Destruction of Gaza's al-Quds hospital seen by nurse whose colleagues tell her 'they are going to die'\n                 \n                  Pokemon pushes back against ICE deportation video - joining list riled by Trump administration\n                 \"I'm really good at this stuff. Your countries are going to hell,\" he told his audience, deriding Europe's approach to immigration as a \"failed experiment of open borders\". Then came a U-turn on Ukraine, suggesting the country could win back all the land it has lost to Russia. Most politicians would be punished for inconsistency, but Mr Trump recasts this as strategic genius - framing himself as dictating the terms. It is hard to keep track when his expressed hopes for peace in Ukraine and Gaza are peppered with social media posts condemning the return of Jimmy Kimmel to late-night television.  Perhaps most striking of all is his reaction to the indictment of James Comey, the FBI director he fired during his first term. In theory, this should raise questions about the president's past conflicts with law enforcement, but he frames it as vindication, proof that his enemies fall while he survives.  Mr Trump has spent much of his political career cultivating an image of a man above the normal consequences of politics, law or diplomacy, but he appears to feel more invincible than ever. Read more from Sky News:Musk and Prince Andrew named in latest Epstein filesTrump: 'Looks like we have a eal' to end war in Gaza From funerals to world summits, world peace to public health, he projects the same image: rules are for others. It is the politics of the untouchable."
    },
    {
        "title": "Son of British couple detained in Iran has 'grave concerns' about their health",
        "description": "The son of a British couple who have been detained in Iran since January has told Sky News he has \"grave concerns\" about their wellbeing.",
        "url": "https://news.sky.com/story/son-of-british-couple-detained-in-iran-has-grave-concerns-about-their-health-13439248",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-craig-foreman-lindsay-foreman_7017157.jpg?20250911143119",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-27 13:06:00",
        "Headline": "Lindsay and Craig Foreman were arrested in January during a round-the-world motorbike trip and were later charged with espionage - allegations the couple deny.",
        "Content": " The son of a British couple who have been detained in Iran since January has told Sky News he has \"grave concerns\" about their wellbeing. Lindsay and Craig Foreman were arrested in January during a round-the-world motorbike trip and were later charged with espionage - allegations the couple deny. Speaking to Sky's Samantha Washington on Saturday, the couple's son Joe Bennett said the family was \"anticipating to hear\" any news after a court appearance, adding that \"it might be seven to 10 days after today's hearing\" before they get any updates.   The family previously said they had \"no clear information\" about the court hearing on Saturday - and said UK officials were also \"in the dark\" about it. Since they were arrested, Mr and Mrs Foreman have been detained in a facility in the Iranian city of Kerman, and have since been moved to separate prisons in the capital, Tehran. In August, the couple spoke to their family for the first time in seven months, who later said they were \"seriously worried\" about them after they were moved to one of Iran's \"harshest prisons\". Mr Bennett said his parents were \"essentially passing through\" and added that they \"couldn't have been more complimentary of the country and the people\" in Iran. \"They were there for a very short amount of time,\" he added. \"Four days in total, it was supposed to be, and they would have continued on their journey.\" He said: \"There's concerns - I think mentally that they're coping and surviving, and using whatever techniques possible to get through this time. \"But it's more the body and healthwise that we're concerned. There's been reports that Craig is constantly ill with multiple rounds of stomach bugs and flu, dental problems. \"And a very concerning thing that we've read and been told is that my mum was on a drip last week, but we don't know what that was for or why, so it causes grave concern. \"You know, the mental fortitude sounds like it's there, but it's how much the body can endure in the conditions that they're in.\" Mr Bennett previously told Sky News the couple were crammed into cells with more than 50 other prisoners, while suffering constant back pain caused by metal bunk beds. He echoed this on Friday, saying \"they're in inhuman conditions\", before adding that consular visits are being arranged for October. Read more from Sky News:Destruction of Gaza City hospital witnessed by nurseWho is Erika Kirk, Turning Point USA's new CEO?Elon Musk named in latest Epstein files release He also said Foreign Secretary Yvette Cooper has agreed to meet the family next month, adding that the Foreign Office has been \"very responsive\". However, Mr Bennett said \"the communication is very fractured\", before adding that discussions around the United Nations reapplying sanctions on Iran \"does cause concern naturally, but hopefully we can keep the issue separate\"."
    },
    {
        "title": "Gustavo Petro: US revokes Colombian president's visa after he urges troops to disobey Donald Trump's orders",
        "description": "The US has said it will cancel the visa of the President of Colombia after he urged US troops to disobey Donald Trump's orders.",
        "url": "https://news.sky.com/story/gustavo-petro-us-revokes-colombian-presidents-visa-after-he-urges-troops-to-disobey-donald-trumps-orders-13439033",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gustavo-petro-colombian-president_7032920.jpg?20250927074836",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-27 06:44:00",
        "Headline": "Mr Petro called for a global armed force \"bigger than that of the United States\" to be formed to liberate Palestinians and urged US soldiers to \"disobey the orders of Trump\" and \"obey the orders of humanity\".",
        "Content": "The US has said it will cancel the visa of the President of Colombia after he urged US troops to disobey Donald Trump's orders. Speaking at a pro-Palestinian demonstration outside the UN in New York on Friday, Gustavo Petro called for a global armed force with the priority of freeing Palestinians. Mr Petro, who appeared at the rally alongside Roger Waters of Pink Floyd, said in Spanish that the force \"has to be bigger than that of the United States. \"I ask all the soldiers of the army of the United States not to point their guns at people. Disobey the orders of Trump. Obey the orders of humanity.\" The US state department said in a post on X that it will \"revoke Petro's visa due to his reckless and incendiary actions\". Mr Petro, a prominent critic of Israel's war in Gaza, which the US has backed, used his speech at the UN General Assembly on Tuesday to accuse Mr Trump of being \"complicit in genocide\" there and demanding \"criminal proceedings\" over US missile attacks on suspected drug-running boats in the Caribbean. It comes as strikes on drug traffickers inside Venezuela could start within weeks, according to NBC, Sky's US partner. \n                  Donald Trump orders deployment of US troops to 'war-ravaged' Portland\n                 \n                  'I'm not so careful with what I say' - is Trump feeling more invincible than ever?\n                 \n                  Charlie Kirk's movement is growing in the wake of his assassination - as is the chasm in US politics\n                 Quoting US officials familiar with the planning, NBC said Mr Trump has not approved anything yet, but is contemplating drone strikes on trafficking groups' members, leadership, and laboratories because his administration feels Venezuelan President Nicolás Maduro is not doing enough to stop the flow of illegal drugs out of his country. In recent weeks, the US military has attacked at least three boats from Venezuela allegedly carrying narco-traffickers and drugs that could threaten Americans, President Donald Trump said on Truth Social, without showing evidence that drugs were on all the vessels. At least eight US ships with more than 4,000 personnel have been sent to the Caribbean, along with F-35 fighter jets. Washington is offering a $50m (£37m) reward for the arrest of Mr Maduro, whom it accuses of working with cartels sending cocaine, fentanyl and gang members to the US. Venezuela isn't a significant cocaine producer, but is thought to be a major departure point for flights carrying the drug elsewhere, while most of the illegal fentanyl transported to the US comes from Mexico. Read more on Sky News:Charlie Kirk's movement is growingMusk and Prince Andrew in Epstein filesDiplomats walk out on Netanyahu at UN Colombia is Washington's main ally in the fight against drug trafficking, but relations between them have soured this year. Soon after Mr Trump returned to the White House in January, President Petro refused to allow military flights carrying deportees as part of his US counterpart's immigration crackdown to land in Colombia. He agreed to accept the migrants after both countries threatened tariffs on each other and after the US cancelled visa appointments for Colombians. Earlier this month, the US named Colombia on a list of countries that it said had failed to uphold their counter-narcotics agreements, blaming Colombia's political leadership."
    },
    {
        "title": "Donald Trump orders deployment of US troops to 'war-ravaged' Portland",
        "description": "Donald Trump has ordered the deployment of US troops to \"war-ravaged Portland\" in the state of Oregon, authorising the use of \"full force\" if needed.",
        "url": "https://news.sky.com/story/donald-trump-orders-deployment-of-us-troops-to-war-ravaged-portland-13439888",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-protest-in-portland_7034428.jpg?20250928025428",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-27 19:50:00",
        "Headline": "In a post on Truth Social, the US president said he was authorising the use of \"full force\" to protect ICE facilities in Portland, Oregon, if necessary.",
        "Content": "Donald Trump has ordered the deployment of US troops to \"war-ravaged Portland\" in the state of Oregon, authorising the use of \"full force\" if needed. The US president said he was directing US defence secretary Pete Hegseth to make the move in order to protect the city \"and any of our ICE facilities under siege from attack by Antifa and other domestic terrorists\". Mr Trump did not specify whether he would send in National Guard troops or the US military. The move comes after a gunman opened fire on an Immigration and Customs Enforcement (ICE) field office in Dallas on Wednesday, wounding two detainees and killing another.   The ICE facility in Portland has been targeted by protesters since June, sometimes leading to violent clashes. On Friday, the Department of Homeland Security (DHS) said demonstrators had \"repeatedly attacked and laid siege to an ICE processing centre\" there, adding that several arrests were made. \n                  'I'm not so careful with what I say' - is Trump feeling more invincible than ever?\n                 \n                  Destruction of Gaza's al-Quds hospital seen by nurse whose colleagues tell her 'they are going to die'\n                 \n                  Pokemon pushes back against ICE deportation video - joining list riled by Trump administration\n                 \"Rose City Antifa, a recently designated domestic terrorist organization, illegally doxed ICE officers. They published their home address online and on public flyers. Individuals associated with Antifa also sent death threats to DHS personnel,\" DHS wrote on X. Speaking in the Oval Office on Thursday, Mr Trump said \"anarchy\" was taking place in Portland. He said: \"You go out to Portland, people die out there. Many people have died over the years in Portland. Portland is, I don't know how anybody lives there. It's amazing, but it's, it's anarchy out there. That's what they want. They want anarchy.\" In separate comments, Mr Trump said people were \"out of control\" in Portland and pledged to \"stop that very soon\". After Mr Trump's announcement, Oregon's Democratic governor Tina Kotek said she was reaching out to the White House for more information. \"We have been provided no information on the reason or purpose of any military mission. There is no national security threat in Portland. Our communities are safe and calm,\" she said. Read more: Trump threatens to move World Cup games from 'unsafe' host cities Portland's mayor Keith Wilson said in a statement that the \"number of necessary troops is zero, in Portland and any other American city\". But Republicans supported the move. US labour secretary Lori Chavez-DeRemer, who previously served as a Republican house representative for an Oregon district, said she had seen how \"lawlessness\" had turned Portland into a \"crime-ridden war zone\". In a post on X, she thanked Mr Trump \"for taking action to keep our ICE facilities protected and Make America Great Again\". Trump has sent military troops to the Democratic-controlled cities of Los Angeles and Washington DC so far in his second presidency. He has also discussed doing the same in Memphis and New Orleans, which are also Democratic strongholds."
    },
    {
        "title": "'I'm not so careful with what I say' - is Trump feeling more invincible than ever?",
        "description": "It was one sentence among the many words Donald Trump spoke this week that caught my attention.",
        "url": "https://news.sky.com/story/im-not-so-careful-with-what-i-say-is-trump-feeling-more-invincible-than-ever-13438999",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-white-house_7028989.jpg?20250923061937",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-09-27 23:00:00",
        "Headline": "From funerals to world summits, world peace to public health, Donald Trump projects the same image: rules are for others.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n It was one sentence among the many words Donald Trump spoke this week that caught my attention. Midway through a jaw-dropping news conference where he sensationally claimed to have \"found an answer on autism\", he said: \"Bobby (Kennedy) wants to be very careful with what he says, but I'm not so careful with what I say.\" The US president has gone from pushing the envelope to completely unfiltered. Last Sunday, moments after Charlie Kirk's widow Erika had publicly forgiven her husband's killer, Mr Trump told the congregation at his memorial service that he \"hates his opponents\". Twenty-four hours later, he drew fierce rebuke from medical experts by linking the use of Tylenol (paracetamol) during pregnancy to increased risk of autism. The president treats professional disapproval not as a liability but as evidence of authenticity, fuelling the aura that he is a challenger of conventions.  On Tuesday, he went to the United Nations, where his frustrations over a stalled escalator and teleprompter failure were the prelude to the most combative address. \n                  Donald Trump orders deployment of US troops to 'war-ravaged' Portland\n                 \n                  Destruction of Gaza's al-Quds hospital seen by nurse whose colleagues tell her 'they are going to die'\n                 \n                  Pokemon pushes back against ICE deportation video - joining list riled by Trump administration\n                 \"I'm really good at this stuff. Your countries are going to hell,\" he told his audience, deriding Europe's approach to immigration as a \"failed experiment of open borders\". Then came a U-turn on Ukraine, suggesting the country could win back all the land it has lost to Russia. Most politicians would be punished for inconsistency, but Mr Trump recasts this as strategic genius - framing himself as dictating the terms. It is hard to keep track when his expressed hopes for peace in Ukraine and Gaza are peppered with social media posts condemning the return of Jimmy Kimmel to late-night television.  Perhaps most striking of all is his reaction to the indictment of James Comey, the FBI director he fired during his first term. In theory, this should raise questions about the president's past conflicts with law enforcement, but he frames it as vindication, proof that his enemies fall while he survives.  Mr Trump has spent much of his political career cultivating an image of a man above the normal consequences of politics, law or diplomacy, but he appears to feel more invincible than ever. Read more from Sky News:Musk and Prince Andrew named in latest Epstein filesTrump: 'Looks like we have a eal' to end war in Gaza From funerals to world summits, world peace to public health, he projects the same image: rules are for others. It is the politics of the untouchable."
    },
    {
        "title": "Gustavo Petro: US revokes Colombian president's visa after he urges troops to disobey Donald Trump's orders",
        "description": "The US has said it will cancel the visa of the President of Colombia after he urged US troops to disobey Donald Trump's orders.",
        "url": "https://news.sky.com/story/gustavo-petro-us-revokes-colombian-presidents-visa-after-he-urges-troops-to-disobey-donald-trumps-orders-13439033",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gustavo-petro-colombian-president_7032920.jpg?20250927074836",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-27 06:44:00",
        "Headline": "Mr Petro called for a global armed force \"bigger than that of the United States\" to be formed to liberate Palestinians and urged US soldiers to \"disobey the orders of Trump\" and \"obey the orders of humanity\".",
        "Content": "The US has said it will cancel the visa of the President of Colombia after he urged US troops to disobey Donald Trump's orders. Speaking at a pro-Palestinian demonstration outside the UN in New York on Friday, Gustavo Petro called for a global armed force with the priority of freeing Palestinians. Mr Petro, who appeared at the rally alongside Roger Waters of Pink Floyd, said in Spanish that the force \"has to be bigger than that of the United States. \"I ask all the soldiers of the army of the United States not to point their guns at people. Disobey the orders of Trump. Obey the orders of humanity.\" The US state department said in a post on X that it will \"revoke Petro's visa due to his reckless and incendiary actions\". Mr Petro, a prominent critic of Israel's war in Gaza, which the US has backed, used his speech at the UN General Assembly on Tuesday to accuse Mr Trump of being \"complicit in genocide\" there and demanding \"criminal proceedings\" over US missile attacks on suspected drug-running boats in the Caribbean. It comes as strikes on drug traffickers inside Venezuela could start within weeks, according to NBC, Sky's US partner. \n                  Donald Trump orders deployment of US troops to 'war-ravaged' Portland\n                 \n                  'I'm not so careful with what I say' - is Trump feeling more invincible than ever?\n                 \n                  Charlie Kirk's movement is growing in the wake of his assassination - as is the chasm in US politics\n                 Quoting US officials familiar with the planning, NBC said Mr Trump has not approved anything yet, but is contemplating drone strikes on trafficking groups' members, leadership, and laboratories because his administration feels Venezuelan President Nicolás Maduro is not doing enough to stop the flow of illegal drugs out of his country. In recent weeks, the US military has attacked at least three boats from Venezuela allegedly carrying narco-traffickers and drugs that could threaten Americans, President Donald Trump said on Truth Social, without showing evidence that drugs were on all the vessels. At least eight US ships with more than 4,000 personnel have been sent to the Caribbean, along with F-35 fighter jets. Washington is offering a $50m (£37m) reward for the arrest of Mr Maduro, whom it accuses of working with cartels sending cocaine, fentanyl and gang members to the US. Venezuela isn't a significant cocaine producer, but is thought to be a major departure point for flights carrying the drug elsewhere, while most of the illegal fentanyl transported to the US comes from Mexico. Read more on Sky News:Charlie Kirk's movement is growingMusk and Prince Andrew in Epstein filesDiplomats walk out on Netanyahu at UN Colombia is Washington's main ally in the fight against drug trafficking, but relations between them have soured this year. Soon after Mr Trump returned to the White House in January, President Petro refused to allow military flights carrying deportees as part of his US counterpart's immigration crackdown to land in Colombia. He agreed to accept the migrants after both countries threatened tariffs on each other and after the US cancelled visa appointments for Colombians. Earlier this month, the US named Colombia on a list of countries that it said had failed to uphold their counter-narcotics agreements, blaming Colombia's political leadership."
    },
    {
        "title": "Jaguar Land Rover rescued with £1.5bn government-backed loan after crippling cyber attack",
        "description": "The government will underwrite a &#163;1.5bn loan guarantee to Jaguar Land Rover (JLR) after a mass cyber attack forced a shutdown.",
        "url": "https://news.sky.com/story/jaguar-land-rover-rescued-with-16315bn-government-backed-loan-after-crippling-cyber-attack-13439969",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jaguar-land-rover-cars_6877897.jpg?20250406135225",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-27 22:17:00",
        "Headline": "JLR suspended production at its UK factories following the cyber attack on 31 August. The shutdown is expected to last until 1 October, leaving the largest UK carmaker's suppliers in limbo.",
        "Content": "The government will underwrite a £1.5bn loan guarantee to Jaguar Land Rover (JLR) after a mass cyber attack forced a shutdown. JLR suspended production at its UK factories following the cyber attack on 31 August. The shutdown is expected to last until 1 October, leaving the largest UK carmaker's suppliers in limbo. The loan is expected to give suppliers some certainty amid the continued shutdown, as the £1.5bn will help bolster JLR's cash reserves as it pays back companies in its supply chain. The government will give its backing to the loan through the Export Development Guarantee (EDG), a financial support mechanism aimed at helping British companies that sell their goods overseas.  The £1.5bn loan, from a commercial bank, will be paid back over five years. \"Following our decisive action, this loan guarantee will help support the supply chain and protect skilled jobs in the West Midlands, Merseyside and throughout the UK,\" Business Secretary Peter Kyle said. Chancellor Rachel Reeves added: \"Jaguar Land Rover is an iconic British company which employs tens of thousands of people - a jewel in the crown of our economy. \n                  Harrods customers' details stolen in IT systems breach\n                 \n                  Hackers claim to have stolen pictures, names and addresses of children in nursery firm cyber attack\n                 \n                  Many small firms reliant on Jaguar Land Rover have 'weeks left' before damage 'untenable'\n                 \"Today we are protecting thousands of those jobs with up to £1.5bn in additional private finance, helping them support their supply chain and protect a vital part of the British car industry.\" As a result of the attack, production was halted across the car-making supply chain, with thousands of staff off work. More than 33,000 people work directly for JLR in the UK, many of them on assembly lines in the West Midlands, the largest of which is in Solihull, and a plant at Halewood on Merseyside. An estimated 200,000 more are employed by several hundred companies in the supply chain, who have faced business interruption with their largest client out of action.  Ministers have had daily contact with JLR and cyber experts following the attack as the company attempts to restart production at its UK factories. Unions and politicians have warned that small suppliers producing parts for JLR could collapse as a result of the shutdown unless they receive urgent financial support. This week, Mr Kyle met workers and bosses at Webasto, which makes sunroofs for JLR. Read more:Small firms reliant on JLR have 'weeks left' before damage 'untenable'Harrods customers' details stolen in IT systems breachHackers claim to have stolen pictures, names and addresses of children in nursery firm cyber attack The brand has the largest supply chain in the UK automotive sector, which employs around 120,000 people and is largely made up of small and medium-sized businesses. The government's promise of underwriting the JLR loan has been praised by the Unite union, whose general secretary Sharon Graham said the loan was \"an important first step and demonstrates that the government has listened to the concerns raised in meetings with Unite over recent days\".  She added: \"This is exactly what the government should be doing, taking action to protect jobs. \"The money provided must now be used to ensure job guarantees and to also protect skills and pay in JLR and its supply chain.\""
    },
    {
        "title": "Energy group Ovo plots sale of stake in software arm Kaluza",
        "description": "The energy supplier Ovo is plotting the sale of a stake in its software arm at a 'unicorn' valuation as part of efforts to strengthen the balance sheet of Britain's fourth-largest residential gas and electricity group.",
        "url": "https://news.sky.com/story/energy-group-ovo-plots-sale-of-stake-in-software-arm-kaluza-13439020",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ovo-energy-power_7032894.jpg?20250927100440",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-27 06:18:00",
        "Headline": "Britain's fourth-biggest home energy supplier has appointed Arma Partners to explore the sale of a further stake in Kaluza as it seeks to fortify its balance sheet, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The energy supplier Ovo is plotting the sale of a stake in its software arm at a 'unicorn' valuation as part of efforts to strengthen the balance sheet of Britain's fourth-largest residential gas and electricity group. Sky News has learnt that Ovo, which has just under four million retail customers, has appointed Arma Partners, the investment bank, to explore options for Kaluza. It replicates a move by larger rival Octopus Energy - revealed by Sky News - to hire advisers to work on a demerger of its Kraken software arm at a potential valuation of well over $10bn (£7.4bn). Kaluza, which describes itself as an energy intelligence platform and this week announced a licensing partnership with the French-based energy group Engie, is 80%-owned by Ovo. The remaining 20% is owned by AGL, an Australian energy company which bought a stake last year in a deal valuing Kaluza at $500m (£395m). Industry sources said that Ovo was likely to seek a valuation for Kaluza in any new transaction of well over $1bn, although they added that there were questions about the software business's path to sustainable profitability and its pipeline of new customers. One analyst suggested that Kaluza's majority-owner could pitch a valuation for Kaluza - run by chief executive Melissa Gander - of as much as $2.5bn based on annual recurring revenue (ARR). \n                  Energy bill payers to back 'super-battery' projects\n                 \n                  Octopus Energy hires Goldman to sell minority stake in Kraken\n                 \n                  UK and US firms announce deals in new 'golden age' of nuclear power ahead of Trump visit\n                 Kaluza recently bought Beige Technologies, an Australian energy software specialist, in order to strengthen its presence in the Asia-Pacific region. The prospective Kaluza stake sale comes amid a wider effort by Ovo to bolster its financial position. Rothschild, the investment bank, has been orchestrating talks with potential investors about a plan to inject in the region of £300m into the company. At one point, this is understood to have included discussions with Iberdrola, the owner of rival supplier Scottish Power. Centrica, the owner of British Gas, may also have expressed an interest in examining a deal, according to banking sources. A deal with another third party is said to be likely before the end of the year. On Friday, Sky News revealed that the company - like Octopus Energy - had so far failed to meet targets imposed as part of a new capital adequacy regime overseen by Ofgem, the industry regulator. A spokesperson for Ovo said it had \"taken proactive measures to align with Ofgem's new capital rules, working constructively to meet the requirements.\" Read more on Sky News:Ovo admits Ofgem issuesHarrods' customers' details stolenWhat to ask estate agents Ovo recently named Dame Jayne-Anne Gadhia, the former boss of Virgin Money, as the independent chair of its retail arm. Founded by Stephen Fitzpatrick, the entrepreneur who now owns London's Kensington Roof Gardens, Ovo's existing shareholders include the private equity firm Mayfair Equity Partners, Morgan Stanley Investment Management and Mitsubishi Corporation, the Japanese conglomerate. Under Mr Fitzpatrick, who launched Ovo in 2009, the company positioned itself as a challenger brand offering superior service to the industry's established players. Ovo's transformational moment came in 2020, when it bought the retail supply arm of SSE, transforming it overnight into one of Britain's leading energy companies. Its growth has not been without difficulties, however, particularly in relation to its challenged relationship with Ofgem and a torrent of customer complaints about overcharging. The group is now run by David Buttress, who was briefly Boris Johnson's cost-of-living tsar after leaving the top job at Just Eat, as its chief executive. Kaluza declined to comment on the appointment of Arma Partners."
    },
    {
        "title": "Labour MPs gather in Liverpool as Starmer mounts fightback against Reform",
        "description": "Labour MPs are gathering in Liverpool for the annual party conference as Sir Keir Starmer attempts to mount a fightback against dire polling and threats to his leadership. ",
        "url": "https://news.sky.com/story/labour-mps-gather-in-liverpool-as-starmer-mounts-fightback-against-reform-13439788",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-starmer-labour_7033785.jpg?20250927173608",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-09-27 23:01:00",
        "Headline": "The conference is a chance for Sir Keir to draw a line under the chaos of recent weeks and convince his MPs he is the man who should lead the party into the next election. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Labour MPs are gathering in Liverpool for the annual party conference as Sir Keir Starmer attempts to mount a fightback against dire polling and threats to his leadership.  The prime minister said he will use the four-day event to show Labour can be an alternative to the \"toxic divide and decline\" offered by Reform UK, describing this as \"the fight of our times\". Sir Keir is under pressure after two separate polls predicted Nigel Farage's party will win the next general election as voters turn their backs on mainstream politics. It is the latest bit of bad news for the embattled prime minister, who has faced a month of scandals surrounding his top team alongside speculation Greater Manchester Mayor Andy Burnham could mount a leadership challenge. Speaking from the conference venue on Saturday night, Sir Keir said the next few days are a \"really big opportunity to make our case to the country, make it absolutely clear that patriotic national renewal is the way forward, not the toxic divide and decline that we get with Reform\". He later insisted he could \"pull things around\", telling The Sunday Times: \"It is the fight of our times and we've all got to be in it together. We don't have time for introspection, we don't have time for navel-gazing. \"You'll always get a bit of that at a Labour Party conference, but that is not going to solve the problems that face this country. \n                  Unite boss Sharon Graham threatens to break link with Labour on eve of conference\n                 \n                  Unite the union refuses to nominate either Labour deputy leadership contender\n                 \n                  Andy Burnham says Labour MPs want him to oust Starmer\n                 \"Once you appreciate the change - in the sense of the division that Reform would bring to our country and the shattering of what we are as a patriotic country - then you realise this is a fight which in the end is bigger than the Labour Party.\" Much of the next four days is likely to be dominated by discussions on how exactly Labour could beat Reform - and whether Sir Keir is the man for the job. PM's future in doubt There has been rampant speculation Mr Burnham could mount a leadership challenge after he made a series of high-profile interventions this week, criticising the direction of the government and claiming Labour MPs had asked him to stand.  The so-called \"King of the North\" has many hurdles to overcome before that could be a possibility - he would have to win a seat in Westminster through a by-election if one became available, then get 80 colleagues to back him. One MP told Sky News that lots of backbenchers are \"reluctantly coming to the conclusion\" that Sir Keir's downfall is a \"not a matter of if, but when\" - citing Mr Burnham or Health Secretary Wes Streeting as possible replacements However they stressed that they did not want to see the prime minister go and hope he can turn things around ahead of the local elections in May. Two-child benefit cap speculation Many MPs want the prime minister to use the conference to set out a positive vision that offers hope for the future - saying his rhetoric on \"tough choices\" during the first 12 months backfired with the public. The boss of Unite, Labour's biggest union funder, has threatened to break its link with the party unless it changes direction. In a signal the leadership is listening, there have been hints from senior ministers that the government could use the conference to scrap the controversial two-child benefit cap.  The limit is opposed by over 100 Labour MPs, both of Labour's deputy leadership candidates and other senior party figures such as Mr Burnham and former prime minister Gordon Brown. Two MPs who were suspended for rebelling over the measure last year - John McDonnell and Aspana Begum - had the whip reinstated on Friday. Mr McDonnell, the shadow chancellor under Jeremy Corbyn, said he hopes \"this is a signal the government has decided to scrap the cap\". Key announcements  Sir Keir's allies rallied round him ahead of the conference, with Business Secretary Peter Kyle claiming the prime minister received a \"rapturous reception\" at events he has been speaking at on Saturday. Sir Keir will address the conference on Tuesday but there will be speeches from cabinet ministers throughout the event, with Chancellor Rachel Reeves to speak on Monday.  The opening day will kick off with a pledge from Housing Secretary Steve Reed to construct three new towns before the next election, in Tempsford in Bedfordshire, Leeds South Bank, and Crews Hill, north London. In one of a number of announcements overnight, the government also said that it will underwrite a £1.5bn loan guarantee to Jaguar Land Rover as it continues to face a shutdown following a mass cyber attack. Meanwhile, Chancellor Rachel Reeves told The Times she is pushing for a new youth mobility scheme and an improved trading relationship with the European Union in a bid to reduce the need for tax rises in the forthcoming budget. And Home Secretary Shabana Mahmood signalled a major change in immigration policy, telling The Sun on Sunday she would \"reset\" immigration laws so foreigners must prove their social worth before being allowed to settle in Britain."
    },
    {
        "title": "Unite boss Sharon Graham threatens to break link with Labour on eve of conference",
        "description": "The boss of Unite, Labour's biggest union funder, has threatened to break its link with the party unless it changes direction.",
        "url": "https://news.sky.com/story/unite-boss-sharon-graham-threatens-to-break-link-with-labour-on-eve-of-conference-13439250",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sharon-graham-unite_7033611.jpg?20250927164941",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-09-27 13:23:00",
        "Headline": "Ms Graham has been a long-time critic of Sir Keir Starmer's agenda, accusing him of lacking vision.",
        "Content": "\n          Political correspondent\n              @tamcohen\n  The boss of Unite, Labour's biggest union funder, has threatened to break its link with the party unless it changes direction. Sharon Graham, general secretary of the union, told Sky News that, on the eve of a crucial party conference for the prime minister, Unite's support for Labour was hanging in the balance. She told Sunday Morning With Trevor Phillips: \"My members, whether it's public sector workers all the way through to defence, are asking, 'What is happening here?'   \"Now when that question cannot be answered, when we're effectively saying, 'Look, actually we cannot answer why we're still affiliated', then absolutely I think our members will choose to disaffiliate and that time is getting close.\" Asked when that decision might be made, she cited the budget, on 26 November, as \"an absolutely critical point of us knowing whether direction is going to change\". \n                  Labour MPs gather in Liverpool as Starmer mounts fightback against Reform\n                 \n                  Unite the union refuses to nominate either Labour deputy leadership contender\n                 \n                  Andy Burnham says Labour MPs want him to oust Starmer\n                 Ms Graham, who became leader in 2021, has been a long-time critic of Sir Keir Starmer's agenda, accusing him of lacking vision. The union has campaigned against his decision to cut winter fuel allowance for pensioners - which was later reversed - and has called for more taxes on the wealthy. But the firm threat to disaffiliate, and a timetable, highlights the acute trouble Sir Keir faces on multiple fronts, after a rocky few months which have seen his popularity plummet in the polls and his administration hit by resignations and scandals. There is now open discussion about his leadership, with Andy Burnham, the mayor of Greater Manchester, claiming he's been urged by MPs to mount a challenge.  Unite has more than a million members, the second-largest union affiliated to Labour. It donates £1.5m a year from its membership fees to the party. The union did not make an additional donation to Labour at the last election - as it has done previously - but was the biggest donor to its individual MPs and candidates. It has donated millions to the party in the past. Any decision to disaffiliate would need to be made at a Unite rules conference; of which the next is scheduled for 2027, but there is the option to convene emergency conferences earlier. Just 15 months into Sir Keir's premiership, in which he has promised to champion workers' rights, Ms Graham's comments are likely to anger the Labour leadership. Read more: Now is moment of 'maximum danger' for Starmer, Harriet Harman warns Unite, earlier this year, voted to suspend former deputy prime minister Angela Rayner of her union membership because of the government's handling of a long-running bin strike in Birmingham. Ms Graham has described the left-wing party being launched by Jeremy Corbyn as a \"sideshow\" and has brushed off speculation of a leadership challenge by Mr Burnham. This summer, she said if Unite dropped support from Labour it would \"focus on building a strong, independent workers' union that was the true, authentic voice for workers\". The annual Labour Party conference kicks off in Liverpool from Sunday. As a union affiliated with Labour, Unite has seats on the party's ruling national executive committee and can send delegates to its annual conference. Watch the full interview with Sharon Graham on Sunday Morning With Trevor Phillips from 8.30am on Sky News"
    },
    {
        "title": "Jaguar Land Rover rescued with £1.5bn government-backed loan after crippling cyber attack",
        "description": "The government will underwrite a &#163;1.5bn loan guarantee to Jaguar Land Rover (JLR) after a mass cyber attack forced a shutdown.",
        "url": "https://news.sky.com/story/jaguar-land-rover-rescued-with-16315bn-government-backed-loan-after-crippling-cyber-attack-13439969",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jaguar-land-rover-cars_6877897.jpg?20250406135225",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-27 22:17:00",
        "Headline": "JLR suspended production at its UK factories following the cyber attack on 31 August. The shutdown is expected to last until 1 October, leaving the largest UK carmaker's suppliers in limbo.",
        "Content": "The government will underwrite a £1.5bn loan guarantee to Jaguar Land Rover (JLR) after a mass cyber attack forced a shutdown. JLR suspended production at its UK factories following the cyber attack on 31 August. The shutdown is expected to last until 1 October, leaving the largest UK carmaker's suppliers in limbo. The loan is expected to give suppliers some certainty amid the continued shutdown, as the £1.5bn will help bolster JLR's cash reserves as it pays back companies in its supply chain. The government will give its backing to the loan through the Export Development Guarantee (EDG), a financial support mechanism aimed at helping British companies that sell their goods overseas.  The £1.5bn loan, from a commercial bank, will be paid back over five years. \"Following our decisive action, this loan guarantee will help support the supply chain and protect skilled jobs in the West Midlands, Merseyside and throughout the UK,\" Business Secretary Peter Kyle said. Chancellor Rachel Reeves added: \"Jaguar Land Rover is an iconic British company which employs tens of thousands of people - a jewel in the crown of our economy. \n                  Harrods customers' details stolen in IT systems breach\n                 \n                  Hackers claim to have stolen pictures, names and addresses of children in nursery firm cyber attack\n                 \n                  Many small firms reliant on Jaguar Land Rover have 'weeks left' before damage 'untenable'\n                 \"Today we are protecting thousands of those jobs with up to £1.5bn in additional private finance, helping them support their supply chain and protect a vital part of the British car industry.\" As a result of the attack, production was halted across the car-making supply chain, with thousands of staff off work. More than 33,000 people work directly for JLR in the UK, many of them on assembly lines in the West Midlands, the largest of which is in Solihull, and a plant at Halewood on Merseyside. An estimated 200,000 more are employed by several hundred companies in the supply chain, who have faced business interruption with their largest client out of action.  Ministers have had daily contact with JLR and cyber experts following the attack as the company attempts to restart production at its UK factories. Unions and politicians have warned that small suppliers producing parts for JLR could collapse as a result of the shutdown unless they receive urgent financial support. This week, Mr Kyle met workers and bosses at Webasto, which makes sunroofs for JLR. Read more:Small firms reliant on JLR have 'weeks left' before damage 'untenable'Harrods customers' details stolen in IT systems breachHackers claim to have stolen pictures, names and addresses of children in nursery firm cyber attack The brand has the largest supply chain in the UK automotive sector, which employs around 120,000 people and is largely made up of small and medium-sized businesses. The government's promise of underwriting the JLR loan has been praised by the Unite union, whose general secretary Sharon Graham said the loan was \"an important first step and demonstrates that the government has listened to the concerns raised in meetings with Unite over recent days\".  She added: \"This is exactly what the government should be doing, taking action to protect jobs. \"The money provided must now be used to ensure job guarantees and to also protect skills and pay in JLR and its supply chain.\""
    }
]