[
    {
        "title": "Like George W Bush did in Iraq, if Israel breaks Iran it will end up owning the chaos that could ensue",
        "description": "Israelis are good at tactics, poor at strategic vision, it has been observed. ",
        "url": "https://news.sky.com/story/like-george-w-bush-did-in-iraq-if-israel-breaks-iran-it-will-end-up-owning-the-chaos-that-could-ensue-13386725",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-tehran-iran-israel_6947646.jpg?20250621204251",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-06-21 13:38:00",
        "Headline": "Israel's aerial campaign against Iran has been one of great sophistication. But its allies are wondering whether there is a strategy beyond that.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Israelis are good at tactics, poor at strategic vision, it has been observed.  Their campaign against Iran may be a case in point. Short termism is understandable in a region that is so unpredictable. Why make elaborate plans if they are generally undone by unexpected events? It is a mindset that is familiar to anyone who has lived or worked there. And it informs policy-making. The Israeli offensive in Gaza is no exception. The Israeli government has never been clear how it will end or what happens the day after that in what remains of the coastal strip. Pressed privately, even senior advisers will admit they simply do not know. It may seem unfair to call a military operation against Iran that literally took decades of planning short-termist or purely tactical. There was clearly a strategy of astonishing sophistication behind a devastating campaign that has dismantled so much of the enemy's capability.  But is there a strategic vision beyond that? That is what worries Israel's allies. It's not as if we've not been here before, time and time again. From Libya to Afghanistan and all points in between we have seen the chaos and carnage that follows governments being changed. \n                  Isfahan, Natanz and Fordow: What we know about the US strikes on Iran's nuclear facilities\n                 \n                  'Fordow is gone': US warplanes strike three nuclear sites in Iran\n                 \n                  US warplanes transit through UK: Here's what the flight tracking data shows\n                 Hundreds of thousands have died. Vast swathes of territory remain mired in turmoil or instability. Which is where a famous warning sign to American shoppers in the 80s and 90s comes in. Ahead of the disastrous invasion that would tear Iraq apart, America's defence secretary, Colin Powell, is said to have warned US president George W Bush of the \"Pottery Barn rule\". The Pottery Barn was an American furnishings store. Signs among its wares told clumsy customers: \"You break it, you own it.\"  Bush did not listen to Powell hard enough. His administration would end up breaking Iraq and owning the aftermath in a bloody debacle lasting years. Israel is not invading Iran, but it is bombing it back to the 80s, or even the 70s, because it is calling for the fall of the government that came to power at the end of that decade. Iran's leadership is proving resilient so far but we are just a week in. It is a country of 90 million, already riven with social and political discontent. Its system of government is based on factional competition, in which paranoia, suspicion and intense rivalries are the order of the day. Read more:Putin says 'Ukraine is ours' and threatens nuclear strikeAir India warned by watchdog over pilot scheduling breaches After half a century of authoritarian theocratic rule there are no opposition groups ready to replace the ayatollahs. There may be a powerful sense of social cohesion and a patriotic resentment of outside interference, for plenty of good historic reasons. But if that is not enough to keep the country together then chaos could ensue. One of the biggest and most consequential nations in the region could descend into violent instability. That will have been on Israel's watch. If it breaks Iran it will own it even more than America owned the disaster in Iraq. Iran and Israel are, after all, in the same neighbourhood. Has Israel thought through the consequences? What is the strategic vision beyond victory? At the very least, is his administration asking its allies whether they have a plan for what could come next?"
    },
    {
        "title": "Belarus opposition leader Siarhei Tsikhanouski freed from jail after rare visit by top US envoy",
        "description": "A jailed opposition leader in Belarus has been freed and is now in Lithuania.",
        "url": "https://news.sky.com/story/belarus-opposition-leader-siarhei-tsikhanouski-freed-from-jail-after-rare-visit-by-top-us-envoy-13386817",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-siarhei-tsikhanouski_6947571.jpg?20250621191348",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-21 17:38:00",
        "Headline": "Mr Tsikhanouski was arrested after he announced he would run for the presidency against Alexander Lukashenko in the 2020 election. As he was detained and subsequently sentenced to 18 years in prison, his wife Sviatlana Tsikhanouskaya ran in his place and took over the opposition.",
        "Content": "A jailed opposition leader in Belarus has been freed and is now in Lithuania. Siarhei Tsikhanouski was released along with 13 other political prisoners following talks between Belarusian President Alexander Lukashenko and Keith Kellogg, who is President Trump's envoy for Ukraine. Mr Kellogg became the highest-ranking US official in years to visit Belarus, which is a close ally of Russia. Israel-Iran live: Trump arrives back at White House as Security Council mulls Iran action Mr Tsikhanouski, a blogger and activist, was arrested after announcing he would run for the presidency against Mr Lukashenko in the 2020 election. He was sentenced to 18 years in prison the following year after a court found him guilty of organising mass unrest and of inciting social hatred. After he was detained, his wife Sviatlana Tsikhanouskaya ran in his place and she became an opposition leader who is now in exile in Lithuania. \n                  Polls close in Belarus - with Alexander Lukashenko set to extend 30-year presidential rule\n                 \n                  Vladimir Putin won't 'whack' Wagner boss Yevgeny Prigozhin - but he's in Russia, says Belarus leader\n                 \n                  Vladimir Putin thanks Russian army for stopping 'civil war' after Wagner mutiny\n                 Although Mr Lukashenko was officially declared the winner of the election, the result was denounced by the opposition and the West as a sham. On Saturday, a video on Ms Tsikhanouskaya's social media showed Mr Tsikhanouski getting out of a minibus and smiling despite his emaciated appearance. He and his wife hugged as their supporters clapped. She said: \"My husband is free. It's difficult to describe the joy in my heart.\" She thanked Mr Trump, Mr Kellogg and \"all European allies\" for their efforts in getting him released. Read more Trump news and analysis:Pakistan says it will nominate Trump for Nobel Peace PrizeUS warplanes transit through UK as Trump considers striking IranTrump's credibility gap and why Iran may want to take its chances in Israel conflict But she added her team's work was \"not finished\", with more than 1,100 political prisoners still locked up in Belarus. The 14 who were freed on Saturday included five Belarus nationals as well as three Poles, two Latvians, two Japanese citizens, one Estonian and one Swede. Among those released was Ihar Karnei, a former journalist at Radio Free Europe/Radio Liberty. 'Free world needs you' European Commission President Ursula von der Leyen said on X the release was \"fantastic news and a powerful symbol of hope for all the political prisoners suffering under the brutal Lukashenka (sic) regime\". \"The free world needs you, Siarhei!\", Poland's foreign minister Radoslaw Sikorski said on X. At the meeting between Mr Lukashenko and Mr Kellogg in the Belarusian capital Minsk, the pair hugged. Mr Lukashenko said: \"I really hope that our conversation will be very sincere and open. Otherwise, what is the point of meeting? \"If we are clever and cunning in front of each other, we will not achieve results. You have made a lot of noise in the world with your arrival.\" Mr Lukashenko, who has been in power since 1994, secured a seventh term in office following an election in January this year that the opposition called a farce. Could Belarus sanctions be lifted? It was not immediately clear whether Mr Kellogg's visit might pave the way for the lifting of some US sanctions against Belarus. They were imposed over the crackdown on the 2020 protests and Mr Lukashenko's support of Russia's full-scale invasion of Ukraine. Belarus has allowed the Kremlin to use its territory to send troops and weapons into Ukraine, and also to put its forces and nuclear weapons there."
    },
    {
        "title": "Latest polling says if an election was held tomorrow Reform UK would win a majority",
        "description": "Since the local elections Reform UK has had no shortage of good polls.",
        "url": "https://news.sky.com/story/latest-polling-says-if-an-election-was-held-tomorrow-reform-uk-would-win-a-majority-13386754",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nigel-farage-reform_6945873.jpg?20250619130919",
        "type": "Home",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-06-21 15:11:00",
        "Headline": "A new survey puts Nigel Farage's party on 34%, nine points ahead of Labour, with the Tories a distant third. Were these figures to be replicated across the country at a general election the Conservatives would be nearly wiped out with just 12 seats.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n Since the local elections Reform UK has had no shortage of good polls. But a new one suggests Nigel Farage's party has a chance not only of winning the next election, but of claiming a decent Commons majority, too. In February, Reform topped a Sky News/YouGov poll for the first time, with Nigel Farage's party edging in front on 25%, Labour pushed into second on 24%, with the Tories on 21%. But a fresh one from Ipsos puts Reform on 34%, nine points ahead of Labour on 25%, with the Conservatives a distant third on 15%.  While the other parties are flatlining, Reform appears to be pushing boundaries. Were these figures to be replicated across the country at a general election, with every constituency behaving the same way, then Reform could win as many as 340 seats, giving it a majority of 30, Sky News analysis suggests. Labour could be reduced to 176 seats, down 236 on last year's election, while the Tories would hit a record low of 12 seats. But polling should always be taken with a pinch of salt and with the firm acknowledgement that there is not an election coming any time soon. Conservative backbenchers might also tell you publicly that opinion polls are notoriously difficult to translate into seat numbers because voting percentages in individual constituencies can vary hugely from the overall average. But the truth is that the symbolism of Reform UK topping another poll is likely to be noticed by MPs from all parties, especially backbench Conservatives who have actively been hoping their leader, Kemi Badenoch, can help them climb the polls and bring the party back into public favour. Politics is a brutal game and when it comes to toppling underwhelming party leaders, the Tories are more ruthless than most. One wonders how many of these polls Mrs Badenoch's party will allow her to endure.  Read more:How did your MP vote on the assisted dying bill?Starmer tries to contain rebellion over welfare reforms This poll is also a warning to Labour. As the party approaches a year since its major victory, it will not have much to celebrate if these numbers are anything to go by. According to this survey, only 19% are satisfied with the job Sir Keir Starmer is doing as prime minister, with 73% dissatisfied. And the figure of 25% of voters intending to vote Labour is a level not seen since October 2019. While abstract to much of the public, polling can often shape not only the chatter inside Westminster but how and when plots by MPs begin. For Reform UK, this is a much-needed morale boost after a surprise resignation by their former Chairman Zia Yusuf, and then an almost immediate U-turn back into the party. And Kemi Badenoch - who said during her leadership campaign that the Conservatives needed to go back to first principles and that this would take time - will be wondering, seven-and-a-half months after winning the leadership, how much time she really has left. Ipsos interviewed a representative probability sample of 1,180 British adults aged 18+, via the Ipsos UK KnowledgePanel. Data was collected between 30 May-4 June 2025."
    },
    {
        "title": "UK weather: Up to 40mm of rain could fall in two hours amid thunderstorm warning",
        "description": "A yellow warning is in place for \"potentially intense\" thunderstorms in large parts of the country - and some places could have up to 40mm of rainfall in less than two hours.",
        "url": "https://news.sky.com/story/uk-weather-up-to-40mm-of-rain-could-fall-in-two-hours-amid-thunderstorm-warning-13386891",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-thunderstorm-lightning_6947685.jpg?20250621222452",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-21 21:11:00",
        "Headline": "The alert lasts until 3am on Sunday and covers parts of northern England, northeast Wales and the Scottish Borders. The east of England could experience a \"tropical night\" as an amber heat-health alert for all regions in England remains in place.",
        "Content": "A yellow warning is in place for \"potentially intense\" thunderstorms in large parts of the country - and some places could have up to 40mm of rainfall in less than two hours. The Met Office said there could also be \"frequent lightning, large hail and strong winds\". The alert lasts until 3am on Sunday and covers parts of northern England, northeast Wales and the Scottish Borders. The Met Office urged those in the warning areas to consider if their location is at risk of flash flooding and to prepare accordingly. Forecasters have said the heatwave in parts of England and Wales provides \"perfect conditions\" for thunderstorms. On Saturday, the UK had the hottest day of 2025 so far, with a temperature of 33.2C (91.7F) recorded in Charlwood, Surrey. Scores of rail passengers were evacuated after some services were halted following a fault on a train. \n                  Ex-classmates died after being treated at same mental health hospital - as concerns raised over other deaths\n                 \n                  Latest polling says if an election was held tomorrow Reform UK would win a majority\n                 \n                  Palestine Action to be banned after break in at RAF base, Sky News understands\n                 And thousands of people watched the sunrise over Stonehenge in Wiltshire to celebrate the summer solstice, marking the year's longest day. Met Office meteorologist Jonathan Vautrey said \"hot and humid air is being dragged up\" from parts of continental Europe. \"But we also have low pressure out in the Atlantic, and that is driving weather fronts across the UK, providing instability in the air and the perfect conditions to start sparking off some thunderstorms as that hot and humid air rises rapidly,\" he added. The east of England, including London and the South East, could experience a \"tropical night\", although most of the country will see \"a lot cooler\" and \"a lot fresher\" conditions, Met Office forecaster Dan Stroud said. \"In one or two spots, that could potentially be a tropical night, which is where the overnight minimums actually fail to drop below 20 degrees (centigrade),\" he added. Read more from Sky News:Prince William's 43rd birthday marked with new pictureEvery baby in UK to receive DNA testing Sunday will see a day of \"sunny spells and showers\" with highs of around 27C and 28C, Mr Stroud said. An amber heat-health alert for all regions in England remains in place over the weekend. The alert, issued by the UK Health Security Agency (UKHSA), has warned that significant impacts are likely during the alert period across health and social care services, including a rise in demand."
    },
    {
        "title": "Pakistan says it will nominate Donald Trump for Nobel Peace Prize for resolving its conflict with India",
        "description": "Pakistan has said it would recommend Donald Trump for the Nobel Peace Prize for his work in helping to resolve the recent conflict between India and Pakistan.",
        "url": "https://news.sky.com/story/pakistan-says-it-will-nominate-donald-trump-for-nobel-peace-prize-for-resolving-its-conflict-with-india-13386708",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-air-force-one_6947457.jpg?20250621145411",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-21 12:24:00",
        "Headline": "Some analysts in Pakistan have suggested the move might persuade the US president to reconsider potentially joining Israel in striking Iran's nuclear facilities.",
        "Content": "Pakistan has said it would recommend Donald Trump for the Nobel Peace Prize for his work in helping to resolve the recent conflict between India and Pakistan. Some analysts in Pakistan have suggested the move might persuade the US president to reconsider potentially joining Israel in striking Iran's nuclear facilities. Pakistan has condemned Israel's attack on Iran as a violation of international law and said it threatens regional stability.  Last month a surprise announcement by Mr Trump of a ceasefire brought an end to a four-day conflict between India and Pakistan, two nuclear-armed states. The US president has repeatedly boasted of averting a nuclear war and saving millions of lives, and has complained about not getting enough credit. While Pakistan agrees US diplomatic intervention brought the fighting to an end, India has disputed that, saying it was a bilateral agreement between the two militaries. Read more:Why intervention in Kashmir is a poisoned fruit \"President Trump demonstrated great strategic foresight and stellar statesmanship through robust diplomatic engagement with both Islamabad and New Delhi, which de-escalated a rapidly deteriorating situation,\" Pakistan said. \"This intervention stands as a testament to his role as a genuine peacemaker.\" Mr Trump has long craved the Nobel Peace Prize, claiming he should have been awarded it for a variety of reasons. In a post on his Truth Social platform on Friday, the president gave a long list of conflicts he claimed he had resolved, including Pakistan and India and the Abraham accords in his first term between Israel and some Muslim-majority countries. \"I won't get a Nobel Peace Prize no matter what I do,\" he added. Read more from Sky News:Thousands watch summer solstice sunrise at StonehengeEvery baby in the UK to receive DNA testingAir India warned by watchdog over pilot scheduling breaches Pakistan's announcement it would nominate Mr Trump comes in the same week as its army chief, Field Marshal Asim Munir, met the US president for lunch."
    },
    {
        "title": "Rail passengers have to walk along tracks on hottest day of year so far after fault brings trains to halt",
        "description": "Scores of train passengers have been evacuated after some services were halted on what was the hottest day of the year in the UK so far.",
        "url": "https://news.sky.com/story/rail-passengers-have-to-walk-along-tracks-on-hottest-day-of-year-so-far-after-fault-bring-trains-to-halt-13386751",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-loughborough-junction_6947495.jpg?20250621161824",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-21 14:58:00",
        "Headline": "A fault on a train near Loughborough Junction in south London brought all services to a halt in the area, three of them outside station platforms.",
        "Content": " Scores of train passengers have been evacuated after some services were halted on what was the hottest day of the year in the UK so far. Video footage showed people, including young children, getting off a train near Loughborough Junction in south London and walking along the tracks with their luggage. Passenger Ioannis Dimitrousis, who filmed the incident, said he was travelling to Brighton when his train stopped. He said people were \"locked in the train with no fresh air and no air conditioning\". He said: \"We were just going to Brighton but still messed up our day.\" He added that the train also had \"lots of people\" who were heading to Gatwick Airport who missed their flights. Another passenger wrote on X to Thameslink: \"You will have hell to pay. We've been stuck on this hot and humid train for over an hour. \n                  Ex-classmates died after being treated at same mental health hospital - as concerns raised over other deaths\n                 \n                  Latest polling says if an election was held tomorrow Reform UK would win a majority\n                 \n                  UK weather: Up to 40mm of rain could fall in two hours amid thunderstorm warning\n                 \"The doors were closed because we were told we may be moving. That was 15 minutes ago. It's like an oven in here and we're being slow-cooked.\" She said the train was \"stuck between Blackfriars and East Croydon\" in south London. A Thameslink spokesperson replied to her, saying: \"This train will be getting evacuated shortly. Please wait until response staff have boarded and set up a safe evacuation route.\" Govia Thameslink Railway and Network Rail have apologised for the delays. A spokesperson said: \"Earlier today, a fault on a train near Loughborough Junction brought all services to a halt in the area, three of them outside station platforms. \"Without power and air conditioning on such a hot day, we pulled all resources from across Sussex and Kent to get personnel on site to safely evacuate passengers as quickly as possible along the track. \"This would have been a difficult and uncomfortable experience for our passengers and we are truly sorry. \"With safety our top priority, the safest place was to remain on the trains while we worked our hardest to get help to those on board.\" Read more from Sky News:Prince William's 43rd birthday marked with new pictureEvery baby in UK to receive DNA testing The spokesperson said due to engineering works, the route affected was the only one that Thameslink trains can take south out of London. And the disruption was expected to continue into the evening. The spokesperson continued: \"Passengers delayed by 15 minutes or more are also entitled to compensation, with details on our website.\" It comes as the UK recorded the hottest day of the year so far, with a high of 33.2C (91.7F) in Charlwood, Surrey, according to the Met Office."
    },
    {
        "title": "Latest polling says if an election was held tomorrow Reform UK would win a majority",
        "description": "Since the local elections Reform UK has had no shortage of good polls.",
        "url": "https://news.sky.com/story/latest-polling-says-if-an-election-was-held-tomorrow-reform-uk-would-win-a-majority-13386754",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nigel-farage-reform_6945873.jpg?20250619130919",
        "type": "UK",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-06-21 15:11:00",
        "Headline": "A new survey puts Nigel Farage's party on 34%, nine points ahead of Labour, with the Tories a distant third. Were these figures to be replicated across the country at a general election the Conservatives would be nearly wiped out with just 12 seats.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n Since the local elections Reform UK has had no shortage of good polls. But a new one suggests Nigel Farage's party has a chance not only of winning the next election, but of claiming a decent Commons majority, too. In February, Reform topped a Sky News/YouGov poll for the first time, with Nigel Farage's party edging in front on 25%, Labour pushed into second on 24%, with the Tories on 21%. But a fresh one from Ipsos puts Reform on 34%, nine points ahead of Labour on 25%, with the Conservatives a distant third on 15%.  While the other parties are flatlining, Reform appears to be pushing boundaries. Were these figures to be replicated across the country at a general election, with every constituency behaving the same way, then Reform could win as many as 340 seats, giving it a majority of 30, Sky News analysis suggests. Labour could be reduced to 176 seats, down 236 on last year's election, while the Tories would hit a record low of 12 seats. But polling should always be taken with a pinch of salt and with the firm acknowledgement that there is not an election coming any time soon. Conservative backbenchers might also tell you publicly that opinion polls are notoriously difficult to translate into seat numbers because voting percentages in individual constituencies can vary hugely from the overall average. But the truth is that the symbolism of Reform UK topping another poll is likely to be noticed by MPs from all parties, especially backbench Conservatives who have actively been hoping their leader, Kemi Badenoch, can help them climb the polls and bring the party back into public favour. Politics is a brutal game and when it comes to toppling underwhelming party leaders, the Tories are more ruthless than most. One wonders how many of these polls Mrs Badenoch's party will allow her to endure.  Read more:How did your MP vote on the assisted dying bill?Starmer tries to contain rebellion over welfare reforms This poll is also a warning to Labour. As the party approaches a year since its major victory, it will not have much to celebrate if these numbers are anything to go by. According to this survey, only 19% are satisfied with the job Sir Keir Starmer is doing as prime minister, with 73% dissatisfied. And the figure of 25% of voters intending to vote Labour is a level not seen since October 2019. While abstract to much of the public, polling can often shape not only the chatter inside Westminster but how and when plots by MPs begin. For Reform UK, this is a much-needed morale boost after a surprise resignation by their former Chairman Zia Yusuf, and then an almost immediate U-turn back into the party. And Kemi Badenoch - who said during her leadership campaign that the Conservatives needed to go back to first principles and that this would take time - will be wondering, seven-and-a-half months after winning the leadership, how much time she really has left. Ipsos interviewed a representative probability sample of 1,180 British adults aged 18+, via the Ipsos UK KnowledgePanel. Data was collected between 30 May-4 June 2025."
    },
    {
        "title": "UK weather: Up to 40mm of rain could fall in two hours amid thunderstorm warning",
        "description": "A yellow warning is in place for \"potentially intense\" thunderstorms in large parts of the country - and some places could have up to 40mm of rainfall in less than two hours.",
        "url": "https://news.sky.com/story/uk-weather-up-to-40mm-of-rain-could-fall-in-two-hours-amid-thunderstorm-warning-13386891",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-thunderstorm-lightning_6947685.jpg?20250621222452",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-21 21:11:00",
        "Headline": "The alert lasts until 3am on Sunday and covers parts of northern England, northeast Wales and the Scottish Borders. The east of England could experience a \"tropical night\" as an amber heat-health alert for all regions in England remains in place.",
        "Content": "A yellow warning is in place for \"potentially intense\" thunderstorms in large parts of the country - and some places could have up to 40mm of rainfall in less than two hours. The Met Office said there could also be \"frequent lightning, large hail and strong winds\". The alert lasts until 3am on Sunday and covers parts of northern England, northeast Wales and the Scottish Borders. The Met Office urged those in the warning areas to consider if their location is at risk of flash flooding and to prepare accordingly. Forecasters have said the heatwave in parts of England and Wales provides \"perfect conditions\" for thunderstorms. On Saturday, the UK had the hottest day of 2025 so far, with a temperature of 33.2C (91.7F) recorded in Charlwood, Surrey. Scores of rail passengers were evacuated after some services were halted following a fault on a train. \n                  Ex-classmates died after being treated at same mental health hospital - as concerns raised over other deaths\n                 \n                  Latest polling says if an election was held tomorrow Reform UK would win a majority\n                 \n                  Palestine Action to be banned after break in at RAF base, Sky News understands\n                 And thousands of people watched the sunrise over Stonehenge in Wiltshire to celebrate the summer solstice, marking the year's longest day. Met Office meteorologist Jonathan Vautrey said \"hot and humid air is being dragged up\" from parts of continental Europe. \"But we also have low pressure out in the Atlantic, and that is driving weather fronts across the UK, providing instability in the air and the perfect conditions to start sparking off some thunderstorms as that hot and humid air rises rapidly,\" he added. The east of England, including London and the South East, could experience a \"tropical night\", although most of the country will see \"a lot cooler\" and \"a lot fresher\" conditions, Met Office forecaster Dan Stroud said. \"In one or two spots, that could potentially be a tropical night, which is where the overnight minimums actually fail to drop below 20 degrees (centigrade),\" he added. Read more from Sky News:Prince William's 43rd birthday marked with new pictureEvery baby in UK to receive DNA testing Sunday will see a day of \"sunny spells and showers\" with highs of around 27C and 28C, Mr Stroud said. An amber heat-health alert for all regions in England remains in place over the weekend. The alert, issued by the UK Health Security Agency (UKHSA), has warned that significant impacts are likely during the alert period across health and social care services, including a rise in demand."
    },
    {
        "title": "Prince of Wales plays with family dog and her new puppies in picture marking 43rd birthday",
        "description": "Kensington Palace has released a picture showing the Prince of Wales playing with their family dog and her new puppies.",
        "url": "https://news.sky.com/story/prince-of-wales-plays-with-family-dog-and-her-new-puppies-in-picture-marking-43rd-birthday-13386646",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-prince-william-prince-of-wales_6947330.jpg?20250621104745",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-21 08:42:00",
        "Headline": "The photo was taken in Windsor earlier this month and shows Prince William gazing adoringly into the eyes of one of the puppies as another clambers over his legs.",
        "Content": "Kensington Palace has released a picture showing the Prince of Wales playing with their family dog and her new puppies. The photo was taken in Windsor earlier this month and was released as he celebrated his 43rd birthday. It shows Prince William gazing adoringly into the eyes of one of the puppies as another clambers over his legs. The family's black cocker spaniel, Orla, gave birth to four puppies last month, three of which can be seen in the photograph. In the Instagram post, signed from Catherine, George, Charlotte, and Louis, the family said: \"Happy birthday! Love C, G, C, L, Orla and the puppies!\" The message was signed off with an emoji showing a pair of paws. Orla was first seen in a picture of Princess Charlotte marking her seventh birthday in May 2022. She was gifted to the family in 2020 by Kate's brother, James Middleton, who breeds dogs, after their first dog together, cocker spaniel Lupo, died unexpectedly. The King and Queen's Instagram account also posted a new picture of Prince William to mark his birthday, showing him dressed in a shirt and sitting in a field. They wrote: \"Happy birthday to the Prince of Wales!\" Read more from Sky News:Thousands watch summer solstice sunrise at StonehengeHere's how to stay cool in the heat It comes after the Princess of Wales pulled out of Royal Ascot earlier this week, as she continues to find the right balance after her cancer diagnosis. Kate was said to be disappointed she could not attend the sporting event in Berkshire alongside Prince William and the King and Queen. She has been making a gradual return to public duties since it was announced in January she was in remission from cancer."
    },
    {
        "title": "Palestine Action: The 'enemy within' or non-violent protesters?",
        "description": "The impending ban on protest group Palestine Action has divided opinion - described as both \"outrageous\" and \"long overdue\".",
        "url": "https://news.sky.com/story/palestine-action-the-enemy-within-or-non-violent-protesters-13386813",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-palestine-action-london_6947586.jpg?20250621192528",
        "type": "UK",
        "Author": "Tom Parmenter",
        "Date Published": "2025-06-21 17:32:00",
        "Headline": "With a ban expected to be announced, Sky News talks to people who support the group, and those who welcome the development. ",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  The impending ban on protest group Palestine Action has divided opinion - described as both \"outrageous\" and \"long overdue\". Home Secretary Yvette Cooper is expected to take the step after the group broke into RAF Brize Norton in Oxfordshire on e-scooters and sprayed two Voyager planes with red paint. The prime minister described the attack as \"outrageous\" and a rapid review of security at MoD bases is under way. It was the latest protest in a five-year campaign from Palestine Action (PA) that has targeted arms manufacturers, financial institutions, political figures and government buildings. Red spray paint has become its signature. On its website, PA says it is a \"direct action movement\" committed to ending \"global participation\" in what it calls Israel's \"genocidal and apartheid regime\". It adds that it uses \"disruptive tactics\" to target \"corporate enablers of the Israeli military-industrial complex\". Banning the group would make membership of it illegal. It would be treated as a terrorist organisation. Saeed Taji Farouky, a spokesman for PA, told Sky News that potential proscription was \"unfair\", adding that it was \"ludicrous\" that a \"civil society direct action group\" could end up on the same list as ISIS. He added: \"It's not logical, it's not even consistent with the British legal definition of terrorism, it's a reaction that's been taken overnight, with almost no discussion or debate. \"The whole thing is incredibly worrying, mostly for what it means about British law in general, about undermining the very basis of British democracy and the rule of law.\" There are \"no circumstances\" under which the two people who breached Brize Norton would be handed over to the police, he said. Singer-songwriter Paloma Faith, who spoke at a pro-Palestine rally in Whitehall in central London on Saturday, told Sky News she was \"devastated\" by the move. \"I have met some of the people who have friends in that group. They are young students and they are basically trying to do something because they feel that our government is failing them.\" She added that \"everyone\" wants to end what she described as a \"massacre\" in Gaza. Israel says its military campaign in Gaza is a way of defending itself against Hamas, which killed more than a thousand people in its 7 October attacks and took about 240 people hostage. Hamas-run health authorities claim Israeli attacks have since killed almost 56,000 people in Gaza.  Faith continued: \"When you scribble on something, or paint on it, it's a non-violent protest and it shouldn't be made at the same level as a violent protest - it is unjust.\" Ben Jamal, director of the Palestine Solidarity Campaign, backed Palestine Action's use of non-violent protest. He told Sky News: \"There has been a place for that in all political movements in history. \"In the struggle for the rights of black people in the US, in the struggle against apartheid in South Africa, in the struggle for women to have the vote, people took forms of non-violent direct action. \"Imagine if we had the current [situation] back in those days - we would have been proscribing the suffragettes, treating them as terrorists.\" Read more:Analysis: If Israel breaks Iran it will own the chaosPutin says 'Ukraine is ours' and threatens nuclear strike Others have welcomed the move. Lord Walney, who served as the government's independent adviser on political violence, told Sky News the decision was \"long overdue\". \"Palestine Action have acted as the enemy within which is why it's right, now, to crack down on them,\" he said. \"They have terrorised working people for a number of years and there's a number of serious violent charges that are going through the court system at the moment.\" The UK government is expected to announce its decision early next week."
    },
    {
        "title": "Rail passengers have to walk along tracks on hottest day of year so far after fault brings trains to halt",
        "description": "Scores of train passengers have been evacuated after some services were halted on what was the hottest day of the year in the UK so far.",
        "url": "https://news.sky.com/story/rail-passengers-have-to-walk-along-tracks-on-hottest-day-of-year-so-far-after-fault-bring-trains-to-halt-13386751",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-loughborough-junction_6947495.jpg?20250621161824",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-21 14:58:00",
        "Headline": "A fault on a train near Loughborough Junction in south London brought all services to a halt in the area, three of them outside station platforms.",
        "Content": " Scores of train passengers have been evacuated after some services were halted on what was the hottest day of the year in the UK so far. Video footage showed people, including young children, getting off a train near Loughborough Junction in south London and walking along the tracks with their luggage. Passenger Ioannis Dimitrousis, who filmed the incident, said he was travelling to Brighton when his train stopped. He said people were \"locked in the train with no fresh air and no air conditioning\". He said: \"We were just going to Brighton but still messed up our day.\" He added that the train also had \"lots of people\" who were heading to Gatwick Airport who missed their flights. Another passenger wrote on X to Thameslink: \"You will have hell to pay. We've been stuck on this hot and humid train for over an hour. \n                  Ex-classmates died after being treated at same mental health hospital - as concerns raised over other deaths\n                 \n                  Latest polling says if an election was held tomorrow Reform UK would win a majority\n                 \n                  UK weather: Up to 40mm of rain could fall in two hours amid thunderstorm warning\n                 \"The doors were closed because we were told we may be moving. That was 15 minutes ago. It's like an oven in here and we're being slow-cooked.\" She said the train was \"stuck between Blackfriars and East Croydon\" in south London. A Thameslink spokesperson replied to her, saying: \"This train will be getting evacuated shortly. Please wait until response staff have boarded and set up a safe evacuation route.\" Govia Thameslink Railway and Network Rail have apologised for the delays. A spokesperson said: \"Earlier today, a fault on a train near Loughborough Junction brought all services to a halt in the area, three of them outside station platforms. \"Without power and air conditioning on such a hot day, we pulled all resources from across Sussex and Kent to get personnel on site to safely evacuate passengers as quickly as possible along the track. \"This would have been a difficult and uncomfortable experience for our passengers and we are truly sorry. \"With safety our top priority, the safest place was to remain on the trains while we worked our hardest to get help to those on board.\" Read more from Sky News:Prince William's 43rd birthday marked with new pictureEvery baby in UK to receive DNA testing The spokesperson said due to engineering works, the route affected was the only one that Thameslink trains can take south out of London. And the disruption was expected to continue into the evening. The spokesperson continued: \"Passengers delayed by 15 minutes or more are also entitled to compensation, with details on our website.\" It comes as the UK recorded the hottest day of the year so far, with a high of 33.2C (91.7F) in Charlwood, Surrey, according to the Met Office."
    },
    {
        "title": "Thousands watch summer solstice sunrise at Stonehenge - on the hottest day of year",
        "description": "Thousands of people gathered at Stonehenge to watch the summer solstice sunrise, marking the year's longest day - on what is now the hottest day of the year.",
        "url": "https://news.sky.com/story/thousands-watch-summer-solstice-sunrise-at-stonehenge-on-what-could-be-hottest-day-of-year-so-far-13386614",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-summer-solstice-stonehenge_6947288.jpg?20250621082847",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-21 06:16:00",
        "Headline": "Temperatures in Charlwood, Surrey, hit 33.2C at lunchtime on Saturday, beating the 32.2C reached in parts of eastern England on Thursday.",
        "Content": " Thousands of people gathered at Stonehenge to watch the summer solstice sunrise, marking the year's longest day - on what is now the hottest day of the year. Temperatures in Charlwood, Surrey, hit 33.2C at lunchtime on Saturday, beating the 32.2C reached in parts of eastern England on Thursday. Overnight, those gathering at Stonehenge had a warm start, with temperatures in Salisbury and Greater London reaching 18C by 5am, according to the Met Office. The Met Office confirmed \"many places\" in England and \"one or two areas\" in Wales, including Cardiff, entered a heatwave on Friday. Check the weather forecast where you are The forecaster confirmed the highest overnight temperatures were recorded in Yeovilton, in Somerset, and Crosby, in Merseyside, both reaching 19.7C by 6am on Saturday, with towns in Cumbria and Lancashire recording temperatures above 19C. An amber heat-health alert is in place for all regions in England over the weekend. Solstice events at Stonehenge are some of the rare occasions when visitors are allowed to get close to the stones at the World Heritage site, which was built to align with the sun on the solstices. Solstices are believed to have been celebrated at Stonehenge for thousands of years. The summer solstice sees the sun rise behind the Heel Stone, the ancient entrance to the Stone Circle, with rays of sunlight being channelled into the centre of the monument. It takes place as one of the Earth's poles reaches its maximum tilt towards the sun as it reaches its highest position in the sky, giving the longest period of daylight for the year and signifying the end of spring. Read more: How to stay cool in the heat It comes as scattered thunderstorms are set to hit the UK amid continued high temperatures on Saturday, with 34C possible in some areas. The yellow weather warning for thunderstorms covers all of northern England, from Nottingham to up above Newcastle, and will come into force from 3pm and last until 4am on Sunday. The Met Office warned the most intense storms could produce \"frequent lightning, large hail and gusty winds, as well as a chance of flooding\". There will also be very high UV and pollen levels across the country, the Met Office said."
    },
    {
        "title": "Like George W Bush did in Iraq, if Israel breaks Iran it will end up owning the chaos that could ensue",
        "description": "Israelis are good at tactics, poor at strategic vision, it has been observed. ",
        "url": "https://news.sky.com/story/like-george-w-bush-did-in-iraq-if-israel-breaks-iran-it-will-end-up-owning-the-chaos-that-could-ensue-13386725",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-tehran-iran-israel_6947646.jpg?20250621204251",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-06-21 13:38:00",
        "Headline": "Israel's aerial campaign against Iran has been one of great sophistication. But its allies are wondering whether there is a strategy beyond that.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Israelis are good at tactics, poor at strategic vision, it has been observed.  Their campaign against Iran may be a case in point. Short termism is understandable in a region that is so unpredictable. Why make elaborate plans if they are generally undone by unexpected events? It is a mindset that is familiar to anyone who has lived or worked there. And it informs policy-making. The Israeli offensive in Gaza is no exception. The Israeli government has never been clear how it will end or what happens the day after that in what remains of the coastal strip. Pressed privately, even senior advisers will admit they simply do not know. It may seem unfair to call a military operation against Iran that literally took decades of planning short-termist or purely tactical. There was clearly a strategy of astonishing sophistication behind a devastating campaign that has dismantled so much of the enemy's capability.  But is there a strategic vision beyond that? That is what worries Israel's allies. It's not as if we've not been here before, time and time again. From Libya to Afghanistan and all points in between we have seen the chaos and carnage that follows governments being changed. \n                  Isfahan, Natanz and Fordow: What we know about the US strikes on Iran's nuclear facilities\n                 \n                  'Fordow is gone': US warplanes strike three nuclear sites in Iran\n                 \n                  US warplanes transit through UK: Here's what the flight tracking data shows\n                 Hundreds of thousands have died. Vast swathes of territory remain mired in turmoil or instability. Which is where a famous warning sign to American shoppers in the 80s and 90s comes in. Ahead of the disastrous invasion that would tear Iraq apart, America's defence secretary, Colin Powell, is said to have warned US president George W Bush of the \"Pottery Barn rule\". The Pottery Barn was an American furnishings store. Signs among its wares told clumsy customers: \"You break it, you own it.\"  Bush did not listen to Powell hard enough. His administration would end up breaking Iraq and owning the aftermath in a bloody debacle lasting years. Israel is not invading Iran, but it is bombing it back to the 80s, or even the 70s, because it is calling for the fall of the government that came to power at the end of that decade. Iran's leadership is proving resilient so far but we are just a week in. It is a country of 90 million, already riven with social and political discontent. Its system of government is based on factional competition, in which paranoia, suspicion and intense rivalries are the order of the day. Read more:Putin says 'Ukraine is ours' and threatens nuclear strikeAir India warned by watchdog over pilot scheduling breaches After half a century of authoritarian theocratic rule there are no opposition groups ready to replace the ayatollahs. There may be a powerful sense of social cohesion and a patriotic resentment of outside interference, for plenty of good historic reasons. But if that is not enough to keep the country together then chaos could ensue. One of the biggest and most consequential nations in the region could descend into violent instability. That will have been on Israel's watch. If it breaks Iran it will own it even more than America owned the disaster in Iraq. Iran and Israel are, after all, in the same neighbourhood. Has Israel thought through the consequences? What is the strategic vision beyond victory? At the very least, is his administration asking its allies whether they have a plan for what could come next?"
    },
    {
        "title": "Putin says 'all of Ukraine is ours' and threatens nuclear strike",
        "description": "Vladimir Putin has doubled down on his insistence that Russia will not give up any occupied territory as part of peace negotiations with Ukraine.",
        "url": "https://news.sky.com/story/putin-says-ukraine-is-ours-and-threatens-nuclear-strike-13386697",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vladimir-putin-at-economic-forum_6947209.jpg?20250621032009",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-21 12:12:00",
        "Headline": "The Russian president said he hopes Ukraine's leadership will be \"guided by national interests\" in negotiations.",
        "Content": "Vladimir Putin has doubled down on his insistence that Russia will not give up any occupied territory as part of peace negotiations with Ukraine. In an exclusive interview with Sky News Arabia, the Russian president said negotiations need to recognise \"the will of the people who live in certain territories\". Mr Putin was referring to referendums held by Russian officials in 2022 in four annexed regions of Ukraine, and in Crimea. Those referendums, which were described as \"shams\" by the UK's foreign secretary at the time, saw all four regions vote to join Russia. \"The will of the people is what [we] call democracy,\" said Mr Putin. He said that he hopes Ukraine's leadership will be \"guided by national interests\" in negotiations, rather than by the \"interests of its sponsors\". Those sponsors, he said, \"are not interested in ending the conflict, but in using Ukraine for their own selfish political purposes\". On Friday, the Russian president told business leaders in St Petersburg: \"I have said many times that I consider the Russian and Ukrainian people to be one nation.  \"In this sense, all of Ukraine is ours.\" He also threatened a nuclear strike on Ukraine for the first time in months, promising \"catastrophic\" consequences if Kyiv used a dirty bomb against Russian forces. Read more from Sky News:Regime change in Iran is 'unacceptable', says the KremlinThousands watch summer solstice sunrise at StonehengeHere's how to stay cool in the heat \"This would be a colossal mistake on the part of those whom we call neo-Nazis on the territory of today's Ukraine,\" he said. \"It could be their last mistake. We always respond and respond in kind. Therefore, our response will be very tough. \"Ukraine deserves a better fate than being an instrument in the geopolitical struggle of those who strive for confrontation with the Russian Federation.\" On Saturday morning, Russia claimed to have captured a small village named Zaporizhzhia in Ukraine's Donetsk region. Ivan Fedorov, head of the Zaporizhzhia Regional Military Administration, posted on Telegram saying that more than 200 Russian UAVs targeted the region on Friday. Ukraine's President Volodymyr Zelenskyy said Kyiv was now in talks with Denmark, Norway, Germany, Canada, the UK and Lithuania to start joint weapons production. He urged Kyiv's partners to provide 0.25% of their GDP to finance the production of Ukraine's weapons."
    },
    {
        "title": "Belarus opposition leader Siarhei Tsikhanouski freed from jail after rare visit by top US envoy",
        "description": "A jailed opposition leader in Belarus has been freed and is now in Lithuania.",
        "url": "https://news.sky.com/story/belarus-opposition-leader-siarhei-tsikhanouski-freed-from-jail-after-rare-visit-by-top-us-envoy-13386817",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-siarhei-tsikhanouski_6947571.jpg?20250621191348",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-21 17:38:00",
        "Headline": "Mr Tsikhanouski was arrested after he announced he would run for the presidency against Alexander Lukashenko in the 2020 election. As he was detained and subsequently sentenced to 18 years in prison, his wife Sviatlana Tsikhanouskaya ran in his place and took over the opposition.",
        "Content": "A jailed opposition leader in Belarus has been freed and is now in Lithuania. Siarhei Tsikhanouski was released along with 13 other political prisoners following talks between Belarusian President Alexander Lukashenko and Keith Kellogg, who is President Trump's envoy for Ukraine. Mr Kellogg became the highest-ranking US official in years to visit Belarus, which is a close ally of Russia. Israel-Iran live: Trump arrives back at White House as Security Council mulls Iran action Mr Tsikhanouski, a blogger and activist, was arrested after announcing he would run for the presidency against Mr Lukashenko in the 2020 election. He was sentenced to 18 years in prison the following year after a court found him guilty of organising mass unrest and of inciting social hatred. After he was detained, his wife Sviatlana Tsikhanouskaya ran in his place and she became an opposition leader who is now in exile in Lithuania. \n                  Polls close in Belarus - with Alexander Lukashenko set to extend 30-year presidential rule\n                 \n                  Vladimir Putin won't 'whack' Wagner boss Yevgeny Prigozhin - but he's in Russia, says Belarus leader\n                 \n                  Vladimir Putin thanks Russian army for stopping 'civil war' after Wagner mutiny\n                 Although Mr Lukashenko was officially declared the winner of the election, the result was denounced by the opposition and the West as a sham. On Saturday, a video on Ms Tsikhanouskaya's social media showed Mr Tsikhanouski getting out of a minibus and smiling despite his emaciated appearance. He and his wife hugged as their supporters clapped. She said: \"My husband is free. It's difficult to describe the joy in my heart.\" She thanked Mr Trump, Mr Kellogg and \"all European allies\" for their efforts in getting him released. Read more Trump news and analysis:Pakistan says it will nominate Trump for Nobel Peace PrizeUS warplanes transit through UK as Trump considers striking IranTrump's credibility gap and why Iran may want to take its chances in Israel conflict But she added her team's work was \"not finished\", with more than 1,100 political prisoners still locked up in Belarus. The 14 who were freed on Saturday included five Belarus nationals as well as three Poles, two Latvians, two Japanese citizens, one Estonian and one Swede. Among those released was Ihar Karnei, a former journalist at Radio Free Europe/Radio Liberty. 'Free world needs you' European Commission President Ursula von der Leyen said on X the release was \"fantastic news and a powerful symbol of hope for all the political prisoners suffering under the brutal Lukashenka (sic) regime\". \"The free world needs you, Siarhei!\", Poland's foreign minister Radoslaw Sikorski said on X. At the meeting between Mr Lukashenko and Mr Kellogg in the Belarusian capital Minsk, the pair hugged. Mr Lukashenko said: \"I really hope that our conversation will be very sincere and open. Otherwise, what is the point of meeting? \"If we are clever and cunning in front of each other, we will not achieve results. You have made a lot of noise in the world with your arrival.\" Mr Lukashenko, who has been in power since 1994, secured a seventh term in office following an election in January this year that the opposition called a farce. Could Belarus sanctions be lifted? It was not immediately clear whether Mr Kellogg's visit might pave the way for the lifting of some US sanctions against Belarus. They were imposed over the crackdown on the 2020 protests and Mr Lukashenko's support of Russia's full-scale invasion of Ukraine. Belarus has allowed the Kremlin to use its territory to send troops and weapons into Ukraine, and also to put its forces and nuclear weapons there."
    },
    {
        "title": "Pakistan says it will nominate Donald Trump for Nobel Peace Prize for resolving its conflict with India",
        "description": "Pakistan has said it would recommend Donald Trump for the Nobel Peace Prize for his work in helping to resolve the recent conflict between India and Pakistan.",
        "url": "https://news.sky.com/story/pakistan-says-it-will-nominate-donald-trump-for-nobel-peace-prize-for-resolving-its-conflict-with-india-13386708",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-air-force-one_6947457.jpg?20250621145411",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-21 12:24:00",
        "Headline": "Some analysts in Pakistan have suggested the move might persuade the US president to reconsider potentially joining Israel in striking Iran's nuclear facilities.",
        "Content": "Pakistan has said it would recommend Donald Trump for the Nobel Peace Prize for his work in helping to resolve the recent conflict between India and Pakistan. Some analysts in Pakistan have suggested the move might persuade the US president to reconsider potentially joining Israel in striking Iran's nuclear facilities. Pakistan has condemned Israel's attack on Iran as a violation of international law and said it threatens regional stability.  Last month a surprise announcement by Mr Trump of a ceasefire brought an end to a four-day conflict between India and Pakistan, two nuclear-armed states. The US president has repeatedly boasted of averting a nuclear war and saving millions of lives, and has complained about not getting enough credit. While Pakistan agrees US diplomatic intervention brought the fighting to an end, India has disputed that, saying it was a bilateral agreement between the two militaries. Read more:Why intervention in Kashmir is a poisoned fruit \"President Trump demonstrated great strategic foresight and stellar statesmanship through robust diplomatic engagement with both Islamabad and New Delhi, which de-escalated a rapidly deteriorating situation,\" Pakistan said. \"This intervention stands as a testament to his role as a genuine peacemaker.\" Mr Trump has long craved the Nobel Peace Prize, claiming he should have been awarded it for a variety of reasons. In a post on his Truth Social platform on Friday, the president gave a long list of conflicts he claimed he had resolved, including Pakistan and India and the Abraham accords in his first term between Israel and some Muslim-majority countries. \"I won't get a Nobel Peace Prize no matter what I do,\" he added. Read more from Sky News:Thousands watch summer solstice sunrise at StonehengeEvery baby in the UK to receive DNA testingAir India warned by watchdog over pilot scheduling breaches Pakistan's announcement it would nominate Mr Trump comes in the same week as its army chief, Field Marshal Asim Munir, met the US president for lunch."
    },
    {
        "title": "Brazil: Eight dead in hot air balloon crash, say officials",
        "description": "At least eight people have died after a hot air balloon crashed in Brazil, say officials.",
        "url": "https://news.sky.com/story/brazil-eight-dead-in-hot-air-balloon-crash-says-state-governor-13386723",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-brazil-balloon-crash_6947468.png?20250621171251",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-21 13:25:00",
        "Headline": "Footage shared by local news outlet G1 showed smoke coming from the balloon as it fell to the ground in the early hours of Saturday.",
        "Content": "At least eight people have died after a hot air balloon crashed in Brazil, say officials. The tourism balloon caught fire and fell from the sky in the city of Praia Grande, in the southern state of Santa Catarina. Footage shared by local news outlet G1 showed smoke coming from the balloon as it hurtled to the ground in the early hours of Saturday. Thirteen people survived the crash and were taken to nearby hospitals, according to Santa Catarina's military fire brigade. Some 21 people were on board the flight, including the pilot, it added. The state governor Jorginho Mello said in a video on X: \"We are in mourning. A tragedy has happened. We will see how it unfolds, what happened, why it happened. \"But the important thing now is for the state structure to do what it can.\" \n                  Police foil bomb plot targeting Lady Gaga's biggest-ever show on Copacabana beach\n                 \n                  UK in talks with Brazil over 'potential sale' of two Royal Navy amphibious assault ships\n                 \n                  Former Brazil president Jair Bolsonaro to stand trial over alleged coup plot\n                 Mr Mello said he has asked authorities to travel to the municipality \"to do as much as possible to rescue, to help, to take to hospital, to comfort the families\". Pilot has 'extensive experience' Sobrevoar, the company responsible for the balloon, said it complied with all regulations and had \"no records\" of accidents before Saturday's incident. In a statement, it said: \"Despite all necessary precautions and the efforts of our pilot - who has extensive experience and followed all recommended procedures in an attempt to save everyone on board the balloon - we are suffering from the pain caused by this tragedy.\" Sobrevoar added that it was suspending all operations for an indefinite time. Read more from Sky News:Prince William's 43rd birthday marked with new pictureEvery baby in UK to receive DNA testing Praia Grande is a frequent destination for hot air ballooning. It is a popular activity in some parts of Brazil's south during June festivities that celebrate Catholic saints such as Saint John. A balloon came down in Sao Paulo state last Sunday, killing a 27-year-old woman and injuring 11 other people, according to news outlet G1."
    },
    {
        "title": "Air India warned by watchdog over pilot scheduling breaches",
        "description": "India's aviation watchdog has issued a warning to Air India over \"repeated and serious violations\" of rules relating to flights from Bengaluru to London.",
        "url": "https://news.sky.com/story/air-india-warned-by-watchdog-over-pilot-scheduling-breaches-13386670",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-air-india-boeing-787_6946210.jpg?20250619192123",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-21 10:18:00",
        "Headline": "Flights on 16 May and 17 May exceeded the allowed pilot flight time limit of 10 hours, according to the report.",
        "Content": "India's aviation watchdog has issued a warning to Air India over \"repeated and serious violations\" of rules relating to flights from Bengaluru to London. The Directorate General of Civil Aviation (DGCA) instructed Air India to remove three company executives from crew scheduling roles over the breaches, according to government reports, seen by the Reuters news agency. A divisional vice president, a chief manager of crew scheduling, and a planning executive have been removed at the aviation agency's instruction. The flights on 16 May and 17 May exceeded the allowed pilot flight time limit of 10 hours, according to the report. It cited \"systemic failures in scheduling protocol and oversights\" and criticised the lack of strict disciplinary measures against responsible officials. The report is unrelated to this month's crash of an Air India Boeing 787-8 that killed 241 people.  The Gatwick-bound flight, which was carrying 53 Britons, came down just after take-off from Ahmedabad airport in western India on Thursday, 12 June. An investigation into the crash is ongoing.  Read more:How are investigators looking into Air India crash?British survivor of India crash carries brother's coffinAir India flight from Ahmedabad to London cancelled On Thursday, authorities warned Air India for breaching safety rules after three of its Airbus planes flew despite being overdue for checks on emergency equipment of escape slides. In a statement to Reuters, Air India said it has implemented the DGCA order, and in the interim, the company's chief operations officer will directly oversee the Integrated Operations Control Centre. \"Air India is committed to ensuring that there is total adherence to safety protocols and standard practices,\" it added. The DGCA stated in its order that Air India had voluntarily disclosed the violations. Last year, around half of the fines handed out by India's aviation agency were given to Air India or Air India Express. The biggest fine was $127,000 (94,370) on Air India for \"insufficient oxygen on board\" during some international flights."
    },
    {
        "title": "Pakistan says it will nominate Donald Trump for Nobel Peace Prize for resolving its conflict with India",
        "description": "Pakistan has said it would recommend Donald Trump for the Nobel Peace Prize for his work in helping to resolve the recent conflict between India and Pakistan.",
        "url": "https://news.sky.com/story/pakistan-says-it-will-nominate-donald-trump-for-nobel-peace-prize-for-resolving-its-conflict-with-india-13386708",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-air-force-one_6947457.jpg?20250621145411",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-21 12:24:00",
        "Headline": "Some analysts in Pakistan have suggested the move might persuade the US president to reconsider potentially joining Israel in striking Iran's nuclear facilities.",
        "Content": "Pakistan has said it would recommend Donald Trump for the Nobel Peace Prize for his work in helping to resolve the recent conflict between India and Pakistan. Some analysts in Pakistan have suggested the move might persuade the US president to reconsider potentially joining Israel in striking Iran's nuclear facilities. Pakistan has condemned Israel's attack on Iran as a violation of international law and said it threatens regional stability.  Last month a surprise announcement by Mr Trump of a ceasefire brought an end to a four-day conflict between India and Pakistan, two nuclear-armed states. The US president has repeatedly boasted of averting a nuclear war and saving millions of lives, and has complained about not getting enough credit. While Pakistan agrees US diplomatic intervention brought the fighting to an end, India has disputed that, saying it was a bilateral agreement between the two militaries. Read more:Why intervention in Kashmir is a poisoned fruit \"President Trump demonstrated great strategic foresight and stellar statesmanship through robust diplomatic engagement with both Islamabad and New Delhi, which de-escalated a rapidly deteriorating situation,\" Pakistan said. \"This intervention stands as a testament to his role as a genuine peacemaker.\" Mr Trump has long craved the Nobel Peace Prize, claiming he should have been awarded it for a variety of reasons. In a post on his Truth Social platform on Friday, the president gave a long list of conflicts he claimed he had resolved, including Pakistan and India and the Abraham accords in his first term between Israel and some Muslim-majority countries. \"I won't get a Nobel Peace Prize no matter what I do,\" he added. Read more from Sky News:Thousands watch summer solstice sunrise at StonehengeEvery baby in the UK to receive DNA testingAir India warned by watchdog over pilot scheduling breaches Pakistan's announcement it would nominate Mr Trump comes in the same week as its army chief, Field Marshal Asim Munir, met the US president for lunch."
    },
    {
        "title": "Mahmoud Khalil: US student detained by immigration officials over pro-Palestinian protests released",
        "description": "Palestinian activist Mahmoud Khalil has been released after 104 days in immigration detention in the US.",
        "url": "https://news.sky.com/story/mahmoud-khalil-us-student-detained-by-immigration-officials-over-pro-palestinian-protests-released-13386603",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-khalil-mahmoud_6947226.jpg?20250621071241",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-21 06:05:00",
        "Headline": "Judge Michael Farbiarz said it would be \"highly, highly unusual\" for the government to continue detaining a legal resident who was unlikely to flee and hadn't been accused of any violence.",
        "Content": " Palestinian activist Mahmoud Khalil has been released after 104 days in immigration detention in the US. A judge ruled the Columbia University graduate student should be released on Friday. He has become a symbol of Donald Trump's crackdown on protests on university campuses after being arrested by the US immigration agency ICE on 8 March. \"Whether you are a US citizen, an immigrant or just a person on this land doesn't mean that you are less of a human,\" he said after being released from detention in Louisiana. Israel-Iran live updates Mr Khalil is a legal US resident and isn't accused of breaking any laws during pro-Palestine protests, where he served as a spokesperson for student activists. He is expected to head to New York to reunite with his wife, who is a US citizen, and his baby son, who was born while Mr Khalil was in detention.  \"Justice prevailed, but it's very long overdue,\" he said. \"This shouldn't have taken three months.\" The Trump administration is seeking to deport Khalil over his role in the protests.However, Judge Michael Farbiarz said it would be \"highly, highly unusual\" for the government to continue detaining a legal resident who was unlikely to flee and hadn't been accused of any violence. During an hour-long hearing conducted by phone, the New Jersey-based judge said the government had \"clearly not met\" the standards for detention.  The government is appealing Mr Khalil's release, and an immigration judge, Judge Jamee Comans, has ordered the student to be \"removed\". \"An immigration judge, not a district judge, has the authority to decide if Mr Khalil should be released or detained,\" wrote the Department of Homeland Security in a post on X. Read more from Sky News:US warplanes transit through UK amid Iran tensionsPutin says 'Ukraine is ours' and threatens nuclear strike The US secretary of state Marco Rubio is pushing for Mr Khalil to be expelled from America because he says his continued presence could harm foreign policy. The Trump administration argues that noncitizens who take part in pro-Palestinian protests should be deported, as it considers the protests to be antisemitic.  Civil rights groups, such as the American-Arab Anti-Discrimination Committee (ADC), which is suing the administration, argue this conflates antisemitism with criticism of Israel in order to silence dissent. Judge Farbiarz ruled the government can't deport Mr Khalil on the basis that his presence could undermine foreign policy, but it can continue deportation over allegations that he lied on his green card application. Mr Khalil disputes these allegations. He had to surrender his passport but will get his green card back and be given official documents permitting limited travel within the country, including New York and Michigan to visit family, New Jersey and Louisiana for court appearances and Washington to lobby Congress. Judge Farbiarz's decision comes after several other students targeted for their activism have been released from custody, including another former Palestinian student at Columbia, Mohsen Mahdawi; a Tufts University student, Rumeysa Ozturk; and a Georgetown University scholar, Badar Khan Suri."
    },
    {
        "title": "Former Centrica chief Laidlaw in frame to chair embattled BP",
        "description": "Sam Laidlaw, the former boss of Centrica, is among the candidates being considered as the next chairman of BP, Britain&#8217;s besieged oil and gas exploration giant.",
        "url": "https://news.sky.com/story/former-centrica-chief-laidlaw-in-frame-to-chair-embattled-bp-13386649",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-bp-petrol-company_6801167.jpg?20250116113343",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-21 08:51:00",
        "Headline": "Sam Laidlaw and former BHP chair Ken MacKenzie are among the names being discussed as a potential successor to the oil major's outgoing chair, Helge Lund, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Sam Laidlaw, the former boss of Centrica, is among the candidates being considered as the next chairman of BP, Britains besieged oil and gas exploration giant. Sky News has learnt that Mr Laidlaw is being considered by BP board members as a potential successor to Helge Lund, who announced in April that he would step down. BP's chair search comes with the 62bn oil major in a state of crisis, as industry predators circle and the pace of its strategic transformation being interrogated by shareholders. Elliott Management, the activist investor, snapped up a multibillion pound stake in BP earlier this year and is pushing its chief executive, Murray Auchincloss, to accelerate spending cuts and ditch a string of renewable energy commitments. Mr Lund's departure will come after nearly a quarter of BP's shareholders opposed his re-election at its annual meeting in April - an unusually large protest given that his intention to step down had already been announced. BP's senior independent director - the Aviva chief executive Amanda Blanc - is said to be moving \"at pace\" to complete the recruitment process. A number of prominent candidates are understood to be in discussions with headhunters advising BP on the search. \n                  Hundreds of jobs at risk as River Island takes axe to store base\n                 \n                  Money blog: 'We charge diners 225 for our tasting menu - here's why it's worth every penny'\n                 \n                  Post Office Capture scandal: Sir Alan Bates calls for those responsible for wrongful convictions to be 'brought to account'\n                 Mr Laidlaw would be a logical choice to take the role, having transformed Centrica, the owner of British Gas, during his tenure, which ended in 2014. Since then, he has had a long stint - which recently concluded - on the board of miner Rio Tinto, which has been fending off activist calls to abandon its London listing. He also established, and then sold, Neptune Energy, an oil company which was acquired by Italy's Eni for nearly 4bn in 2023. Last December, Mr Laidlaw was appointed chairman of AWE, the government-owned body which oversees Britain's nuclear weapons capability. He also has strong family connections to BP, with his father, Christopher Laidlaw, having served as its deputy chairman during a long business career. One person close to BP said the younger Mr Laidlaw had been approached about chairing the company during its previous recruitment process but had ruled himself out because of his Neptune Energy role. The status of his engagement with BP's search was unclear on Saturday. Another person said to have been approached is Ken MacKenzie, who recently retired as chairman of the mining giant BHP. Mr MacKenzie headed BHP during a period when Elliott held a stake in the company, and is said to have a good working relationship with the investor. Shares in BP have continued their downward trajectory over the last year, having fallen by nearly a fifth during that period. The company's valuation slump is reported to have drawn renewed interest in a possible takeover bid, with rivals Shell and ExxonMobil among those said to have \"run the numbers\" in recent months. Reports of such interest have not elicited any formal response, suggesting that any deal is conceptual at this stage. BP is racing to sell assets including Castrol, its lubricants division, which could command a price of about $8bn. This weekend, BP declined to comment, while Mr Laidlaw could not be reached for comment."
    },
    {
        "title": "Latest polling says if an election was held tomorrow Reform UK would win a majority",
        "description": "Since the local elections Reform UK has had no shortage of good polls.",
        "url": "https://news.sky.com/story/latest-polling-says-if-an-election-was-held-tomorrow-reform-uk-would-win-a-majority-13386754",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nigel-farage-reform_6945873.jpg?20250619130919",
        "type": "Politics",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-06-21 15:11:00",
        "Headline": "A new survey puts Nigel Farage's party on 34%, nine points ahead of Labour, with the Tories a distant third. Were these figures to be replicated across the country at a general election the Conservatives would be nearly wiped out with just 12 seats.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n Since the local elections Reform UK has had no shortage of good polls. But a new one suggests Nigel Farage's party has a chance not only of winning the next election, but of claiming a decent Commons majority, too. In February, Reform topped a Sky News/YouGov poll for the first time, with Nigel Farage's party edging in front on 25%, Labour pushed into second on 24%, with the Tories on 21%. But a fresh one from Ipsos puts Reform on 34%, nine points ahead of Labour on 25%, with the Conservatives a distant third on 15%.  While the other parties are flatlining, Reform appears to be pushing boundaries. Were these figures to be replicated across the country at a general election, with every constituency behaving the same way, then Reform could win as many as 340 seats, giving it a majority of 30, Sky News analysis suggests. Labour could be reduced to 176 seats, down 236 on last year's election, while the Tories would hit a record low of 12 seats. But polling should always be taken with a pinch of salt and with the firm acknowledgement that there is not an election coming any time soon. Conservative backbenchers might also tell you publicly that opinion polls are notoriously difficult to translate into seat numbers because voting percentages in individual constituencies can vary hugely from the overall average. But the truth is that the symbolism of Reform UK topping another poll is likely to be noticed by MPs from all parties, especially backbench Conservatives who have actively been hoping their leader, Kemi Badenoch, can help them climb the polls and bring the party back into public favour. Politics is a brutal game and when it comes to toppling underwhelming party leaders, the Tories are more ruthless than most. One wonders how many of these polls Mrs Badenoch's party will allow her to endure.  Read more:How did your MP vote on the assisted dying bill?Starmer tries to contain rebellion over welfare reforms This poll is also a warning to Labour. As the party approaches a year since its major victory, it will not have much to celebrate if these numbers are anything to go by. According to this survey, only 19% are satisfied with the job Sir Keir Starmer is doing as prime minister, with 73% dissatisfied. And the figure of 25% of voters intending to vote Labour is a level not seen since October 2019. While abstract to much of the public, polling can often shape not only the chatter inside Westminster but how and when plots by MPs begin. For Reform UK, this is a much-needed morale boost after a surprise resignation by their former Chairman Zia Yusuf, and then an almost immediate U-turn back into the party. And Kemi Badenoch - who said during her leadership campaign that the Conservatives needed to go back to first principles and that this would take time - will be wondering, seven-and-a-half months after winning the leadership, how much time she really has left. Ipsos interviewed a representative probability sample of 1,180 British adults aged 18+, via the Ipsos UK KnowledgePanel. Data was collected between 30 May-4 June 2025."
    },
    {
        "title": "Palestine Action: The 'enemy within' or non-violent protesters?",
        "description": "The impending ban on protest group Palestine Action has divided opinion - described as both \"outrageous\" and \"long overdue\".",
        "url": "https://news.sky.com/story/palestine-action-the-enemy-within-or-non-violent-protesters-13386813",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-palestine-action-london_6947586.jpg?20250621192528",
        "type": "Politics",
        "Author": "Tom Parmenter",
        "Date Published": "2025-06-21 17:32:00",
        "Headline": "With a ban expected to be announced, Sky News talks to people who support the group, and those who welcome the development. ",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  The impending ban on protest group Palestine Action has divided opinion - described as both \"outrageous\" and \"long overdue\". Home Secretary Yvette Cooper is expected to take the step after the group broke into RAF Brize Norton in Oxfordshire on e-scooters and sprayed two Voyager planes with red paint. The prime minister described the attack as \"outrageous\" and a rapid review of security at MoD bases is under way. It was the latest protest in a five-year campaign from Palestine Action (PA) that has targeted arms manufacturers, financial institutions, political figures and government buildings. Red spray paint has become its signature. On its website, PA says it is a \"direct action movement\" committed to ending \"global participation\" in what it calls Israel's \"genocidal and apartheid regime\". It adds that it uses \"disruptive tactics\" to target \"corporate enablers of the Israeli military-industrial complex\". Banning the group would make membership of it illegal. It would be treated as a terrorist organisation. Saeed Taji Farouky, a spokesman for PA, told Sky News that potential proscription was \"unfair\", adding that it was \"ludicrous\" that a \"civil society direct action group\" could end up on the same list as ISIS. He added: \"It's not logical, it's not even consistent with the British legal definition of terrorism, it's a reaction that's been taken overnight, with almost no discussion or debate. \"The whole thing is incredibly worrying, mostly for what it means about British law in general, about undermining the very basis of British democracy and the rule of law.\" There are \"no circumstances\" under which the two people who breached Brize Norton would be handed over to the police, he said. Singer-songwriter Paloma Faith, who spoke at a pro-Palestine rally in Whitehall in central London on Saturday, told Sky News she was \"devastated\" by the move. \"I have met some of the people who have friends in that group. They are young students and they are basically trying to do something because they feel that our government is failing them.\" She added that \"everyone\" wants to end what she described as a \"massacre\" in Gaza. Israel says its military campaign in Gaza is a way of defending itself against Hamas, which killed more than a thousand people in its 7 October attacks and took about 240 people hostage. Hamas-run health authorities claim Israeli attacks have since killed almost 56,000 people in Gaza.  Faith continued: \"When you scribble on something, or paint on it, it's a non-violent protest and it shouldn't be made at the same level as a violent protest - it is unjust.\" Ben Jamal, director of the Palestine Solidarity Campaign, backed Palestine Action's use of non-violent protest. He told Sky News: \"There has been a place for that in all political movements in history. \"In the struggle for the rights of black people in the US, in the struggle against apartheid in South Africa, in the struggle for women to have the vote, people took forms of non-violent direct action. \"Imagine if we had the current [situation] back in those days - we would have been proscribing the suffragettes, treating them as terrorists.\" Read more:Analysis: If Israel breaks Iran it will own the chaosPutin says 'Ukraine is ours' and threatens nuclear strike Others have welcomed the move. Lord Walney, who served as the government's independent adviser on political violence, told Sky News the decision was \"long overdue\". \"Palestine Action have acted as the enemy within which is why it's right, now, to crack down on them,\" he said. \"They have terrorised working people for a number of years and there's a number of serious violent charges that are going through the court system at the moment.\" The UK government is expected to announce its decision early next week."
    },
    {
        "title": "Every baby in the UK to receive DNA testing",
        "description": "Every baby in the UK will have their DNA tested under a new 10-year plan for the NHS.",
        "url": "https://news.sky.com/story/every-baby-in-the-uk-to-receive-dna-testing-13386645",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-newborn-baby_6947311.jpg?20250621095307",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-21 08:41:00",
        "Headline": "Personalised medicine, made possible through things like DNA testing, will form a big part the health secretary's new plan for the NHS.",
        "Content": "Every baby in the UK will have their DNA tested under a new 10-year plan for the NHS. The whole-genome sequencing will screen for hundreds of diseases and allow people to \"leapfrog\" killer illnesses, according to the Health Secretary, Wes Streeting. Speaking to the Telegraph, he revealed plans to move the NHS towards a model of sickness prevention rather than treatment. Personalised medicine, made possible through things like DNA testing, will form a big part of that plan, with 650m pledged to genomics research by the government. \"The revolution in medical science means that we can transform the NHS over the coming decade, from a service which diagnoses and treats ill health to one that predicts and prevents it,\" said Mr Streeting in a statement. \"Genomics presents us with the opportunity to leapfrog disease, so we're in front of it rather than reacting to it.\" The upcoming Life Sciences Sector Plan will be published in early July. \n                  Ex-classmates died after being treated at same mental health hospital - as concerns raised over other deaths\n                 \n                  'Pioneering' new scanner used for brain tumour patients trialled in world-first\n                 \n                  23andMe fined millions by UK watchdog over 'profoundly damaging' cyber attack \n                 Newborns are currently offered a blood test when they are around five days old to check for nine rare but serious conditions. In those blood spot tests, the baby's heel is pricked to collect a few drops of blood on a card, but with whole genome sequencing, blood samples are typically taken from the umbilical cord shortly after birth. Read more from Sky News:US warplanes transit through UKPutin says 'Ukraine is ours' and threatens nuclear strike In the past, Mr Streeting has spoken about his desire to make the NHS more preventative, in order to reduce rates of serious illness and save money. Technologies like artificial intelligence will be used by the health service to predict illness and allow treatment or medication to be offered much earlier. \"With the power of this new technology, patients will be able to receive personalised healthcare to prevent ill health before symptoms begin, reducing the pressure on NHS services and helping people live longer, healthier lives,\" said Mr Streeting. Along with a greater focus on prevention, the Government's 10-year plan is expected to include Mr Streeting's two other \"shifts\" in the NHS: moving care away from hospitals to communities, and from analogue to digital services. It follows Chancellor Rachel Reeves' announcement that the Government would increase NHS funding by 29 billion per year in real terms over the next three years as it tries to cut waiting lists in line with its election promises."
    },
    {
        "title": "Final BTS member discharged from military service, sparking reunion hopes",
        "description": "K-pop star Suga, a rapper and songwriter from global sensation BTS, has been discharged from South Korea's mandatory military service.",
        "url": "https://news.sky.com/story/final-bts-member-discharged-from-military-service-sparking-reunion-hopes-13386634",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-suga-bts_6947291.jpg?20250621084231",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-21 07:38:00",
        "Headline": "\"I hope they can explore whatever music...anything they want to do because I will always support them, whatever they feel like doing,\" said one BTS fan.",
        "Content": "K-pop star Suga, a rapper and songwriter from global sensation BTS, has been discharged from South Korea's mandatory military service. He is the last member of the band to finish their enlistment duties with Jin, J-Hope, RM, Jimin, V, and Jung Kook already leaving the military. The other six members of the K-pop band served in the army while Suga worked as a social service agent, which is an alternative form of military service. His return is a big moment for BTS fans, known as the ARMY, as the band plans to reunite now they've all finished their service. While details of a reunion have not been released, the group is expected to hold its largest-ever world tour in 2026, according to NH Securities, one of South Korea's largest investment firms. \"It's gone past excitement and into almost being numb,\" said Ayla O'Ryan, 45, from Scotland, about the potential reunion. RM and V were discharged last week, with Jimin and Jung Kook discharged a day later. \"I hope they can explore whatever music...anything they want to do because I will always support them, whatever they feel like doing,\" said Alice Bonamy, an interpreter from France. Read more from Sky News:US warplanes transit through UKPutin says 'Ukraine is ours' and threatens nuclear strike In South Korea, all able-bodied men aged 18 to 28 are required by law to complete 18-21 months of military service. It's a system designed to deter aggression from rival North Korea. Athletes, classical and traditional musicians, and ballet and other dancers are exempt if they have obtained top prizes in certain competitions and are assessed to have enhanced national prestige. K-pop stars and other entertainers, however, are not exempt. In 2020, BTS postponed their service until age 30 after South Korea allowed K-pop stars to delay their enlistment. But there was a heated public debate in 2022 over whether BTS should be completely exempt. The group's management agency then announced that all seven members would fulfil their duties."
    }
]