[
    {
        "title": "Prince Harry criticised for saying 'I don't know how much longer my father has' in TV interview",
        "description": "Prince Harry has said he wants \"reconciliation\" with the Royal Family - but claims the King \"won't speak to me\".",
        "url": "https://news.sky.com/story/prince-harry-says-he-wants-reconciliation-with-royal-family-but-says-king-wont-speak-to-me-13360011",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prince-harry-king-charles_6904224.jpg?20250503010203",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-02 16:01:00",
        "Headline": "In an interview with BBC News after losing a legal challenge over his security in the UK, the Duke of Sussex said the King \"won't speak to me because of this\" and that \"it would be nice to reconcile\".",
        "Content": " Prince Harry has said he wants \"reconciliation\" with the Royal Family - but claims the King \"won't speak to me\". In an interview with BBC News after losing a legal challenge over his security in the UK, the Duke of Sussex said \"there have been so many disagreements between myself and some of my family\". He said: \"Of course, they will never forgive me for lots of things but... I would love reconciliation with my family, there's no point in continuing to fight anymore. \"Life is precious. I don't know how much longer my father has, he won't speak to me because of this security stuff. It would be nice to reconcile.\"  Ailsa Anderson, a former press secretary to the late Queen, told Sky News that Buckingham Palace will be \"raising their eyes heavenwards\" in reaction to the interview. \"Prince Harry is saying 'I don't know how long my father has' - that's going to cause real concern and more speculation in the media and the wider public about what his diagnosis is, which is incredibly unhelpful going forward,\" she told Sky's Sophy Ridge. She added: \"What you don't want to do is have your private life played out in the media. So if you truly want reconciliation, you'll do it in private, not in a BBC News interview.\" Follow latest: Duke feels it's 'impossible' for family to visit UK Royal correspondent I've been in the room before when Harry has decided to open up. When allowed to talk, he is a man who will very firmly wear his heart on his sleeve.  This interview was meant to be about this appeal court ruling, but he has gone so much further than that.  What is so clear, and we've heard this through the court hearings, is that this has been the most personal crusade for him.  He has seen it as a point of principle, but also as an issue that he believes has seriously put him at risk, and more importantly, his family. What is striking are the other things that he decides to talk about.  Yes, he's clearly very angry at the decision by the Home Office not to give him automatic police protection, but what is telling is the fact that he talks about the establishment stitch-up, alluding to the men in grey suits who he believes turned against him and Meghan - which is something his mother, Princess Diana, also suggested in the past.  And then, of course, he talks about his family.  If we wanted to have any sense of how much Harry continues to be shut out of family life, it comes in what he says about his father and not knowing how long he has to live.  You can tell that, in some ways, he believes that his father could have done more.  Certainly, there have been suggestions of that over the last year - now we know exactly how much it's stood in the way of him building bridges with his family and, in particular, his father.  Elsewhere in the interview, Harry said he had now \"forgiven\" the Royal Family - but added the security row, \"that has now been ongoing for five years with regards to my human life and safety\", is \"the sticking point\" and \"the only thing that's left\". \"Of course, some members of my family will never forgive me for writing a book,\" he said, referencing his 2023 memoir Spare, where he made a series of claims about the Royal Family. It comes after Harry earlier today lost his legal challenge against the UK government over the level of security he receives when he is in the country. After he and Meghan stepped down from full-time royal duties and moved to the US in 2020, the Executive Committee for the Protection of Royalty and Public Figures (Ravec) decided to downgrade his high-level police protection for when he was back in the country.  Since then, the duke has argued that his private protection team in the US no longer had access to the UK intelligence information needed to keep his wife and children safe. At the Royal Courts of Justice on Friday, Judge Sir Geoffrey Vos said that while the duke's safety concerns were both \"powerful and moving\", his \"sense of grievance\" did not \"translate into a legal argument\". In a statement, Buckingham Palace said: \"All of these issues have been examined repeatedly and meticulously by the courts, with the same conclusion reached on each occasion.\" It's understood that the King felt it would have been constitutionally improper to intervene while the case was being considered by the government and reviewed by the courts.  Harry 'let down' by ruling In the interview, Prince Harry said he cannot \"see a world in which I would be bringing my wife and children back to the UK at this point\" because of the security decision. He added he was \"let down\" and felt the decision was \"a good old-fashioned establishment stitch-up,\" before adding he worries the decision sets \"a new precedent that security can be used to control members of the family\". He said he believes \"what it does is imprison other members of the family from being able to choose a different life,\" and added: \"If, for me, security is conditional on having an official role - one that both myself and my wife wish to carry on, but then was rejected... by the Royal Household - and the result to that is you lose your security. \"That basically says you can't live outside of their control if you want to be safe.\" 👉 Listen to Sky News Daily on your podcast app 👈 Duke: PM should 'step in' The duke also said the situation was \"initiated under a previous government\" and said he would ask Sir Keir Starmer and Home Secretary Yvette Cooper to \"step in\". He said he would ask Ms Cooper to review Ravec and its members, \"because if it is an expert body, then what is the Royal Household's role there, if it is not to influence and decide what they want for the members of their household?\" Ravec includes people from the Home Office, Cabinet Office, Foreign, Commonwealth and Development Office, Metropolitan Police, and the Royal Household. It previously decided Harry should have a \"bespoke\" arrangement for publicly funded security when in the UK, as he was no longer entitled to the same protection as working royals after stepping down from full-time duties.  'All I've been asking for is safety' Later on Friday evening, Harry released a written statement attacking Ravec for failing to do an annual risk assessment, and added that legal proceedings \"have revealed to me that this basic duty of care was not and is not applied to me\". He again said he would write to Ms Cooper to \"ask her to urgently examine the matter and review the Ravec process\" and added the legal action has been \"a last resort, but one that has uncovered shocking truths\". \"I remain committed to a life of public service,\" he said. \"This has been and will always be, my life's work, and when you strip away the noise, you'll be able to hear, all I've been asking for is safety.\""
    },
    {
        "title": "Drone attacks are intensifying in Sudan - hitting schools and camps homing the displaced",
        "description": "The smell of explosives is still in the air when we arrive.",
        "url": "https://news.sky.com/story/drone-attacks-are-intensifying-in-sudan-hitting-schools-and-camps-homing-the-displaced-13360307",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sudan-war_6904220.jpg?20250503004310",
        "type": "Home",
        "Author": "Yousra Elbagir, Africa correspondent, and Sam Doak, OSINT producer",
        "Date Published": "2025-05-02 23:01:00",
        "Headline": "Early morning attacks last month killed 12 people, at least two of them children. Forensic analysis by Sky News shows it's a worsening situation.",
        "Content": "By Yousra Elbagir, Africa correspondent, and Sam Doak, OSINT producer  The smell of explosives is still in the air when we arrive. Hours before, a displacement camp in Atbara housing families who fled the war in Sudan's capital Khartoum was hit by two drone strikes in a four-pronged attack. The first bomb on 25 April burned donated tents and killed the children in them. The second hit a school serving as a shelter for the spillover of homeless families. Chunks of cement and plaster had been blasted off the walls of the classrooms where they slept when the second explosive was dropped. Blood marked the entrance of the temporary home closest to the crater. Inside, shattered glass and broken window frames speak to the force of the explosion. We were told by their neighbours that four people in the family were instantly killed. \n                  'Defiled and looted': Returning home during Sudan's civil war\n                 \n                  Ransacked and looted: Sky reporter returns to family home left in ruins after war in Sudan\n                 \n                  Sudan's paramilitary chief announces rival government of 'peace and unity'\n                 \"People were torn apart. This is inhumane,\" says their neighbour Mahialdeen, whose brother and sister were injured. \"We are praying that God lifts this catastrophe. We left Khartoum because of the fighting and found it here.\" Wiping a tear, he says: \"It is chasing us.\" The sanctuary city held by the Sudanese Armed Forces (SAF) about 200 miles northeast of Khartoum has been hit by six drone attacks by the Rapid Support Forces (RSF) since the start of the year. These latest strikes are the most deadly. The drones - known for targeting civilian infrastructure - hit the displacement camp twice, the nearby power station supplying the city with electricity and an empty field with four bombs in the dark, early hours of the morning. First responders have told Sky News that 12 people were killed, including at least two children. RSF increasingly using drones to carry out attacks Data from the conflict-monitoring organisation ACLED shows the RSF has carried out increasing numbers of drone attacks across the country. The most targeted states have been Khartoum and North Darfur, where fighting on the ground has been fierce, as well as Atbara's River Nile State. The data suggests that the increase in strikes has been driven by a change in tactics following the SAF's recapture of Khartoum in late March, with the number of strikes carried out by the RSF spiking shortly after their withdrawal from the capital. Satellite imagery shows the RSF's airpower has allowed it to continue to attack targets in and around Khartoum. Nearby Wadi Seidna Airbase was targeted after the attack on Atbara, with damage visible across a large area south of its airfield. We were given access to the remains of latest suicide drones launched at Khartoum and could not find discernible signs of commercial origin. Drone experts told Sky News that they are self-built devices made from generic parts with no identifiable manufacturers for the components. Read more:Sky reporter returns to family home left in ruinsUK announces £120m aid package for Sudan  Drones sighted in South Darfur are consistent with Chinese models High-resolution satellite images confirm the presence of drones at the RSF-held Nyala Airport. While the total number of drones kept at this location is unknown, imagery from Planet Labs shows six on 24 April. This is the highest number of drones observed at the airport, suggesting an increase in the RSF's available airpower. The location and number of drones visible in satellite imagery at Nyala Airport has varied over time, suggesting they are in active use.  While it is not possible to determine the exact model of drones sighted at Nyala Airport, a report published by researchers at the Yale School of Public Health's Humanitarian Lab has previously found them to be consistent with the Chinese-produced FH-95. Analysis carried out by Sky News confirms these findings, with the measurements and visible features matching those of the CH-95 and FH-95. Both designs are produced in China. The United Arab Emirates is widely accused of supplying Chinese drones to the RSF through South Sudan and Uganda, as well as weapons through Chad. The UAE vehemently denies these claims.  Evidence of new airfields Satellite imagery viewed by Sky News suggests the RSF has worked to increase its air capabilities outside of South Darfur. In late 2024, five new airstrips appeared in West Kordofan between the contested cities of North Darfur capital Al Fashir and Khartoum. While the purpose of these airstrips is unknown, it is clear they carry some level of military significance, having been targeted by air in April. In high-resolution images, no aircraft can be seen. Damage is visible next to a structure that appears to be an aircraft hangar. The rapid escalation in drone strikes is being brutally suffered on the ground. In Atbara's Police Hospital, we find a ward full of the injured survivors. One of them, a three-year-old girl called Manasiq, is staring up at the ceiling in wide-eyed shock with her head wrapped in a bandage and her feet covered in dried blood. Her aunt tells us the explosion flung her small body across the classroom shelter but she miraculously survived. She has shrapnel in her head and clings onto her aunt as her mother is treated for her own injuries in a ward on the first floor. In a dark room deeper in the ward, a mother sits on the edge of a hospital bed holding her young injured daughter. Her son, only slightly older, is on a smaller adjustable bed further away. Fadwa looks forlorn and helpless. Her children were spending the night with relatives in the temporary tents when the first strike hit and killed her eight-year-old son. His surviving sister and brother have been asking after him, but Fadwa can't bring herself to break the news. \"What can I say? This is our fate. We fled the war in Khartoum but can't escape the violence,\" Fadwa says, staring off in the distance. \"We are condemned to this fate.\""
    },
    {
        "title": "Harvey Weinstein accuser breaks down in tears on witness stand - and swears at his lawyer",
        "description": "One of Harvey Weinstein's accusers broke down in tears and swore on the witness stand as a sexual abuse trial continues. ",
        "url": "https://news.sky.com/story/harvey-weinstein-accuser-breaks-down-in-tears-on-witness-stand-and-swears-at-his-lawyer-13360272",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-weinstein-new-york_6901988.jpg?20250430174203",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-02 21:24:00",
        "Headline": "The former Hollywood mogul is on trial for two counts of sexual assault and one count of rape after a 2020 conviction in New York was overturned.",
        "Content": " One of Harvey Weinstein's accusers broke down in tears and swore on the witness stand as a sexual abuse trial continues.  Warning: This article contains references to sexual assault Miriam Haley claims the former Hollywood mogul forced oral sex on her in July 2006. The case is being retried after the appeals court overturned his conviction last year. She was working as a production assistant at the time. Weinstein has strenuously denied all allegations, and Ms Haley also testified at Weinstein's initial trial. The 48-year-old was testifying in a Manhattan court when Weinstein's defence lawyer Jennifer Bonjean questioned her account of the incident. In court, Ms Bonjean asked why Ms Haley would agree to Weinstein's invitation to his apartment after testifying about his previous behaviour, including her alleging that he barged into her home. Ms Haley then became emotional after being asked how her clothes came off before Weinstein allegedly pulled out a tampon and performed oral sex on her. She said Weinstein took off her clothing, but she didn't recall the details, before Ms Bonjean asked: \"You removed your clothes, right?\" Read more: Harvey Weinstein retrial: 'He had all the power'Weinstein accuser felt 'the unthinkable was happening' during alleged assault Ms Haley then told jurors that Weinstein \"was the one who raped me, not the other way around\" - to which his lawyer said: \"That is for the jury to decide.\" She then started crying and said: \"No, it's not for the jury to decide. It's my experience. And he did that to me.\" Sky's US partner network NBC News reported that Ms Haley said during the exchange: \"Don't tell me I wasn't raped by that f*****g asshole.\" Judge Curtis Farber then halted questioning and sent jurors on a break. Ms Haley's eyes were red and her face was glistening as she left the witness stand. In February 2020, Weinstein was found guilty of sexually assaulting Ms Haley - along with raping former actor Jessica Mann in a New York hotel in 2013 - and sentenced to 23 years in prison. His conviction for the two crimes was overturned in April after an appeals court ruled the trial judge unfairly allowed testimony against Weinstein based on allegations that weren't part of the case. After the appeal ruling, Weinstein was charged with raping one woman and forcing oral sex on two others. Two of the charges are those he faced during the original trial, while the third - one of the charges of forcing oral sex on Kaja Sokola - was added last year. Weinstein denies all allegations, and his lawyers argue his accusers had consensual sexual encounters. Regardless of the outcome of the retrial, he will remain in prison over a 2022 conviction in Los Angeles for a separate count of rape. His lawyers are also appealing this sentence."
    },
    {
        "title": "Assisted Dying: Hundreds would seek to use service in first year of it being available, government report finds",
        "description": "Hundreds of people would seek an assisted death in the first year of a service being available, with that number potentially rising to just over 4,500 after 10 years, according to a government report.",
        "url": "https://news.sky.com/story/assisted-dying-hundreds-would-seek-to-use-service-in-first-year-of-it-being-available-government-report-finds-13360067",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-assisted-dying-euthansia_6746051.jpg?20241111174046",
        "type": "Home",
        "Author": "Ashish Joshi",
        "Date Published": "2025-05-02 17:08:00",
        "Headline": "A 149-page impact assessment into the Terminally Ill Adults (End of Life) Bill was published on Friday afternoon. It estimated there could potentially be between 273 and 1,311 people applying for an assisted death in the first year.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n Hundreds of people would seek an assisted death in the first year of a service being available, with that number potentially rising to just over 4,500 after 10 years, according to a government report. A 149-page impact assessment into the Terminally Ill Adults (End of Life) Bill, measuring the financial impact of the proposed legislation, was published on Friday afternoon. It estimated there could potentially be between 273 and 1,311 people applying for an assisted death in the first year, rising to between 1,737 and 7,598 in year 10. And it found the establishment of a Voluntary Assisted Dying Commissioner and panels would cost an estimated average of between £10.9m to £13.6m per year.  The impact assessment found healthcare costs at the end of life could be reduced by as much as an estimated £10m in the first year of an assisted dying service and almost £60m after 10 years. But, the document noted that cutting end-of-life care costs \"is not stated as an objective of the policy\". Kim Leadbeater MP introduced the Terminally Ill Adults (End of Life) Bill on 16 October 2024. \n                  Widow has 'no regrets' over assisted suicide of husband despite 'ongoing' police investigation\n                 \n                  Assisted dying debate delayed after controversy over bill amendments\n                 \n                  The cheerful optimism of supporters of the assisted dying bill has turned to nervousness\n                 The bill passed its second reading in the House of Commons on 29 November 2024 with a vote of 330 to 275. Speaking after publication of the document, she said: \"I am grateful to the government for these detailed and thorough assessments of the impact of the Terminally Ill Adults (End of Life) Bill currently going through parliament. \"I'm pleased that MPs now have two full weeks to consider the assessments before the next Commons debate at Report Stage on 16 May.\" Supporters of assisted dying will be confident the impact assessment's findings will not sway any MPs and the bill will pass in May and not be derailed ahead of the final vote expected on 13 June. The timing of the document, which has been prepared by civil servants, has caused some anger among opponents of the bill. Some have suggested the report was deliberately released to coincide with the results of the local elections. 'We need better care not killing' Responding to the publication of the impact assessments, Dr Gordon Macdonald, CEO of Care Not Killing, said: \"At a time when we have seen how fragile our cash strapped health care system is, how the hospice movement has a £150m blackhole in its budget, and when up to one in four Brits who would benefit from palliative care but aren't currently receiving it, introducing so-called assisted dying would be an incredibly dangerous policy that would put pressure on vulnerable, elderly and disabled people to end their lives prematurely. \"We need to fix the UK's broken and patchy palliative care system so everyone can have a dignified death. \"We need better care, not killing.\" Changes to the bill since the original vote mean the High Court will no longer need to sign off on assisted dying cases. Instead, decisions will go through a new panel of medical and legal experts. Read more:Assisted dying: What is in the legislation?Why is assisted dying so controversial And the rollout period for setting up assisted dying services has also been extended, doubling to a maximum of four years. Under the proposed law, terminally ill adults in England and Wales with less than six months to live could choose to end their life legally. The decision would need approval from two doctors and the expert panel."
    },
    {
        "title": "Ukraine troops to join British forces for VE Day procession",
        "description": "Ukrainian troops will be taking part in the UK's military procession to mark the 80th anniversary of VE Day in London on Monday.",
        "url": "https://news.sky.com/story/ukraine-troops-to-join-british-forces-for-ve-day-procession-13360303",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pokrovsk-ukraine_6882743.jpg?20250411111256",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-02 23:01:00",
        "Headline": "Ukrainian personnel will be joining around 1,000 UK service personnel from the Royal Navy, the Royal Marines, the British Army and the Royal Air Force in London on Monday.",
        "Content": " Ukrainian troops will be taking part in the UK's military procession to mark the 80th anniversary of VE Day in London on Monday. They will join about 1,000 UK service personnel from the Royal Navy, the Royal Marines, the British Army and the Royal Air Force. Victory in Europe Day, known as VE Day, is celebrated on 8 May each year to mark when the Allies formally accepted Germany's surrender in 1945. According to the Ministry of Defence, the forces joining together for the procession will symbolise the global support for Ukraine's \"continued fight for freedom against Russia's unprovoked, illegal invasion\".  Ukraine has been at war with Russia ever since Moscow decided to invade its smaller neighbour back in February 2022. The representatives of the Ukrainian armed forces taking part in Monday's procession will consist of those deployed to the UK on Operation Interflex - the UK armed forces' training programme for Ukrainian recruits, delivered with 12 partner nations. The UK and its partners have trained more than 54,000 Ukrainians in frontline combat skills since the programme was established in the summer of 2022. \n                  What US-Ukraine minerals deal means for Putin\n                 \n                  US and Ukraine sign deal to establish investment fund\n                 \n                  Is Trump just winging his foreign policy?\n                 The MoD said Second World War veterans will be at the heart of the celebrations, watching the procession from the royal box at the Queen Victoria Memorial. D-Day veteran Jack Mortimer, 101, who will be watching the procession, said: \"People from all over the world joined forces 80 years ago to defend freedom - we must remember all of their sacrifices. \"It will be incredibly moving to see the VE Day procession and so many nations represented. \"It will remind us that these alliances still keep us safe today and why we stand by those who need our support.\" Thousands of people are expected to view the procession along The Mall as it kicks off the VE Day 80 commemorations. The procession will conclude with The Mall being filled by members of the public, and a flypast featuring the Red Arrows and 23 current and historic military aircraft. Read more:VE Day flypast route: When and where to watchAugmented reality brings to life the stories of Victory in Europe Day  Defence Secretary John Healey said: \"Eighty years after VE Day, we will celebrate our wartime veterans, our greatest generation. \"We will ensure their spirit lives on, not just in our armed forces but also in our values and commitment to strength through unity. \"In the midst of the first full-scale war in Europe since the Second World War, it is fitting that the Ukrainian armed forces currently fighting on the front line of freedom are represented in Monday's event.\" Major Pavlo, an officer of the Ukrainian marching contingent, said: \"The participation of Ukrainian service personnel in the VE Day parade in London symbolises our strength, courage and resilience. \"It is a recognition that Ukraine and its heroes stand at the forefront of the fight for freedom and peace in the world. \"We are grateful to our allies for their support and solidarity.\""
    },
    {
        "title": "Tory leader apologises to councillors as Reform makes big gains in local elections",
        "description": "Kemi Badenoch has apologised to Tory councillors who lost their seats after Reform made massive gains at the Conservatives' expense in Thursday's local elections.",
        "url": "https://news.sky.com/story/tory-leader-apologises-to-councillors-as-party-faces-major-local-election-losses-13360073",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kemi-badenoch-conservatives_6903759.jpg?20250502171658",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-02 17:15:00",
        "Headline": "The Conservatives have lost control of all the councils they held that were up for election.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Kemi Badenoch has apologised to Tory councillors who lost their seats after Reform made massive gains at the Conservatives' expense in Thursday's local elections. The Conservative leader said she knew it was \"disappointing\" and that she was \"sincerely sorry\", but added: \"We are going to win those seats back - that is my job now.\" The Tories lost overall control of all 18 councils they had been in charge of that were up for election. There were 23 councils in the race in total. Politics latest: Sky News analysis shows Reform surge in estimated national vote A particularly bad loss was Buckinghamshire, which has been under Tory control since 1973 when local government was reorganised. The Conservatives lost overall control by just one seat after losing 29 seats. Reform, which has never run in local elections before, gained eight councils from the Tories, one that had no overall control previously and one from Labour - the only Labour council up for grabs in this election. The Lib Dems won Shropshire from the Tories, as well as Cambridgeshire and Oxfordshire - both of which had no overall control before. \n                  Local election in maps and charts: Reform delivers massive blow to traditional parties\n                 \n                  Reform has put the two traditional parties on notice - and we don't know where this ends\n                 \n                  Runcorn by-election goes to recount as just four votes separate Labour and Reform\n                 The Conservatives had one win, with Paul Bristow being voted in as Cambridgeshire and Peterborough mayor, previously held by Labour. Reform's first major win of the election was the Runcorn and Helsby by-election where Labour lost to Reform by six votes. It was triggered by ex-Labour MP Mike Amesbury resigning after his conviction for punching a constituent. Sir Keir Starmer said he \"gets\" why his party suffered defeat there and the results show \"we must deliver that change ever more quickly, we must go even further\".  Addressing the Conservatives' abysmal results, Ms Badenoch said: \"Other parties may be winning now, but we are going to show that we can deliver and that we are on course and recovering. \"But they [the public] are still not yet ready to trust us,\" she added. \"We have a big job to do to rebuild trust with the public. \"That's the job that the Conservative Party has given me, and I'm going to make sure that we get ourselves back to the place where we are seen as being a credible alternative to Labour.\" Read more:Reform's political earthquake is now shaking our political systemReform wins two new mayoral contests  Ms Badenoch said Labour's election results showed Sir Keir Starmer \"is on course to be a one-term prime minister\". However, when asked if she would still be leader at the next general election, Ms Badenoch dodged the question and said: \"I'm not playing all these questions that the media loves to ask about my future. \"This is not about me.\" She insisted she was the right person to lead the Conservatives, as she was chosen by the party's members. \"I told them it wouldn't be easy, I told them it would require a renewal and rebuilding of our party,\" she said. \"That doesn't happen in six months. I'm trying to do something that no one has ever done before, which is take their party from such a historic defeat back into government in one term.\""
    },
    {
        "title": "Rise in crime 'almost inevitable' as Royal Parks police disbanded after 150 years",
        "description": "London's historic Royal Parks have been policed by a dedicated team of officers for more than 150 years.",
        "url": "https://news.sky.com/story/rise-in-crime-almost-inevitable-as-royal-parks-police-disbanded-after-150-years-13359811",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-police-richmond-park_6903524.jpg?20250502125416",
        "type": "Home",
        "Author": "Henry Vaughan",
        "Date Published": "2025-05-02 23:01:00",
        "Headline": "The Metropolitan Police says officers will continue to respond to emergency calls, patrol hotspot areas, investigate crimes, and support events. ",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n London's historic Royal Parks have been policed by a dedicated team of officers for more than 150 years. But the Metropolitan Police has confirmed that will come to an end in November when it disbands its specialist unit in a bid to help plug a £260m funding gap. Around 80 officers currently responsible for responding to serious crimes, protecting wildlife, enforcing regulations, and policing events such as the Changing of the Guard, will be moved to local teams. The Royal Parks charity responsible for managing and maintaining the 5,000 acres of green spaces, including Hyde Park, Regent's Park, and Richmond Park, said they are \"disappointed\" with the decision and are working with the force to ensure a plan is put in place to maintain public safety. Liberal Democrat Leader of Richmond Council and London Assembly Member Gareth Roberts believes a rise in crime across a combined area as large as Heathrow and Gatwick airports is \"almost inevitable\". \"We will have that type of space within the capital being largely unpoliced,\" he told Sky News. \"I hope that we won't be seeing dire consequences, but we have already seen organised criminal gangs targeting cyclists when they know that the police aren't on duty… and this could open the door to further acts like that.\" \n                  Man convicted of killing 74-year-old neighbour in gate row\n                 \n                  Lottery winner celebrates £5.2m win with surprising first purchase\n                 \n                  Met Police appeal for witnesses as footage shows two of their horses being attacked by dog\n                 Criminal incidents reported in the parks rose around a third from 76 in the year 2022/23 to 101 in 2023/24, according to the Royal Parks' latest annual report. Mr Roberts, who is also a Royal Parks trustee, said cyclists have been forced off their high-end bikes with threats of violence, while other serious crimes reported include sexual offences, mobile phone thefts and drug dealing. More unusual incidents include gangs chasing deer with dogs at night to get them to shed their antlers, which they then sell online, he said. The Met has announced the force would cut 1,700 officers and staff, and slash some services in an effort to save money - despite receiving increases from central and local government. Politicians and campaigners had urged the force to rethink plans to completely get rid of the dedicated Royal Parks policing unit, which has existed since 2004, taking over from the Royal Parks Constabulary, which was set up in 1974. Before that, park keepers had been responsible for policing since 1872. But a letter from the Met's Commander Owain Richards last week confirmed the unit will be fully disbanded by 1 November this year. \"It is with regret that we have taken the tough decision to no longer have a dedicated Royal Parks policing team,\" he said. Local neighbourhood policing teams will instead take over responsibility, as is already the case in places such as Brockwell Park and Clapham Common, in south London, according to the letter. A Met spokesperson said: \"Park users and partners can be reassured the Met will continue to respond to emergency calls, patrol hotspot areas, investigate crimes, and support events in Royal Parks across London.\" But Mr Roberts said already overstretched local teams do not have the extra resources to go into the parks and worries it will \"create an atmosphere where criminality could flourish, without the presence of a very dedicated police force\". \"I have had people saying they will now feel less safe in the parks because they can be quite isolated places some of the time,\" he added. Rachel Blake, the Labour MP for the Cities of London and Westminster, said she was \"deeply concerned\". \"With crime in the parks rising, removing a dedicated and experienced police presence is a serious mistake,\" she told Sky News. \"These officers have specialist knowledge that cannot simply be replaced by a small number of overstretched neighbourhood officers. \"At a time when both the government and the mayor are investing in policing, I am calling for the Metropolitan Police to provide a like-for-like replacement of Royal Parks officers to protect the safety of everyone who uses these vital green spaces.\" Read more from Sky News:Prince Harry says King 'won't speak to me'Co-op 'very sorry' after hackers access members' data A Royal Parks spokesperson said: \"We are disappointed with the Metropolitan Police Service (MPS) decision to close its dedicated Royal Parks police unit. \"The Royal Parks MPS unit and its predecessors have been a massive part of the rich history of the parks in London for over 150 years. \"We are deeply grateful to those police colleagues who have been so committed in their work to protect our amazing green spaces and ensure the safety, security and welfare of the millions of visitors to the parks.\" The charity says it is awaiting full details of how the decision will impact policing of the parks and reassured visitors their safety and wellbeing \"is our top priority\". \"We want to reassure the public that we are working closely with the police over the next six months to ensure a plan is put in place to maintain public safety once the unit is fully disbanded,\" a spokesperson said. The Met said in a statement: \"We have been working closely with the Royal Parks and stakeholders to understand concerns as we navigate our £260m funding gap and reduce the size of the Met. \"The Met is prioritising neighbourhood policing and see this as a positive opportunity to integrate the Royal Parks into local community crime fighting plans and ensure a wider pool of officers understand the unique requirements of parks policing.\""
    },
    {
        "title": "UK weather: Hot spell to end over May bank holiday as temperatures fall sharply",
        "description": "The UK's summer-like temperatures are set to come to an abrupt end over the bank holiday weekend.",
        "url": "https://news.sky.com/story/uk-weather-hot-spell-to-end-over-may-bank-holiday-as-temperatures-fall-sharply-13359998",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-folkestone-kent-weather_6902518.jpg?20250501121128",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-02 15:43:00",
        "Headline": "Sunday and Monday are forecast to be around much cooler than Thursday, when the country had its warmest start to May on record.",
        "Content": " The UK's summer-like temperatures are set to come to an abrupt end over the bank holiday weekend. Saturday will remain warm and sunny for most but it will feel fresher, with highs of 22C (71F) in the South, 18C (64F) in the North and around 14C (57F) in Scotland and Northern Ireland. The big drop comes on Sunday, when the maximum is expected to be 16C in the South West. However, much of the country will languish between 8C to 14C. Monday is a similar picture, but it will turn cloudier for many areas - and drizzle is forecast in the South East. It will be a stark contrast to Thursday, when the UK had its warmest 1 May ever - with Kew Gardens in London recording 29.3 C. Jonathan Vautrey, a forecaster at the Met Office, said temperatures on Sunday and Monday would likely be below average for this time of year. \"Northerly winds are going to be driving in those much cooler and fresher conditions across all areas of the UK,\" he said. \n                  UK weather: Temperatures could climb to 29C in country-wide sunny spell, Met Office says\n                 \n                  UK weather: Large parts of country set to be warm and sunny early next week\n                 \n                  Yellow weather warning in force for parts of UK\n                 Mr Vautrey added: \"That northerly wind is coming down from the North Sea, it's going to be filtering in a reasonable amount of cloud across eastern coastal areas, both Scotland and England. So here, temperature is going to be held back quite a bit. \"When you add on the strength of that wind as well, it is going to be much cooler and much chillier compared to recent days.\" Read more:Get the Sky forecast for your areaPrince Harry loses legal challenge Forecasters say the recent hot spell has been due to the jet stream remaining stuck north of the country, allowing high pressure to settle. Last month was also the sunniest April in the UK since records began in 1910, according to provisional Met Office figures, with 47% more sunshine hours than the long-term average, and the third-warmest April on record."
    },
    {
        "title": "Co-op 'very sorry' after hackers access members' data ",
        "description": "The Co-op has apologised after hackers managed to access the data of a \"significant number\" of past and current members.",
        "url": "https://news.sky.com/story/co-op-very-sorry-after-hackers-access-members-data-13360205",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-co-op-supermarket-money_6901621.jpg?20250430131418",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-02 19:51:00",
        "Headline": "The hacking attack follows similar incidents this week that have targeted M&S and Harrods.",
        "Content": "The Co-op has apologised after hackers managed to access the data of a \"significant number\" of past and current members. The firm said the compromised data included names and contact details but not passwords or bank and credit card details. It said it was \"continuing to experience sustained malicious attempts\". The National Cyber Security Centre (NCSC) and the National Crime Agency (NCA) are helping the company investigate. 👉 Listen to Sky News Daily on your podcast app 👈 A spokesperson described it as a \"highly complex situation\" and said it had \"implemented measures to ensure that we prevent unauthorised access to our systems\". \"As a result of ongoing forensic investigations, we now know that the hackers were able to access and extract data from one of our systems,\" said a statement. \n                  What is going on with the retail cyber attacks?\n                 \n                  M&S pauses recruitment amid ongoing cyber attack\n                 \n                  Who are Scattered Spider? How the notorious hackers linked to M&S cyber attack work\n                 \"The accessed data included information relating to a significant number of our current and past members.\" It said the data compromised also did not include information on customer transactions or products and services someone may have with Co-op Group. \"We appreciate that our members have placed their trust in our Co-op when providing information to us,\" said the spokesperson. \"Protecting the security of our members' and customers' data is a priority, and we are very sorry that this situation has arisen.\" Co-op membership is an opt-in scheme that offers discounts and other benefits. Read more from Sky News:Who are Scattered Spider?Prince Harry: 'I don't know how much longer my father has' It comes as M&S and luxury retailer Harrods were also struck by cyber attacks this week. On Monday, hundreds of M&S agency workers at its main distribution centre were told to stay at home as it grappled with the attack. Shoppers also complained of empty shelves as M&S confirmed \"pockets of limited availability in some stores\" due to measures to manage the incident. The company has also paused recruitment and temporarily taken down its online recruitment pages."
    },
    {
        "title": "Prince Harry criticised for saying 'I don't know how much longer my father has' in TV interview",
        "description": "Prince Harry has said he wants \"reconciliation\" with the Royal Family - but claims the King \"won't speak to me\".",
        "url": "https://news.sky.com/story/prince-harry-says-he-wants-reconciliation-with-royal-family-but-says-king-wont-speak-to-me-13360011",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prince-harry-king-charles_6904224.jpg?20250503010203",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-02 16:01:00",
        "Headline": "In an interview with BBC News after losing a legal challenge over his security in the UK, the Duke of Sussex said the King \"won't speak to me because of this\" and that \"it would be nice to reconcile\".",
        "Content": " Prince Harry has said he wants \"reconciliation\" with the Royal Family - but claims the King \"won't speak to me\". In an interview with BBC News after losing a legal challenge over his security in the UK, the Duke of Sussex said \"there have been so many disagreements between myself and some of my family\". He said: \"Of course, they will never forgive me for lots of things but... I would love reconciliation with my family, there's no point in continuing to fight anymore. \"Life is precious. I don't know how much longer my father has, he won't speak to me because of this security stuff. It would be nice to reconcile.\"  Ailsa Anderson, a former press secretary to the late Queen, told Sky News that Buckingham Palace will be \"raising their eyes heavenwards\" in reaction to the interview. \"Prince Harry is saying 'I don't know how long my father has' - that's going to cause real concern and more speculation in the media and the wider public about what his diagnosis is, which is incredibly unhelpful going forward,\" she told Sky's Sophy Ridge. She added: \"What you don't want to do is have your private life played out in the media. So if you truly want reconciliation, you'll do it in private, not in a BBC News interview.\" Follow latest: Duke feels it's 'impossible' for family to visit UK Royal correspondent I've been in the room before when Harry has decided to open up. When allowed to talk, he is a man who will very firmly wear his heart on his sleeve.  This interview was meant to be about this appeal court ruling, but he has gone so much further than that.  What is so clear, and we've heard this through the court hearings, is that this has been the most personal crusade for him.  He has seen it as a point of principle, but also as an issue that he believes has seriously put him at risk, and more importantly, his family. What is striking are the other things that he decides to talk about.  Yes, he's clearly very angry at the decision by the Home Office not to give him automatic police protection, but what is telling is the fact that he talks about the establishment stitch-up, alluding to the men in grey suits who he believes turned against him and Meghan - which is something his mother, Princess Diana, also suggested in the past.  And then, of course, he talks about his family.  If we wanted to have any sense of how much Harry continues to be shut out of family life, it comes in what he says about his father and not knowing how long he has to live.  You can tell that, in some ways, he believes that his father could have done more.  Certainly, there have been suggestions of that over the last year - now we know exactly how much it's stood in the way of him building bridges with his family and, in particular, his father.  Elsewhere in the interview, Harry said he had now \"forgiven\" the Royal Family - but added the security row, \"that has now been ongoing for five years with regards to my human life and safety\", is \"the sticking point\" and \"the only thing that's left\". \"Of course, some members of my family will never forgive me for writing a book,\" he said, referencing his 2023 memoir Spare, where he made a series of claims about the Royal Family. It comes after Harry earlier today lost his legal challenge against the UK government over the level of security he receives when he is in the country. After he and Meghan stepped down from full-time royal duties and moved to the US in 2020, the Executive Committee for the Protection of Royalty and Public Figures (Ravec) decided to downgrade his high-level police protection for when he was back in the country.  Since then, the duke has argued that his private protection team in the US no longer had access to the UK intelligence information needed to keep his wife and children safe. At the Royal Courts of Justice on Friday, Judge Sir Geoffrey Vos said that while the duke's safety concerns were both \"powerful and moving\", his \"sense of grievance\" did not \"translate into a legal argument\". In a statement, Buckingham Palace said: \"All of these issues have been examined repeatedly and meticulously by the courts, with the same conclusion reached on each occasion.\" It's understood that the King felt it would have been constitutionally improper to intervene while the case was being considered by the government and reviewed by the courts.  Harry 'let down' by ruling In the interview, Prince Harry said he cannot \"see a world in which I would be bringing my wife and children back to the UK at this point\" because of the security decision. He added he was \"let down\" and felt the decision was \"a good old-fashioned establishment stitch-up,\" before adding he worries the decision sets \"a new precedent that security can be used to control members of the family\". He said he believes \"what it does is imprison other members of the family from being able to choose a different life,\" and added: \"If, for me, security is conditional on having an official role - one that both myself and my wife wish to carry on, but then was rejected... by the Royal Household - and the result to that is you lose your security. \"That basically says you can't live outside of their control if you want to be safe.\" 👉 Listen to Sky News Daily on your podcast app 👈 Duke: PM should 'step in' The duke also said the situation was \"initiated under a previous government\" and said he would ask Sir Keir Starmer and Home Secretary Yvette Cooper to \"step in\". He said he would ask Ms Cooper to review Ravec and its members, \"because if it is an expert body, then what is the Royal Household's role there, if it is not to influence and decide what they want for the members of their household?\" Ravec includes people from the Home Office, Cabinet Office, Foreign, Commonwealth and Development Office, Metropolitan Police, and the Royal Household. It previously decided Harry should have a \"bespoke\" arrangement for publicly funded security when in the UK, as he was no longer entitled to the same protection as working royals after stepping down from full-time duties.  'All I've been asking for is safety' Later on Friday evening, Harry released a written statement attacking Ravec for failing to do an annual risk assessment, and added that legal proceedings \"have revealed to me that this basic duty of care was not and is not applied to me\". He again said he would write to Ms Cooper to \"ask her to urgently examine the matter and review the Ravec process\" and added the legal action has been \"a last resort, but one that has uncovered shocking truths\". \"I remain committed to a life of public service,\" he said. \"This has been and will always be, my life's work, and when you strip away the noise, you'll be able to hear, all I've been asking for is safety.\""
    },
    {
        "title": "Harry wears his heart on his sleeve – but who would have expected his interview to go this far?",
        "description": "I've been in the room before when Harry has just decided to open up, when allowed to talk he is a man who will very firmly wear his heart on his sleeve.",
        "url": "https://news.sky.com/story/harry-wears-his-heart-on-his-sleeve-8211-but-who-would-have-expected-his-interview-to-go-this-far-13360101",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-duke-of-sussex-prince-harry_6880629.jpg?20250409092937",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-05-02 17:37:00",
        "Headline": "Harry's interview was meant to be about his police protection ruling. What is striking are the other things that he's decided to talk about.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  I've been in the room before when Harry has just decided to open up, when allowed to talk he is a man who will very firmly wear his heart on his sleeve. This interview with the BBC was meant to be about this appeal court ruling, but he has gone so much further than that. What is so clear, and we've heard this through the court hearings, is that this has been the most personal crusade for him. Follow latest:Duke of Sussex feels it's 'impossible' for family to visit UK after security ruling He has seen it as a point of principle, but also as an issue that he believes has seriously put him at risk, and most importantly, his family. What is striking are the other things that he's decided to talk about.  Yes, he's clearly very angry at the decision by the Home Office not to give him automatic police protection, but what is telling is the fact that he talks about the establishment stitch-up, alluding to the men in grey suits who he believes turned against him and Meghan, also a statement that in the past Princess Diana alluded to. \n                  Prince Harry's security case - all you need to know\n                 \n                  Harry's broken relationship with Royal Family - how did we get here? \n                 \n                  Prince Harry criticised for saying 'I don't know how much longer my father has' in TV interview\n                 And then, of course, he talks about his family. Who would've even expected him to bring up his book unprompted? And the fact that he says some of his family will never forgive him for it. Read more:Prince Harry loses legal challenge over UK police protectionPrince Harry wants 'reconciliation' but says King 'won't speak to me' But if we wanted to have any sense of how much Harry continues to be shut out of family life, it comes in what he says about his father and not knowing how long he has to live. You can tell that, in some ways, he believes that his father could have done more. Certainly, there have been suggestions of that over the last year, now we know exactly how much it's stood in the way of him building bridges with his family and, in particular, his father."
    },
    {
        "title": "Harry's broken relationship with Royal Family - how did we get here? ",
        "description": "An emotional Prince Harry has opened up about how he wants to reconcile with the Royal Family, but claims the King \"won't speak to me\".",
        "url": "https://news.sky.com/story/harrys-broken-relationship-with-royal-family-how-did-we-get-here-13360113",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-harry-meghan-sussex_6895657.jpg?20250424170015",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-02 17:53:00",
        "Headline": "The 40-year-old's relationship with his father and brother has suffered greatly since he moved to the US and pursued several high-profile court cases in which he's criticised the Royal Family and the \"institution\".",
        "Content": " An emotional Prince Harry has opened up about how he wants to reconcile with the Royal Family, but claims the King \"won't speak to me\". The prince told the BBC that the current rift was caused by the legal battle over the security he receives while in the UK. He has lost an appeal over the decision to remove his taxpayer-funded protection - but how did the prince's relationship with his family get to this point? Here are the key moments: January 2020 - The Sussexes announce the bombshell decision that they plan to step back as senior members of the Royal Family and split their time between the UK and US. February 2021 - Harry and Meghan tell the Queen they will not return as working members of the family. Buckingham Palace says the royals are \"saddened by their decision\" but the couple \"remain much-loved members of the family\". March 2021 - The couple sensationally tell Oprah Winfrey that one unnamed royal had raised \"concerns\" about what colour their son's skin might be. \n                  Prince Harry's security case - all you need to know\n                 \n                  Harry wears his heart on his sleeve – but who would have expected his interview to go this far?\n                 \n                  Prince Harry criticised for saying 'I don't know how much longer my father has' in TV interview\n                 April 2021 - Harry and William are pictured together at Prince Philip's funeral despite reports their relationship is increasingly strained. May 2021 - The Duke of Sussex accuses the Royal Family of \"total neglect\" in a documentary about mental health. He tells Oprah Winfrey about the strain of him and Meghan being attacked and harassed by the press. The duke says: \"I felt completely helpless. I thought my family would help - but every single ask, request, warning, whatever it is, just got met with total silence or total neglect.\" July 2021 - William and Harry put aside their differences and appear together again as they unveil a statue of their mother on what would have been her 60th birthday. December 2022 - Prince Harry says in an episode of the couple's Netflix documentary that there is a \"huge level of unconscious bias\" in the Royal Family. \"In this family, sometimes you are part of the problem rather than part of the solution,\" he says. January 2023 - \"I would like to get my father back. I would like to have my brother back,\" Prince Harry tells ITV's Tom Bradby. He also says \"silence is betrayal\" over the alleged failure of the palace to defend him and Meghan. Harry describes William allegedly seeing a \"red mist\" during a fight between the pair and accuses unnamed royals of getting in \"bed with the devil\" over their links with the tabloids.  The duke also tells ITV he doesn't have \"any intention to harm\" or \"hurt\" his brother or King Charles with his book Spare, which is released in the same month. Among the book's claims is that the King told Harry and Meghan not to go to Balmoral after the Queen's death - and that the brothers had urged the King not to marry Camilla. In a US interview the same month, Harry says he's \"stunned\" the Royal Family allowed his security to be taken away - \"especially at the most vulnerable point for us\". The duke also admits some of the responsibility for the breakdown of his relationship with William is \"without question\" his - but says he's tried hard to mend things in private. March 2023 - Prince Harry claims the Royal Family withheld information from him about phone hacking because it would \"open a can of worms\". He makes the allegation in a written statement as part of his case against newspaper publishers. February 2024 - The duke flies in to see his father after the King reveals he has cancer, spending 45 minutes with him at Clarence House. He breaks his silence on the diagnosis later in the month when he suggests it could lead to their reconciliation and says he loves his family. \"The fact that I was able to get on a plane and go and see him and spend any time with him, I'm grateful for that,\" he tells Good Morning America. April 2024 - The prince loses an initial bid to appeal against a court ruling over his security in the UK. His lawyers had argued that he was \"singled out\" and treated \"less favourably\" in the decision to remove the protection. May 2024 - Harry is back in the UK for an Invictus Games event but the duke's spokesperson says the King is too busy to see Prince Harry. \"The duke of course is understanding of his father's diary of commitments and various other priorities and hopes to see him soon,\" a statement adds. June 2024 - Prince Harry gets the green light to appeal over the decision to remove his security.  May 2025 - The duke ultimately loses the long-running case. The appeal court says Harry's arguments are \"powerful and moving\" but do not \"translate into a legal argument\". The prince releases a lengthy statement attacking the \"secretive\" RAVEC committee that made the decision to remove his security. He calls it a \"reckless action knowingly put me and my family in harm's way\" and claims it \"all comes from the same institutions that preyed upon my mother\". A Buckingham Palace statement says: \"All of these issues have been examined repeatedly and meticulously by the courts, with the same conclusion reached on each occasion.\" Speaking to BBC News, Harry reveals: \"Life is precious. I don't know how much longer my father has, he won't speak to me because of this security stuff. It would be nice to reconcile.\""
    },
    {
        "title": "Rise in crime 'almost inevitable' as Royal Parks police disbanded after 150 years",
        "description": "London's historic Royal Parks have been policed by a dedicated team of officers for more than 150 years.",
        "url": "https://news.sky.com/story/rise-in-crime-almost-inevitable-as-royal-parks-police-disbanded-after-150-years-13359811",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-police-richmond-park_6903524.jpg?20250502125416",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-05-02 23:01:00",
        "Headline": "The Metropolitan Police says officers will continue to respond to emergency calls, patrol hotspot areas, investigate crimes, and support events. ",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n London's historic Royal Parks have been policed by a dedicated team of officers for more than 150 years. But the Metropolitan Police has confirmed that will come to an end in November when it disbands its specialist unit in a bid to help plug a £260m funding gap. Around 80 officers currently responsible for responding to serious crimes, protecting wildlife, enforcing regulations, and policing events such as the Changing of the Guard, will be moved to local teams. The Royal Parks charity responsible for managing and maintaining the 5,000 acres of green spaces, including Hyde Park, Regent's Park, and Richmond Park, said they are \"disappointed\" with the decision and are working with the force to ensure a plan is put in place to maintain public safety. Liberal Democrat Leader of Richmond Council and London Assembly Member Gareth Roberts believes a rise in crime across a combined area as large as Heathrow and Gatwick airports is \"almost inevitable\". \"We will have that type of space within the capital being largely unpoliced,\" he told Sky News. \"I hope that we won't be seeing dire consequences, but we have already seen organised criminal gangs targeting cyclists when they know that the police aren't on duty… and this could open the door to further acts like that.\" \n                  Man convicted of killing 74-year-old neighbour in gate row\n                 \n                  Lottery winner celebrates £5.2m win with surprising first purchase\n                 \n                  Met Police appeal for witnesses as footage shows two of their horses being attacked by dog\n                 Criminal incidents reported in the parks rose around a third from 76 in the year 2022/23 to 101 in 2023/24, according to the Royal Parks' latest annual report. Mr Roberts, who is also a Royal Parks trustee, said cyclists have been forced off their high-end bikes with threats of violence, while other serious crimes reported include sexual offences, mobile phone thefts and drug dealing. More unusual incidents include gangs chasing deer with dogs at night to get them to shed their antlers, which they then sell online, he said. The Met has announced the force would cut 1,700 officers and staff, and slash some services in an effort to save money - despite receiving increases from central and local government. Politicians and campaigners had urged the force to rethink plans to completely get rid of the dedicated Royal Parks policing unit, which has existed since 2004, taking over from the Royal Parks Constabulary, which was set up in 1974. Before that, park keepers had been responsible for policing since 1872. But a letter from the Met's Commander Owain Richards last week confirmed the unit will be fully disbanded by 1 November this year. \"It is with regret that we have taken the tough decision to no longer have a dedicated Royal Parks policing team,\" he said. Local neighbourhood policing teams will instead take over responsibility, as is already the case in places such as Brockwell Park and Clapham Common, in south London, according to the letter. A Met spokesperson said: \"Park users and partners can be reassured the Met will continue to respond to emergency calls, patrol hotspot areas, investigate crimes, and support events in Royal Parks across London.\" But Mr Roberts said already overstretched local teams do not have the extra resources to go into the parks and worries it will \"create an atmosphere where criminality could flourish, without the presence of a very dedicated police force\". \"I have had people saying they will now feel less safe in the parks because they can be quite isolated places some of the time,\" he added. Rachel Blake, the Labour MP for the Cities of London and Westminster, said she was \"deeply concerned\". \"With crime in the parks rising, removing a dedicated and experienced police presence is a serious mistake,\" she told Sky News. \"These officers have specialist knowledge that cannot simply be replaced by a small number of overstretched neighbourhood officers. \"At a time when both the government and the mayor are investing in policing, I am calling for the Metropolitan Police to provide a like-for-like replacement of Royal Parks officers to protect the safety of everyone who uses these vital green spaces.\" Read more from Sky News:Prince Harry says King 'won't speak to me'Co-op 'very sorry' after hackers access members' data A Royal Parks spokesperson said: \"We are disappointed with the Metropolitan Police Service (MPS) decision to close its dedicated Royal Parks police unit. \"The Royal Parks MPS unit and its predecessors have been a massive part of the rich history of the parks in London for over 150 years. \"We are deeply grateful to those police colleagues who have been so committed in their work to protect our amazing green spaces and ensure the safety, security and welfare of the millions of visitors to the parks.\" The charity says it is awaiting full details of how the decision will impact policing of the parks and reassured visitors their safety and wellbeing \"is our top priority\". \"We want to reassure the public that we are working closely with the police over the next six months to ensure a plan is put in place to maintain public safety once the unit is fully disbanded,\" a spokesperson said. The Met said in a statement: \"We have been working closely with the Royal Parks and stakeholders to understand concerns as we navigate our £260m funding gap and reduce the size of the Met. \"The Met is prioritising neighbourhood policing and see this as a positive opportunity to integrate the Royal Parks into local community crime fighting plans and ensure a wider pool of officers understand the unique requirements of parks policing.\""
    },
    {
        "title": "Ukraine troops to join British forces for VE Day procession",
        "description": "Ukrainian troops will be taking part in the UK's military procession to mark the 80th anniversary of VE Day in London on Monday.",
        "url": "https://news.sky.com/story/ukraine-troops-to-join-british-forces-for-ve-day-procession-13360303",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pokrovsk-ukraine_6882743.jpg?20250411111256",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-02 23:01:00",
        "Headline": "Ukrainian personnel will be joining around 1,000 UK service personnel from the Royal Navy, the Royal Marines, the British Army and the Royal Air Force in London on Monday.",
        "Content": " Ukrainian troops will be taking part in the UK's military procession to mark the 80th anniversary of VE Day in London on Monday. They will join about 1,000 UK service personnel from the Royal Navy, the Royal Marines, the British Army and the Royal Air Force. Victory in Europe Day, known as VE Day, is celebrated on 8 May each year to mark when the Allies formally accepted Germany's surrender in 1945. According to the Ministry of Defence, the forces joining together for the procession will symbolise the global support for Ukraine's \"continued fight for freedom against Russia's unprovoked, illegal invasion\".  Ukraine has been at war with Russia ever since Moscow decided to invade its smaller neighbour back in February 2022. The representatives of the Ukrainian armed forces taking part in Monday's procession will consist of those deployed to the UK on Operation Interflex - the UK armed forces' training programme for Ukrainian recruits, delivered with 12 partner nations. The UK and its partners have trained more than 54,000 Ukrainians in frontline combat skills since the programme was established in the summer of 2022. \n                  What US-Ukraine minerals deal means for Putin\n                 \n                  US and Ukraine sign deal to establish investment fund\n                 \n                  Is Trump just winging his foreign policy?\n                 The MoD said Second World War veterans will be at the heart of the celebrations, watching the procession from the royal box at the Queen Victoria Memorial. D-Day veteran Jack Mortimer, 101, who will be watching the procession, said: \"People from all over the world joined forces 80 years ago to defend freedom - we must remember all of their sacrifices. \"It will be incredibly moving to see the VE Day procession and so many nations represented. \"It will remind us that these alliances still keep us safe today and why we stand by those who need our support.\" Thousands of people are expected to view the procession along The Mall as it kicks off the VE Day 80 commemorations. The procession will conclude with The Mall being filled by members of the public, and a flypast featuring the Red Arrows and 23 current and historic military aircraft. Read more:VE Day flypast route: When and where to watchAugmented reality brings to life the stories of Victory in Europe Day  Defence Secretary John Healey said: \"Eighty years after VE Day, we will celebrate our wartime veterans, our greatest generation. \"We will ensure their spirit lives on, not just in our armed forces but also in our values and commitment to strength through unity. \"In the midst of the first full-scale war in Europe since the Second World War, it is fitting that the Ukrainian armed forces currently fighting on the front line of freedom are represented in Monday's event.\" Major Pavlo, an officer of the Ukrainian marching contingent, said: \"The participation of Ukrainian service personnel in the VE Day parade in London symbolises our strength, courage and resilience. \"It is a recognition that Ukraine and its heroes stand at the forefront of the fight for freedom and peace in the world. \"We are grateful to our allies for their support and solidarity.\""
    },
    {
        "title": "The political earthquake Farage has long promised is now shaking our political system",
        "description": "It's quite simply a political earthquake. Across England, Reform proved it can translate positive polling into real power, picking up another parliamentary seat, a mayoralty, Staffordshire and Lincolnshire councils and dozens of seats by lunchtime. The popularity surge for this anti-establishment party is real.&#160;",
        "url": "https://news.sky.com/story/nigel-farages-hope-to-one-day-be-prime-minister-is-no-longer-a-pipe-dream-13359947",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nigel-farage-beth-rigby_6903734.jpg?20250502222121",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-05-02 14:32:00",
        "Headline": "What is clear after today is that the political earthquake Farage has long promised is now shaking our political system in a perhaps epochal way, Beth Rigby writes.",
        "Content": "\n          Political editor\n              @BethRigby\n  It's quite simply a political earthquake. Across England, Reform proved it can translate positive polling into real power, picking up another parliamentary seat, a mayoralty, Staffordshire and Lincolnshire councils and dozens of seats by lunchtime. The popularity surge for this anti-establishment party is real.  Look at the votes: Reform doubling its vote share in Runcorn against the general election to 38%, clocking up 42% of the vote in the Lincolnshire mayoral race and 32% in the Doncaster mayoral race, running Labour very close. By lunchtime, Reform had taken the long-held Staffordshire council from the Tories, wiping out their five-strong majority. The significance of these wins, added in with the big gains for the Lib Dems and Greens, cannot be overstated. It speaks in a serious way to a new era of politics in the UK, in which the decades-long duopoly of Labour versus Conservative is crumbling with the rise of the other parties. Politics latest: PM told to 'change course' as Reform surge to election wins The trend was evident in the 2024 general election, when the two main parties got their lowest ever vote share. Labour's clever targeting of seats ensured that it won a massive majority on just 34% of the popular vote. The Lib Dems won a record 70 seats, while Reform picked up five MPs and came second in 98 constituencies.  If that was a loveless landslide, this is the break-up, as voters, who backed Labour's change message, seem to be pressing the change button again and turning out for a leader who is tapping into voters' disillusionment with his slogan that \"Britain is broken and needs Reform\". For the government to lose a by-election just 10 months after winning a massive landslide is a terrible moment for Labour. It won this seat with 53% of the vote in July, against Reform polling at 18%. To end up losing it - albeit by just six votes - is a dreadful verdict from voters here on their early performance. Those around the PM admit it is deeply frustrating but say they expected a kicking from an angry electorate impatient for change. They are taking crumbs of comfort in, just about, holding the mayoralties of Doncaster, North Tyneside and West of England. But in early council results, the drop in the Labour vote is big, and that raises questions as to whether Starmer's party will struggle to hold constituencies it gained in the July election, such as Hexham in Northumberland. The approach from No 10 is to \"keep calm and carry on\" with its government agenda - the immigration white paper, defence review, infrastructure strategy - to deliver for the public and win back the support they had in the last general election in time for the next. Read more:Full local and mayoral election resultsReform has put the two traditional parties on notice For the Conservatives, it's been - to quote one political rival - a \"story of Tory councillors getting machine gunned\". In Staffordshire, where Farage did his final rally, Reform have taken a council where the Tories had a 50-strong majority. The party has been absolutely hammered by Reform in the Tory heartlands of Lincolnshire, where Dame Andrea Jenkyns won the Greater Lincolnshire mayoralty by 40,000 votes. In the general election, the Conservatives held six of the eight parliamentary seats in this county, on Friday Jenkyns beat the Tories in eight out of the nine areas. Those around Conservative leader Kemi Badenoch are trying to steady nerves, arguing that these results are disappointing but not surprising in the context of the party's worst-ever election defeat in 2024, with the party \"under new leadership\" and \"still in the early stages of a long-term plan to renew\". Others are panicked and angry. \"This is what political extinction looks like,\" one senior Tory source told me, in a sign that questions over Badenoch's leadership are only going to build.  There are many results still to come in, but what these elections are pointing to is the rise of multi-party politics with voting spread across three or four parties in many of the races and the two main parties rapidly losing ground. It ties into the longer run trends in our voting, leaning towards more parties and less tribalism amongst voters, as the electorate shift loyalties, and frustration with Labour and the Tories fuels support for the alternatives. Reform's success in Runcorn and Durham, as well as Staffordshire and Lincolnshire, shows that Farage poses a significant threat to the two main parties. Add in the Lib Dems, challenging the Tories in their blue wall shires on the centre right, and what we see emerging is a party system where the two governing parties are no longer dominant. These elections then, while relatively small, are profoundly consequential for our political system. Where we go next is hugely unclear. Much will rest on whether Labour can deliver on its promises and dull Farage's drumbeat of change. Reform's challenge will be to prove that it can govern and sustain the additional scrutiny that being in office entails. The Conservatives are in the most desperate place of all, squeezed by Reform on the right flank and the Lib Dems on the left. But what is clearer after today is that the political earthquake Farage has long promised is now shaking our political system in a perhaps epochal way. The Reform leader has long been saying he is this country's next prime minister. Looking at the way he and his party have translated poll leads into real power means that prospect is no longer a pipe dream."
    },
    {
        "title": "UK weather: Hot spell to end over May bank holiday as temperatures fall sharply",
        "description": "The UK's summer-like temperatures are set to come to an abrupt end over the bank holiday weekend.",
        "url": "https://news.sky.com/story/uk-weather-hot-spell-to-end-over-may-bank-holiday-as-temperatures-fall-sharply-13359998",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-folkestone-kent-weather_6902518.jpg?20250501121128",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-02 15:43:00",
        "Headline": "Sunday and Monday are forecast to be around much cooler than Thursday, when the country had its warmest start to May on record.",
        "Content": " The UK's summer-like temperatures are set to come to an abrupt end over the bank holiday weekend. Saturday will remain warm and sunny for most but it will feel fresher, with highs of 22C (71F) in the South, 18C (64F) in the North and around 14C (57F) in Scotland and Northern Ireland. The big drop comes on Sunday, when the maximum is expected to be 16C in the South West. However, much of the country will languish between 8C to 14C. Monday is a similar picture, but it will turn cloudier for many areas - and drizzle is forecast in the South East. It will be a stark contrast to Thursday, when the UK had its warmest 1 May ever - with Kew Gardens in London recording 29.3 C. Jonathan Vautrey, a forecaster at the Met Office, said temperatures on Sunday and Monday would likely be below average for this time of year. \"Northerly winds are going to be driving in those much cooler and fresher conditions across all areas of the UK,\" he said. \n                  UK weather: Temperatures could climb to 29C in country-wide sunny spell, Met Office says\n                 \n                  UK weather: Large parts of country set to be warm and sunny early next week\n                 \n                  Yellow weather warning in force for parts of UK\n                 Mr Vautrey added: \"That northerly wind is coming down from the North Sea, it's going to be filtering in a reasonable amount of cloud across eastern coastal areas, both Scotland and England. So here, temperature is going to be held back quite a bit. \"When you add on the strength of that wind as well, it is going to be much cooler and much chillier compared to recent days.\" Read more:Get the Sky forecast for your areaPrince Harry loses legal challenge Forecasters say the recent hot spell has been due to the jet stream remaining stuck north of the country, allowing high pressure to settle. Last month was also the sunniest April in the UK since records began in 1910, according to provisional Met Office figures, with 47% more sunshine hours than the long-term average, and the third-warmest April on record."
    },
    {
        "title": "Co-op 'very sorry' after hackers access members' data ",
        "description": "The Co-op has apologised after hackers managed to access the data of a \"significant number\" of past and current members.",
        "url": "https://news.sky.com/story/co-op-very-sorry-after-hackers-access-members-data-13360205",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-co-op-supermarket-money_6901621.jpg?20250430131418",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-02 19:51:00",
        "Headline": "The hacking attack follows similar incidents this week that have targeted M&S and Harrods.",
        "Content": "The Co-op has apologised after hackers managed to access the data of a \"significant number\" of past and current members. The firm said the compromised data included names and contact details but not passwords or bank and credit card details. It said it was \"continuing to experience sustained malicious attempts\". The National Cyber Security Centre (NCSC) and the National Crime Agency (NCA) are helping the company investigate. 👉 Listen to Sky News Daily on your podcast app 👈 A spokesperson described it as a \"highly complex situation\" and said it had \"implemented measures to ensure that we prevent unauthorised access to our systems\". \"As a result of ongoing forensic investigations, we now know that the hackers were able to access and extract data from one of our systems,\" said a statement. \n                  What is going on with the retail cyber attacks?\n                 \n                  M&S pauses recruitment amid ongoing cyber attack\n                 \n                  Who are Scattered Spider? How the notorious hackers linked to M&S cyber attack work\n                 \"The accessed data included information relating to a significant number of our current and past members.\" It said the data compromised also did not include information on customer transactions or products and services someone may have with Co-op Group. \"We appreciate that our members have placed their trust in our Co-op when providing information to us,\" said the spokesperson. \"Protecting the security of our members' and customers' data is a priority, and we are very sorry that this situation has arisen.\" Co-op membership is an opt-in scheme that offers discounts and other benefits. Read more from Sky News:Who are Scattered Spider?Prince Harry: 'I don't know how much longer my father has' It comes as M&S and luxury retailer Harrods were also struck by cyber attacks this week. On Monday, hundreds of M&S agency workers at its main distribution centre were told to stay at home as it grappled with the attack. Shoppers also complained of empty shelves as M&S confirmed \"pockets of limited availability in some stores\" due to measures to manage the incident. The company has also paused recruitment and temporarily taken down its online recruitment pages."
    },
    {
        "title": "Sycamore Gap: Man says friend wanted to cut down world's 'most famous tree'",
        "description": "One of two men on trial for cutting down the Sycamore Gap tree told a court his co-defendant had wanted to cut down the \"most famous tree in the world\".",
        "url": "https://news.sky.com/story/sycamore-gap-man-says-friend-wanted-to-cut-down-worlds-most-famous-tree-13359960",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-sycamore-gap-tree-last_6901601.jpg?20250430130118",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-02 14:46:00",
        "Headline": "Daniel Graham said co-accused Adam Carruthers wanted to cut down the \"most famous tree in the world\" and that he was asked to take the blame \"because he had mental health issues\".",
        "Content": " One of two men on trial for cutting down the Sycamore Gap tree told a court his co-defendant had wanted to cut down the \"most famous tree in the world\". Daniel Graham, 39, said Adam Carruthers, 32, rang him the morning after to claim responsibility for felling the tree beside Hadrian's Wall. He said Carruthers had asked him to take the blame \"because he had mental health issues\", believing he would be treated more leniently. The prosecution allege that Graham and Carruthers drove from Carlisle to the Northumberland landmark in September 2023 during Storm Agnes. Both men deny two counts of criminal damage to the sycamore and to the Roman Wall. On the fourth day of the trial, Graham was asked about a call Carruthers made to him on the morning of 28 September 2023. \"It was Adam claiming he had cut down the Sycamore Gap tree, claiming that it was him that cut it down,\" he said. \n                  Man accused of felling Sycamore Gap tree told police he was being 'framed'\n                 \n                  Footage of alleged moment 'Sycamore Gap tree was felled' shown to jurors in trial of two men\n                 \n                  Insufficient evidence to prosecute farmer after cows trampled rambler to death in Northumberland, inquest hears\n                 \"I told him he was talking shite, I didn't believe it.\" While Graham said his former friend had spoken of wanting to cut down the tree in the past, he \"didn't take it seriously\". \"At the time I didn't know of the tree … He told me it was the most famous tree in the world.\" He told Newcastle Crown Court that he remembered Carruthers ordering a chainsaw and saying it was big enough to cover the Sycamore Gap's circumference. Defence barrister Chris Knox said two people had been involved on the night in question, one feling the tree and the other filming. But while Graham said that Carruthers felled the tree, he \"[didn't] know 100% who the other person was\". Speaking from the witness box, Graham said he was not the one using his Range Rover or mobile phone on the night the tree was cut down, which were both traced to the tree's location. At the time, the pair were the \"best of pals\", according to Graham. When questioned by Mr Knox on whether Carruthers had asked to borrow his Range Rover, he added: \"Adam wouldn't need to ask to borrow anything of mine. He was welcome to it.\" Read more from Sky News:Prince Harry loses legal challenge over police protectionNew photo of Princess Charlotte released on birthday Jurors have been told that an anonymous call was made to the emergency services on 23 August last year, by a man believed to be Graham, in which Carruthers was named as being responsible for felling the Sycamore Gap. The trial continues."
    },
    {
        "title": "Assisted Dying: Hundreds would seek to use service in first year of it being available, government report finds",
        "description": "Hundreds of people would seek an assisted death in the first year of a service being available, with that number potentially rising to just over 4,500 after 10 years, according to a government report.",
        "url": "https://news.sky.com/story/assisted-dying-hundreds-would-seek-to-use-service-in-first-year-of-it-being-available-government-report-finds-13360067",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-assisted-dying-euthansia_6746051.jpg?20241111174046",
        "type": "UK",
        "Author": "Ashish Joshi",
        "Date Published": "2025-05-02 17:08:00",
        "Headline": "A 149-page impact assessment into the Terminally Ill Adults (End of Life) Bill was published on Friday afternoon. It estimated there could potentially be between 273 and 1,311 people applying for an assisted death in the first year.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n Hundreds of people would seek an assisted death in the first year of a service being available, with that number potentially rising to just over 4,500 after 10 years, according to a government report. A 149-page impact assessment into the Terminally Ill Adults (End of Life) Bill, measuring the financial impact of the proposed legislation, was published on Friday afternoon. It estimated there could potentially be between 273 and 1,311 people applying for an assisted death in the first year, rising to between 1,737 and 7,598 in year 10. And it found the establishment of a Voluntary Assisted Dying Commissioner and panels would cost an estimated average of between £10.9m to £13.6m per year.  The impact assessment found healthcare costs at the end of life could be reduced by as much as an estimated £10m in the first year of an assisted dying service and almost £60m after 10 years. But, the document noted that cutting end-of-life care costs \"is not stated as an objective of the policy\". Kim Leadbeater MP introduced the Terminally Ill Adults (End of Life) Bill on 16 October 2024. \n                  Widow has 'no regrets' over assisted suicide of husband despite 'ongoing' police investigation\n                 \n                  Assisted dying debate delayed after controversy over bill amendments\n                 \n                  The cheerful optimism of supporters of the assisted dying bill has turned to nervousness\n                 The bill passed its second reading in the House of Commons on 29 November 2024 with a vote of 330 to 275. Speaking after publication of the document, she said: \"I am grateful to the government for these detailed and thorough assessments of the impact of the Terminally Ill Adults (End of Life) Bill currently going through parliament. \"I'm pleased that MPs now have two full weeks to consider the assessments before the next Commons debate at Report Stage on 16 May.\" Supporters of assisted dying will be confident the impact assessment's findings will not sway any MPs and the bill will pass in May and not be derailed ahead of the final vote expected on 13 June. The timing of the document, which has been prepared by civil servants, has caused some anger among opponents of the bill. Some have suggested the report was deliberately released to coincide with the results of the local elections. 'We need better care not killing' Responding to the publication of the impact assessments, Dr Gordon Macdonald, CEO of Care Not Killing, said: \"At a time when we have seen how fragile our cash strapped health care system is, how the hospice movement has a £150m blackhole in its budget, and when up to one in four Brits who would benefit from palliative care but aren't currently receiving it, introducing so-called assisted dying would be an incredibly dangerous policy that would put pressure on vulnerable, elderly and disabled people to end their lives prematurely. \"We need to fix the UK's broken and patchy palliative care system so everyone can have a dignified death. \"We need better care, not killing.\" Changes to the bill since the original vote mean the High Court will no longer need to sign off on assisted dying cases. Instead, decisions will go through a new panel of medical and legal experts. Read more:Assisted dying: What is in the legislation?Why is assisted dying so controversial And the rollout period for setting up assisted dying services has also been extended, doubling to a maximum of four years. Under the proposed law, terminally ill adults in England and Wales with less than six months to live could choose to end their life legally. The decision would need approval from two doctors and the expert panel."
    },
    {
        "title": "Drone attacks are intensifying in Sudan - hitting schools and camps homing the displaced",
        "description": "The smell of explosives is still in the air when we arrive.",
        "url": "https://news.sky.com/story/drone-attacks-are-intensifying-in-sudan-hitting-schools-and-camps-homing-the-displaced-13360307",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sudan-war_6904220.jpg?20250503004310",
        "type": "World",
        "Author": "Yousra Elbagir, Africa correspondent, and Sam Doak, OSINT producer",
        "Date Published": "2025-05-02 23:01:00",
        "Headline": "Early morning attacks last month killed 12 people, at least two of them children. Forensic analysis by Sky News shows it's a worsening situation.",
        "Content": "By Yousra Elbagir, Africa correspondent, and Sam Doak, OSINT producer  The smell of explosives is still in the air when we arrive. Hours before, a displacement camp in Atbara housing families who fled the war in Sudan's capital Khartoum was hit by two drone strikes in a four-pronged attack. The first bomb on 25 April burned donated tents and killed the children in them. The second hit a school serving as a shelter for the spillover of homeless families. Chunks of cement and plaster had been blasted off the walls of the classrooms where they slept when the second explosive was dropped. Blood marked the entrance of the temporary home closest to the crater. Inside, shattered glass and broken window frames speak to the force of the explosion. We were told by their neighbours that four people in the family were instantly killed. \n                  'Defiled and looted': Returning home during Sudan's civil war\n                 \n                  Ransacked and looted: Sky reporter returns to family home left in ruins after war in Sudan\n                 \n                  Sudan's paramilitary chief announces rival government of 'peace and unity'\n                 \"People were torn apart. This is inhumane,\" says their neighbour Mahialdeen, whose brother and sister were injured. \"We are praying that God lifts this catastrophe. We left Khartoum because of the fighting and found it here.\" Wiping a tear, he says: \"It is chasing us.\" The sanctuary city held by the Sudanese Armed Forces (SAF) about 200 miles northeast of Khartoum has been hit by six drone attacks by the Rapid Support Forces (RSF) since the start of the year. These latest strikes are the most deadly. The drones - known for targeting civilian infrastructure - hit the displacement camp twice, the nearby power station supplying the city with electricity and an empty field with four bombs in the dark, early hours of the morning. First responders have told Sky News that 12 people were killed, including at least two children. RSF increasingly using drones to carry out attacks Data from the conflict-monitoring organisation ACLED shows the RSF has carried out increasing numbers of drone attacks across the country. The most targeted states have been Khartoum and North Darfur, where fighting on the ground has been fierce, as well as Atbara's River Nile State. The data suggests that the increase in strikes has been driven by a change in tactics following the SAF's recapture of Khartoum in late March, with the number of strikes carried out by the RSF spiking shortly after their withdrawal from the capital. Satellite imagery shows the RSF's airpower has allowed it to continue to attack targets in and around Khartoum. Nearby Wadi Seidna Airbase was targeted after the attack on Atbara, with damage visible across a large area south of its airfield. We were given access to the remains of latest suicide drones launched at Khartoum and could not find discernible signs of commercial origin. Drone experts told Sky News that they are self-built devices made from generic parts with no identifiable manufacturers for the components. Read more:Sky reporter returns to family home left in ruinsUK announces £120m aid package for Sudan  Drones sighted in South Darfur are consistent with Chinese models High-resolution satellite images confirm the presence of drones at the RSF-held Nyala Airport. While the total number of drones kept at this location is unknown, imagery from Planet Labs shows six on 24 April. This is the highest number of drones observed at the airport, suggesting an increase in the RSF's available airpower. The location and number of drones visible in satellite imagery at Nyala Airport has varied over time, suggesting they are in active use.  While it is not possible to determine the exact model of drones sighted at Nyala Airport, a report published by researchers at the Yale School of Public Health's Humanitarian Lab has previously found them to be consistent with the Chinese-produced FH-95. Analysis carried out by Sky News confirms these findings, with the measurements and visible features matching those of the CH-95 and FH-95. Both designs are produced in China. The United Arab Emirates is widely accused of supplying Chinese drones to the RSF through South Sudan and Uganda, as well as weapons through Chad. The UAE vehemently denies these claims.  Evidence of new airfields Satellite imagery viewed by Sky News suggests the RSF has worked to increase its air capabilities outside of South Darfur. In late 2024, five new airstrips appeared in West Kordofan between the contested cities of North Darfur capital Al Fashir and Khartoum. While the purpose of these airstrips is unknown, it is clear they carry some level of military significance, having been targeted by air in April. In high-resolution images, no aircraft can be seen. Damage is visible next to a structure that appears to be an aircraft hangar. The rapid escalation in drone strikes is being brutally suffered on the ground. In Atbara's Police Hospital, we find a ward full of the injured survivors. One of them, a three-year-old girl called Manasiq, is staring up at the ceiling in wide-eyed shock with her head wrapped in a bandage and her feet covered in dried blood. Her aunt tells us the explosion flung her small body across the classroom shelter but she miraculously survived. She has shrapnel in her head and clings onto her aunt as her mother is treated for her own injuries in a ward on the first floor. In a dark room deeper in the ward, a mother sits on the edge of a hospital bed holding her young injured daughter. Her son, only slightly older, is on a smaller adjustable bed further away. Fadwa looks forlorn and helpless. Her children were spending the night with relatives in the temporary tents when the first strike hit and killed her eight-year-old son. His surviving sister and brother have been asking after him, but Fadwa can't bring herself to break the news. \"What can I say? This is our fate. We fled the war in Khartoum but can't escape the violence,\" Fadwa says, staring off in the distance. \"We are condemned to this fate.\""
    },
    {
        "title": "Ship carrying aid for Gaza bombed by drones, as NGO points finger at Israel",
        "description": "A ship carrying humanitarian aid for Gaza has been bombed by drones while it was in international waters.",
        "url": "https://news.sky.com/story/ship-carrying-aid-for-gaza-bombed-by-drones-as-ngo-points-finger-at-israel-13359720",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-malta-gaza-freedom-flotilla_6903301.jpg?20250502085856",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-02 08:33:00",
        "Headline": "The NGO responsible for the vessel shared video showing fire raging onboard the vessel, and pointed the finger at Israel - which has blocked aid into Gaza for almost two months, despite children \"going to bed starving\".",
        "Content": " A ship carrying humanitarian aid for Gaza has been bombed by drones while it was in international waters. The Freedom Flotilla Coalition, the NGO responsible for the ship, has pointed the finger at Israel. Video shows fire raging onboard the vessel, which put out an SOS distress call after it was attacked off the coast of Malta. It comes as the case against Israel at the International Court of Justice continued this week. Gaza remains under blockade, with Israel having now refused to allow international aid into the devastated enclave for almost two months despite global outcry.  Following the drone attack, the Maltese government confirmed that after several hours all crew were safe and the fire was under control. The Freedom Flotilla Coalition said: \"Israeli ambassadors must be summoned and answer to violations of international law, including the ongoing blockade (of Gaza) and the bombing of our civilian vessel in international waters.\" \n                  Two children from Gaza enter UK for specialist medical care for first time after months of struggle\n                 \n                  Itamar Ben-Gvir: Israeli minister called 'war criminal' in extraordinary row with protesters during US visit\n                 \n                  Gaza aid worker detained after Israeli attack has been released\n                 It asserted that the drone attack \"appears to have specifically targeted the ship's generator\" and had left the vessel at risk of sinking. Describing the attack, it said: \"Armed drones attacked the front of an unarmed civilian vessel twice, causing a fire and a substantial breach in the hull. \"The last communication in the early morning of the 2nd of May, indicated the drones are still circling the ship.\" Read more:Wildfire in Israel burns 5,000 acresIsrael launches airstrikes near Syria's presidential palace It released video footage shot in the dark that showed lights in the sky in front of the ship and the sound of explosions. The footage also showed the vessel on fire. The Israeli foreign ministry has not commented on what happened. Yesterday, UN aid coordinator Tom Fletcher called on Israel to lift the blockade on Gaza, which has been in force for almost two months. \"Yes, the hostages must be released, now. They should never have been taken from their families,\" he said. \"But international law is unequivocal: As the occupying power, Israel must allow humanitarian support in.\" Aid should never be a \"bargaining chip\", he added. 'Children going to bed starving' Juliette Touma, spokesperson for the UN agency for Palestine refugees, UNRWA said: \"The siege on Gaza is the silent killer of children, of older people. \"Families - whole families, seven or eight people - are resorting to sharing one can of beans or peas. Imagine not having anything to feed your children. Children in Gaza are going to bed starving.\""
    },
    {
        "title": "Germany's far-right AfD party officially classified as 'extremist' organisation",
        "description": "Germany's spy agency has officially classified the far-right Alternative for Germany (AfD) party as an \"extremist\" organisation.&#160;",
        "url": "https://news.sky.com/story/germanys-far-right-afd-party-officially-classified-as-extremist-organisation-13359754",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-afd-germany_6903421.jpg?20250502110853",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-05-02 09:51:00",
        "Headline": "A 1,000-page report by Germany's domestic intelligence agency says views around ethnicity held by the AfD aim to exclude certain groups from equal participation in society.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n Germany's spy agency has officially classified the far-right Alternative for Germany (AfD) party as an \"extremist\" organisation.  The party has been growing in popularity and came second in February's general election. The country's domestic intelligence agency said on Friday that it was an extremist entity which threatens democracy. Its 1,000-page internal report claimed views around ethnicity held by the AfD aim to exclude certain groups from equal participation in society. \"The party's prevailing understanding of the people based on ethnicity and descent is incompatible with the free democratic basic order,\" the agency said in a statement. \"Specifically, the AfD considers, for example, German citizens with a migration background from predominantly Muslim countries not equal members of the ethnically defined German people.\"  Read moreConservatives win election but AfD makes gainsAnalysis: Results show stark east-west divideExplainer: The woman at the top of the AfD AfD's co-leaders Alice Weidel and Tino Chrupalla described the decision as a \"serious blow to German democracy\". In a joint statement on Friday, they said: \"The AfD is now being publicly discredited and criminalised as an opposition party shortly before the change of government. \"The associated, targeted interference in the democratic decision-making process is therefore clearly politically motivated. The AfD will continue to defend itself legally against this defamation that jeopardises democracy.\" The party leaders have consistently denied the party is either far right or extremist. Local branches of the party in the east German states of Thuringia, Saxony, and Saxony-Anhalt had already been classified as extremist by regional spy chiefs. The entire party was also previously designated \"suspected\" far-right extremist. However, the announcement allows intelligence agencies to increase surveillance on the group. It may also embolden opponents to try to get the party banned. The decision was welcomed by the country's interior minister, Nancy Faeser, who said in a statement that the new assessment was \"clear and unequivocal\", adding that the party \"discriminates against entire segments of the population and treats citizens with a migration background as second-class Germans\". She underlined that \"there has been no political influence on the findings\" but said the new classification was likely to be subject to judicial review. Chancellor Olaf Scholz said that although the intelligence agency has provided a \"very detailed justification\" for the decision, \"ban proceedings must not be rushed\". Anton Baron, a regional politician in the state of Baden-Wuerttemberg, described the decision as \"politically questionable\". While the ruling is a blow for the party, it is unlikely to influence hardcore supporters, many of whom live in states where the party was already designated extremist at a local level."
    },
    {
        "title": "Harvey Weinstein accuser breaks down in tears on witness stand - and swears at his lawyer",
        "description": "One of Harvey Weinstein's accusers broke down in tears and swore on the witness stand as a sexual abuse trial continues. ",
        "url": "https://news.sky.com/story/harvey-weinstein-accuser-breaks-down-in-tears-on-witness-stand-and-swears-at-his-lawyer-13360272",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-weinstein-new-york_6901988.jpg?20250430174203",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-02 21:24:00",
        "Headline": "The former Hollywood mogul is on trial for two counts of sexual assault and one count of rape after a 2020 conviction in New York was overturned.",
        "Content": " One of Harvey Weinstein's accusers broke down in tears and swore on the witness stand as a sexual abuse trial continues.  Warning: This article contains references to sexual assault Miriam Haley claims the former Hollywood mogul forced oral sex on her in July 2006. The case is being retried after the appeals court overturned his conviction last year. She was working as a production assistant at the time. Weinstein has strenuously denied all allegations, and Ms Haley also testified at Weinstein's initial trial. The 48-year-old was testifying in a Manhattan court when Weinstein's defence lawyer Jennifer Bonjean questioned her account of the incident. In court, Ms Bonjean asked why Ms Haley would agree to Weinstein's invitation to his apartment after testifying about his previous behaviour, including her alleging that he barged into her home. Ms Haley then became emotional after being asked how her clothes came off before Weinstein allegedly pulled out a tampon and performed oral sex on her. She said Weinstein took off her clothing, but she didn't recall the details, before Ms Bonjean asked: \"You removed your clothes, right?\" Read more: Harvey Weinstein retrial: 'He had all the power'Weinstein accuser felt 'the unthinkable was happening' during alleged assault Ms Haley then told jurors that Weinstein \"was the one who raped me, not the other way around\" - to which his lawyer said: \"That is for the jury to decide.\" She then started crying and said: \"No, it's not for the jury to decide. It's my experience. And he did that to me.\" Sky's US partner network NBC News reported that Ms Haley said during the exchange: \"Don't tell me I wasn't raped by that f*****g asshole.\" Judge Curtis Farber then halted questioning and sent jurors on a break. Ms Haley's eyes were red and her face was glistening as she left the witness stand. In February 2020, Weinstein was found guilty of sexually assaulting Ms Haley - along with raping former actor Jessica Mann in a New York hotel in 2013 - and sentenced to 23 years in prison. His conviction for the two crimes was overturned in April after an appeals court ruled the trial judge unfairly allowed testimony against Weinstein based on allegations that weren't part of the case. After the appeal ruling, Weinstein was charged with raping one woman and forcing oral sex on two others. Two of the charges are those he faced during the original trial, while the third - one of the charges of forcing oral sex on Kaja Sokola - was added last year. Weinstein denies all allegations, and his lawyers argue his accusers had consensual sexual encounters. Regardless of the outcome of the retrial, he will remain in prison over a 2022 conviction in Los Angeles for a separate count of rape. His lawyers are also appealing this sentence."
    },
    {
        "title": "Three children locked inside 'house of horrors' for years are rescued by Spanish police - reports",
        "description": "Three children kept locked inside their home since 2021 have been rescued by Spanish police, according to local reports.",
        "url": "https://news.sky.com/story/three-children-locked-inside-house-of-horrors-for-years-are-rescued-by-spanish-police-reports-13359899",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-oviedo-spain-home-police_6903634.jpg?20250502142424",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-02 13:20:00",
        "Headline": "A police officer told Spanish outlet El Mundo that the children, who had been kept inside the home since the COVID-19 pandemic, \"were in terrible shape\".",
        "Content": "Three children kept locked inside their home since 2021 have been rescued by Spanish police, according to local reports. Officers said they arrested a 53-year-old German man and a 48-year-old American woman in Oviedo, northeast Spain, on Monday. The three children - two eight-year-old twins and a 10-year-old - have been taken for medical evaluation and are now in government custody at a juvenile centre, according to Spanish outlet El Comercio. Another Spanish outlet, ABC, reported that the parents had been charged with domestic violence, habitual psychological abuse, and child abandonment. It added that the parents were being held in pretrial detention without bail. El Comercio reported that an investigation was launched after a neighbour complained on 14 April about children who lived in the home not attending school. Spanish outlet El Mundo added that other locals told police they had not seen anyone enter or leave the property since December 2021, during the COVID-19 pandemic. \n                  Couple and adult son 'died from carbon monoxide poisoning after using generator' during Spain-Portugal blackout\n                 \n                  What impact is the blackout in Spain and Portugal having and how long will it last?\n                 \n                  Power returning in Spain and Portugal after large parts hit by blackout - but what caused it?\n                 It reported that when officers went to the property during the power outages in Spain and Portugal, the mother told officers to \"be careful\" since her children were \"very sick\". Officers told the outlet that the home was filled with rubbish and a large number of medications and masks, and that the children did not appear to have any illnesses. The three children were also reported to be sleeping in cribs, which officers said were defaced with drawings of monsters and dolls. One agent told El Mundo: \"The children were in terrible shape. It was absolutely outrageous. Not malnourished, because they were fed. \"But they were also dirty… [and] completely cut off from reality, and not just because they didn't go to school. When we took them out of the house, into the garden, where they wouldn't even go outside, they saw a snail and went crazy, freaked out.\" Read more from Sky News:German far-right party classified as 'extremist'What happens when a US spy plane gets caught? Speaking at a news conference, Oviedo Police Chief Javier Lozano described the property as like a \"house of horrors\". \"We have given three children back their lives,\" he said, according to El Comercio. \"We have dismantled the house of horrors.\""
    },
    {
        "title": "Ukraine troops to join British forces for VE Day procession",
        "description": "Ukrainian troops will be taking part in the UK's military procession to mark the 80th anniversary of VE Day in London on Monday.",
        "url": "https://news.sky.com/story/ukraine-troops-to-join-british-forces-for-ve-day-procession-13360303",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pokrovsk-ukraine_6882743.jpg?20250411111256",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-02 23:01:00",
        "Headline": "Ukrainian personnel will be joining around 1,000 UK service personnel from the Royal Navy, the Royal Marines, the British Army and the Royal Air Force in London on Monday.",
        "Content": " Ukrainian troops will be taking part in the UK's military procession to mark the 80th anniversary of VE Day in London on Monday. They will join about 1,000 UK service personnel from the Royal Navy, the Royal Marines, the British Army and the Royal Air Force. Victory in Europe Day, known as VE Day, is celebrated on 8 May each year to mark when the Allies formally accepted Germany's surrender in 1945. According to the Ministry of Defence, the forces joining together for the procession will symbolise the global support for Ukraine's \"continued fight for freedom against Russia's unprovoked, illegal invasion\".  Ukraine has been at war with Russia ever since Moscow decided to invade its smaller neighbour back in February 2022. The representatives of the Ukrainian armed forces taking part in Monday's procession will consist of those deployed to the UK on Operation Interflex - the UK armed forces' training programme for Ukrainian recruits, delivered with 12 partner nations. The UK and its partners have trained more than 54,000 Ukrainians in frontline combat skills since the programme was established in the summer of 2022. \n                  What US-Ukraine minerals deal means for Putin\n                 \n                  US and Ukraine sign deal to establish investment fund\n                 \n                  Is Trump just winging his foreign policy?\n                 The MoD said Second World War veterans will be at the heart of the celebrations, watching the procession from the royal box at the Queen Victoria Memorial. D-Day veteran Jack Mortimer, 101, who will be watching the procession, said: \"People from all over the world joined forces 80 years ago to defend freedom - we must remember all of their sacrifices. \"It will be incredibly moving to see the VE Day procession and so many nations represented. \"It will remind us that these alliances still keep us safe today and why we stand by those who need our support.\" Thousands of people are expected to view the procession along The Mall as it kicks off the VE Day 80 commemorations. The procession will conclude with The Mall being filled by members of the public, and a flypast featuring the Red Arrows and 23 current and historic military aircraft. Read more:VE Day flypast route: When and where to watchAugmented reality brings to life the stories of Victory in Europe Day  Defence Secretary John Healey said: \"Eighty years after VE Day, we will celebrate our wartime veterans, our greatest generation. \"We will ensure their spirit lives on, not just in our armed forces but also in our values and commitment to strength through unity. \"In the midst of the first full-scale war in Europe since the Second World War, it is fitting that the Ukrainian armed forces currently fighting on the front line of freedom are represented in Monday's event.\" Major Pavlo, an officer of the Ukrainian marching contingent, said: \"The participation of Ukrainian service personnel in the VE Day parade in London symbolises our strength, courage and resilience. \"It is a recognition that Ukraine and its heroes stand at the forefront of the fight for freedom and peace in the world. \"We are grateful to our allies for their support and solidarity.\""
    },
    {
        "title": "TikTok fined millions for illegally sending users' data to China",
        "description": "TikTok has been fined &#8364;530m (&#163;452m) because it was illegally sending user data to China, Ireland's privacy watchdog said on Friday.",
        "url": "https://news.sky.com/story/tiktok-fined-millions-for-illegally-sending-users-data-to-china-13359869",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-tiktok-video-app_6828276.jpg?20250214042558",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-02 12:49:00",
        "Headline": "TikTok plans to lodge an appeal and says the investigation focused on a \"select period\" and \"does not reflect the safeguards now in place\".",
        "Content": "TikTok has been fined €530m (£452m) because it was illegally sending user data to China, Ireland's privacy watchdog said on Friday. Ireland's Data Protection Commission found the social media app's data transfers to China broke strict data privacy rules in the EU. It also fined the company for not being transparent with users about how their data was being processed. TikTok has been ordered to comply with the rules within six months. The Data Protection Commission is TikTok's powerful lead regulator in the EU because TikTok's European headquarters are based in Dublin. \"TikTok failed to verify, guarantee and demonstrate that the personal data of [European] users, remotely accessed by staff in China, was afforded a level of protection essentially equivalent to that guaranteed within the EU,\" Deputy Commissioner Graham Doyle said in a statement.  TikTok plans to lodge an appeal and said the decision focused on a \"select period\" that ended in May 2023 and \"does not reflect the safeguards now in place\". It specifically referred to a data localisation enterprise called Project Clover which saw three new data centres built in Europe.\"The facts are that Project Clover has some of the most stringent data protections anywhere in the industry, including unprecedented independent oversight by NCC Group, a leading European cybersecurity firm,\" said Christine Grahn, TikTok's European head of public policy and government relations. Read more from Sky News:NHS may offer weight loss jabs over counterTrump's national security adviser to leave roleNorth Korean hacker caught red-handed TikTok's parent company is based in China and it has been under scrutiny in the EU over how it handles users' data. There have long been concerns, also voiced by US politicians, over how Chinese authorities could access and use that data. The watchdog said TikTok failed to address \"potential access by Chinese authorities\" to European users' personal data.  Chinese laws justifying that access, on grounds like anti-terrorism, counter-espionage, cybersecurity and national intelligence, were identified as \"materially diverging\" from EU standards. Ms Grahn said TikTok has \"has never received a request for European user data from the Chinese authorities, and has never provided European user data to them.\" Under the EU rules, known as the General Data Protection Regulation, European user data can only be transferred outside of the bloc if there are safeguards in place to ensure the same level of protection. Ms Grahn said TikTok was being \"singled out\" despite using the \"same legal mechanisms\" that thousands of other companies in Europe do. The investigation, which opened in September 2021, also found TikTok's privacy policy at the time did not name third countries, including China, where user data was transferred. The watchdog said the policy, which has since been updated, failed to explain that data processing involved \"remote access to personal data stored in Singapore and the United States by personnel based in China\"."
    },
    {
        "title": "Chile issues tsunami warning after 7.4-magnitude earthquake",
        "description": "A 7.4-magnitude earthquake has struck off the coasts of Argentina and Chile, sparking a tsunami alert.",
        "url": "https://news.sky.com/story/74-magnitude-earthquake-sparks-tsunami-warning-off-chile-13359736",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-earthquake-chile-argentiana_6903673.jpg?20250502151345",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-02 09:13:00",
        "Headline": "The quake was registered in the Drake Passage between Cape Horn and Antarctica at a depth of 10km (six miles) on Friday, according to the US Geological Survey.",
        "Content": "A 7.4-magnitude earthquake has struck off the coasts of Argentina and Chile, sparking a tsunami alert. The quake's epicentre was under the ocean 219km (136 miles) south of Ushuaia, Argentina, according to the US Geological Survey (USGS). It struck between Cape Horn and Antarctica at a depth of 10km (six miles) at around 10am local time (2pm UK time), the USGS confirmed. Five further tremors ranging from 4.9 to 5.7 in magnitude have hit the same area off Argentina since. Chilean authorities have issued a tsunami warning and evacuation alert for the coastal Magallanes region in the south of the country. Chile's Hydrographic and Oceanographic Service (SHOA) estimated that waves will reach Antarctica and cities in Chile's extreme south in the coming hours, with bases being evacuated. Waves are expected to reach up to 3ft (1m) in Antarctica and up to 10ft (3m) in Chile. \n                  A pope of firsts, Francis was an outspoken champion of the deprived - but left some feeling betrayed\n                 \n                  Diego Maradona was in agony in the hours before his death, court hears\n                 \n                  Football fans join with pensioners to clash with police in protest at austerity in Argentina\n                 People were also asked to abandon beach areas in the Chilean Antarctic territory and urged to \"act calmly and follow the instructions of the authorities\". Chile's president, Gabriel Boric, wrote on X that \"all resources are available\" to respond to potential emergencies. No material damage or casualties were reported by authorities in Ushuaia, with local authorities adding that the earthquake was primarily felt in the city and in surrounding towns. Read more from Sky News:Ship carrying aid for Gaza bombed by dronesWildfire in Israel burns 5,000 acres \"In the face of these types of events, it is important to remain calm,\" residents were warned as authorities suspended all types of water activities and navigation in the Beagle Channel, which runs between Chile and Argentina, for at least three hours. It comes after a magnitude 5.83 tremor struck Argentina's La Rioja province on Thursday, according to the German Research Centre for Geosciences."
    },
    {
        "title": "Harvey Weinstein accuser breaks down in tears on witness stand - and swears at his lawyer",
        "description": "One of Harvey Weinstein's accusers broke down in tears and swore on the witness stand as a sexual abuse trial continues. ",
        "url": "https://news.sky.com/story/harvey-weinstein-accuser-breaks-down-in-tears-on-witness-stand-and-swears-at-his-lawyer-13360272",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-weinstein-new-york_6901988.jpg?20250430174203",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-02 21:24:00",
        "Headline": "The former Hollywood mogul is on trial for two counts of sexual assault and one count of rape after a 2020 conviction in New York was overturned.",
        "Content": " One of Harvey Weinstein's accusers broke down in tears and swore on the witness stand as a sexual abuse trial continues.  Warning: This article contains references to sexual assault Miriam Haley claims the former Hollywood mogul forced oral sex on her in July 2006. The case is being retried after the appeals court overturned his conviction last year. She was working as a production assistant at the time. Weinstein has strenuously denied all allegations, and Ms Haley also testified at Weinstein's initial trial. The 48-year-old was testifying in a Manhattan court when Weinstein's defence lawyer Jennifer Bonjean questioned her account of the incident. In court, Ms Bonjean asked why Ms Haley would agree to Weinstein's invitation to his apartment after testifying about his previous behaviour, including her alleging that he barged into her home. Ms Haley then became emotional after being asked how her clothes came off before Weinstein allegedly pulled out a tampon and performed oral sex on her. She said Weinstein took off her clothing, but she didn't recall the details, before Ms Bonjean asked: \"You removed your clothes, right?\" Read more: Harvey Weinstein retrial: 'He had all the power'Weinstein accuser felt 'the unthinkable was happening' during alleged assault Ms Haley then told jurors that Weinstein \"was the one who raped me, not the other way around\" - to which his lawyer said: \"That is for the jury to decide.\" She then started crying and said: \"No, it's not for the jury to decide. It's my experience. And he did that to me.\" Sky's US partner network NBC News reported that Ms Haley said during the exchange: \"Don't tell me I wasn't raped by that f*****g asshole.\" Judge Curtis Farber then halted questioning and sent jurors on a break. Ms Haley's eyes were red and her face was glistening as she left the witness stand. In February 2020, Weinstein was found guilty of sexually assaulting Ms Haley - along with raping former actor Jessica Mann in a New York hotel in 2013 - and sentenced to 23 years in prison. His conviction for the two crimes was overturned in April after an appeals court ruled the trial judge unfairly allowed testimony against Weinstein based on allegations that weren't part of the case. After the appeal ruling, Weinstein was charged with raping one woman and forcing oral sex on two others. Two of the charges are those he faced during the original trial, while the third - one of the charges of forcing oral sex on Kaja Sokola - was added last year. Weinstein denies all allegations, and his lawyers argue his accusers had consensual sexual encounters. Regardless of the outcome of the retrial, he will remain in prison over a 2022 conviction in Los Angeles for a separate count of rape. His lawyers are also appealing this sentence."
    },
    {
        "title": "Plans for huge military parade on Donald Trump's birthday emerge",
        "description": "Detailed plans for a large military parade on Donald Trump's birthday have emerged - involving thousands of soldiers as well as hundreds of tanks and helicopters.",
        "url": "https://news.sky.com/story/plans-for-huge-military-parade-on-donald-trumps-birthday-emerge-13359615",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-us-army_6903141.jpg?20250502040719",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-02 02:59:00",
        "Headline": "After seeing a military parade in France on Bastille Day in 2017, the president called for an even grander event to take place on Pennsylvania Avenue.",
        "Content": "Detailed plans for a large military parade on Donald Trump's birthday have emerged - involving thousands of soldiers as well as hundreds of tanks and helicopters. Blueprints seen by the AP news agency suggest the event would feature seven army bands, parachute jumps and historical vehicles, followed by a concert and fireworks in the evening. But the plans to showcase armoured fighting vehicles, Howitzers and tanks have raised concerns about potential damage to Washington DC's roads. Donald Trump has long wanted a big military parade. After seeing one in France on Bastille Day in 2017, he called for an even grander event to take place on Pennsylvania Avenue. Those plans were abandoned the following year because of high costs, with some estimates suggesting the display of America's military might would command a £69m price tag. The latest proposals come as the US Army plans to mark its 250th anniversary on 14 June, which happens to coincide with the president turning 79. According to the documents, more than 6,600 soldiers, 150 vehicles, 50 helicopters and more than 2,000 civilians would be involved. \n                  iPhones sold in US will no longer come from China - as Apple reveals impact of Trump's tariffs\n                 \n                  'You're fired! Why Trump waited until now to sack his national security adviser\n                 \n                  Mike Waltz's 'Signalgate' mistake weakened Trump - so why isn't Pete Hegseth also getting fired?\n                 Beyond the logistics of accommodating and feeding service personnel, it would also be costly to move military vehicles and aircraft from across the US. One file warns of \"significant concerns regarding security requirements\" as equipment is brought in by train or flown in. Read more:Trump's national security adviser sackedPresident celebrates 100 days in officeIs Trump following 'Project 2025' playbook?  Army spokesman Col Dave Butler said: \"We want to make it into an event that the entire nation can celebrate with us. We want Americans to know their Army and their soldiers. \"A parade might become part of that, and we think that will be an excellent addition to what we already have planned.\" Washington DC's mayor, Muriel Bowser, has warned tanks rolling through the streets \"would not be good\". Last month, she said: \"If military tanks were used, they should be accompanied with many millions of dollars to repair the roads.\""
    },
    {
        "title": "I Kissed A Girl musician Jill Sobule dies in house fire",
        "description": "Jill Sobule, the award-winning singer-songwriter behind one of the first LGBTQ+ songs to hit the mainstream - I Kissed A Girl - has died in a house fire.",
        "url": "https://news.sky.com/story/i-kissed-a-girl-musician-jill-sobule-dies-in-house-fire-13359822",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-1997-jill-sobule_6903307.jpg?20250502132615",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-02 11:45:00",
        "Headline": "Jill Sobule is described as \"a force of nature and human rights advocate,\" whose \"music is woven into our culture\".",
        "Content": "Jill Sobule, the award-winning singer-songwriter behind one of the first LGBTQ+ songs to hit the mainstream - I Kissed A Girl - has died in a house fire. Her death in Woodbury, Minnesota, was announced by her publicist. It was not immediately clear how the fire started. The 66-year-old's manager, John Porter, called her \"a force of nature and human rights advocate,\" whose \"music is woven into our culture\". He said in a statement: \"I was having so much fun working with her. I lost a client and a friend today. I hope her music, memory, and legacy continue to live on and inspire others.\" The White Lotus star Carrie Coon posted on social media: \"Jill Sobule was so special. Heartbreaking news.\" Sharing a photo of herself with Sobule from 2001, singer-songwriter Tracy Chapman wrote on X: \"We are deeply saddened to hear of the tragic passing of Jill Sobule. Let us listen to her music to honor the wonderful singer-songwriter she was.\" Sobule had been due to play a gig in Denver on Friday night, but the event will now become a tribute to her life. A formal memorial will be held later this summer. \n                  Video captures ten-year-old boy driving stolen car across 'crowded' school playground\n                 \n                  Family infected with roundworms that can travel to brain after eating undercooked bear kebabs\n                 \n                  Baseball team accused of fat-shaming after naming mascot 'Ozempig' after weight-loss drug\n                 Over three decades of performing and recording, the singer-songwriter released 12 albums, exploring complex topics including the death penalty, anorexia nervosa, reproduction and LGBTQ+ issues. Her first album, Things Here Are Different, was released in 1990. Five years later, she received widespread attention for her hit singles, Supermodel, from the movie Clueless, and I Kissed A Girl, which, despite being banned on several southern radio stations, made it into the Billboard Top 20 in the US. In 2008, Katy Perry's worldwide hit I Kissed A Girl - which used the same title but was not a cover version - created a renewed interest in her track. Sobule also starred in an autobiographical off-Broadway musical featuring songs and stories about her life. An early adopter of crowdfunding, in 2008, after two major record companies dumped her and two indie labels went bankrupt beneath her, she raised tens of thousands of dollars from fans so she could make a new album. A shy child, Sobule was born in Denver, Colorado, on 16 January 1959. She would go on to perform with stars including Neil Young, Cyndi Lauper and Billy Bragg, and said she would \"wing\" her frequent live shows, never preparing a set list. She made a cameo on an episode of The Simpsons in 2019. In a 2023 interview with The Associated Press, she said: \"In a good way, I feel like I'm still a rookie. There's so much more to do and I haven't done my best yet.\" She is survived by her brother and sister-in-law, James and Mary Ellen Sobule, along with her nephews and cousins."
    },
    {
        "title": "North Korean hacker who tried to get a job at US tech company caught red-handed - here's how",
        "description": "A North Korean hacker who attempted to infiltrate the ranks of a US tech company has been caught red-handed.",
        "url": "https://news.sky.com/story/north-korean-hacker-who-tried-to-get-a-job-at-us-tech-company-caught-red-handed-heres-how-13359599",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-cybercrime-hacker-hacking_6840137.jpg?20250226113306",
        "type": "US",
        "Author": "Connor Sephton",
        "Date Published": "2025-05-02 00:10:00",
        "Headline": "A series of red flags emerged through the interview process - with the fraudster's voice changing repeatedly during a Zoom call.",
        "Content": "\n          News reporter\n              @ConnorSephton\n A North Korean hacker who attempted to infiltrate the ranks of a US tech company has been caught red-handed. He had applied for an engineering role at the Kraken cryptocurrency exchange, which knew he was a malicious actor from the very start. But instead of rejecting his CV, executives allowed him to advance through the recruitment process so they could gather intelligence about his tactics.  The first red flag emerged when the hacker joined a video call using a different name to the one on his resume, with his voice occasionally switching throughout the interview. It was also discovered that the dodgy candidate's email address was linked to a large network of fake identities and aliases used by a hacking group. Forensic examination of his ID showed that it appeared to have been altered - and may have featured details from victims of identity theft. Traps were also set in the final interview, when the hacker was asked to verify their location and recommend nice restaurants in the city they claimed to live in. \n                  Grand Theft Auto VI release delayed\n                 \n                  TikTok fined millions for illegally sending users' data to China\n                 \n                  iPhones sold in US will no longer come from China - as Apple reveals impact of Trump's tariffs\n                 Kraken said this caused the candidate to unravel - and they were unable to convincingly answer simple questions because they were flustered and caught off guard. \"By the end of the interview, the truth was clear: this was not a legitimate applicant, but an imposter attempting to infiltrate our systems,\" the company added. Read more tech news:M&S pauses recruitment amid cyber attackUK heading for 'climate disaster'  Its chief security officer Nick Percoco has warned state-sponsored attacks are a \"global threat\" - and while some hackers break in, others try to walk through the front door. Although artificial intelligence is making it easier to deceive businesses, he doesn't believe this technology is foolproof, as real-time verification tests can often wrong-foot fraudsters. Research from the Google Threat Intelligence Group suggests this is a growing problem - with North Korean IT workers gaining employment at major companies in the US and Europe. Their salaries help generate revenue for the secretive state - and in some cases, malicious actors also extort their employers by threatening to release commercially sensitive information."
    },
    {
        "title": "iPhones sold in US will no longer come from China - as Apple reveals impact of Trump's tariffs",
        "description": "Apple says devices sold in the US will no longer come from China, as the tech giant tries to mitigate the impact of Donald Trump's tariffs.",
        "url": "https://news.sky.com/story/iphones-sold-in-us-will-no-longer-come-from-china-as-apple-reveals-impact-of-trumps-tariffs-13359607",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-iphone-apple_6903125.jpg?20250502024444",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-02 01:37:00",
        "Headline": "Apple's reliance on Chinese factories to manufacture its iPhones meant the company was far more exposed to the impact of Trump's trade war than others.",
        "Content": "Apple says devices sold in the US will no longer come from China, as the tech giant tries to mitigate the impact of Donald Trump's tariffs. Most iPhones will be sourced from India instead, with iPads coming from Vietnam, to prevent dramatic price rises for American consumers. Unveiling financial results from January to March, the company said the US president's escalating trade war has had a limited impact on its performance so far. However, Apple CEO Tim Cook believes the tariffs will add £677m in costs during the current quarter - assuming Trump's policies don't change.  Revenue for the first three months of the year stood at £71.8bn, with earnings of £18.6bn also beating analyst expectations. High demand for iPhones during this period may have been driven by US shoppers rushing to make purchases before the new tariffs came into force. But the full impact of any panic buying will only emerge when Apple reports its results from April to June later in the year. \n                  Apple and Meta fined millions by EU over competition law\n                 \n                  'Cloak of secrecy' over Apple and Home Office showdown must be removed, US politicians tell tribunal\n                 \n                  Apple vs Home Office encryption court battle must be held in public, say MPs\n                 Apple's reliance on Chinese factories to manufacture its iPhones meant the company was far more exposed to the impact of Trump's trade war than others. Read more from Sky News:NHS may offer weight loss jabs over counterTrump's national security adviser to leave roleNorth Korean hacker caught red-handed  After the president unveiled plans to impose reciprocal tariffs on dozens of countries - now largely paused for 90 days - Apple's stock plunged by 23%, wiping out £582bn of value. While its share price has recovered slightly, it remains 5% lower than before \"Liberation Day\". Growing tensions between Washington and Beijing are also having an impact on Apple's sales in China, which fell 2.3% between January and March.  Addressing the planned changes to manufacturing, Mr Cook added: \"We have a complex supply chain. There's always risk in the supply chain. What we learned some time ago was that having everything in one location had too much risk with it.\" Devices sold outside of the US will continue to be made in China."
    },
    {
        "title": "Struggling Aston Martin steers into fresh pay controversy",
        "description": "Aston Martin is steering a path towards a twin-pronged pay row with shareholders as it grapples with the impact of President Trump's tariffs on car manufacturers.",
        "url": "https://news.sky.com/story/struggling-aston-martin-steers-into-fresh-pay-controversy-13359890",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-aston-martin-factory_6901478.jpg?20250430113944",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-02 13:11:00",
        "Headline": "The voting advisory service ISS is urging investors to vote against both the pay report and remuneration policy of James Bond's favourite car-maker, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Aston Martin is steering a path towards a twin-pronged pay row with shareholders as it grapples with the impact of President Trump's tariffs on car manufacturers. Sky News can reveal that the influential proxy voting adviser ISS is urging investors to vote against both of Aston Martin Lagonda Global Holdings' remuneration votes at next week's annual general meeting.  The pay policy vote, which is binding on the company, has attracted opposition from ISS because it proposes significant increases to potential bonus awards to Adrian Hallmark, the company's new chief executive.  \"Concerns are raised regarding the increased bonus maximums, which are built upon competitively[1]positioned salary levels and do not appear appropriate given the company's recent performance,\" ISS said in a report to clients.  \n                  Co-op 'very sorry' after hackers access members' data \n                 \n                  Financial wellbeing platform Mintago lands £6m funding boost\n                 \n                  iPhones sold in US will no longer come from China - as Apple reveals impact of Trump's tariffs\n                 Aston Martin is also facing a meaningful vote against its pay report for last year - which is on an advisory basis only - because of the salaries awarded to Mr Hallmark and other executive directors.  The company's shares have nearly halved in the last year, and it now has a market value of little more than £660m.  Despite the ISS recommendation, Aston Martin will win the vote by virtue of chairman Lawrence Stroll's 33% shareholding.  The luxury car manufacturer has had a torrid time as a public company and now faces the headwinds of President Trump's tariffs blitz.  This week it said it would limit exports to the US to offset the impact of the policy.  Aston Martin did not respond to a request for comment ahead of next Wednesday's AGM."
    },
    {
        "title": "Co-op 'very sorry' after hackers access members' data ",
        "description": "The Co-op has apologised after hackers managed to access the data of a \"significant number\" of past and current members.",
        "url": "https://news.sky.com/story/co-op-very-sorry-after-hackers-access-members-data-13360205",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-co-op-supermarket-money_6901621.jpg?20250430131418",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-02 19:51:00",
        "Headline": "The hacking attack follows similar incidents this week that have targeted M&S and Harrods.",
        "Content": "The Co-op has apologised after hackers managed to access the data of a \"significant number\" of past and current members. The firm said the compromised data included names and contact details but not passwords or bank and credit card details. It said it was \"continuing to experience sustained malicious attempts\". The National Cyber Security Centre (NCSC) and the National Crime Agency (NCA) are helping the company investigate. 👉 Listen to Sky News Daily on your podcast app 👈 A spokesperson described it as a \"highly complex situation\" and said it had \"implemented measures to ensure that we prevent unauthorised access to our systems\". \"As a result of ongoing forensic investigations, we now know that the hackers were able to access and extract data from one of our systems,\" said a statement. \n                  What is going on with the retail cyber attacks?\n                 \n                  M&S pauses recruitment amid ongoing cyber attack\n                 \n                  Who are Scattered Spider? How the notorious hackers linked to M&S cyber attack work\n                 \"The accessed data included information relating to a significant number of our current and past members.\" It said the data compromised also did not include information on customer transactions or products and services someone may have with Co-op Group. \"We appreciate that our members have placed their trust in our Co-op when providing information to us,\" said the spokesperson. \"Protecting the security of our members' and customers' data is a priority, and we are very sorry that this situation has arisen.\" Co-op membership is an opt-in scheme that offers discounts and other benefits. Read more from Sky News:Who are Scattered Spider?Prince Harry: 'I don't know how much longer my father has' It comes as M&S and luxury retailer Harrods were also struck by cyber attacks this week. On Monday, hundreds of M&S agency workers at its main distribution centre were told to stay at home as it grappled with the attack. Shoppers also complained of empty shelves as M&S confirmed \"pockets of limited availability in some stores\" due to measures to manage the incident. The company has also paused recruitment and temporarily taken down its online recruitment pages."
    },
    {
        "title": "Financial wellbeing platform Mintago lands £6m funding boost",
        "description": "A financial wellbeing platform which counts the alcohol-free beer producer Lucky Saint among its clients has landed a &#163;6m funding injection from a syndicate of well-known investors.",
        "url": "https://news.sky.com/story/financial-wellbeing-platform-mintago-lands-1636m-funding-boost-13359796",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-lucky-saint-mintago_6903466.jpg?20250502120009",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-02 10:55:00",
        "Headline": "The company, which counts Lucky Saint and Avis among its users, has finalised a Series A fundraising jointly led by Guinness Ventures, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A financial wellbeing platform which counts the alcohol-free beer producer Lucky Saint among its clients has landed a £6m funding injection from a syndicate of well-known investors.   Sky News understands that Mintago, which was founded in 2019, will announce in the coming days that Guinness Ventures has jointly led the Series A round alongside Seed X Liechtenstein and Social Impact Enterprises.  Mintago, which also counts car rental firm Avis and Northumbrian Police among its customers, aims to help employees save and manage their money more effectively.  \n                  Struggling Aston Martin steers into fresh pay controversy\n                 \n                  Co-op 'very sorry' after hackers access members' data \n                 \n                  iPhones sold in US will no longer come from China - as Apple reveals impact of Trump's tariffs\n                 A number of the start-up's current investors, Love Ventures and Truesight Ventures, are also understood to have reinvested as part of the fundraising.  The company was set up by Chieu Cao and Daniel Conti, and claims to offer more salary sacrifice schemes than any other UK provider.  It also provides independent financial advice, a service for finding lost pension pots, retail discounts and GP services.  \"We realised that organisations are crying out for the same help we provide their staff,\" Mr Conti said.  \"The benefits of providing that support impact everyone.  \"When a company improves their salary sacrifice benefits engagement, they can save thousands in National Insurance Contributions, but their employees save too, easing the strain on their finances.\"  The new capital will be used to develop additional products using artificial intelligence, according to the company.  \"Mintago is enabling its customers to become truly people-centric organisations by giving them the tools to support their employees' financial wellbeing,\" Mathias Jaeggi, a partner at Seed X Liechtenstein, said. "
    },
    {
        "title": "iPhones sold in US will no longer come from China - as Apple reveals impact of Trump's tariffs",
        "description": "Apple says devices sold in the US will no longer come from China, as the tech giant tries to mitigate the impact of Donald Trump's tariffs.",
        "url": "https://news.sky.com/story/iphones-sold-in-us-will-no-longer-come-from-china-as-apple-reveals-impact-of-trumps-tariffs-13359607",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-iphone-apple_6903125.jpg?20250502024444",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-02 01:37:00",
        "Headline": "Apple's reliance on Chinese factories to manufacture its iPhones meant the company was far more exposed to the impact of Trump's trade war than others.",
        "Content": "Apple says devices sold in the US will no longer come from China, as the tech giant tries to mitigate the impact of Donald Trump's tariffs. Most iPhones will be sourced from India instead, with iPads coming from Vietnam, to prevent dramatic price rises for American consumers. Unveiling financial results from January to March, the company said the US president's escalating trade war has had a limited impact on its performance so far. However, Apple CEO Tim Cook believes the tariffs will add £677m in costs during the current quarter - assuming Trump's policies don't change.  Revenue for the first three months of the year stood at £71.8bn, with earnings of £18.6bn also beating analyst expectations. High demand for iPhones during this period may have been driven by US shoppers rushing to make purchases before the new tariffs came into force. But the full impact of any panic buying will only emerge when Apple reports its results from April to June later in the year. \n                  Apple and Meta fined millions by EU over competition law\n                 \n                  'Cloak of secrecy' over Apple and Home Office showdown must be removed, US politicians tell tribunal\n                 \n                  Apple vs Home Office encryption court battle must be held in public, say MPs\n                 Apple's reliance on Chinese factories to manufacture its iPhones meant the company was far more exposed to the impact of Trump's trade war than others. Read more from Sky News:NHS may offer weight loss jabs over counterTrump's national security adviser to leave roleNorth Korean hacker caught red-handed  After the president unveiled plans to impose reciprocal tariffs on dozens of countries - now largely paused for 90 days - Apple's stock plunged by 23%, wiping out £582bn of value. While its share price has recovered slightly, it remains 5% lower than before \"Liberation Day\". Growing tensions between Washington and Beijing are also having an impact on Apple's sales in China, which fell 2.3% between January and March.  Addressing the planned changes to manufacturing, Mr Cook added: \"We have a complex supply chain. There's always risk in the supply chain. What we learned some time ago was that having everything in one location had too much risk with it.\" Devices sold outside of the US will continue to be made in China."
    },
    {
        "title": "NatWest sees profits rise by 36% as privatisation looms",
        "description": "NatWest Group has revealed its first quarter profit rose by 36% - as the British lender prepares to return fully to private ownership for the first time since its 2008 financial crisis bailout.",
        "url": "https://news.sky.com/story/natwest-sees-profits-rise-by-36-as-privatisation-looms-13359677",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-natwest-bank_6816102.jpg?20250201101426",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-02 07:02:00",
        "Headline": "The bank - which bosses say is at an \"inflection point\" - enjoys healthy results off the back of healthier margins and stronger trading returns.",
        "Content": "NatWest Group has revealed its first quarter profit rose by 36% - as the British lender prepares to return fully to private ownership for the first time since its 2008 financial crisis bailout. The high-street lender delivered £1.8bn in operating profit before tax, beating market forecasts of £1.6bn. The results come as the government's stake in NatWest fell below 2% on Thursday, having reduced its shareholding from nearly 40% in December 2023 - described as an \"inflection point\" by the bank's boss. NatWest's return on tangible equity - a key measure of banking profitability - reached a robust 18.5%, prompting executives to revise guidance upward for the full year. The company also saw fuller margins on its deposits and higher trading returns. Money blog: Hotels chains with worst check-in times - and extra charges Chief executive Paul Thwaite confirmed the bank now anticipates hitting \"the upper end\" of its previously announced targets for both income and returns. \"Our strong first quarter performance demonstrates the positive momentum in our business as we deliver against clear strategic priorities,\" Mr Thwaite said. NatWest's net interest margin (NIM) improved to 2.2%, an increase of 8 basis points from the previous quarter, reflecting deposit margin expansion. Meanwhile, operating expenses were 8.5% lower than the final quarter of 2024, and 4.6% lower than the same period last year, reflecting seasonally higher costs in Q4 2024 and NatWest's ongoing business transformation. The results showcase the turnaround of an institution once requiring a £45bn taxpayer rescue during the 2008 financial crisis. NatWest's UK-focused strategy has insulated it from the international market volatility triggered by recent American trade policies, a challenge affecting more international competitors. Total income reached £3.95bn, while loan impairments remained modest at £189m, suggesting stable credit quality across the customer base. Financial analysts viewed these results as validation of NatWest's strategy, as it pivots between post-crisis recovery and forward-looking growth initiatives."
    },
    {
        "title": "Grand Theft Auto VI release delayed",
        "description": "Grand Theft Auto VI, the most hotly anticipated title in gaming history, has been delayed.",
        "url": "https://news.sky.com/story/grand-theft-auto-vi-release-delayed-13359923",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-money-blog-gta_6879575.jpg?20250408092611",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-02 14:09:00",
        "Headline": "Rockstar Games first unveiled the trailer for Grand Theft Auto VI in December 2023, set to Tom Petty's Love Is a Long Road. The video was watched more than 100 million times in 24 hours.",
        "Content": "Grand Theft Auto VI, the most hotly anticipated title in gaming history, has been delayed. Take-Two Interactive pushed the release of the blockbuster title to May 2026 on Friday. The video game was previously expected to be released in autumn this year and is expected to be an instant hit with billions in sales every year, according to analysts. Its predecessor, Grand Theft Auto V, is one of the best-selling video games of all time, selling more than 200 million copies since its release in 2013. \"With every game we have released, the goal has always been to try and exceed your expectations, and Grand Theft Auto VI is no exception,\" said developer Rockstar Games in a statement posted on social media. \"We hope you understand that we need this extra time to deliver at the level of quality you expect and deserve.\" After the announcement, publisher Take-Two's share prices tumbled by 9%. \n                  BAFTA Games Awards: Full list of winners\n                 \n                  BAFTA Games Awards: Astro Bot tops leaderboard - with psychological horror close behind\n                 \n                  Expert predicts GTA VI will cost $100 and believes gamers will snap it up without complaint\n                 \"We support fully Rockstar Games taking additional time to realize their creative vision for Grand Theft Auto VI, which promises to be a groundbreaking blockbuster entertainment experience,\" said Take-Two chief executive Strauss Zelnick.  Rockstar Games first unveiled the trailer for Grand Theft Auto VI in December 2023, set to Tom Petty's Love Is a Long Road. The video was watched more than 100 million times in 24 hours. Read more from Sky News:NHS may offer weight loss jabs over counterTrump's national security adviser to leave roleNorth Korean hacker caught red-handed It confirmed the game's return to Vice City and introduced the game's first female lead, Lucia, hinting at a modern-day Bonnie-and-Clyde duo. GTA VI was expected to drive growth in the video game industry this year after a troubling period. Rising production costs and growing expectations around games mean many titles have been delayed, causing financial problems for studios and frustration for players. During the pandemic, when millions more people began playing video games, studio sizes swelled. Once the lockdowns ended, however, demand dropped and the industry now faces an employment crisis with redundancies at studios around Britain and the world."
    },
    {
        "title": "The political earthquake Farage has long promised is now shaking our political system",
        "description": "It's quite simply a political earthquake. Across England, Reform proved it can translate positive polling into real power, picking up another parliamentary seat, a mayoralty, Staffordshire and Lincolnshire councils and dozens of seats by lunchtime. The popularity surge for this anti-establishment party is real.&#160;",
        "url": "https://news.sky.com/story/nigel-farages-hope-to-one-day-be-prime-minister-is-no-longer-a-pipe-dream-13359947",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nigel-farage-beth-rigby_6903734.jpg?20250502222121",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-05-02 14:32:00",
        "Headline": "What is clear after today is that the political earthquake Farage has long promised is now shaking our political system in a perhaps epochal way, Beth Rigby writes.",
        "Content": "\n          Political editor\n              @BethRigby\n  It's quite simply a political earthquake. Across England, Reform proved it can translate positive polling into real power, picking up another parliamentary seat, a mayoralty, Staffordshire and Lincolnshire councils and dozens of seats by lunchtime. The popularity surge for this anti-establishment party is real.  Look at the votes: Reform doubling its vote share in Runcorn against the general election to 38%, clocking up 42% of the vote in the Lincolnshire mayoral race and 32% in the Doncaster mayoral race, running Labour very close. By lunchtime, Reform had taken the long-held Staffordshire council from the Tories, wiping out their five-strong majority. The significance of these wins, added in with the big gains for the Lib Dems and Greens, cannot be overstated. It speaks in a serious way to a new era of politics in the UK, in which the decades-long duopoly of Labour versus Conservative is crumbling with the rise of the other parties. Politics latest: PM told to 'change course' as Reform surge to election wins The trend was evident in the 2024 general election, when the two main parties got their lowest ever vote share. Labour's clever targeting of seats ensured that it won a massive majority on just 34% of the popular vote. The Lib Dems won a record 70 seats, while Reform picked up five MPs and came second in 98 constituencies.  If that was a loveless landslide, this is the break-up, as voters, who backed Labour's change message, seem to be pressing the change button again and turning out for a leader who is tapping into voters' disillusionment with his slogan that \"Britain is broken and needs Reform\". For the government to lose a by-election just 10 months after winning a massive landslide is a terrible moment for Labour. It won this seat with 53% of the vote in July, against Reform polling at 18%. To end up losing it - albeit by just six votes - is a dreadful verdict from voters here on their early performance. Those around the PM admit it is deeply frustrating but say they expected a kicking from an angry electorate impatient for change. They are taking crumbs of comfort in, just about, holding the mayoralties of Doncaster, North Tyneside and West of England. But in early council results, the drop in the Labour vote is big, and that raises questions as to whether Starmer's party will struggle to hold constituencies it gained in the July election, such as Hexham in Northumberland. The approach from No 10 is to \"keep calm and carry on\" with its government agenda - the immigration white paper, defence review, infrastructure strategy - to deliver for the public and win back the support they had in the last general election in time for the next. Read more:Full local and mayoral election resultsReform has put the two traditional parties on notice For the Conservatives, it's been - to quote one political rival - a \"story of Tory councillors getting machine gunned\". In Staffordshire, where Farage did his final rally, Reform have taken a council where the Tories had a 50-strong majority. The party has been absolutely hammered by Reform in the Tory heartlands of Lincolnshire, where Dame Andrea Jenkyns won the Greater Lincolnshire mayoralty by 40,000 votes. In the general election, the Conservatives held six of the eight parliamentary seats in this county, on Friday Jenkyns beat the Tories in eight out of the nine areas. Those around Conservative leader Kemi Badenoch are trying to steady nerves, arguing that these results are disappointing but not surprising in the context of the party's worst-ever election defeat in 2024, with the party \"under new leadership\" and \"still in the early stages of a long-term plan to renew\". Others are panicked and angry. \"This is what political extinction looks like,\" one senior Tory source told me, in a sign that questions over Badenoch's leadership are only going to build.  There are many results still to come in, but what these elections are pointing to is the rise of multi-party politics with voting spread across three or four parties in many of the races and the two main parties rapidly losing ground. It ties into the longer run trends in our voting, leaning towards more parties and less tribalism amongst voters, as the electorate shift loyalties, and frustration with Labour and the Tories fuels support for the alternatives. Reform's success in Runcorn and Durham, as well as Staffordshire and Lincolnshire, shows that Farage poses a significant threat to the two main parties. Add in the Lib Dems, challenging the Tories in their blue wall shires on the centre right, and what we see emerging is a party system where the two governing parties are no longer dominant. These elections then, while relatively small, are profoundly consequential for our political system. Where we go next is hugely unclear. Much will rest on whether Labour can deliver on its promises and dull Farage's drumbeat of change. Reform's challenge will be to prove that it can govern and sustain the additional scrutiny that being in office entails. The Conservatives are in the most desperate place of all, squeezed by Reform on the right flank and the Lib Dems on the left. But what is clearer after today is that the political earthquake Farage has long promised is now shaking our political system in a perhaps epochal way. The Reform leader has long been saying he is this country's next prime minister. Looking at the way he and his party have translated poll leads into real power means that prospect is no longer a pipe dream."
    },
    {
        "title": "Reform has put the two traditional parties on notice - and we don't know where this ends",
        "description": "British politics is changing after a night that saw a sensational, record-breaking victory by Nigel Farage in the North West.",
        "url": "https://news.sky.com/story/reform-has-put-the-two-traditional-parties-on-notice-and-we-dont-know-where-this-ends-13359642",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nigel-farage-sam-coates_6903637.jpg?20250502142610",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-05-02 05:30:00",
        "Headline": "The significance of this morning's local election results will be argued over for years to come. Reform UK has taken votes from Labour and the Conservatives - and won Runcorn and Helsby by-election.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  British politics is changing after a night that saw a sensational, record-breaking victory by Nigel Farage in the North West. That's the conclusion of a nail-biting night that delivered more drama than expected and gives strong indications - though not yet certainty - about how politics is being reshaped for a new era, which means greater political unpredictability and challenges for the main parties in highly uncomfortable ways. The significance of this morning's results will be argued over for years to come. Reform beats Labour by six votes; follow Politics latest Hours after counting began, there are two big themes for definite. The first is that Reform UK proved they continue to evolve into a mature and potentially lethal political force. Across the country they are now winning votes in Labour areas as well as Conservative, and they have run both parties close in a number of key contests. They achieved vote shares of 40% or more, twice their share at the General Election. They even won a seat from the Liberal Democrats. Read more:Mayoral election results as they come in  The second is that while Labour was able to deliver a number of physiologically important mayoral wins - often by the smallest of margins - they need to go up a gear to fight. Labour's vote declined but did not collapse and they are still able to get \"their people\" to the ballot box from Bristol to Tyneside. But in the most important battle of all - the North West seat of Runcorn and Helsby - they could not, and Reform UK pulled off a stunning triumph, taking the 49th-safest Labour seat in the country. Nigel Farage and the team had poured huge amounts of time and resource into the seat, with multiple visits and the chairman Zia Yusuf on the ground to direct operations. It paid off. By contrast, Sir Keir Starmer did not turn up once. Number 10 will be asking itself today whether a prime ministerial visit could have been worth those six precious votes. It is true to say that politics has become so unpredictable because neither party knew what was about to happen. The evening started with Reform UK hinting at victory, but by 2am Labour was quietly confident. By 3am, it had turned out neither really knew, and a full recount was launched after Reform UK was four votes ahead. After the recount, Labour had lost by six. This is the moment Reform UK proved itself a protest party for Labour voters as well as Tories.  Significance for Reform is immense The significance is immense. At last year's general election, there were over 150 seats where the Tories lost because Reform UK got more votes than the margin by which the Conservatives lost to the winner. Now this suggests that Reform UK has the capacity to mete out the same damage to Labour and puts the two traditional parties on notice that they face a threat. Labour has already shown itself willing to bend because of the threat of Reform UK, slashing the aid budget to pay for more military spending and slashing Whitehall with a promise of more to come. The question is, how much further can Labour go in this direction? In some of the council by-elections there was already evidence of bleeding to the Greens - a sign that more left-leaning one-time Labour supporters are deserting the party because they think it no longer represents them. What course does this Number 10 chart now? A slew of announcements on immigration and slashing red tape - and risk a greater schism on the left - or end up in the mushy middle and pleasing no one? The choices are unappetising. Then there is the challenge for the Tories. For those hoping for a non-aggression pact on the right, today's results suggest that Reform UK can credibly question whether they are a party of the right, given their success in Labour areas. This is a complicating factor. Where does the logic heard in the leaked recording by Robert Jenrick - brought up by Nigel Farage this morning - take us now? There will be those who point to UKIP's success in the early 2010s and lack of impact in the 2015 election, and say that there is no certainty that Reform UK will fly. Of course, there is a chance they may fade, particularly if their infighting gets worse. But UKIP never achieved a breakthrough on the left like Reform UK has done to date, and its impact may never actually be in the seats that it wins. Arguably in that early 2010 period, Farage and UKIP left an even bigger legacy without ever holding power: a Brexit referendum which he went on to win. There are now lots of paths for what Farage has started to change Britain. We do not know where this ends."
    },
    {
        "title": "'I get it': Starmer responds after losing Runcorn by-election to Nigel Farage's Reform UK",
        "description": "Sir Keir Starmer has said he \"gets\" why his party suffered defeat to Reform UK in the Runcorn by-election, as he promised to go \"further\" in delivering change.",
        "url": "https://news.sky.com/story/i-get-it-starmer-responds-after-losing-runcorn-by-election-to-nigel-farages-reform-uk-13359748",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-runcorn_6903498.jpg?20250502123940",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-05-02 09:40:00",
        "Headline": "The prime minister says the result proves Labour needs to go \"further\" and faster in delivering change for the public.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Sir Keir Starmer has said he \"gets\" why his party suffered defeat to Reform UK in the Runcorn by-election, as he promised to go \"further\" in delivering change. The prime minister said the result in Runcorn and Helsby - where Labour lost to Nigel Farage's party by six votes - was \"very, very close\" but that he didn't want to give a \"standard answer\" by suggesting opposition parties do well in by-elections. Asked by Sky News what he believed his government had done in the 10 months to cause voters in traditional Labour strongholds to shun the party, he replied: \"I want to respond by saying I get it.\" Politics latest: Starmer defends government's \"tough decisions\" Sir Keir said Labour was elected to \"deliver change\" and argued that the evidence of that was beginning to show with NHS waiting lists coming down and more appointments being created. However, he said the message he was taking away from the results was that \"we must deliver that change even more quickly. We must go even further.\" The by-election in Runcorn and Helsby was triggered after the previous Labour MP, Mike Amesbury, resigned following his conviction for punching a constituent. \n                  Sir Keir Starmer hails new British 'StormShroud' drones coming into operation\n                 \n                  Blair's net zero comments less an 'attack' and more a highlighting of a policy paradox that's been clear for some time\n                 \n                  Labour promised MPs a vote on Trump trade deal - now Starmer doesn't seem so sure\n                 Reform candidate Sarah Pochin won with 12,645 votes, compared with the 12,639 secured by Labour candidate Karen Shore, making it the closest by-election result since records began in 1945. Speaking after the result was declared, Mr Farage told Sky News that Labour's vote collapsed because of a \"loss of confidence\" and the fact \"no one knows what the prime minister really stands for\". He said working people were fed up with higher taxes and illegal immigration, adding: \"It's a sense of fairness and what's right and what's wrong bordering even on resentment.\" He added: \"We now are the opposition party in the United Kingdom to the Labour Party and the Tories, frankly, are a waste of space.\" Hours after the Runcorn result was declared, several Labour MPs on the left of the party began to blame Sir Keir and policies such as cuts to welfare and winter fuel payments for the result. John McDonnell, who was shadow chancellor under former Labour leader Jeremy Corbyn, described the party's response to the results so far as \"tin-eared\", and said supporters felt the party had \"turned its back on them\". Richard Burgon, the Labour MP for Leeds East, said the Runcorn defeat was \"entirely avoidable\" and \"the direct result of the party leadership's political choices\". And Scottish Labour MP Brian Leishman said the first 10 months of the new Labour government \"haven't been good enough or what the people want\" and added: \"If we don't improve people's living standards then the next government will be an extreme right wing one.\" Asked whether the policy decisions taken by Labour had pushed its voters away, Sir Keir said such choices were necessary to fix the \"broken economy\" he inherited from the Tories.  \"The reason that we took the tough but right decisions in the budget was because we inherited a broken economy,\" he told Sky News. \"Maybe other prime ministers would have walked past that, pretended it wasn't there...I took the choice to make sure our economy was stable.\" He added: \"Yes, they were tough decisions, they were the right decisions. Because of those decisions we are now seeing waiting lists coming down, something people desperately want. \"Because of that, pensioners are now £470 up as of last month, these are really important changes.\" Read more:Reform has put the two traditional parties on noticeFarage toasts by-election success as party wins 'by a gnat's knob' As well as the Runcorn by-election, voters took part in contests to elect more than 1,600 councillors across 23 local authorities on Thursday, along with four regional mayors and two local mayors. Labour is defending 287 council seats, the Conservatives 996, the Liberal Democrats 207 and the Green Party 35, with the remainder held by Independents and other parties. While Labour managed to hold on to its mayors in Doncaster and North Tyneside and for the West of England, Reform won the mayoralty in Greater Lincolnshire with a majority of nearly 40,000 votes. Reform is also hoping to take control of Doncaster Council from Labour - the only local authority Labour has control of in this set of elections. It has also gained control of Staffordshire County Council from the Tories, who previously controlled the council with 53 seats, with Labour on five and four independents."
    },
    {
        "title": "Tory leader apologises to councillors as Reform makes big gains in local elections",
        "description": "Kemi Badenoch has apologised to Tory councillors who lost their seats after Reform made massive gains at the Conservatives' expense in Thursday's local elections.",
        "url": "https://news.sky.com/story/tory-leader-apologises-to-councillors-as-party-faces-major-local-election-losses-13360073",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kemi-badenoch-conservatives_6903759.jpg?20250502171658",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-02 17:15:00",
        "Headline": "The Conservatives have lost control of all the councils they held that were up for election.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Kemi Badenoch has apologised to Tory councillors who lost their seats after Reform made massive gains at the Conservatives' expense in Thursday's local elections. The Conservative leader said she knew it was \"disappointing\" and that she was \"sincerely sorry\", but added: \"We are going to win those seats back - that is my job now.\" The Tories lost overall control of all 18 councils they had been in charge of that were up for election. There were 23 councils in the race in total. Politics latest: Sky News analysis shows Reform surge in estimated national vote A particularly bad loss was Buckinghamshire, which has been under Tory control since 1973 when local government was reorganised. The Conservatives lost overall control by just one seat after losing 29 seats. Reform, which has never run in local elections before, gained eight councils from the Tories, one that had no overall control previously and one from Labour - the only Labour council up for grabs in this election. The Lib Dems won Shropshire from the Tories, as well as Cambridgeshire and Oxfordshire - both of which had no overall control before. \n                  Local election in maps and charts: Reform delivers massive blow to traditional parties\n                 \n                  Reform has put the two traditional parties on notice - and we don't know where this ends\n                 \n                  Runcorn by-election goes to recount as just four votes separate Labour and Reform\n                 The Conservatives had one win, with Paul Bristow being voted in as Cambridgeshire and Peterborough mayor, previously held by Labour. Reform's first major win of the election was the Runcorn and Helsby by-election where Labour lost to Reform by six votes. It was triggered by ex-Labour MP Mike Amesbury resigning after his conviction for punching a constituent. Sir Keir Starmer said he \"gets\" why his party suffered defeat there and the results show \"we must deliver that change ever more quickly, we must go even further\".  Addressing the Conservatives' abysmal results, Ms Badenoch said: \"Other parties may be winning now, but we are going to show that we can deliver and that we are on course and recovering. \"But they [the public] are still not yet ready to trust us,\" she added. \"We have a big job to do to rebuild trust with the public. \"That's the job that the Conservative Party has given me, and I'm going to make sure that we get ourselves back to the place where we are seen as being a credible alternative to Labour.\" Read more:Reform's political earthquake is now shaking our political systemReform wins two new mayoral contests  Ms Badenoch said Labour's election results showed Sir Keir Starmer \"is on course to be a one-term prime minister\". However, when asked if she would still be leader at the next general election, Ms Badenoch dodged the question and said: \"I'm not playing all these questions that the media loves to ask about my future. \"This is not about me.\" She insisted she was the right person to lead the Conservatives, as she was chosen by the party's members. \"I told them it wouldn't be easy, I told them it would require a renewal and rebuilding of our party,\" she said. \"That doesn't happen in six months. I'm trying to do something that no one has ever done before, which is take their party from such a historic defeat back into government in one term.\""
    },
    {
        "title": "Results special: What changes after Nigel Farage's big night?",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>",
        "url": "https://news.sky.com/story/results-special-what-changes-after-nigel-farages-big-night-13359638",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-02 05:15:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈 Sky News' Sam Coates and Politico's Anne McElvoy have a Friday episode to take stock of the by-election, mayoral and local election results so far. Sam's pulled an all-nighter to cover Reform's victory in the Runcorn and Helsby by-election – they won by just six seats. The party won the Greater Lincolnshire mayoralty too. So it's a morning of questions to ponder – how do bigger parties respond to the Reform victories? Could a Starmer visit to Runcorn have secured the few votes needed for victory there? And is Labour focusing on Reform voters at expense of people at the other end of the political spectrum? Plus, with lots of councils that were controlled by the Conservatives still to declare, at what point does someone mention Boris Johnson?"
    },
    {
        "title": "Farage toasts by-election success as party wins 'by a gnat's knob'",
        "description": "It was breakfast time when Nigel Farage told Sky News the Tories were \"toast\" after Reform UK's victory in the Runcorn and Helsby by-election.",
        "url": "https://news.sky.com/story/farage-toasts-by-election-success-as-party-wins-by-a-gnats-knob-13359663",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nigel-farage-jon-craig_6903633.jpg?20250502142406",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-05-02 06:24:00",
        "Headline": "By the time Reform's Sarah Pochin was declared the winner, Nigel Farage had already staged at least two impromptu news conferences in front of the platform.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  It was breakfast time when Nigel Farage told Sky News the Tories were \"toast\" after Reform UK's victory in the Runcorn and Helsby by-election. After a long night of drama, tension, twists and turns at the Widnes Vikings rugby league stadium, Reform UK's candidate Sarah Pochin was declared the winner by just six votes. Yes, six votes! A new record for a parliamentary by-election. And that was after several checks on the ballot papers and one full recount. At first, Labour were judged to be 10 votes ahead. That was, not surprisingly, challenged by Reform UK. Reform beats Labour by six votes; follow Politics latest Next, it was Reform UK who were just four votes ahead. This time Labour issued a challenge and it was shortly before 6am when the result was finally declared by the High Sheriff of Cheshire, Joelle Warren, resplendent in her ceremonial costume. Follow the mayoral election results as they come in By the time she pronounced Ms Pochin the winner, Mr Farage had already staged at least two impromptu news conferences in front of the platform, delaying the declaration even more. In fact, as so often at by-election counts, the delays before the declaration were as annoying as VAR in football. But unlike in football, they lasted for hours, not minutes. It was at 3am that Reform UK challenged the result. That triggered a bundle recount. Then, shortly before 4am, after Reform UK and not Labour had edged in front, acting returning officer Stephen Young ordered a total restart of the counting.  Earlier, right from the moment the polls closed at 10pm, Reform UK sources were telling Sky News they'd won, although they acknowledged the result would be close. One Farage ally told Sky News early on: \"I think it will be within 1,000 votes, either way, but I reckon we will edge it.\" And then he added: \"To use a Farageism: 'We'll win it by a gnat's knob'.\" Despite the crudeness of that prediction, it proved to be accurate, though midway through the count, Labour campaigners sniffed a shock victory and a great escape. Why did Reform pull off their victory? Rachel Reeves' massively unpopular winter fuel payments axe was a major vote loser. Some voters were appalled by the conduct of former Labour MP Mike Amesbury, who brutally assaulted a constituent. Ms Pochin, in a fluent victory speech that suggested she'll be a competent House of Commons performer, declared that the voters of the Runcorn and Helsby constituency had had enough of Tory failures and Labour lies. Then, in a typically ebullient Sky News interview, Mr Farage said: \"Britain is broken.\" He also predicted more wins for his party in local government elections later on Friday. For Labour, there will be a huge inquest into how they came so close to holding the seat and lost by just six votes. Many Labour MPs and party members will condemn Sir Keir Starmer for not bothering to visit the constituency to campaign for their candidate Karen Shore. Mr Farage visited four times, including a lengthy stint on polling day. Say what you like about Mr Farage, and his opponents certainly do, he's a tireless campaigner with a stamina that astounds even members of his inner circle. His relentless tenacity has paid off handsomely. Other party leaders - with the notable exception of Sir Ed Davey - take note. Sir Keir sat on his hands and Kemi Badenoch was invisible too. And they've both paid the price: humiliation. And so, after declaring the Tories are \"toast\", Mr Farage announced he was heading off for a bacon sandwich. Last week at Prime Minister's Questions, Sir Keir said Mr Farage would \"eat the Tory party for breakfast\". But in Runcorn and Helsby - and many other parts of the UK - he's just eaten Labour for breakfast as well."
    },
    {
        "title": "Sky News analysis: Reform surge in estimated national vote with Labour and Tories at all-time low",
        "description": "Based on an analysis of 1,067 of 1,400 voting areas, the current national share estimate puts Reform on 32%.&#160; ",
        "url": "https://news.sky.com/story/sky-news-analysis-reform-surge-in-estimated-national-vote-with-labour-and-tories-at-all-time-low-13360038",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-farage-local-elections_6903816.jpg?20250502174748",
        "type": "Politics",
        "Author": "Michael Thrasher, Sky News election analyst",
        "Date Published": "2025-05-02 16:36:00",
        "Headline": "The current national share estimate puts Reform on 32% - with Labour down to 19% and the Conservatives on 18%.",
        "Content": "By Michael Thrasher, Sky News election analyst  Based on an analysis of 1,067 of 1,400 voting areas, the current national share estimate puts Reform on 32%.   This is the first time that a party other than Conservative or Labour has led at this stage of the votes being counted. Labour is currently placed second on 19% with the Conservatives only one point behind on 18%. This is the lowest total for both parties individually and combined since 1973 when these estimates were first calculated. Politics latest: Farage tells new Reform council's climate and diversity staff to change jobs The Liberal Democrats have 16% with the Greens on 7%. For each cycle of local elections, we collect the votes cast in those elections and then use them to construct a nationwide vote. Normally, this compares the changes in the current year's local vote shares with the picture from four years before when the same councils were voting. \n                  Local election in maps and charts: Reform delivers massive blow to traditional parties\n                 \n                  Reform has put the two traditional parties on notice - and we don't know where this ends\n                 \n                  Results special: What changes after Nigel Farage's big night?\n                 This year, however, we are also comparing the votes cast at last year's general election with those cast in precisely the same areas voting on 1 May. Read more:The political earthquake of Nigel FarageStarmer responds after losing Runcorn  Parliamentary constituencies that cross council boundaries where all or only some electors had a local vote in 2025 are excluded from this analysis. Combining these separate analyses acknowledges that the choices available to voters in local elections are, in some areas, different to the choices available in parliamentary constituencies. On this basis, the current national vote estimate sees Reform up 17 points compared to the general election. Labour falls from 35% to just 19% - with the Conservatives dropping from 24% to 18%. The Liberal Democrats add an extra three percentage points with the Greens unchanged."
    },
    {
        "title": "By-election results show voters are turning their backs on Labour and the Conservatives",
        "description": "In a historic parliamentary by-election, Reform's Sarah Pochin won&#160;Runcorn and Helsby by just six votes, a majority of just 0.02% and a swing to Reform from Labour of 17.4 percentage points.&#160;",
        "url": "https://news.sky.com/story/by-election-results-show-voters-are-turning-their-backs-on-labour-and-the-conservatives-13359656",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sarah-pochin-reform_6903237.jpg?20250502073511",
        "type": "Politics",
        "Author": "Professor Michael Thrasher, Sky News elections analyst",
        "Date Published": "2025-05-02 06:20:00",
        "Headline": "Reform UK has successfully tapped into the public mood of disillusionment and distrust of the two parties that have dominated British politics.",
        "Content": "By Professor Michael Thrasher, Sky News elections analyst  In a historic parliamentary by-election, Reform's Sarah Pochin won Runcorn and Helsby by just six votes, a majority of just 0.02% and a swing to Reform from Labour of 17.4 percentage points.  Labour's loss of its 49th-safest seat was decided by scenes of high drama. The initial count put Labour ahead by just 10 votes. Following a review of ballots, Reform then claimed that they had won by four votes. A full recount followed and the rest is history. Follow local elections latest Recriminations within Labour are certain to follow with tiny campaigning mistakes inflated to huge consequences. Close contests were the order of the night as rival parties, led by Reform, chased down Labour targets. In two council by-elections, Labour retained its seats by a single vote.  Read moreAnalysis: Reform puts two major parties on noticeFollow mayoral election results as they come in Elsewhere, Labour had other close scrapes with defeat. Karen Clark was run close in the race to be North Tyneside's mayor, her winning margin just 444 votes. Ros Jones, the longstanding Labour mayor of Doncaster, was re-elected by a margin of 698 votes over Reform's Alexander Jones. Her victory speech referenced the need for her party leader to listen more to voters. Labour faced a real struggle to retain the mayoralty for the West of England Combined Authority following the arrest and suspension of Dan Norris, the current mayor. Over 200,000 votes were cast, but just 10,000 separated the three leading candidates, Labour, Reform, and Green, respectively. Helen Godwin scraped home for Labour, but she won with just 25% of the vote.th But it was Reform that secured victory in the race to be the first Greater Lincolnshire mayor. Both major parties have given support to the extension of elected mayors governing combined local authorities. Now, it is Reform's Andrea Jenkyns, a former Conservative MP, who will give her new party a much stronger voice in local government. But she will be joined by hundreds of new Reform councillors whose election will be confirmed later on Friday.  Tories' grip of English shires is broken In Northumberland, the Conservatives lost control of the council with Reform now in second place. Counting in Staffordshire, which the Conservatives won easily in the 2021 election as it rode the post-COVID bounce, showed Reform winning all the seats in Tamworth. With similar results sure to appear throughout Friday, the spotlight will turn on Conservative leader Kemi Badenoch to explain why so many of her councillors have been defeated and the party has seen its grip of the English shires broken. Worse may follow if the Liberal Democrats build on the momentum of the last general election and now capture Conservative councils. There is a chance the Conservatives will be overtaken by the Liberal Democrats as the second party of local government in terms of council control. But the headlines belong to Reform. It has successfully tapped into the public mood of disillusionment and distrust of the two parties that have dominated British politics. Friday's counting of local election votes will show that many voters have turned their backs on both Labour and the Conservatives."
    },
    {
        "title": "Grand Theft Auto VI release delayed",
        "description": "Grand Theft Auto VI, the most hotly anticipated title in gaming history, has been delayed.",
        "url": "https://news.sky.com/story/grand-theft-auto-vi-release-delayed-13359923",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-money-blog-gta_6879575.jpg?20250408092611",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-02 14:09:00",
        "Headline": "Rockstar Games first unveiled the trailer for Grand Theft Auto VI in December 2023, set to Tom Petty's Love Is a Long Road. The video was watched more than 100 million times in 24 hours.",
        "Content": "Grand Theft Auto VI, the most hotly anticipated title in gaming history, has been delayed. Take-Two Interactive pushed the release of the blockbuster title to May 2026 on Friday. The video game was previously expected to be released in autumn this year and is expected to be an instant hit with billions in sales every year, according to analysts. Its predecessor, Grand Theft Auto V, is one of the best-selling video games of all time, selling more than 200 million copies since its release in 2013. \"With every game we have released, the goal has always been to try and exceed your expectations, and Grand Theft Auto VI is no exception,\" said developer Rockstar Games in a statement posted on social media. \"We hope you understand that we need this extra time to deliver at the level of quality you expect and deserve.\" After the announcement, publisher Take-Two's share prices tumbled by 9%. \n                  BAFTA Games Awards: Full list of winners\n                 \n                  BAFTA Games Awards: Astro Bot tops leaderboard - with psychological horror close behind\n                 \n                  Expert predicts GTA VI will cost $100 and believes gamers will snap it up without complaint\n                 \"We support fully Rockstar Games taking additional time to realize their creative vision for Grand Theft Auto VI, which promises to be a groundbreaking blockbuster entertainment experience,\" said Take-Two chief executive Strauss Zelnick.  Rockstar Games first unveiled the trailer for Grand Theft Auto VI in December 2023, set to Tom Petty's Love Is a Long Road. The video was watched more than 100 million times in 24 hours. Read more from Sky News:NHS may offer weight loss jabs over counterTrump's national security adviser to leave roleNorth Korean hacker caught red-handed It confirmed the game's return to Vice City and introduced the game's first female lead, Lucia, hinting at a modern-day Bonnie-and-Clyde duo. GTA VI was expected to drive growth in the video game industry this year after a troubling period. Rising production costs and growing expectations around games mean many titles have been delayed, causing financial problems for studios and frustration for players. During the pandemic, when millions more people began playing video games, studio sizes swelled. Once the lockdowns ended, however, demand dropped and the industry now faces an employment crisis with redundancies at studios around Britain and the world."
    },
    {
        "title": "TikTok fined millions for illegally sending users' data to China",
        "description": "TikTok has been fined &#8364;530m (&#163;452m) because it was illegally sending user data to China, Ireland's privacy watchdog said on Friday.",
        "url": "https://news.sky.com/story/tiktok-fined-millions-for-illegally-sending-users-data-to-china-13359869",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-tiktok-video-app_6828276.jpg?20250214042558",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-02 12:49:00",
        "Headline": "TikTok plans to lodge an appeal and says the investigation focused on a \"select period\" and \"does not reflect the safeguards now in place\".",
        "Content": "TikTok has been fined €530m (£452m) because it was illegally sending user data to China, Ireland's privacy watchdog said on Friday. Ireland's Data Protection Commission found the social media app's data transfers to China broke strict data privacy rules in the EU. It also fined the company for not being transparent with users about how their data was being processed. TikTok has been ordered to comply with the rules within six months. The Data Protection Commission is TikTok's powerful lead regulator in the EU because TikTok's European headquarters are based in Dublin. \"TikTok failed to verify, guarantee and demonstrate that the personal data of [European] users, remotely accessed by staff in China, was afforded a level of protection essentially equivalent to that guaranteed within the EU,\" Deputy Commissioner Graham Doyle said in a statement.  TikTok plans to lodge an appeal and said the decision focused on a \"select period\" that ended in May 2023 and \"does not reflect the safeguards now in place\". It specifically referred to a data localisation enterprise called Project Clover which saw three new data centres built in Europe.\"The facts are that Project Clover has some of the most stringent data protections anywhere in the industry, including unprecedented independent oversight by NCC Group, a leading European cybersecurity firm,\" said Christine Grahn, TikTok's European head of public policy and government relations. Read more from Sky News:NHS may offer weight loss jabs over counterTrump's national security adviser to leave roleNorth Korean hacker caught red-handed TikTok's parent company is based in China and it has been under scrutiny in the EU over how it handles users' data. There have long been concerns, also voiced by US politicians, over how Chinese authorities could access and use that data. The watchdog said TikTok failed to address \"potential access by Chinese authorities\" to European users' personal data.  Chinese laws justifying that access, on grounds like anti-terrorism, counter-espionage, cybersecurity and national intelligence, were identified as \"materially diverging\" from EU standards. Ms Grahn said TikTok has \"has never received a request for European user data from the Chinese authorities, and has never provided European user data to them.\" Under the EU rules, known as the General Data Protection Regulation, European user data can only be transferred outside of the bloc if there are safeguards in place to ensure the same level of protection. Ms Grahn said TikTok was being \"singled out\" despite using the \"same legal mechanisms\" that thousands of other companies in Europe do. The investigation, which opened in September 2021, also found TikTok's privacy policy at the time did not name third countries, including China, where user data was transferred. The watchdog said the policy, which has since been updated, failed to explain that data processing involved \"remote access to personal data stored in Singapore and the United States by personnel based in China\"."
    },
    {
        "title": "North Korean hacker who tried to get a job at US tech company caught red-handed - here's how",
        "description": "A North Korean hacker who attempted to infiltrate the ranks of a US tech company has been caught red-handed.",
        "url": "https://news.sky.com/story/north-korean-hacker-who-tried-to-get-a-job-at-us-tech-company-caught-red-handed-heres-how-13359599",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-cybercrime-hacker-hacking_6840137.jpg?20250226113306",
        "type": "Technology",
        "Author": "Connor Sephton",
        "Date Published": "2025-05-02 00:10:00",
        "Headline": "A series of red flags emerged through the interview process - with the fraudster's voice changing repeatedly during a Zoom call.",
        "Content": "\n          News reporter\n              @ConnorSephton\n A North Korean hacker who attempted to infiltrate the ranks of a US tech company has been caught red-handed. He had applied for an engineering role at the Kraken cryptocurrency exchange, which knew he was a malicious actor from the very start. But instead of rejecting his CV, executives allowed him to advance through the recruitment process so they could gather intelligence about his tactics.  The first red flag emerged when the hacker joined a video call using a different name to the one on his resume, with his voice occasionally switching throughout the interview. It was also discovered that the dodgy candidate's email address was linked to a large network of fake identities and aliases used by a hacking group. Forensic examination of his ID showed that it appeared to have been altered - and may have featured details from victims of identity theft. Traps were also set in the final interview, when the hacker was asked to verify their location and recommend nice restaurants in the city they claimed to live in. \n                  Grand Theft Auto VI release delayed\n                 \n                  TikTok fined millions for illegally sending users' data to China\n                 \n                  iPhones sold in US will no longer come from China - as Apple reveals impact of Trump's tariffs\n                 Kraken said this caused the candidate to unravel - and they were unable to convincingly answer simple questions because they were flustered and caught off guard. \"By the end of the interview, the truth was clear: this was not a legitimate applicant, but an imposter attempting to infiltrate our systems,\" the company added. Read more tech news:M&S pauses recruitment amid cyber attackUK heading for 'climate disaster'  Its chief security officer Nick Percoco has warned state-sponsored attacks are a \"global threat\" - and while some hackers break in, others try to walk through the front door. Although artificial intelligence is making it easier to deceive businesses, he doesn't believe this technology is foolproof, as real-time verification tests can often wrong-foot fraudsters. Research from the Google Threat Intelligence Group suggests this is a growing problem - with North Korean IT workers gaining employment at major companies in the US and Europe. Their salaries help generate revenue for the secretive state - and in some cases, malicious actors also extort their employers by threatening to release commercially sensitive information."
    },
    {
        "title": "iPhones sold in US will no longer come from China - as Apple reveals impact of Trump's tariffs",
        "description": "Apple says devices sold in the US will no longer come from China, as the tech giant tries to mitigate the impact of Donald Trump's tariffs.",
        "url": "https://news.sky.com/story/iphones-sold-in-us-will-no-longer-come-from-china-as-apple-reveals-impact-of-trumps-tariffs-13359607",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-iphone-apple_6903125.jpg?20250502024444",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-02 01:37:00",
        "Headline": "Apple's reliance on Chinese factories to manufacture its iPhones meant the company was far more exposed to the impact of Trump's trade war than others.",
        "Content": "Apple says devices sold in the US will no longer come from China, as the tech giant tries to mitigate the impact of Donald Trump's tariffs. Most iPhones will be sourced from India instead, with iPads coming from Vietnam, to prevent dramatic price rises for American consumers. Unveiling financial results from January to March, the company said the US president's escalating trade war has had a limited impact on its performance so far. However, Apple CEO Tim Cook believes the tariffs will add £677m in costs during the current quarter - assuming Trump's policies don't change.  Revenue for the first three months of the year stood at £71.8bn, with earnings of £18.6bn also beating analyst expectations. High demand for iPhones during this period may have been driven by US shoppers rushing to make purchases before the new tariffs came into force. But the full impact of any panic buying will only emerge when Apple reports its results from April to June later in the year. \n                  Apple and Meta fined millions by EU over competition law\n                 \n                  'Cloak of secrecy' over Apple and Home Office showdown must be removed, US politicians tell tribunal\n                 \n                  Apple vs Home Office encryption court battle must be held in public, say MPs\n                 Apple's reliance on Chinese factories to manufacture its iPhones meant the company was far more exposed to the impact of Trump's trade war than others. Read more from Sky News:NHS may offer weight loss jabs over counterTrump's national security adviser to leave roleNorth Korean hacker caught red-handed  After the president unveiled plans to impose reciprocal tariffs on dozens of countries - now largely paused for 90 days - Apple's stock plunged by 23%, wiping out £582bn of value. While its share price has recovered slightly, it remains 5% lower than before \"Liberation Day\". Growing tensions between Washington and Beijing are also having an impact on Apple's sales in China, which fell 2.3% between January and March.  Addressing the planned changes to manufacturing, Mr Cook added: \"We have a complex supply chain. There's always risk in the supply chain. What we learned some time ago was that having everything in one location had too much risk with it.\" Devices sold outside of the US will continue to be made in China."
    },
    {
        "title": "Liverpool goal in title decider caused tremor on Richter scale",
        "description": "Liverpool fans' reaction to their second goal in the Premier League title-clinching win against Tottenham caused a tremor on the Richter scale, scientists have revealed.&#160;",
        "url": "https://news.sky.com/story/liverpool-goal-in-title-decider-caused-tremor-on-richter-scale-13359699",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-alexis-mac-allister_6903451.jpg?20250502114459",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-02 08:08:00",
        "Headline": "Not only did the result secure Liverpool the Premier League title at Anfield on Sunday, Alexis Mac Allister's goal also registered 1.74 on the Richter scale - just shy of the 2.0 needed for a minor earthquake.",
        "Content": "Liverpool fans' reaction to their second goal in the Premier League title-clinching win against Tottenham caused a tremor on the Richter scale, scientists have revealed.  Spurs scored the first goal in Sunday's game at Anfield - but Liverpool equalised in the 24th minute and eventually won 5-1. Not only did the result secure Liverpool's 20th league title, Alexis Mac Allister's first goal also registered 1.74 on the Richter scale - just shy of the 2.0 needed for a minor earthquake. Scientists from the University of Liverpool were on the ground at the game and correlated the seismic signals they recorded with moments of excitement throughout the game. Read more from Sky NewsEnglish FA to ban transgender womenWorld Cup tickets being sold for £46kFootballer jailed over death of cyclist The data reveals Mohamed Salah's goal was the second-largest seismic activity - registering 1.60 on the scale. The third was Destiny Udogie's own goal in the second half - at 1.35 - and fourth was Cody Gakpo's strike in the first - at 1.03. Dr Farnaz Kamranzad, of the university's Department of Earth, Ocean, and Environmental Sciences, said: \"Who knew that football fans could generate seismic energy? This experiment shows us that science is everywhere, even hidden beneath the roar of a goal at Anfield! \"Incredibly, we recorded six seismic events with equivalent Richter magnitudes from 0.7 to 1.75. \"These were small tremors, not strong enough to be felt in the stands, but powerful enough to leave a clear and lasting mark at Anfield. \"Every cheer, every celebration, leaves a trace beneath our feet, a seismic fingerprint of collective joy, written into the Earth's memory long after the final whistle!\"  His colleague Dr Antoine Septier added: \"The experiment was an exciting experience, demonstrating that science can be both engaging and accessible to the public. \"I hope that our work inspires a new generation of seismologists and fosters a broader appreciation for the scientific process.\" The result means Liverpool can now claim to be the most successful team in English men's football history, with the club level with Manchester United on 20 league titles but ahead of their rivals in terms of European Cup triumphs, six to three."
    },
    {
        "title": "Comedian and actor Russell Brand bailed after appearing in court charged with rape and sexual assault",
        "description": "Russell Brand has been granted bail after appearing in court charged with sexual offences including rape.",
        "url": "https://news.sky.com/story/comedian-and-actor-russell-brand-bailed-after-appearing-in-court-charged-with-rape-and-sexual-assault-13359696",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-russell-brand-leaves_6903434.jpg?20250502112202",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-05-02 07:54:00",
        "Headline": "Russell Brand has made his first court appearance after being charged with rape, sexual assault and indecent assault. He has always denied having non-consensual sex.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  Russell Brand has been granted bail after appearing in court charged with sexual offences including rape. During the brief hearing at Westminster Magistrates' Court, the 49-year-old spoke only to confirm his name, date of birth, and address, also confirming to the judge that he understood his bail conditions. Brand, who has been living in the US, was charged by post last month with one count each of rape, indecent assault and oral rape - as well as two counts of sexual assault - in connection with incidents involving four separate women between 1999 and 2005. The allegations were first made in a joint investigation by The Sunday Times, The Times and Channel 4 Dispatches in September 2023. The comedian, actor and author has denied the accusations and said he has \"never engaged in non-consensual activity\". Appearing before Senior District Judge Paul Goldspring, Brand stood to confirm his name and address. He then sat down while the charges were read to the court. Brand is charged with the rape of a woman in 1999 in the Bournemouth area. She alleges that after meeting Brand at a theatrical performance and chatting to him later in her hotel room, she returned from the toilet to find he'd removed some of his clothes. She claims he asked her to take photos of him, and then raped her. The court also heard of another of Brand's alleged victims, who has accused him of indecently assaulting her in 2001 by \"grabbing her arm and dragging her towards a male toilet\" at a TV station. Brand is accused of the oral rape and sexual assault of a woman he met in 2004 in London. He is accused of grabbing her breasts before allegedly pulling her into a toilet. The final complainant is a radio worker who has accused Brand of sexually assaulting her between 2004 and 2005 by \"kissing\" and \"grabbing\" her breasts and buttocks. The judge referred the case up to the Central Criminal Court - informally known as the Old Bailey. Brand was asked to supply both his US and UK addresses to the court. When asked if he understood his bail conditions, he replied, \"Yes\". The case was adjourned and Brand, of Hambleden, Buckinghamshire, was told he must appear at the Old Bailey on 30 May."
    },
    {
        "title": "Grand Theft Auto VI release delayed",
        "description": "Grand Theft Auto VI, the most hotly anticipated title in gaming history, has been delayed.",
        "url": "https://news.sky.com/story/grand-theft-auto-vi-release-delayed-13359923",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-money-blog-gta_6879575.jpg?20250408092611",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-02 14:09:00",
        "Headline": "Rockstar Games first unveiled the trailer for Grand Theft Auto VI in December 2023, set to Tom Petty's Love Is a Long Road. The video was watched more than 100 million times in 24 hours.",
        "Content": "Grand Theft Auto VI, the most hotly anticipated title in gaming history, has been delayed. Take-Two Interactive pushed the release of the blockbuster title to May 2026 on Friday. The video game was previously expected to be released in autumn this year and is expected to be an instant hit with billions in sales every year, according to analysts. Its predecessor, Grand Theft Auto V, is one of the best-selling video games of all time, selling more than 200 million copies since its release in 2013. \"With every game we have released, the goal has always been to try and exceed your expectations, and Grand Theft Auto VI is no exception,\" said developer Rockstar Games in a statement posted on social media. \"We hope you understand that we need this extra time to deliver at the level of quality you expect and deserve.\" After the announcement, publisher Take-Two's share prices tumbled by 9%. \n                  BAFTA Games Awards: Full list of winners\n                 \n                  BAFTA Games Awards: Astro Bot tops leaderboard - with psychological horror close behind\n                 \n                  Expert predicts GTA VI will cost $100 and believes gamers will snap it up without complaint\n                 \"We support fully Rockstar Games taking additional time to realize their creative vision for Grand Theft Auto VI, which promises to be a groundbreaking blockbuster entertainment experience,\" said Take-Two chief executive Strauss Zelnick.  Rockstar Games first unveiled the trailer for Grand Theft Auto VI in December 2023, set to Tom Petty's Love Is a Long Road. The video was watched more than 100 million times in 24 hours. Read more from Sky News:NHS may offer weight loss jabs over counterTrump's national security adviser to leave roleNorth Korean hacker caught red-handed It confirmed the game's return to Vice City and introduced the game's first female lead, Lucia, hinting at a modern-day Bonnie-and-Clyde duo. GTA VI was expected to drive growth in the video game industry this year after a troubling period. Rising production costs and growing expectations around games mean many titles have been delayed, causing financial problems for studios and frustration for players. During the pandemic, when millions more people began playing video games, studio sizes swelled. Once the lockdowns ended, however, demand dropped and the industry now faces an employment crisis with redundancies at studios around Britain and the world."
    },
    {
        "title": "I Kissed A Girl musician Jill Sobule dies in house fire",
        "description": "Jill Sobule, the award-winning singer-songwriter behind one of the first LGBTQ+ songs to hit the mainstream - I Kissed A Girl - has died in a house fire.",
        "url": "https://news.sky.com/story/i-kissed-a-girl-musician-jill-sobule-dies-in-house-fire-13359822",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-1997-jill-sobule_6903307.jpg?20250502132615",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-02 11:45:00",
        "Headline": "Jill Sobule is described as \"a force of nature and human rights advocate,\" whose \"music is woven into our culture\".",
        "Content": "Jill Sobule, the award-winning singer-songwriter behind one of the first LGBTQ+ songs to hit the mainstream - I Kissed A Girl - has died in a house fire. Her death in Woodbury, Minnesota, was announced by her publicist. It was not immediately clear how the fire started. The 66-year-old's manager, John Porter, called her \"a force of nature and human rights advocate,\" whose \"music is woven into our culture\". He said in a statement: \"I was having so much fun working with her. I lost a client and a friend today. I hope her music, memory, and legacy continue to live on and inspire others.\" The White Lotus star Carrie Coon posted on social media: \"Jill Sobule was so special. Heartbreaking news.\" Sharing a photo of herself with Sobule from 2001, singer-songwriter Tracy Chapman wrote on X: \"We are deeply saddened to hear of the tragic passing of Jill Sobule. Let us listen to her music to honor the wonderful singer-songwriter she was.\" Sobule had been due to play a gig in Denver on Friday night, but the event will now become a tribute to her life. A formal memorial will be held later this summer. \n                  Video captures ten-year-old boy driving stolen car across 'crowded' school playground\n                 \n                  Family infected with roundworms that can travel to brain after eating undercooked bear kebabs\n                 \n                  Baseball team accused of fat-shaming after naming mascot 'Ozempig' after weight-loss drug\n                 Over three decades of performing and recording, the singer-songwriter released 12 albums, exploring complex topics including the death penalty, anorexia nervosa, reproduction and LGBTQ+ issues. Her first album, Things Here Are Different, was released in 1990. Five years later, she received widespread attention for her hit singles, Supermodel, from the movie Clueless, and I Kissed A Girl, which, despite being banned on several southern radio stations, made it into the Billboard Top 20 in the US. In 2008, Katy Perry's worldwide hit I Kissed A Girl - which used the same title but was not a cover version - created a renewed interest in her track. Sobule also starred in an autobiographical off-Broadway musical featuring songs and stories about her life. An early adopter of crowdfunding, in 2008, after two major record companies dumped her and two indie labels went bankrupt beneath her, she raised tens of thousands of dollars from fans so she could make a new album. A shy child, Sobule was born in Denver, Colorado, on 16 January 1959. She would go on to perform with stars including Neil Young, Cyndi Lauper and Billy Bragg, and said she would \"wing\" her frequent live shows, never preparing a set list. She made a cameo on an episode of The Simpsons in 2019. In a 2023 interview with The Associated Press, she said: \"In a good way, I feel like I'm still a rookie. There's so much more to do and I haven't done my best yet.\" She is survived by her brother and sister-in-law, James and Mary Ellen Sobule, along with her nephews and cousins."
    }
]